{
  "source_file": "amp-20241231.htm",
  "form_type": "10-K",
  "item1_clean": "investment products are primarily offered through third parties, though we also provide our asset management products through our advisor network, direct retail and through our institutional sales force. Our underlying asset management philosophy is rooted in delivering consistently strong, competitive investment performance.\nWe are positioned to grow our assets under management and advisement and strengthen our asset management offerings to existing and new clients. We benefit from key strategic relationships we have established and have a strong institutional presence. Our asset management capabilities are designed to address mature markets in the U.S. and Europe while expanding into new global and emerging markets. We have expanded beyond our traditional strengths in the U.S. and the United Kingdom (“U.K.”) to serve more clients and gather assets worldwide. We continue to pursue opportunities to leverage the collective capabilities of our global asset management business in order to enhance our investment solutions and to develop new solutions that are responsive to client demand in an increasingly complex and competitive marketplace.\nHistory and Development\nOur company has provided solutions to help clients confidently achieve their financial objectives for 130 years. Our earliest predecessor company, Investors Syndicate, was founded in 1894 to provide face-amount certificates to consumers. In 1983, our company was formed as a Delaware corporation in connection with American Express’ acquisition of IDS Financial Services from Alleghany Corporation. We changed our name to “American Express Financial Corporation” (“AEFC”) and began marketing our\nAmeriprise Financial, Inc.\nproducts and services under the American Express brand in 1994. In 2005, AEFC spun off from American Express to form Ameriprise Financial, Inc.\nWe have grown both organically through the products and services we provide, as well as inorganically through strategic acquisitions. This has allowed us to significantly enhance the scale, performance, and product offerings of our brokerage, financial planning, managed accounts, retail mutual fund and institutional asset management businesses to best serve clients. Our acquisitions have included, among others, Threadneedle Asset Management Holdings, H&R Block Financial Advisors, Inc., J. & W. Seligman & Co. Incorporated, Columbia Management, Investment Professionals, Inc., and, most recently, BMO Financial Group’s European-based asset management business. Beyond traditional acquisitions, we pursue other strategies to grow our wealth management business such as experienced advisor recruiting, practice acquisitions, advisor loans, and partnerships with banks and credit unions.\nOver the years, we have also sought to optimize the organizational structure in which we offer certain banking products. In May 2019, we converted Ameriprise National Trust Bank to Ameriprise Bank, FSB (“Ameriprise Bank”) to expand the products and services we provide directly to our clients. At that time, Ameriprise Financial became a savings and loan holding company subject to regulation, supervision and examination by the Board of Governors for the Federal Reserve System (“FRB”), and Ameriprise Financial elected to be classified as a financial holding company subject to applicable regulation under the Bank Holding Company Act of 1956, as amended.\nOur Business Mix and Integrated Model\nThe financial results from the businesses underlying our go-to-market approaches are reflected in our operating segments:\nAdvice & Wealth Management;\nRetirement & Protection Solutions; and\nAmeriprise Financial, Inc.\nWe continue to execute on our strategy to grow our Advice & Wealth Management business with complementary Asset Management and Retirement & Protection Solutions businesses. Our integrated model leverages key business linkages to drive growth and consistency across market cycles. The following chart shows our current business mix represented by the contributions of each segment to our pretax adjusted operating earnings (excluding Corporate & Other segment) as well as a historical comparison.\nOur Principal Brands\nOur diversified products and services are offered through our brands:\nAmeriprise Financial\nbrand as our enterprise brand, as well as the name of our advisor network and certain of our retail products and services.\nColumbia Threadneedle\nColumbia Threadneedle Investments\nbrands represent the combined capabilities, resources and reach of Columbia Management Investment Advisers, LLC (including its subsidiaries, “Columbia Management”), other U.S.-based entities and Threadneedle. The foreign operations of Ameriprise Financial, Inc. are conducted primarily through Columbia Threadneedle Investments UK International Limited, TAM UK International Holdings Limited and Ameriprise Asset Management Holdings Singapore (Pte.) Ltd. and their respective subsidiaries (collectively, “Threadneedle”).\nbrand for our annuity and protection products issued by RiverSource Life Insurance Company (“RiverSource Life”) and RiverSource Life Insurance Co. of New York (“RiverSource Life of NY” and, together with RiverSource Life, the “RiverSource Life companies” or “RiverSource”).\nOur Segments - Advice & Wealth Management\nWe provide financial planning and advice, as well as full-service brokerage services, primarily to retail clients through our financial advisors. These services are centered on long-term, personal relationships between our advisors and our clients and focus on helping clients confidently achieve their financial goals. Our financial advisors provide a distinctive, holistic approach to financial planning and have access to a broad selection of both our and other providers’ products to help clients meet their financial needs and goals. Banking, lending, and cash management solutions help clients establish financial flexibility while planning for both short and long-term needs. As part of our goal-based approach to financial advice, our advisors help clients actively manage investing, saving and spending so they have a more complete financial picture.\nAmeriprise Financial, Inc.\nA significant portion of revenues in this segment are fee-based and driven by the level of client assets, which is impacted by both market movements and net flows. We also earn revenue and income through other sources, including the following:\nWe earn net investment income on owned assets from Ameriprise Certificate Company (“ACC”) and Ameriprise Bank, both wholly owned subsidiaries of Ameriprise.\nWe earn financial planning fees as well as transaction and other fees.\nWe earn distribution fees for providing non-affiliated products and intersegment revenues for providing our affiliated products and services to our retail clients. Intersegment expenses for this segment include investment management services provided by our Asset Management segment. All intersegment activity is eliminated in our consolidated results.\nOur Financial Advisor Platform\nWith more than 10,000 advisors, we are one of the top branded advisor platforms in the U.S. market. Advisors can choose to affiliate with us in multiple ways as noted below, and each option offers different levels of support and compensation.\nWe offer the following products and services through our Advice & Wealth Management segment:\nFinancial planning and advice services to provide personalized financial planning and financial solutions for which we charge fees and may receive sales commissions for selling products that aid in our clients’ plans.\nDiscretionary and non-discretionary investment advisory accounts (also known as managed accounts) for which we receive fees based on the assets held in that account, as well as related fees or costs associated with the underlying securities held in that account.\nBrokerage products and services for retail and institutional clients.\nCash management and banking products, including brokerage sweep programs, cash management accounts, savings accounts, residential mortgage loans, credit cards, margin loans and pledged asset lines of credit.\nFace-amount certificates through ACC.\nMutual fund offerings from our Columbia funds as well as approximately 130 unaffiliated mutual fund families, representing approximately 2,125 mutual funds on our brokerage platform for which mutual fund families and other companies generally pay us a portion of the revenue generated from sales of those funds, administrative fees, and fees from the ongoing management attributable to our clients’ ownership in the fund.\nInsurance and annuities products from both RiverSource Life companies as well as third parties, and we receive a portion of the revenue generated from the sale of unaffiliated products and certain administrative fees.\nOur Segments - Asset Management\nThrough Columbia Threadneedle, we provide investment management, advice and products to retail, high net worth and institutional clients on a global scale.\nColumbia Management primarily provides products and services in the U.S. Threadneedle primarily provides products and services internationally.\nAmeriprise Financial, Inc.\nRevenues in the Asset Management segment are primarily earned based on managed asset balances, which are impacted by market movements, net asset flows, asset allocation and product mix. We may also earn performance fees from certain accounts where investment performance meets or exceeds certain pre-identified targets. As of December 31, 2024, our Asset Management segment had $681 billion in managed and advised assets.\nOur Asset Management segment also provides asset management services for Ameriprise Financial subsidiaries. The fees for such services are reflected within the Asset Management segment results through intersegment transfer pricing. Intersegment expenses for this segment include distribution expenses for services provided by our Advice & Wealth Management and Retirement & Protection Solutions segments. All intersegment activity is eliminated in our consolidated results.\nManaged assets include external client assets and owned assets. Managed external client assets include client assets for which we provide investment management services, such as the assets of the\nColumbia Threadneedle Investments\nInvestment Management Capabilities and Products\nOur investment management business has a presence in 16 key markets globally, including France, Germany, Luxembourg, the Netherlands, Singapore, the U.K. and the U.S.\nOur investment management capabilities and products span a broad range of asset classes and investment styles to meet a variety of client needs with our $645 billion in assets under management diversified across geographies, strategies and clients as depicted in the graphic below.\nAmeriprise Financial, Inc.\nWe offer or make available the following products and services through our Asset Management segment with a range of investment strategies across these different vehicles and accounts:\nU.S. registered funds through the\nfamily of funds, including retail mutual funds, exchange-traded funds and U.S. closed-end funds and variable insurance trust funds (“VIT Funds”) on which we earn management fees based on the underlying value of the assets and service fees.\nNon-U.S. retail focused funds through Columbia Threadneedle, which include different risk-return options across regions, markets, asset classes and product structures, including retail funds that are similar to U.S. mutual funds (such as Undertakings for the Collective Investment in Transferable Securities (“UCITS”) funds organized as Luxembourg-based investment companies with variable capital (“SICAVs”) and Irish and U.K. open-end investment companies (“OEICs”)). In addition, this also includes a range of listed Investment Trusts.\nEuropean-based pooled investment funds designed for pensions, insurance companies and other institutional investors seeking solutions for liability or balance sheet asset management (“Liability Driven Invest",
  "item7_clean": "Years Ended December 31,\nAdjusted operating earnings\nTotal Ameriprise Financial, Inc. shareholders’ equity\nLess: AOCI, net of tax\nTotal Ameriprise Financial, Inc. shareholders’ equity, excluding AOCI\nLess: Equity impacts attributable to CIEs\nAdjusted operating equity\nReturn on equity, excluding AOCI\nAdjusted operating return on equity, excluding AOCI\nAdjustments reflect the sum of after-tax net realized investment gains/losses, net of the reinsurance accrual; the market impact on non-traditional long-duration products (including variable and fixed deferred annuity contracts and UL insurance contracts), net of hedges and the reinsurance accrual; mean reversion related impacts; block transfer reinsurance transaction impacts; the market impact of hedges to offset interest rate and currency changes on unrealized gains or losses for certain investments; gain or loss on disposal of a business that is not considered discontinued operations; integration and restructuring charges; income (loss) from discontinued operations; and net income (loss) from consolidated investment entities. After-tax is calculated using the statutory tax rate of 21%.\nAdjusted operating return on equity, excluding accumulated other comprehensive income (“AOCI”) is calculated using adjusted operating earnings in the numerator and Ameriprise Financial shareholders’ equity, excluding AOCI and the impact of consolidating investment entities using a five-point average of quarter-end equity in the denominator. After-tax is calculated using the statutory rate of 21%.\nCritical Accounting Estimates\nThe accounting and reporting policies that we use affect our Consolidated Financial Statements. Certain of our accounting and reporting policies are critical to an understanding of our consolidated results of operations and financial condition and, in some cases, the application of these policies can be significantly affected by the estimates, judgments and assumptions made by management during the preparation of our Consolidated Financial Statements. The accounting and reporting policies and estimates we have identified as fundamental to a full understanding of our consolidated results of operations and financial condition are described below. See Note 2 to our Consolidated Financial Statements for further information about our accounting policies.\nValuation of Investments\nThe most significant component of our investments is our Available-for-Sale securities, which we carry at fair value within our Consolidated Balance Sheets. See Note 16 to our Consolidated Financial Statements for discussion of the fair value of our Available-for-Sale securities. Financial markets are subject to significant movements in valuation and liquidity, which can impact our ability to liquidate and the selling price that can be realized for our securities and increases the use of judgment in determining the estimated fair value of certain investments. We are unable to predict impacts and determine sensitivities in reported amounts reflecting such market movements on our aggregate Available-for-Sale portfolio. Changes to these assumptions do not occur in isolation and it is impracticable to predict such impacts at the individual security unit of measure which are predominately Level 2 fair value and based on observable inputs.\nMarket Risk Benefits\nMarket risk benefits are contracts or contract features that both provide protection to the contractholder from other-than-nominal capital market risk and expose us to other-than-nominal capital market risk. Market risk benefits include certain contract features on variable annuity products that provide minimum guarantees to policyholders. Guarantees accounted for as market risk benefits include guaranteed minimum death benefit (“GMDB”), guaranteed minimum income benefit (“GMIB”), guaranteed minimum withdrawal benefit (“GMWB”) and guaranteed minimum accumulation benefit (“GMAB”).\nWe have approximately $86 billion of variable annuity account value that has been issued over a period of more than fifty years. The diversified variable annuity block consists of $43 billion of account value with no living benefit guarantees and $43 billion of account value with living benefit guarantees, primarily GMWB provisions. The business is predominately issued through the\nAmeriprise Financial\nadvisor network. The majority of the variable annuity contracts currently offered by us contain GMDB provisions. We also previously offered contracts containing GMWB, GMAB or GMIB provisions. See Note 13 to our Consolidated Financial Statements for further discussion of our variable annuity contracts.\nAmeriprise Financial, Inc.\nIn determining the assets or liabilities for market risk benefits, we project these benefits and contract assessments using actuarial models to simulate various equity market scenarios. Significant assumptions made in projecting future benefits and assessments relate to customer asset value growth rates, mortality, surrenders (also referred to as persistency), benefit utilization and investment margins. Management reviews, and where appropriate, adjusts its assumptions each quarter. Unless management identifies a material deviation over the course of quarterly monitoring, management reviews and updates these assumptions annually in the third quarter of each year.\nIn addition, the valuation of market risk benefits is impacted by an estimate of our nonperformance risk adjustment. This estimate includes a spread over the U.S. Treasury curve as of the balance sheet date. As our estimate of this spread widens or tightens, the liability will decrease or increase, respectively. The change in fair value due to changes in our nonperformance risk is recorded in other comprehensive income.\nRegarding the exposure to variable annuity living benefit guarantees, changes to reserves due to behavioral risk are driven by changes in policyholder surrenders and utilization of guaranteed withdrawal benefits. We have extensive experience studies and analysis to monitor changes and trends in policyholder behavior. A significant volume of company-specific policyholder experience data is available and provides management with the ability to regularly analyze policyholder behavior. On a monthly basis, actual surrender and benefit utilization experience is compared to expectations. Experience data includes detailed policy information providing the opportunity to review impacts of multiple variables. The ability to analyze differences in experience, such as presence of a living benefit rider, existence of surrender charges, and tax qualifications provide us an effective approach in detecting changes in policyholder behavior.\nAt least annually, we perform a thorough policyholder behavior analysis to validate the assumptions included in our market risk benefit reserves. The variable annuity assumptions and resulting reserve computations reflect multiple policyholder variables. Differentiation in assumptions by policyholder age, existence of surrender charges, guaranteed withdrawal utilization, and tax qualification are examples of factors recognized in establishing management’s assumptions used in market risk benefit calculations. The extensive data derived from our variable annuity block informs management in confirming previous assumptions and revising the variable annuity behavior assumptions. Changes in assumptions are governed by a review and approval process to ensure an appropriate measurement of all impacted financial statement balances. Changes in these assumptions can be offsetting and we are unable to predict their movement, sensitivities in reported amounts, offsetting impacts, or future impacts to the Consolidated Financial Statements over time or in any given future period.\nFuture Policy Benefits and Claims\nWe establish reserves to cover the benefits associated with non-traditional and traditional long-duration products. Non-traditional long-duration products include variable and structured variable annuity contracts, fixed annuity contracts and UL and VUL policies. Traditional long-duration products include term life insurance, whole life insurance, disability income (“DI”) and LTC insurance and life contingent payout annuity products. UL and VUL policies with product features that result in profits followed by losses are accounted for as insurance liabilities. The portion of structured variable annuities, indexed annuities and indexed universal life (“IUL”) policies allocated to the indexed account is accounted for as an embedded derivative.\nThe establishment of reserves is an estimation process using a variety of methods, assumptions and data elements. If actual experience is better than or equal to the results of the estimation process, then reserves should be adequate to provide for future benefits and expenses. If actual experience is worse than the results of the estimation process, additional reserves may be required.\nNon-Traditional Long-Duration Products, including Embedded Derivatives\nA portion of our UL and VUL policies have product features that result in profits followed by losses from the insurance component of the contract. These profits followed by losses can be generated by the cost structure of the product or secondary guarantees in the contract. The secondary guarantee ensures that, subject to specified conditions, the policy will not terminate and will continue to provide a death benefit even if there is insufficient policy value to cover the monthly deductions and charges. The liability for these future losses is determined at the reporting date using actuarial models to estimate the death benefits in excess of account value and recognizing the excess over the estimated life based on expected assessments (e.g. cost of insurance charges, contractual administrative charges, similar fees and investment margin). Significant assumptions made in projecting future benefits and assessments relate to client asset value growth rates, mortality, persistency and investment margins. Changes in these assumptions can be offsetting and we are unable to predict their movement, sensitivities in reported amounts, offsetting impacts, or future impacts to the Consolidated Financial Statements over time or in any given future period. See Note 11 to our Consolidated Financial Statements for information regarding the liability for contracts with secondary guarantees.\nEmbedded Derivatives\nThe fair value of embedded derivatives related to structured variable annuities, indexed annuities and IUL fluctuates based on equity markets and interest rates and is reported within our total liabilities. In addition, the valuation of embedded derivatives is impacted by an estimate of our nonperformance risk adjustment. This estimate includes a spread over the U.S. Treasury curve as of the balance sheet date. As our estimate of this spread widens or tightens, the liability will decrease or increase, respectively.\nSee Note 16 to our Consolidated Financial Statements for information regarding the fair value measurement of embedded derivatives.\nAmeriprise Financial, Inc.\nTraditional Long-Duration Products\nThe liabilities for traditional long-duration products include cash flows related to unpaid amounts on reported claims, estimates of benefits payable on claims incurred but not yet reported and estimates of benefits that will become payable on term life, whole life, DI, LTC, and life contingent payout annuity policies as claims are incurred in the future. Accordingly, the claim liability (also referred to as disabled life reserves) is presented together as one liability for future policy benefits.\nA liability for future policy benefits, which is the present value of estimated future policy benefits to be paid to or on behalf of policyholders and certain related expenses less the present value of estimated future net premiums to be collected from policyholders, is accrued as premium revenue is recognized. Expected insurance benefits are accrued over the life of the contract in proportion to premium revenue recognized (referred to as the net premium approach). The net premium ratio reflects cash flows from contract inception to contract termination (i.e., through the claim paying period) and cannot exceed 100%.\nThe liability for future policy benefits is updated for actual experience at least on an annual basis and concurrent with changes to cash flow assumptions. When net premiums are updated for cash flow changes, the estimated cash flows over the entire life of a group of contracts are updated using historical experience and updated future cash flow assumptions. Changes in these assumptions can be offsetting and we are unable to predict their movement, sensitivities in reported amounts, offsetting impacts, or future impacts to the Consolidated Financial Statements over time or in any given future period.\nThe cash flows used in the calculation are discounted using the forward rate curve on the original contract issue date. The discount rate represents an upper-medium-grade (i.e., low credit risk) fixed-income instrument yield (i.e., an A rating) that reflects the duration characteristics of the liability.\nDerivative Instruments and Hedging Activities\nWe use derivative instruments to manage our exposure to various market risks. All derivatives are recorded at fair value. The fair value of our derivative instruments is determined using either market quotes or valuation models that are based upon the net present value of estimated future cash flows and incorporate current market observable inputs to the extent available. We are unable to predict impacts and determine sensitivities in reported amounts reflecting such market movements on our aggregate derivative portfolio. Changes to assumptions do not occur in isolation and it is impracticable to predict such impacts at the individual security unit of measure which are predominately Level 2 fair value and based on observable inputs.\nFor further details on the types of derivatives we use and how we account for them, see Note 2, Note 16 and Note 18 to our Consolidated Financial Statements. For discussion of our market risk exposures and hedging program and related sensitivity testing, see Item 7A. “Quantitative and Qualitative Disclosures About Market Risk.”\nRecent Accounting Pronouncements\nFor information regarding recent accounting pronouncements and their expected impact on our future consolidated results of operations and financial condition, see Note 3 to our Consolidated Financial Statements.\nSources of Revenues and Expenses\nManagement and Financial Advice Fees\nManagement and financial advice fees relate primarily to fees earned from managing mutual funds, private funds, separate account and wrap account assets and institutional investments, as well as fees earned from providing financial advice, administrative services (including transfer agent and administration fees earned from providing services to retail mutual funds) and other custodial services. Management and financial advice fees include performance-based incentive management fees, which we may receive on certain management contracts. Management and financial advice fees also include mortality and expense risk fees.\nDistribution fees primarily include point-of-sale fees (such as mutual fund front-end sales loads) and asset-based fees (such as 12b-1 distribution and shareholder service fees). Distribution fees also include amounts received under marketing support arrangements for sales of mutual funds and other companies’ products, such as through our wrap accounts, as well as surrender charges on annuities and UL and VUL insurance. Distribution fees also include revenue for placing clients’ deposits in its brokerage sweep program with third-party banks as well as revenue from brokerage clients for the execution of requested trades.\nNet Investment Income\nNet investment income primarily includes interest income on fixed maturity securities classified ",
  "item2_clean": null
}