{
  "source_file": "amt-20241231.htm",
  "form_type": "10-K",
  "item1_clean": "During the year ended December 31, 2024, we also completed the sales of our subsidiaries in Australia (“ATC Australia”) and New Zealand (“ATC New Zealand”) for total aggregate consideration of approximately $77.6 million. We recorded a gain on the sales of ATC Australia and ATC New Zealand of $8.5 million, which is included in Other operating expenses in the accompanying consolidated statements of operations. The divestitures did not qualify for presentation as discontinued operations.\nWe operate as a real estate investment trust for U.S. federal income tax purposes (“REIT”). Accordingly, we generally are not required to pay U.S. federal income taxes on income generated by our REIT operations, including the income derived from leasing space on our towers and in our data centers, as we receive a dividends paid deduction for distributions to stockholders that offsets our REIT taxable income and gains. However, we remain obligated to pay U.S. federal income taxes on earnings from our domestic taxable REIT subsidiaries (“TRSs”). In addition, our international assets and operations, regardless of their classification for U.S. tax purposes, continue to be subject to taxation in the jurisdictions where those assets are held or those operations are conducted.\nThe use of TRSs enables us to continue to engage in certain businesses and jurisdictions while complying with REIT qualification requirements. We may, from time to time, change the election of previously designated TRSs to be included as part of the REIT. As of December 31, 2024, our REIT-qualified businesses included our U.S. tower leasing business, a majority of our U.S. DAS networks business, our Services and Data Centers segments, as well as most of our operations in Canada, Costa Rica, France, Germany, Ghana, Kenya, Mexico, Nigeria, South Africa, Spain and Uganda.\nDuring the fourth quarter of 2024, following recent divestitures, including the ATC TIPL Transaction, and changes to our organizational structure, we reviewed and changed our reportable segments. Our Asia-Pacific (“APAC”) property segment and our Africa property segment were combined into the Africa & APAC property segment. As a result, we now have six reportable segments: U.S. & Canada property (which includes all assets in the United States and Canada, other than our data center facilities and related assets), Africa & APAC property, Europe property, Latin America property, Data Centers and Services. This change aligns with our management structure and better aligns our reporting with management’s current approach of allocating costs and resources, managing growth and profitability and assessing the operating performance of our business segments.\nProducts and Services\nOur property operations accounted for 98%, 99% and 98% of our total revenues for the years ended December 31, 2024, 2023 and 2022, respectively. Our revenue is primarily generated from tenant leases. Within our tower leasing operations, our tenants lease space on our communications real estate, where they install and maintain their equipment. Rental payments vary considerably depending upon numerous factors, including, but not limited to, amount, type and position of tenant equipment on the tower, remaining tower capacity and tower location. Our costs typically include ground rent (which is primarily fixed under long-term lease agreements with annual cost escalations) and power and fuel costs, some or all of which may be passed through to our tenants, as well as property taxes and repair and maintenance expenses. Our property operations have generated consistent growth in revenue and typically have low cash flow volatility due to the following characteristics:\nLong-term tenant leases with contractual rent escalations.\nIn general, our tenant leases for our communications sites with wireless carriers have initial non-cancellable terms of five to ten years with multiple renewal terms, with provisions that periodically increase the rent due under the lease, typically annually, based on a fixed escalation percentage (averaging approximately 3% in the United States) or an inflationary index in most of our international markets, or a combination of both. Based upon foreign currency exchange rates and the tenant leases in place as of December 31, 2024, we expect to generate nearly $54 billion of non-cancellable tenant lease revenue over future periods, before the impact of straight-line lease accounting.\nConsistent demand for our sites.\nAs a result of rapidly growing usage of mobile data and other wireless services and the corresponding wireless industry capital spending trends in the markets we serve, we anticipate consistent demand for our communications sites. We believe that our global asset base positions us well to benefit from the increasing proliferation of advanced wireless devices and the increasing usage of high bandwidth applications on those devices. We have the ability to add new tenants and new equipment for existing tenants on our sites, which typically results in incremental revenue and modest incremental costs. Our site portfolio and our established tenant base provide us with a solid platform for new business opportunities, which has historically resulted in consistent and predictable organic revenue growth.\nHigh lease renewal rates.\nOur tenants tend to renew leases because suitable alternative sites may not exist or be available and repositioning a site in their network may be expensive and may adversely affect network quality. We define churn as tenant billings lost when a tenant cancels or does not renew its lease or, in limited circumstances, when the lease rates on existing leases are reduced. We derive our churn rate for a given year by dividing our tenant billings\n\nlost on this basis by our prior-year tenant billings. During the year ended December 31, 2024, churn was approximately 2% of our tenant billings, primarily driven by churn in our U.S. & Canada property segment. We expect that our churn rate in our U.S. & Canada property segment will continue to be elevated through 2025 due to contractual lease cancellations and non-renewals by T-Mobile US, Inc. (“T-Mobile”), including legacy Sprint Corporation leases, pursuant to the terms of our master lease agreement with T-Mobile (the “T-Mobile MLA”) entered into in September 2020.\nHigh operating margins.\nIncremental operating costs associated with adding new tenants or equipment to an existing communications site are typically relatively minimal. Therefore, as tenants or equipment are added, the substantial majority of incremental revenue flows through to gross margin and operating profit. In addition, in many of our international markets, certain expenses, such as ground rent or power and fuel costs, are reimbursed or shared by our tenant base.\nLow maintenance capital expenditures.\nOn average, we require relatively low amounts of annual capital expenditures to maintain our communications sites.\nOur property business includes the operation of communications sites and managed networks, the leasing of property interests and, in select markets, the operation of fiber, the operation of data centers and the provision of backup power through shared generators. Our presence in a number of markets at different relative stages of wireless development provides us with significant diversification and long-term growth potential. Our property segments accounted for the following percentage of consolidated total revenue for the years ended December 31,:\n(1) Excludes the operating results of ATC TIPL, which are reported as discontinued operations. See Note 22 for further discussion.\nCommunications Sites.\nApproximately 87%, 88% and 87% of revenue in our property segments was attributable to our communications sites, excluding DAS networks and fiber, for the years ended December 31, 2024, 2023 and 2022, respectively.\nWe lease space on our communications sites to tenants providing a diverse range of communications services, including cellular voice and data, broadcasting, mobile video and a number of other applications. In addition, in many of our international markets, we receive pass-through revenue from our tenants to cover certain costs, including power and fuel costs and ground rent. Our top tenants by revenue for each property segment are as follows for the year ended December 31, 2024:\nAT&T Inc. (“AT&T”); T-Mobile; and Verizon Communications Inc. (“Verizon Wireless”) accounted for an aggregate of 86% of U.S. & Canada property segment revenue.\nBharti Airtel Limited (“Airtel”); and MTN Group Limited (“MTN”) accounted for an aggregate of 81% of Africa & APAC property segment revenue.\nTelefónica S.A. (“Telefónica”) accounted for an aggregate of 70% of Europe property segment revenue.\nAmérica Móvil; AT&T; Telefónica; and TIM S.p.A. accounted for an aggregate of 74% of Latin America property segment revenue.\nAccordingly, we are subject to certain risks, as set forth in Item 1A of this Annual Report under the caption “Risk Factors—A substantial portion of our current and projected future revenue is derived from a small number of customers, and we are sensitive to adverse changes in the creditworthiness and financial strength of our customers.” In addition, we are subject to risks related to our international operations, as set forth under the caption “Risk Factors—Our foreign operations are subject to economic, political and other risks that could materially and adversely affect our revenues or financial position, including risks associated with fluctuations in foreign currency exchange rates.”\nManaged Networks, Data Centers and Related Assets, Other Telecommunications Assets, Property Interests and Shared Generators.\nIn addition to our communications sites, we also own and operate several types of managed network solutions, provide communications site management services to third parties, manage and lease property interests under carrier or other third-party communications sites, operate data center facilities and related assets, operate other telecommunications assets and provide back-up power sources to tenants at our sites. The balance of our property segment revenue not attributable to our communications sites was attributable to these items.\n\nWe own and operate DAS networks in the United States and certain international markets. We obtain rights from property owners to install and operate in-building DAS networks, and we grant rights to wireless service providers to attach their equipment to our installations. We also offer a small portfolio of outdoor DAS networks as a complementary shared infrastructure solution for our tenants in the United States and in certain international markets. Typically, we have designed, built and operated our outdoor DAS networks in areas in which zoning restrictions or other barriers may prevent or delay deployment of more traditional wireless communications sites, such as macro tower sites. We also hold lease rights and easement interests on rooftops capable of hosting communications equipment in locations where towers are generally not a viable solution based on area characteristics. In addition, we provide management services to property owners in the United States who elect to retain full rights to their property while simultaneously marketing the rooftop for wireless communications equipment installation. As the demand for advanced wireless services in urban markets evolves, we continue to evaluate a variety of infrastructure solutions, including small cells and other network architectures that may support our tenants’ networks in these areas.\nData Centers and Related Assets.\nWe own and operate data center facilities and related assets in the United States, which consist of specialized and secure buildings that house networking, storage and communications technology infrastructure, including servers, storage devices, switches, routers and fiber optic transmission equipment. These buildings are designed ",
  "item7_clean": "Non-GAAP Financial Measures\nIncluded in our analysis of our results of operations are discussions regarding earnings before interest, taxes, depreciation, amortization and accretion, as adjusted (“Adjusted EBITDA”), Funds From Operations, as defined by the National Association of Real Estate Investment Trusts (“Nareit FFO”) attributable to American Tower Corporation common stockholders, Adjusted Funds From Operations (“AFFO”) attributable to American Tower Corporation common stockholders (“AFFO attributable to American Tower Corporation common stockholders”) and Segment gross margin.\nWe define Adjusted EBITDA as Net income before Income (loss) from equity method investments; Income (loss) from discontinued operations, net of taxes; Income tax benefit (provision); Other income (expense); Gain (loss) on retirement of long-term obligations; Interest expense; Interest income; Other operating income (expense), including Goodwill impairment; Depreciation, amortization and accretion; and stock-based compensation expense.\nNareit FFO attributable to American Tower Corporation common stockholders is defined as net income before gains or losses from the sale or disposal of real estate, real estate related impairment charges, real estate related depreciation, amortization and accretion including adjustments and distributions for unconsolidated affiliates and noncontrolling interests and discontinued operations. In this section, we refer to Nareit FFO attributable to American Tower Corporation common stockholders as “Nareit FFO (common stockholders).”\nWe define AFFO attributable to American Tower Corporation common stockholders as Nareit FFO (common stockholders) before (i) straight-line revenue and expense; (ii) stock-based compensation expense; (iii) the deferred portion of income tax and other income tax adjustments; (iv) non-real estate related depreciation, amortization and accretion; (v) amortization of deferred financing costs, debt discounts and premiums and long-term deferred interest charges; (vi) other income (expense); (vii) gain (loss) on retirement of long-term obligations; and (viii) other operating income (expense); less cash payments related to capital improvements and cash payments related to corporate capital expenditures and including adjustments and distributions for unconsolidated affiliates and noncontrolling interests and adjustments for discontinued operations, which includes the impact of noncontrolling interests and discontinued operations on both Nareit FFO and the corresponding adjustments included in AFFO. In this section, we refer to AFFO attributable to American Tower Corporation common stockholders as “AFFO (common stockholders).”\nWe define Segment gross margin as segment revenue less segment operating expenses, excluding depreciation, amortization and accretion; selling, general, administrative and development expense; and other operating expenses.\nAdjusted EBITDA, Nareit FFO (common stockholders), AFFO (common stockholders) and Segment gross margin are not intended to replace net income or any other performance measures determined in accordance with GAAP. None of Adjusted EBITDA, Nareit FFO (common stockholders), AFFO (common stockholders) or Segment gross margin represents cash flows from operating activities in accordance with GAAP and, therefore, these measures should not be considered indicative of cash flows from operating activities, as a measure of liquidity or a measure of funds available to fund our cash needs, including our ability to make cash distributions. Rather, Adjusted EBITDA, Nareit FFO (common stockholders), AFFO (common stockholders) and Segment gross margin are presented as we believe each is a useful indicator of our current operating performance. We believe that these metrics are useful to an investor in evaluating our operating performance because (1) each is a key measure used by our management team for decision making purposes and for evaluating our operating segments’ performance; (2) Adjusted EBITDA is a component underlying our credit ratings; (3) Adjusted EBITDA is widely used in the telecommunications real estate sector to measure operating performance as depreciation, amortization and accretion may vary significantly among companies depending upon accounting methods and useful lives, particularly where acquisitions and non-operating factors are involved; (4) AFFO (common stockholders) is widely used in the telecommunications real estate sector to adjust Nareit FFO (common stockholders) for items that may otherwise cause material fluctuations in Nareit FFO (common stockholders) growth from period to period that would not be representative of the underlying performance of property assets in those periods; (5) Segment gross margin provides valuable insight into the site-level profitability of our assets (6) each provides investors with a meaningful measure for evaluating our period-to-period operating performance by eliminating items that are not operational in nature; and (7) each provides investors with a measure for comparing our results of operations to those of other companies, particularly those in our industry.\nOur measurement of Adjusted EBITDA, Nareit FFO (common stockholders), AFFO (common stockholders) and Segment gross margin may not, however, be fully comparable to similarly titled measures used by other companies. Reconciliations of Adjusted EBITDA, Nareit FFO (common stockholders) and AFFO (common stockholders) to net income and Segment gross margin to gross margin, the most directly comparable GAAP measures, have been included below.\n\nYear ended December 31, 2024\nThe increase in U.S. & Canada property segment gross margin was primarily attributable to the increase in revenue described above, partially offset by an increase in direct expenses of $21.0 million, primarily attributable to impacts of straight-line accounting.\nThe increase in Africa & APAC property segment gross margin was primarily attributable to a decrease in direct expenses of $12.9 million, primarily due to a decrease in costs associated with pass-through revenue, including fuel costs, partially offset by an increase in repair and maintenance spending. The decrease in direct expenses was partially offset by the decrease in revenue described above. Direct expenses also benefited by $45.0 million from the impact of foreign currency translation.\nThe increase in Europe property segment gross margin was primarily attributable to the increase in revenue described above, partially offset by an increase in direct expenses of $9.6 million, primarily due to an increase in costs associated with pass-through revenue, including energy costs, an increase in land rent costs and an increase in repair and maintenance spending. Direct expenses were also negatively impacted by $0.3 million from the impact of foreign currency translation.\nThe decrease in Latin America property segment gross margin was primarily attributable to the decrease in revenue described above, partially offset by a decrease in direct expenses of $13.8 million, including a decrease due to the sale of Mexico Fiber in the prior year period, as well as land rent costs. Direct expenses also benefited by $22.0 million from the impact of foreign currency translation.\nThe increase in Data Centers segment gross margin was primarily attributable to the increase in revenue described above, partially offset by an increase in direct expenses of $43.2 million, primarily due to an increase in costs associated with power revenue, including utility costs.\nThe increase in Services segment gross margin was primarily attributable to the increase in revenue described above, partially offset by an increase in direct expenses of $32.5 million.\nYear ended December 31, 2023\nThe increase in U.S. & Canada property segment gross margin was primarily attributable to the increase in revenue described above, partially offset by an increase in direct expenses of $4.5 million.\nThe increase in Africa & APAC property segment gross margin was primarily attributable to the increase in revenue described above, partially offset by an increase in direct expenses of $93.4 million, primarily due to an increase in costs associated with pass-through revenue, including energy costs. Direct expenses also benefited by $103.1 million from the impact of foreign currency translation.\nThe increase in Europe property segment gross margin was primarily attributable to the increase in revenue described above, and a decrease in direct expenses of $27.6 million, primarily due to a decrease in costs associated with pass-through revenue, including energy costs. Direct expenses were also negatively impacted by $7.5 million from the impact of foreign currency translation.\nThe increase in Latin America property segment gross margin was primarily attributable to the increase in revenue described above, partially offset by an increase in direct expenses of $15.0 million, primarily due to an increase in costs associated with pass-through revenue, including land rent costs. Direct expenses were also negatively impacted by $24.3 million from the impact of foreign currency translation.\nThe increase in Data Centers segment gross margin was primarily attributable to the increase in revenue described above, partially offset by an increase in direct expenses of $25.6 million, primarily due to power costs.\nThe decrease in Services segment gross margin was primarily due to the decrease in revenue described above, partially offset by a decrease in direct expenses of $47.3 million.\n\n(7) Includes (gains) losses on foreign currency exchange rate fluctuations of $(308.3) million, $330.6 million and $(451.4) million, respectively.\n(8) Primarily includes acquisition-related costs, integration costs and disposition costs.\n(9) Includes adjustments for the impact of noncontrolling interests on other line items, excluding those already adjusted for in Nareit FFO attributable to American Tower Corporation common stockholders.\n(10) Includes the impact of discontinued operations associated with other line items, excluding the impact already included in Nareit FFO attributable to American Tower Corporation common stockholders.\nYear Ended December 31, 2024\nThe increase in net income from continuing operations was primarily due to (i) a decrease in depreciation, amortization and accretion expense, (ii) changes in other (income) expense, primarily due to foreign currency exchange rate fluctuations, (iii) a decrease in other operating expense, (iv) an increase in segment operating profit and (v) a decrease in goodwill impairment, partially offset by an increase in the income tax provision.\nThe increase in Adjusted EBITDA was primarily attributable to an increase in our gross margin and a decrease in SG&A, excluding the impact of stock-based compensation expense of $22.0 million.\nThe increase in AFFO attributable to American Tower Corporation common stockholders was primarily attributable to (i) an increase in our operating profit, excluding the impact of straight-line accounting, (ii) a decrease in capital improvement capital expenditures and (iii) an increase in AFFO attributable to American Tower Corporation common stockholders from discontinued operations, partially offset by distributions and adjustments for noncontrolling interests, including distributions to noncontrolling interest holders in our Europe property segment and Data Centers segment.\nYear Ended December 31, 2023\nThe decrease in net income from continuing operations was primarily due to (i) changes in other expense (income) primarily due to foreign currency exchange rate fluctuations, (ii) an increase in net interest expense, (iii) an increase in other operating expenses and (iv) an increase in goodwill impairment expense, partially offset by (x) an increase in segment operating profit, (y) a decrease in depreciation, amortization and accretion expense and (z) a decrease in the income tax provision.\nThe increase in Adjusted EBITDA was primarily attributable to an increase in our gross margin, partially offset by an increase in SG&A, excluding the impact of stock-based compensation expense, of $22.3 million.\nThe increase in AFFO attributable to American Tower Corporation common stockholders was primarily attributable to (i) an increase in our operating profit, excluding the impact of straight-line accounting, and (ii) an increase in AFFO attributable to American Tower Corporation common stockholders from discontinued operations, partially offset by (x) an increase in net cash paid for interest, (y) distributions and adjustments for noncontrolling interests, including distributions to noncontrolling interest holders in our Data Centers segment and (z) increases in cash paid for income taxes and capital improvement capital expenditures.\n\nestimated to be 20 years. We determined that the estimated useful life of our tower assets is 30 years, before taking into account residual value. Depreciation expense is recorded using the straight-line method over the assets’ estimated useful lives.\nAdditionally, certain of our intangible assets are amortized on a similar basis to our tower assets, as the estimated useful lives of such intangible assets correlate to the useful life of the towers. The acquired network location intangibles represent the value of the incremental revenue growth that could potentially be obtained from leasing the excess capacity on acquired tower communications infrastructure. The acquired tenant-related intangibles typically represent the value of tenant contracts and relationships in place at the time of an acquisition or similar transaction, including assumptions regarding estimated renewals. Amortization expense for intangible assets is computed using the straight-line method over the estimated useful life of each of the intangible assets. The useful lives of our intangible assets are estimated based on the period over which the intangible asset is expected to benefit us.\nWe accounted for the changes in the useful lives as a change in accounting estimate under ASC 250\nAccounting Changes and Error Corrections\n, which were recorded prospectively beginning on January 1, 2024. On January 1, 2024, we began depreciating our towers and related intangible assets on a straight-line basis over the remaining estimated useful life of the tower, taking into account the extended useful life and residual value. The extension of the asset lives (i) resulted in an approximately $515 million increase in the right of use asset, as additional renewal options may be included, with an offsetting adjustment made to increase the related operating lease liability and (ii) resulted in an estimated $730 million ($649 million after tax, or an increase of $1.39 per diluted share) decrease in depreciation and amortization expense for the year ended December 31, 2024.\nImpairment of Assets—Assets Subject to Depreciation and Amortization\n: We review long-lived assets for impairment at least annually or whenever events, changes in circumstances or other indicators or evidence indicate that the carrying amount of our assets may not be recoverable.\nWe review our tower portfolio, network location intangible and right-of-use assets for indicators of impairment at the lowest level of identifiable cash flows, typically at an individual tower basis. Possible indicators include a tower not having current tenant leases or having expenses in excess of revenues. A cash flow modeling approach is utilized to assess recoverability and incorporates, among other items, the tower location, the tower location demographics, the timing of additions of new tenants, lease rates and estimated length of tenancy and ongoing cash requirements.\nWe review our tenant-related intangible assets on a tenant by tenant basis for indicators of impairment, such as high levels of turnover or attrition, non-renewal of a significant number of contracts or the cancellation or termination",
  "item2_clean": null
}