{
  "source_file": "amt-20250930.htm",
  "form_type": "10-Q",
  "item1_clean": null,
  "item7_clean": null,
  "item2_clean": "During the fourth quarter of 2024, following recent divestitures, including the ATC TIPL Transaction (as defined below), and changes to our organizational structure, we reviewed and changed our reportable segments. Our APAC property segment and our Africa property segment were combined into the Africa & APAC property segment. As a result, we now report our results in six segments: U.S. & Canada property (which includes all assets in the United States and Canada, other than our data center facilities and related assets), Africa & APAC property, Europe property, Latin America property, Data Centers and Services. In evaluating financial performance in each business segment, management uses, among other factors, segment gross margin and segment operating profit (see note 15 to our consolidated and condensed consolidated financial statements included in this Quarterly Report). Historical financial information included in Management’s Discussion and Analysis of Financial Condition and Results of Operations has been adjusted to reflect the change in reportable segments.\nIn 2023, we initiated a strategic review of our India business, as further discussed below under “Results of Operations—Loss from Discontinued Operations, Net of Taxes.” The strategic review concluded in January 2024 with the signed agreement for the ATC TIPL Transaction. The ATC TIPL Transaction received all government and regulatory approvals during the three months ended September 30, 2024. On September 12, 2024, we completed the ATC TIPL Transaction and received total consideration of 182 billion INR (approximately $2.2 billion). ATC TIPL’s operating results are presented as discontinued operations. See discussion below and note 16 to our consolidated and condensed consolidated financial statements included in this Quarterly Report (“Note 16”) for further discussion. Historical financial information included in Management’s Discussion and Analysis of Financial Condition and Results of Operations has been adjusted to reflect the operating results of ATC TIPL as discontinued operations for all periods presented.\nWe are one of the largest global real estate investment trusts and a leading independent owner, operator and developer of multitenant communications real estate. Our primary business is the leasing of space on communications sites to wireless service providers, radio and television broadcast companies, wireless data providers, government agencies and municipalities and tenants in a number of other industries. In addition to the communications sites in our portfolio, we manage rooftop and tower sites for property owners under various contractual arrangements. We also hold other telecommunications infrastructure and property interests that we lease primarily to communications service providers and third-party tower operators, and, as discussed further below, we hold a portfolio of highly interconnected data center facilities and related assets in the United States. Our customers include our tenants, licensees and other payers. We refer to the business encompassing the above as our property operations, which accounted for 96% and 97% of our total revenues for the three and nine months ended September 30, 2025, respectively, and includes our U.S. & Canada property, Africa & APAC property, Europe property and Latin America property segments and Data Centers segment.\nWe also offer tower-related services in the United States, including site application, zoning and permitting, structural and mount analyses, and construction management, which primarily support our site leasing business, including the addition of new tenants and equipment on our sites.\nThe following table details the number of communications sites, excluding managed sites, that we owned or operated as of September 30, 2025:\n\nTotal selling, general, administrative and development expense\nExcludes the operating results of ATC TIPL, which are reported as discontinued operations. See Note 16 for further discussion.\nThree Months Ended September 30, 2025\nOur U.S. & Canada property segment SG&A was relatively consistent as compared to the prior-year period.\nThe increase in our Africa & APAC property segment SG&A was primarily driven by increased local tax and professional services costs and the negative impact of foreign currency translation, partially offset by decreased personnel and related costs.\nThe increase in our Europe property segment SG&A was primarily driven by increased canceled construction costs, increased professional services costs, and the negative impact of foreign currency translation, partially offset by decreased personnel and related costs.\nThe increase in our Latin America property segment SG&A was primarily driven by increased local tax and professional services costs, including legal fees in Mexico, and the negative impact of foreign currency translation, partially offset by a net decrease in bad debt expense of $3.7 million.\nThe increases in our Data Centers and Services segment SG&A were primarily driven by increased personnel and related costs to support our business.\nThe decrease in other SG&A was primarily attributable to a decrease in stock-based compensation expense of $1.8 million, partially offset by an increase in corporate SG&A, including an increase in personnel and related costs to support our business.\nNine Months Ended September 30, 2025\nThe increase in our U.S. & Canada property segment SG&A was primarily driven by increased personnel and related costs and an increase in bad debt expense, partially offset by decreased professional services costs and lower canceled construction costs.\nThe increase in our Africa & APAC property segment SG&A was primarily driven by increased local tax and professional services costs and the negative impact of foreign currency translation, partially offset by decreased personnel and related costs.\nThe increase in our Europe property segment SG&A was primarily driven by increased canceled construction costs, increased professional services costs, and the negative impact of foreign currency translation, partially offset by decreased personnel and related costs.\nThe decrease in our Latin America property segment SG&A was primarily driven by a net decrease in bad debt expense of $2.0 million, decreased personnel and related costs, and a benefit from the impact of foreign currency translation, partially offset by increased local tax and professional services costs, including legal fees in Mexico.\nThe increase in our Data Centers segment SG&A was primarily driven by increased personnel and related costs to support our business, partially offset by a legal settlement in the period.\nThe increase in our Services segment SG&A was primarily driven by increased personnel and related costs to support our business.\nThe decrease in other SG&A was primarily attributable to a decrease in stock-based compensation expense of $8.2 million, primarily driven by the reversal of previously recognized stock-based compensation expense associated with awards forfeited in connection with the departure of our Executive Vice President and President, APAC due to such role being eliminated, as discussed in note 9 to our consolidated and condensed consolidated financial statements included in this Quarterly Report, and a decrease in other corporate SG&A, partially offset by an increase in personnel and related costs to support our business.\n\nDepreciation, amortization and accretion\nSelling, general, administrative and development expense\nOther operating expense\nLoss on sale of ATC TIPL\nLoss from discontinued operations before taxes\nIncome tax provision\nLoss from discontinued operations, net of taxes\nIncludes the results of operations for ATC TIPL through September 12, 2024.\nFollowing the rulings by the Supreme Court of India regarding carriers’ obligations for the adjusted gross revenue fees and charges prescribed by the court, we experienced variability and a level of uncertainty in collections in India. In the third quarter of 2022, one of our largest customers in India, Vodafone Idea Limited (“VIL”), communicated that it would make partial payments of its contractual amounts owed to us (the “VIL Shortfall”). We recorded reserves in late 2022 and the first half of 2023 for the VIL Shortfall. In the second half of 2023, VIL began making payments in full of its monthly contractual obligations owed to us. During the year ended December 31, 2023, we deferred recognition of revenue of approximately $27.3 million, net of recoveries, related to VIL in India. During the three months ended March 31, 2024, we recognized approximately $29.0 million of this previously deferred revenue. We have fully recognized this previously deferred revenue.\nIn February 2023, and as amended in August 2023, VIL issued optionally convertible debentures (the “VIL OCDs”) to ATC TIPL in exchange for VIL’s payment of certain amounts towards accounts receivables. The VIL OCDs were issued for an aggregate face value of 16.0 billion INR (approximately $193.2 million on the date of issuance). On March 23, 2024, we converted an aggregate face value of 14.4 billion INR (approximately $172.7 million) of VIL OCDs into 1,440 million shares of equity of VIL (the “VIL Shares”). On April 29, 2024, we completed the sale of 1,440 million VIL Shares at a price of 12.78 INR per share. The net proceeds for this transaction were approximately 18.0 billion INR (approximately $216.0 million at the date of settlement) after deducting commissions and fees. On June 5, 2024, we completed the sale of the remaining aggregate face value of 1.6 billion INR (approximately $19.2 million) of the VIL OCDs. The net proceeds for this transaction, excluding accrued interest, were approximately 1.8 billion INR (approximately $22.0 million at the date of settlement) after deducting fees. None of the VIL Shares or the VIL OCDs remained outstanding. During the nine months ended September 30, 2024, we recognized a gain of "
}