{
  "source_file": "anet-20250930.htm",
  "form_type": "10-Q",
  "item1_clean": null,
  "item7_clean": null,
  "item2_clean": "We are working closely with our contract manufacturers and suppliers to optimize our supply chain and production efforts in response to the uncertainty around international trade policy and tariff rates to minimize the impact of the tariffs and any impact on the supply chain of components sourced from affected countries. While our supply chain has currently not experienced a significant disruption as a result of the recent trade measures, the extent of such policies and tariffs that will ultimately be implemented is unknown at this time, and the future impact to our supply chain and cost of our products is uncertain. We continue to ship products against previously committed demand/deployment plans and accelerate some deployments where needed, while trying to balance our customers' requirements and lead times with the availability of key components and products and lead times of our key suppliers and contract manufacturers. Given the timing and prioritization of customer orders and shipment patterns, as well as the timing and outcome of customer trials and contracts with acceptance periods, near term revenue trends may not be reflective of current demand levels, and could benefit from demand/deployment plans that have been previously committed. We expect that our inventory and purchase commitments will\nremain volatile as we ramp new product introductions. The magnitude of these balances and shifting customer product priorities, has resulted in an increased risk that we may not be able to sell all of this inventory, which in turn has resulted in excess and obsolete inventory and may result in additional charges to excess and obsolete inventory and supplier liability. In addition, inflation pressure in our supply chain and scarcity of some materials needed to build our products have increased our cost of revenue and have impacted, and may continue to negatively impact our gross margin. These cost pressures may be increased if escalating tariff and non-tariff international trade measures continue to affect our supply chain. We also may not be able to fully mitigate the cost impacts of escalating tariff and non-tariff international trade measures or be able to pass on the full burden of the increase in trade-related costs to our customers, which could further negatively impact our gross margin. While we have seen improvements in our supply chain and manufacturing operations, any remaining or new supply chain and manufacturing-related constraints could negatively impact our business in future periods.\nManagement continues to actively monitor the impact of macroeconomic factors on the Company's financial condition, liquidity, operations, suppliers, industry, and workforce. The extent of the impact of these factors on our operational and financial performance, including our ability to execute our business strategies and initiatives in the expected time frame, will depend on future developments, the impact on our customers, partners, employees, contract manufacturers and supply chain, all of which continue to evolve and are unpredictable. In addition, any continued or renewed disruption in manufacturing and supply and uncertainty about international trade policy and tariff rates could negatively impact our business, and as a result we may face challenges in implementing countermeasures and responding to these changing trading conditions. Furthermore, any prolonged economic disruptions or further deterioration in the global economy could have a negative impact on demand from our customers in future periods, particularly in the enterprise market where we are continuing to expand our penetration. Accordingly, current results and financial conditions discussed herein may not be indicative of future operating results and trends.\nResults of Operations\nThree and Nine Months Ended September 30, 2025 Compared to Three and Nine Months Ended September 30, 2024\nRevenue, Cost of Revenue and Gross Margin (in millions, except percentages)\nThree Months Ended September 30,\nNine Months Ended September 30,\nTotal cost of revenue\nRevenue by Geography (in millions, except percentages)\nThree Months Ended September 30,\nNine Months Ended September 30,\nEurope, Middle East and Africa\nProduct revenue primarily consists of sales of our switching and routing products, and related network applications. Service revenue is primarily derived from sales of post-contract support (\"PCS\"), which are typically purchased in conjunction with our products, and subsequent renewals of those contracts. Our revenue may vary from period to period based on, among other things, customer demand, and the timing, size, and complexity of orders, especially with respect to our large customers.\n\nItem 2. Management’s Discussion and Analysis of Financial Condition and Results of Operations\nArista Networks is an industry leader in data-driven, client to cloud networking for large AI, data center, campus and routing environments. Arista's platforms deliver availability, agility, automation, analytics and security through an advanced network operating stack. Since Arista’s inception, our founders have reimagined cloud networks for performance, scale and programmability with a focus on differentiating in three ways: uncompromising reliability built on the foundation of robust quality assurance capabilities with a suite of automated diagnostics, advanced open and standards-based technology and intelligent automation to decrease the manual workload on the operator. At the core of Arista’s platform is Arista EOS, a\nmodernized publish-subscribe state-sharing networking operating system. Arista EOS, combined with a set of network applications and our Ethernet switching and routing platforms using best of breed merchant silicon, provides customers with a highly competitive and diversified portfolio of products with improved price/performance and time to market.\nWe believe that cloud computing represents a fundamental shift from traditional legacy network architectures. As organizations of all sizes have moved workloads to the cloud, spending on cloud and next-generation data centers has increased rapidly, while traditional legacy IT spending has grown at a slower rate. Our cloud networking platforms are well positioned to address the growing cloud networking market, and to address increasing performance requirements driven by the growing number of connected devices, as well as the need for constant connectivity and access to data and applications.\nThe markets for cloud networking solutions are highly competitive and characterized by rapidly changing technology, changing end-customer needs, evolving industry standards, frequent introductions of new products and services, and industry consolidation. We expect competition to intensify in the future as the market for cloud networking expands and existing competitors and new market entrants introduce new products or enhance existing products. Our future success is dependent upon our ability to continue to evolve and adapt to our rapidly changing environment. We must also continue to develop market-leading products and software features that address the changing needs of our existing and new customers, and increase sales in the cloud, AI and enterprise data center Ethernet switching/routing markets, and campus workspace markets. We believe one of our greatest strengths lies in our ability to rapidly develop new features and applications. In addition, we intend to continue expanding our sales force and marketing activities in key geographies, as well as our relationships with channel, technology and system-level partners in order to reach new customers more effectively, increase sales to existing customers, and provide services and support. Furthermore, we expect to continue to make substantial investments to introduce new products and services and enhance the functionality of our existing cloud networking platform through investments in our research and development organization, and investments in or acquisitions of complementary companies, products and technologies to expand our product offerings and build upon our technology leadership.\nIn June 2025, we completed the acquisition of the VeloCloud\nbusiness from Broadcom\n. VeloCloud’s secure, AI-optimized cloud WAN portfolio provides seamless connectivity to customer sites of any type, complementing Arista’s leading data center and campus wired/wireless portfolio. We believe the combination of Arista and VeloCloud will provide modern WAN solutions for our customers globally.\nThe expansion of generative AI computing and distributed applications is further pushing the boundary of predictable scale and performance in the network. A common characteristic of these AI workloads is that they are both data and compute intensive. A typical AI workload involves large sparse matrix computations, distributed across hundreds or thousands of processors (CPU, GPU, TPU, etc.) with intense computations for a period of time and requires a high-bandwidth, scalable, lossless network in order to service these workloads. With the exponential growth of AI applications, the need for standardized transport like Ethernet becomes paramount, enabling a power-efficient interconnect while overcoming the complexities of traditional approaches. Our AI strategy is based on achieving two key objectives: (1) deliver network switching products intended to provide a robust interconnect that seamlessly links GPUs, compute and storage to deliver fast job completion time for training and generative AI workloads; and (2) offer customers the Arista Autonomous Virtual Assist (\"AVA\nTM\"\n) which uses natural processing language to provide AI-assisted outcomes for network operations, security and observability.\nHistorically, large purchases by a relatively limited number of customers have accounted for a significant portion of our revenue. For example, sales to our end customer Microsoft represented 20%, 18% and 16% of our total revenue"
}