{
  "source_file": "aos-20250930.htm",
  "form_type": "10-Q",
  "item1_clean": null,
  "item7_clean": null,
  "item2_clean": "Our company is comprised of two reporting segments: North America and Rest of World. Our Rest of World segment is primarily comprised of China, Europe and India. Both segments manufacture and market comprehensive lines of residential and commercial gas, heat pump and electric water heaters, boilers, tanks, and water treatment products. Both segments primarily manufacture and market in their respective region of the world.\nWe continue to seek acquisitions that enable geographic growth, expand our core business, and establish adjacencies. On November 1, 2024, we acquired Pureit from Unilever for approximately $125 million, subject to customary adjustments. Pureit, a leading water purification business in South Asia, offers a broad range of residential water purification solutions. Pureit contributed $45 million to sales in the first nine months of 2025 and is expected to have sales of approximately USD $55 million for the full year 2025. The acquisition fits squarely in our core capabilities and doubles our market penetration in the South Asia region. In the first quarter of 2024, we acquired Impact Water Products, a privately-held water treatment company. The acquisition supports our geographic expansion and growth strategy by expanding the West Coast presence of our water treatment business.\nWe continue to look for opportunities to add to our existing product portfolio in high growth regions demonstrated by our previous introductions of kitchen products and connected product technologies in China. We also recently introduced our internally designed and manufactured gas tankless water heaters in North America. In addition, we are expanding our commercial water heater capacity in North America in preparation for the new efficiency rule for commercial water heaters that the Department of Energy (DOE) has adopted that will take effect in 2026.\nIn 2024, we recognized restructuring and impairment expenses of $17.6 million. In China, severance expenses of $11.3 million related to the right sizing of that business for current market conditions. The remaining $6.3 million related to the restructuring of our water treatment business in North America as a part of a profitability improvement strategy that prioritizes improving our cost structure and emphasizes our more profitable channels.\nIn our North America segment, water heater sales were essentially flat in the first nine months of 2025 compared to the same period last year as pricing benefits and higher commercial volumes we achieved in the third quarter were offset by lower residential volumes in the first half of the year. We believe we underperformed the market in the first half of the year as we limited prebuy ahead of our May 2025 price increase however we believe we outperformed the market in the third quarter and we expect to continue to strengthen our share through the fourth quarter. 2024 residential industry unit volumes were flat compared to the prior year and we project 2025 industry residential unit volumes will be flat to slightly down as new construction completions leads to softness in the wholesale residential channel. We anticipate that commercial water heater industry volumes will increase low single digits in 2025 after minimal growth in 2024. In response to higher steel and other input costs, including tariffs, we announced price increases on most of our water heater and boiler products in the first half of 2025. In addition to pricing, we intend to mitigate the impact of tariffs through footprint optimization, strategic sourcing actions and other cost containment initiatives. We expect our boiler sales to grow between four and six percent in 2025 compared to 2024 as we continue to benefit from the transition to higher efficiency boilers. We anticipate sales of our North America water treatment products will be between $235 million and $245 million, a year-over-year decrease of approximately five percent as we de-emphasize less attractive channels and focus on our more profitable channels.\nIn our Rest of World segment, China sales declined nine percent in local currency in the first nine months of 2025 due to continued weak consumer demand and the cessation of the appliance government subsidy programs in the third quarter. For the full year 2025, we project our third-party sales in China to decrease approximately 10 percent in local currency compared to 2024 as we expect economic challenges will persist in 2025. In the third quarter, we initiated an assessment of strategic opportunities for our China business, including strategic partnerships and other alternatives. We believe the China market has substantial long-term prospects and are committed to realizing the potential upside inherent in our China business.\nCombining all of these factors, we expect our 2025 consolidated sales to be flat to up one percent compared to 2024. Our guidance excludes the impacts from potential future acquisitions and any potential outcomes of the assessment of the China business.\nResults of Operations\n(dollars in millions)\nCost of products sold\nGross profit margin %\nSelling, general and administrative expenses\nOther expense (income), net\nEarnings before provision for income taxes\nProvision for income taxes\nOur sales in the third quarter of 2025 were $942.5 million, and were higher than the third quarter of 2024 sales of $902.6 million. Sales in the first nine months of 2025 were $2,917.7 million, and were higher than sales of $2,905.7 million in the same period last year. Compared to the prior year quarter, our net sales increase was primarily driven by price increases in response to higher input costs, including tariffs, and higher commercial water heater and boiler volumes, partially offset by lower volumes in China and the incremental sales related to the 2024 acquisition of Pureit which added approximately $17 million in the third quarter of 2025. Our net sales increase in the first nine months of 2025 was primarily driven by the price increases mentioned above, higher commercial water heater and boiler volumes, and incremental sales related to the 2024 acquisition of Pureit which added approximately $45 million in the first nine months of 2025. This more than offset lower volumes in China, lower residential water heater volumes in North America and unfavorable currency translation of approximately $9 million due to the depreciation of foreign currencies compared to the U.S. dollar.\nOur gross profit margin in the third quarter of 2025 was 38.7 percent, up compared to 37.4 percent in the third quarter of 2024. Gross profit margin in the first nine months of 2025 was 39.0 percent, up compared to the gross profit margin of 38.5 percent in the first nine months of 2024. The increases in gross profit margin in the third quarter and first nine months were primarily driven by the benefits of pricing actions implemented earlier this year to address increased input costs in North America.\nSelling, general, and administrative (SG&A) expenses in the third quarter of 2025 increased $12.3 million compared to the third quarter of 2024. SG&A expenses increased $15.5 million in the first nine months of 2025 compared to the prior year. The increases in SG&A expenses in the third quarter and first nine months of 2025 compared to the prior year periods were primarily due to higher employee costs, partially offset by benefits of our 2024 China restructuring actions.\nInterest expense in the third quarter of 2025 was $3.6 million compared to $1.5 million in the same period last year. Interest expense in the first nine months of 2025 was $11.1 million compared to $4.3 million in the same period the previous year. The increase in interest expense in the third quarter and first nine months of 2025 was primarily due to higher debt levels.\nOther expense (income), net for the third quarter of 2025 was expense of $0.2 million, compared to expense of $2.6 million for the third quarter of 2024. Other expense (income), net for the first nine months of 2025 was income of $1.4 million compared to expense of $0.5 million in the same period last year. The change in Other expense (income), net in the third quarter of 2025 was primarily due to lower foreign currency translation losses and lower interest income. The change in Other expense (income), net in the first nine months of 2025 was primarily due to lower foreign currency translation losses.\nOur effective income tax rate for the three and nine months ended September 30, 2025 was 23.2 percent and 24.1 percent, respectively. The effective income tax rate for the three and nine months ended September 30, 2024 was 23.3 percent and 23.7 percent, respectively. The change in the effective income tax rate for the three and nine months ended September 30, 2025 compared to the effective income tax rate for the three and nine months ended September 30, 2024 was primarily due to the geographical earnings mix. We estimate that our annual effective income tax rate for the full year of 2025 will be approximately 24 percent.\nNorth America Segment\n(dollars in millions)\nSales in our North America segment were $742.8 million in the third quarter of 2025, an increase of $39.5 million from $703.3 million in the third quarter of 2024. Sales in the first nine months of 2025 were $2,270.5 million, or $10.2 million higher than sales of $2,260.3 million in the same period last year. Compared to the prior year quarter, our net sales increase was primarily driven by the benefits of pricing actions as well as higher commercial water heater and boiler volumes. Our net sales increase in the first nine months of 2025 was driven by the pricing actions and higher commercial water heater and boiler volumes as mentioned above, that were partially offset by unfavorable currency translation of approximately $6 million and lower residential water heater volumes.\nNorth America segment earnings were $179.7 million in the third quarter of 2025, or $17.2 million higher than segment e"
}