{
  "source_file": "apa-20250930.htm",
  "form_type": "10-Q",
  "item1_clean": null,
  "item7_clean": null,
  "item2_clean": "ITEM 2\nMANAGEMENT’S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS\nThe following discussion relates to APA Corporation (APA or the Company) and its consolidated subsidiaries and should be read together with the Company’s Consolidated Financial Statements and accompanying notes included in Part I,\nItem 1—Financial Statements\nAPA is an independent energy company that owns subsidiaries that explore for, develop, and produce crude oil, natural gas, and natural gas liquids (NGLs). The Company’s business has oil and gas operations in three geographic areas: the U.S., Egypt, and offshore the U.K. in the North Sea (North Sea). APA also has active development, exploration and appraisal operations ongoing in Suriname, as well as exploration interests in Uruguay, Alaska, and other international locations that may, over time, result in reportable discoveries and development opportunities. As a holding company, APA Corporation’s primary assets are its ownership interests in its consolidated subsidiaries.\nAPA believes energy underpins global progress, and the Company wants to be a part of the solution as society works to meet growing global demand for reliable and affordable energy. APA strives to meet those challenges while creating value for all its stakeholders.\nUncertainties in the global supply chain and financial markets impact oil supply and demand and contribute to commodity price volatility. These uncertainties include the impacts of ongoing international conflicts, inflation, current and potential tariffs or other trade barriers, global trade policies, and actions taken by foreign oil and gas producing nations, including OPEC+. Despite these uncertainties, the Company remains committed to its longer-term objectives: (1) to invest for long-term returns in pursuit of moderate, sustainable production growth; (2) to strengthen the balance sheet to underpin the generation of cash flow in excess of its upstream exploration, appraisal, and development capital program that can be directed to debt reduction, share repurchases, and other return of capital to its shareholders; and (3) to responsibly manage its cost structure regardless of the oil price environment.\nThe Company closely monitors hydrocarbon pricing fundamentals to reallocate capital as part of its ongoing planning process. APA’s diversified asset portfolio and operational flexibility provide the Company the ability to timely respond to near-term price volatility and effectively manage its investment programs accordingly. For additional detail on the Company’s forward capital investment outlook, refer to “Capital Resources and Liquidity” below.\nIn the first quarter of 2025, the Company announced a significant cost reduction initiative. The Company’s primary objective is to drive sustainable cost savings for the long-term and is targeting $350 million in annualized savings across G&A, LOE, and capital by the end of 2025 and an additional $50 million to $100 million by the end of 2026. This will include reducing the Company’s overhead costs, addressing the capital cost structure for its drilling, completions, and facility investments, and improving efficiencies of day-to-day field operating practices.\nThe Company remains committed to its capital return framework for equity holders to participate more directly and materially in cash returns. The Company believes returning 60 percent of free cash flow through dividends and share repurchases creates a good balance for providing near-term cash returns to shareholders while still recognizing the importance of longer-term balance sheet strengthening.\nThe Company pays a quarterly dividend of $0.25 per share on its common stock.\nBeginning in the fourth quarter of 2021 and through the end of the third quarter of 2025, the Company has repurchased 95.5 million shares of the Company’s common stock. Subsequent to the quarter ended September 30, 2025 through October 31, 2025, the Company repurchased 1.0 million shares, and as of October 31, 2025, the Company had remaining authorization to repurchase up to 23.6 million shares under the Company’s share repurchase programs.\nFinancial and Operational Highlights\nIn the third quarter of 2025, the Company reported net income attributable to common stock of $205 million, or $0.57 per diluted share, compared to a net loss of $223 million, or $0.60 per diluted share, in the third quarter of 2024. In the first nine months of 2025, the Company reported net income attributable to common stock of $1.2 billion, or $3.20 per diluted share, compared to net income of $450 million, or $1.29 per diluted share, in the first nine months of 2024. The increase in net income in the third quarter and the first nine months of 2025 compared to the same prior-year periods was primarily driven by $1.1 billion of impairments recorded in the prior-year period. Lower operating expenses in the third quarter and first nine months of 2025, resulting largely from focused cost-reduction efforts undertaken in 2025, further contributed to the increase in net income.\nThe Company generated $3.7 billion of cash from operating activities during the first nine months of 2025, 45 percent higher than the first nine months of 2024. APA’s higher operating cash flows for the first nine months of 2025 were primarily driven by lower overall expenses, collection of outstanding receivables, and timing of other working capital items. The Company repurchased 10.2 million shares of its common stock for $215 million and paid $271 million in dividends to APA common stockholders during the first nine months of 2025. The Company exited the quarter with approximately $4.5 billion of debt, a reduction of $1.6 billion from year-end 2024.\nKey operational highlights include:\nDaily boe production from the Company’s U.S. assets, which decreased 7 percent from the third quarter of 2024, accounted for 61 percent of the Company’s worldwide production during the third quarter of 2025. The Company averaged six drilling rigs in the Permian Basin, including four rigs in the Southern Midland Basin and two rigs in the Delaware Basin in the third quarter of 2025. The Company brought online 42 operated wells during the quarter. The Company’s core Permian Basin development program continues to represent the key growth area for its U.S. assets.\nIn the Permian Basin, the Company is currently operating five rigs, reflecting improved capital efficiency while sustaining the pace of wells brought online. The Company anticipates continuing this level of activity to deliver consistent year-over-year oil production. Should oil prices decline, the Company may moderate activity in 2026 and further reduce capital spending, with minimal anticipated impact on 2026 oil volumes.\nAPA holds approximately 750,000 MMBtu/d of firm capacity on various pipelines. As of September 30, 2025, the Company had open basis swap contracts which purchased NYMEX Henry Hub/Waha and sold NYMEX Henry Hub/HSC on approximately two-thirds of its firm transport capacity for 2025 and including swap contracts entered into subsequent to September 30, 2025, approximately one-third for 2026, thereby locking in a significant portion of cash flows associated with its marketing activities for the near term. Refer to\nNote 4—Derivative Instruments and Hedging Activities\nfor further discussion of these basis swap agreements.\nIn Egypt, the Company averaged 12 drilling rigs and drilled 17 new productive wells during the third quarter of 2025. During the same period, the Company averaged 19 workover rigs as it continues to align its drilling and workover activity with a goal of driving improved capital efficiency. Third quarter 2025 gross and net production from the Company’s Egypt assets decreased 1 percent and increased 7 percent, respectively, from the third quarter of 2024.\nIn Egypt, following the recent success of the gas program and the relative softening of oil prices, the Company expects one-third of its activities to be gas-focused and anticipates continued strong performance for the rest of the year, with realized gas prices increasing through the period.\nThe Government of Egypt awarded the Company an additional two million net exploration acreage in the Western Desert. This new acreage expands on the Company’s existing position in the country. In addition to a signature bonus of $25 million, the Company has committed to a drilling program on the acreage that the Company believes it will be able to meet in the normal course of operations. The Government also helped facilitate significant payments in the third quarter, nearly eliminating EGPC’s past due receivables.\nResults of Operations\nOil, Natural Gas, and Natural Gas Liquids Production Revenues\nThe Company’s production revenues and respective contribution to total revenues by country were as follows:\n\nAmortization of debt issuance costs\nCapitalized interest\nGain on extinguishment of debt\nTotal Financing costs, net\nNet financing costs decreased $54 million and $221 million from the third quarter and the first nine months of 2024, respectively. The lower overall interest expense was primarily a result of lower outstanding credit facility borrowings compared to the prior-year periods. The decrease in net financing costs during the first nine months of 2025 was further driven by gains on extinguishment of debt from the Company’s cash tender purchases during the first quarter of 2025.\nProvision for Income Taxes\nThe Company estimates its annual effective income tax rate in recording its quarterly provision for income taxes in the various jurisdictions in which the Company operates. Non-cash impairments on the carrying value of the Company’s oil and gas properties, gains and losses on the sale of assets, statutory tax rate changes, and other significant or unusual items are recognized as discrete items in the quarter in which they occur.\nThe Company’s effective income tax rate for the three and nine months ended September 30, "
}