{
  "source_file": "apa-20241231.htm",
  "form_type": "10-K",
  "item1_clean": null,
  "item7_clean": "ITEM 7.\nMANAGEMENT’S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS\nAPA is an independent energy company that owns subsidiaries that explore for, develop, and produce crude oil, natural gas, and natural gas liquids (NGLs). The Company’s business has oil and gas operations in three geographic areas: the U.S., Egypt, and offshore the U.K. in the North Sea (North Sea). APA also has active development, exploration, and appraisal operations ongoing in Suriname, as well as exploration interests in Uruguay, Alaska, and other international locations that may, over time, result in reportable discoveries and development opportunities. As a holding company, APA Corporation’s primary assets are its ownership interests in its consolidated subsidiaries.\nAPA believes energy underpins global progress, and the Company wants to be a part of the solution as society works to meet growing global demand for reliable and affordable energy. APA strives to meet those challenges while creating value for all its stakeholders.\nUncertainties in the global supply chain and financial markets, including the impact of ongoing international conflicts, inflation, trade disputes, and actions taken by foreign oil and gas producing nations, including OPEC+, impact oil supply and demand and contribute to commodity price volatility. Despite these uncertainties, the Company remains committed to its longer-term objectives: (1) to invest for long-term returns in pursuit of moderate, sustainable production growth; (2) to strengthen the balance sheet to underpin the generation of cash flow in excess of its upstream exploration, appraisal, and development capital program that can be directed to debt reduction, share repurchases, and other return of capital to its shareholders; and (3) to responsibly manage its cost structure regardless of the oil price environment.\nThe Company closely monitors hydrocarbon pricing fundamentals to reallocate capital as part of its ongoing planning process. APA’s diversified asset portfolio and operational flexibility provide the Company the ability to timely respond to near-term price volatility and effectively manage its investment programs accordingly. For example, the Company curtailed production in the Permian Basin in the second half of 2024 in response to weakness in Waha natural gas and NGL prices; however, in Egypt, the Company contracted an additional drilling rig in late 2024 after signing an agreement to incentivize gas exploration and production at new pricing. In 2023, the Company decided to suspend drilling activity in the North Sea, as increasing cost and tax burdens impacted the competitiveness of these assets within the Company’s portfolio. Capital investment plans have accordingly been aligned across other areas of the portfolio while maintaining a focus on the Company’s capital returns framework.\nThe Company remains committed to its capital return framework for equity holders to participate more directly and materially in cash returns.\nThe Company believes returning 60 percent of free cash flow through dividends and share repurchases creates a good balance for providing near-term cash returns to shareholders while still recognizing the importance of longer-term balance sheet strengthening.\nThe Company pays a quarterly dividend of $0.25 per share on its common stock.\nBeginning in the fourth quarter of 2021 and through the end of 2024, the Company has repurchased 85.3 million shares of the Company’s common stock. Subsequent to year-end 2024 and through the date of this filing on February 28, 2025, the Company repurchased 3.9 million shares, and as of February 28, 2025, the Company had remaining authorization to repurchase up to 30.9 million shares under the Company’s share repurchase programs.\nFinancial and Operational Highlights\nDuring 2024, the Company reported net income attributable to common stock of $804 million, or $2.27 per diluted share, compared to net income of $2.9 billion, or $9.25 per diluted share, in 2023. Net income in 2024 was primarily impacted by impairments of $1.1 billion, which included oil and gas property impairments of $796 million in the North Sea and $315 million in the U.S., and lower realized crude oil and natural gas prices during the year compared to 2023. The Company also recorded higher oil and gas revenues and associated operating expenses resulting from the Callon acquisition.\nThe Company generated $3.6 billion of cash from operating activities in 2024, which was $491 million or 16 percent higher than 2023. APA’s higher operating cash flows for 2024 were primarily driven by higher oil and gas revenues resulting from increased drilling activity in the Permian Basin and production from the acquired Callon properties, partially offset by lower realized commodity prices. The Company repurchased 9.2 million shares of its common stock for $246 million and paid $353 million in dividends to APA common stockholders during 2024.\nKey operational highlights for the year include:\nDaily boe production from the Company’s U.S. assets, which increased 30 percent from 2023, accounted for 62 percent of the Company’s worldwide production during 2024. The Company averaged nine drilling rigs in the U.S. during the year, including five rigs in the Southern Midland Basin and four rigs in the Delaware Basin, and drilled and brought online 159 operated wells in 2024. The Company’s drilling was primarily focused on oil prospects, and combined with the Callon acquisition, oil production increased approximately 63 percent in the U.S. compared to the prior year. The Company’s core Permian Basin development program continues to represent key growth areas for the U.S. assets.\nDuring the first quarter of 2024, the Company completed a three-well exploration program in Alaska, confirming a working petroleum system on the Company’s acreage. The Company is currently drilling an additional exploration well on this acreage. The Company holds a 50 percent ownership interest in the project.\nIn Egypt, the Company continued its drilling and workover activity with a focus on oil prospects. The Company averaged 14 drilling rigs and drilled 62 new productive wells during 2024. During the same period, the Company averaged 20 workover rigs as it continues to align its drilling and workover activity with a goal of driving improved capital efficiency. The 2024 gross and net production from the Company’s Egypt assets decreased 6 percent and 4 percent, respectively, from 2023.\nDuring the fourth quarter of 2024, the Company entered into a new gas sales agreement which could result in improved pricing if certain production thresholds are met. The new gas sales agreement creates the potential for significant new drilling inventory with returns on par with oil.\nDuring the second quarter of 2023, the Company suspended all new drilling activity in the North Sea. During the third quarter of 2024, the Company continued its economic assessment of its North Sea assets in light of several new regulatory guidelines and obligations surrounding significant tax levies and modernization of aging infrastructure. The Company determined the expected returns do not economically support making investments required under the combined impact of the regulations, and it will cease production at its facilities in the North Sea prior to 2030. The Company’s investment program in the North Sea is now directed toward asset safety and integrity.\nIn October 2024, the Company announced that its subsidiary reached a positive final investment decision for the first oil development, named GranMorgu, in Block 58 offshore Suriname. This development will include production from the Krabdagu and Sapakara oil discoveries. These fields, located in water depths between 100 and 1,000 meters, will be produced through a system of subsea wells connected to a floating production, storage and offloading (FPSO) unit located 150 km off the Suriname coast, with an oil production capacity of 220,000 barrels per day. The GranMorgu FPSO unit is designed to accommodate future tie-back opportunities that would extend its 4-year production plateau and will feature technology that minimizes greenhouse gas emissions. Total investment is estimated at $10.5 billion, with APA’s share of the investment subject to the existing agreement with TotalEnergies to carry a portion of Apache’s appraisal and development capital. First oil is anticipated in 2028.\nAcquisition and Divestiture Activity\nOver the Company’s history, it has repeatedly demonstrated the ability to capitalize quickly and decisively on changes in its industry and economic conditions. A key component of this strategy is to continuously review and optimize APA’s portfolio of assets in response to these changes. Most recently, the Company has completed a series of acquisitions and divestitures designed to enhance the Company’s portfolio and monetize nonstrategic assets in order to allocate resources to more impactful exploration and development opportunities. These acquisitions and divestitures include:\nCallon Petroleum Company Acquisition\nOn April 1, 2024, APA completed its acquisition of Callon Petroleum Company (Callon) in an all-stock transaction valued at approximately $4.5 billion, inclusive of Callon’s debt (the Callon acquisition). The acquired assets include approximately 120,000 net acres in the Delaware Basin and 25,000 net acres in the Midland Basin. The Company believes the acquisition of Callon provides opportunities to reduce costs, improve capital efficiencies, leverage economies of scale, and expand the development inventory that formed the basis of the transaction value.\nSale of Non-core Permian Basin Properties\nOn December 31, 2024, APA completed the sale of non-core producing properties in the Permian Basin that had a carrying value of $1.1 billion and associated asset retirement obligation of $224 million for total cash proceeds of $869 million after closing adjustments. The properties are located in the Central Basin Platform, Texas and New Mexico Shelf, and Northwest Shelf.\nNon-core Acreage Divestiture\nDuring 2024, the Company completed the sale of non-core acreage in the East Texas Austin Chalk and Eagle Ford plays that had a carrying value of $347 million for aggregate cash proceeds of $255 million and the assumption of asset retirement obligations of $42 million.\nMineral Rights Divestiture\nDuring 2024, the Company also completed the sale of non-core mineral and royalty interests in the Permian Basin that had a carrying value of $71 million for approximately $394 million subject to post-closing adjustments.\nSales of Kinetik Shares\nDuring 2022 and 2023, the Company sold a portion of its Kinetik Shares for cash proceeds of $224 million and $228 million, respectively. During the first quarter of 2024, the Company sold its remaining shares of Kinetik Class A Common Stock for cash proceeds of $428 million. On April 3, 2024, the Company’s designated director resigned from the Kinetik Holdings, Inc. (Kinetik) board of directors.\nFor detailed information regarding APA’s acquisitions and divestitures, refer to\nNote 2—Acquisitions and Divestitures\nResults of Operations\nOil, Natural Gas, and Natural Gas Liquids Production Revenues\nThe Company’s production revenues and respective contribution to total revenues by country are as follows:\n\nIn December 2023, the Company established a commercial paper program under which it from time to time may issue in private placements exempt from registration under the Securities Act short-term unsecured promissory notes (the CP Notes) up to a maximum aggregate face amount of $1.8 billion outstanding at any time. The maturities of the CP Notes may vary but may not exceed 397 days from the date of issuance. Outstanding CP Notes are supported by available borrowing capacity under the Company’s committed revolving credit facilities for general corporate purposes, which as of December 31, 2024, included the $1.8 billion 2022 USD Agreement.\nPayment of the CP Notes has been unconditionally guaranteed on an unsecured basis by Apache, such guarantee effective until the first time that the aggregate principal amount of indebtedness under senior notes and debentures outstanding under Apache’s existing indentures is less than US$1.0 billion.\nThe CP Notes are sold under customary market terms in the U.S. commercial paper market at a discount from par or at par and bear interest at rates determined at the time of issuance.\nAs of December 31, 2024, the Company had $323 million in aggregate face amount of CP Notes outstanding, which is classified as long-term debt. As of December 31, 2023, there were no CP Notes outstanding.\nUnsecured Committed Term Loan Facility\nOn January 30, 2024, APA entered into a syndicated credit agreement under which the lenders committed an aggregate $2.0 billion for senior unsecured delayed-draw term loans to APA (Term Loan Credit Agreement) the proceeds of which could be used to refinance certain indebtedness of Callon only once upon the date of the closings under the Merger Agreement and Term Loan Credit Agreement. Of such aggregate commitments, $1.5 billion was for term loans that would mature three years after the date of such closings (3-Year Tranche Loans) and $500 million was for term loans that would mature 364 days after the date of such closings (364-Day Tranche Loans). Apache has guaranteed obligations under the Term Loan Credit Agreement effective until the aggregate principal amount of indebtedness under senior notes and debentures outstanding under Apache’s existing indentures first is less than $1.0 billion.\nOn April 1, 2024 (the Closing Date), APA closed the transactions under the Term Loan Credit Agreement, electing to borrow an aggregate $1.5 billion in 3-Year Tranche Loans maturing April 1, 2027 and to allow the lender commitments for the 364-Day Tranche Loans to expire. As of December 31, 2024, there were $900 million in 3-Year Tranche Loans remaining outstanding under the Term Loan Credit Agreement.\nLoan proceeds were used to refinance certain indebtedness of Callon upon the substantially simultaneous closing of APA’s acquisition of Callon pursuant to the Merger Agreement and to pay related fees and expenses. APA may at any time prepay loans under the Term Loan Credit Agreement.\nBorrowings under the Term Loan Credit Agreement bear interest at one of two rate options selected by APA, being either (i) an alternate base rate (as defined), plus a margin (Term Base Rate Margin) varying from 0.375% to 1.125% for 3-Year Tranche Loans until the second anniversary of the Closing Date, and 0.625% to 1.375% for 3-Year Tranche Loans after the second anniversary of the Closing Date, or (ii) an adjusted term SOFR rate (as defined), plus a margin (Term Applicable Margin) varying from 1.375% to 2.125% for 3-Year Tranche Loans until the second anniversary of the Closing Date, and 1.625% to 2.375% for 3-Year Tranche Loans after the second anniversary of the Closing Date.\nMargins are at varying rates per annum determined by reference to the senior, unsecured, non-credit enhanced, long-term indebtedness for borrowed money of APA, or if such indebtedness is not rated and the Apache guaranty is in effect, of Apache (Long-Term Debt Rating). As of December 31, 2024, Apache’s Long-Term Debt Rating applied, and the Term Base Rate Margin was 0.75% for 3-Year Tranche Loans, and the Term Applicable Margin was 1.75% for 3-Year Tranche Loans.\nAPA is subject to representations and warranties, covenants, and events of default under the Term Loan Credit Agreement, such as:\nA financial covenant requires APA to maintain an adjusted debt-to-capital ratio of not greater than 60 percent at the end of any fiscal quarter. At December 31, 2024, APA’s debt-to-capital ratio as calculated under the Term Loan Credit Agreement was 19 percent.\nA negative covenant restricts the ability of APA and its subsidiaries to create liens securing debt on their",
  "item2_clean": null
}