{
  "source_file": "apd-20250930.htm",
  "form_type": "10-K",
  "item1_clean": "As used in this report, unless the context indicates otherwise, the terms “we,” “our,” “us,” the “Company,” \"Air Products,\" or “registrant” include our controlled subsidiaries and affiliates.\nNotes to the consolidated financial statements that are referenced in the disclosures that follow can be found under Item 8,\nFinancial Statements and Supplementary Data\nAir Products and Chemicals, Inc., a Delaware corporation founded in 1940, is a world-leading industrial gases company that has built a reputation for its innovation, operational excellence, and commitment to safety and environmental stewardship. Focused on serving energy, environmental, and emerging markets and generating a cleaner future, we offer products and services that improve our customers’ operations and sustainability.\nWe serve a broad range of industries, including refining, chemicals, metals, electronics, manufacturing, medical, and food, providing essential industrial gases, related equipment, and applications expertise. We also develop, engineer, build, own, and operate some of the world’s largest clean hydrogen projects supporting the transition to low- and zero-carbon energy, particularly in industrial applications and the heavy-duty transportation sector. Additionally, our sale of equipment businesses provide specialized products such as turbomachinery, membrane systems, and cryogenic containers to customers worldwide.\nWe manage our operations, assess performance, and report earnings under five reportable segments: Americas, Asia, Europe, Middle East and India, and Corporate and other. Refer to Note 26,\nBusiness Segment and Geographic Information\n, to the consolidated financial statements for additional information.\nRegional Industrial Gases\nOur industrial gases business, which is organized and operated regionally in the Americas, Asia, Europe, and Middle East and India segments, produces and sells atmospheric gases such as oxygen, nitrogen, and argon (primarily recovered by the cryogenic distillation of air); process gases such as hydrogen, helium, carbon dioxide (\"CO\n\"), carbon monoxide, and syngas (a mixture of hydrogen and carbon monoxide); and specialty gases. Overall regional industrial gases sales constituted over 90% of consolidated sales in fiscal years 2025, 2024, and 2023, approximately half of which were attributable to atmospheric gases.\nEach of the regional industrial gases segments competes against three global industrial gas companies: Air Liquide S.A., Linde plc, and Messer Group GmbH, as well as regional competitors. Competition in industrial gases is based primarily on price, reliability of supply, and the development of industrial gas applications. We derive a competitive advantage in locations where we have pipeline networks, which enable us to provide a reliable and economic supply of products to our larger customers.\nIndustrial gases are generally produced at or near the point of use due to the complexity and inefficiency of storing molecules at low temperatures. The industrial gases business develops, builds, and operates equipment for the production and processing of gases. Atmospheric gases are produced through various air separation processes, with cryogenic distillation being the most prevalent, while process gases are produced by methods other than air separation.\nHydrogen is a process gas that is typically produced by purifying byproduct sources obtained from chemical and petrochemical industries without carbon capture, commonly referred to as “gray hydrogen.” We primarily produce gray hydrogen. In addition, we are advancing projects that produce low-carbon hydrogen from hydrocarbons with carbon capture (“blue hydrogen”) and carbon-free hydrogen from renewable energy (“green hydrogen”), such as the NEOM Green Hydrogen Project in Saudi Arabia. In fiscal year 2025, we exited certain clean energy projects as discussed in Note 5,\nBusiness and Asset Actions\n, to the consolidated financial statements. Despite these actions, we continue to see opportunity in clean energy and are pursuing focused investments in scalable, economically viable solutions that support long-term shareholder value.\nElectricity is the largest cost component in the production of atmospheric gases. To produce hydrogen, carbon monoxide, and syngas, steam methane reformers use natural gas as the primary raw material, while gasifiers use liquid and solid hydrocarbons. We mitigate electricity, natural gas, and hydrocarbon price fluctuations contractually through pricing formulas, surcharges, cost pass-through provisions, and tolling arrangements. During fiscal year 2025, we did not encounter significant difficulties in obtaining adequate supplies of power and natural gas.\nHelium is produced as a byproduct of gases extracted from underground reservoirs, primarily natural gas and CO\npurified before resale. Because helium is generally sourced globally at long distances from point of sale, we maintain an inventory of helium in our fleet of ISO containers as well as in underground storage facilities in Amarillo, Texas and Beaumont, Texas.\nWe distribute product to our industrial gas customers through either our on-site or merchant supply mode depending on various factors, including the customer's volume requirements and location. Each sale of gas supply mode is described below:\n— This supply mode serves customers primarily in the energy production and refining, chemical, metals, and electronics industries worldwide, where large and relatively consistent volumes of industrial gases are required. Gases are produced and supplied through large facilities constructed or acquired on or near customer facilities, or by pipeline systems from centralized production locations. These sale of gas arrangements are generally governed by long-term contracts ranging from 15- to 20-years. We also deliver smaller quantities of product through small on-site plants (cryogenic or non-cryogenic generators), generally under 10- to 15-year contracts. Contracts in this supply mode commonly include fixed monthly charges and/or minimum purchase requirements with price escalation provisions that are typically based on external indices. Our on-site supply mode generates approximately half our total company sales.\n— This supply mode includes liquid bulk and packaged gas products. Liquid bulk gases are delivered in either liquid or gaseous form via tanker or tube trailer and stored, usually in its liquid state, in equipment that we typically design and install at the customer’s site for vaporizing into a gaseous state as needed. Packaged gases customers receive small quantities of product delivered in either cylinders or dewars, with operations in Europe, Asia, and Latin America. Sales of both liquid bulk and packaged gases do not include minimum purchase requirements, as they are governed by contracts and/or purchase orders that reflect the customer's specific needs. These contracts contain stated terms that are generally five years or less.\nWe maintain inventory in locations that facilitate supply of products to customers on a reasonable delivery schedule. Inventory consists primarily of crude helium, specialty gases, and other industrial gases supplied via the merchant gases supply mode.\nThe refining industry uses hydrogen to facilitate the conversion of heavy crude feedstock and lower the sulfur content of gasoline and diesel fuels. This produces cleaner transportation fuels that can be used with other equipment\n\nto significantly reduce emissions that contribute to climate change. Many other industries that already benefit from hydrogen’s unique properties to improve quality, optimize performance, and reduce costs are also looking to hydrogen as a fuel that can help decarbonize their manufacturing processes.\nThe chemicals industry uses hydrogen, oxygen, nitrogen, carbon monoxide, and syngas as feedstocks in the production of many basic chemicals. The energy production industry uses nitrogen injection for enhanced recovery of oil and natural gas and oxygen for gasification. Oxygen is used in combustion and industrial heating applications, including in the steel, certain nonferrous metals, glass, and cement industries. Nitrogen applications are used in food processing for freezing and preserving flavor, and nitrogen is used for inerting in various fields, including the metals, chemical, and semiconductor industries. Helium is used for its unique properties as an inert gas with an extremely low boiling point. It is widely used in semiconductor and fiber optics manufacturing, MRI magnet cooling, and for purging and pressurizing rocket fuel systems in aerospace launches. Additional applications include use in laboratories, cryogenics, and as a shielding gas in arc welding. Argon is used in the metals and other industries for its unique inerting, thermal conductivity, and other properties. Industrial gases are also used in welding and providing healthcare and are utilized in various manufacturing processes to make them more efficient and to optimize performance.\nIndustrial Gases Equipment\nWe design and manufacture equipment for air separation, hydrocarbon recovery and purification, and liquid helium and liquid hydrogen transport and storage. The Corporate and other segment includes activity related to the sale of cryogenic and gas processing equipment for air separation. The equipment is sold worldwide to customers in a variety of industries, including chemical and petrochemical manufacturing, oil and gas recovery and processing, and steel and primary metals processing. The Corporate and other segment also includes the results of our Rotoflow business, which manufactures turboexpanders and other precision rotating equipment, and our Gardner Cryogenics business, which fabricates helium and hydrogen transport and storage containers.\nSteel, aluminum, and capital equipment subcomponents such as compressors are the principal raw materials in the manufacturing of equipment. Raw materials for individual projects typically are acquired under firm purchase agreements. Equipment is produced at our manufacturing sites with certain components procured from subcontractors and vendors.\nCompetition in the equipment business is based primarily on plant efficiency and technological performance, service, technical know-how, and price, as well as schedule and plant performance guarantees. Our sale of equipment supply mode constituted less than 10% of consolidated sales in fiscal years 2025, 2024, and 2023.\nOur former liquefied natural gas (\"LNG\") process technology and equipment business was included in the Corporate and other segment until its sale to Honeywell International Inc. on 30 September 2024. The LNG business generated operating income of approximately $135 million in fiscal year 2024 and $120 million in fiscal year 2023. As a result of the sale, we recognized a pre-tax gain of approximately $1.6 billion during the fourth quarter of fiscal year 2024, reported within \"Gain on sale of business\" on our consolidated income statements. This gain was not recorded in the results of the Corporate and other segment. Refer to Note 4,\nGain on Sale of Business\n, to the consolidated financial statements for additional information.\nWe do not have a homogeneous customer base or end market, and no single customer accounts for more than 10% of our consolidated sales. We do have concentrations of customers in specific industries, primarily refining, chemicals, and electronics. Within each of these industries, we have several large-volume customers with long-term contracts. A negative trend affecting one of these industries, or the loss of one of these major customers, although not material to our consolidated sales, could have an adverse impact on our financial results.\nWhile seasonality does not materially affect our long-term performance, it may result in variability in quarterly financial results.\nGovernmental Contracts\nOur business is not subject to a government entity’s",
  "item7_clean": "Item 7. Management's Discussion and Analysis of Financial Condition and Results of Operations\nResults of Operations\nReconciliations of Non-GAAP Financial Measures\nLiquidity and Capital Resources\nCritical Accounting Policies and Estimates\nForward-Looking Statements\"\nThe financial measures discussed below are presented in accordance with U.S. generally accepted accounting principles (\"GAAP\"), except as noted. We present certain financial measures on an \"adjusted\", or \"non-GAAP\", basis because we believe such measures, when viewed together with financial results computed in accordance with GAAP, provide a more complete understanding of the factors and trends affecting our historical financial performance. For each non-GAAP financial measure, including adjusted operating income, adjusted operating margin, adjusted earnings per share (\"EPS\"), adjusted EBITDA, adjusted effective tax rate, and capital expenditures, we present a reconciliation to the most directly comparable financial measure calculated in accordance with GAAP. These reconciliations and explanations regarding the use of non-GAAP financial measures are presented under the “\nReconciliations of Non-GAAP Financial Measures\n” section beginning on page\nComparisons included in the discussion that follows are for fiscal year 2025 versus (\"vs.\") fiscal year 2024. A discussion of changes from fiscal year 2023 to fiscal year 2024 and other financial information related to fiscal year 2023 is available in\nManagement’s Discussion and Analysis of Financial Condition and Results of Operations\nFor information concerning activity with our related parties, refer to Note 25,\nSupplemental Information\n, to the consolidated financial statements.\nBUSINESS OVERVIEW\nAir Products and Chemicals, Inc., a Delaware corporation founded in 1940, is a world-leading industrial gases company that has built a reputation for its innovation, operational excellence, and commitment to safety and environmental stewardship. Focused on serving energy, environmental, and emerging markets and generating a cleaner future, we offer products and services that improve our customers’ operations and sustainability.\nWe serve a broad range of industries, including refining, chemicals, metals, electronics, manufacturing, medical, and food, providing essential industrial gases, related equipment, and applications expertise. We also develop, engineer, build, own, and operate some of the world’s largest clean hydrogen projects supporting the transition to low- and zero-carbon energy, particularly in industrial applications and the heavy-duty transportation sector. Additionally, our sale of equipment businesses provide specialized products such as turbomachinery, membrane systems, and cryogenic containers to customers worldwide. For additional information on our product and service offerings, including production, distribution, and end use, refer to Item 1,\nWe conduct business in approximately 50 countries and regions throughout the world. Our industrial gases business is organized and operated regionally in the Americas, Asia, Europe, and Middle East and India segments and generates the majority of our sales via our on-site and merchant supply modes. Approximately half our total revenue is generated through the on-site supply mode, which is governed by contracts that are generally long-term in nature with provisions that allow us to pass through changes in energy costs to our customers.\nOur Corporate and other segment includes the results of our sale of equipment businesses, costs for corporate support functions and global management activities, and other income and expenses not directly associated with the regional segments, such as foreign exchange gains and losses. In fiscal year 2024, this segment also included the results of our former liquefied natural gas (\"LNG\") process technology and equipment business, which we sold to Honeywell International Inc. on 30 September 2024.\nFor additional information regarding our supply modes and business segments, refer to Note 7,\nBusiness Segment and Geographic Information\n, to the consolidated financial statements.\n2025 IN SUMMARY\nFiscal year 2025 was a transitional year for Air Products, marked by a renewed focus on our core industrial gas business under the leadership of our new Chief Executive Officer, who joined the Company in February 2025. We took decisive actions to reshape our portfolio, including the cancellation and descoping of several large energy transition projects, and enhance operations through targeted productivity initiatives. We also sharpened our approach to capital deployment, emphasizing strict return thresholds, appropriate risk-sharing, and alignment with long-term customer relationships. These efforts are helping to improve execution and support reductions in capital expenditures and debt over time.\nKey results versus the prior year include:\nSales of $12.0 billion decreased 1%, or $63.3, as 4% lower volumes were partially offset by 2% higher energy cost pass-through to customers and 1% higher pricing driven by non-helium merchant products across all regions. Lower volumes primarily reflect the September 2024 LNG sale, lower global helium demand, and previously announced project exits, partially offset by higher on-sites and favorable non-helium merchant.\nOperating loss was $877.0 compared to operating income of $4.5 billion in fiscal year 2024. The operating loss in fiscal year 2025 included approximately $3.7 billion in pre-tax charges related to business and asset actions ($3.0 billion after tax, or $13.68 per share).\n\n% Change from prior year\nOUTLOOK\nAs we look ahead, we believe Air Products is well-positioned to deliver sustainable growth through a renewed focus on our core industrial gas business. Decisive actions taken in fiscal year 2025, including the cancellation and descoping of several large energy transition projects and other targeted productivity initiatives, reflect our commitment to disciplined capital allocation and operational excellence. These actions allow us to concentrate resources on opportunities that will deliver the greatest value to our shareholders.\nWhile clean energy markets have not developed as previously anticipated, we remain confident in the long-term demand fundamentals for industrial gases and clean energy solutions. We continue to pursue opportunities in both traditional industrial gas and energy transition projects that meet our projected return requirements. Additionally, we have made significant progress on the construction of several energy transition projects, including the NEOM Green Hydrogen Project, which we expect to come onstream and deliver green ammonia in 2027.\nIn fiscal year 2026, we expect to achieve earnings growth from new plant onstreams, continued pricing discipline, and productivity improvements. We remain committed to cost control, a reduction in capital expenditures, and other measures aimed at unlocking value and generating cash. Cost discipline remains a top priority as we seek to mitigate the impact of ongoing inflationary pressures and continued helium headwinds, while continuing to reward shareholders through increased dividends, as we have done for the past 43 consecutive years.\nRESULTS OF OPERATIONS\nDISCUSSION OF CONSOLIDATED RESULTS\nChange vs. Prior Year\nFiscal Year Ended 30 September\nOperating income (loss)\nEquity affiliates’ income\nAdjusted operating income\nAdjusted operating margin\n** Change versus prior period is not meaningful due to charges for business and asset actions recorded in fiscal year 2025.\nThe table below summarizes the major factors that impacted consolidated sales for the periods presented:\nEnergy cost pass-through to customers\nTotal Consolidated Sales Change\nSales of $12.0 billion decreased 1%, or $63.3, as lower volumes of 4% were partially offset by higher energy cost pass-through to customers of 2% and favorable pricing of 1%. Lower volumes primarily reflect the September 2024 LNG sale, lower global helium demand, and the previously announced project exits, partially offset by higher on-sites and favorable non-helium merchant. The overall pricing improvement reflects a 2% increase in our merchant business, which was driven by non-helium product lines in our Europe and Americas segments. Currency was flat versus the prior year.\nCost of Sales and Gross Margin\nCost of sales of $8.3 billion increased 1%, or $87.3, due to higher energy cost pass-through to customers of $278, higher costs of $73, higher power and fuel costs in our merchant business of $49, and an unfavorable currency impact of $12. The higher costs of $73 were driven by fixed-cost inflation and depreciation, partially offset by productivity improvements. These impacts were partially offset by lower costs of $325 attributable to lower sales volumes. Gross margin of 31.4% decreased 110 bp from 32.5% in the prior year primarily due to higher costs and increased energy cost pass-through to customers.\nSelling and Administrative Expense\nSelling and administrative expense of $906.1 decreased 4%, or $36.3, as our productivity actions were partially offset by labor inflation. Selling and administrative expense as a percentage of sales decreased to 7.5% from 7.8% in the prior year.\nResearch and Development Expense\nResearch and development expense of $96.3 decreased 4%, or $3.9. Research and development expense as a percentage of sales of 0.8% was flat versus the prior year.\nBusiness and Asset Actions\nThe charges we record for business and asset actions are not recorded in segment results. Additional information regarding these actions can be found in Note 5,\nBusiness and Asset Actions\n, to the consolidated financial statements.\nIn fiscal year 2025, total pre-tax charges related to business and asset actions were approximately $3.7 billion ($3.0 billion attributable to Air Products after tax, or $13.68 per share) compared to $57.0 ($43.8 after tax, or $0.20 per share) in fiscal year 2024.\nDuring the second quarter of fiscal year 2025, our Board of Directors and Chief Executive Officer initiated a project review to focus resources on projects we believe will deliver the greatest value to our shareholders. As a result of this review, we made the decision to exit various projects, primarily related to clean energy generation and distribution. The review remains ongoing and may result in additional costs in future periods. In connection with this review, we recognized project exit costs totaling approximately $3.6 billion, primarily consisting of noncash asset write-downs and estimated costs to terminate contractual commitments. Costs attributable to our noncontrolling partners totaled $10.7.\nThe remaining charge of $123.7 in fiscal year 2025 related to severance and other employee benefits under a global cost reduction program initiated in June 2023. Fiscal year 2024 costs under the plan totaled $57.0. Once all actions under the plan are fully executed, we expect to realize annual pre-tax savings of approximately $240 to $260, primarily through selling and administrative expense.\nOur estimates related to the actions discussed above reflect our best judgment based on information available as of 30 September 2025. Final settlement of these items may differ materially from our current estimates, which could impact our consolidated financial statements in future periods.\nShareholder Activism-Related Costs\nShareholder activism-related costs totaling $86.3 ($71.7 after tax, or $0.32 per share) were reflected in our consolidated income statements during the first three quarters of fiscal year 2025. These costs were recorded in connection with a proxy contest that concluded in January 2025 following certification of the election of directors at the 2025 Annual Meeting of Shareholders. These costs were not allocated to our reportable segments. No shareholder activism-related charges were recorded during the fourth quarter.\nOf the total $86.3 reflected on our fiscal year 2025 income statement, $31.9 related to legal and professional service fees and proxy solicitation expenses incurred directly by Air Products, primarily during the first quarter. In the second quarter, $29.7 was recorded for executive separation costs following the Board of Directors’ appointment of a new Chief Executive Officer in February 2025, which included a noncash expense of $22.4 to accelerate vesting of share-based awards and $7.3 in severance and other cash benefits. The remaining $24.7 was authorized and paid during the third quarter as a reimbursement to Mantle Ridge LP and its affiliated entities (collectively, “Mantle Ridge”) for expenses incurred in connection with the proxy contest. The reimbursement was unanimously approved by our Board of Directors, with one director abstaining from the vote due to his role as founder and Chief Executive Officer of Mantle Ridge.\nSupplemental Information\n, for additional information.\nGain on Sale of Business\nIn April 2025, we completed the sale of our 100% ownership interest in a consolidated subsidiary in Singapore for cash proceeds of $104.3. We recognized a gain of $67.3 ($51.9 after tax, or $0.23 per share) in connection with the transaction during the third quarter of fiscal year 2025. Prior to the divestiture, the subsidiary contributed annual sales of approximately $50 to our Asia segment.\nOn 30 September 2024, we completed the sale of our LNG business to Honeywell International Inc. As a result of the transaction, we recorded a gain of $1.6 billion ($1.2 billion after tax, or $5.38 per share) during the fourth quarter of fiscal year 2024. Prior to the divestiture, the results of the LNG business were reflected within the Corporate and other segment.\nThe gains from the sale of the businesses discussed above were not recorded in segment results. Refer to Note 4,\nGain on Sale of Business\n, to the consolidated financial statements for additional information.\nOther Income (Expense), Net\nOther income of $110.1 increased 89%, or $51.9. The increase was primarily driven by a $31.3 gain ($23.8 after tax, or $0.11 per share) on the sale of a regional office in Hersham, England, during the third quarter of fiscal year 2025. This gain is not reflected in the results of the Europe segment.\nOperating Income (Loss) and Operating Margin\nOperating loss was $877.0 in fiscal year 2025 compared to income of $4.5 billion in the prior year.\n\nSales of $520.0 decreased 41%, or $358.4, and operating loss of $367.3 increased 25%, or $74.6, primarily due to the divestiture of the LNG business in September 2024. Operating income generated by the LNG business in the prior year was approximately $135. This headwind was partially offset by lower changes to sale of equipment project estimates and productivity improvements, net of fixed-cost inflation.\nEquity affiliates' income of $12.4 decreased 39%, or $8.0, driven by lower contributions from an affiliate in Algeria.\nRECONCILIATIONS OF NON-GAAP FINANCIAL MEASURES\n(Millions of U.S. Dollars unless otherwise indicated, except for per share data)\nWe present certain financial measures, other than in accordance with U.S. generally accepted accounting principles (\"GAAP\"), on an \"adjusted\" or \"non-GAAP\" basis. On a consolidated basis, these measures include adjusted operating income, adjusted operating margin, adjusted earnings per share (\"EPS\"), adjusted EBITDA, the adjusted effective tax rate, and capital expenditures. On a segment basis, we present adjusted EBITDA. In addition to these measures, we also present certain supplemental non-GAAP financial measures to help the reader understand the impact that certain disclosed items, or \"non-GAAP adjustments,\" have on the calculation of our adjusted EPS. For each non-GAAP financial measure, we present a reconciliation to the most directly comparable financial measure calculated in accordance with GAAP.\nWe provide these non-GAAP financial measures to allow investors, potential investors, securities analysts, and ",
  "item2_clean": null
}