{
  "source_file": "apo-20250930.htm",
  "form_type": "10-Q",
  "item1_clean": null,
  "item7_clean": null,
  "item2_clean": "ITEM 2. MANAGEMENT’S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS\nThe following discussion should be read in conjunction with Apollo Global Management, Inc.’s condensed consolidated financial statements and the related notes within this quarterly report. This discussion contains forward-looking statements that are subject to known and unknown risks and uncertainties. Actual results and the timing of events may differ significantly from those expressed or implied in such forward-looking statements due to a number of factors, including those included in the section entitled “Item 1A. Risk Factors” in the 2024 Annual Report. The highlights listed below have had significant effects on many items within our condensed consolidated financial statements and affect the comparison of the current period’s activity with those of prior periods.\nFounded in 1990, Apollo is a high-growth, global alternative asset manager and a retirement services provider. Apollo conducts its business primarily in the United States through the following three reportable segments: Asset Management, Retirement Services and Principal Investing. These business segments are differentiated based on the investment services they provide as well as varying investing strategies. As of September 30, 2025, Apollo had a team of 6,104 employees, including 1,997 employees of Athene and 609 employees of Bridge.\nOur Asset Management segment focuses on credit and equity investing strategies. We have a flexible mandate in many of the funds we manage which enables the funds to invest opportunistically across a company’s capital structure. We raise, invest and manage funds, accounts and other vehicles on behalf of some of the world’s most prominent pension, endowment and sovereign wealth funds and insurance companies, as well as other institutional and individual investors. As of September 30, 2025, we had total AUM of $908 billion.\nThe credit and equity investing strategies of our Asset Management segment reflect the range of investment capabilities across our platform, from investment grade to private equity. As an asset manager, we earn fees for providing investment management services and expertise to our client base. The amount of fees charged for managing these assets depends on the underlying investment strategy, liquidity profile, and, ultimately, our ability to generate returns for our clients. We also earn capital solutions fees as part of our growing capital solutions business and as part of monitoring and deployment activity alongside our private equity franchise. After expenses, we call the resulting earnings stream “Fee Related Earnings” or “FRE”, which represents the primary performance measure for the Asset Management segment.\nCredit is our largest asset management strategy with $723 billion of AUM as of September 30, 2025. Our credit strategy spans third-party strategies and Apollo’s retirement services business across four main investment pillars: direct origination, asset-backed, multi credit and opportunistic credit. Our credit strategy provides flexible, scaled and diverse capital solutions across the entire credit risk-return spectrum, with a focus on generating excess returns through high-quality credit underwriting and origination. Beyond participation in the traditional issuance and secondary credit markets, through our origination platforms and corporate solutions capabilities we seek to originate attractive and safe-yielding assets for the investors in the funds we manage.\nOur equity strategy managed $185 billion of AUM as of September 30, 2025. Across our equity strategy, we maintain our focus on creative structuring and sourcing while working with the management teams of the portfolio companies of the Apollo-managed funds to help transform and grow their businesses. Our flexible mandate and purchase price discipline allow us to embrace complexity and seek attractive outcomes for our stakeholders. Apollo’s equity team has experience across sectors, industries, and geographies spanning its private equity, hybrid value, secondaries equity, AAA, real estate equity, impact investing, infrastructure and clean transition equity strategies. We have consistently produced attractive long-term investment returns in the traditional private equity funds we manage, generating a 39% gross IRR and a 24% net IRR on a compound annual basis from inception through September 30, 2025.\nAcquisition of Bridge\nOn September 2, 2025, we completed the previously announced acquisition of Bridge in an all-stock transaction. As a result, Bridge became a consolidated subsidiary of AAM, and its results are included in the condensed consolidated financial statements commencing from the Acquisition Date.\n\nAmounts exclude certain performance fees from business development companies and Redding Ridge Holdings, an affiliate of Redding Ridge.\nAmounts were computed based on the fair value of fund investments on September 30, 2025. Performance fees have been allocated to and recognized by the general partner. Based on the amount allocated, a portion is subject to potential reversal or, to the extent applicable, has been reduced by the general partner obligation to return previously distributed performance fees at September 30, 2025. The actual determination and any required payment of any such general partner obligation would not take place until the final disposition of the fund’s investments based on contractual termination of the fund.\nRepresents the amount of performance fees that would be reversed if remaining fund investments became worthless on September 30, 2025. Amounts subject to potential reversal of performance fees include amounts undistributed by a fund (\n, the performance fees receivable), as well as a portion of the amounts that have been distributed by a fund, net of taxes and not subject to a general partner obligation to return previously distributed performance fees, except for those funds that are gross of taxes as defined in the respective funds’ governing documents.\nOther includes certain SIAs.\nProperty Management, Development and Other Fees\nApollo provides property management services through Bridge. Apollo earns property management fees over time as the related services are provided under the terms of the respective property management agreements. Apollo also earns leasing commission revenue associated with the leasing of commercial assets, which is recognized upon the execution of the applicable lease agreements, and records development fees as the services are provided under the terms of the applicable development agreements. Other fees are primarily composed of interest on catch-up management fees, fees related to accounting, in-house legal and tax professional services.\nCompensation and Benefits\nThe most significant expense in our asset management business is compensation and benefits expense. This consists of fixed salary, discretionary and non-discretionary bonuses, profit sharing expense associated with the performance fees earned and compensation expense associated with the vesting of non-cash equity-based awards.\nOur compensation arrangements with certain employees contain a significant performance-based incentive component. Therefore, as our net revenues increase, our compensation costs rise. Our compensation costs also reflect the increased investment in people as we expand geographically and create new funds.\nIn addition, certain professionals and selected other individuals have a profit sharing interest in the performance fees earned in order to better align their interests with our own and with those of the investors in the funds we manage. Profit sharing expense is part of our compensation and benefits expense and is generally based upon a fixed percentage of performance fees. Certain of our performance-based incentive arrangements provide for compensation based on realized performance fees which includes fees earned by the general partners of the funds we manage under the applicable fund limited partnership agreements based upon transactions that have closed or other rights to incentive income cash that have become fixed in the applicable calendar year period. Profit sharing expense can reverse during periods when there is a decline in performance fees that were previously recognized. Profit sharing amounts are normally distributed to employees after the corresponding investment gains have been realized. Therefore, changes in our unrealized performance fees have the same effect on our profit sharing expense. Profit sharing expense increases when unrealized performance fees increase. Realizations only impact profit sharing expense to the extent that the effects on investments have not been recognized previously. If losses on other investments within a fund are subsequently realized, the profit sharing amounts previously distributed are normally subject to a general partner obligation to return performance fees previously distributed back to the funds. This general partner obligation due to the funds would generally be realized only when the fund is liquidated, which generally occurs at the end of the fund’s term. However, indemnification obligations also exist for realized gains with respect to certain funds, which, although our Former Managing Partners and Contributing Partners would remain personally liable, may indemnify our Former Managing Partners and Contributing Partners for 17.5% to 100% of the previously distributed profits regardless of the fund’s future performance. See note 16 to our condensed consolidated financial statements for further information regarding the Company’s indemnification liability.\nThe Company grants equity awards to certain employees, including RSUs and restricted shares of common stock, that generally vest and become exercisable in quarterly installments or annual installments depending on the award terms. In some instances, vesting of an RSU is also subject to the Company’s"
}