{
  "source_file": "apo-20241231.htm",
  "form_type": "10-K",
  "item1_clean": "Within the asset management business, Apollo operates in an intensely competitive industry, and expects it to remain so. We compete globally and on a regional, industry and niche basis.\nWe face competition both in the pursuit of investor capital and in making investments on behalf of funds and accounts we manage across credit and equity asset classes. We compete for investor capital based on a variety of factors, including:\ninvestment performance as a metric for assessing excess return per unit of risk;\ninvestor perception of investment managers’ drive, focus and alignment of interest;\nquality of service provided to and duration of relationship with investors;\nbusiness reputation; and\nthe level of fees and expenses charged for services.\nCompetition is also intense for the attraction and retention of qualified employees. Our ability to continue to compete effectively within our industry will depend upon our ability to attract new employees and retain and motivate our existing employees.\nAthene faces competition from a variety of large and small industry participants, including diversified financial institutions and insurance and reinsurance companies. These companies compete in one form or another for the growing pool of retirement assets driven by a number of external factors such as the continued aging of the population and the reduction in safety nets provided by governments and private employers. In the markets in which Athene operates, scale and the ability to provide value-added services and build long-term relationships are important factors to compete effectively. Athene believes that its leading presence in the retirement services market, diverse range of capabilities and broad distribution network uniquely position it to effectively serve consumers’ increasing demand for retirement solutions.\nAthene experiences competition in the fixed annuity market from all traditional carriers and new entrants. Principal competitive factors for fixed annuities are initial crediting rates, reputation for renewal crediting action, product features, brand recognition, customer service, distribution capabilities and financial strength ratings of the provider. Competition may affect, among other matters, both business growth and the pricing of products and services.\nReinsurance markets are highly competitive, as well as cyclical by product and market. As a reinsurer, Athene competes based on many factors, including, among other things, financial strength, pricing and other terms and conditions of reinsurance agreements, reputation, service, and experience in the types of business underwritten. The impact of these and other factors is generally not consistent across lines of business, domestic and international geographical areas, and distribution channels. Within the reinsurance market, Athene competes with other insurance and reinsurance companies.\nAthene encounters strong competition within its institutional channel. With respect to funding agreements, namely those issued in connection with its FABN program, Athene competes with other insurers that have active FABN programs. Within the funding agreement market, it competes primarily on the basis of perceived financial strength, interest rates and term. With respect to group annuities, Athene competes with other insurers that offer such annuities. Within the pension group annuities market, it competes primarily on the basis of price, underwriting, investment capabilities and its ability to provide quality service to the corporate sponsor’s pension participants.\nFinally, Athene experiences competition in the market for acquisition targets and profitable blocks of insurance. Such competition is likely to intensify as insurance businesses become more attractive acquisition targets for both other insurance\ncompanies and financial institutions and as the already substantial consolidation in the financial services industry continues. Athene competes for potential acquisition and block reinsurance opportunities based on a number of factors including perceived financial strength, brand recognition, reputation and the pricing it is able to offer, which, to the extent Athene determines to finance a transaction, is in turn dependent on its ability to do so on suitable terms. Athene believes its demonstrated ability to source and consummate large and complex transactions is a competitive advantage over other potential acquirers.\nFor additional information concerning the competitive risks that we face, see “Item 1A. Risk Factors—Operating Risks—\nWe operate in highly competitive industries, which could limit our ability to achieve our growth strategies and could materially and adversely affect our businesses, financial condition, results of operations, cash flows and prospects.”\nApollo’s talent is instrumental to our success as a global alternative asset manager and retirement services provider. Investing in and fostering a modern and inclusive high-performance culture is core to operating our business and delivering positive outcomes for our shareholders and fund investors, and our employee value proposition is designed to engage and develop our talent to deliver maximum impact. We believe our commitment to expanding opportunity across our ecosystem is central to the Apollo business model, an integrated platform which fosters strong collaboration across businesses and functions. Rooted in our core values, we strive to build a culture where all of our people can excel and grow in their careers.\nWe believe that ongoing professional development is a critical part of our culture at Apollo and an important enabler of our investment process. Because of our entrepreneurial culture, the breadth of our integrated platform, and our reputation for strong investment performance, we believe we can attract, develop and retain top talent. We have development programs in place across a variety of levels which demonstrate our commitment to developing, engaging and retaining our employees. In addition to our training and annual review programs, we have instituted annual employee surveys that measure employee satisfaction and engagement and help evaluate and guide human capital decision-making. We work in partnership with our employees to maintain a strong culture which prioritizes excellence and outperforming expectations to advance our goal of being a modern high-performance workplace that is also great place to work.\nCompensation and Benefits\nWe work to offer a compelling employee value proposition to reward strong performance and support our employees’ professional development and well-being. Our pay for performance compensation philosophy is designed to reward employees for performance and to align employee interests with the firm’s long-term growth and with our shareholders. All of our employees are granted stock through a range of equity-based compensation programs, including our One Apollo stock program. Our benefits programs are intended to support our employees and their families, and include healthcare, wellness initiatives, retirement programs, paid time off and family leave.\nExpanding Opportunity\nApollo is committed to championing opportunity and fostering a culture of excellence where everyone has an opportunity to thrive. We make talent decisions based on the qualities necessary to succeed in our modern high-performance workplace, focusing on skills, experience, and performance that drive results, rather than demographic characteristics or preferences. Reducing individuals to a single trait — whether gender, race, or ethnicity — misses the full picture of their capabilities, contributions, and potential impact. At the same time, we believe that a workforce of extraordinary people from a wide range of backgrounds and viewpoints helps us solve complex problems, drive innovation, and achieve great results over the long term. We are committed to expanding opportunity across our ecosystem – our workplace, in our marketplace, and in the communities where we live and work – to ensure that we attract and grow the best talent and business partners from a wide range of backgrounds, perspectives, and experiences who can perform at the highest levels for Apollo.\nApollo seeks to actively invest in our communities and engage our employees and other stakeholders in meaningful and impactful Citizenship Programs. Apollo offers its employees philanthropic, volunteer, and other forms of engagement to strengthen communities and expand opportunity around the globe. To empower employees to give back, Apollo hosts volunteer events and provides Citizenship Grants for matching gifts and volunteer rewards each year. Apollo is proud to amplify the\nefforts of employees, supporting the communities in which they live and the causes and organizations of greatest importance to them.\nApollo Opportunity Foundation\nThe Apollo Opportunity Foundation was launched in February 2022 to invest in non-profit organizations working to expand opportunity for underrepresented individuals. The Apollo Opportunity Foundation’s mission is to expand opportunity in communities where our employees live and work around the globe by deploying our capital and engaging our people to invest in career education, workforce development and economic empowerment for all. The Apollo Opportunity Foundation seeks to partner with organizations that are championed by our people to advance economic prosperity and expand opportunity for underrepresented individuals.\nSustainable Investing and Corporate Responsibility\nAt Apollo, we believe that taking all available factors into account can help drive value creation. We have taken an integrated approach to incorporating financially material environmental, social, and/or governance considerations into how we invest, how we lend, and how we operate our firm globally. Our strategy prioritizes the creation of economic value for our shareholders and addressing the needs of our clients and employees in a responsible way. Corporate responsibility and sustainability matters are reviewed by a committee of the AGM board of directors. We have also adopted several policies, including an environmental, health and safety policy, a human rights policy, and a supplier code of conduct. In addition, we publish on our website an annual sustainability report, which provides further details about our approach to corporate responsibility.\nRegulatory and Compliance Matters\nOur businesses, as well as the financial services and insurance industries generally, are subject to extensive regulation in the United States and around the world. Virtually all aspects of our business are subject to various laws and regulations, some of which are summarized below. Under these laws and regulations, agencies that regulate investment advisers, investment funds, insurance businesses, broker-dealers and other individuals and entities have broad administrative powers, including the power to limit, restrict or prohibit the regulated entity or person from carrying on business if it fails to comply with such laws and regulations.\nFailure to comply with applicable regulatory and compliance requirements may result in a variety of consequences, including fines, administrative measures, suspension of voting rights, suspension of individual employees, limitations on engaging in certain lines of business for specified periods of time or mandatory disposal of interests in any affected regulated entity, revocation of investment adviser, insurance, broker-dealer and other registrations, licenses or charters, censures and other regulatory sanctions.\nThe legal and regulatory requirements applicable to our business are ever evolving and may become more restrictive, which may make compliance with applicable requirements more difficult or expensive or otherwise restrict our ability to conduct our business activities in the manner in which they are now conducted. Our businesses have operated for many years within a legal fram",
  "item7_clean": "Operating Activities\nThe Company’s operating activities support its Asset Management, Retirement Services and Principal Investing activities. The primary sources of cash within operating activities include: (a) management fees, (b) advisory and transaction fees, (c) realized performance revenues, (d) realized principal investment income, (e) investment sales from our consolidated funds and VIEs, (f) net investment income and (g) insurance premiums. The primary uses of cash within operating activities include: (a) compensation and non-compensation related expenses, (b) interest and taxes, (c) investment purchases from our consolidated funds and VIEs, (d) benefit payments and (e) other operating expenses.\nDuring the year ended December 31, 2024, cash provided by operating activities reflects cash inflows of management fees, advisory and transaction fees, realized performance revenues, realized principal investment income, and net investment income, partially offset by pension group annuity benefit payments, net of cash inflows and cash paid for interest on funding agreements, taxes, policy acquisition costs and other operating expenses. Net cash provided by operating activities includes net cash used in our consolidated funds and VIEs, which primarily includes purchases of VIEs’ investments offset by net proceeds from the sale of VIEs’ investments.\nDuring the year ended December 31, 2023, cash provided by operating activities reflects cash inflows of management fees, advisory and transaction fees, realized performance revenues, realized principal investment income, cash received from pension group annuity premiums, net of outflows, and net investment income, partially offset by cash paid for policy acquisition and other operating expenses. Net cash provided by operating activities includes net cash used in our consolidated funds and VIEs, which primarily includes purchases of VIEs’ investments, offset by net proceeds from the sale of VIEs’ investments.\nDuring the year ended December 31, 2022, cash provided by operating activities reflects cash inflows of management fees, advisory and transaction fees, realized performance revenues, and realized principal investment income, as well as cash received from pension group annuity transactions, net of outflows. Net cash provided by operating activities includes net cash used in our consolidated funds and VIEs for purchases of investments and proceeds from the sale of VIEs’ investments.\nInvesting Activities\nThe Company’s investing activities support the growth of its business. The primary sources of cash within investing activities include: (a) distributions from investments and (b) sales, maturities and repayments of investments. The primary uses of cash within investing activities include: (a) capital expenditures, (b) purchases and acquisitions of new investments, including purchases of U.S. Treasury securities and (c) equity method investments in the funds we manage.\nDuring the year ended December 31, 2024, cash used in investing activities primarily reflects the purchase of investments, mainly AFS and mortgage loans, due to the deployment of significant cash inflows from Athene’s organic growth, partially offset by the sales, maturities and repayments of investments.\nDuring the year ended December 31, 2023, cash used in investing activities primarily reflects the purchase of investments due to the deployment of significant cash inflows from Athene’s organic growth, partially offset by the sales, maturities and repayments of investments.\nDuring the year ended December 31, 2022, cash used in investing activities primarily reflects the purchase of investments due to the deployment of significant cash inflows from Athene’s organic growth, partially offset by Athene cash acquired as a result of the Mergers and the sales, maturities and repayments of investments.\nFinancing Activities\nThe Company’s financing activities reflect its capital market transactions and transactions with equity holders. The primary sources of cash within financing activities includes: (a) proceeds from debt and preferred equity issuances, (b) inflows on Athene’s investment-type policies and contracts, (c) changes of cash collateral for derivative transactions posted by counterparties, (d) capital contributions, and (e) proceeds from other borrowing activities. The primary uses of cash within financing activities include: (a) dividends, (b) payments under the tax receivable agreement, (c) share repurchases, (d) cash paid to settle tax withholding obligations in connection with net share settlements of equity-based awards, (e) repayments of debt, (f) withdrawals on Athene’s investment-type policies and contracts, (g) changes of cash collateral for derivative transactions posted by counterparties and (h) capital distributions.\nDuring the year ended December 31, 2024, cash provided by financing activities primarily reflects cash received from strong retail and funding agreement inflows, net of cash outflows, a favorable change in cash collateral posted by counterparties for derivative transactions related to the favorable equity market performance in 2024, issuances of debt by AGM and our subsidiaries, net capital contributions from non-controlling interests and the issuance of short-term repurchase agreements, net of the repayment of a long-term repurchase agreement, partially offset by the payment of common and preferred stock dividends, repurchase of common stock and repayments of debt. Cash provided by financing activities of our consolidated funds and VIEs primarily includes proceeds from the issuance of debt and contributions from non-controlling interests, partially offset by repayment of debt and distributions to non-controlling interests.\nDuring the year ended December 31, 2023, cash provided by financing activities primarily reflects cash received from the strong organic inflows from retail, flow reinsurance and funding agreements, net of outflows, a favorable change in cash collateral posted for derivative transactions related to the favorable equity market performance in 2023, net capital contributions from non-controlling interests, issuances of the 2053 Subordinated Notes, 2033 Senior Notes and Mandatory Convertible Preferred Stock, and the issuance of debt by our subsidiary, partially offset by the redemption of the AAM Preferred Stock, the payment of stock dividends, the repayment of short-term repurchase obligations and distribution to redeemable non-controlling interest. Cash provided by financing activities of our consolidated funds and VIEs primarily includes proceeds from the issuance of debt, offset by payments for borrowings under repurchase agreements.\nDuring the year ended December 31, 2022, cash provided by financing activities primarily reflects the strong organic inflows from retail and funding agreements, net of outflows, net capital contributions from non-controlling interests, and the issuance of debt and preferred stock by our subsidiary, partially offset by the payment of stock dividends. Cash provided by financing activities of our consolidated funds and VIEs primarily includes proceeds from the issuance of debt, including repurchase agreements.\nContractual Obligations, Commitments and Contingencies\nFor a summary and a description of the nature of the Company’s commitments, contingencies and contractual obligations, see note 19 to the consolidated financial statements and “—Contractual Obligations, Commitments and Contingencies.” The Company’s commitments are primarily fulfilled through cash flows from operations and financing activities.\nConsolidated Funds and VIEs\nThe Company manages its liquidity needs by evaluating unconsolidated cash flows; however, the Company’s financial statements reflect the financial position of Apollo as well as Apollo’s consolidated funds and VIEs (including previously consolidated SPACs). The primary sources and uses of cash at Apollo’s consolidated funds and VIEs include: (a) raising capital\nfrom their investors, which have been reflected historically as non-controlling interests of the consolidated subsidiaries in our financial statements, (b) using capital to make investments, (c) generating cash flows from operations through distributions, interest and the realization of investments, (d) distributing cash flow to investors, and (e) issuing debt to finance investments (CLOs).\nDividends and Distributions\nFor information regarding the quarterly dividends that were made to common stockholders and distribution equivalents on participating securities, see note 16 to the consolidated financial statements. Although the Company currently expects to pay dividends, we may not pay dividends if, among other things, we do not have the cash necessary to pay the dividends. To the extent we do not have cash on hand sufficient to pay dividends, we may have to borrow funds to pay dividends, or we may determine not to pay dividends. The declaration, payment and determination of the amount of our dividends are at the sole discretion of the AGM board of directors.\nBecause AGM is a holding company, the primary source of funds for AGM’s dividends is distributions from its operating subsidiaries, AAM and AHL, which are expected to be adequate to fund AGM’s dividends and other cash flow requirements based on current estimates of future obligations. The ability of these operating subsidiaries to make distributions to AGM will depend on satisfying applicable law with respect to such distributions, including surplus and minimum solvency requirements among others, as well as making prior distributions on AHL outstanding preferred stock. Moreover, the ability of AAM and AHL to receive distributions from their own respective subsidiaries will continue to depend on applicable law with respect to such distributions.\nOn February 4, 2025, AGM declared a cash dividend of $0.4625 per share of its common stock, which will be paid on February 28, 2025 to holders of record at the close of business on February 18, 2025.\nOn February 4, 2025, the Company also declared and set aside a cash dividend of $0.8438 per share of its Mandatory Convertible Preferred Stock, which will be paid on April 30, 2025 to holders of record at the close of business on April 15, 2025.\nRepurchase of Securities\nShare Repurchase Program\nFor information regarding the Company’s share repurchase program, see note 16 to the consolidated financial statements.\nRepurchase of Other Securities\nWe may from time to time seek to retire or purchase our other outstanding debt or equity securities through cash purchases and/or exchanges for other securities, purchases in the open market, privately negotiated transactions or otherwise. Any such repurchases will be dependent upon several factors, including our liquidity requirements, contractual restrictions, general market conditions and applicable regulatory, legal and accounting factors. Whether or not we repurchase any of our other securities and the size and timing of any such repurchases will be determined at our discretion.\nMandatory Convertible Preferred Stock\nOn August 11, 2023, the Company issued 28,750,000 shares, or $1.4 billion aggregate liquidation preference, of its 6.75% Series A Mandatory Convertible Preferred Stock. There were 28,749,765 shares of Mandatory Convertible Preferred Stock issued and outstanding as of December 31, 2024. See note 16 to the consolidated financial statements for further details.\nAsset Management Liquidity\nOur asset management business requires limited capital resources to support the working capital or operating needs of the business. For the asset management business’ longer-term liquidity needs, we expect to continue to fund the asset management business’ operations through management fees and performance fees received. Liquidity needs are also met (to a limited extent) through proceeds from borrowings and equity issuances as described in notes 14 and 16 to the consolidated financial statements, respectively. From time to time, if the Company determines that market conditions are favorable after taking into account our liquidity requirements, we may seek to raise proceeds through the issuance of additional debt or equity instruments.\nAGM has a registration statement on Form S-3 to provide it with access to the capital markets, subject to market conditions and other factors.\nAt December 31, 2024, the asset management business had $2.7 billion of unrestricted cash and cash equivalents, as well as $1.25 billion of available funds from the AGM credit facility.\nFuture Debt Obligations\nThe asset management business had long-term debt of $4.3 billion at December 31, 2024, which includes notes with maturities in 2026, 2029, 2030, 2033, 2048, 2050, 2053 and 2054. See note 14 to the consolidated financial statements for further information regarding the asset management business’ debt arrangements.\nOur ability to execute our business strategy, particularly our ability to increase our AUM, depends on our ability to establish new funds and to raise additional investor capital within such funds. Our liquidity will depend on a number of factors, such as our ability to project our financial performance, which is highly dependent on the funds we manage and our ability to manage our projected costs, fund performance, access to credit facilities, compliance with existing credit agreements, as well as industry and market trends. Also during economic downturns the funds we manage might experience cash flow issues or liquidate entirely. In these situations we might be asked to reduce or eliminate the management fee and performance fees we charge, which could adversely impact our cash flow in the future.\nAn increase in the fair value of the investments of the funds we manage, by contrast, could favorably impact our liquidity through higher management fees where the management fees are calculated based on the net asset value, gross assets or adjusted assets. Additionally, higher performance fees not yet realized would generally result when investments appreciate over their cost basis which would not have an impact on the asset management business’ cash flow until realized.\nConsideration of Financing Arrangements\nAs noted above, in limited circumstances, the asset management business may issue debt or equity to supplement its liquidity. The decision to enter into a particular financing arrangement is made after careful consideration of various factors, including the asset management business’ cash flows from operations, future cash needs, current sources of liquidity, demand for the asset management business’ debt or equity, and prevailing interest rates.\nUnder the AGM credit facility, AGM and AMH, as parent borrower and subsidiary borrower, respectively, may borrow in an aggregate amount not to exceed $1.25 billion and may incur incremental facilities in an aggregate amount not to exceed $250 million plus additional amounts so long as AGM and AMH are in compliance with a net leverage ratio not to exceed 4.00 to 1.00. Borrowings under the AGM credit facility may be used for working capital and general corporate purposes, including without limitation, permitted acquisitions. The AGM credit facility has a final maturity date of November 21, 2029.\nTax Receivable Agreement\nThe tax receivable agreement provides for the payment to the Former Managing Partners and Contributing Partners of 85% of the amount of cash savings, if any, in U.S. federal, state, local and foreign income taxes that AGM and its subsidiaries realize subject to the agreement. For more information regarding the tax receivable agreement, see note 18 to the consolidated financial statements.\nAthora is a strategic liabilities platform that acquires and reinsures traditional closed life insurance policies and provides capital and reinsurance solutions to insurers in Europe. In 2017, an AAM subsidiary made a €125 million commitment to Athora, which was fully drawn as o",
  "item2_clean": null
}