{
  "source_file": "app-20250930.htm",
  "form_type": "10-Q",
  "item1_clean": null,
  "item7_clean": null,
  "item2_clean": "ITEM 2. MANAGEMENT’S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS\nOur mission is to create meaningful connections between companies and their ideal customers. We provide end-to-end software and AI-powered solutions for businesses to reach, monetize and grow their global audience. Our scaled business model is intricately linked to the advertising ecosystem, providing a durable competitive advantage. We generate revenue when our advertisers achieve their return on ad spend targets with our advertising solutions, ensuring that their success directly fuels our growth.\nSince our founding in 2011, we have been focused on building advertising solutions for advertisers to improve the marketing and monetization of their content. Our founders, who were mobile app developers themselves, quickly realized the real impediment to success and growth in the advertising ecosystem was a discovery and monetization problem—breaking through the congested app stores to efficiently find users and successfully grow their business. Their first-hand experience with these challenges led to the development of our infrastructure and advertising solutions.\nFor the three months ended September 30, 2025, our revenue increased 68% year-over-year to $1.4 billion, from $835.2 million in the three months ended September 30, 2024. We generated net income from continuing operations of $835.5 million and $433.1 million for the three months ended September 30, 2025 and 2024, respectively, and net income of $835.5 million and $434.4 million for the three months ended September 30, 2025 and 2024, respectively. We generated Adjusted EBITDA of $1.2 billion and $647.0 million for the three months ended September 30, 2025 and 2024, respectively. Additionally, our net cash provided by operating activities was $2.7 billion and $1.4 billion in the nine months ended September 30, 2025 and 2024, respectively. We generated Free Cash Flow of $2.6 billion and $1.4 billion for the nine months ended September 30, 2025 and 2024, respectively. Cash flows and Free Cash Flow include the cash flows from continuing and discontinued operations. Given our strong financial position, we have been able to reinvest in our expansion and growth, and repurchase and withhold shares of our Class A common stock. See the section titled “Non-GAAP Financial Measures” for a definition of Adjusted EBITDA and a reconciliation of Adjusted EBITDA to net income, the most directly comparable financial measure calculated in accordance with GAAP.\nOn May 7, 2025, we, along with our subsidiaries Morocco, Inc. and AppLovin GmbH (collectively, the “Sellers”) entered into a Purchase Agreement (the “Agreement”) with Tripledot and its subsidiaries Eton Games Inc. (\"Eton\") and Tripledot Group Holdings Limited (collectively, with Tripledot, the “Purchasers”) relating to the sale of our Apps Business. On June 30, 2025, we and Tripledot entered into an amendment to the Agreement to provide, among other things, that in lieu of the issuance of a secured promissory note by Eton to us or our designated affiliate at the closing of the transactions contemplated by the Agreement (the “Closing”) to fund a portion of the full Cash Consideration (as defined in the Agreement), Tripledot may elect to pay such amount in cash.\nWe primarily generate revenue from fees paid by advertisers who use our advertising solutions to grow and monetize their content. We are able to grow our revenue by improving our various technologies.\nAdvertising clients include a wide variety of advertisers, from indie developer studios to some of the largest global internet platforms, such as Facebook and Google. We see multiple opportunities to gain new clients, and to increase spend from existing clients, as we help them grow their businesses and make them more successful.\nOur advertising solutions include Axon Advertising, MAX, Adjust, and Wurl. Clients use Axon Advertising to automate, optimize, and manage their user acquisition investments. They set marketing and user growth goals, and Axon Advertising optimizes their ad spend in an effort to achieve their return on advertising spend targets and other marketing objectives. Axon Advertising comprises the vast majority of revenue. Revenue is generated from our advertisers, typically on a performance basis, and shared with our advertising publishers, typically on a cost per impression model.\nAdvertising clients use MAX to optimize purchases of app advertising inventory. The MAX tool provides insights to manage against key performance indicators, understand the long-term value of users, and help manage profitability. Revenue from MAX is generated based on a percentage of client spend. As more advertising networks move to in-app real-time bidding, we expect growth in the adoption of, and revenue from, MAX.\nAdvertising clients use Adjust's measurement and analytics marketing platform to better understand their users' journey while allowing marketers to make smarter decisions through measurement, attribution and fraud prevention. Revenue from Adjust is primarily generated from an annual software subscription fee.\nAdvertising clients use Wurl's connected TV (\"CTV\") platform to distribute streaming video, maximize revenue, and acquire and retain viewers or subscribers. Revenue from Wurl is primarily generated from content companies, streamers, and advertisers, typically on a usage-based and/or CPM model.\nNon-GAAP Financial Measures\nAdjusted EBITDA and Adjusted EBITDA Margin\nWe define Adjusted EBITDA for a particular period as net income adjusted for loss (income) from discontinued operations, net of income taxes, interest expense, other (income) expense, net (excluding certain recurring items), provision for income taxes, amortization, depreciation and write-offs and as further adjusted for stock-based compensation, transaction-related expense, restructuring costs, and non-operating foreign exchange gain, as well as certain other items that we believe are not reflective of our core operating performance. We define Adjusted EBITDA margin as Adjusted EBITDA divided by revenue for the same period.\nAdjusted EBITDA and Adjusted EBITDA margin are key measures we use to assess our financial performance and are also used for internal planning and forecasting purposes. We believe Adjusted EBITDA and Adjusted EBITDA margin are helpful to investors, analysts, and other interested parties because they can assist in providing a more consistent and comparable overview of our operations across our historical financial periods. In addition, these measures are frequently used by analysts, investors, and other interested parties to evaluate and assess performance. We use Adjusted EBITDA and Adjusted EBITDA margin in conjunction with GAAP measures as part of our overall assessment of our performance, including the preparation of our annual operating budget and quarterly forecasts, to evaluate the effectiveness of our business strategies, and to communicate with our board of directors concerning our financial performance.\nAdjusted EBITDA and Adjusted EBITDA margin are non-GAAP financial measures and are presented for supplemental informational purposes only and should not be considered as alternatives or substitutes to financial information presented in accordance with GAAP. These measures have certain limitations in that they do not include the impact of certain expenses that are reflected in our consolidated statement of operations that are necessary to run our business. Our definitions may differ from the definitions used by other companies and therefore comparability may be limited. In addition, other companies may not publish these or similar metrics. Thus, our Adjusted EBITDA and Adjusted EBITDA margin should be considered in addition to, not as substitutes for, or in isolation from, measures prepared in accordance with GAAP.\nThe following table provides our Adjusted EBITDA and Adjusted EBITDA margin for the three and nine months ended September 30, 2025 and 2024, and a reconciliation of net income to Adjusted EBITDA:\nThree Months Ended September 30,\nNine Months Ended September 30,\n(in thousands, except percentages)\nLoss (income) from discontinued operations, net of income taxes\nNet income from continuing operations\nNet margin from continuing operations\nAdjusted as follows:\nOther (income) expense, net\nProvision for income taxes\nAmortization, depreciation and write-offs\nNon-operating foreign exchange gain\nStock-based compensation\nTransaction-related expense\nAdjusted EBITDA margin\nExcludes recurring operational foreign exchange gains and losses.\nWe define Free Cash Flow as net cash provided by operating activities less purchases of property and equipment and principal payment of finance leases. We use Free Cash Flow to help manage the health of our business, prepare budgets and for capital allocation purposes. We believe Free Cash Flow provides useful supplemental information to help investors understand underlying trends in our business and our liquidity. Free Cash Flow also reflects cash flows from both continuing and discontinued operations. Our definition may differ from the definitions used by other companies and therefore comparability may be limited. In addition, other companies may not publish Free Cash Flow or similar metrics. Thus, our Free Cash Flow should be considered in addition to, not as a substitute for, or in isolation from, measures prepared in accordance with GAAP.\nThe following table provides our Free Cash Flow for the nine months ended September 30, 2025 and 2024, and a reconciliation of net cash provided by operating activities to Free Cash Flow:\nNine Months Ended September 30,\nNet cash provided by operating activities\nPurchase of property and equipment\nPrincipal payments of finance leases\nNet cash provided by (used in) investing activities\nNet cash used in financing activities\nFactors Affecting Our Performance\nWe believe that the future success of our business de"
}