{
  "source_file": "aptv-20241231.htm",
  "form_type": "10-K",
  "item1_clean": "ITEM 1. BUSINESS\nIn December 2024, following the completion of the Transaction, Old Aptiv merged with and into Aptiv Swiss Holdings Limited (“Aptiv Swiss Holdings”), a newly formed Jersey incorporated private limited company, and a direct, wholly-owned subsidiary of New Aptiv, with Aptiv Swiss Holdings surviving as a direct, wholly owned subsidiary of New Aptiv, and Old Aptiv ceasing to exist. Except as otherwise noted, all property, rights, privileges, powers and franchises of Old Aptiv vested in Aptiv Swiss Holdings, and all debts, liabilities and duties of Old Aptiv became debts, liabilities and duties of Aptiv Swiss Holdings.\nIn connection with the Transaction, New Aptiv assumed Old Aptiv’s Long-Term Incentive Plans and its existing obligations in connection with awards granted thereunder, and Aptiv Swiss Holdings (i) entered into a supplemental indenture to each indenture in which Aptiv Swiss Holdings assumed all of Old Aptiv’s obligations under each series of Old Aptiv’s outstanding Notes and (ii) entered into an assumption and/or supplement agreement relating to each Credit Agreement in which New Aptiv assumed all of Old Aptiv’s obligations under each Credit Agreement as the “parent entity” thereunder. In addition, New Aptiv (i) entered into a supplemental indenture to each indenture in which New Aptiv guaranteed the outstanding Notes and (ii) entered into a guarantee joinder relating to each Credit Agreement in which New Aptiv guaranteed the obligations under each Credit Agreement. Following the reorganization transaction, Aptiv Swiss Holdings replaced Old Aptiv as an obligor under the Credit Agreements, the senior notes and the junior notes, and New Aptiv became a guarantor under the Credit Agreements (and will act as the “parent entity” thereunder) and the indentures.\nAs a result of the Transaction described above, there were no material changes in Aptiv PLC’s operations or governance. The consolidated financial statements have been prepared in accordance with accounting principles generally accepted in the United States of America (“U.S. GAAP”).\nAptiv is a global technology company focused on making the world safer, greener and more connected. We deliver end-to-end mobility solutions, enabling our customers’ transition to a more electrified, software-defined future. We design and manufacture vehicle components and provide electrical, electronic and active safety technology to the global automotive and commercial vehicle markets, creating the software and hardware foundation for vehicle features and functionality. Our Advanced Safety and User Experience segment is focused on providing the necessary software and advanced computing platforms, and our Signal and Power Solutions segment is focused on providing the requisite networking architecture required to support the integrated systems in today’s complex vehicles. Together, our businesses develop the ‘brain’ and the ‘nervous system’ of increasingly complex vehicles, providing integration of the vehicle into its operating environment.\nWe are one of the largest vehicle technology suppliers and our customers include the 25 largest automotive original equipment manufacturers (“OEMs”) in the world. We operate 140 major manufacturing facilities and 11 major technical centers utilizing a regional service model that enables us to efficiently and effectively serve our global customers from best cost countries. We have a presence in 49 countries and have approximately 21,200 scientists, engineers and technicians focused on developing market relevant product solutions for our customers.\nWe are focused on growing and improving the profitability of our businesses, and have implemented a strategy designed to position the Company to deliver industry-leading long-term shareholder returns. This strategy includes disciplined investing in our business to grow and enhance our product offerings, strategically focusing our portfolio in high-technology, high-growth spaces in order to meet consumer preferences and leveraging an industry-leading cost structure to expand our operating margins.\nPlanned Spin-off of Electrical Distribution Systems Business\nOn January 22, 2025, we announced our intention to pursue a separation of our Electrical Distribution Systems business through a transaction expected to be treated as a tax-free spin-off to Aptiv’s shareholders. The Company plans to complete the separation by March 31, 2026, subject to customary closing conditions.\nWebsite Access to Company’s Reports\nAptiv’s website address is\nWe believe the automotive industry is being shaped by rapidly increasing consumer demand for new mobility solutions, advanced technologies, including software-defined vehicles, and vehicle connectivity, as well as government regulation related to vehicle safety, fuel efficiency and emissions control. More broadly, the “Safe,” “Green” and “Connected” mega-trends are expected to drive higher growth for our products than the underlying markets they serve. We have organized our business into two diversified segments, which enable us to develop technology solutions and manufacture highly-engineered products that enable our customers to respond to these mega-trends:\nAdvanced Safety and User Experience\n—This segment, which includes our Active Safety, User Experience and Smart Vehicle Compute and Software businesses, provides critical technologies and services to enhance vehicle safety, security, comfort and convenience, including sensing and perception systems, electronic control units, multi-domain controllers, vehicle connectivity systems, cloud-native software platforms, application software, autonomous driving technologies and end-to-end DevOps tools.\nSignal and Power Solutions\n—This segment, which includes our Engineered Components Group and Electrical Distribution Systems businesses, provides complete design, manufacture and assembly of the vehicle’s electrical architecture, including engineered component products, connectors, wiring assemblies and harnesses, cable management, electrical centers and high voltage power and safety-critical data distribution systems. Our products provide the signal distribution and computing power backbone that supports increased vehicle content and electrification, reduced emissions, higher fuel economy and off-vehicle connectivity.\nRefer to Results of Operations by Segment in Item 7. Management’s Discussion and Analysis of Financial Condition and Results of Operations and Note 22. Segment Reporting to the audited consolidated financial statements for financial information about our business segments.\nOur business is diversified across end-markets, regions, customers, vehicle platforms and products. Our customer base includes the 25 largest automotive OEMs in the world, and in 2024, 29% of our net sales came from the Asia Pacific region, which we have identified as a key market likely to experience substantial long-term growth. Our ten largest platforms in 2024 were with seven different OEMs. In addition, in 2024 our products were found in 17 of the 20 top-selling vehicle models in the United States (“U.S.”), 17 of the 20 top-selling vehicle models in Europe and 12 of the 20 top-selling vehicle models in China.\nWe have established a worldwide design and manufacturing footprint with a regional service model that enables us to efficiently and effectively serve our global customers from best cost countries. This regional model is structured primarily to service the North American market from Mexico, the South American market from Brazil, the European market from Eastern Europe and North Africa, and the Asia Pacific market from China. Our global scale and regional service model enables us to engineer globally and execute regionally to serve the largest OEMs, which are seeking suppliers that can serve them on a worldwide basis. Our footprint also enables us to adapt to the regional design variations the global OEMs require while also serving key growth market OEMs.\nThe automotive technology and components industry provides critical technologies, components, systems, subsystems and modules to OEMs for the manufacture of new vehicles, as well as to the aftermarket for use as replacement parts for current production and older vehicles. In addition, the industry is increasingly progressing towards software-defined vehicles becoming critical elements of the overall automotive ecosystem. Overall, we expect long-term growth of global vehicle sales and production in the OEM market. In 2024, the industry experienced decreased global customer sales and production schedules, and increased inventory levels, primarily driven by various global uncertainties and global inflationary pressures. Global automotive vehicle production decreased 1% (3% on an Aptiv weighted market basis, which represents global vehicle production weighted to the geographic regions in which the Company generates its revenue) from 2023 to 2024, reflecting\nvehicle production declines of 5% in Europe and 2% in North America, partially offset by increased production of 4% in China and 3% in South America, our smallest region. Demand for automotive components in the OEM market is generally a function of the number of new vehicles produced in response to consumer demand, which is primarily driven by macro-economic factors such as credit availability, interest rates, fuel prices, consumer confidence, employment and other trends. Although OEM demand is tied to actual vehicle production, participants in the automotive technology and components industry also have the opportunity to grow through increasing product content per vehicle by further penetrating business with existing customers and in existing markets, gaining new customers and increasing their presence in global markets. We believe that evolving entrants into the global transportation industry such as mobility providers, electric vehicle developers and smart cities will provide additional markets for our advanced technologies. We believe that as a company with a global presence and advanced technology, engineering, manufacturing and customer support capabilities, we are well-positioned to benefit from these opportunities.\nWe believe that continuously increasing societal demands have created the three “mega-trends” that serve as the basis for the next wave of market-driven automotive technology advancement. We aim to continue developing leading edge technology focused on addressing these mega-trends, and apply that technology toward products with sustainable margins that enable our customers, both OEMs and others, to produce distinctive market-leading products. We have identified a core portfolio of products that draw on our technical strengths and align with these mega-trends where we believe we can provide differentiation to our customers.\nThe first mega-trend, “Safe,” represents technologies aimed not just at protecting vehicle occupants when a crash occurs, but those that actually proactively reduce the risk of a crash occurring. OEMs continue to focus on improving occupant and pedestrian safety in order to meet increasingly stringent regulatory requirements in various markets. As a result, suppliers are focused on developing technologies aimed at protecting vehicle occupants when a crash occurs, as well as advanced driver assistance systems that reduce driver distractions and automated safety features that proactively mitigate the risk of a crash occurring. Examples of new and alternative technologies that incorporate sophisticated detection and advanced software for collision avoidance include lane departure warning and centering systems, adaptive cruise control and traffic jam assist, and driver and cabin monitoring systems.\nThe second mega-trend, “Green,” represents technologies designed to help reduce emissions, increase fuel economy and minimize the environmental impact of vehicles. Green is a key mega-trend today because of the convergence of several issues: climate c",
  "item7_clean": "ITEM 7. MANAGEMENT’S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS\nThe following management’s discussion and analysis of financial condition and results of operations (“MD&A”) is intended to help you understand the business operations and financial condition of the Company for the year ended December 31, 2024. This discussion should be read in conjunction with Item 8. Financial Statements and Supplementary Data. Our MD&A is presented in seven sections:\nConsolidated Results of Operations\nResults of Operations by Segment\nLiquidity and Capital Resources\nOff-Balance Sheet Arrangements\nSignificant Accounting Policies and Critical Accounting Estimates\nRecently Issued Accounting Pronouncements\nWe are a global technology company focused on making the world safer, greener and more connected. We deliver end-to-end mobility solutions, enabling our customers’ transition to a more electrified, software-defined future. We design and manufacture vehicle components and provide electrical, electronic and active safety technology to the global automotive and commercial vehicle markets, creating the software and hardware foundation for vehicle features and functionality. Our Advanced Safety and User Experience segment is focused on providing the necessary software and advanced computing platforms, and our Signal and Power Solutions segment is focused on providing the requisite networking architecture required to support the integrated systems in today’s complex vehicles. Together, our businesses develop the ‘brain’ and the ‘nervous system’ of increasingly complex vehicles, providing integration of the vehicle into its operating environment.\nWe are one of the largest vehicle technology suppliers and our customers include the 25 largest automotive OEMs in the world.\nIn December 2024, following the completion of the Transaction, Old Aptiv merged with and into Aptiv Swiss Holdings Limited (“Aptiv Swiss Holdings”), a newly formed Jersey incorporated private limited company, and a direct, wholly-owned subsidiary of New Aptiv, with Aptiv Swiss Holdings surviving as a direct, wholly owned subsidiary of New Aptiv, and Old Aptiv ceasing to exist. Except as otherwise noted, all property, rights, privileges, powers and franchises of Old Aptiv vested in Aptiv Swiss Holdings, and all debts, liabilities and duties of Old Aptiv became debts, liabilities and duties of Aptiv Swiss Holdings. As a result of the Transaction described above, there were no material changes in Aptiv PLC’s operations or governance.\nIn connection with the Transaction, New Aptiv assumed Old Aptiv’s Long-Term Incentive Plans and its existing obligations in connection with awards granted thereunder, and Aptiv Swiss Holdings (i) entered into a supplemental indenture to each indenture in which Aptiv Swiss Holdings assumed all of Old Aptiv’s obligations under each series of Old Aptiv’s outstanding Notes and (ii) entered into an assumption and/or supplement agreement relating to each Credit Agreement in which New Aptiv assumed all of Old Aptiv’s obligations under each Credit Agreement as the “parent entity” thereunder. In addition, New Aptiv (i) entered into a supplemental indenture to each indenture in which New Aptiv guaranteed the outstanding Notes and (ii) entered into a guarantee joinder relating to each Credit Agreement in which New Aptiv guaranteed the obligations under each Credit Agreement. Following the reorganization transaction, Aptiv Swiss Holdings replaced Old Aptiv as an obligor\nunder the Credit Agreements, the senior notes and the junior notes, and New Aptiv became a guarantor under the Credit Agreements (and will act as the “parent entity” thereunder) and the indentures.\nPlanned Spin-off of Electrical Distribution Systems Business\nOn January 22, 2025, we announced our intention to pursue a separation of our Electrical Distribution Systems business through a transaction expected to be treated as a tax-free spin-off to Aptiv’s shareholders. The Company plans to complete the separation by March 31, 2026, subject to customary closing conditions.\nWe believe the Company is well-positioned for growth from the industry’s accelerating transition to software-defined vehicles, the commercialization of active safety, the adoption of autonomous driving technologies, enhanced user experiences and connected services, and providing the software, advanced computing platforms and networking architecture required to do so. We have successfully created a competitive cost structure while investing in research and development to grow our product offerings, which are aligned with the high-growth industry mega-trends, and re-aligned our manufacturing footprint into an efficient, low-cost regional service model, focused on increasing our profit margins.\nOur 2024 performance reflects our solid execution and cost reduction initiatives despite declines in volume and the global inflationary environment. Our recent financial and business achievements include the following:\nGenerating new business awards of approximately $31 billion, based on expected volumes and prices, validating our industry leading portfolio of advanced technologies tied to the accelerating megatrends in our industry\nDelivering strong earnings growth over the prior year despite declines in volume and the global inflationary environment\nProducing $1.8 billion of operating income, or $2.4 billion of adjusted operating income, and cash flow from operations of $2.4 billion, demonstrating strong operating execution in the face of continuing material cost inflation\nDelivering expanded operating income margin of 9.3%, or adjusted operating income margin of 12.0%, driven by strong operating performance and cost reduction initiatives\nFunding $4.1 billion in share repurchases, including $3.0 billion under the terms of the Company’s accelerated share repurchase program (“ASR”)\nRefinancing over $1.4 billion in near-term debt maturities and successfully maintaining a well-laddered debt maturity profile, providing financial flexibility and reducing short-term refinancing risks\nRestructuring our Motional AD LLC (“Motional”) joint venture ownership, reducing our common equity interest in Motional from 50% to 15%, eliminating future cash funding requirements while maintaining access to insights and market intelligence\nContinuing our relentless focus on cost structure and operational optimization\nMaximizing our operational flexibility and profitability at all points in the normal automotive business cycle, by having approximately 97% of our hourly workforce based in best cost countries, and approximately 31% of our hourly workforce composed of contingent employees.\nEnhancing our optimized full system, edge-to-cloud capabilities\nOngoing advancement in adapting advanced driver assistance systems to leverage containerized, service-based software architecture; and\nIncreasing our customer choice and regional flexibility through investments in computer vision providers StradVision, Inc. (“StradVision”) and MAXIEYE Automotive Technology (Ningbo) Co., Ltd. (“Maxieye”).\nMeeting the sustainability-linked targets for greenhouse gas emissions and workplace safety within our Credit Agreement.\nOur strategy is to build on these accomplishments and continue to develop and manufacture innovative market-relevant products for a diverse base of customers around the globe and leverage our lean and flexible cost structure to achieve strong and disciplined earnings growth and returns on invested capital. Through our culture of innovation and world class engineering capabilities we intend to employ our rigorous, forward-looking product development process to deliver new technologies that provide solutions to our customers. We are committed to creating value for our shareholders, including through the continued repurchase of shares. Our key strategic priorities include:\nCommercializing the high-tech evolution of the automotive industry\n. The automotive industry is increasingly evolving towards the implementation of software-dependent components and solutions. In particular, the industry is focused on the development of advanced driver assistance technologies, with the goal of developing and introducing a commercially-viable, fully automated driving experience. We expect automated driving technologies will provide strong societal benefit as well as the opportunity for long-term growth for our product offerings in this space. We are focused on enabling and delivering end-to-\nend smart mobility solutions, enabling our customers’ transition to more electrified, software-defined vehicles, accelerating the commercialization of active safety and autonomous driving technologies and providing enhanced user experience and connected services.\nAs part of our strategy to harness the full potential of connected intelligent systems across industries, strengthen our capabilities in software-defined mobility and to enable advanced smart vehicle architecture changes, we acquired Wind River in December 2022. Wind River is a global leader in delivering software for the intelligent edge for multiple industries, including automotive, by leveraging mixed-criticality software products and solutions enabling customers to develop in the cloud, deploy over the air and run and manage software at the vehicle edge.\nWe are also continuing to develop market-leading automated driving solutions such as automated driving software, sensing and perception technologies enhanced through artificial intelligence and machine learning, as well as the underlying architecture technologies capable of supporting safety-critical applications. We believe we are well-aligned with industry technology trends that will help to support sustainable future growth in this space and have partnered with leaders in their respective fields to advance the pace of development and commercialization of these emerging technologies.\nIn March 2020, we completed a transaction with Hyundai Motor Group (“Hyundai”) to form Motional, a joint venture focused on the design, development and commercialization of autonomous driving technologies. Although we believe our strategic partnerships have us well-aligned with industry technology mega-trends in these evolving areas, the timeline necessary to produce commercially viable autonomous vehicles has been extended and is still subject to significant uncertainty, which resulted in additional funding requirements for Motional. In April 2024, Aptiv and Hyundai entered into an agreement to restructure Aptiv’s ownership interest in Motional and for Hyundai to provide additional funding to Motional, which also eliminated any requirements for additional future funding from Aptiv. These transactions, which were completed in May 2024, resulted in the reduction of our common equity interest in Motional from 50% as of December 31, 2023 to approximately 15%. The total gain recorded as a result of these transactions was approximately $641 million ($2.50 per diluted share) during the year ended December 31, 2024, within net gain on equity method transactions in the consolidated statements of operations. Refer to Note 5. Investments in Affiliates to the audited consolidated financial statements contained herein for further information on these transactions.\nThere are many risks associated with these evolving areas, including the high development costs of active safety and autonomous driving technologies, the uncertain timing of customer and consumer adoption of these technologies, increased competition from entrants outside the traditional automotive industry and evolving regulations, such as the guidance for automated driving systems published by the U.S. Department of Transportation. While we believe we are well-positioned in these markets, the high development cost of active safety and autonomous driving technologies may result in a higher risk of exposure to the success of new or disruptive technologies different than those being developed by us or our partners and ultimately there can be no assurance that we will be successful in our efforts to develop these technologies.\nLeveraging our engineering and technological capabilities\n. We seek to leverage our strong product portfolio tied to the industry’s key mega-trends with our global footprint to increase our revenues, as well as committing to substantial annual investment in research and development to maintain and enhance our leadership in new mobility solutions across each of our product lines.\nTargeting the right business with the right customers\n. We intend to be strategic in our pursuit of new business and customers in order to achieve disciplined, above-market growth. We conduct in-depth analysis of market share and product trends by region in order to prioritize research, development and engineering spend for the customers that we believe will be successful. Collaboration with customers in our 11 major technical centers around the world helps us develop innovative product solutions designed to meet their needs. As more OEMs design vehicles for global platforms, where the same vehicle architecture is shared among different regions, we are well suited to provide global design and engineering support while manufacturing these products for a specific regional market.\nCapitalizing on our scale, global footprint and established position in key growth markets\n. We intend to generate sustained growth by capitalizing on the breadth and scale of our operating capabilities. Our global footprint provides us important proximity to our customers’ manufacturing facilities and allows us to serve them in every region in which they operate. We anticipate that we will continue to build upon our extensive geographic reach to capitalize on growing automotive markets, particularly in China. In addition, our presence in best cost countries positions us to realize incremental margin improvements as the global balance of automotive production shifts towards key growth markets.\nLeveraging our lean and flexible cost structure to deliver profitability and cash flow\n. We recognize the importance of maintaining a lean and flexible cost structure in order to deliver stable earnings and cash flow in a cyclical industry. Our focus is on maximizing and optimizing manufacturing output to meet increasing production requirements with minimal additions to our fixed-cost base. Additionally, we are continuing to use a meaningful amount of temporary workers to ensure we have the appropriate operational flexibility to scale our operations so that we can maintain our profitability as industry production levels increase or contract.\nAdvancing and maintaining an efficient capital structure.\nWe actively manage our capital structure in order to maintain an investment grade credit rating and healthy capital ratios to support our business and maximize shareholder value. We will continue to make adjustments to our capital structure in light of changes in economic conditions or as opportunities arise to provide us with additional financial flexibility to invest in our business and execute our strategic objectives going forward.\nPursuing selected acquisitions and strategic investments\n. In recent years, we continued to complete selected acquisitions and strategic investments in order to continue to leverage our technology capabilities and enhance and expand our commercialization of new mobility solutions, product offerings, customer base, geographic penetration and scale to complement our current businesses, while continuing to enhance our product offerings and competitive position in growing market segments.\nAccelerating an electric, zero-emissions future.\nWe are committed to becoming carbon-neutral in our global operations by 2030 and to achieving net carbon neutrality by 2040 as we transition away from carbon-intensive energy and processes in our global operations. We also continue to focus on minimizing the overall environmental impact of vehicl",
  "item2_clean": null
}