{
  "source_file": "aptv-20250930.htm",
  "form_type": "10-Q",
  "item1_clean": null,
  "item7_clean": null,
  "item2_clean": "ITEM 2. MANAGEMENT’S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS\nThe following management’s discussion and analysis of financial condition and results of operations (“MD&A”) is intended to help you understand the business operations and financial condition of the Company for the three and nine months ended September 30, 2025. This discussion should be read in conjunction with Item 1. Financial Statements. Our MD&A is presented in eight sections:\nConsolidated Results of Operations\nResults of Operations by Segment\nLiquidity and Capital Resources\nOff-Balance Sheet Arrangements\nContingencies and Environmental Matters\nRecently Issued Accounting Pronouncements\nCritical Accounting Estimates\nWithin the MD&A, “Aptiv,” the “Company,” “we,” “us” and “our” refer to Old Aptiv (Aptiv PLC before the Transaction in December 2024, as defined below) and to New Aptiv (Aptiv PLC after the Transaction in December 2024, as defined below). The Company’s ordinary shares are publicly traded on the New York Stock Exchange (“NYSE”) under the symbol “APTV.”\nWe are a global technology company focused on making the world safer, greener and more connected. We deliver solutions enabling our customers’ transition to a more electrified, software-defined future. Our technologies reach from sensor to cloud, including the software, hardware, engineered components and electrical interconnects necessary to support the global automotive and commercial vehicle markets and increasingly other mission-critical industries. Our Advanced Safety and User Experience segment provides software and advanced computing platforms, our Engineered Components Group segment provides interconnect and component solutions and our Electrical Distribution Systems segment provides low voltage and high voltage power, signal and data distribution solutions.\nWe are one of the largest vehicle technology suppliers and our customers include the 25 largest automotive original equipment manufacturers (“OEMs”) in the world.\nIn December 2024, following the completion of the Transaction, Old Aptiv merged with and into Aptiv Swiss Holdings Limited (“Aptiv Swiss Holdings”), a newly formed Jersey incorporated private limited company, and a direct, wholly-owned subsidiary of New Aptiv, with Aptiv Swiss Holdings surviving as a direct, wholly-owned subsidiary of New Aptiv, and Old Aptiv ceasing to exist. Except as otherwise noted, all property, rights, privileges, powers and franchises of Old Aptiv vested in Aptiv Swiss Holdings, and all debts, liabilities and duties of Old Aptiv became debts, liabilities and duties of Aptiv Swiss Holdings. As a result of the Transaction described above, there were no material changes in Aptiv PLC’s operations or governance.\nIn connection with the Transaction, New Aptiv assumed Old Aptiv’s long-term incentive plans and its existing obligations in connection with awards granted thereunder, and Aptiv Swiss Holdings (i) entered into a supplemental indenture to each indenture in which Aptiv Swiss Holdings assumed all of Old Aptiv’s obligations under each series of Old Aptiv’s\noutstanding Notes and (ii) entered into an assumption and/or supplement agreement relating to the Credit Agreement in which New Aptiv assumed all of Old Aptiv’s obligations under the Credit Agreement as the “parent entity” thereunder. In addition, New Aptiv (i) entered into a supplemental indenture to each indenture in which New Aptiv guaranteed the outstanding Notes and (ii) entered into a guarantee joinder relating to the Credit Agreement in which New Aptiv guaranteed the obligations under the Credit Agreement. Following the reorganization transaction, Aptiv Swiss Holdings (i) replaced Old Aptiv as a guarantor of the borrowers’ obligations under the Credit Agreement, and (ii) succeeded to Old Aptiv as an obligor under the senior notes and the junior notes, and New Aptiv became a guarantor under the Credit Agreement (and will act as the “parent entity” thereunder) and the indentures.\nOn January 22, 2025, we announced our intention to pursue a separation of our Electrical Distribution Systems business through a transaction expected to be treated as a tax-free spin-off to its shareholders (the “Separation”). The Company plans to complete the Separation by March 31, 2026, subject to customary closing conditions. During the three and nine months ended September 30, 2025, the Company incurred costs of $53 million and $100 million, respectively, related to the Separation. These costs, which are included in selling, general and administrative expense within the consolidated statements of operations, are primarily related to third party professional fees associated with planning the Separation. The Company expects to continue to incur additional expenses related to the Separation through the date of completion.\nIn connection with the Separation, in the first quarter of 2025 Aptiv realigned its business into three reportable operating segments: Electrical Distribution Systems, Engineered Components Group and Advanced Safety and User Experience. Prior period amounts have been adjusted retrospectively to reflect the change in reportable operating segments, consistent with the current year presentation, throughout the consolidated financial statements and the accompanying notes to the consolidated financial statements.\nOur total net sales during the three and nine months ended September 30, 2025 were $5.2 billion and $15.2 billion, an increase of 7% and 3% compared to the same periods of 2024, respectively. Our volumes increased 6% for the three months ended September 30, 2025, which primarily reflects volume growth in North America and Asia Pacific, partially offset by volume declines in Europe, compared to increased global automotive production of 4% (4% on an Aptiv weighted market basis, which represents global vehicle production weighted to the geographic regions in which the Company generates its revenue, “AWM”). Our volumes increased 2% for the nine months ended September 30, 2025, which primarily reflects volume growth in North America and Asia Pacific, partially offset by volume declines in Europe, compared to increased global automotive production of 4% (1% on an AWM basis).\nWe are focused on maintaining a low fixed cost structure that provides us flexibility to remain profitable at all points of the traditional vehicle industry production cycle, including during periods of reduced industry volumes. Accordingly, we will continue to adjust our cost structure and optimize our manufacturing footprint in response to changes in the global and regional automotive markets and in order to increase investment in advanced technologies and engineering as conditions permit. As we operate in a cyclical industry that is impacted by movements in the global and regional economies, we continually evaluate opportunities to further refine our cost structure, as evidenced by our ongoing restructuring programs focused on the continued rotation of our manufacturing footprint to best cost locations and on reducing our global overhead costs, as described in Note 7. Restructuring to the consolidated financial statements contained herein. We believe our strong balance sheet coupled with our flexible cost structure will position us to capitalize on improvements in OEM production volumes as economic conditions improve.\nTrends, Uncertainties and Opportunities\nEconomic conditions.\nOur business is directly related to automotive sales and automotive vehicle production by our customers. Automotive sales depend on a number of factors, including global and regional economic conditions. Global automotive vehicle production decreased 1% (3% on an AWM basis) from 2023 to 2024, reflecting vehicle production declines of 5% in Europe and 2% in North America, partially offset by increased production of 4% in China and 3% in South America, our smallest region.\nEconomic volatility or weakness in North America, Europe, China or, to a lesser extent, South America could result in a significant reduction in automotive sales and production by our customers, which would have an adverse effect on our business, results of operations and financial condition. Global inflationary pressures have, at times, both reduced consumer demand for automotive vehicles and increased the price of inputs to our products, which has adversely impacted our sales and profitability, and this trend has continued in 2025. There is also potential that geopolitical factors could adversely impact the U.S. and other economies, and specifically the automotive sector. In particular, changes to international trade agreements, such as the United States-Mexico-Canada Agreement (the “USMCA”), increases in trade tariffs, import quotas and other trade restrictions or actions, including retaliatory responses to such actions, or other political pressures have affected and could continue to affect our operations and the operations of our OEM customers, resulting in reduced automotive production in certain regions or shifts in the mix of production to higher cost regions. Increases in interest rates could also negatively impact automotive production as a result of increased consumer borrowing costs or reduced credit availability. Additionally, economic weakness may result in\nshifts in the mix of future automotive sales (from vehicles with more content such as luxury vehicles, trucks and sport utility vehicles toward smaller passenger cars). While our diversified customer and geographic revenue base, along with our flexible cost structure, have well positioned us to withstand the impact of industry downturns and benefit from industry upturns, shifts in the mix of global automotive production to higher cost regions or to vehicles with less content could adversely impact our profitability.\nUkraine/Russia conflict.\nThe conflict between Ukraine and Russia, which began in February 2022, has had, and is expected to continue to have, negative economic impacts "
}