{
  "source_file": "are-20250930.htm",
  "form_type": "10-Q",
  "item1_clean": null,
  "item7_clean": null,
  "item2_clean": "ITEM 2. MANAGEMENT’S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS\nForward-looking statements\ncontaining the words “forecast,” “guidance,” “goals,” “projects,” “estimates,” “anticipates,” “believes,” “expects,” “intends,” “may,” “plans,”\n“seeks,” “should,” “targets,” or “will,” or the negative of those words or similar words, constitute “forward-looking statements” within the\nmeaning of Section 27A of the Securities Act of 1933, as amended, and Section 21E of the Securities Exchange Act of 1934, as\namended. Forward-looking statements involve inherent risks and uncertainties regarding events, conditions, and financial trends that\nmay affect our future plans of operations, business strategy, results of operations, and financial position. A number of important factors\ncould cause actual results to differ materially from those included within or contemplated by the forward-looking statements, including,\nbut not limited to, the following:\nOperating factors, such as a failure to operate our business successfully in comparison to market expectations or in\ncomparison to our competitors, our inability to obtain capital when desired or refinance debt maturities when desired, and/\nor a failure to maintain our status as a REIT for federal tax purposes;\nMarket and industry factors, such as adverse developments concerning the life science industry and/or our tenants;\nGovernment factors, such as any unfavorable effects resulting from federal, state, local, and/or foreign government\npolicies, laws, and/or funding levels;\nGlobal factors, such as negative economic, social, political, financial, credit market, banking conditions, and/or regional\narmed hostilities; and\nOther factors, such as climate change, cyber intrusions, and/or changes in laws, regulations, and financial accounting\nGlobal trade policies\nWe have been monitoring and will continue to monitor macroeconomic trends and uncertainties. In particular, we are\nassessing how recent fluctuations in international trade relations and trade policies could adversely affect our business or the\nbusinesses of our tenants.\nIn early March 2025, the U.S. government imposed or indicated that it would impose a series of tariffs on certain goods from\nCanada and Mexico as well as raise tariffs on Chinese imports. President Trump has also indicated his intent to impose a “major”\npharmaceutical-specific tariff, which could adversely affect our business and/or the business of our tenants. As a result of these\ndevelopments, the global securities and trade markets have reacted with volatility, and trade tensions remain high.\nThe imposition of tariffs or the potential future imposition of additional or modified tariffs in the current geopolitical climate could\nhave material adverse effects on the net profitability, revenues, or operations of Alexandria and many other companies. While we are\nevaluating the potential impacts of such tariffs, as well as our ability to mitigate such impacts, these recent trends may in the meantime\ninterrupt supply chains, fragment international business relationships, and create unknown risks that would thereby affect our or our\ntenants’ business operations.\nThis list of risks and uncertainties is not exhaustive. Additional information regarding risk factors that may affect us is included\nunder Part I; “Item 1A. Risk factors”; and “Item 7. Management’s discussion and analysis of financial condition and results of\nand under respective sections in this quarterly\nfor further discussion regarding such factors.\nWe are a Maryland corporation formed in October 1994 that has elected to be taxed as a REIT for federal income tax\nAlexandria Real Estate Equities, Inc. (NYSE: ARE),\n\n(Dollars in millions)\nOperating occupancy percentage in North America as of\nLease renewals and re-leasing of space:\nRental rate changes (cash basis)\nSame property performance:\nNet operating income changes\nNet operating income changes (cash basis)\nStraight-line rent revenue\n$21 million reduction\nGeneral and administrative expenses\nCapitalization of interest\n$10 million increase\nRealized gains on non-real estate investments\n$5 million reduction\nOur assumptions presented in the table above are subject to a number of variables and uncertainties, including those discussed as “Forward-looking statements” under\n, as well as in “Item 1A. Risk factors”; and “Item 2. Trends that may affect our future results” within “Part II – Other information” of this\nsignificant changes to such guidance\nOur guidance assumes an approximate\nbenefit related to a range of assets with vacancy that could potentially qualify for classification as held for sale by\nDecember 31, 2025. These assets have not yet reached the criteria for held for sale designation as of September 30, 2025.\nIn October 2025, we executed a one-year lease extension aggregating\nRSF with an investment-grade rated government institution tenant at a recently acquired\noffice property in our Canada market.\nAt acquisition, this building was originally targeted for a future change in use, but we instead renewed the existing tenant through\nthe beginning of 2027, with no incremental capital investment. We continue to evaluate options to convert this space, subject to market conditions.\nThe impact from this\nrenewal on our 2025 rental rate changes is anticipated to result in a reduction of approximately\nThe increase in the midpoint of our guidance range for 2025 interest expense is primarily due to the\nreduction to the midpoint of our guidance range for\n2025 dispositions and sales of partial interests, which includes expected delays in the closing of certain dispositions that are now anticipated to be completed in the first\nRepresents realized gains and losses included in funds from operations per share – diluted, as adjusted, and excludes significant impairments realized on non-real\nestate investments, if any.\nThe midpoint of our revised guidance range for\nrealized gains on non-real estate investments assumes approximately\nfourth quarter of 2025, compared to the quarterly average realized gains of approximately\nper quarter for the nine months ended September 30, 2025. R\nto Note 7 – “Investments” to our unaudited consolidated financial statements in Item 1 for additional details.\nKey Credit Metric Targets\nNet debt and preferred stock to Adjusted EBITDA – fourth\nLess than or equal to 5.2x\nFixed-charge coverage ratio – fourth quarter of\n\nnge. We expect dispositions\nour total dispositions and sales of partial interest sales for the year ending\nRefer to “Dispositions and sales of\npartial interests” in Item 2 for additional information on our real estate dispositions\nUnder our common stock repurchase program\nauthorized in December 2024, we may repurchase up to\nof our common stock through\n. D\nuring the three months ended\n, we did not repurchase any shares of common stock. As of the date of this report, the approximate value of\nshares authorized and\nremaining under this program was\nmarket conditions, we may consider repurchasing additional shares of our common\nIn August 2025, we repaid a secured construction loan held by our development project at 99 Coolidge Avenue in our Cambridge/Inner Suburbs submarket. Refer to\nNote 10 – “Secured and unsecured senior debt” to our unaudited consolidated financial statements in Item 1 for additional information.\nThe key assumptions behind the sources and uses of capital in the table above include favorable real estate transaction and\ncapital market environments, performance of our core operating properties, lease-up and delivery of current and future development\nand redevelopment projects, and leasing activity. Our expected sources and uses of capital are subject to a number of variables and\nuncertainties, including those discussed as “Forward-looking statements” under Part I; “Item 1A. Risk factors”; and “Item 7.\n; as well as in “Item 1A. Risk factors”; and “Item 2. Trends that may affect our future results” within “Part II –\nNet cash provided by operating activities after dividends\nof net cash flows from operating activities after payment of common stock\ndividends, and distributions to noncontrolling interests for the year ending\nexcluding the payment of our final\n\nfourth quarter of 2026\nTrends that may affect our future results\nCurrent identified key market trends and uncertainties that had or may have a negative effect on our business are discussed\nbelow. Although we seek to minimize the risks posed by these trends and uncertainties as discussed in the mitigating factors section\nbelow, there can be no assurance that these measures will be successful in preventing material impacts on our future results of\noperations, financial position, and cash flows. Refer to “Item 1A. Risk factors” within “Part II – Other information” of this quarterly report\ndiscussion of additional risks we face.\nNew competitive supply may exert pressure on our rental rates and occupancy, and adversely affect our operating\n\nDevelopment – under construction\n10075 Barnes Canyon Road\n4135 Campus Point Court\n701 Dexter Avenue North\nDevelopment – placed into service after\n9810 Darnestown Road\n9820 Darnestown Road\n1150 Eastlake Avenue East\n4155 Campus Point Court\n201 Brookline Avenue\n9808 Medical Center Drive\n230 Harriet Tubman Way\n500 North Beacon Street and 4 Kingsbury Avenue\n10935, 10945, and 10955 Alexandria Way\nRedevelopment – under construction\n40, 50, and 60 Sylvan Road\n269 East Grand Avenue\n651 Gateway Boulevard\n8800 Technology Forest Place\nOne Hampshire Street\nRedevelopment – placed into service after\nfor Advanced Technologies –\nUnconsolidated real estate JVs\nProperties held for sale\nTotal properties excluded from Same Properties\nTotal properties in North America as of\nThe following table presents information regarding our Same Properties for the\nthree and nine months ended September 30,\nPercentage change in net operating income over comparable period from prior\nPercentage change in net operating income (cash basis) over comparable"
}