{
  "source_file": "are-20241231.htm",
  "form_type": "10-K",
  "item1_clean": "A/A+ properties undergoing construction\nWe develop dynamic Megacampus ecosystems that enable and inspire the world’s most brilliant minds and innovative\ncompanies to create life-changing scientific and technological innovations. We believe in the utmost professionalism, humility, and\nteamwork. Our tenants include multinational pharmaceutical companies; public and private biotechnology companies; life science\nproduct, service, and medical device companies; digital health, technology, and agtech companies; academic and medical research\ninstitutions; U.S. government research agencies; non-profit organizations; and venture capital firms. Alexandria has a longstanding\nand proven track record of developing Class A/A+ properties clustered in highly dynamic and collaborative Megacampus\nenvironments that enhance our tenants’ ability to successfully recruit and retain world-class talent and inspire productivity, efficiency,\ncreativity, and success. Alexandria also provides strategic capital to transformative life science companies through our venture\ncapital platform. We believe our unique business model and diligent underwriting ensure a high-quality and diverse tenant base that\nresults in higher occupancy levels, longer lease terms, higher rental income, higher returns, and greater long-term asset value.\n\nInvestment-grade or publicly traded large cap tenants represented\nof our total annual rental revenue in effect as of\n. Additional information regarding our consolidated and unconsolidated real estate joint ventures is included in\nItem 7. Management’s discussion and analysis of financial condition and results of operations\nFor information regarding risk factors that may affect us, refer to “\n\nin AAA life science innovation cluster locations, including Greater Boston, the San Francisco Bay Area, San Diego, Seattle,\nMaryland, Research Triangle, and New York City. As of\n, Alexandria has a total market capitalization of\nand an asset base in North America that includes\n\nITEM 1. BUSINESS\nWe are a Maryland corporation formed in October 1994 that has elected to be taxed as a REIT for federal income tax\nAlexandria Real Estate Equities, Inc. (NYSE: ARE),\n\nproperties in North America consisting of approximately\noperating properties and\nnew Class A/A+ development and redevelopment properties under construction\nproperties and development projects that are held by consolidated real estate joint ventures and\nproperties that are held by\nunconsolidated real estate joint ventures.\nThe occupancy percentage of our operating properties in North America was\n. The 10-year average occupancy percentage of our operating properties as of\n\nS&P 500\ncompany, is a best-in-class, mission-driven life science\nREIT making a positive and lasting impact on the world. With our founding in 1994, Alexandria pioneered the life science real estate\nniche. Alexandria is the preeminent and longest-tenured owner, operator, and developer of collaborative Megacampus™",
  "item7_clean": "Our tenants, many of which conduct business in the life science industry, may incur significant costs or losses responding to\nany highly infectious or contagious disease, lose business due to interruption in their operations, or incur other liabilities related to\nshelter-in-place orders, quarantines, infection, or other related factors. Tenants that experience deteriorating financial conditions as a\nresult of the outbreak or spread of such disease may be unwilling or unable to pay rent in full or timely due to bankruptcy, lack of\nliquidity, lack of funding, operational failures, or other reasons. Our tenants’ defaults and delayed or partial rental payments could\nadversely impact our rental revenues and operating results.\nThe negative effects of any highly infectious or contagious disease on our tenants in the life science industry may include, but\nDelays or difficulties in enrolling patients or maintaining scheduled study visits in clinical trials;\nDelays or difficulties in clinical site initiation, including difficulties in recruiting clinical site investigators and staff;\nDiversion of healthcare resources away from clinical trials, including the diversion of hospitals serving as our tenants’\nclinical trial sites and hospital staff supporting the conduct of our tenants’ clinical trials;\nInterruptions of key clinical trial or other research activities, such as clinical trial site monitoring, due to limitations on travel\nimposed or recommended by federal or state governments, employers, and others;\nLimitations in employee resources that would otherwise be focused on our tenants’ research, business, or clinical trials,\nincluding because of sickness of employees or their families, the desire of employees to avoid contact with large groups of\npeople, or as a result of the governmental imposition of shelter-in-place or similar working restrictions;\nInterruptions in supply chain, manufacturing, and global shipping, or other delays that may affect the transport of materials\nnecessary for our tenants’ research, clinical trials, or manufacturing activities;\nReduction in revenue projections for our tenants’ products due to the prioritization of the treatment of affected patients\nover other treatments, such as specialty and elective procedures;\nDelays in necessary interactions with ethics committees, regulators, and other important agencies and contractors due to\nlimitations in employee resources or forced furlough of government employees;\nDelays in receiving approval from regulatory authorities to initiate planned clinical trials or research activities;\nDelays in commercialization of our tenants’ products and approval by government authorities (such as the FDA and the\nfederal and state Emergency Management Agencies) of our tenants’ products caused by disruptions, funding shortages,\nor health concerns, as well as by the prioritization by the FDA of the review and approvals of diagnostics, therapeutics,\nand vaccines that are related to an outbreak;\nDifficulty in retaining staff or rehiring staff in connection with layoffs caused by deteriorating global market conditions;\nChanges in local regulations as part of a response to an outbreak or spread that may require our tenants to change the\nways in which their clinical trials are conducted, which may result in unexpected costs or the discontinuation of the clinical\nRefusal or reluctance of the FDA to accept data from clinical trials in affected geographies outside the U.S.;\nDiminishing public trust in healthcare facilities or other facilities that are treating (or have treated) patients affected by\ncontagious diseases; and\nInability to access capital on terms favorable to our tenants because of changes in company valuation and/or investor\nappetite due to a general downturn in economic and financial conditions and the volatility of the market.\nThe negative effects of any highly infectious or contagious disease on our tenants in the agtech industry may include:\nReduction in productive capacity and profitability because of decreased labor availability due, for example, to government\nrestrictions, the inability of employees to report to work, or collective bargaining efforts;\nPotential contract cancellations, project reductions, and reduction in demand for our tenants’ products due to the adverse\neffect on business confidence and consumer sentiments and the general downturn in economic conditions;\nDisruption of the logistics necessary to import, export, and deliver products to target companies and their customers due\nto ports and other channels of entry being closed or operating at only a portion of capacity;\nDisruptions to manufacturing facilities and supply lines; and\nInability to access capital on terms favorable to our tenants because of changes in company valuation and/or investor\nappetite due to a general downturn in economic and financial conditions and the volatility of the market.\nThe negative effects of any highly infectious or contagious disease on our tenants in the technology industry may include:\nReduction in staff productivity due to business closures, alternative working arrangements, or illness of staff and/or illness\nReduction in sales of our tenants’ services and products, longer sales cycles, reduction in subscription duration and value,\nslower adoption of new technologies, and increase in price competition due to economic uncertainties and downturns;\nDisruptions to our tenants’ supply chain, manufacturing vendors, or logistics providers of products or services;\nLimitations on business and marketing activities due to travel restrictions, virtualization, or cancellation of related events;\nAdverse impact on customer relationships and our ability to recognize revenues due to our tenants’ inability to access their\nclients’ sites for implementation and on-site consulting services;\nInability to recruit and develop highly skilled employees with appropriate qualifications, to conduct background checks on\npotential employees, and to provide necessary equipment and training to new and existing employees;\nNetwork infrastructure and technology system failures of our tenants, or of third-party services used by our tenants, which\nmay result in system interruptions, reputational harm, loss of intellectual property, delays in product development, lengthy\ninterruptions in services, breaches of data security, and loss of critical data;\nHigher employment compensation costs that may not be offset by improved productivity or increased sales; and\nInability to access capital on terms favorable to our tenants because of changes in company valuation and/or investor\nappetite due to a general downturn in of economic and financial conditions and the volatility of the market.\nThe potential impact of any highly infectious or contagious disease with respect to our tenants or our properties is difficult to\npredict and could have a material adverse impact on our tenants’ operations and, in turn, on our revenues, business, and results of\noperations, as well as the value of our stock. Any highly infectious or contagious disease may directly or indirectly cause the realization\nWe may incur significant costs if we fail to comply with laws or if laws change.\nOur properties are subject to many federal, state, and local regulatory requirements and to state and local fire, life-safety,\nenvironmental, and other requirements. If we do not comply with all of these requirements, we may have to pay fines to government\nauthorities or damage awards to private litigants or temporarily halt operations due to injunctions. We do not know whether these\nrequirements will change or whether new requirements will be imposed. Changes in these regulatory requirements could require us to\nmake significant unanticipated expenditures. These expenditures could have an adverse effect on us and our ability to make\ndistributions to our stockholders.\nFor example, the California Safe Drinking Water and Toxic Enforcement Act, also referred to as Proposition 65, requires “clear\nand reasonable” warnings be given to persons who are exposed to chemicals known to the State of California to cause cancer or\nreproductive toxicity. We believe that we comply with Proposition 65 requirements; however, there can be no assurance that we will not\nbe adversely affected by litigation or regulatory enforcement relating to Proposition 65. In addition, there can be no assurance that the\ncosts of compliance with new environmental laws and regulations will not be significant or will not adversely affect our ability to meet our\nfinancial expectations, our financial condition, results of operations, and cash flows.\nWe may incur significant costs in complying with the Americans with Disabilities Act and similar laws.\nUnder the ADA, places of public accommodation and/or commercial facilities must meet federal requirements related to access\nand use by disabled persons. We may be required to make substantial capital expenditures at our properties to comply with this law. In\naddition, non-compliance could result in the imposition of fines or an award of damages to private litigants.\nA number of additional federal, state, and local laws and regulations exist regarding access to properties by disabled persons.\nThese regulations may require modifications to our properties or may affect future renovations. These expenditures may have an\nadverse impact on overall returns on our investments.\nWe face possible risks and costs associated with the effects of climate change and severe weather\nWe cannot predict the rate at which climate change will progress. However, the physical effects of climate change could have a\nmaterial adverse effect on our properties, operations, and business. For example, most of our properties are located along the east and\nwest coasts of the U.S. To the extent that climate change impacts changes in weather patterns, our markets could experience severe\nweather, including hurricanes, severe winter storms, and coastal flooding due to increases in storm intensity and rising sea levels.\nCertain of our properties are also located along shorelines and may be vulnerable to coastal hazards, such as sea level rise, severe\nweather patterns and storm surges, land erosion, and groundwater intrusion. Over time, these conditions could result in declining\ndemand for space at our properties, delays in construction, resulting in increased construction costs, or in our inability to operate the\nbuildings at all. Climate change and severe weather may also have indirect effects on our business by increasing the cost of, or\ndecreasing the availability of, property insurance on terms we find acceptable, by increasing the costs of energy, maintenance, repair of\nwater and/or wind damage, and snow removal at our properties.\nIn March 2022, the SEC released a proposed standard that would require quantitative disclosures of certain climate-related\nmetrics and greenhouse gas (“GHG”) emissions, including within the footnotes to our consolidated financial statements. On March 6,\n2024, the SEC adopted the new standards, with the rules originally set to take effect as of May 28, 2024. These rules would have\nrequired public companies to disclose information on (i) climate-related financial risks, (ii) GHG emissions, and (iii) climate-related\ntargets or transition plans. However, on April 4, 2024, the SEC issued an order to stay these rules pending judicial review following legal\nchallenges. As of the date of this report, the implementation of the new climate-related disclosures remains indefinitely delayed. We\ncontinue to monitor developments and assess the potential effect of these new standards, if implemented at all, on our future\nconsolidated financial statements.\nIn addition, California introduced new climate-related reporting requirements under the Climate Corporate Data Accountability\nAct (SB 253) and the Climate-Related Financial Risk Act (SB 261), which were signed into law in October 2023. These laws require\ncorporations doing business in California to annually report their GHG emissions across Scopes 1, 2, and 3 (SB 253) and to disclose\nclimate-related financial risks and risk mitigation strategies (SB 261). Reporting under these laws is phased in, with initial emissions\nreporting required in 2026 based on 2025 data, and climate risk disclosures commencing in 2026. Considering our operations in\nCalifornia, we continue to enhance our existing data collection, reporting, and assurance processes for climate-related metrics and\nIn August 2022, the U.S. Congress signed into law the Inflation Reduction Act of 2022 (“IRA”), which directed nearly $400\nbillion of federal spending to be used toward reducing carbon emissions and funding clean energy over the next 10 years and was\ndesigned to encourage private investment in clean energy, transport, and manufacturing. Since its inaugural year in 2023, nearly $500\nbillion in new green investments and 334,000 new green jobs across the U.S. have been attributed to the IRA. However, long-term\nimpacts and benefits, if any, resulting from the IRA are still to be determined.\nNumerous states and municipalities have adopted state and local laws and policies on climate disclosures and climate change\nand emission reduction targets impacting the building sector. For example, the State of California enacted legislation requiring certain\ncompanies to disclose GHG emissions and climate-related financial risk information. Other cities, including Boston, Cambridge, New\nYork, and Seattle, have passed ordinances that set limits on GHG emissions associated with building operations. Some municipalities,\nincluding the Cities of New York and San Francisco, have also implemented legislation to eliminate the use of natural gas in new\nconstruction projects.\nPresident Trump’s victory in the U.S. presidential election, as well as the Republican Party’s gaining control of both the U.S.\nHouse of Representatives and Senate in the congressional election, may create regulatory uncertainty with respect to climate change\npolicy. During the election campaign, President Trump made comments suggesting that he was not supportive of various clean energy\nprograms and initiatives, including the United Nations (“U.N.”) Framework Convention on Climate Change, designed to curtail global\nwarming. On January 20, 2025, President Trump signed an executive order to withdraw the U.S. from the Paris Agreement, marking a\nsignificant shift in U.S. climate policy. It remains unclear what further actions President Trump may take with respect to domestic and\ninternational programs and initiatives, and what support the Trump administration would have for any potential changes to such\nlegislative programs and initiatives in the U.N. or the U.S. Congress.\nChanges in federal, state, and local legislation and regulation based on concerns about climate change could result in\nincreased capital expenditures on our existing properties and our new development properties (for example, to improve their energy\nefficiency and/or resistance to severe weather), and in our and our tenants’ increased compliance and other costs, without a\ncorresponding increase in revenue, which may result in adverse impacts to our and our tenants’ operating results.\nAlso, we rely on a limited number of vendors to provide key services, including, but not limited to, utilities and construction\nservices, at certain of our properties. If, as a result of unanticipated events, including those resulting from climate change, these\nvendors fail to adequately provide key services, we may experience significant interruptions in service and disruptions to business\noperations at our properties, incur remediation costs, and become subject to claims and damage to our reputation. Near\nproperties we own and operate are located in California, where climate change has been linked to the progressively warmer and drier\nweather associated with ideal conditions for highly destructive wildfires.\nFor example, most of our ",
  "item2_clean": null
}