{
  "source_file": "ato-20250930.htm",
  "form_type": "10-K",
  "item1_clean": "ITEM 1.\nOverview and Strategy\nAtmos Energy Corporation, a natural gas-only distributor, is an S&P 500 company headquartered in Dallas and incorporated in Texas and Virginia. We safely deliver reliable, efficient, and abundant natural gas through regulated sales and transportation arrangements to approximately 3.4 million residential, commercial, public authority, and industrial customers in eight states located primarily in the South. We also operate one of the largest intrastate pipelines in Texas based on miles of pipe.\nAtmos Energy's vision is to be the safest provider of natural gas services. We will be recognized for exceptional customer service, for being a great employer, and for achieving superior financial results.\nOur operating strategy is focused on modernizing our business and infrastructure while reducing regulatory lag. This operating strategy supports continued investment in safety, innovation, environmental sustainability, and our communities.\nWe manage and review our consolidated operations through the following reportable segments:\ndistribution segment\nis comprised of our regulated natural gas distribution and related sales operations in eight states.\npipeline and storage segment\nis comprised primarily of the regulated pipeline and storage operations of our Atmos Pipeline-Texas division and our natural gas transmission operations in Louisiana.\nDistribution Segment Overview\nThe following table summarizes key information about our six regulated natural gas distribution divisions, presented in order of total rate base.\nTexas, including the Dallas/Fort Worth Metroplex\nAmarillo, Lubbock, Midland\nWe operate in our service areas under terms of non-exclusive franchise agreements granted by the various cities and towns that we serve. At September 30, 2025, we held 1,010 franchises having terms generally ranging from five to 35 years. A number of our franchises expire each year, which require renewal prior to the end of their terms. Historically, we have successfully renewed these franchises and believe that we will continue to be able to renew our franchises as they expire.\nRevenues in this operating segment are established by regulatory authorities in the states in which we operate. These rates are intended to be sufficient to cover the costs of conducting business, including a reasonable return on invested capital. In addition, we transport natural gas for others through our distribution systems.\nRates established by regulatory authorities often include cost adjustment mechanisms for costs that (i) are subject to significant price fluctuations compared to our other costs, (ii) represent a large component of our cost of service, and (iii) are generally outside our control.\nPurchased gas cost adjustment mechanisms represent a traditional and common form of cost adjustment mechanism. Purchased gas cost adjustment mechanisms provide a method of recovering purchased gas costs on an ongoing basis without filing a rate case because they provide a dollar-for-dollar offset to increases or decreases in the cost of natural gas. Therefore, although substantially all of our distribution operating revenues fluctuate with the cost of gas that we purchase, distribution operating income is generally not affected by fluctuations in the cost of gas.\nAdditionally, some jurisdictions have performance-based ratemaking adjustments to provide incentives to minimize purchased gas costs through improved storage management and use of financial instruments to reduce volatility in gas costs. Under the performance-based ratemaking adjustments, purchased gas costs savings are shared between the Company and its customers.\nOur supply of natural gas is provided by a variety of suppliers, including independent producers, and marketers. The gas is delivered into our systems by various pipeline companies, withdrawals of gas from proprietary and contracted storage assets, and base load and peaking arrangements, as needed.\nSupply arrangements consist of both base load and peaking quantities and are contracted from our suppliers on a firm basis with various terms at market prices. Base load quantities are those that flow at a constant level throughout the month and peaking quantities provide the flexibility to change daily quantities to match increases or decreases in requirements related to weather conditions.\nExcept for local production purchases, we select our natural gas suppliers through a competitive bidding process by periodically requesting proposals from suppliers. We select these suppliers based on their ability to reliably deliver gas supply to our designated firm pipeline receipt points at the lowest reasonable cost. Major suppliers during fiscal 2025 were ARM Energy Management LLC, Cima Energy, LP, ConocoPhillips Company, ECO Energy Natural Gas LLC, EnLink Gas Marketing LP, Sequent Energy Management LLC, Symmetry Energy Solutions, LLC, Targa Gas Marketing LLC, Tenaska Marking Ventures, and Texla Energy Management, Inc.\nThe combination of base load and peaking agreements, coupled with the withdrawal of gas held in storage, allows us the flexibility to adjust to changes in weather, which minimizes our need to enter into long-term firm commitments. We estimate our peak-day availability of natural gas supply to be approximately 5.4 Bcf. The peak-day demand for our distribution operations in fiscal 2025 was on February 19, 2025, when sales to customers reached approximately 4.2 Bcf.\nCurrently, our distribution divisions utilize 33 pipeline transportation companies, both interstate and intrastate, to transport our natural gas. The pipeline transportation agreements are firm and many of them have “pipeline no-notice” storage service, which provides for daily balancing between system requirements and nominated flowing supplies. These agreements have been negotiated with the shortest term necessary while still maintaining our right of first refusal. The natural gas supply for our Mid-Tex Division is delivered primarily by our APT Division.\nTo maintain our deliveries to high priority customers, we have the ability, and have exercised our right, to interrupt or curtail service to certain customers pursuant to contracts and applicable state regulations or statutes. Our customers’ demand on our system is not necessarily indicative of our ability to meet current or anticipated market demands or immediate delivery requirements because of factors such as the physical limitations of gathering, storage and transmission systems, the duration and severity of cold weather, the availability of gas reserves from our suppliers, the ability to purchase additional supplies on a short-term basis, and actions by federal and state regulatory authorities. Interruption and curtailment rights provide us the flexibility to meet the human-needs requirements of our customers on a reliable basis. Priority allocations imposed by federal and state regulatory agencies, as well as other factors beyond our control, may affect our ability to meet the demands of some of our customers.\nPipeline and Storage Segment Overview\nOur pipeline and storage segment consists of the regulated pipeline and storage operations of APT and our natural gas transmission operations in Louisiana. APT is one of the largest intrastate pipeline operations in Texas with a heavy concentration in the established natural gas-producing areas of central, northern, and eastern Texas, extending into or near the major producing areas of the Barnett Shale, the Texas Gulf Coast, and the Permian Basin of West Texas. Through its system, APT provides transportation and storage services to our Mid-Tex Division, other third party local distribution companies, industrial and electric generation customers, marketers, and producers. As part of its pipeline operations, APT owns and operates five underground storage facilities in Texas.\nRevenues earned from transportation and storage services for APT are subject to traditional ratemaking governed by the RRC. Rates are updated through periodic filings made under Texas’ GRIP. GRIP allows us to include in our rate base annually approved capital costs incurred in the prior calendar year provided that we file a complete rate case at least once every five\nyears; the most recent of which was completed in December 2023. APT’s existing regulatory mechanisms allow certain transportation and storage services to be provided under market-based rates.\nOur natural gas transmission operations in Louisiana are comprised of a 21-mile pipeline located in the New Orleans, Louisiana area that is primarily used to aggregate gas supply for our distribution division in Louisiana under a long-term contract and, on a more limited basis, to third parties. The demand fee charged to our Louisiana distribution division for these services is subject to regulatory approval by the Louisiana Public Service Commission. We also manage two asset management plans that serve distribution affiliates of the Company, which have been approved by applicable state regulatory commissions. Generally, these asset management plans require us to share with our distribution customers a significant portion of the cost savings earned from these arrangements.\nThe method of determining regulated rates varies among the states in which our regulated businesses operate. The regulatory authorities have the responsibility of ensuring that utilities in their jurisdictions operate in the best interests of customers while providing utility companies the opportunity to earn a reasonable return on their investment. Generally, each regulatory authority reviews rate requests and establishes a rate structure intended to generate revenue sufficient to cover the costs of conducting business, including a reasonable return on invested capital.\nOur rate strategy focuses on reducing or eliminating regulatory lag, obtaining adequate returns, and providing stable, predictable margins, which benefit both our customers and the Company. As a result of our ratemaking efforts and legislative actions in our jurisdictions in recent years, Atmos Energy has:\nFormula rate mechanisms in place in four states that provide for an annual rate review and adjustment to rates.\nInfrastructure programs in place in all of our states that provide for an annual adjustment to rates for qualifying capital expenditures. Through our annual formula rate mechanisms and infrastructure programs, we have the ability to begin recovering approximately 95 percent of our capital expenditures within six months and substantially all of our capital expenditures within twelve months.\nAuthorization in tariffs, statute or commission rules that allows us to defer certain elements of our incurred cost of service such as depreciation, ad valorem taxes, pension costs, and certain safety related expenses, until they are included in rates.\nWNA mechanisms in seven states that serve to minimize the effects of weather on approximately 97 percent of our distribution residential and commercial revenues.\nThe ability to recover the gas cost portion of bad debts in six states which represents approximately 89 percent of our distribution residential and commercial revenues.\nThe following tables provides a jurisdictional rate summary for our regulated operations as of September 30, 2025. This information is for regulatory purposes only and may not be representative of our actual financial position.\nAtmos Pipeline — Texas\nWest Texas Systemwide\n\n2025 Rate Case Filings:\nWest Texas Systemwide\nTotal 2025 Rate Case Filings\n2024 Rate Case Filings:\nAtmos Pipeline - Texas\nTotal 2024 Rate Case Filings\n2023 Rate Case Filings:\nTotal 2023 Rate Case Filings\n(1) On May 12, 2025, we implemented rates subject to refund; on August 11, 2025, the Kentucky Public Service Commission issued a final order.\nWe are regulated by various state or local public utility authorities. We are also subject to regulation by the United States Department of Transportation with respect to saf",
  "item7_clean": "ITEM 7.\nManagement’s Discussion and Analysis of Financial Condition and Results of Operations.\nINTRODUCTION\nThis section provides management’s discussion of the financial condition, changes in financial condition, and results of operations of Atmos Energy Corporation and its consolidated subsidiaries with specific information on results of operations and liquidity and capital resources. It includes management’s interpretation of our financial results, the factors affecting these results, the major factors expected to affect future operating results, and future investment and financing plans. This discussion should be read in conjunction with our consolidated financial statements and notes thereto.\nSeveral factors exist that could influence our future financial performance, some of which are described in Item 1A above, “Risk Factors”. They should be considered in connection with evaluating forward-looking statements contained in this report or otherwise made by or on behalf of us since these factors could cause actual results and conditions to differ materially from those set out in such forward-looking statements.\nCautionary Statement for the Purposes of the Safe Harbor under the Private Securities Litigation Reform Act of 1995\nreduce or eliminate greenhouse gas emissions or fossil fuels; the impact of climate change; the capital-intensive nature of our business; our ability to continue to access the credit and capital markets to execute our business strategy; market risks beyond our control affecting our risk management activities, including commodity price volatility, counterparty performance or creditworthiness, and interest rate risk; the concentration of our operations in Texas; the impact of adverse economic conditions on our customers; changes in the availability and price of natural gas; and increased costs of providing health care benefits, along with pension and postretirement health care benefits and increased funding requirements. Accordingly, while we believe these forward-looking statements to be reasonable, there can be no assurance that they will approximate actual experience or that the expectations derived from them will be realized. Further, we undertake no obligation to update or revise any of our forward-looking statements whether as a result of new information, future events or otherwise.\nOVERVIEW\nAtmos Energy's vision is to be the safest provider of natural gas services. Our commitment to this vision requires significant levels of capital spending to modernize our natural gas distribution system and operating costs to deliver natural gas safely and reliably and in compliance with the various safety regulations impacting our business. We have the ability to begin recovering a significant portion of our expenditures timely through rate designs and mechanisms that reduce or eliminate regulatory lag and separate the recovery of our approved rate from customer usage patterns. The execution of our capital spending program, the ability to recover these expenditures timely and our ability to access the capital markets to satisfy our financing needs are the primary drivers that affect our financial performance.\nWe anticipate making significant capital expenditures for the foreseeable future to modernize our distribution and transmission system, to comply with the safety rules and regulations issued by the regulatory authorities responsible for the service areas in which we operate, and to prepare to serve the growing needs of the communities we serve. Between fiscal years 2026 and 2030, we anticipate spending approximately $26 billion, with more than 80 percent dedicated to safety and reliability spending. The magnitude and allocation of these expenditures may be affected by factors such as new policy and regulations, population growth, and increased labor and materials costs. Although we believe these costs are ultimately recoverable through our rates based on the regulatory frameworks currently available to us, full recovery is not assured.\nCRITICAL ACCOUNTING POLICIES\nOur consolidated financial statements were prepared in accordance with accounting principles generally accepted in the United States. Preparation of these financial statements requires us to make estimates and judgments that affect the reported amounts of assets, liabilities, revenues, and expenses and the related disclosures of contingent assets and liabilities. We base our estimates on historical experience and various other assumptions that we believe to be reasonable under the circumstances. Actual results may differ from estimates.\nOur significant accounting policies are discussed in Note 2 to our consolidated financial statements. The accounting policies discussed below are both important to the presentation of our financial condition and results of operations and require management to make difficult, subjective, or complex accounting estimates. Accordingly, these critical accounting policies are reviewed periodically by the Audit Committee of the Board of Directors.\nFactors Influencing Application of the Policy\nOur distribution and pipeline operations meet the criteria of a cost-based, rate-regulated entity under accounting principles generally accepted in the United States. Accordingly, the financial results for these operations reflect the effects of the ratemaking and accounting practices and policies of the various regulatory commissions to which we are subject.\nAs a result, certain costs that would normally be expensed under accounting principles generally accepted in the United States are permitted to be capitalized or deferred on the balance sheet because it is probable they can be recovered through rates. Further, regulation may impact the period in which revenues or expenses are recognized. The amounts expected to be recovered or recognized are based upon historical experience and our understanding of the regulations.\nDiscontinuing the application of this method of accounting for regulatory assets and liabilities or changes in the accounting for our various regulatory mechanisms could significantly increase our operating expenses as fewer costs would likely be capitalized or deferred on the balance sheet, which could reduce our net income.\nDecisions of regulatory authorities\nIssuance of new regulations or regulatory mechanisms\nAssessing that the recoverability of deferred costs and utility assets is probable\nContinuing to meet the criteria of a cost-based, rate regulated entity for accounting purposes\nFactors Influencing Application of the Policy\nPension and other postretirement plans\nPension and other postretirement plan costs and liabilities are determined on an actuarial basis using a September 30 measurement date and are affected by numerous assumptions and estimates including the market value of plan assets, estimates of the expected return on plan assets, assumed discount rates, and current demographic and actuarial mortality data. The assumed discount rate and the expected return are the assumptions that generally have the most significant impact on our pension costs and liabilities. The assumed discount rate, the assumed health care cost trend rate, and assumed rates of retirement generally have the most significant impact on our postretirement plan costs and liabilities.\nThe discount rate is utilized principally in calculating the actuarial present value of our pension and postretirement obligations and net periodic pension and postretirement benefit plan costs. When establishing our discount rate, we consider high quality corporate bond rates based on bonds available in the marketplace that are suitable for settling the obligations, changes in those rates from the prior year, and the implied discount rate that is derived from matching our projected benefit disbursements with currently available high quality corporate bonds.\nThe expected long-term rate of return on assets is utilized in calculating the expected return on plan assets component of our annual pension and postretirement plan costs. We estimate the expected return on plan assets by evaluating expected bond returns, equity risk premiums, asset allocations, the effects of active plan management, the impact of periodic plan asset rebalancing, and historical performance. We also consider the guidance from our investment advisors in making a final determination of our expected rate of return on assets. To the extent the actual rate of return on assets realized over the course of a year is greater than or less than the assumed rate, that year’s annual pension or postretirement plan costs are not affected. Rather, this gain or loss reduces or increases future pension or postretirement plan costs over a period of approximately ten to twelve years.\nThe market-related value of our plan assets represents the fair market value of the plan assets, adjusted to smooth out short-term market fluctuations over a five-year period. The use of this methodology will delay the impact of current market fluctuations on the pension expense for the period.\nWe estimate the assumed health care cost trend rate used in determining our postretirement net expense based upon our actual health care cost experience, the effects of recently enacted legislation and general economic conditions. Our assumed rate of retirement is estimated based upon our annual review of our participant census information as of the measurement date.\nGeneral economic and market conditions\nAssumed investment returns by asset class\nAssumed future salary increases\nAssumed discount rate\nProjected timing of future cash disbursements\nHealth care cost experience trends\nParticipant demographic information\nActuarial mortality assumptions\nImpact of legislation\nImpact of regulation\nRESULTS OF OPERATIONS\nThe following table details our consolidated net income by segment during the last three fiscal years:\n\n(In thousands, unless otherwise noted)\nOther non-operating income\nIncome before income taxes\nConsolidated distribution sales volumes — MMcf\nConsolidated distribution transportation volumes — MMcf\nTotal consolidated distribution throughput — MMcf\nConsolidated distribution average cost of gas per Mcf sold\nFiscal year ended September 30, 2025 compared with fiscal year ended September 30, 2024\nOperating income for our distribution segment increased 12.8 percent. Key drivers for the change in operating income include:\na $184.1 million increase in rate adjustments, primarily in our Mid-Tex Division.\na $26.7 million increase related to residential customer growth, primarily in our Mid-Tex Division, and increased industrial load.\na $46.3 million decrease in refunds of excess deferred taxes to customers, which is substantially offset in income tax expense.\nPartially offset by:\na $78.0 million increase in depreciation expense and property taxes associated with increased capital investments.\na $32.6 million increase in employee-related costs primarily due to an increase in headcount to support company growth.\nan $18.6 million increase in system monitoring, line locating, and other compliance-related activities.\na $17.8 million increase in bad debt expense due to a regulatory change in Mississippi in the first quarter of fiscal 2024 which significantly reduced bad debt expense in fiscal 2024, as discussed in Note 6 to the consolidated financial statements.\nAdditionally, our distribution segment's fiscal 2025 results were favorably impacted by $18.5 million as a result of Texas legislation that became effective during the third quarter of fiscal 2025 related to infrastructure spending.\nThe following table shows our operating income by distribution division, in order of total rate base, for the fiscal years ended September 30, 2025, 2024, and 2023. The presentation of our distribution operating income is included for financial reporting purposes and may not be appropriate for ratemaking purposes.\n\nPipeline and Storage Segment\nOur pipeline and storage segment consists of the pipeline and storage operations of our Atmos Pipeline–Texas Division (APT) and our natural gas transmission operations in Louisiana. APT is one of the largest intrastate pipeline operations in Texas with a heavy concentration in the established natural gas producing areas of central, northern, and eastern Texas, extending into or near the major producing areas of the Barnett Shale, the Texas Gulf Coast, and the Permian Basin of West Texas. APT provides transportation and storage services to our Mid-Tex Division, other third-party local distribution companies, industrial, and electric generation customers, as well as marketers and producers. Over 80 percent of this segment's revenues are derived from these APT services. These revenues are subject to traditional ratemaking governed by the Texas Railroad Commission (RRC). As part of its pipeline operations, APT owns and operates five underground storage facilities in Texas.\nOur natural gas transmission operations in Louisiana are comprised of a 21-mile pipeline located in the New Orleans, Louisiana area that is primarily used to aggregate gas supply for our distribution division in Louisiana under a long-term contract and, on a more limited basis, to third parties. The demand fee charged to our Louisiana distribution division for these services is subject to regulatory approval by the Louisiana Public Service Commission. We also manage two asset management plans, which have been approved by applicable state regulatory commissions. Generally, these asset management plans require us to share with our distribution customers a significant portion of the cost savings earned from these arrangements.\nOur pipeline and storage segment is impacted by seasonal weather patterns, competitive factors in the energy industry, and economic conditions in our Texas and Louisiana service areas. Natural gas prices do not directly impact the results of this segment as revenues are derived from the transportation and storage of natural gas. However, natural gas prices and demand for natural gas could influence the level of drilling activity in the supply areas that we serve, which may influence the level of throughput we may be able to transport on our pipelines. Further, natural gas price differences between the various hubs that we serve in Texas could influence the volumes of gas transported for shippers through our Texas pipeline system and rates for such transportation.\nThe results of APT are also significantly impacted by the natural gas requirements of its local distribution company customers. Additionally, its operations may be impacted by the timing of when costs and expenses are incurred and when these costs and expenses are recovered through its tariffs.\nAPT annually uses GRIP to recover capital costs incurred in the prior calendar year. On February 26, 2025, APT made a GRIP filing that covered changes in net property, plant and equipment investment from January 1, 2024 through December 31, 2024 with a requested increase in operating income of $77.2 million. On June 17, 2025, the Texas Railroad Commission (RRC) approved the Company's GRIP filing.\nThe demand fee our Louisiana natural gas transmission pipeline charges to our Louisiana distribution division increases five percent annually and has been approved by the Louisiana Public Service Commission until September 30, 2027.\nReview of Financial and Operating Results\nFinancial and operational highlights for our pipeline and storage segment for the fiscal years ended September 30, 2025, 2024, and 2023 are presented below.\n\n(In thousands, unless otherwise noted)\nMid-Tex / Affiliate transportation revenue\nThird-party transportation revenue\nTotal operating revenues\nTotal purchased gas cost\nOther non-operating income\nIncome before income taxes\nGross pipeline transportation volumes — MMcf\nConsolidated pipeline transportation volumes — MMcf\nFiscal year ended September 30, 2025 compared with fiscal year ended September 30, 2024\nOperating income for our pipelin",
  "item2_clean": null
}