{
  "source_file": "avb-20241231.htm",
  "form_type": "10-K",
  "item1_clean": "ITEM 1. BUSINESS\nAvalonBay Communities, Inc. (the \"Company,\" \"we,\" \"our\" and \"us\" which terms, unless the context otherwise requires, refer to AvalonBay Communities, Inc. together with its subsidiaries), is a Maryland corporation that has elected to be treated as a real estate investment trust (\"REIT\") for federal income tax purposes. We develop, redevelop, acquire, own and operate apartment communities in New England, the New York/New Jersey metro area, the Mid-Atlantic, the Pacific Northwest, and Northern and Southern California, as well as in our expansion regions of Raleigh-Durham and Charlotte, North Carolina, Southeast Florida, Dallas and Austin, Texas, and Denver, Colorado. We focus on leading metropolitan areas that we believe are generally characterized by growing employment in high wage sectors of the economy, higher cost of home ownership and a diverse and vibrant quality of life. We believe these market characteristics have offered, and will continue to offer, the opportunity for superior risk-adjusted returns over the long-term on apartment community investments relative to other markets that do not have these characteristics.\nAt January 31, 2025, we owned or held a direct or indirect ownership interest in:\n284 operating apartment communities containing 86,111 apartment homes in 11 states and the District of Columbia, of which 275 communities containing 83,389 apartment homes were consolidated for financial reporting purposes and nine communities containing 2,722 apartment homes were held by unconsolidated entities in which we hold an ownership interest.\n21 wholly-owned development apartment communities that are under construction or completed and in lease-up and are expected to contain an aggregate of 7,305 apartment homes when completed.\nRights to develop an additional 30 communities that, if developed as expected, will contain 9,336 apartment homes.\nWe generally obtain ownership in an apartment community by developing a new community on either vacant land or land with improvements that we raze, or by acquiring an existing community. In selecting sites for development or acquisition, we favor locations that are near expanding employment centers and convenient to transportation, recreation areas, entertainment, shopping and dining.\nOur principal financial goal is to increase long-term shareholder value through the development, redevelopment, acquisition, ownership, operation and asset management and, when appropriate, disposition of apartment communities in our markets. To help meet this goal, we regularly (i) monitor our investment allocation by geographic market and product type, (ii) develop, redevelop and acquire interests in apartment communities in our selected markets, (iii) efficiently operate our communities to maximize resident satisfaction and shareholder return, (iv) selectively sell apartment communities that no longer meet our long-term strategy or when opportunities are presented to realize a portion of the value created through our investment and redeploy the proceeds from those sales and (v) maintain a capital structure that we believe is aligned with our business risks and allows us to maintain continuous access to cost-effective capital. We also seek to generate additional shareholder value from investments in other real estate-related ventures, including through our Structured Investment Program (\"SIP\"), our platform to provide mezzanine loans or preferred equity to third-party multifamily developers in our existing regions. We undertake our development and redevelopment activities primarily through in-house development and redevelopment teams, and buy and dispose of assets through our in-house investments platform. We believe that our organizational structure, which includes dedicated development and operational teams, and strong culture are key differentiators. We pursue our development, redevelopment, investment and operating activities with the purpose of \"Creating a Better Way to Live.\"\nWe seek to be the leading rental housing company in select U.S. markets by delivering distinctive experiences that customers value, creating a workplace where associates thrive, and achieving superior results for shareholders. We focus on markets that are characterized by growing employment in high wage sectors of the economy, higher home prices and a diverse and vibrant quality of life. From an operating perspective, we seek to deliver seamless, personalized experiences for our residents on an efficient and effective basis by our resident-focused on-site associates that are supported by our centralized shared services operating organization and flexible technology platform that incorporates automation and artificial intelligence. We operate our apartment communities under four core brands:\nAvalon, our core \"Avalon\" brand, focuses on upscale apartment living and high end amenities and services;\nAVA targets customers in high energy, transit-served neighborhoods and generally feature smaller apartments, many of which are designed for roommate living, and a variety of active common spaces that encourage socialization;\neaves by Avalon is targeted to the cost conscious, \"value\" segment primarily in suburban areas; and\nKanso is designed to create an apartment living experience that offers simplicity without sacrifice at a more moderate price point, featuring high-quality apartment homes, limited-to-no community amenities and a low-touch, largely self- service operating model that leverages technology and smart access.\nWe believe that this branding differentiation allows us to target our product offerings to multiple customer groups and submarkets within our existing geographic footprint.\nDuring the three years ended December 31, 2024, we:\nacquired 13 apartment communities, excluding unconsolidated investments;\ndisposed of 21 apartment communities, excluding unconsolidated investments;\nrealized our pro rata share of the gain from the sale of three communities owned by unconsolidated real estate entities; and\ncompleted the development of 22 apartment communities, including unconsolidated investments, and the redevelopment of two apartment communities.\nA more detailed description of our unconsolidated real estate entities and the related investment activity can be found in Note 5, \"Investments,\" of the Consolidated Financial Statements in Item 8 of this report and in Item 7. \"Management's Discussion and Analysis of Financial Condition and Results of Operations.\"\nA further discussion of our development, redevelopment, disposition, acquisition, operating and property management and related strategies follows.\nDevelopment Strategy.\nWe select land for development and follow established procedures that we believe minimize both the cost and the risks of development. As one of the largest developers of multifamily rental apartment communities in our selected markets, we maintain regional offices to identify and support development opportunities through local market presence and access to local market information. In addition to our principal executive office in Arlington, Virginia, we also have regional offices, administrative offices or specialty offices, including offices that are in or near the following cities:\nBellevue, Washington;\nBoston, Massachusetts;\nDurham, North Carolina;\nFort Lauderdale, Florida;\nLos Angeles, California;\nSan Francisco, California;\nSan Jose, California;\nVirginia Beach, Virginia; and\nWestfield, New Jersey.\nAfter selecting a site for development, we usually negotiate for the right to acquire the site either through an option or a long-term conditional contract. Options and long-term conditional contracts generally allow us to acquire an interest in the site after the completion of entitlements and shortly before the start of construction, which reduces development-related risks and preserves capital. However, as a result of competitive market conditions for land suitable for development, we have sometimes acquired and held land prior to construction for extended periods while entitlements are obtained. When acquiring improved land with existing commercial uses prior to development, any rent received in excess of expenses from these operations, which we consider to be incidental, is accounted for as a reduction in our investment in the development pursuit and not as net income. Any expenses relating to these operations, in excess of any rents received, are recognized in net income. In addition, we have previously identified, and may again in the future identify, opportunities to increase value by expanding the density of certain existing operating communities. We have also participated, and may in the future participate, in master planned or other large multi-use developments where we commit to build infrastructure (such as roads) to be used by other participants or commit to act as construction manager or general contractor in building structures or spaces for third parties (such as unimproved ground floor commercial space, municipal garages or parks). Costs we incur in connection with these activities may be accounted for as additional invested capital in the community or we may earn fee income for providing these services. Particularly with large scale, urban in-fill developments, we may engage in significant environmental remediation efforts to prepare a site for construction. For further discussion of our Development Rights, refer to Item 2. \"Properties\" in this report.\nWe generally act as our own development manager, general contractor and construction manager directly (although we may use a wholly-owned subsidiary), and will elect to use a third-party developer or general contractor where we believe it is beneficial to do so, such as in our expansion regions where we may have limited resources or scale. We believe direct involvement in construction enables us to achieve higher construction quality, greater control over construction schedules and cost savings. Our development, property management and construction teams monitor construction progress to ensure quality workmanship and a smooth and timely transition into the leasing and operating phase.\nThroughout this report, the term \"development\" is used to refer to the entire property development cycle, including pursuit of zoning approvals, procurement of architectural and engineering designs and the construction process. References to \"construction\" refer to the actual construction of the property, which is only one element of the development cycle.\nRedevelopment Strategy.\nWhen we undertake the redevelopment of a community, our goal is to renovate and/or rebuild an existing community so that our total investment is generally below replacement cost and the community is well positioned in the market to achieve attractive returns on our capital. In addition to large scale redevelopment where a community is classified as a redevelopment, we undertake smaller scale redevelopment activities related to the apartment interiors to enhance the resident experience at our operating communities. We have dedicated redevelopment teams and procedures that are intended to control both the cost and risks of redevelopment. Our redevelopment teams, which include redevelopment, construction and property management personnel, monitor redevelopment progress.\nThroughout this report, the term \"redevelopment\" is used to refer to the entire redevelopment cycle, including planning and procurement of architectural and engineering designs, budgeting and actual renovation work. The actual renovation work is referred to as \"reconstruction,\" which is only one element of the redevelopment cycle.\nDisposition Strategy.\nWe sell assets that no longer meet our long-term strategy or when real estate market conditions are favorable, and we redeploy the proceeds from those sales to develop, redevelop and acquire communities and to rebalance our portfolio across or within geographic regions. This also allows us to realize a ",
  "item7_clean": "Balance Outstanding (2)\nScheduled Maturities\neaves Woodland Hills\nAvalon San Bruno III\nTotal indebtedness - excluding Credit Facility and Commercial Paper\n_________________________________\nRates are as of December 31, 2024 and include credit enhancement fees, facility fees, trustees' fees, the impact of interest rate hedges, offering costs, mark to market amortization and other fees.\nBalances outstanding represent total amounts due at maturity, and exclude deferred financing costs and debt discount for the unsecured notes of $41,216 and $43,848 as of December 31, 2024 and 2023, respectively, deferred financing costs and debt discount associated with secured notes of $15,964 and $18,372 as of December 31, 2024 and 2023, respectively, as reflected on our Consolidated Balance Sheets included elsewhere in this report.\nFinanced by variable rate debt, but interest rate is capped through an interest rate protection agreement.\nDuring 2024, we repaid this borrowing at par at its scheduled maturity date.\nIn addition to consolidated debt, we have scheduled contractual obligations associated with (i) ground leases for land underlying current operating or development communities and commercial and parking facilities and (ii) office leases for our corporate headquarters and regional offices of $16,433,000 for 2025, $16,843,000 for 2026 and $486,656,000 thereafter.\nFuture Financing and Capital Needs—Portfolio and Capital Markets Activity\nWe invest in various real estate and real estate related investments, which include (i) the acquisition, development and redevelopment of communities both wholly-owned and through the formation of joint ventures, (ii) other indirect investments in real estate through the SIP, all as discussed further below and (iii) investments in other real estate-related ventures through direct and indirect investments in property technology and environmentally focused companies and investment management funds.\nIn 2025, we expect to continue to meet our liquidity needs from one or more of a variety of internal and external sources, which may include (i) settlement of our outstanding equity forward contracts, (ii) real estate dispositions, (iii) cash balances on hand as well as cash generated from our operating activities, (iv) borrowing capacity under the Credit Facility, (v) borrowings under the Commercial Paper Program and (vi) secured and unsecured debt financings. Additional sources of liquidity in 2025 may include the issuance of common and preferred equity, including the issuance of additional shares of our common stock under the CEP. Our ability to obtain additional financing will depend on a variety of factors, such as market conditions, the general availability of credit, the overall availability of credit to the real estate industry, our credit ratings and credit capacity, as well as the perception of lenders regarding our long or short-term financial prospects.\nBefore beginning new construction or reconstruction activity, including activity related to communities owned by unconsolidated joint ventures, we plan to source sufficient capital to complete these undertakings, although we cannot assure you that we will be able to obtain such financing. In the event that financing cannot be obtained, we may abandon Development Rights, write off associated pre-development costs that were capitalized and/or forego reconstruction activity. In such instances, we will not realize the increased revenues and earnings that we expected from such Development Rights or reconstruction activity and significant losses could be incurred.\nFrom time to time, we use joint ventures to hold or develop individual real estate assets. We generally employ joint ventures to mitigate asset concentration or market risk and secondarily as a source of liquidity. We may also use joint ventures related to mixed-use land development opportunities and new markets where our partners bring development and operational expertise and/or experience to the venture. Each joint venture or partnership agreement has been individually negotiated, and our ability to operate and/or dispose of a community in our sole discretion may be limited to varying degrees depending on the terms of the joint venture or partnership agreement. We cannot assure you that we will achieve our objectives through joint ventures.\nIn addition, we may invest, through mezzanine loans or preferred equity investments, in multifamily development projects being undertaken by third parties. In these cases, we do not expect to acquire the underlying real estate but rather to earn a return on our investment (through interest or fixed rate preferred equity returns) and a return of the invested capital generally following completion of construction either on or before a set due date.\nIn evaluating our allocation of capital within our markets, we sell assets that do not meet our long-term investment criteria or when capital and real estate markets allow us to realize a portion of the value created over our ownership periods and redeploy the proceeds from those sales to develop, redevelop and acquire communities. Because the proceeds from the sale of communities may not be immediately redeployed into revenue-generating assets that we develop, redevelop or acquire, the immediate effect of a sale of a community for a gain is to increase net income, but reduce future total revenues, total expenses and NOI until such time as the proceeds have been redeployed into revenue generating assets. We believe that the temporary absence of future cash flows from communities sold will not have a material impact on our ability to fund future liquidity and capital resource needs.\nWe invest in consolidated real estate entities, unconsolidated investments in real estate ventures and direct and indirect investments in property technology and environmentally focused companies through investment management funds.\nConsolidated Investments\nDuring the year ended December 31, 2024, we acquired the following communities (dollars in thousands). See Note 5, \"Investments,\" of the Consolidated Financial Statements included elsewhere in this report for further discussion.\nAvalon Perimeter Park\nAvalon Townhomes at Bee Cave\nIn 2025, the Company entered into agreements to acquire a total of eight apartment communities in the Company’s Texas expansion market. The communities contain a total of 2,701 apartment homes and will be acquired for an aggregate purchase price of $618,500,000. The consideration will take the form of cash and DownREIT units as described in Note 12, “Subsequent Events,” of the Consolidated Financial Statements included elsewhere in this report for further discussion.\nDuring the year ended December 31, 2024, we sold eight wholly-owned communities containing an aggregate of 1,532 apartment homes (dollars in thousands). See Note 6, \"Real Estate Disposition Activities,\" of the Consolidated Financial Statements included elsewhere in this report for further discussion.\nCommercial square feet\nQ2 2024\nQ2 2024\nAvalon Hackensack at Riverside\nQ2 2024\nAVA Theater District\nQ3 2024\nQ3 2024\nQ4 2024\nQ4 2024\nQ4 2024\nIn January 2025, the Company sold Avalon Wilton on River Road, located in Wilton, CT, containing 102 apartment homes for $65,100,000. This sale marks the Company's exit from the Connecticut market.\nUnconsolidated Operating Communities\nDuring the year ended December 31, 2024, we had the following investments in and activity for our unconsolidated real estate and property technology and environmentally focused investments. See Note 5, \"Investments,\" of the Consolidated Financial Statements included elsewhere in this report for further discussion.\nArts District Joint Venture was formed to develop, own, and operate AVA Arts District, an apartment community located in Los Angeles, CA, which completed construction in 2024 and contains 475 apartment homes and 57,000 square feet of commercial space when completed. We have a 25% ownership interest in the venture. As of December 31, 2024, excluding costs incurred in excess of equity in the underlying net assets of the venture, we have an equity investment of $29,932,000 in the venture. The venture has drawn $155,968,000 of $167,147,000 maximum borrowing capacity of the construction loan as of December 31, 2024. While we guarantee 30% of the venture's construction loan, any amounts payable under the guarantee are obligations of the venture partners in proportion to their ownership interest.\nWe invested $11,196,000 in various property technology and environmentally focused companies directly and indirectly through investment management funds during the year ended December 31, 2024. As of December 31, 2024, we have invested $58,122,000 and have $62,494,000 of remaining equity commitments to contribute to these investment management funds, with the timing and amount for these commitments to be fulfilled dependent on if, and when, investment opportunities are identified by the respective funds. During the year ended December 31, 2024, we recognized realized and unrealized gains of $33,137,000 related to these investments, included as a component of income from unconsolidated investments on the Consolidated Statements of Comprehensive Income.\nStructured Investment Program\nDuring the year ended December 31, 2024, we did not enter into any additional commitments under the SIP. As of January 31, 2025, we had funded $188,605,000 for seven outstanding commitments having an aggregate funding commitment of $191,585,000 under the SIP. As of January 31, 2025, our investment commitments had a weighted average rate of return of 11.5% and a weighted average initial maturity date of December 2026. See Note 5, \"Investments,\" of the Consolidated Financial Statements included elsewhere in this report.\nForward-Looking Statements\ndevelopment, redevelopment, acquisition or disposition of communities;\nthe timing and cost of completion of communities under development or redevelopment;\nthe timing of lease-up, occupancy and stabilization of communities;\nthe pursuit of land for future development;\nthe anticipated operating performance of our communities;\ncost, yield, revenue, NOI and earnings estimates;\nthe impact of landlord-tenant laws and rent regulations, including rent caps;\nour expansion into new regions;\nour declaration or payment of dividends;\nour joint venture activities;\nour policies regarding investments, indebtedness, acquisitions, dispositions, financings and other matters;\nour qualification as a REIT under the Code;\nthe real estate markets in regions where we operate and in general;\nthe availability of debt and equity financing;\ninflation, tariffs and other economic conditions, and their potential impacts;\ntrends affecting our financial condition or results of operations;\nregulatory changes that may affect us; and\nthe impact of legal proceedings.\nSome of the factors that could cause our actual results, performance or achievements to differ materially from those expressed or implied by these forward-looking statements include, but are not limited to, the following:\nwe may fail to secure development opportunities due to an inability to reach agreements with third parties to obtain land at attractive prices or to obtain desired zoning and other local approvals;\nwe may abandon or defer development opportunities for a number of reasons, including changes in local market conditions which make development less desirable, increases in costs of development, increases in the cost of capital or lack of capital availability, resulting in losses;\nconstruction costs of a community may exceed original estimates;\nwe may not complete construction and lease-up of communities under development or redevelopment on schedule, resulting in increased interest costs and construction costs and a decrease in expected rental revenues;\noccupancy rates and market rents may be adversely affected by competition and local economic and market conditions which are beyond our control;\nour cash flows from operations and access to cost-effective capital may be insufficient for the development of our pipeline, which could limit our pursuit of opportunities;\nan outbreak of disease or other public health event may affect the multifamily industry and general economy;\nour cash flows may be insufficient to meet required payments of principal and interest, and we may be unable to refinance existing indebtedness or the terms of such refinancing may not be as favorable as the terms of existing indebtedness;\nwe may be unsuccessful in our management of joint ventures and the REIT vehicles that are used with certain joint ventures;\nwe may experience a casualty loss, natural disaster or severe weather event, including those caused by climate change;\nnew or existing laws and regulations implementing rent control or rent stabilization, or otherwise limiting our ability to increase rents, charge fees or evict tenants, may impact our revenue or increase our costs;\nour expectations, estimates and assumptions as of the date of this filing regarding legal proceedings are subject to change;\nthe possibility that we may choose to pay dividends in our stock instead of cash, which may result in stockholders having to pay taxes with respect to such dividends in excess of the cash received, if any; and\ninvestments made under the SIP may not be repaid as expected or the development may not be completed on schedule, which could require us to engage in litigation, foreclosure actions, and/or first party project completion to recover our investment, which may not be recovered in full or at all in such event.\nCritical Accounting Policies and Estimates\nThe preparation of financial statements in conformity with GAAP requires management to use judgment in the application of accounting policies, including making estimates and assumptions. If our judgment or interpretation of the facts and circumstances relating to various transactions had been different, or different assumptions were made, it is possible that different accounting policies would have been applied, resulting in different financial results or a different presentation of our financial statements. Below is a discussion of the accounting policies that we consider critical to an understanding of our financial condition and operating results that may require complex or significant judgment in their application or require estimates about matters which are inherently uncertain. A discussion of our significant accounting policies, including further discussion of the accounting policies described below, can be found in Note 1, \"Organization, Basis of Presentation and Significant Accounting Policies,\" of our Consolidated Financial Statements.\nWe capitalize costs during the development of assets. Capitalization begins when we determine that development of a future asset is probable and continues until the asset, or a portion of the asset, is delivered and is ready for its intended use. For redevelopment efforts, we capitalize costs either (i) in advance of taking apartment homes out of service when significant renovation of the common area has begun and continue until the redevelopment is completed, or (ii) when an apartment home is taken out of service for redevelopment and continue until the redevelopment is completed and the apartment home is available for a new resident. Rental income and operating expenses incurred during the initial lease-up or post-redevelopment lease-up period are fully recognized in earnings as they accrue.\nDuring the development and redevelopment efforts we capitalize all direct costs and indirect costs which have been incurred as a result of the development and redevelopment activities. These costs include interest and related loan fees, property taxes as well as other direct and indirect costs. Interest is capitalized for any project-specific financing, as well as for general corporate financing to the extent of our aggregate investment in the projec",
  "item2_clean": null
}