{
  "source_file": "avb-20250930.htm",
  "form_type": "10-Q",
  "item1_clean": null,
  "item7_clean": null,
  "item2_clean": "ITEM 2. MANAGEMENT'S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS\nBusiness Description\nAvalonBay Communities, Inc. (the “Company,” “we,” “our” and “us” which terms, unless the context otherwise requires, refer to AvalonBay Communities, Inc. together with its subsidiaries), is a Maryland corporation that has elected to be treated as a real estate investment trust (“REIT”) for federal income tax purposes. We develop, redevelop, acquire, own and operate apartment communities in New England, the New York/New Jersey metro area, the Mid-Atlantic, the Pacific Northwest, and Northern and Southern California, as well as in our expansion regions of Raleigh-Durham and Charlotte, North Carolina, Southeast Florida, Dallas and Austin, Texas, and Denver, Colorado. We focus on leading metropolitan areas that we believe are generally characterized by growing employment in high wage sectors of the economy, higher cost of home ownership and a diverse and vibrant quality of life. We believe these market characteristics have offered, and will continue to offer, the opportunity for superior risk-adjusted returns over the long-term on apartment community investments relative to other markets that do not have these characteristics.\nOur principal financial goal is to increase long-term shareholder value through the development, redevelopment, acquisition, ownership, operation and asset management and, when appropriate, disposition of apartment communities in our markets. To help meet this goal, we regularly (i) monitor our investment allocation by geographic market and product type, (ii) develop, redevelop and acquire interests in apartment communities in our selected markets, (iii) efficiently operate our communities to maximize resident satisfaction and shareholder return, (iv) selectively sell apartment communities that no longer meet our long term strategy or when opportunities are presented to realize a portion of the value created through our investment and redeploy the proceeds from those sales and (v) maintain a capital structure that we believe is aligned with our business risks and allows us to maintain continuous access to cost-effective capital. We pursue our development, redevelopment, investment and operating activities with the purpose of “Creating a Better Way to Live.”\nThird Quarter 2025 Operating Highlights\nNet income attributable to common stockholders for the three months ended September 30, 2025 was $381,306,000, an increase of $8,787,000, or 2.4%, from the prior year period. The increase was primarily attributable to a net increase in unrealized gains on property technology investments, an increase in NOI from communities over the prior year period, and increases in real estate sales and related gains.\nSame Store NOI attributable to our apartment rental operations, including parking and other ancillary residential (\"Residential\") revenue, for the three months ended September 30, 2025 was $461,048,000, an increase of $5,189,000, or 1.1%, over the prior year period. The increase over the prior year period was due to an increase in Residential revenue of $15,100,000, or 2.3%, partially offset by an increase in Residential property operating expenses of $9,911,000, or 4.6%.\nThird Quarter 2025 Development Highlights\nAt September 30, 2025, we owned or held a direct or indirect interest in:\n21 wholly-owned communities under construction, which are expected to contain 7,806 apartment homes with a projected total capitalized cost of $3,012,000,000.\nLand or rights to land on which we expect to develop an additional 34 apartment communities that, if developed as expected, will contain 9,381 apartment homes.\nThird Quarter 2025 Real Estate Transactions Highlights\nDuring the three months ended September 30, 2025, we had the following activity:\nWe acquired three wholly-owned communities containing 584 apartment homes for an aggregate purchase price of $186,950,000.\nWe acquired our joint venture partner's 50% interest in Avalon Alderwood Place, a 328 apartment home community in Lynnwood, WA, for a purchase price of $71,250,000. With the buyout of the joint venture partner's interest, Avalon Alderwood Place is now a wholly owned apartment community and consolidated for financial reporting purposes.\nWe sold six wholly-owned communities containing 1,594 apartment homes and 20,000 square feet of commercial space, for $585,080,000, for a gain in accordance with GAAP of $180,537,000.\nIn addition, in October 2025, we acquired Avalon Townhome Collection Brier Creek, located in Durham, NC, containing 93 townhomes for a purchase price of $36,500,000.\nCommunities Overview\nOur real estate investments consist primarily of current operating apartment communities (\"Current Communities\"), consolidated and unconsolidated communities in various stages of development (\"Development\" communities and \"Unconsolidated Development\" communities) and Development Rights (as defined below). Our Current Communities are further classified as Same Store communities, Other Stabilized communities, Redevelopment communities and Unconsolidated communities. While we generally establish the classification of communities on an annual basis, we update the classification of communities during the calendar year to the extent that our plans with regard to the disposition or redevelopment of a community change, or if something occurs that materially impacts the operations of a community such as a casualty loss. The following is a description of each category:\nare categorized as Same Store, Other Stabilized, Redevelopment, or Unconsolidated according to the following attributes:\nis composed of consolidated communities where a comparison of operating results from the prior year to the current year is meaningful as these communities were owned and had stabilized occupancy as of the beginning of the prior year period. For the nine month periods ended September 30, 2025 and 2024, Same Store communities are consolidated for financial reporting purposes, had stabilized occupancy as of January 1, 2024, are not conducting or are not probable to conduct substantial redevelopment activities and are not held for sale as of September 30, 2025 or probable for disposition to unrelated third parties within the current year. A community is considered to have stabilized occupancy at the earlier of (i) attainment of 90% physical occupancy or (ii) the one-year anniversary of completion of development or redevelopment.\nis composed of completed consolidated communities that we own and that are not Same Store but which have stabilized occupancy, as defined above, as of January 1, 2025, or which were acquired subsequent to January 1, 2024. Other Stabilized excludes communities that are conducting or are probable to conduct substantial redevelopment activities within the current year, as defined below.\nis composed of consolidated communities where substantial redevelopment occurred, is in progress, or is probable to begin during the fiscal year. Redevelopment is considered substantial when (i) capital invested is expected to exceed the lesser of $5,000,000 or 10% of the community's pre-redevelopment basis and (ii) physical occupancy is below or is expected to be below 90% during, or as a result of, the redevelopment activity.\nis composed of communities that we have an indirect ownership interest in through our investment interest in an unconsolidated joint venture.\nis composed of consolidated communities that are either currently under construction, were under construction and were completed during the current year or where construction has been complete for less than one year and that do not have stabilized occupancy. These communities may be partially or fully complete and operating.\nUnconsolidated Development\nis composed of communities that are either currently under construction, or were under construction and were completed during the current year, in which we have an indirect ownership interest through our investment interest in an unconsolidated joint venture. These communities may be partially or fully complete and operating.\nare development opportunities in the early phase of the development process where we either have an option to acquire land or enter into a leasehold interest, where we are the buyer under a long-term conditional contract to purchase land, where we control the land through a ground lease or own land to develop a new community, or where we are the designated developer in a public-private partnership. We capitalize related pre-development costs incurred in pursuit of new developments for which we currently believe future development is probable.\nWe currently lease our corporate headquarters located in Arlington, Virginia, as well as our other regional and administrative offices, under operating leases.\nAs of September 30, 2025, communities that we owned or held a direct or indirect interest in were classified as follows:\n\n_________________________\nRates are as of September 30, 2025 and include credit enhancement fees, facility fees, trustees' fees, the impact of interest rate hedges, offering costs, mark-to-market amortization and other fees.\nBalances outstanding represent total amounts due at maturity, and exclude deferred financing costs and debt discount for the unsecured notes of $44,287 and $41,216 as of September 30, 2025 and December 31, 2024, respectively, and deferred financing costs and debt discount for the secured notes of $14,182 and $15,964 as of September 30, 2025 and December 31, 2024, respectively, as reflected on our Condensed Consolidated Balance Sheets included elsewhere in this report.\nFinanced by variable rate debt, but interest rate is capped through an interest rate protection agreement.\nIn June 2025, we repaid this borrowing at par on its scheduled maturity date.\nThe variable rate Term Loan has been swapped to an effective fixed rate using interest rate swaps.\nFuture Financing and Capital Needs — Portfolio and Capita"
}