{
  "source_file": "avgo-20241103.htm",
  "form_type": "10-K",
  "item1_clean": "combines application, infrastructure and network monitoring and correlation with intelligent remediation capabilities to help customers create more resilient production environments and improve customer experience.\nEnterprise Security Portfolio.\nOur Enterprise Security solutions help organizations and governments secure against threats and compliance risks by protecting their users and data on any app, device, or network. Our integrated cyber defense approach simplifies cybersecurity with comprehensive solutions designed to secure critical business assets across on-premises and cloud infrastructures. Enterprise Security solutions utilize rich threat intelligence from a global network of security engineers, threat analyst and researchers, as well as advanced AI and machine learning engines, enabling customers to protect data, connect authorized users with trusted applications, and detect and respond to the most advanced targeted attacks.\nEndpoints are the critical last line of defense against cyber attackers. Our Symantec and Carbon Black endpoint security solutions prevent, detect and respond to emerging threats across all devices and operating systems including laptops, desktops, tablets, mobile phones, servers and cloud workloads through an AI driven security console and single agent.\nEmail and web access are the lifeblood and essential communication means for every modern organization. We have a full array of network security solutions, as well as a shared set of advanced threat protection technologies to stop inbound and outbound threats targeting end users, information and key infrastructure.\nInformation Security:\nInformation protection and compliance is critical to managing risk. We offer integrated information security solutions, based on an efficient, single-policy that can be applied across the entire environment, to help organizations identify and protect risky users, applications and their most sensitive data everywhere across endpoints, on-premises networks, cloud services and private applications.\nApplication Security:\nApplications are increasingly targeted by cyber attackers. Our solutions secure critical systems, prevent unwanted changes, and ensure continuous compliance with regulatory mandates. Carbon Black solutions employ a positive security model that secures often overlooked use cases such as end-of-life operating systems, critical systems, fixed function devices, and air-gapped systems.\nUser identities are under attack by cyber criminals hoping to exploit their access and privileges and do harm. Our solution mitigates these attacks by positively identifying legitimate users, enforcing granular access control policies, and streamlining access governance to prevent unauthorized access to sensitive resources and data.\nWe also offer mission-critical FC SAN products designed to help customers reduce the cost and complexity of managing business information within a shared data storage environment, enabling high levels of availability of mission-critical applications in the form of modules, switches and subsystems incorporating multiple semiconductor products. We deliver reliable and simplified management of these FC SAN products through our software-based management tools designed to maximize uptime, dramatically simplify storage area networking deployment and management, and provide high levels of visibility and insight into the storage network. Our Brocade Fibre Channel switch products provide interconnection, bandwidth and high-speed switching between servers and storage devices which are in a FC SAN.\nPayment Security Portfolio.\nOur payment security suite is a software as a service (“SaaS”)-based payment authentication service to help banks and merchants protect against fraud and ensure a hassle-free online shopping experience for their customers.\nResearch and Development\nWe are committed to continuous investment in product development and enhancement, with a focus on rapidly introducing new, proprietary products and releases. Many of our products have grown out of our own research and development efforts, and have given us competitive advantages in certain target markets due to performance differentiation. However, we opportunistically seek to enhance our capabilities through the acquisition of engineers with complementary research and development skills and complementary technologies and businesses. We focus our research and development efforts on the development of mission-critical, innovative, sustainable and higher value product platforms and those that improve the quality and stability in our broadly deployed products. We leverage our design capabilities in markets where we believe our innovation and reputation will allow us to earn attractive margins by developing high value-add products.\nWe plan to continue investing in product development, both organically and through acquisitions, to drive growth in our business. We also invest in process development and improvements to product features and functions, as well as fabrication capabilities to optimize processes for devices that are manufactured internally. Our field application engineers, design engineers, and product and software development engineers are located in many places around the world, and in many cases, near our top customers. This enhances our customer reach and our visibility into new product opportunities and, in the case of our semiconductor customers, enables us to support our customers in each stage of their product development cycle, from the early stages of production design to volume manufacturing and future growth. By collaborating with our customers, we have opportunities to develop high value-added, customized products for them that leverage our existing technologies. We anticipate that we will continue to make significant research and development investments in order to maintain our competitive position, and to ensure a continuous flow of innovative and sustainable product platforms.\nCustomers, Sales and Distribution\nWe sell our products through our direct sales force and a select network of distributors and channel partners globally. Distributors and OEMs, or their contract manufacturers, typically account for the substantial majority of our semiconductor sales. A relatively small number of customers account for a significant portion of our net revenue. Sales to distributors accounted for 48% and 57% of our net revenue for fiscal years 2024 and 2023, respectively. We believe aggregate sales to our top five end customers, through all channels, accounted for approximately 40% and 35% of our net revenue for fiscal years 2024 and 2023, respectively. We expect to continue to experience significant customer concentration in future periods. The loss of, or significant decrease in demand from, any of our top five end customers could have a material adverse effect on our business, results of operations and financial condition.\nMany of our semiconductor customers design products in North America or Europe that are then manufactured in Asia. To serve customers around the world, we have strategically developed relationships with large global electronic component distributors, complemented by a number of regional distributors with customer relationships based on their respective product ranges. We also sell our products to a wide variety of OEMs or their contract manufacturers. We have established strong relationships with leading OEM customers across multiple target markets. Our direct sales force focuses on supporting our large OEM customers, and has specialized product and service knowledge that enables us to sell specific offerings at key levels throughout a customer’s organization. Certain customers require us to contract with them directly and with specified intermediaries, such as contract manufacturers. Many of our major customer relationships have been in place for many years and are often the result of years of collaborative product development. This has enabled us to build our extensive IP portfolio and develop critical expertise regarding our customers’ requirements, including substantial system-level knowledge. This collaboration has provided us with key insights into our customers' businesses and has enabled us to be more efficient and productive and to better serve our target markets and customers. Many of our customers and their contract manufacturers often require time critical delivery of our products to multiple locations around the world. With sales offices located in various countries, our primary warehouse in Malaysia, and dedicated regional customer support call centers, where we address customer issues and handle logistics and other order fulfillment requirements, we believe we are well-positioned to support our customers throughout the design, technology transfer and manufacturing stages across all geographies.\nOur software customers generally consist of large enterprises that have computing environments from multiple vendors and are in most major industries worldwide, including banks, insurance companies, other financial services providers, government agencies, global IT service providers, telecommunication providers, transportation companies, manufacturers, technology companies, retailers, educational organizations and health care institutions. Our private cloud infrastructure suite of solutions are available directly from Broadcom, resellers and distributors, hyperscale cloud providers, value-added OEMs and VMware cloud service provider partners. VCF provides license portability, which enables customers to purchase subscriptions of VCF software and move their VCF environments between on-premises data centers and supported cloud endpoints. We remain focused on strengthening relationships and increasing penetration within our existing core, mainframe, VMware, and Symantec endpoint customers and expanding the adoption of our enterprise software offerings with these customers. We believe our enterprise-wide license model will continue to offer our customers reduced complexity, more flexibility and an easier renewal process that will help drive revenue growth.\nWe focus on maintaining an efficient global supply chain and a variable, low-cost operating model. Accordingly, we outsource a majority of our manufacturing operations, utilizing third-party foundry and assembly and test capabilities, as well as some of our corporate infrastructure functions. The majority of our front-end wafer manufacturing operations is outsourced to external foundries, including Taiwan Semiconductor Manufacturing Company Limited (“TSMC”). We use third-party contract manufacturers for a significant majority of our assembly and test operations, including TSMC, Advanced Semiconductor Engineering, Inc., Foxconn Technology Group, Amkor Technology, Inc. and Siliconware Precision Industries Co., Ltd. We use our internal fabrication facilities for products utilizing our innovative and proprietary processes, such as our FBAR filters for wireless communications and our vertical-cavity surface emitting laser and side emitting lasers based on GaAs and InP lasers for fiber optic communications, while outsourcing commodity processes such as standard CMOS. By doing so, we can protect our IP and accelerate time to market for our products. The majority of our internal III-V semiconductor wafer fabrication is done in the U.S. and Singapore.\nWe purchase materials from hundreds of suppliers on a global basis. These purchases are generally on a purchase order basis and some parts are not readily available from alternate suppliers due to their unique design or the length of time and cost necessary for re-design or qualification. To address the potential disruption in our supply chain, we may use a number of techniques, including redesigning products for alternative components, making incremental or “lifetime” purchases, or qualifying more than one source of supply. Our long-term relationships with our sup",
  "item7_clean": "ITEM 7. MANAGEMENT’S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS\nWe are a global technology leader that designs, develops and supplies a broad range of semiconductor and infrastructure software solutions. We develop semiconductor devices with a focus on complex digital and mixed signal complementary metal oxide semiconductor based devices and analog III-V based products. We offer thousands of products that are used in end products such as enterprise and data center networking, including artificial intelligence (“AI”) networking and connectivity, home connectivity, set-top boxes, broadband access, telecommunication equipment, smartphones and base stations, data center servers and storage systems, factory automation, power generation and alternative energy systems, and electronic displays. Our infrastructure software solutions help enterprises simplify their information technology environments so they can increase business velocity and flexibility, and enable customers to plan, develop, deliver, automate, manage and secure applications across mainframe, distributed, edge, mobile, and private and hybrid cloud platforms. Our portfolio of infrastructure and security software is designed to modernize, optimize, and secure the most complex private and hybrid cloud environments, enabling scalability, agility, automation, insights, resiliency and security making it easy for customers to run their mission-critical workloads. We also offer mission-critical fibre channel storage area networking (“FC SAN”) products and related software in the form of modules, switches and subsystems incorporating multiple semiconductor products.\nWe have two reportable segments: semiconductor solutions and infrastructure software. Our semiconductor solutions segment includes all of our product lines and intellectual property (“IP”) licensing. Our infrastructure software segment includes our private and hybrid cloud, application development and delivery, software-defined edge, application networking and security, mainframe, distributed and cybersecurity solutions, and our FC SAN business.\nOur fiscal year 2024 was a 53-week fiscal year compared to our fiscal year 2023, which was a 52-week fiscal year. The additional week in the first quarter of fiscal year 2024 resulted in higher net revenue, gross margin dollars, research and development expense, and selling general and administrative expense for fiscal year 2024, compared to the corresponding prior year fiscal period.\nOur strategy is focused on technology leadership and category-leading semiconductor and infrastructure software solutions delivering a comprehensive suite of innovative infrastructure technology products to the world’s leading business and government customers. We seek to achieve this through strategic acquisitions of businesses and technologies, as well as extensive internal research and development, to ensure our products retain their technology market leadership. This strategy results in a robust business model designed to drive diversified and sustainable operating and financial results.\nThe demand for our products has been affected in the past, and is likely to continue to be affected in the future, by various factors, including the following:\ngain or loss of significant customers;\ngeneral economic and market conditions in the industries and markets in which we compete;\nanticipated or actual demand for AI-related products;\nour distributors’ product inventory and end customer demand;\nthe rate at which our present and future customers and end-users adopt our products and technologies in our target markets, including our AI related products, and the rate at which our customers' products that include our technology are accepted in their markets;\nthe shift to cloud-based information technology solutions and services, such as hyperscale computing, which may adversely affect the timing and volume of sales of our products for use in traditional enterprise data centers; and\nthe timing, rescheduling or cancellation of expected customer orders.\nFiscal Year Highlights\nHighlights during fiscal year 2024 include the following:\nOn November 22, 2023, we completed the acquisition of VMware, Inc. (“VMware”), for approximately $30.8 billion in cash and 544 million shares of Broadcom common stock (on a split adjusted basis) with a fair value of $53.4 billion.\nWe generated $19,962 million of cash from operations.\nWe paid $9,814 million in cash dividends.\nWe repurchased $7,176 million of common stock.\nWe completed a ten-for-one forward stock split of our common stock. All share, equity award and per share amounts have been retroactively adjusted to reflect the stock split.\nAcquisitions and Divestitures\nAcquisition of VMware and Divestiture of EUC\nOn November 22, 2023, we acquired VMware in a cash-and-stock transaction (the “VMware Merger”). The VMware stockholders received approximately $30,788 million in cash and 544 million shares of Broadcom common stock with a fair value of $53,398 million. In addition, we assumed all outstanding VMware restricted stock unit (“RSU”) awards and performance stock unit awards held by continuing employees. The assumed awards were converted into RSU awards for shares of Broadcom common stock. All outstanding RSU awards held by non-employee directors and in-the-money VMware stock options were accelerated and converted into the right to receive cash and shares of Broadcom common stock, in equal parts.\nOn July 1, 2024, we sold VMware’s end-user computing (“EUC”) business to KKR & Co. Inc. for cash consideration of\n, after working capital adjustments.\nAcquisition of Seagate’s SoC Operations\nOn April 23, 2024, we acquired certain assets related to the design, development, and manufacture of System-on-Chip (“SoC”) operations of Seagate Technology Holdings plc for\nA majority of our net revenue is derived from sales of a broad range of semiconductor devices that are incorporated into electronic products, as well as from modules, switches and subsystems. Net revenue is also generated from the sale of software solutions that enable our customers to plan, develop, deliver, automate, manage, and secure applications across mainframe, distributed, edge, mobile, and private and hybrid cloud platforms.\nOur overall net revenue, as well as the percentage of total net revenue generated by sales in our semiconductor solutions and infrastructure software segments, have varied from quarter to quarter, due largely to fluctuations in end-market demand, including the effects of seasonality, which are discussed in detail in Part I, Item 1.\nDistributors and original equipment manufacturers (“OEMs”), or their contract manufacturers, typically account for the substantial majority of our semiconductor sales. To serve customers around the world, we have strategically developed relationships with large global electronic component distributors, complemented by a number of regional distributors with customer relationships based on their respective product ranges. We have established strong relationships with leading OEM customers across multiple target markets. Our direct sales force focuses on supporting our large OEM customers and has specialized product and service knowledge that enables us to sell specific offerings at key levels throughout a customer’s organization. Certain customers require us to contract with them directly and with specified intermediaries, such as contract manufacturers. Many of our major customer relationships have been in place for many years and are often the result of years of collaborative product development. This has enabled us to build our extensive IP portfolio and develop critical expertise regarding our customers’ requirements, including substantial system-level knowledge. This collaboration has provided us with key insights into our customers' businesses and has enabled us to be more efficient and productive and to better serve our target markets and customers. We recognize revenue upon the delivery of our products to the distributors, which can cause our quarterly net revenue to fluctuate significantly. Such revenue is reduced for estimated returns and distributor allowances.\nOur software customers generally consist of large enterprises that have computing environments from multiple vendors and are highly complex. Our private cloud infrastructure suite of solutions are available directly from Broadcom, resellers and distributors, hyperscale cloud providers, value-added OEMs and VMware cloud service provider partners. VMware Cloud Foundation (“VCF”) provides license portability, which enables customers to purchase subscriptions of VCF software and move their VCF environments between on-premises data centers and supported cloud endpoints. We remain focused on strengthening relationships and increasing penetration within our existing core, mainframe, VMware, and Symantec endpoint customers and expanding the adoption of our enterprise software offerings with these customers. We believe our enterprise-wide license model will continue to offer our customers reduced complexity, more flexibility and an easier renewal process that will help drive revenue growth.\nCost of products sold.\nCost of products sold consists primarily of the costs for semiconductor wafers and other materials, as well as the costs of assembling and testing those products and materials. Such costs include personnel and overhead related to our manufacturing operations, which include stock-based compensation expense, related occupancy, computer services, equipment costs, manufacturing quality, order fulfillment, warranty adjustments, and inventory adjustments including write-downs for inventory obsolescence.\nAlthough we outsource a significant portion of our manufacturing activities, we do have some proprietary semiconductor fabrication facilities. If we are unable to utilize our owned fabrication facilities at a desired level, the fixed costs associated with these facilities will not be fully absorbed, resulting in higher average unit costs and lower gross margins.\nCost of subscriptions and services.\nCost of subscriptions and services consists of personnel, project costs associated with professional services or support of our subscriptions and services revenue, and allocated facilities costs and other corporate expenses. Personnel costs include stock-based compensation expense.\nTotal cost of revenue also includes amortization of acquisition-related intangible assets and restructuring charges.\nResearch and development.\nResearch and development expense consists primarily of personnel costs for our engineers engaged in the design and development of our products and technologies, including stock-based compensation expense. These expenses also include project material costs, third-party fees paid to consultants, prototype development expense, allocated facilities costs and other corporate expenses and computer services costs related to supporting computer tools used in the engineering and design process.\ngeneral and administrative.\nSelling expense consists primarily of compensation and associated costs for sales and marketing personnel, including stock-based compensation expense, sales commissions paid to our independent sales representatives, advertising costs, trade shows, corporate marketing, promotion, travel related to our sales and marketing operations, related occupancy and equipment costs, and other marketing costs. General and administrative expense consists primarily of compensation and associated costs for executive management, finance, human resources and other administrative personnel, including stock-based compensation expense, outside professional fees, allocated facilities costs, acquisition-related costs, which include direct transaction costs and integration costs, and other corporate expenses.\nAmortization of acquisition-related intangible assets.\nIn connection with our acquisitions, we recognize intangible assets that are amortized over their estimated useful lives. We also recognize goodwill, which is not amortized, and in-process research and development (“IPR&D”), which is initially capitalized as an indefinite-lived intangible asset, in connection with our acquisitions. Upon completion of each underlying project, IPR&D assets are reclassified as amortizable purchased intangible assets and amortized over their estimated useful lives.\nRestructuring and other charges.\nRestructuring and other charges consist primarily of non-recurring charges related to compensation costs associated with employee exit programs, IP litigation, alignment of our global manufacturing operations, rationalization of product development program costs, facility and lease abandonments, fixed asset impairment, IPR&D impairment, and other exit costs, including curtailment of service or supply agreements.\nInterest expense includes coupon interest, commitment fees, accretion of original issue discount, amortization of debt premiums and debt issuance costs, and expenses related to debt modifications or extinguishments.\nOther income (expense), net.\nOther income (expense), net includes interest income, gains and losses on investments, foreign currency remeasurement, and other miscellaneous items.\nProvision for income taxes.\nWe benefit from the tax incentives extended to us in various jurisdictions to encourage investment or employment. Our tax incentives from the Singapore Economic Development Board provide that any qualifying income earned in Singapore is subject to tax incentives or reduced rates of Singapore income tax, subject to our compliance with the conditions specified in these incentives and legislative developments. These Singapore tax incentives are scheduled\nto expire in November 2030. The corporate income tax rate in Singapore that would otherwise apply to us would be 17%. We also have a tax holiday from our qualifying income earned in Malaysia, which is scheduled to expire in 2028.\nEach tax incentive and tax holiday is subject to our compliance with various operating and other conditions. If we cannot, or elect not to, comply with any such operating conditions specified, we could, in some instances, be required to refund previously realized material tax benefits, or if such tax incentive or tax holiday is terminated prior to its expiration absent a new incentive applying, we will lose the related tax benefits earlier than scheduled. We may elect to modify our operational structure and tax strategy, which may not be as beneficial to us as the benefits provided under the present tax concession arrangements. Before taking into consideration the effects of the U.S. Tax Cuts and Jobs Act and other indirect tax impacts, the effect of these tax incentives and tax holiday decreased the provision for income taxes by approximately $2,261 million and $2,104 million for fiscal years 2024 and 2023, respectively.\nOur interpretations and conclusions regarding the tax incentives are not binding on any taxing authority, and if our assumptions about tax and other laws are incorrect, the benefits of the tax incentives may be adversely affected.\nCritical Accounting Estimates\nRevenue recognition.\nWe account for a contract with a customer when both parties have approved the contract and are committed to perform their respective obligations, each party’s rights can be identified, payment terms can be identified, the contract has commercial substance, and it is probable we will collect substantially all of the consideration we are entitled to. Revenue is recognized when, or as, performance obligations are satisfied by transferring control of a promised product or service to a customer. Our products and services can be broadly categorized as sales of products and subscriptions and services.\nWe recognize products revenue from sales to direct customers and distributors when control transfers to the customer. An allowance for distributor credits covering price adjustments is mad",
  "item2_clean": null
}