{
  "source_file": "awk-20241231.htm",
  "form_type": "10-K",
  "item1_clean": "Regulated Businesses\nThe Company’s ability to meet the existing and future water demands of its customers depends on an adequate water supply. Drought, governmental restrictions, overuse of sources of water, the protection of threatened species or habitats, contamination or other factors may limit the availability of ground and surface water. The Company employs a variety of measures in an effort to obtain adequate sources of water supply, both in the short-term and over the long-term. The geographic diversity of the Company’s service areas may mitigate some of the economic effects on the water supply associated with weather extremes the Company might encounter in any particular service territory. For example, in any given summer, some areas may experience drier than average weather, which may reduce the amount of source water available, while other areas the Company serves may experience wetter than average weather.\nThe Company evaluates quality, quantity, growth needs and alternate sources of water supply as well as transmission and distribution capacity to provide water service to its customers. Water supply is seasonal in nature and weather conditions can have a pronounced effect on supply. To support the maintenance of adequate water supplies, the Company uses long-term planning processes and maintains contingency plans to minimize the potential impact on service caused by climate variability and a wide range of weather fluctuations. The Company reviews current climate science and global models related to temperature, precipitation and sea level rise on an ongoing basis. Where actionable forecasts are available, the Company will use this information in its comprehensive planning studies and asset management plans. These studies and plans, which are used by the Company to develop its asset management and system reliability strategies, assess the climate risk and resiliency of the Company’s water and wastewater systems over short-, medium- and long-term time horizons, and include evaluations of the availability of water supplies and system capacity against a number of different factors, projections and estimates.\nIn connection with supply planning for most surface or groundwater sources, the Company employs models to determine safe yields under different rainfall and drought conditions. Surface and ground water levels are routinely monitored in an effort to predict and mitigate supply capacity deficits through demand management and additional supply development. In California, where the state recently experienced a multi-year drought, the Company utilizes multiple water supply options including numerous ground water wells in multiple aquifers as well as various long-term purchase water agreements with regional water suppliers to optimize supplies while seeking resiliency during dry years. An example of the Company’s use of long-term planning intended to ensure an adequate water supply is Cal Am’s development and support of the Monterey Peninsula Water Supply Project (the “Water Supply Project”) in California. The Water Supply Project includes the construction of a desalination plant, to be owned by Cal Am, and the construction of wells that would supply water to the desalination plant. In addition, the Water Supply Project also includes Cal Am’s purchase of water from a groundwater replenishment project (the “GWR Project”) between Monterey One Water (formerly known as the Monterey Regional Water Pollution Control Agency) and the Monterey Peninsula Water Management District (the “MPWMD”), as well as an expanded aquifer storage and recovery program. The Water Supply Project is intended, among other things, to fulfill obligations of Cal Am to eliminate unauthorized diversions from the Carmel River as required under orders of the California State Water Resources Control Board (the “SWRCB”). For more information, see Item 3—Legal Proceedings—Alternative Water Supply in Lieu of Carmel River Diversions and Note 16—Commitments and Contingencies—Contingencies—Alternative Water Supply in Lieu of Carmel River Diversions, in the Notes to the Consolidated Financial Statements.\nWastewater services involve the collection of wastewater from customers’ premises through sewer lines. The wastewater is then transported through a sewer network to a treatment facility, where it is treated to meet required regulatory standards for wastewater before being returned to the environment. The solid waste by-product of the treatment process is disposed of or recycled in accordance with applicable standards and regulations.\nThe Company plans to invest between $40 billion and $42 billion over the next 10 years for capital improvements, including acquisitions, to its Regulated Businesses’ water and wastewater infrastructure, largely for pipe replacement and upgrading aging water and wastewater treatment facilities. The Company is proactively improving its pipe renewal rate from a 250-year replacement cycle in 2009 to an approximate 125-year replacement cycle by 2029, which it anticipates will enable the Company to replace nearly 2,000 miles of mains and collection pipes between 2025 and 2029. In addition, from 2025 to 2029, the Company’s capital investment in treatment plants, storage tanks and other key, above-ground facilities is expected to increase, further seeking to address infrastructure renewal, resiliency, water quality, operational efficiency, technology and innovation, and emerging regulatory compliance needs. The Company continues to invest significantly in resiliency projects to address the impacts of climate and weather variability by hardening its assets.\nRegulation and Rate Making\nThe operations of the Company’s Regulated Businesses are generally subject to regulation by PUCs in the states in which they operate, with the primary responsibility of the PUCs being the promotion of the overall public interest by balancing the interest of customers and utility investors. Specific authority might differ from state to state, but in most states, PUCs review and approve rates charged to customers, accounting treatments, long-term financing applications and cost of capital, operation and maintenance (“O&M”) expenses, capital expenditures, taxes, affiliated transactions and relationships, reorganizations, mergers and acquisitions, and dispositions, along with imposing certain penalties or granting certain incentives. Regulatory policies vary from state to state and can change over time. These policies will affect the timing, as well as the extent, of recovery of expenses and the realized return on invested capital.\nPeriodic changes in customer rates generally occur through the filing of a rate case by the utility with the PUC. The timing of rate case filings is typically determined by either periodic requirements in the regulatory jurisdiction or by the utility’s need to increase its revenue requirement to recover capital investment costs, changes in operating revenues, operating costs or other market conditions. The Company attempts to minimize “regulatory lag,” which is the time between the occurrence of an event that triggers a change in the utility’s revenue requirement and the recognition in rates of that change.\nThe Company’s Regulated Businesses support regulatory practices at the PUCs and state legislatures that mitigate the adverse impact of regulatory lag. Presented in the table below are examples of approved regulatory practices:\nRegulatory Practices\nInfrastructure replacement surcharge mechanisms\nAllows rates to change periodically, outside a general rate case proceeding, to reflect recovery of capital investments made to replace infrastructure necessary to sustain safe and reliable services for the Company’s customers. These mechanisms typically involve periodic filings and reviews to ensure transparency.\nIA, IL, IN, KY, MO, NJ, PA, TN, VA, WV\nA “test year” is a period used for setting rates, and a future test year describes the first 12 months that new rates are proposed to be effective. The use of a future test year allows current or projected revenues, expenses and capital investments to be collected on a more timely basis.\nCA, HI, IA, IL, IN, KY, PA, TN, VA\nA historical test year sets rates using data from a 12-month period that ends prior to a general rate case filing. A hybrid test year allows an update to historical data for “known and measurable” changes that occur subsequent to the historical test year.\nMD, MO, NJ, WV\nUtility plant recovery mechanisms\nAllows recovery of the full return on utility plant costs during the construction period, instead of capitalizing an allowance for funds used during construction (“AFUDC”). In addition, some states allow the utility to seek pre-approval of certain capital projects and associated costs. In this pre-approval process, the PUC may assess the prudency of such projects.\nCA, IL, KY, PA, TN, VA\nAllows changes in certain operating expenses, which may fluctuate based on conditions beyond the utility’s control, to be recovered outside of a general rate case proceeding or deferred until the next general rate case proceeding.\nCA, HI, IL, IN, MD, MO, NJ, PA, TN, VA\nRevenue stability mechanisms\nAdjusts rates periodically to ensure that a utility recovers the revenues authorized in its general rate case, regardless of sales volume, including recognition of declining sales resulting from reduced consumption, while providing an incentive for customers to use water more efficiently. In California, the ratemaking tool provides partial revenue recovery with a focus on promotion of conservation signals in the pricing structure.\nCA, IL\nConsolidated tariffs\nUse of a unified rate structure for water systems owned and operated by a single utility, which may or may not be physically interconnected. The consolidated tariff pricing structure may be used fully or partially in a state, and is generally used to moderate the price impact of periodic fluctuations in local costs, while lowering administrative costs for customers. Pennsylvania and West Virginia also permit a blending of water and wastewater revenue requirements.\nCA, IA, IL, IN, KY, MD, MO, NJ, PA, VA, WV\nA regulator’s willingness to defer recognition of financial impacts when setting rates for utilities.\nThe Company pursues enhancements to these regulatory practices to facilitate efficient recovery of its costs and capital investments and to continue to provide safe, clean, reliable and affordable services to its customers. The ability to seek regulatory treatment using the regulatory practices described above does not guarantee that the PUCs will accept the Company’s proposal in the context of a particular rate case, and these regulatory practices may reduce, but not eliminate, regulatory lag associated with traditional rate making processes. It is also the Company’s strategy to expand the use of these mechanisms in areas where they may not currently apply and enhance certain mechanisms where they already exist.\nAcquisitions and Strategic Growth\nThe U.S. water and wastewater industries include investor-owned systems as well as municipal systems that are owned and operated by local governments or governmental subdivisions. According to the U.S. Environmental Protection Agency (“EPA”), as of 2024, approximately 84% of the water market is served by municipal systems and, as of 2022, approximately 98% of the country’s wastewater systems are government owned. The EPA also estimates, as of 2024, that there are over 50,000 community water systems and, as of 2022, over 17,000 community wastewater systems in the United States, with approximately 80% of the community water systems serving a population of approximately 3,000 or less.\nA fundamental aspect of the Company’s growth strategy is to pursue acquisitions of water and/or wastewater systems in geographic proximity to areas where the Company operates its Regulated Businesses, see Item 7—Management’s Discussion and Analysis of Financial Condition and",
  "item7_clean": "2025 Target Allocation (a)\nPercentage of Plan Assets as of December 31,\nRefer to Note 15—Employee Benefits in the Notes to Consolidated Financial Statements for additional details on the allocations of assets and the trusts which fund the other postretirement benefit plans\nThe investments of the pension and postretirement welfare plan trusts are invested in a number of separately managed accounts, commingled funds and limited partnerships including equities, fixed income securities, guaranteed annuity contracts with insurance companies, real estate funds and real estate investment trusts. The trustee for the Company’s defined benefit pension and postretirement welfare plans uses an independent valuation firm to calculate the fair value of plan assets.\nIn selecting a rate of compensation increase, the Company considers past experience in light of movements in inflation rates. The Company’s rate of compensation increase was 3.51% for 2024, 2023 and 2022.\nIn selecting health care cost trend rates, the Company considers past performance and forecasts of increases in health care costs. As of\nthe Company’s health care cost trend rate assumption used to calculate the periodic benefit cost was 6.75% in 2024 gradually declining to 5.00% in 2031 and thereafter. As of December 31, 2024, the Company projects that medical inflation will be 6.50% in 2025 gradually declining to 5.00% in 2031 and thereafter.\nThe Company will use a weighted-average discount rate and EROA of 5.70% and 6.63%, respectively, for estimating its 2025 pension costs. Additionally, the Company will use a weighted-average discount rate and EROA of 5.69% and 5.00%, respectively, for estimating its 2025 other postretirement benefit costs. A decrease in the discount rate or the EROA would increase the Company’s pension expense. The Company’s 2024 pension and postretirement total net benefit credit was $3 million and the 2023 pension and postretirement total net benefit credit was $6 million. The Company expects to make pension contributions to the plan trusts of $44 million in 2025; however, the actual amounts contributed could change materially from this estimate. The assumptions are reviewed annually and at any interim re-measurement of the plan obligations. The impact of assumption changes is reflected in the recorded pension and postretirement benefit amounts as they occur, or over a period of time if allowed under applicable accounting standards.\nRevenue from the Company’s Regulated Businesses is generated primarily from water and wastewater services delivered to customers. These contracts contain a single performance obligation, the delivery of water and/or wastewater services, as the promise to transfer the individual good or service is not separately identifiable from other promises within the contracts and, therefore, is not distinct. Revenues are recognized over time, as services are provided. There are generally no significant financing components or variable consideration. Revenues include amounts billed to customers on a cycle basis, and unbilled amounts calculated based on estimated usage from the date of the meter reading associated with the latest customer bill, to the end of the accounting period. The amounts that the Company has a right to invoice are determined by each customer’s actual usage, an indicator that the invoice amount corresponds directly to the value transferred to the customer.\nIncreases or decreases in the volumes delivered to customers and rate mix due to changes in usage patterns in customer classes in the period could be significant to the calculation of unbilled revenue. In addition, changes in the timing of meter reading schedules and the number and type of customers scheduled for each meter reading date would also have an effect on the unbilled revenue calculation. Unbilled revenue for the Company’s regulated utilities as of December 31, 2024 and 2023 was $219 million and $193 million, respectively.\nThe Company also recognizes revenues for certain ratemaking mechanisms that meet the criteria for alternative revenue program accounting. These mechanisms, which include the Company’s revenue stability mechanisms, qualify as alternative revenue programs if they have been authorized for rate recovery, are objectively determinable and probable of recovery, and are expected to be collected within 24 months following the end of the period in which they were recognized.\nThe Company also has long-term, fixed fee contracts to operate and maintain water and wastewater systems for the U.S. government on military installations and facilities owned by municipal customers. Billing and revenue recognition for the fixed fee revenues occurs ratably over the term of the contract, as customers simultaneously receive and consume the benefits provided by the Company. Additionally, these contracts allow the Company to make capital improvements to underlying infrastructure, which are initiated through separate modifications or amendments to the original contract, whereby stand-alone, fixed pricing is separately stated for each improvement. The Company has determined that these capital improvements are separate performance obligations, with revenue recognized over time based on performance completed at the end of each reporting period. Losses on contracts are recognized during the period in which the losses first become probable and estimable. Revenues recognized during the period in excess of billings on construction contracts are recorded as unbilled revenues or other long-term assets, with billings in excess of revenues recorded as other current or long-term liabilities until the recognition criteria are met. Changes in contract performance and related estimated contract profitability may result in revisions to costs and revenues and are recognized in the period in which revisions are determined. Unbilled revenue within Other as of December 31, 2024 and 2023, was $96 million and $109 million, respectively.\nAccounting for Contingencies\nThe Company records loss contingencies when management determines that the outcome of future events is probable of occurring and when the amount of the loss or a range of losses can be reasonably estimated. The determination of a loss contingency is based on management’s judgment and estimates about the likely outcome of the matter, which may include an analysis of different scenarios. Liabilities are recorded or adjusted when events or circumstances cause these judgments or estimates to change. In assessing whether a loss is reasonably possible, management considers many factors, which include, but are not limited to: the nature of the litigation, claim or assessment, review of applicable law, opinions or views of legal counsel and other advisors, and the experience gained from similar cases or situations. The Company provides disclosures for material contingencies when management deems there is a reasonable possibility that a loss or an additional loss may be incurred. The Company provides estimates of reasonably possible losses when such estimates may be reasonably determined, either as a single amount or within a reasonable range.\nActual amounts realized upon settlement or other resolution of loss contingencies may be different than amounts recorded and disclosed and could have a significant impact on the liabilities, revenue and expenses recorded on the Consolidated Financial Statements. See Note 16—Commitments and Contingencies in the Notes to Consolidated Financial Statements for additional information regarding contingencies.\nRecent Accounting Standards\nSee Note 2—Significant Accounting Policies in the Notes to Consolidated Financial Statements for a description of recent accounting standards.\n\nthe Company invested $3.3 billion, in the Regulated Businesses, as discussed below:\n$2.8 billion capital investment in the Regulated Businesses, for infrastructure improvements and replacements; and\n$417 million to fund acquisitions in the Regulated Businesses, which added approximately 69,500 customers during 2024. This includes the acquisitions by the Company’s Pennsylvania subsidiary of the wastewater collection and treatment system assets from the Butler Area Sewer Authority on October 29, 2024, for a cash purchase price of $230 million, which added approximately 15,000 customer connections, and by the Company’s Illinois subsidiary of a wastewater treatment plant and related assets from Granite City on March 11, 2024, for a cash purchase price of $86 million, which added approximately 26,000 wastewater customers, including 15,500 customers indirectly in surrounding communities.\nApproximately 19,400 new customers were added through organic growth in existing systems.\nThe Company expects to invest between $17 billion to $18 billion over the next five years, and between $40 billion to $42 billion over the next 10 years, including $3.3 billion in 2025. The Company’s expected future investments include:\ncapital investment for infrastructure improvements and replacements in the Regulated Businesses of between $15.5 billion to $16 billion over the next five years, and between $36 billion to $37 billion over the next 10 years; and\ngrowth from acquisitions in the Regulated Businesses to expand the Company’s water and wastewater customer base of between $1.5 billion to $2 billion over the next five years, and between $4 billion to $5 billion over the next 10 years.\nThe Company estimates the expected capital investment for infrastructure improvements in its Regulated Businesses over the next ten years will be allocated to the following purposes: infrastructure renewal 68%; resiliency 10%; water quality, including capital expenditures related to PFAS 8%; operational efficiency, technology and innovation 6%; system expansion 5%; other 3%.\nAs of December 31, 2024, the Company had entered into 17 agreements with a total aggregate purchase price of $105 million for pending acquisitions in the Regulated Businesses to add approximately 24,200 additional customers.\nIn December 2020, the Company’s Pennsylvania subsidiary entered into an agreement (an acquisition intended to comply with Act 12 (discussed below)) to acquire the wastewater collection system assets of Brentwood Borough (“Brentwood”) for a purchase price of approximately $19 million. On February 22, 2024, the Pennsylvania Public Utility Commission (the “PaPUC”) denied the Pennsylvania subsidiary’s application to acquire Brentwood. On April 3, 2024, the Pennsylvania subsidiary filed an appeal of the decision with the Pennsylvania Commonwealth Court, asserting, among other things, the PaPUC did not apply the correct legal standard in its decision. The Company cannot currently predict the outcome of this appeal, and the matter remains pending.\nOn July 2, 2024, the PaPUC issued the Final Supplemental Implementation Order (“FSIO”), which makes certain changes to the process by which the PaPUC considers and decides applications to acquire water and wastewater assets under Pennsylvania’s existing utility valuation law, known as Act 12 of 2016 (“Act 12”). The FSIO includes, among other things, a reasonableness review ratio that would be applied to help guide the determination on the overall prudency of the transaction and reasonableness of the purchase price. The provisions of the FSIO are not retroactive and apply to acquisition applications filed after July 2, 2024. The Company cannot currently predict the impact of the FSIO, but the Company intends to continue to support outcomes that allow for consolidation and investment in water and wastewater infrastructure in Pennsylvania and in its other regulated jurisdictions.\nEnvironmental, Health and Safety, and Water Quality Regulation\nOn April 10, 2024, the EPA announced a final NPDWR for six PFAS including PFOA, PFOS, PFNA, HFPO-DA, PFHxS, and PFBS. The NPDWR for PFAS establishes MCLs, for PFAS in drinking water. Utilities will be required to complete their initial monitoring for PFAS by 2027, followed by ongoing compliance monitoring. Utilities will be required to comply with the new MCLs by April 2029, implementing solutions to reduce PFAS levels where needed. Beginning in April 2029, utilities that exceed any of the PFAS MCLs will be required to provide notification to the public of the violation.\nThe Company estimates an investment of approximately $1 billion of capital expenditures to install additional treatment facilities in order to comply with the new regulations by April 2029. Additionally, the Company estimates that it will incur annual operating expenses of up to approximately $50 million related to testing and treatment, with the majority of the operating expenses beginning near the April 2029 compliance deadline. The actual level of capital investment and expenses may differ from these estimates and will be dependent upon market dynamics upon implementation of solutions to comply with the NPDWR for PFAS.\nThe Company has entered into a nine-year exclusive contract with a third-party vendor to supply granular activated carbon, equipment and reactivation services to more than 50 of the Company’s treatment sites across 10 states through 2033. The equipment and services provided through the contract will aid the Company in treating drinking water to assist in complying with the NPDWR for PFAS.\nThe Company supports sound policies and compliance with the NPDWR for PFAS by all water utilities, while protecting customers and communities from the costly burden of monitoring and mitigating PFAS contamination in water systems. The Company continues to advocate for policies that hold polluters accountable and is participating in the multi-district litigation and other lawsuits filed against certain PFAS manufacturers seeking damages and reimbursement of costs incurred and continuing to be incurred to address contamination of public water supply systems by PFAS. For more information on the PFAS multi-district litigation, see Item 3—Legal Proceedings—PFAS Multi-District Litigation.\nOn April 19, 2024, the EPA issued a final rule to designate PFOA and PFOS as hazardous substances under CERCLA. The Company, along with a coalition of other water and wastewater organizations, is actively advocating for and supporting bipartisan legislation that would provide PFAS liability protections under CERCLA for water and wastewater systems, as passive receivers of PFAS, and to hold polluters, and not the public or customers, accountable for PFAS-related liability.\nOn October 30, 2024, the EPA published the LCRI with a “Compliance Date” of November 1, 2027. The LCRI focus includes requirements related to (i) replacing all lead and certain galvanized service lines under a utilities control by October 30, 2037, 10 years from the Compliance Date; (ii)\nidentifying the materials of all service lines of unknown material;\n(iii) improving tap sampling; (iv) lowering the lead action level; and (v) strengthening protections to reduce exposure. The LCRI also deferred the compliance date of certain requirements of the LCRR to allow for compliance with both new rules. The Company is in the process of developing an estimate of capital expenditures and operating costs needed to meet the specific requirements of the LCRI. Capital expenditures and operating costs associated with compliance with federal water quality regulations have been traditionally recognized by PUCs as appropriate for inclusion in establishing rates.\nThe Company continues to comply with the EPA’s existing Lead and Copper Rule requirements by replacing lead service lines in accordance with current scientific guidance and utilizing appropriate corrosion control techniques as necessary to comply with current water quality regulatory requirements.\nThe Company met the LCRR requirements, effective October 16, 2024, identified as enforceable by the EPA. Remaining LCRR requirements are deferred under the LCRI.\nCybersecurity Incident\nOn October 3, 2024, the Company identified u",
  "item2_clean": null
}