{
  "source_file": "azo-20250830x10k.htm",
  "form_type": "10-K",
  "item1_clean": "Purchasing and Supply Chain\nMerchandise is selected and purchased for all stores through our store support centers located in Memphis, Tennessee; Monterrey, Mexico; Chihuahua, Mexico; Sao Paulo, Brazil and Gurugram, India. Additionally, we have offices in Shanghai, China and Istanbul, Turkey to support our global sourcing efforts. In fiscal 2025, one class of similar products accounted for approximately 14 percent of our total revenues, and one individual vendor provided 13 percent of our total purchases. No other class of similar products accounted for 10 percent or more of our total revenues, and no other individual vendor provided more than 10 percent of our total purchases. We believe alternative sources of supply exist, at similar costs, for most types of product sold. Most of our merchandise flows through our distribution centers to our stores by our fleet of tractors and trailers or by third-party transportation firms. The distribution centers replenish our stores up to multiple times per week depending on store sales volumes.\nThe sale of automotive parts, accessories and maintenance items is highly competitive. AutoZone competes on the basis of customer service, including the knowledge and expertise of our AutoZoners and our ability to provide prompt delivery to commercial customers; merchandise quality, selection and availability; product warranty; store layouts, location and convenience; price; and the strength of our AutoZone brand name and quality, trademarks and service marks.\nOur competitors include national, regional and local auto parts chains, independently owned parts stores, online automotive parts stores or marketplaces, wholesale distributors, jobbers, repair shops, car washes and auto dealers, in addition to discount and mass merchandise stores, hardware stores, supermarkets, drugstores, convenience stores, home stores and other retailers that sell aftermarket vehicle parts and supplies, chemicals, accessories and tools.\nGovernment Relations\nAs a company with global operations, we are subject to the federal, state, and local laws and regulations, in the jurisdictions in which we operate, many of which are complex, frequently changing and subject to varying interpretations. These laws and regulations relate to, among other things, the marketing and sale of products; proper handling and disposal of hazardous materials, particularly in connection with our used oil, oil filter and battery recycling programs; occupational health and safety; environmental matters; labor and employment; employee wages and benefits; information security and data privacy; real property; financial reporting and disclosure; antitrust and fair competition; international trade and transportation, logistics and delivery operations.\nWhile compliance with the numerous laws and regulations applicable to our business, including environmental regulations, has not had a material adverse effect on capital expenditures, earnings or our competitive position to date, we can make no assurances as to the future costs of compliance. For more information, see the Risk Factors titled\n“Legal and Regulatory Risks”\n“Information Technology, Cybersecurity and Data Privacy Risks”\nin “Part I. Item 1A, Risk Factors” in this report.\nTrademarks and Patents\nWe regard our trademarks, service marks, patents, domain names, trade dress, trade secrets and other intellectual property as critical to our success and important components of our marketing and merchandising strategies. We have registered several trademarks and service marks in the U.S. Patent and Trademark Office as well as in certain other countries, including without limitation: “AutoZone,” “AutoZone Rewards,” “Get in the Zone,” “Zone,” “Duralast,” “Econocraft,” “ProElite,” “ShopPro,” “SureBilt,” “TotalPro,” “TruGrade,” “Valucraft,” and “ALLDATA,” along with variations of these trademarks. Our trademark registrations have various expiration dates; however, assuming that the trademarks are properly maintained and in use, such registrations may typically be renewed indefinitely.\n\nAutoZone, Inc. (“AutoZone,” the “Company,” “we,” “our” or “us”) is a leading retailer and distributor of automotive replacement parts and accessories in the Americas. We began operations in 1979 and at August 30, 2025, operated 6,627 stores in the United States (“U.S.”), 883 stores in Mexico and 147 stores in Brazil. Each store carries an extensive product line for cars, sport utility vehicles, vans and light duty trucks, including new and remanufactured automotive hard parts, maintenance items, accessories and non-automotive products. At August 30, 2025, in 6,098 of our domestic stores as well as the vast majority of our stores in Mexico and Brazil, we had a commercial sales program that provides prompt delivery of parts and other products and commercial credit to local, regional and national repair garages, dealers, service stations, fleet owners and other accounts. We also sell automotive hard parts, maintenance items, accessories and non-automotive products through www.autozone.com, and our commercial customers can make purchases through www.autozonepro.com. Additionally, we sell the ALLDATA brand of automotive diagnostic, repair, collision and shop management software through www.alldata.com. We also provide product information on our Duralast branded products through www.duralastparts.com. We do not derive revenue from automotive repair or installation services.\nOur websites and the information contained therein or linked thereto are not intended to be incorporated into this report.\nHuman Capital Resources\nWe believe the foundation of our success is our culture, which is deeply rooted in our Pledge and Values: Puts Customers First, Cares About People, Strives for Exceptional Performance, Energizes Others, Embraces Diversity and Helps Teams Succeed. Our Pledge and Values define how our employees (“AutoZoners”) take care of customers and fellow AutoZoners by fostering a strong, unique culture of teamwork and customer service. Each AutoZoner works hard to Live the Pledge, remain committed to our values, share their passion for WOW! Customer Service and Go the Extra Mile every day to continue building and growing AutoZone for our customers.\nWe seek to be the employer of choice as we compete for talent in our retail stores, field supervision, distribution centers, and store support functions. We focus heavily on retention by offering competitive compensation and benefits packages, extensive training and development opportunities.\nAs of August 30, 2025, we employed approximately 130,000 AutoZoners, approximately 60 percent of whom were employed full-time and the remaining 40 percent were employed part-time. Approximately 91 percent of our AutoZoners were employed in stores or in direct field supervision, approximately six percent in distribution centers and approximately three percent in store support and other functions. Included in the above numbers are approximately 19,000 AutoZoners employed in our international operations. We have never experienced any material labor disruption, do not have any collective bargaining agreements in the U.S. and believe that relations with our AutoZoners are good.\nTraining & Development\nWe have a number of different types of jobs and career opportunities. While many of our AutoZoners follow more traditional career paths (e.g., part-time to full-time sales, store manager, district manager, regional manager, vice president), we encourage cross-functional development and support of AutoZoners as they expand their careers into other departments and fields of interest within the Company. Many members of our senior leadership team have held positions in multiple areas of the business. We also invest in advanced leadership training to deepen our bench strength and support succession planning. For additional information, see “Store Personnel Training and Incentives” below. We believe these opportunities are important to attract, motivate and retain high quality AutoZoners.\n\nWe believe our stores are “destination stores,” generating their own traffic, therefore we situate most stores on major thoroughfares with easy access and good parking.\nIn addition to continuing to lease or develop our own locations, we evaluate and may make strategic acquisitions.\nMarketing and Merchandising Strategy\nWe are dedicated to providing customers with superior service and trustworthy advice as well as quality automotive parts and products at a great value in our conveniently located, well-designed stores and through our online platforms. Key elements of this strategy are:\nCustomer service is the most important element in our marketing and merchandising strategy, which is based upon consumer marketing research. We emphasize that our AutoZoners should always put customers first by providing prompt, courteous service and trustworthy advice. Our electronic parts catalog assists in the selection of parts as well as identifying any associated warranties offered by us or our vendors. In addition to our in-store offerings, we sell our full suite of automotive hard parts, maintenance items, accessories and non-automotive parts through www.autozone.com, for pick-up in store or to be shipped directly to a customer’s home or business, with same day or next day delivery programs in most of our U.S. markets. Additionally, we offer a mobile application that provides customers with store locations, driving directions, operating hours, product availability, the ability to purchase products and other information.\nWe also provide access to specialty tools as one of our free services. Through our Loan-A-Tool program customers can borrow a specialty tool, such as a steering wheel puller, for which a do-it-yourself (“DIY”) customer or a repair shop would have little or no subsequent use beyond a single job. AutoZoners also provide free diagnostic and related services, including check engine and anti-lock braking system light readings through our AutoZone Fix Finder service, testing of starters, alternators and batteries, battery charging and the collection of used oil for recycling.\n\nSubstantially all stores are based on standard store formats, resulting in generally consistent appearance, merchandising and product mix with approximately 90% to 99% of each store’s square footage used as selling space. Most of our stores carry approximately 20,000 to 25,000 unique SKUs with 40% to 50% of the space dedicated to hard parts inventory. Hub stores carry approximately 40,000 to 50,000 unique SKUs and mega hub stores carry approximately 80,000 to 110,000 unique SKUs with 70% to 85% of their space utilized for hard parts. The hard parts inventory area is generally fronted by counters or pods that run the depth or length of the store, dividing the hard parts area from the remainder of the store. The remaining selling space contains displays of maintenance, accessories and non-automotive items.\nStores are replenished primarily by the nearest distribution center but also typically have same-day access to one of our 367 domestic and 53 international hub stores’ expanded inventory assortment. As a subset of our domestic hub stores, we ended fiscal 2025 with 133 mega hub stores, an increase of 24 since the end of fiscal 2024. Additionally, we have eight mega hub stores in Mexico. Hub and mega hub stores work in concert with other stores to drive customer satisfaction through improved local parts availability and expanded product assortments.\nStore Personnel Training and Incentives\nWe provide on-the-job training as well as formal training programs, including an annual national sales meeting with related cascading meetings at our distribution centers, regional offices and stores; store meetings on specific sales and product topics; standardized computer-based training to support culture, safety, salesmanship, compliance and product and job knowledge; and several specialist, vendor and third-party progra",
  "item7_clean": "Item 7. Management’s Discussion and Analysis of Financial Condition and Results of Operations\nWe are a leading retailer and distributor of automotive replacement parts and accessories in the Americas. We began operations in 1979 and at August 30, 2025, operated 6,627 stores in the U.S., 883 stores in Mexico and 147 stores in Brazil. Each store carries an extensive product line for cars, sport utility vehicles, vans and light duty trucks, including new and remanufactured automotive hard parts, maintenance items, accessories and non-automotive products. At August 30, 2025, in 6,098 of our domestic stores as well as the vast majority of our stores in Mexico and Brazil, we had a commercial sales program that provides prompt delivery of parts and other products and commercial credit to local, regional and national repair garages, dealers, service stations, fleet owners and other accounts. We also sell automotive hard parts, maintenance items, accessories and non-automotive products through www.autozone.com, and our commercial customers can make purchases through www.autozonepro.com. Additionally, we sell the ALLDATA brand of automotive diagnostic, repair, collision and shop management software through www.alldata.com. We also provide product information on our Duralast branded products through www.duralastparts.com. We do not derive revenue from automotive repair or installation services.\nFor fiscal 2025, net sales increased to $18.9 billion, a 2.4% increase over the prior year.\nDomestic commercial sales increased 6.7%, which represents 31.7% of our total Domestic sales\n. Operating profit decreased 4.7% to $3.6 billion, net income decreased 6.2% to $2.5 billion and diluted earnings per share decreased 3.1% to $144.87 for the year.\nFiscal 2025 consisted of 52 weeks whereas fiscal 2024 consisted of 53 weeks. The inclusion of the 53\nweek in fiscal 2024 resulted in an increase to net sales of $365.9 million and an increase in operating profit of $86.7 million. Additionally, fiscal 2025 comparisons were negatively impacted by foreign currency exchange rates which had an unfavorable impact to net sales of $273.1 million and operating profit of $88.2 million. Operating profit comparison was also negatively impacted by an unfavorable net non-cash LIFO impact of $104.0 million.\nDuring fiscal 2025, failure and maintenance related categories represented the largest portion of our sales mix, at approximately 85% of total sales. While we have not experienced any fundamental shifts in our category sales mix as compared to previous years, we have seen a slight decrease in mix of sales of the accessories category and a slight increase in the maintenance and failure categories compared to the previous two years.\nOur business is impacted by various factors within the economy that affect both our consumer and our industry, including but not limited to inflation, interest rates, levels of consumer debt, fuel and energy costs, prevailing wage rates, foreign exchange rate fluctuations, supply chain disruptions, tariffs, trade policies and other geopolitical factors, hiring and other economic conditions. Given the nature of these macroeconomic factors, which are generally outside of our control, we cannot predict whether or for how long certain trends will continue, nor can we predict to what degree these trends will impact us in the future.\nThe two statistics we believe have the closest correlation to our market growth over the long-term are miles driven and the number of seven-year-old or older vehicles on the road.\nWe believe as the number of miles driven increases, consumers’ vehicles are more likely to need service and maintenance, resulting in an increase in the need for automotive hard parts and maintenance items. For the twelve-month period ended July 2025, miles driven in the U.S. increased 1.0% compared to the same period in the prior year based on the latest information available from the U.S. Department of Transportation.\nSeven Year Old or Older Vehicles\nAs the number of seven-year-old or older vehicles on the road increases, we expect an increase in demand for the products we sell. We expect the aging vehicle population to continue to increase as consumers keep their cars longer. According to the latest data provided by S&P Global Mobility, the average age of light vehicles on the road increased slightly to 12.8 years and these vehicles account for approximately 43% of U.S. vehicles.\n\nThe fiscal year ended August 31, 2024 consisted of 53 weeks.\nThe 52 weeks ended August 28, 2021 was negatively impacted by pandemic related expenses, including Emergency Time-Off of approximately $43.0 million (pre-tax).\nFiscal 2025, 2024, 2023, 2022 and 2021 include excess tax benefits from stock option exercises of $58.2 million, $81.4 million, $92.2 million, $63.2 million, and $56.4 million, respectively.\nThe domestic and international comparable sales increases are based on sales for all AutoZone stores open at least one year. Constant currency same store sales exclude impacts from fluctuations of foreign exchange rates by converting both the current year and prior year international results at the prior year foreign currency exchange rate. Same store sales are computed on a 52-week basis. Relocated stores are included in the same store sales computation based on the year the original store was opened. Closed store sales are included in the same store sales computation up to the week it closes, and excluded from the computation for all periods subsequent to closing. All sales through our www.autozone.com website, including consumer direct ship-to-home sales, are also included in the computation.\nDuring the third quarter of fiscal 2020, the Company temporarily suspended share repurchases under the share repurchase program in response to the COVID-19 pandemic which was restarted beginning in the first quarter of fiscal 2021.\nInventory turnover is calculated as cost of sales divided by the average merchandise inventory balance over the trailing 5 quarters.\nAfter-tax return on invested capital is defined as after-tax operating profit (excluding rent charges) divided by invested capital (which includes a factor to capitalize leases).\nAdjusted debt to EBITDAR is defined as the sum of total debt, finance lease obligations and annual rents times six; divided by net income plus interest, taxes, depreciation, amortization, rent and share-based compensation expense. See Reconciliation of Non-GAAP Financial Measures in Management’s Discussion and Analysis of Financial Condition and Results of Operations.\nCash flow before share repurchases and changes in debt is defined as the change in cash and cash equivalents less the change in debt plus treasury stock purchases. See Reconciliation of Non-GAAP Financial Measures in Management’s Discussion and Analysis of Financial Condition and Results of Operations.\nShare repurchases are inclusive of excise tax in fiscal 2025, 2024 and 2023. The excise tax is assessed at one percent of the fair market value of net stock repurchases after December 31, 2022.\n\nConstant currency same store sales exclude impacts from fluctuations of foreign exchange rates by converting both the current year and prior year international results at the prior year foreign currency exchange rate.\nGross profit for fiscal 2025 was $10.0 billion, or 52.6% of net sales, a 47 basis point decrease compared with $9.8 billion, or 53.1% of net sales for fiscal 2024. The decrease in gross margin was driven by 55 basis points ($64.0 million charge in the current year versus $40.0 million benefit in the prior year) from non-cash LIFO impact.\nOperating, selling, general and administrative expenses for fiscal 2025 increased to $6.4 billion, or 33.6% of net sales, from $6.0 billion, or 32.6% of net sales for fiscal 2024. The increase in operating expenses as a percentage of sales was primarily driven by investments to support our growth initiatives.\nInterest expense, net for fiscal 2025 was $475.8 million compared with $451.6 million during fiscal 2024. Average borrowings for fiscal 2025 were $9.0 billion, compared with $8.7 billion for fiscal 2024. Weighted average borrowing rates were 4.48% and 4.39% for fiscal 2025 and 2024, respectively.\nOur effective income tax rate was 20.3% and 20.2% of pre-tax income for fiscal 2025 and fiscal 2024, respectively. The benefit from stock options exercised in fiscal 2025 was $58.2 million compared to $81.4 million in fiscal 2024 (see “Note E – Income Taxes” in the Notes to Consolidated Financial Statements).\nNet income for fiscal 2025 decreased by 6.2% to $2.5 billion, and diluted earnings per share decreased 3.1% to $144.87 from $149.55 in fiscal 2024. The impact on the fiscal 2025 diluted earnings per share from stock repurchases was an increase of $0.26.\nFiscal 2024 Compared with Fiscal 2023\nEach of the first three quarters of our fiscal year consists of 12 weeks, and the fourth quarter consisted of 16 weeks in 2025, 17 weeks in 2024 and 16 weeks in 2023. Because the fourth quarter contains seasonally high sales volume and consists of 16 or 17 weeks, compared with 12 weeks for each of the first three quarters, our fourth quarter represents a disproportionate share of our annual net sales and net income. The fourth quarter of fiscal year 2025 represented 33.0% of annual sales and 33.5% of net income; the fourth quarter of fiscal year 2024 represented\n\nAs of August 30, 2025, we were in compliance with all covenants and expect to remain in compliance with all covenants under our borrowing arrangements.\nFor the fiscal years ended August 30, 2025, and August 31, 2024, our adjusted debt to earnings before interest, taxes, depreciation, amortization, rent and share-based compensation expense (“EBITDAR”) ratio was 2.5:1 for both periods. We calculate adjusted debt as the sum of total debt, finance lease liabilities and rent times six; and we calculate adjusted EBITDAR by adding interest, taxes, depreciation, amortization, rent and share-based compensation expense to net income. We target our debt levels to a specified ratio of adjusted debt to EBITDAR in order to maintain our investment grade credit ratings and believe this is important information for the management of our debt levels. To the extent adjusted EBITDAR increases, we expect our debt levels to increase; conversely, if adjusted EBITDAR decreases, we would expect our debt levels to decrease. Refer to the “Reconciliation of Non-GAAP Financial Measures” section for further details of our calculation.\nDuring 1998, we announced a program permitting us to repurchase a portion of our outstanding shares not to exceed a dollar maximum established by our Board of Directors (the “Board”). On June 19, 2024, the Board voted to increase the repurchase authorization by $1.5 billion, bringing the total authorization to $39.2 billion. From January 1998 to August 30, 2025, we have repurchased a total of 155.6 million shares at an aggregate cost of $38.5 billion. We repurchased 0.4 million, 1.1 million and 1.5 million shares of common stock at an aggregate cost of $1.5 billion, $3.2 billion and $3.7 billion during fiscal 2025, 2024 and 2023, respectively. Considering cumulative repurchases as of August 30, 2025 we had $632.3 million remaining under the Board’s authorization to repurchase our common stock. We will continue to evaluate current and expected business conditions and adjust the level of share repurchases under our share repurchase program in a manner that is consistent with our capital allocation strategy or as we otherwise deem appropriate.\nCash flow before share repurchases and changes in debt was $1.8 billion, $1.8 billion and $2.2 billion for the fiscal year ended August 30, 2025, August 31, 2024 and August 26, 2023, respectively. Cash flow before share repurchases and changes in debt is calculated as the net increase or decrease in cash and cash equivalents less net increases or decreases in debt (excluding deferred financing costs) plus share repurchases. We use cash flow before share repurchases and changes in debt to calculate the cash flows remaining and available. We believe this is important information regarding our allocation of available capital where we prioritize investments in the business and utilize the remaining funds to repurchase shares, while maintaining debt levels that support our investment grade credit ratings. Refer to the “Reconciliation of Non-GAAP Financial Measures” section for further details of our calculation.\nOn October 8, 2025, the Board voted to authorize the repurchase of an additional $1.5 billion of our common stock in connection with our ongoing share repurchase program. Since the inception of the repurchase program in 1998, the Board has authorized $40.7 billion in share repurchases. Subsequent to August 30, 2025, and through October 20, 2025, we have repurchased 51,543 shares of common stock at an aggregate cost of $215.6 million. Considering the cumulative repurchases and the increase in authorization subsequent to August 30, 2025, and through October 20, 2025, we have $1.9 billion remaining under the Board’s authorization to repurchase our common stock.\n\nReconciliation of Non-GAAP Financial Measures\n“Management’s Discussion and Analysis of Financial Condition and Results of Operations” includes certain financial measures not derived in accordance with generally accepted accounting principles (“GAAP”). These non-GAAP financial measures provide additional information for determining our optimum capital structure and are used to assist management in evaluating performance and in making appropriate business decisions to maximize stockholders’ value.\nNon-GAAP financial measures should not be used as a substitute for GAAP financial measures, or considered in isolation, for the purpose of analyzing our operating performance, financial position or cash flows. However, we have presented the non-GAAP financial measures, as we believe they provide additional information that is useful to investors as it indicates more clearly our comparative year-to-year operating results. Furthermore, our management and Compensation Committee of the Board use the above-mentioned non-GAAP financial measures to analyze and compare our underlying operating results and use select measurements to determine payments of performance-based compensation. We have included a reconciliation of this information to the most comparable GAAP measures in the following reconciliation tables.\nReconciliation of Non-GAAP Financial Measure: Cash Flow Before Share Repurchases and Changes in Debt\nThe following table reconciles net increase (decrease) in cash and cash equivalents to cash flow before share repurchases and changes in debt, which is presented in “Management’s Discussion and Analysis of Financial Condition and Results of Operations”:\n\nCritical Accounting Estimates\nPreparation of our Consolidated Financial Statements requires us to make estimates and assumptions affecting the reported amounts of assets and liabilities at the date of the financial statements, reported amounts of revenues and expenses during the reporting period and related disclosures of contingent liabilities. In the Notes to our Consolidated Financial Statements, we describe our significant accounting policies used in preparing the Consolidated Financial Statements. Our policies are evaluated on an ongoing basis and are drawn from historical experience and other assumptions that we believe to be reasonable under the circumstances. Actual results could differ under different assumptions or conditions. Our senior management has identified self-insurance reserves as a critical accounting estimate that is materially impacted by assumptions and has discussed this policy with the Audit Committee of our Board.\nSelf-Insurance Reserves\nWe retain a significant portion of the risks associated with workers’ compensation, general and product liability, property and vehicle insurance; and we",
  "item2_clean": null
}