{
  "source_file": "ba-20241231.htm",
  "form_type": "10-K",
  "item1_clean": "The Boeing Company, together with its subsidiaries (herein referred to as “Boeing,” the “Company,” “we,” “us,” “our”), is one of the world’s major aerospace firms.\nWe are organized based on the products and services we offer. We operate in three reportable segments:\nCommercial Airplanes (BCA);\nDefense, Space & Security (BDS);\nGlobal Services (BGS).\nCommercial Airplanes Segment\nThis segment develops, produces and markets commercial jet aircraft principally to the commercial airline industry worldwide. We are a leading producer of commercial aircraft and offer a family of commercial jetliners designed to meet a broad spectrum of global passenger and cargo requirements of airlines. This family of commercial jet aircraft in production includes the 737 narrow-body model and the 767, 777 and 787 wide-body models. Development continues on the 777X program and the 737-7 and 737-10 derivatives.\nDefense, Space & Security Segment\nThis segment engages in the research, development, production and modification of manned and unmanned military aircraft and weapons systems for strike, surveillance and mobility, including fighter and trainer aircraft; vertical lift, including rotorcraft and tilt-rotor aircraft; and commercial derivative aircraft, including anti-submarine and tanker aircraft. In addition, this segment engages in the research, development, production and modification of the following products and related services: strategic defense and intelligence systems, including strategic missile and defense systems, command, control, communications, computers, intelligence, surveillance and reconnaissance (C4ISR), cyber and information solutions, and intelligence systems, satellite systems, including government and commercial satellites and space exploration.\nGlobal Services Segment\nThis segment provides services to our commercial and defense customers worldwide. Global Services sustains aerospace platforms and systems with a full spectrum of products and services, including supply chain and logistics management, engineering, maintenance and modifications, upgrades and conversions, spare parts, pilot and maintenance training systems and services, technical and maintenance documents, and data analytics and digital services.\nIntellectual Property\nWe own numerous patents and have licenses for the use of patents owned by others, which relate to our products and their manufacture. In addition to owning a large portfolio of intellectual property, we also license intellectual property to and from third parties. For example, the U.S. government has licenses in our patents that are developed in performance of government contracts, and it may use or authorize others to use the inventions covered by such patents for government purposes. Unpatented research, development and engineering skills, as well as certain trademarks, trade secrets and other intellectual property rights, also make an important contribution to our business. While our intellectual\nproperty rights in the aggregate are important to the operation of each of our businesses, we do not believe that our business would be materially affected by the expiration of any particular intellectual property right or termination of any particular intellectual property patent license agreement.\nAs of December 31, 2024, Boeing’s total workforce was approximately 172,000 with 15% located outside of the U.S. As of December 31, 2024, our global workforce was comprised of approximately 24% women, and our U.S. workforce was comprised of 39% racial and ethnic minorities and 14% U.S. veterans.\nAs of December 31, 2024, our workforce included approximately 58,000 union members. Our principal collective bargaining agreements and their current status are summarized in the following table:\nPercent of our Total Workforce Represented\nStatus of Major Agreements with Union\nThe International Association of Machinists and Aerospace Workers (IAM)\nWe have two major agreements; one with IAM District 837 (Missouri) expiring in July 2025 and one with IAM District 751 (Washington) expiring in September 2028.\nThe Society of Professional Engineering Employees in Aerospace (SPEEA)\nWe have two major agreements; one with SPEEA Professional and one with SPEEA Technical, both expiring in October 2026.\nThe United Automobile, Aerospace and Agricultural Implement Workers of America (UAW)\nWe have one major agreement with UAW District 1069 (Pennsylvania) expiring in April 2027.\nOur prior contract with the International Association of Machinists and Aerospace Workers District 751 (IAM 751) expired on September 12, 2024, and 96% of IAM 751 members voted to initiate a strike. The strike lasted until November 4, 2024, when IAM 751 members voted to ratify a new contract. As a result of the strike, we paused production of our commercial aircraft (other than the 787 production in Charleston) and certain of our BDS products, adversely impacting our business and financial position. During the strike, we implemented hiring freezes and announced plans to reduce our overall workforce. For information on risks related to our human capital, see “Risks Related to Our Business and Operations” in Item 1A. Risk Factors.\nWe are committed to creating a work environment where every teammate around the world can perform at their best and grow their careers while supporting our company’s mission to protect, connect and explore our world and beyond. Our compensation program is designed to attract, reward and retain the best-qualified talent with competitive compensation and benefits, including healthcare, paid time off, parental leave, retirement benefits, tuition assistance, employee skills and leadership development programs, and mental and physical well-being programs. We also invest in rewarding performance and have established a multi-level recognition program to acknowledge the achievements of excellent individual or team performance.\nWe support our employees’ continuous development of professional, technical and leadership skills through access to digital learning resources and partnerships with leading professional/technical societies and organizations around the world. In 2024, Boeing employees completed approximately 5.9 million hours of learning and approximately 14,000 Boeing employees leveraged our tuition assistance program to pursue degrees, professional certificates and individual courses in strategic fields of study.\nSafety, quality, integrity and sustainability are at the core of how Boeing operates. We aspire to achieve zero workplace injuries and provide a safe, open and accountable work environment for our employees. Employees are required on an annual basis to sign the Boeing Code of Conduct to reaffirm their commitment to do their work in a compliant and ethical manner. Additionally, we continue to focus on creating a culture where all employees feel empowered to speak up and provide multiple channels for all employees to ask for guidance and report concerns, including those related to ethics, safety or quality. We address employee concerns and take appropriate actions that uphold our Boeing values.\nThe commercial jet aircraft market and the airline industry remain extremely competitive. We face aggressive international competitors who are intent on increasing their market share, such as Airbus and entrants from China. We are focused on improving our products and processes and continuing cost reduction efforts. We intend to continue to compete with other aircraft manufacturers by providing customers with airplanes and services that deliver superior design, safety, quality, efficiency and value to customers around the world.\nBDS faces strong competition primarily from Lockheed Martin Corporation, Northrop Grumman Corporation, RTX Corporation, General Dynamics Corporation and SpaceX. Non-U.S. companies such as BAE Systems and Airbus Group continue to build a strategic presence in the U.S. market by strengthening their North American operations and partnering with U.S. defense companies. In addition, certain competitors have occasionally formed teams with other competitors to address specific customer requirements. BDS expects the trend of strong competition to continue into 2025.\nThe commercial and defense services markets are extremely challenging and are made up of many of the same strong U.S. and non-U.S. competitors facing BCA and BDS along with other competitors in those markets. BGS leverages our extensive services network offering products and services which span the life cycle of our defense and commercial aircraft programs: training, fleet services and logistics, maintenance and engineering, modifications and upgrades, as well as the daily cycle of gate-to-gate operations. BGS expects the market to remain highly competitive in 2025, and intends to grow market share by leveraging a high level of customer satisfaction and productivity.\nOur businesses are heavily regulated in most of our markets. We work with numerous U.S. government agencies and entities, including but not limited to, all of the branches of the U.S. military, the National Aeronautics and Space Administration (NASA), the Federal Aviation Administration (FAA) and the Department of Homeland Security. Similar government authorities exist in our non-U.S. markets.\nGovernment Contracts.\nThe U.S. government, and other governments, may terminate any of our government contracts at their convenience, as well as for default based on our failure to meet specified performance requirements. If any of our U.S. government contracts were to be terminated for convenience, we generally would be entitled to receive payment for work completed and allowable termination or cancellation costs. If any of our government contracts were to be terminated for default, generally the U.S. government would pay only for the work that has been accepted and could require us to pay the difference between the original contract price and the cost to re-procure the contract items,\nnet of the work accepted from the original contract. The U.S. government can also hold us liable for damages resulting from the default.\nCommercial Aircraft.\nIn the U.S., our commercial aircraft products are required to comply with FAA regulations governing production and quality systems, airworthiness and installation approvals, repair procedures and continuing operational safety. For example, as a result of the Alaska Airlines 737-9 accident in January 2024, the FAA investigated the 737 quality control system, including Spirit AeroSystems Holdings, Inc. (Spirit), and increased its oversight of our production and quality and safety management systems. In addition, the FAA communicated it will not approve production rate increases beyond 38 per month or additional production lines until\nBoeing has complied with required quality and safety standards.\nNew aircraft models and new derivative aircraft are required to obtain FAA certification prior to entry into service. Outside the U.S., similar requirements exist for airworthiness, installation and operational approvals. These requirements are generally administered by the national aviation authorities of each country and, in the case of Europe, coordinated by the European Union Aviation Safety Agency.\nWe are subject to various federal, state, local and non-U.S. laws and regulations relating to environmental protection, including the utilization, discharge, treatment, storage, disposal and remediation of hazardous substances and wastes. We could also be affected by laws and regulations relating to climate change, including laws limiting or otherwise related to greenhouse gas emissions. These laws and regulations could lead to increased environmental compliance expenditures, increased energy and raw materials costs and new and/or additional investment in designs and technologies. We continually assess our compliance status and management of environmental matters to monitor compliance with applicable environmental laws and regul",
  "item7_clean": "Item 7. Management’s Discussion and Analysis of Financial Condition and Results of Operations\nConsolidated Results of Operations and Financial Condition\nWe are a global market leader in the design, development, manufacture, sale, service and support of commercial jetliners, military aircraft, satellites, missile defense, human space flight and launch systems and services. We are one of the two major manufacturers of 100+ seat airplanes for the worldwide commercial airline industry and one of the largest defense contractors in the U.S. While our principal operations are in the U.S., we conduct operations in an expanding number of countries and rely on an extensive network of non-U.S. partners, key suppliers and subcontractors.\nOur strategy is centered on successful execution in healthy core businesses – Commercial Airplanes (BCA), Defense, Space & Security (BDS) and Global Services (BGS). BCA is committed to being the leader in commercial aviation by offering airplanes and services that deliver superior design, safety, quality, efficiency and value to customers around the world. BDS integrates its resources in defense, intelligence, communications, security, space and services to deliver capability-driven solutions to customers at reduced costs. Our BDS strategy is to leverage our core businesses to capture key next-generation programs while expanding our presence in adjacent and international markets. BGS provides support for commercial and defense through innovative, comprehensive and cost-competitive product and service solutions.\nOn January 5, 2024, an Alaska Airlines 737-9 flight made an emergency landing after a mid-exit door plug detached in flight. Following the accident, the Federal Aviation Administration (FAA) grounded and required inspections of all 737-9 aircraft with a mid-exit door plug, which constituted the large majority of the approximately 220 737-9 aircraft in the in-service fleet. On January 24, 2024, the FAA approved an enhanced maintenance and inspection process that was required to be performed on each of the grounded 737-9 aircraft. Our 737-9 operators returned their fleets to service in the first quarter. All 737-9 aircraft in production are undergoing this same enhanced inspection process prior to delivery.\nAs a result of the accident, the FAA performed an investigation into the 737 quality control system. In the second quarter of 2024, we submitted a comprehensive safety and quality plan to the FAA to address the issues identified. As part of our plan to improve quality and safety and to address the issues identified, we slowed production rates and delayed planned production rate increases to reduce traveled work in our factory, as well as at our suppliers. We also began taking additional actions to improve safety and quality, which include investing in workforce training, simplifying plans and processes, eliminating defects, and enhancing our safety and quality culture.\nThe Alaska Airlines accident and our resulting actions, including slowing production, to improve compliance with our manufacturing quality control requirements significantly impacted our financial position, results of operations and cash flows during 2024.\nOn November 4, 2024, the International Association of Machinists and Aerospace Workers District 751 (IAM 751) voted to ratify a new contract, thereby ending the work stoppage initiated on September 13, 2024, which paused production of certain commercial aircraft models (737, 767, 777 and 777X aircraft) as well as production of commercial derivative aircraft for our Defense, Space & Security business (KC-46A Tanker and P-8A Poseidon). Production for all programs resumed in December 2024.\nThe IAM 751 work stoppage significantly reduced aircraft deliveries in the second half of 2024. The new contract with IAM 751 and pay enhancements for certain non-union employees is adversely impacting our financial position, results of operations and cash flows.\nBusiness Environment and Trends\nIn 2024, global air traffic continued to expand beyond 2019 levels with domestic travel continuing to be the most robust and the single-aisle market following closely. International travel also surpassed pre-pandemic levels during 2024 and the wide-body market continues to improve with the international travel recovery. The transition in the international commercial market from recovery to normal market conditions is continuing to progress as China international travel remains below 2019 levels. We are experiencing strong demand from our airline customers globally.\nWe and our suppliers are experiencing supply chain disruptions as a result of production quality issues, global supply chain constraints, and labor instability. We and our suppliers are also experiencing inflationary pressures. We continue to monitor the health and stability of the supply chain. These factors have reduced overall productivity and adversely impacted our financial position, results of operations and cash flows.\nAirline financial performance, which influences demand for new capacity, has benefited from the resilient demand for travel. The International Air Transport Association (IATA) is estimating 2024 industry-wide net profits of $31.5 billion, up from its forecast of $25.7 billion a year ago, primarily driven by North America, Europe and the Middle East. For 2025, IATA is forecasting $36.6 billion in net profits for the industry globally. The overall outlook continues to stabilize as we face uncertainties in the environment in the near- to medium-term as airlines are facing persistently high and volatile costs. The global economy is expecting a continued easing of inflation and interest rates, with regional economic and geopolitical difficulties adding uncertainty to the outlook and the financial viability of some airlines and regions.\nThe long-term outlook for the industry remains positive due to the fundamental drivers of air travel demand: economic growth, increasing propensity to travel due to increased trade, globalization and improved airline services driven by liberalization of air traffic rights between countries. Our Commercial Market Outlook forecast projects a 3.2% growth rate in the global fleet over a 20-year period. Based on long-term global economic growth projections of 2.6% in average annual gross domestic product, we project demand for approximately 43,975 new airplanes over the next 20 years. The industry remains vulnerable to exogenous developments including fuel price spikes, potential new or increased tariffs, changing energy policies, credit market shocks, acts of terrorism, natural disasters, conflicts, epidemics, pandemics and increased global environmental regulations.\nAt BDS, we continue to see stable demand reflecting the important role our products and services have in ensuring our national security. Outside of the U.S., we are seeing similar solid demand as governments prioritize security, defense technology and global cooperation given evolving threats. We continue to experience production disruptions and inefficiencies due to technical challenges, supplier disruption and factory performance. These factors have contributed to significant earnings charges on fixed-price development programs as well as on a number of mature programs which are continuing to adversely affect margins and cash flows.\nAt BGS, we expect commercial revenues to remain strong in future quarters as the commercial airline industry has largely recovered and transitions to growth. The demand outlook for our government services business remains stable.\nConsolidated Results of Operations\n\nBDS loss from operations in 2024 was $5,413 million compared with $1,764 million in 2023. The increase is primarily due to higher net unfavorable cumulative contract catch-up adjustments of $3,428 million on BDS’ five major fixed-price development programs compared to 2023. During 2024, losses incurred on the five major fixed-price development programs totaled $5,013 million, including KC-46A Tanker ($2,002 million), T-7A Red Hawk ($1,770 million), Commercial Crew ($523 million), VC-25B ($379 million), and MQ-25 ($339 million). Net unfavorable cumulative contract catch-up adjustments were $3,534 million higher than the comparable period in the prior year. See further discussion of fixed-price contracts in Note 14 to our Consolidated Financial Statements.\nBDS loss from operations in 2023 of $1,764 million decreased by $1,780 million compared with $3,544 million in 2022. The decrease is primarily due to $2,863 million of lower charges in 2023 on fixed-price development programs that were partially offset by lower earnings across other programs including satellites and F-15, as well as higher period expenses. During 2023, losses incurred on the five fixed-price development programs totaled $1,585 million compared with $4,448 million in 2022. Charges on fixed-price development programs in 2023 included VC-25B ($482 million), KC-46A Tanker ($309 million), Commercial Crew ($288 million), T-7A Red Hawk ($275 million) and MQ-25 ($231 million). Loss from operations in 2023 includes a $315 million impact from an agreement with one of our satellite customers which includes customer considerations as well as increased costs to enhance the\nconstellation and meet lifecycle commitments. Net unfavorable cumulative contract catch-up adjustments were $2,328 million better than in 2022.\nSee further discussion of fixed-price contracts in Note 14 to our Consolidated Financial Statements.\nBDS loss from operations includes our share of income from equity method investments of $125 million, $44 million and $13 million primarily from our United Launch Alliance and other joint ventures in 2024, 2023 and 2022, respectively.\nTotal backlog of $64,023 million at December 31, 2024 was $5,011 million higher than December 31, 2023, reflecting the timing of awards, partially offset by revenue recognized on contracts awarded in prior periods.\nAdditional Considerations\nOur BDS business includes a variety of development programs which have complex design and technical challenges. Some of these programs have cost-type contracting arrangements. In these cases, the associated financial risks are primarily reduced award or incentive fees, lower profit rates or program cancellation if cost, schedule or technical performance issues arise. Examples of these programs include Ground-based Midcourse Defense, Proprietary and Space Launch System programs.\nSome of our development programs are contracted on a fixed-price basis. Examples of significant fixed-price development programs include Commercial Crew, KC-46A Tanker, MQ-25, T-7A Red Hawk, VC-25B, and commercial and military satellites. A number of our ongoing fixed-price development programs have reach-forward losses. New programs could also have risk for reach-forward loss upon contract award and during the period of contract performance. Many development programs have highly complex designs. As technical or quality issues arise during development, we may experience schedule delays and cost impacts, which could increase our estimated cost to perform the work or reduce our estimated price, either of which could result in a material charge or otherwise adversely affect our financial condition. These programs are ongoing, and while we believe the cost and fee estimates incorporated in the financial statements are appropriate, the technical complexity of these programs creates financial risk as additional completion costs may become necessary or scheduled delivery dates could be extended, which could trigger termination provisions or other financially significant exposure. Risk remains that we may be required to record additional reach-forward losses in future periods.\nBusiness Environment and Trends\nThe aerospace markets we serve include parts distribution, logistics and other inventory services; maintenance, engineering and upgrades; training and professional services; and data analytics and digital services. We expect BGS commercial revenues to remain strong in future quarters as the commercial airline industry transitions from recovery to growth.\nOver the long-term, as the size of the worldwide commercial airline fleet continues to grow, so does demand for aftermarket services designed to increase efficiency and extend the economic lives of aircraft. Airlines are using data analytics to plan flight operations and predictive maintenance to improve their productivity and efficiency. Airlines continue to look for opportunities to reduce the size and cost of their spare parts inventory, frequently outsourcing spares management to third parties.\nThe demand outlook for our government services business has remained stable in 2024. Government services market segments are growing on pace with related fleets, but vary based on the utilization and age of the aircraft. The U.S. government services market is the single largest individual market, comprising over 50 percent of the government services markets served. Over the next decade, we expect U.S. growth to remain flat and non-U.S. fleets to add rotorcraft and commercial derivative aircraft at faster rates. We expect approximately 30 percent of the worldwide fleet of military aircraft to be retired and replaced over the next ten years, driving increased demand for services to maintain aging aircraft and enhance aircraft capability.\nBGS’ major customer, the U.S. government, remains subject to the spending limits and uncertainty, which could restrict the execution of certain program activities and delay new programs or competitions.\nIndustry Competitiveness\nAviation services is a competitive market with many domestic and international competitors. This market environment has resulted in intense pressures on pricing, and we expect these pressures to continue or intensify in the coming years. Continued access to global markets remains vital to our ability to fully realize our sales growth potential and long-term investment returns.\nResults of Operations\n\nLoss from operations (GAAP)\nFAS/CAS service cost adjustment\nCore operating loss (Non-GAAP)\nThe FAS/CAS service cost adjustment represents the difference between the FAS pension and postretirement service costs calculated under GAAP and costs allocated to the business segments.\nCore operating loss is a non-GAAP measure that excludes the FAS/CAS service cost adjustment. See pages 46 - 48.\nLoss from operations increased by $9,934 million in 2024 compared with 2023. BCA loss from operations increased by $6,334 million primarily due to reach-forward losses on the 777X and 767 programs, 737-9 customer considerations related to the January 2024 grounding, lower deliveries, and lower margins driven by production disruption including the IAM 751 work stoppage and new agreement, and higher research and development expense, partially offset by lower abnormal production costs. BDS loss from operations increased by $3,649 million compared to the same period in 2023 primarily due to higher net unfavorable cumulative contract catch-up adjustments in 2024 on major fixed-price development programs. BGS earnings from operations increased by $289 million in 2024 compared with 2023 primarily due to higher commercial services revenue. Loss from operations on Unallocated items, eliminations and other increased by $288 million in 2024 primarily due to an increase in eliminations and other unallocated items expense, partially offset by an increase in share-based plans income.\nLoss from operations decreased by $2,746 million in 2023 compared with 2022. BDS loss from operations decreased by $1,780 million compared to the same period in 2022, primarily due to a reduction in net unfavorable cumulative contract catch-up adjustments, which were $2,328 million better than the net unfavorable impact in the prior year. BCA loss from operations decreased by $706 million reflecting higher deliveries and lower period expenses including lower abnormal produ",
  "item2_clean": null
}