{
  "source_file": "ba-20250930.htm",
  "form_type": "10-Q",
  "item1_clean": null,
  "item7_clean": null,
  "item2_clean": "Since our operating cycle is long-term and involves many different types of development and production contracts with varying delivery and milestone schedules, the operating results of a particular period may not be indicative of future operating results. In addition, depending on the customer and their funding sources, our orders might be structured as annual follow-on contracts, or as one large multi-year order or long-term award. As a result, period-to-period comparisons of backlog are not necessarily indicative of future workloads. The following discussions of comparative results among periods should be viewed in this context.\nDeliveries of new-build production units, including remanufactures and modifications, were as follows:\nNine months ended September 30\nThree months ended September 30\nCH-47 Chinook (Renewed)\nAH-64 Apache (Remanufactured)\nCommercial Satellites\nBDS revenues for the nine months ended September 30, 2025, increased by $1,310 million compared with the same period in 2024. The increase is primarily due to $1,438 million lower net unfavorable cumulative contract catch-up adjustments compared to the prior year comparable period. The increase in revenue was partially offset by the absence of a favorable MQ-25 contract modification that was awarded during the first quarter of 2024.\nBDS revenues for the three months ended September 30, 2025, increased by $1,366 million compared with the same period in 2024. The increase reflects $830 million lower net unfavorable cumulative contract catch-up adjustments. The increase also reflects higher volume of $525 million primarily on E-7, KC-46A, and weapons programs.\nEarnings/(Loss) From Operations\nBDS earnings from operations for the nine months ended September 30, 2025, was $379 million, compared with a loss from operations of $3,146 million in the same period in 2024. The year-over-year improvement in earnings is primarily due to lower net unfavorable cumulative catch-up adjustments of $3,714 million compared to the prior year comparable period. During the nine months ended September\n30, 2024, losses incurred on the five major fixed-price development programs totaled $3,302 million. Losses on the five major development programs were not significant in 2025. In addition, the year over year earnings improvement reflects higher earnings from other programs including fighters, P-8, satellites and weapons.\nBDS earnings from operations was $114 million for the three months ended September 30, 2025, compared with loss from operations of $2,384 million in the same period in 2024. The year over year improvement in earnings reflects a decrease in net unfavorable cumulative contract catch-up adjustments which were $2,362 million lower than the comparable period in the prior year. Higher volume also contributed to the comparative earnings increase. During the third quarter of 2024, losses incurred on the five major fixed-price development programs totaled $2,036 million. In addition, earnings in 2024 were adversely impacted by lower earnings on several programs including fighters, P-8 and E-7, reflecting production and engineering inefficiencies.\nSee further discussion of fixed-price contracts in Note 11 to our Condensed Consolidated Financial Statements.\nBDS earnings/(loss) from operations includes our share of earnings from equity method investments of $30 million and $10 million for the nine and three months ended September 30, 2025, compared with $104 million and $9 million for the same periods in 2024.\nBDS backlog was $76,084 million at September 30, 2025 compared with $64,023 million as of December 31, 2024. The increase reflects the timing of awards, partially offset by revenue recognized on contracts awarded in prior periods.\nAdditional Considerations\nOur BDS business includes a variety of development programs which have complex design and technical challenges. Some of these programs have cost-type contracting arrangements. In these cases, the associated financial risks are primarily reduced award or incentive fees, lower profit rates or program cancellation if cost, schedule or technical performance issues arise. Examples of these programs include Ground-based Midcourse Defense, Proprietary and Space Launch System programs.\nSome of our development programs are contracted on a fixed-price basis. Examples of significant fixed-price development programs include Commercial Crew, KC-46A Tanker, MQ-25, T-7A Red Hawk, VC-25B, and commercial and military satellites. A number of our ongoing fixed-price development programs have reach-forward losses. New programs could also have risk for reach-forward loss upon contract award and during the period of contract performance. Many development programs have highly complex designs. As technical or quality issues arise during development, we may experience schedule delays and cost impacts, which could increase our estimated cost to perform the work or reduce our estimated price, either of which could result in a material charge or otherwise adversely affect our financial condition. These programs are ongoing, and while we believe the cost and fee estimates incorporated in the financial statements are appropriate, the technical complexity of these programs creates financial risk as additional completion costs may become necessary or scheduled delivery dates could be extended, which could trigger termination provisions or other financially significant exposure. Risk remains that we may be required to record additional reach-forward losses in future periods.\nApproximately 3,200 International Association of Machinists and Aerospace Workers District 837 (IAM 837) represented employees at our St. Louis area sites have been on strike since August 4, 2025. This is disrupting our St. Louis operations. Programs impacted include F/A-18, F-15, T-7A, MQ-25 and Weapons. If we are unable to successfully negotiate a new contract with IAM 837 and the strike continues for a prolonged period, our financial position, results of operations and cash flows could be materially impacted.\nResults of Operations\n(Dollars in millions)\nNine months ended September 30\nThree months ended September 30\n\nItem 2. Management’s Discussion and Analysis of Financial Condition and Results of Operations\nOn January 5, 2024, a 737-9 flight made an emergency landing after a mid-exit door plug detached in flight. Following the accident, the Federal Aviation Administration (FAA) grounded and required inspections of all 737-9 aircraft with a mid-exit door plug, which constituted the large majority of the approximately 220 737-9 aircraft in the in-service fleet. On January 24, 2024, the FAA approved an enhanced maintenance and inspection process that was required to be performed on each of the grounded 737-9 aircraft. Our 737-9 operators returned their fleets to service in the first quarter of 2024. All 737-9 aircraft in production are undergoing this same enhanced inspection process prior to delivery.\nAs a result of the accident, the FAA performed an investigation into the 737 quality control system. In the second quarter of 2024, we submitted a comprehensive safety and quality plan to the FAA to address the issues identified. As part of our plan to improve quality and safety and to address the issues identified, we slowed production rates and delayed planned production rate increases to reduce traveled work in our factory, as well as at our suppliers. We also began taking additional actions to improve safety and quality, which include investing in workforce training, simplifying plans and processes, eliminating defects, and enhancing our safety and quality culture.\nOn November 4, 2024, the International Association of Machinists and Aerospace Workers District 751 (IAM 751) voted to ratify a new contract, thereby ending the work stoppage initiated on September 13, 2024, which paused production of certain commercial aircraft models (737, 767, 777 and 777X aircraft) as well as production of commercial derivative aircraft for our Defense, Space & Security business (KC-46A Tanker and P-8A Poseidon). Production for all programs resumed in December 2024 and gradually ramped up during 2025.\nConsolidated Results of Operations and Financial Condition\nConsolidated Results of Operations\nThe following table summarizes key indicators of consolidated results of operations:\n(Dollars in millions, except per share data)\nNine months ended September 30\nThree months ended September 30\n\nContractual backlog of unfilled orders excludes purchase options, announced orders for which definitive contracts have not been executed, orders where customers have the unilateral right to terminate, and unobligated U.S. and non-U.S. government contract funding. The increase in contractual backlog of $99,749 million during the nine months ended September 30, 2025, was primarily due to a $99,438 million increase in BCA backlog. We may experience reductions to backlog and/or significant order cancellations due to various factors including delivery delays, production disruptions and delays to entry into service of the 777X, 737-7 and/or 737-10.\nUnobligated backlog includes U.S. and non-U.S. government definitive contracts for which funding has not been authorized. The increase of $14,603 million in unobligated backlog during the nine months ended September 30, 2025 was due to an increase in BDS backlog.\nAdditional Considerations\nU.S. Government Funding\nConsiderable uncertainty exists regarding how future U.S. government budget and program decisions will unfold, including the spending priorities of the Administration and Congress.\nThe Full-Year Continuing Appropriations and Extensions Act, 2025, enacted on March 15, 2025, largely continued federal funding at fiscal year 2024 appropriated levels through September 30, 2025.\nAs of October 1, 2025, funding for U.S. government departments and agencies, including the Department of War (DoW), the National Aeronautics and Space Administration (NASA), and the Department"
}