{
  "source_file": "bac-20241231.htm",
  "form_type": "10-K",
  "item1_clean": "Bank of America Corporation is a Delaware corporation, a bank holding company (BHC) and a financial holding company. When used in this report, “Bank of America,” “the Corporation,” “we,” “us” and “our” may refer to Bank of America Corporation individually, Bank of America Corporation and its subsidiaries, or certain of Bank of America Corporation’s subsidiaries or affiliates. As part of our efforts to streamline the Corporation’s organizational structure and reduce complexity and costs, the Corporation has reduced and intends to continue to reduce the number of its corporate subsidiaries, including through intercompany mergers.\nBank of America is one of the world’s largest financial institutions, serving individual consumers, small- and middle-market businesses, institutional investors, large corporations and governments with a full range of banking, investing, asset management and other financial and risk management products and services. Our principal executive offices are located in the Bank of America Corporate Center, 100 North Tryon Street, Charlotte, North Carolina 28255.\nThrough our various bank and nonbank subsidiaries throughout the U.S. and in international markets, we provide a diversified range of banking and nonbank financial services and products through four business segments:\nGlobal Wealth & Investment Management (GWIM)\n, with the remaining operations recorded in\n. Additional information related to our business segments and the products and services they provide is included in the information set forth on pages 35 through 44 of Item 7. Management’s Discussion and Analysis of Financial Condition and Results of Operations (MD&A) and\nNote 23 – Business Segment Information\nto the Consolidated Financial Statements.\nWe operate in a highly competitive environment. Our competitors include banks, thrifts, credit unions, investment banking firms, investment advisory firms, brokerage firms, investment companies, insurance companies, mortgage banking companies, credit card issuers, mutual fund companies, hedge funds, private equity firms, and e-commerce and other internet-based companies, including merchant banks and companies providing nonbank financial services. We compete with some of these competitors globally and with others on a regional or product-specific basis. We are increasingly competing with firms offering products solely over the internet and with nonfinancial companies, including firms utilizing emerging technologies, such as digital assets, rather than, or in addition to, traditional banking products.\nCompetition is based on a number of factors including, among others, customer service and convenience, the pricing, quality and range of products and services offered, lending limits, the quality and delivery of our technology and our reputation, experience and relationships in relevant markets. Our ability to continue to compete effectively also depends in large part on our ability to attract new employees and develop, retain and motivate our existing employees, while managing compensation and other costs.\nHuman Capital Resources\nBank of America has always been the bank of opportunity for our shareholders, our clients and customers, our communities and our teammates. We strive to make Bank of America a great place to work for our employees by providing access to a broad range of opportunities to achieve their professional goals and by maintaining a culture of caring for them and their families. We are a company of approximately 213,000 talented employees who represent a diverse range of experiences, skills, backgrounds and perspectives across many dimensions. We are deliberate about the many ways we seek to create an inclusive environment where everyone has the opportunity to achieve their career goals. This is core to our values, to our efforts to make the Corporation a great place to work and to delivering on Responsible Growth for our clients, customers and communities around the globe.\nOur Board and its Compensation and Human Capital Committee provide oversight of our human capital management strategies, programs, initiatives and practices. The Corporation’s senior management provides regular briefings and reporting on human capital matters to the Board and its Committees to facilitate the Board’s oversight.\n\nAt both December 31, 2024 and 2023, the Corporation employed approximately 213,000 employees, of which 78 percent were located in the U.S. None of our U.S. employees are subject to a collective bargaining agreement. Additionally, in 2024 and 2023, the Corporation’s compensation and benefits expense was $40.2 billion and $38.3 billion, or 60 percent and 58 percent, of total noninterest expense.\nThe following table provides our workforce data by gender (globally) and ethnicity (U.S. only).\nWorkforce data as of December 31, 2024\nTop Three Management Levels\nManagers at All Levels\nU.S.-based employees\nAmerican Indian/Alaskan Native\nNative Hawaiian/Other Pacific\nTalent, Inclusion and Opportunity\nThe Corporation is focused on building a strong pipeline of talent, which means finding and hiring external candidates who are committed to our purpose and have a passion for serving our clients and communities. This spans programs from entry-level hiring through more senior-level recruiting. In 2024, the Corporation hired over 18,000 teammates reflecting a wide variety of backgrounds, experiences, and perspectives so that we understand and can respond to the needs of our clients and communities.\nWe provide a variety of resources to help employees grow in their current roles and build new skills, including resources to help employees find new opportunities, re-skill and seek leadership positions. We have 11 Employee Networks with over 320,000 voluntary memberships, which provide teammates opportunities to meet new people, have an impact across multiple business lines and grow personally and professionally. They are open to all employees and participation is voluntary. In 2024, more than 12,000 employees found new roles within the Corporation, and we delivered approximately 7.6 million hours of training and development to our teammates through Bank of America Academy. Additionally, our Board oversees Chief Executive Officer and senior management succession planning, which is formally reviewed at least annually.\nAs part of our ongoing efforts to make the Corporation a great place to work, we conduct a confidential annual Employee Engagement Survey (Survey) and have done so for nearly two decades. The Survey results are reviewed by the Board and senior management and used to assist in reviewing the Corporation’s human capital strategies, programs, initiatives, and practices. In 2024, 87 percent of the Corporation’s employees participated in the Survey, and our Employee Engagement Index, an overall measure of employee satisfaction with the Corporation, was 84 percent. Our turnover among employees was stable at 8 percent in both 2024 and 2023.\nRecognizing and Rewarding Performance\nOur compensation philosophy is to pay for performance over the long term, as well as on an annual basis. Our performance considerations encompass both financial and nonfinancial measures, including the manner in which results are achieved. These considerations are designed to reinforce and promote Responsible Growth and align with our Risk Framework.\nWe strive to pay our employees based on market rates for their roles, experience and how they perform. We regularly benchmark against other companies both within and outside our industry to confirm our pay is competitive. In 2021, the Corporation announced it would increase its minimum hourly wage for U.S. employees to $25 per hour by 2025. In October 2024, as a next step towards that goal, the Corporation increased its hourly minimum wage for U.S. employees to $24 per hour. In addition, in January 2025, for the eighth year since 2017, we announced that we recognized our teammates with Sharing Success compensation awards for their efforts during 2024. Approximately 97 percent of employees globally will receive an award in the first quarter of 2025.\nThe Corporation is committed to equal pay for equal work. We maintain robust policies and practices that reinforce our commitment, including reviews conducted by a third-party consultant with oversight from our Board and senior management.\nPhysical, Emotional, and Financial Wellness\nThe Corporation is committed to providing employees with access to leading benefits and programs that help promote their physical, emotional and financial wellness. Investments we make in our teammates are designed to help them thrive, enabling them to better deliver for our clients, communities and each other.\nIn 2024, we continued our efforts to provide affordable access to healthcare. Teammates enrolled in one of our national medical plans were able to access virtual general medical and behavioral health care at no cost. For the 12th year in a row, U.S. health insurance premiums remained unchanged for teammates earning less than $50,000.\nWe also recognize the importance of emotional wellness. Globally, teammates and members of their households can utilize our Employee Assistance Programs for 12 in-person confidential counseling sessions, and unlimited phone consultations at no cost. The Corporation also offers comprehensive time-away policies and caregiving benefits. Globally, teammates celebrating at least 15 years of continuous service with the Corporation can participate in our paid Global Sabbatical Program.\nWe support teammates in reaching financial wellness with retirement savings plans and other programs, along with access to self-guided financial planning tools and expert advice.\nGovernment Supervision and Regulation\nThe following discussion describes, among other things, elements of an extensive regulatory framework applicable to BHCs, financial holding companies, banks and broker-dealers, including specific information about Bank of America.\nWe are subject to an extensive regulatory framework applicable to BHCs, financial holding companies and banks and other financial services entities. U.S. federal regulation of banks, BHCs and financial holding companies is intended primarily for the protection of depositors and the Deposit Insurance Fund (DIF) rather than for the protection of shareholders and creditors. As a registered financial holding company and BHC, the Corporation is subject to the supervision of, and regular inspection by, the Board of Governors of the Federal Reserve System (Federal Reserve). Our U.S. bank subsidiaries (the Banks), organized as national banking associations, are subject to regulation, supervision and examination by the Office of the Comptroller of the Currency (OCC), the Federal Deposit Insurance Corporation (FDIC) and the Federal Reserve. In addition, the Federal Reserve and the OCC have adopted guidelines that establish minimum standards for the design, implementation and board oversight of BHCs’ and national banks’ risk governance frameworks. U.S. financial holding companies, and the companies under their control, are permitted to engage in activities considered “financial in nature” as defined by the Gramm-Leach-Bliley Act and related Federal Reserve interpretations. The Corporation's status as a financial holding company is conditioned upon maintaining certain eligibility requirements for both the Corporation and its U.S. depository institution subsidiaries, including minimum capital ratios, supervisory ratings and, in the case of the depository institutions, at least satisfactory Community Reinvestment Act ratings. Failure to be an eligible financial holding company could result in the Federal Reserve limiting Bank of America's activities, including potential acquisitions. Additionally, we are subject to a significant number of laws, rules and regulations (LRRs) that govern our businesses in the U.S. and in the other jurisdictions in which we operate, including permissi",
  "item7_clean": null,
  "item2_clean": null
}