{
  "source_file": "ball-20241231x10k.htm",
  "form_type": "10-K",
  "item1_clean": "for further details.\nWe sell our aluminum packaging products globally to large multinational beverage, personal care and household products companies with which we have developed long-term relationships. This is evidenced by our high customer retention and large number of long-term supply contracts. While we have a diversified customer base, we sell a significant portion of our packaging products to major companies and brands, as well as to numerous regional customers. Our significant customers include top consumer packaging and beverage companies.\nWe are headquartered in Westminster, Colorado, and our stock is listed for trading on the New York Stock Exchange under the ticker symbol BALL.\nWe exist to unlock the infinite potential of aluminum to advance a world free from waste. By leveraging our competitive advantages of bringing our scale to sustainability, the power of our partnerships and the unmatched talent of our people we will deliver on our promise of We Care… We Work… We Win…\nWe maintain a clear and disciplined financial strategy focused on executing an efficient operating model to deliver comparable diluted earnings per share growth in excess of 10 percent per annum over the long-term, maximize cash flow, increase Economic Value Added (EVA®) dollars and return value to shareholders.\nThe cash generated by our businesses is used primarily: (1) to finance the company’s operations, (2) to service the company’s debt, (3) to return value to our shareholders via stock buybacks and dividend payments, and (4) to fund organic or inorganic growth investments. From time to time, we have evaluated and expect to continue to evaluate possible transactions that we believe will benefit the company and our shareholders, which may include strategic acquisitions, divestitures of parts of our company or equity investments. At any time, we may be engaged in discussions or negotiations at various stages of development with respect to one or more possible transactions or may have entered into non-binding letters of intent. As part of any such initiatives, we may participate in processes being run by other companies or leading our own activities. The compensation of many of our employees is tied to the company’s performance through our EVA®-based incentive programs.\nAt Ball Corporation, we deliver circular aluminum packaging solutions and exist to unlock the infinite potential of aluminum to advance a world free from waste.\nOur approach to sustainability has evolved over the past 20 years. Today, Ball’s sustainability strategy is driven by high standards around carbon footprint reduction and the circularity of our products. Utilizing strategic partnerships across our value chain, we work to simplify sustainability for our customers by delivering scalable solutions that enable us to win together. This includes aligning our own 2030 Sustainability Goals and strategy to our customers’ climate-related targets, sustainability goals and regulatory requirements.\n\nWe limit our exposure to changes in the cost of aluminum as a result of the inclusion of provisions in most of our aluminum beverage container sales contracts to pass-through aluminum price changes, as well as through the use of derivative instruments.\nBeverage Packaging, EMEA, Segment\nThe beverage packaging, EMEA, segment accounted for 29 percent of Ball’s consolidated net sales in 2024. Our EMEA region operations include 19 facilities throughout Europe and one facility each in Cairo, Egypt, and Manisa, Turkey.\nIn the third quarter of 2022, Ball completed the sale of its aluminum beverage packaging business located in Russia, which included three aluminum beverage can manufacturing facilities.\nFor the countries in which we currently operate, the aluminum beverage container market is approximately 93 billion containers, and we are the largest producer with an estimated 39 percent of shipments in this region. The markets served by our beverage packaging, EMEA, segment, including Egypt and Turkey, are highly regional in terms of sales growth rates and packaging mix. Four companies manufacture substantially all of the metal beverage containers in EMEA. Our EMEA beverage facilities, shipped 36 billion aluminum beverage containers in 2024.\nHistorically, sales volumes of metal beverage containers in EMEA tend to be highest during the period from May through August, with a smaller increase in demand leading up to the winter holiday season in the U.K. Much like in other parts of the world, the aluminum beverage container competes aggressively with other packaging materials used by the beer and carbonated soft drink industries. The glass bottle is heavily utilized in the packaged beer industry, while the PET container is utilized in the carbonated soft drink, beer, juice and water industries. These trends are evolving, however, as customers, regulators and non-governmental organizations continue to press for more sustainable packaging in the wake of the global pollution crisis. More and more brands are choosing aluminum beverage packaging because of its closed-loop recyclability and other sustainability credentials. Using a new calculation implemented by the European Union (EU) in 2022, the overall recycling rate for aluminum beverage cans in the EU, U.K., Switzerland, Norway and Iceland was approximately 75 percent in 2022.\nRaw material supply contracts in this region generally have longer term agreements. Five global aluminum suppliers provide almost all of our aluminum can and end sheet requirements. The company minimizes its exchange rate risk using derivative and supply contracts in local currencies. We limit our exposure to changes in the cost of aluminum as a result of the inclusion of provisions in most of our aluminum beverage container sales contracts to pass-through aluminum price changes, as well as through the use of derivative instruments.\nBeverage Packaging, South America, Segment\nThe beverage packaging, South America, segment accounted for 17 percent of Ball’s consolidated net sales in 2024. Our operations consist of 12 facilities—9 in Brazil and one each in Argentina, Chile and Paraguay. For the countries where we operate, the South American aluminum beverage container market is approximately 43 billion containers, and we are the largest producer in this region with an estimated 45 percent of South American shipments in 2024. Four companies currently manufacture substantially all of the aluminum beverage containers in the regions served by our beverage packaging, South America, segment. The company’s South American beverage facilities shipped approximately 19 billion aluminum beverage containers in 2024.\nHistorically, sales volumes of beverage containers in South America tend to be highest during the period from September through December. In South America, two global suppliers provide virtually all our aluminum can and end sheet requirements with certain requirements also being imported from Asia.\nWe limit our exposure to changes in the cost of aluminum as a result of the inclusion of provisions in most of our aluminum beverage container sales contracts to pass-through aluminum price changes, as well as through the use of derivative instruments.\n\nWe focus our sustainability efforts on environmental, social and governance impacts. Our vision is to advance sustainability through aluminum packaging. This is exhibited through our commitment to achieve a science-based 55 percent reduction in our greenhouse gas (GHG) footprint by 2030 and net zero carbon emissions prior to 2050. In addition, Ball is committed to hiring, training and retaining a highly qualified and high-performing employee population to work in our manufacturing facilities and offices, and we do so with the intention of having a skilled and engaged workforce.\nOur innovation and manufacturing teams around the world focus on continuously driving operational excellence in support of Ball’s resource efficiency goals. This drives process optimization, including products designed for optimum metal efficiency, real time monitoring to improve energy efficiency and reuse of water, as well as the reduction of waste and spoilage within our manufacturing plants. Our commitment extends beyond our walls and includes purchasing aluminum from Aluminum Stewardship Initiative (ASI) certified sustainable sources and reducing value chain emissions, all in order to facilitate the achievement of Ball and its customers’ sustainability targets.\nToday’s consumers are increasingly choosing brands based on their sustainability credentials. Ball customers understand this growing priority and their unique position in impacting the environment, especially through the packaging materials they use. In addition, with growing packaging design regulations around the world, aluminum cans are well positioned to incur low compliance costs due to circularity credentials, such as favorable recycling rates and recycled content. As of 2023, Ball beverage cans contained 70 percent recycled content on average globally. Aluminum packaging unlocks the full potential of packaging to help customers convey their purpose to consumers, while limiting regulatory exposure. We are committed to moving toward a truly circular economy, where materials can be, and actually are, used again and again.\nAluminum cans, bottles and cups are an attractive option for sustainability-conscious brands with commitments to real world recyclability and increasing their usage of recycled materials in consumer packaging. Aluminum containers are designed to be recycled without losing quality and retain a high economic value, pushing aluminum collection, sorting and recycling rates to the highest of any beverage packaging material. That is why 75 percent of all aluminum ever produced is still in use today.\nAt a global 71 percent recycling rate with low yield losses and high product-to-product recycling loops, aluminum beverage packaging is the leader not only in recycling, but in circularity. Because recycling aluminum saves resources and uses significantly less energy than primary aluminum production, we are innovating and collaborating with our customers, supply chain, industry groups and other public and private partners to establish and financially support initiatives to increase recycling rates around the world. We work together to create effective collection and recycling systems, and educate consumers about the sustainability and circularity benefits of aluminum packaging.\nAt Ball, we believe our people and our culture enable our success and make it possible for us to deliver on our promises to customers, investors, communities and all of our stakeholders. We are working hard to create a culture and environment in which zero injuries become the reality, so everyone working for or within Ball gets home safe and healthy to their families and friends every day. We continue to invest in hiring, training and retaining our employees at every level across the organization to ensure we have the right people with the right skills in the right roles, and are providing them with opportunities to advance their careers. This includes a global Belonging, Inclusion and Diversity (BI&D) strategy, which ensures we have a sustainable workforce, and foster a safe and inclusive work environment where everyone feels they belong and are valued for their differences and contributions. A focus on BI&D among individuals and teams helps to unleash ideas and fuel innovation, driving growth and economic value throughout our global organization.\nA healthy and sustainable business also depends on thriving communities. Ball’s commitment to the communities where we live and operate is an integral part of our corporate culture, as we continue to support organizations, programs and civic initiatives that advance sustainable livelihoods. Community engagement is how our company and our employees enrich the places where we live and work beyond providing jobs, benefit",
  "item7_clean": null,
  "item2_clean": null
}