{
  "source_file": "ball-20250930x10q.htm",
  "form_type": "10-Q",
  "item1_clean": null,
  "item7_clean": null,
  "item2_clean": "Item 2. MANAGEMENT’S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND\nRESULTS OF OPERATIONS\nManagement’s discussion and analysis should be read in conjunction with the unaudited condensed consolidated financial statements (consolidated financial statements) and accompanying notes included in\nOVERVIEW\nBusiness Overview and Industry Trends\nBall Corporation is one of the world’s leading aluminum packaging suppliers. With a growth mindset and by pursuing operational excellence, we lean on our competitive strengths to reach our financial goals. We are focused on maintaining our strong financial position by listening to and partnering with our global customers, delivering operational efficiencies and an innovative product portfolio from our best-in-class manufacturing facilities and returning value to shareholders via share repurchases and dividends. In the aluminum packaging industry, sales and earnings can be increased by reducing costs, increasing prices, developing new products, expanding volume and making strategic acquisitions.\nWe sell our aluminum packaging products mainly to large, multinational beverage, personal care and household products companies with which we have developed long-term relationships. This is evidenced by our high customer retention and our large number of long-term supply contracts. While we have a diversified customer base, we sell a significant portion of our packaging products to major companies and brands, as well as to numerous regional customers. The overall global aluminum packaging industry is growing and is expected to continue to grow in the medium to long term.\nWe purchase our raw materials from relatively few suppliers. We also have exposure to inflation, in particular the rising costs of raw materials, as well as other direct cost inputs. We mitigate our exposure to the changes in the costs of aluminum through the inclusion of provisions in contracts covering the majority of our volume to pass-through aluminum price changes, as well as through the use of derivative instruments. The pass-through provisions generally result in proportional increases or decreases in sales and costs with a greatly reduced impact, if any, on net earnings; however, there may be timing differences of when the costs are passed through. Because of our customer and supplier concentration, our business, financial condition and results of operations could be adversely affected by the loss, insolvency or bankruptcy of a major customer or supplier or a change in a supply agreement with a major customer or supplier, although our contract provisions generally mitigate the risk of customer loss, and our long-term relationships represent a known, stable customer base.\nFrom time to time, we have evaluated and expect to continue to evaluate possible transactions that we believe will benefit the company and our shareholders, which may include strategic acquisitions, divestitures of parts of our company or equity investments. At any time, we may be engaged in discussions or negotiations at various stages of development with respect to one or more possible transactions or may have entered into non-binding letters of intent. As part of any such initiatives, we may participate in processes being run by other companies or leading our own activities.\nRESULTS OF CONSOLIDATED OPERATIONS\nManagement’s discussion and analysis for our results of operations on a consolidated and segment basis include a quantification of factors that had a material impact. Other factors that did not have a material impact, but that are significant to understand the results, are qualitatively described.\n\nInterest income was $8 million and $14 million for the three months ended September 30, 2025 and 2024, respectively, and $20 million and $58 million for the nine months ended September 30, 2025 and 2024, respectively. The decreases in interest income for the three and nine months ended September 30, 2025, were primarily due to the higher amount of cash on hand in 2024 from the sale of the aerospace business.\nInterest expense was $85 million and $67 million for the three months ended September 30, 2025 and 2024, respectively, and $236 million and $228 million for the nine months ended September 30, 2025 and 2024, respectively. Interest expense as a percentage of average borrowings was 4.6 percent for the three months ended September 30, 2025 and 2024, and decreased approximately 40 basis points from 4.9 percent for the nine months ended September 30, 2024, to 4.5 percent for the nine months ended September 30, 2025. The interest expense increase for the three months ended September 30, 2025, was primarily driven by an increase of $18 million from a higher amount of weighted average principal outstanding during the quarter. The interest expense increase for the nine months ended September 30, 2025, was primarily driven by an increase of $29 million from a higher amount of weighted average principal outstanding during the year, partially offset by a decrease of $21 million from lower weighted average interest rates on outstanding debt during the year.\nThe effective tax rate for the three and nine months ended September 30, 2025, was 19.4 percent and 21.4 percent, respectively, compared to 18.5 percent and 22.3 percent for the same periods in 2024. The increase of 0.9 percentage points for the three months ended September 30, 2025 was primarily due to lower state and local tax credits, partially\n\nComparable operating earnings\nComparable operating earnings as a % of segment net sales\nBall permanently ceased production at its aluminum beverage can manufacturing facility in Kent, Washington, in the first quarter of 2024 and acquired an aluminum beverage can manufacturing facility in Winter Haven, Florida, in the first quarter of 2025 as part of its acquisition of Florida Can Manufacturing. See\nfor further details on the acquisition.\nSegment sales for the three and nine months ended September 30, 2025, were $182 million and $386 million higher, respectively, compared to the same periods in 2024. The increase for the three months ended September 30, 2025, was primarily due to increases of $106 million from price/mix, mainly from higher aluminum prices, and $76 million from higher volume. The increase for the nine months ended September 30, 2025, was primarily due to increases of $205 million from price/mix, mainly from higher aluminum prices, and $180 million from higher volume.\nComparable operating earnings for the three and nine months ended September 30, 2025, were $7 million and $8 million higher, respectively, compared to the same periods in 2024. The increase for the three months ended September 30, 2025, was primarily due to an increase of $29 million from higher volume, partially offset by $11 million from price/mix. The increase for the nine months ended September 30, 2025, was primarily due to an increase of $57 million from higher volume, partially offset by a decrease of $34 million from price/mix.\nBeverage Packaging, EMEA\nThree Months Ended September 30,\nNine Months Ended September 30,\n\nCash flows provided by (used in) operating activities\nCash flows provided by (used in) investing activities\nCash flows provided by (used in) financing activities\nCash flows from the historical aerospace reportable segment are presented within each cash flow statement category in the consolidated statement of cash flows for the nine months ended September 30, 2024. Depreciation and amortization, capital expenditures and significant operating and investing noncash items of the aerospace discontinued operation are presented in\nCash flows provided by operating activities were $51 million in 2025, primarily driven by earnings from continuing operations of $715 million and a reconciling adjustment to operating cash flows of $463 million for depreciation and amortization, partially offset by working capital outflows of $909 million. On February 16, 2024, the company completed the sale of the aerospace business. We currently estimate a total cash tax of $840 million for the sale of the aerospace business, of which $766 million was paid in 2024 and $60 million was paid through the third quarter of 2025. The remaining amount is expected to be paid in 2025. See\nfor further details. In a dynamic economic environment, payment terms with our customers and vendors become a more important element of total mix of information used to negotiate our contract terms. At September 30, 2025, a change of one day in days sales outstanding will impact cash flows provided by (used in) operating activities by $38 million, a change of one day in days payable outstanding will impact cash flows provided by (used in) operating activities by $30 million and a change of one day in days inventory on hand will impact cash flows provided by (used in) operating activities by $30 million.\nCash flows used in investing activities were $574 million in 2025, primarily driven by capital expenditures of $304 million, $160 million of cash consideration used for the acquisition of Florida Can Manufacturing and $89 million of derivative settlements. See\nfor further details on the acquisition.\nCash flows provided by financing activities were $140 million in 2025, primarily driven by a net inflow from long-term and short-term borrowings of $1.43 billion, primarily driven by the issuance of $750 million of 5.50% senior notes due in 2033 and €850 million of 4.25% senior notes due in 2032, partially offset by repurchases of common stock of $1.11 billion and dividends of $166 million. See\nfor further details on the company’s borrowings and additional amounts available.\nWe have entered into several regional accounts receivable factoring programs with various financial institutions for certain of our accounts receivable. The programs are accounted for as true sales of the receivables, with limited recourse to Ball, and had combined limits of approximately $1.79 billion and $1.60 billion at September 30, 2025, "
}