{
  "source_file": "bax-20241231.htm",
  "form_type": "10-K",
  "item1_clean": "The recent Kidney Care sale has given us enhanced flexibility to deploy (or in some cases redeploy) capital toward opportunities that seek to accelerate our growth objectives,\nwhether as a result of innovation or expanding our portfolio geographically or as a result of channel expansion or market development activities.\nOperational Excellence\nAs discussed above under “Recent Strategic Actions,” in the third quarter of 2023, we implemented a new operating model intended to simplify and streamline our operations and better align our manufacturing and supply chain to our commercial activities. We believe these changes will allow us to be a more integrated and nimble organization that can respond more effectively to operational challenges and changes in the macroeconomic environment while enhancing our ability to drive innovation in our product portfolio. We also continue to focus on increasing efficiencies through automation and digitization. We intend to continue to actively manage our cost structure and strive to commit resources to the highest value uses. Such high value activities include supporting innovation, actively managing the portfolio, expanding patient access and accelerating growth for our stockholders.\nMaintaining Disciplined and Balanced Capital Allocation\nSubject to market conditions and our investment grade targets, our capital allocation strategies currently include the following:\ndebt repayments to support our deleveraging commitments;\nactive portfolio management through the identification of attractive acquisition and divestiture transactions, including the recent divestitures of our BPS and Kidney Care businesses; and\nreturning capital to stockholders through dividends, while balancing any returns with other strategic actions we take. We also intend to reinstate share repurchases over the longer term.\nWe paid down $3.65 billion of net debt during 2024 and through February 21, 2025 using proceeds from the sales of our BPS and Kidney Care businesses, and we are committed to retaining our investment grade rating, including taking actions toward achieving a net leverage target of approximately 3.0x by the end of 2025 through ongoing debt repayment and financing activities. During this deleveraging period, we currently intend to continue paying a dividend (which we reduced in November 2024), not make any share repurchases and be highly selective with respect to any potential acquisitions.\nSales and Distribution\nWe have our own direct sales force and also make sales to and through independent distributors, drug wholesalers acting as sales agents and specialty pharmacy or other alternate site providers. In the United States, third parties, such as Cardinal Health, Inc., warehouse and ship a significant portion of our products through their distribution centers. These centers are generally stocked with adequate inventories to facilitate prompt customer service. Sales and distribution methods include frequent contact by sales and customer service representatives, automated communications via various electronic purchasing systems, circulation of catalogs and merchandising bulletins, direct-mail campaigns, trade publication presence and advertising.\nSales are made and products are distributed on a direct basis or through independent distributors or sales agents in more than 100 countries as of December 31, 2024, giving effect to the sale of our Kidney Care business.\nInternational Operations\nContractual Arrangements\nOur products are sold through contracts with customers, both within and outside the United States. Some of these contracts have terms of more than one year and place limits on our ability to increase prices. In the case of hospitals, governments and other facilities, these contracts may specify minimum quantities of a particular product or categories of products to be purchased by the customer.\nIn keeping with the increased emphasis on cost-effectiveness in healthcare delivery, many hospitals and other customers of medical products in the United States have joined group purchasing organizations (GPOs), or formed integrated delivery networks (IDNs), to enhance purchasing power. GPOs and IDNs negotiate pricing arrangements with manufacturers and distributors and the negotiated prices are made available to members. We have purchasing agreements with several of the major GPOs in the United States, which are subject to renewal from time to time. GPOs may have agreements with more than one supplier for certain products. Accordingly, in these cases, we face competition from other suppliers even where a customer is a member of a GPO under contract with us, which may constrain our ability to secure negotiated price increases. Purchasing power is similarly consolidated in many other countries. For example, public contracting authorities often act as the purchasing entities for the hospitals and other customers of medical products in their region and many hospitals and other customers have joined joint procurement entities and buying consortia. The result is that demand for healthcare products is increasingly concentrated across our markets globally. Additionally, our contractual pricing arrangements with GPOs, IDNs and public contracting authorities can sometimes limit our ability to increase prices in order to offset raw materials or component price increases or otherwise. Some of these agreements contain failure to supply clauses with varying remedies, inclusive of limited termination rights.\nRaw Materials and Component Parts\nRaw materials and component parts essential to our business are purchased from numerous suppliers worldwide in the ordinary course of business. While many of these materials are generally available, we have experienced and may in the future experience shortages of supply. Additionally, certain of these materials are secured from single source suppliers or on a spot basis and not pursuant to a contractual arrangement.\nWe are not always able to recover cost increases for raw materials and component parts through customer pricing due to contractual limits, where applicable, and market forces. For example, during 2022 and 2023, our profit margins were adversely impacted because we were unable to fully offset all related cost increases resulting from the high inflationary environment through customer pricing adjustments or other pricing actions. Additionally, our profit margins were negatively impacted in the fourth quarter of 2024 (and may continue to be negatively impacted in the short term) because we were unable to fully offset the increased supply chain costs associated with our ongoing North Cove recovery efforts (including as a result of importing additional product from outside the United States to support IV solutions demand). We seek to utilize long-term supply contracts with some suppliers to help maintain continuity of supply and manage the risk of price increases. Our ability to do so in the face of limited supply of certain raw materials and component parts and inflationary environment has been and may in the future be limited.\nCompetition and Healthcare Cost Containment\nOur businesses benefit from a number of competitive advantages, including the breadth and depth of our product offerings and our strong relationships with customers, including hospitals and clinics, GPOs, IDNs, physicians and patients, many of whom self-administer home-based therapies that we supply. We also benefit from efficiencies and cost advantages resulting from shared manufacturing facilities and the technological advantages of our products.\nAlthough no single company competes with us in all of our businesses, we face substantial competition in each of our segments from international and domestic healthcare, medical products and pharmaceutical companies and providers of all sizes, and these competitors often differ across our businesses. In addition, global and regional competitors continue to expand their manufacturing capacity and sales and marketing channels. We believe customer purchasing decisions are primarily focused on cost-effectiveness, price, service, product performance and technological innovation. There has been consolidation in our customer base and by our competitors, which has resulted and continues to result in pricing and market pressures.\nIntellectual Property\nPatents and other proprietary rights are essential to our business. We rely on patents, trademarks, copyrights, trade secrets, know-how and confidentiality agreements to develop, maintain and strengthen our competitive position. We own numerous patents and trademarks throughout the world and have entered into license arrangements relating to various third-party patents and technologies. Products manufactured by us are sold primarily under our own trademarks and trade names. Some products distributed by us are sold under our trade names, while others are sold under trade names owned by our suppliers or partners. Trade secret protection of unpatented confidential and proprietary information is also important to us. We maintain certain details about our processes, products and technology as trade secrets and generally require employees, consultants, and business partners to enter into confidentiality agreements. These agreements may be breached and we may not have adequate remedies for any breach. In addition, our trade secrets may otherwise become known or be independently discovered by competitors. To the extent that our employees, consultants, and business partners use intellectual property owned by others in their work for us, disputes may arise as to the rights in related or resulting know-how and inventions.\nOur policy is to protect our products and technology through patents and trademarks on a worldwide basis. This protection is sought in a manner that balances the cost of such protection against obtaining the greatest value for us. We also recognize the need to promote the enforcement of our patents and trademarks and take commercially reasonable steps to enforce our patents and trademarks around the world against potential infringers, including judicial or administrative action where appropriate.\nResearch and Development\nWe believe our investment in research and development (R&D), consistent with our portfolio optimization and capital allocation strategies, will help fuel our future growth and our ability to remain competitive. Accordingly, we continue to focus our investment on select R&D programs to enhance future growth through clinical differentiation. Expenditures for our R&D activities were $590 million in 2024, $518 million in 2023, and $450 million in 2022. These expenditures include costs associated with R&D activities performed at our R&D centers located around the world, which include facilities in Belgium, India, Italy, Malta and the United States, as well as in-licensing, milestone and reimbursement payments made to partners for R&D work performed at non-Baxter locations. As discussed above in under \"Recent Strategic Actions,\" in the third quarter of 2023, we implemented a new operating model intended to simplify and streamline our operations, including with respect to our R&D activities. We are also working to create a more resilient supply chain and better align our manufacturing footprint and supply chain to our commercial activities. These activities may result in the consolidation of one or more R&D facilities.\nOur continued success depends upon the quality of our products. Quality management plays an essential role in determining and meeting customer requirements, helping to prevent defects, facilitating continuing improvement of our processes, products and services, and helping to assure the safety and efficacy of our products. Our quality system enables the design, development, manufacturing, packaging, sterilization, handling, distribution and labeling of our products to help ensure that they conform to customer requirements. In order to consistently ",
  "item7_clean": "Emerging markets include sales from our operations in Eastern Europe, the Middle East, Africa, Latin America and Asia (except for Japan).\nRest of world includes sales from our operations in Western Europe, Canada, Japan, Australia and New Zealand.\nPercent change in net sales at constant currency rates is a non-GAAP financial measure. See the section entitled “Non-GAAP Financial Measures” for additional information about our use of that measure.\nAs set forth above, foreign currency had no material impact on net sales during the year ended December 31, 2024, as compared to the prior year period, primarily due to the strengthening of the U.S. Dollar relative to the Turkish Lira, Japanese Yen, Brazilian Real, Mexican Peso, and the Canadian Dollar, offset by the weakening of the U.S. Dollar relative to the British Pound and Colombian Peso. Foreign currency had no material impact on net sales during the year ended December 31, 2023, as compared to the prior year period, primarily due to the strengthening of the U.S. Dollar relative to the Euro, Turkish Lira, Australian Dollar, Japanese Yen and Chinese Renminbi offset by the weakening of the U.S. Dollar relative to the Mexican Peso and Brazilian Real.\nNET SALES BY SEGMENT\nMedical Products & Therapies\nOur Medical Products & Therapies segment includes sales of our sterile IV solutions, infusion systems, administration sets, parenteral nutrition therapies and surgical hemostat, sealant and adhesion prevention products.\nyears ended December 31 (in millions)\nInfusion Therapies & Technologies\nTotal Medical Product & Therapies net sales\nPercent change in net sales at constant currency rates is a non-GAAP financial measure. See the section entitled “Non-GAAP Financial Measures” for additional information about our use of that measure.\nMedical Product & Therapies segment net sales increased 4% for the year ended December 31, 2024, as compared to the prior year period.\nInfusion Therapies & Technologies net sales increased 4% for the year ended December 31, 2024, as compared to the prior year period. Sales performance in 2024 primarily reflected growth in Infusion Systems as a result of sales of our Novum IQ large volume infusion and syringe pump in the U.S., and sales of Nutrition product offerings, which was attributable to both pricing initiatives and increased sales volume. In September 2024, Hurricane Helene, which brought significant rain and extensive flooding to Western North Carolina, caused damage to certain of our assets at our North Cove facility in Marion, N.C. and disrupted operations at that facility. This facility, which manufactures IV Solutions primarily for the U.S. market, was not fully operational for most of the fourth quarter. As a consequence, Hurricane Helene had an estimated $110 million adverse impact on sales, which offset price and underlying volume gains during the year.\nAdvanced Surgery net sales increased 5% for the year ended December 31, 2024, as compared to the prior year period, driven by growth in hemostats and sealants and was primarily attributable to increased sales volume. Foreign currency exchange rates adversely impacted net sales by 1% for the year ended December 31, 2024, as compared to the prior year period.\nyears ended December 31 (in millions)\nInfusion Therapies & Technologies\nTotal Medical Product & Therapies net sales\nPercent change in net sales at constant currency rates is a non-GAAP financial measure. See the section entitled “Non-GAAP Financial Measures” for additional information about our use of that measure.\nMedical Product & Therapies segment net sales increased 4% for the year ended December 31, 2023, as compared to the prior year period.\nInfusion Therapies & Technologies net sales increased 4% for the year ended December 31, 2023, as compared to the prior year period. Sales performance in 2023 reflected strong demand for our infusion systems and\nadministration sets, as well as growth in IV solutions and international nutrition compounding, partially offset by lower sales of parenteral nutrition products in the U.S. as compared to the prior year.\nAdvanced Surgery net sales increased 5% for the year ended December 31, 2023, as compared to the prior year period, driven by continued recovery in surgical procedures, partially offset by temporary supply constraints, the exit of a product distribution arrangement and a comparison against prior year periods that benefited from competitor supply constraints. Foreign currency exchange rates adversely impacted net sales by 1% for the year ended December 31, 2023, as compared to the prior year period.\nHealthcare Systems & Technologies\nOur Healthcare Systems & Technologies segment includes sales of our connected care solutions and collaboration tools, including smart bed systems, patient monitoring systems and diagnostic technologies, respiratory health devices and advanced equipment for the surgical space, including surgical video technologies, precision positioning devices and other accessories.\nyears ended December 31 (in millions)\nCare and Connectivity Solutions\nTotal Healthcare Systems & Technologies net sales\nPercent change in net sales at constant currency rates is a non-GAAP financial measure. See the section entitled “Non-GAAP Financial Measures” for additional information about our use of that measure.\nHealthcare Systems & Technologies segment net sales decreased 2% for the year ended December 31, 2024, as compared to the prior year period.\nCare and Connectivity Solutions net sales increased 1% for the year ended December 31, 2024, driven by increased order volume associated with capital spending in the U.S. as compared to the prior year, partially offset by declines in care communication products driven by the shifting of installations to future periods and lower sales outside of the U.S.\nFront Line Care net sales decreased 6% for the year ended December 31, 2024, as compared to the prior year period, primarily driven by a backlog reduction in the prior year period which increased sales in the prior year, reduced demand in the primary care market, lower government orders, certain product exits and select supply constraints impacting product availability. These declines were partially offset by growth in our cardiology products.\nyears ended December 31 (in millions)\nCare and Connectivity Solutions\nTotal Healthcare Systems & Technologies net sales\nPercent change in net sales at constant currency rates is a non-GAAP financial measure. See the section entitled “Non-GAAP Financial Measures” for additional information about our use of that measure.\nHealthcare Systems & Technologies segment net sales increased 3% for the year ended December 31, 2023, as compared to the prior year period.\nCare and Connectivity Solutions net sales increased 1% for the year ended December 31, 2023, as compared to the prior year period, driven by international demand and sales generated from recent product launches in the U.S., partially offset by lower rental revenues and lower capital spending in the U.S. reflecting the macroeconomic environment in 2023.\nFront Line Care net sales increased 6% for the year ended December 31, 2023, as compared to the prior year period, primarily driven by increased demand for our cardiology products, patient monitoring systems and physical assessment tools. Performance in the current year benefited from backlog reductions due to improved availability of component parts used in certain of our products.\nOur Pharmaceuticals segment includes sales of specialty injectable pharmaceuticals, inhaled anesthetics and drug compounding services.\nyears ended December 31 (in millions)\nInjectables and Anesthesia\nTotal Pharmaceuticals net sales\nPercent change in net sales at constant currency rates is a non-GAAP financial measure. See the section entitled “Non-GAAP Financial Measures” for additional information about our use of that measure.\nPharmaceuticals segment net sales increased 7% for the year ended December 31, 2024, as compared to the prior year period.\nInjectables and Anesthesia net sales increased 2% for the year ended December 31, 2024, as compared to the prior year period, primarily due to growth in our U.S. specialty injectable products, driven by strong sales volume in our core portfolio and recent product launches, partially offset by declines for inhaled anesthetics. Foreign currency exchange rates adversely impacted net sales by 1% for the year ended December 31, 2024, as compared to the prior year period.\nDrug Compounding net sales increased 15% for the year ended December 31, 2024, as compared to the prior year period, driven by increased demand for our international pharmacy compounding offerings, due in part, to customer capacity constraints that resulted in increased outsourcing of compounding activities.\nyears ended December 31 (in millions)\nInjectables and Anesthesia\nTotal Pharmaceuticals net sales\nPercent change in net sales at constant currency rates is a non-GAAP financial measure. See the section entitled “Non-GAAP Financial Measures” for additional information about our use of that measure.\nPharmaceuticals segment net sales increased 6% for the year ended December 31, 2023, as compared to the prior year period.\nInjectables and Anesthesia net sales increased 3% for the year ended December 31, 2023, as compared to the prior year period, primarily due to growth in our U.S. injectable products, driven by our launches of Zosyn, following the transfer of the related product rights to us in April 2023, Bendamustine and Norepinephrine, partially offset by lower sales of inhaled anesthesia products. Foreign currency exchange rates adversely impacted net sales by 1% for the year ended December 31, 2023, as compared to the prior year period.\nDrug Compounding net sales increased 10% for the year ended December 31, 2023, as compared to the prior year period, driven by increased demand for our international pharmacy compounding services. Foreign currency exchange rates adversely impacted net sales by 2% for the year ended December 31, 2023, as compared to the prior year period.\nDuring the years ended December 31, 2024, 2023 and 2022, we earned $67 million, $87 million and $177 million, respectively, of revenues that were not attributable to our reportable segments. In the current and prior year periods, Other sales primarily represent revenues earned by certain of our manufacturing facilities from contract manufacturing activities. The years ended December 31, 2023 and 2022 also included royalty income under a business development arrangement. The decrease in Other sales for the year ended December 31, 2024 as compared to the prior year period reflects lower contract manufacturing volume. The decrease for the year ended December 31, 2023 as compared to the prior year period was primarily driven by lower contract manufacturing\nvolume and, to a lessor extent, termination of the royalty arrangement following our acquisition of the rights to the underlying product.\nManagement believes that providing the separate impact of the following items on our results in accordance with U.S. GAAP may provide a more complete understanding of our operations and can facilitate a fuller analysis of our results of operations, particularly in evaluating performance from one period to another. Intangible asset amortization expense is identified as a special item to facilitate an evaluation of current and past operating performance and is consistent with how management and our Board of Directors assess performance. Additional special items are identified because they are highly variable, difficult to predict and of a size that may substantially impact our reported results of operations for the period.\nThe following table provides a summary of our special items and the related impact by line item on our consolidated results of operations for 2024, 2023 and 2022.\nyears ended December 31 (in millions)\nIntangible asset amortization expense\nLong-lived asset impairments\nBusiness optimization items\nProduct related items\nAcquisition and integration items\nEuropean medical devices regulation\nHurricane Helene costs\nImpact on Gross Margin Ratio\nSelling, General and Administrative (SG&A) Expenses\nIntangible asset amortization expense\nBusiness optimization items\nAcquisition and integration items\nImpact on SG&A Expense Ratio\nBusiness optimization items\nLong-lived asset impairments\nImpact on R&D Expense Ratio\nGoodwill Impairments\nGoodwill impairments\nOther Operating Expense (Income), Net\nAcquisition and integration items\nLoss on product divestiture arrangement\nLoss on subsidiary liquidation\nOther (Income) Expense, Net\nReclassification of cumulative translation loss to earnings\nInvestment impairments\nIncome Tax Expense (Benefit)\nTax effects of special items\nImpact on Effective Tax Rate\nOur results in 2024 included charges of $15 million, comprised of (i) $12 million related to warranty and remediation activities arising from field corrective actions on Healthcare Systems & Technologies products and (ii) $3 million related to a revised estimate of warranty and remediation activities arising from a field corrective action on certain of our infusion pumps initially recorded in 2022. Our results in 2022 included charges of $44 million related to warranty and remediation activities arising from two field corrective actions on certain of our infusion pumps.\nOur results in 2024, 2023 and 2022 included $33 million, $41 million and $42 million, respectively, of incremental costs to comply with the European Union's medical device regulations for previously registered products, which primarily consist of contractor costs and other direct third-party costs. We consider the adoption of these regulations to be a significant one-time regulatory charge and believe that the costs of initial compliance for previously registered products over the implementation period are not indicative of our core operating results.\nOur results in 2024 included charges of $17 million related to environmental reserves for remediation actions associated with historic operations at certain of our facilities. Our results in 2023 included $7 million of net costs from certain legal matters. These costs included $13 million, including related legal fees, related to matters involving alleged violations of the False Claims Act related to a now-discontinued legacy Hillrom sales line and alleged injury from environmental exposure, partially offset by $6 million of proceeds received, net of related legal fees, from a settlement related to an intellectual property dispute.\nOur results in 2022 included a loss of $21 million related to our deconsolidation of a foreign subsidiary, including the derecognition of a related noncontrolling interest, upon its liquidation in December 2022 that was completed in connection with our legal entity rationalization activities.\nOur results in 2022 included a charge of $65 million for cumulative translation adjustments (CTA) reclassified from accumulated other comprehensive income (loss) as a result of the substantial liquidation of our operations in Argentina.\nOur results in 2023 included $31 million of net pre-tax losses from non-marketable investments in several early-stage companies, consisting of $34 million of noncash impairment write-downs, partially offset by a $3 million gain from the sale of an investment.\nOur results in 2024 included a $80 million net income tax expense consisting of a $28 million valuation allowance recorded to reduce the carrying amount of tax attribute carryforwards in the U.S., $22 million of net income tax costs on internal reorganization transactions related to the sale of our Kidney Care segment, a $17 million income tax expense related to legislative changes under Internal Revenue Code of 1986 (IRC) Section 987 (which is the exchange gain or loss on foreign branch remittances in the U.S., effective in 2024), and a $13 million net revaluation of the Swiss basis step-",
  "item2_clean": null
}