{
  "source_file": "bby-20250802.htm",
  "form_type": "10-Q",
  "item1_clean": null,
  "item7_clean": null,
  "item2_clean": "Item 2. Management's Discussion and Analysis of Financial Condition and Results of Operations\nUnless the context otherwise requires, the use of the terms “Best Buy,” “we,” “us” and “our” refers to Best Buy Co., Inc. and its consolidated subsidiaries. Any references to our website addresses do not constitute incorporation by reference of the information contained on the websites.\n), as well as our other reports on Forms 10-Q and 8-K and other publicly available information. All amounts herein are unaudited.\nWe are driven by our purpose to enrich lives through technology and our vision to personalize and humanize technology solutions for every stage of life. We accomplish this by leveraging our combination of tech expertise and a human touch to meet our customers’ everyday needs, whether they come to us online, visit our stores or invite us into their homes.\nWe have two reportable segments: Domestic and International. The Domestic segment is comprised of our operations in all states, districts and territories of the U.S. and our Best Buy Health business. The International segment is comprised of all our operations in Canada.\nOur fiscal year ends on the Saturday nearest the end of January. Our business, like that of many retailers, is seasonal. A large proportion of our revenue and earnings is generated in the fiscal fourth quarter, which includes the majority of the holiday shopping season.\nThroughout this MD&A, we refer to comparable sales. Comparable sales is a metric used by management to evaluate the performance of our existing stores, websites and call centers by measuring the change in net sales for a particular period over the comparable prior period of equivalent length. Comparable sales includes revenue from stores, websites and call centers operating for at least 14 full months. Revenue from online sales is included in comparable sales and represents sales initiated on a website or app, regardless of whether customers choose to pick up product in store, curbside, at an alternative pick-up location or take delivery direct to their homes. Revenue from acquisitions is included in comparable sales beginning with the first full quarter following the first anniversary of the date of the acquisition. Comparable sales also includes credit card revenue, gift card breakage, commercial sales and sales of merchandise to wholesalers and dealers, as applicable. Revenue from stores closed more than 14 days, including but not limited to relocated, remodeled, expanded and downsized stores, or stores impacted by natural disasters, is excluded from comparable sales until at least 14 full months after reopening. Comparable sales excludes the impact of certain periodic warranty-related profit-share revenue, the effect of fluctuations in foreign currency exchange rates (applicable to our International segment only) and the impact of the 53\nweek (applicable in 53-week fiscal years only). Comparable sales is based on our fiscal calendar and is not adjusted to align calendar weeks. All periods presented apply this methodology consistently.\nConsistent with our comparable sales policy, revenue from Best Buy Express locations rebranded as a result of our previously announced collaboration with Bell Canada is excluded from our comparable sales calculation until locations have been operating for at least 14 full months.\nWe believe comparable sales is a meaningful supplemental metric for investors to evaluate revenue performance resulting from growth in existing stores, websites and call centers versus the portion resulting from opening new stores or closing existing stores. The method of calculating comparable sales varies across the retail industry. As a result, our method of calculating comparable sales may not be the same as other retailers’ methods.\nNon-GAAP Financial Measures\nThis MD&A includes financial information prepared in accordance with accounting principles generally accepted in the U.S. (“GAAP”), as well as certain non-GAAP financial measures, such as consolidated adjusted operating income, consolidated adjusted operating income rate, consolidated adjusted effective tax rate and consolidated adjusted diluted earnings per share (“EPS”). We believe that non-GAAP financial measures, when reviewed in conjunction with GAAP financial measures, provide additional useful information for evaluating current period performance and assessing future performance. For these reasons, internal management reporting, including budgets, forecasts and financial targets used for short-term incentives are based on non-GAAP financial measures. Generally, our non-GAAP financial measures include adjustments for items such as restructuring charges, goodwill and acquired intangible asset impairments, price-fixing settlements, gains and losses on disposals of subsidiaries and certain investments, amortization of definite-lived intangible assets associated with acquisitions, certain acquisition-related costs and the tax effect of all such items. In addition, certain other items may be excluded from non-GAAP financial measures when we believe doing so provides greater clarity to management and our investors. We provide reconciliations of the most comparable financial measures presented in accordance with GAAP to presented non-GAAP financial measures that enable investors to understand the adjustments made in arriving at the non-GAAP financial measures and to evaluate performance using the same metrics as management. These non-GAAP financial measures should be considered in addition to, and not superior to or as a substitute for, GAAP financial measures. We strongly encourage investors and shareholders to review our financial statements and publicly filed reports in their entirety and not to rely on any single financial measure. Non-GAAP financial measures may be calculated differently from similarly titled measures used by other companies, thereby limiting their usefulness for comparative purposes.\nIn our discussions of the operating results of our consolidated business and our International segment, we sometimes refer to the impact of changes in foreign currency exchange rates or the impact of foreign currency exchange rate fluctuations, which are references to the differences between the foreign currency exchange rates we use to convert the International segment’s operating results from local currencies into U.S. dollars for reporting purposes. We also may use the term “constant currency,” which represents results adjusted to exclude foreign currency impacts. We calculate those impacts as the difference between the current period results translated using the current period currency exchange rates and using the comparable prior period currency exchange rates. We believe the disclosure of revenue changes in constant currency provides useful supplementary information to investors in light of significant fluctuations in currency rates.\nRefer to the Non-GAAP Financial Measures section below for detailed reconciliations of items impacting consolidated adjusted operating income, consolidated adjusted effective tax rate and consolidated adjusted diluted EPS in the presented periods.\nWe continue to face significant uncertainty regarding the scope, timing and magnitude of tariffs that may affect the products we sell and the consequent financial impact on our business. In conjunction with our vendors, we continue to seek to mitigate the impact of tariffs on our business and our customers.\nResults of Operations\nConsolidated Results\nSelected consolidated financial data was as follows ($ in millions, except per share amounts):\nComparable sales % change\nGross profit as a % of revenue\nSelling, general and administrative expense (\"SG&A\")\nSG&A as a % of revenue\nRestructuring charges\nOperating income as a % of revenue\nBecause retailers vary in how they record costs of operating their supply chain between cost of sales and SG&A, our gross profit rate and SG&A rate may not be comparable to other retailers’ corresponding rates. For additional information regarding costs classified in cost of sales and SG&A, refer to Note 1,\nSummary of Significant Accounting Policies\nIn the second quarter and first six months of fiscal 2026, we generated $9.4 billion and $18.2 billion in revenue, respectively, and our comparable sales grew 1.6% and 0.4%, respectively, driven by a mix of new technology innovation, our continued focus on omni-channel customer experience and strong vendor partnerships. Comparable sales increased in the second quarter of fiscal 2026, primarily from comparable sales growth in gaming, computing and mobile phones, partially offset by comparable sales declines in home theater, appliances, tablets and drones. Comparable sales increased in the first six months of fiscal 2026, primarily from comparable sales growth in computing, gaming and mobile phones, partially offset by comparable sales declines in home theater and appliances.\nRestructuring charges in the second quarter of fiscal 2026 were primarily associated with a labor and store optimization restructuring initiative that commenced in the second quarter of fiscal 2026. Restructuring charges in the first six months of fiscal 2026 also included charges primarily associated with a restructuring initiative focused on optimizing our Best Buy Health business that commenced in the first quarter of fiscal 2026. Refer to Note 2,\n, of the Notes to Consolidated Financial Statements, for additional information.\nOperating income rate decreased in the second quarter and first six months of fiscal 2026, primarily due to higher restructuring charges.\nDiluted EPS decreased in the second quarter and first six months of fiscal 2026, primarily due to lower operating income driven by higher restructuring charges.\nRevenue and gross profit rate changes in the second quarter of fiscal 2026 were driven by both our Domestic and International segments. Changes in our SG&A rate and operating income rate in the second quarter of fisc"
}