{
  "source_file": "bby-20250201x10k.htm",
  "form_type": "10-K",
  "item1_clean": "Our competitors are primarily multi-channel retailers, e-commerce businesses, technology service providers, traditional store-based retailers, vendors and mobile network carriers who offer their products and services directly to customers. We believe our ability to help customers online, in our stores and in their homes, and to connect technology product and solutions with customer needs, provide us key competitive advantages. Some of our competitors have lower cost operating structures and seek to compete for sales primarily on price. We carefully monitor pricing offered by other retailers and service providers, as maintaining price competitiveness is one of our ongoing priorities. In addition, we have price-matching policies that allow customers to request that we match a price offered by certain retail stores and online operators. In order to allow this, we are focused on maintaining efficient operations and leveraging the economies of scale available to us through our global vendor partnerships. We believe our dedicated and knowledgeable people; our integrated online, retail and in-home assets; our broad and curated product assortment; our strong vendor partnerships; our service and support offerings designed to solve customer needs; our unique ability to showcase technology in distinct store formats; and our supply chain are important ways in which we maintain our competitive advantage.\n\nDevelopment of merchandise and service offerings, pricing and promotions, procurement and supply chain, online and mobile application operations, marketing and advertising and labor deployment across all channels are centrally managed. In addition, support capabilities (for example, human resources, finance, information technology and real estate management) operate primarily from our corporate headquarters. We also have field operations that support retail, services and in-home teams primarily from our corporate headquarters and regional locations. Our retail stores have procedures for inventory management, asset protection, transaction processing, customer relations, store administration, product sales and services, staff training and merchandise display that are largely standardized. All stores generally operate under standard procedures with a degree of flexibility for store management to address certain local market characteristics. While day-to-day operations of our stores are led by store management, more strategic decisions regarding, for example, store locations, format, category assortment and fulfillment strategy, are led by our corporate teams with input from market or regional leadership.\n\nFurther, across all the products and services we procure, we seek to mitigate risk and enhance our partnership with suppliers and create value for all stakeholders through our Responsible Sourcing Program. We are active members of the Responsible Business Alliance, as are many of the major brands we sell, which allows us to partner across initiatives and increase our impact. Collectively, we embrace a common Supplier Code of Conduct and audit methodology that creates business value by improving working conditions and environmental practices throughout the supply chain.\n\nCustomers within our Domestic segment who purchase product online have the choice to have product delivered, or pick up product from a Best Buy store (including curbside pick-up for many products at most stores) or an alternative pick-up location. Our ship-from-store capability allows us to offer additional fast and convenient delivery options for customers. Most merchandise is shipped directly from manufacturers to our distribution centers. Distribution is similar for our International segment.\n\nWe continue to invest in our employees and build a culture focused on developing our talent. Prioritizing foundational and leadership skill development helps to meet employees where they are at, which creates a more adaptable and resilient workforce and enhances our competitive advantage. Additionally, we believe by investing in employee training and development we can create a better employee environment and increase productivity, retention and innovation that ultimately improves our overall company performance and brings value to stakeholders. With the continued goal of creating learning opportunities that are tailored to the unique work of each role and a focus on solving the most important problems in our business, we expanded our variety of training experiences in fiscal 2025. This included new learning campaigns, leadership programs and expanded side-by-side trainings to support employee growth alongside their peers and leaders in condensed training formats.\n\nComputing and Mobile Phones\n- computing (including desktops, notebooks and peripherals), mobile phones (including related mobile network carrier commissions), networking, tablets (including e-readers) and wearables (including smartwatches);\nConsumer Electronics\n- digital imaging, health and fitness products, home theater (including home theater accessories, soundbars and televisions), portable audio (including headphones and portable speakers) and smart home;\n- large appliances (including dishwashers, laundry, ovens and refrigerators) and small appliances (including blenders, coffee makers, vacuums and personal care);\n- drones, gaming (including hardware, peripherals and software), movies, toys, virtual reality and other software;\n- delivery, health-related services, installation, memberships, repair, set-up, technical support and warranty-related services; and\n- other product offerings, including baby, food and beverage and outdoor living.\n\nWe have secured domestic and international trademark and service mark registrations for many of our brands. We have also secured patents for many of our inventions. We believe our intellectual property has significant value and is an important factor in the marketing of our company, our stores, our products and our websites.\n\nOur Domestic and International segments are managed by leadership teams responsible for all areas of the business. Both segments operate an omnichannel platform that allows customers to come to us online, visit our stores or invite us into their homes.\n\nWe have two reportable segments: Domestic and International. The Domestic segment is comprised of our operations in all states, districts and territories of the U.S. and our Best Buy Health business, and includes the brand names Best Buy, Best Buy Ads, Best Buy Business, Best Buy Essentials, Best Buy Health, Current Health, Geek Squad, Imagine That, Insignia, Lively, My Best Buy, My Best Buy Memberships, Pacific Kitchen and Home, TechLiquidators and Yardbird; and the domain names bestbuy.com, currenthealth.com, lively.com, techliquidators.com and yardbird.com. Our International segment is comprised of all operations in Canada under the brand names Best Buy, Best Buy Express, Best Buy Mobile, Geek Squad and TechLiquidators and the domain names bestbuy.ca and techliquidators.ca.\n\nWe evolved our leadership development offerings to grow and transform Best Buy for its future. These offerings included unique programs such as an enterprise-wide manager development program, a skill development program for our senior store leaders and several emerging talent programs including an officer readiness program.\nWe expanded our learning campaigns, reaching thousands of employees for new products to include a closer partnership with our vendors, more exposure for our employees and in-depth training in artificial intelligence to help customers with the products they use.\nWe enhanced our portfolio of risk, compliance and safety microlearning courses to enable employees to continuously develop safe, secure and ethical behaviors to protect the company.\n\nWe disclose information to the public concerning Best Buy, Best Buy’s products, content and services and other items through our websites in order to achieve broad, non-exclusionary distribution of information to the public. Some of the information distributed through this channel may be considered material information. Investors and others are encouraged to review the information we make public in the locations below.* This list may be updated from time to time.\n\nWe also support the circular economy by keeping consumer products in use for as long as possible through our repair and trade-in services. We put materials back into the manufacturing process when products reach the end of their lives through our electronics and appliance recycling program. In fiscal 2025, we continued to evolve our industry-leading e-waste recycling program and found additional ways to incentivize recycling.\n\nWe own or have the right to use valuable intellectual property such as trademarks, service marks and trade names, including, but not limited to,\nBest Buy, Best Buy Ads, Best Buy Essentials, Best Buy Express, Best Buy Health, Best Buy Marketplace, Current Health, Geek Squad, Imagine That, Insignia, Jitterbug, Lively, Magnolia, My Best Buy, My Best Buy Memberships, Pacific Kitchen and Home, Pacific Sales, Rocketfish\n\nFor information concerning Best Buy and its products, content and services, please visit: https://bestbuy.com.\nFor information provided to the investment community, including news releases, events and presentations, and filings with the SEC, please visit: https://investors.bestbuy.com.\nFor the latest information from Best Buy, including press releases, please visit: https://corporate.bestbuy.com/archive/.\n\nWe aspire to drive forward the circular economy, a system that aims to reduce waste and preserve resources. We focus on our highest-impact areas, including our operations, the energy we procure and the products we sell. These efforts contribute to mitigating climate risks, reducing potential risks to our business and generating long-term cost savings.\n\nOur focus on sustainable products centers on helping our customers reduce their impact on the environment through the products we sell. We do this by providing a variety of energy-efficient products for our customers.\n\nOur business, like that of many retailers, is seasonal. A large proportion of our revenue and earnings is generated in the fiscal fourth quarter, which includes the majority of the holiday shopping season.\n\nOur Domestic and International segments have offerings in six revenue categories. The key components of each revenue category are as follows:\n\nA well-being sabbatical for employees with five or more years of service that provides them an opportunity to take four weeks off (once every three years) to focus on their well-being.\nAdditional paid time off each year in recognition of tenure for full-time employees with 20 or more years of service, plus additional tiers for part-time employees at three and six years.\nFive floating holidays and two fixed company holidays (Thanksgiving and Christmas Day) in place of seven fixed holidays for U.S. employees, to give flexibility for employees to celebrate what is meaningful to them.\n\nWe also make available, free of charge on our website, our Amended and Restated Articles of Incorporation, Amended and Restated By-laws, the Corporate Governance Principles of our Board and our Code of Business Ethics adopted by our Board, as well as the charters of all of our Board's committees: Audit Committee; Compensation and Human Resources Committee; Finance and Investment Policy Committee; and Nominating, Corporate Governance and Public Policy Committee. These documents are posted on our website at https://investors.bestbuy.com.\n\nWe believe in an inclusive work environment with a culture of belonging where everyone feels valued, can thrive and has equal opportunities at all levels in the organization. At the core of this environment are our company values, which were founded decades ago and focus, in part, on what it means to unleash the power of our people, as individuals, so everyone can learn, grow and be the best version of themselves. We",
  "item7_clean": "This MD&A includes financial information prepared in accordance with accounting principles generally accepted in the U.S. (“GAAP”), as well as certain non-GAAP financial measures, such as consolidated adjusted operating income, consolidated adjusted operating income rate, consolidated adjusted effective tax rate and consolidated adjusted diluted earnings per share (“EPS”). We believe that non-GAAP financial measures, when reviewed in conjunction with GAAP financial measures, provide additional useful information for evaluating current period performance and assessing future performance. For these reasons, internal management reporting, including budgets, forecasts and financial targets used for short-term incentives are based on non-GAAP financial measures. Generally, our non-GAAP financial measures include adjustments for items such as restructuring charges, goodwill and acquired intangible asset impairments, price-fixing settlements, gains and losses on sales of subsidiaries and certain investments, amortization of definite-lived intangible assets associated with acquisitions, certain acquisition-related costs and the tax effect of all such items. In addition, certain other items may be excluded from non-GAAP financial measures when we believe doing so provides greater clarity to management and our investors. We provide reconciliations of the most comparable financial measures presented in accordance with GAAP to presented non-GAAP financial measures that enable investors to understand the adjustments made in arriving at the non-GAAP financial measures and to evaluate performance using the same metrics as management. These non-GAAP financial measures should be considered in addition to, and not superior to or as a substitute for, GAAP financial measures. We strongly encourage investors and shareholders to review our financial statements and publicly filed reports in their entirety and not to rely on any single financial measure. Non-GAAP financial measures may be calculated differently from similarly titled measures used by other companies, thereby limiting their usefulness for comparative purposes.\n\nFor additional information regarding the nature of contractual obligations discussed below, refer to Note 5,\nDerivative Instruments\nContingencies and Commitments\n, of the Notes to Consolidated Financial Statements, included in Item 8,\nFinancial Statements and Supplementary Data\nPurchase obligations primarily include agreements to purchase goods or services that are enforceable, are legally binding and specify all significant terms, including fixed or minimum quantities to be purchased; fixed, minimum or variable price provisions; and the approximate timing of the transaction. Purchase obligations do not include agreements that are cancelable without penalty. Additionally, although they do not contain legally binding purchase commitments, we include open purchase orders in the table above. Substantially all open purchase orders are fulfilled within 30 days.\nOperating lease obligations exclude payments to landlords covering real estate taxes and common area maintenance. These charges, if included, would increase total operating lease obligations by $0.7 billion as of February 1, 2025. Operating\nlease obligations also exclude $19 million of legally binding fixed costs for leases signed but not yet commenced\nLong-term debt obligations represent principal amounts only and exclude interest rate swap valuation adjustments.\nInterest payments related to our 2028 Notes and 2030 Notes include the variable interest rate payments included in our interest rate swaps.\n\nIncome tax expense decreased to $372 million in fiscal 2025 compared to $381 million in fiscal 2024, primarily due to the impact of decreased pre-tax earnings, partially offset by the impact of certain expenses that are not tax deductible. Our effective tax rate increased to 28.7% in fiscal 2025 compared to 23.5% in fiscal 2024, primarily due to the impacts of certain expenses that are not tax deductible\nand lower pre-tax earnings, partially offset by increased tax benefits from green energy incentives.\n\nJudgments and uncertainties involved in the estimate\nDetermining the fair value of a reporting unit requires complex analysis and judgment. We use a combination of discounted cash flow (“DCF”) analysis and market data, such as revenue multiples and quoted market prices, for observable comparable companies. DCF analysis requires detailed forecasts of cash flow drivers, such as revenue growth rates, margin rates and capital investments, and estimates of weighted-average cost of capital rates. These estimates incorporate many uncertain factors, such as the effectiveness of our strategy, changes in customer behavior, technological changes, competitor actions, regulatory changes and macroeconomic trends.\n\nJudgments and uncertainties involved in the estimate\nMarkdown adjustments involve uncertainty because the calculations require management to make assumptions and to apply judgment about the expected revenue and incremental costs we will generate for selling current inventory. Such estimates include the evaluation of historical recovery rates, as well as factors such as product type and condition, forecasted consumer demand, product lifecycles, promotional environment, regulatory actions, vendor return rights and the expected sales channel of ultimate disposition. We also apply judgment in the assumptions about other components of net realizable value, such as vendor allowances and selling costs.\n\nManagement's Discussion and Analysis of Financial Condition and Results of Operations (“MD&A”) is intended to provide a reader of our financial statements with a narrative from the perspective of our management on our financial condition, results of operations, liquidity and certain other factors that may affect our future results. Unless otherwise noted, transactions and other factors significantly impacting our financial condition, results of operations and liquidity are discussed in order of magnitude. Our MD&A should be read in conjunction with the Consolidated Financial Statements and related Notes included in Item 8,\nFinancial Statements and Supplementary Data,\n\nThroughout this MD&A, we refer to comparable sales. Comparable sales is a metric used by management to evaluate the performance of our existing stores, websites and call centers by measuring the change in net sales for a particular period over the comparable prior period of equivalent length. Comparable sales includes revenue from stores, websites and call centers operating for at least 14 full months. Revenue from online sales is included in comparable sales and represents sales initiated on a website or app, regardless of whether customers choose to have product delivered, or pick up product in store, curbside or at an alternative pick-up location. Revenue from acquisitions is included in comparable sales beginning with the first full quarter following the first anniversary of the date of the acquisition. Comparable sales also includes credit card revenue, gift card breakage, commercial sales and sales of merchandise to wholesalers and dealers, as applicable. Revenue from stores closed more than 14 days, including but not limited to relocated, remodeled, expanded and downsized stores, or stores impacted by natural disasters, is excluded from comparable sales until at least 14 full months after reopening. Comparable sales excludes the impact of certain periodic warranty-related profit-share revenue, the effect of fluctuations in foreign currency exchange rates (applicable to our International segment only) and the impact of the 53\nweek (applicable in 53-week fiscal years only).\nComparable sales is based on our fiscal calendar and is not adjusted to align calendar weeks.\nAll periods presented apply this methodology consistently.\n\nFor additional information regarding the nature of charges discussed below, refer to Note 1,\nSummary of Significant Accounting Policies\nGoodwill and Intangible Assets\n, of the Notes to Consolidated Financial Statements, included in Item 8,\nFinancial Statements and Supplementary Data\nRepresents the non-cash amortization of definite-lived intangible assets associated with acquisitions, including customer relationships, tradenames and developed technology assets.\ncharges related to employee termination benefits and subsequent adjustments to previously planned organizational changes and higher-than-expected employee retention associated with enterprise-wide restructuring initiatives.\nRepresents the non-cash goodwill impairment charge related to our Best Buy Health reporting unit.\nRepresents the gain on sale of a Mexico subsidiary subsequent to our exit from operations in Mexico.\nThe non-GAAP adjustments primarily relate to the U.S. As such, the income tax on a portion of the U.S. non-GAAP adjustments is calculated using the statutory tax rate of 24.5%. There is no income tax for a portion of the U.S. non-GAAP adjustments, as there is no tax benefit on the expenses in the calculation of GAAP income tax expense\n\nDomestic segment gross profit rate increased in fiscal 2025,\nprimarily due to improved financial performance from our services category, including our membership offerings, partially offset by lower product margin rates and\nlower profit-sharing revenue from our private label and co-branded credit card arrangement\n\nInternational segment revenue decreased in fiscal 2025, primarily driven by the negative impact of foreign exchange rates and by the extra week of revenue totaling approximately $60 million in fiscal 2024. These decreases were partially offset by\nincreased revenue from Best Buy Express locations\n\nDomestic segment adjusted SG&A decreased in fiscal 2025,\nlower employee compensation expense, which was primarily store payroll,\nthe impact of the 53\nweek in fiscal 2024 and reduced vehicle rental costs.\nThese decreases were partially offset by higher advertising and technology expense\n\nInternational segment adjusted SG&A decreased in fiscal 2025, primarily due to the favorable impact of foreign exchange rates and the impact of the 53\nweek in fiscal 2024, partially offset by expenses associated with new Best Buy Express locations.\n\nCredit rating agencies review their ratings periodically, and, therefore, the credit rating assigned to us by each agency may be subject to revision at any time. Factors that can affect our credit ratings include, but are not limited to, changes in our operating performance; the economic environment, regulatory and political environment; conditions in the retail and consumer electronics industries; our competitive standing within the industries we operate; our financial position; and changes in our business strategy. If changes in our credit ratings were to occur, they could impact, among other things, interest costs for certain of our credit facilities, our future borrowing costs, access to capital markets, vendor financing terms and future new-store leasing costs.\n\nAdjusted effective tax rate decreased in fiscal 2025, primarily due to\nincreased tax benefits from green energy incentives.\n\nWe receive funds from our merchandise vendors through a variety of programs and arrangements, primarily in the form of purchases-based or sales-based volumes and for product advertising and placement\n. We recognize vendor allowances based on purchases and sales as a reduction of cost of sales when the associated inventory is sold. Vendor allowances for\nadvertising and placement are recognized as a reduction of cost of sales ratably over the corresponding performance period. Funds that are determined to be a reimbursement of specific, incremental and identifiable costs incurred to sell a vendor's products are recorded as an offset to the related expense within SG&A when incurred.\n\nIn fiscal 2025, we recorded a goodwill impairment of $475 million for the Best Buy Health reporting unit. The impairment was identified during the fourth quarter as a result of our annual impairment review. This coincides with our annual review of performance against financial and strategic goals, and the annual update of our budget and long-range financial projections. Fair value for the Best Buy Health reporting unit is estimated primarily based on DCF analysis. The impairment primarily arose from downward revisions of our revenue growth rates and margin rates compared to projections used in prior years, as the market has not scaled as we originally forecasted.\n\nWe closely manage our liquidity and capital\nresources. Our liquidity requirements depend on key variables, including the level of investment required to support our business strategies, the performance of our business, capital expenditures, dividends, credit facilities, short-term borrowing arrangements and working capital management.\nWe modify our approach to managing these variables as changes in our operating environment arise. For example, capital expenditures and share repurchases are a component of our cash flow and capital management strategy, which, to a large extent, we can adjust in response to economic and other changes in our business environment.\n\nThe preparation of our financial statements requires us to make assumptions and estimates about future events and apply judgments that affect the reported amounts of assets, liabilities, revenue, expenses and the related disclosures. We base our assumptions, estimates and judgments on historical experience, current trends and other factors believed to be relevant at the time our consolidated financial statements are prepared. Because future events and their effects cannot be determined with certainty, actual results could differ from our assumptions and estimates, and such differences could be material.\n\nOur liquidity is also affected by restricted cash balances that are primarily restricted to cover product protection plans provided under our membership offerings and self-insurance liabilities. Restricted cash, which is included in Other current assets on our Consolidated Balance Sheets, was $290 million and $346 million as of February 1, 2025, and February 3, 2024, respectively. The decrease in restricted cash was primarily due to releases of product protection reserves based on claims and purchasing behaviors of customers participating in our membership offerings.\n\nJudgments and uncertainties involved in the estimate\nOur liability for unrecognized tax benefits contains uncertainties because management is required to make assumptions and apply judgment to estimate the exposures associated with our various tax filing positions. Such assumptions can include complex and uncertain external factors, such as changes in tax law, interpretations of tax law and the timing of such changes, and uncertain internal factors such as taxable earnings by jurisdiction, the magnitude and timing of certain transactions and capital spending.\n\nEffect if actual results differ from assumptions\nTo the extent we prevail in matters for which a liability has been established or are required to pay amounts in excess of our established liability, our effective income tax rate in a given financial statement period could be materially affected. An unfavorable tax settlement generally would require use of our cash and may result in an increase in our effective income tax rate in the period of resolution. A favorable tax settlement may reduce our effective income tax rate in the period of resolution.\n\nOur income tax returns are routinely examined by domestic and foreign tax authorities. Taxing authorities audit our tax filing positions, including the timing and amount of income and deductions and the allocation of income among various tax jurisdictions. At any one time, multiple tax years are subject to audit by the various taxing authorities. In evaluating the exposures associated with our various tax filing positions, we may record a liability for such exposures. A number of years may el",
  "item2_clean": null
}