{
  "source_file": "bdx-20250930.htm",
  "form_type": "10-K",
  "item1_clean": "BD is a global medical technology company engaged in the development, manufacture and sale of a broad range of medical supplies, devices, laboratory equipment and diagnostic products used by healthcare institutions, physicians, life science researchers, clinical laboratories, the pharmaceutical industry and the general public. We provide customer solutions that are focused on improving medication management and patient safety; supporting infection prevention practices; equipping surgical and interventional procedures; improving drug delivery; aiding anesthesiology care; enhancing the diagnosis of infectious diseases and cancers; and advancing cellular research and applications.\nAs of September 30, 2025, BD’s operations consisted of three worldwide business segments: BD Medical, BD Life Sciences and BD Interventional. As further discussed in Note 8 to the consolidated financial statements contained in Item 8. Financial Statements and Supplementary Data, effective October 1, 2025, BD reorganized its organizational units into five distinct, separately-managed segments, based on the nature of BD’s product and service offerings. BD’s new organizational structure is based upon the following five segments: Medical Essentials, Connected Care, BioPharma Systems, Interventional and Life Sciences, which remains a critical part of BD until the separation and combination of our Biosciences and Diagnostic Solutions business with Waters Corporation (“Waters”), as further discussed below, is completed.\nBD Medical produces a broad array of medical technologies and devices that are used to help improve healthcare delivery in a wide range of settings. The primary customers served by BD Medical are hospitals and clinics; physicians’ office practices; consumers and retail pharmacies; governmental and nonprofit public health agencies; pharmaceutical companies; and healthcare workers. BD Medical consists of the following organizational units:\nPrincipal Product Lines\nPeripheral intravenous (“IV”) catheters (conventional, safety); advanced peripheral catheters (guidewire assisted peripherally inserted venous catheters, midline catheters, port access); central lines (peripherally inserted central catheters); acute dialysis catheters; vascular access technology (ultrasonic imaging); vascular care (lock solutions, prefilled flush syringes, disinfecting caps); vascular preparation (skin antiseptics, dressings, securement); needle-free IV connectors and extensions sets; closed-system drug transfer devices; hazardous drug detection; conventional and safety hypodermic syringes and needles, anesthesia needles (spinal, epidural) and trays; enteral syringes; and sharps disposal systems.\nMedication Management\nIV medication safety and infusion therapy delivery systems, including infusion pumps, dedicated disposables, and IV fluids; medication compounding workflow systems; automated medication dispensing; automated supply management systems; medication inventory optimization and tracking systems; informatics and analytics solutions for enterprise medication management; and pharmacy automation systems.\nPrefillable drug delivery systems - prefillable syringes, safety, shielding and self-injection systems and support services (combination product testing, technical and regulatory) - provided to pharmaceutical companies for use as containers for injectable pharmaceutical products, which are then placed on the market as drug/device combinations.\nAdvanced Patient Monitoring\nAdvanced hemodynamic monitoring systems used to measure a patient's heart function and fluid status in surgical and intensive care settings, including noninvasive tissue oximetry systems; hemodynamic and tissue oximetry monitoring systems; pulmonary artery catheters and arterial pressure monitoring products and blood pressure measurement systems.\nBD Life Sciences provides products for the safe collection and transport of diagnostics specimens, and instruments and reagent systems to detect a broad range of infectious diseases, healthcare-associated infections and cancers. In addition, BD Life Sciences produces research and clinical tools that facilitate the study of cells, and the components of cells, to gain a better understanding of normal and disease processes. That information is used to aid the discovery and development of new drugs and vaccines, and to improve the diagnosis and management of diseases. The primary customers served by BD Life Sciences are hospitals, laboratories and clinics; blood banks; healthcare workers; physicians’ office practices; academic and government institutions; and pharmaceutical and biotechnology companies. BD Life Sciences consists of the following organizational units:\nPrincipal Product Lines\nDiagnostic Solutions\nAutomated blood culturing and tuberculosis culturing systems; microorganism identification and drug susceptibility systems; microbiology laboratory automation and informatics; dehydrated, liquid and plated media for clinical and industrial microbiology applications; molecular testing systems for infectious diseases and women’s health; and rapid diagnostic assays for testing of respiratory infections at point of care.\nFluorescence-activated cell sorters and analyzers; antibodies and kits for performing cell analysis; reagents for life science research; solutions for high-throughput single-cell gene and protein expression analysis; and clinical oncology, immunological (HIV) and transplantation diagnostic/monitoring reagents, analyzers and informatics.\nBlood collection systems including safety-engineered wingsets, needles and blood collection tubes, arterial blood gas devices, urine collection kits, molecular research tubes, capillary collection technologies alongside associated products for patient identification,data capture, storage and transportation.\nBD Interventional provides vascular, urology, oncology and surgical specialty products that are intended to be used once and then discarded or are either temporarily or permanently implanted. The primary customers served by BD Interventional are hospitals\n, ambulatory surgery centers, individ\nual healthcare professionals, extended care facilities, alternate site facilities, and patients via our Homecare business. BD Interventional consists of the following organizational units:\nPrincipal Product Lines\nHernia and soft tissue repair, biological grafts, bioresorbable grafts, biosurgery, and other surgical products, BD Surgiphor™ Antimicrobial Irrigation System, and BD ChloraPrep™ surgical infection prevention products.\nPeripheral Intervention\nPercutaneous transluminal angioplasty (“PTA”) balloon catheters, radio frequency ablation catheters, peripheral vascular stents, self-expanding and balloon-expandable stent grafts, vascular grafts, drug coated balloons, ports, biopsy, chronic dialysis, inferior vena catheter filters, endovascular fistula creation devices and drainage products, and atherectomy and thrombectomy systems.\nUrology and Critical Care\nUrine management and measurement devices, indwelling, intermittent and external urine catheters, kidney stone management devices, Targeted Temperature Management, and fecal management devices.\nEdwards Lifesciences’ Critical Care Product Group\nOn September 3, 2024, BD completed the acquisition of Edwards Lifesciences’ Critical Care product group, which was renamed as BD Advanced Patient Monitoring. The fair value of consideration transferred in connection with the acquisition was $3.914 billion. Since the acquisition date, financial results for Advanced Patient Monitoring’s product offerings are being reported as a separate organizational unit within the Medical segment. BD funded the transaction with cash on hand, using net proceeds raised through debt issuances in the third quarter of fiscal year 2024, as further discussed in Note 16, and borrowings under our commercial paper program. Additional information regarding this acquisition is contained in Note 11 to the consolidated financial statements contained in Item 8. Financial Statements and Supplementary Data, which is incorporated herein by reference.\nProposed Combination of Biosciences and Diagnostic Solutions Business with Waters Corporation\nOn July 13, 2025, BD entered into a definitive agreement to combine its Biosciences and Diagnostic Solutions business with Waters Corporation (“Waters”) in a Reverse Morris Trust (“RMT”) transaction. When the RMT transaction is complete, BD’s Biosciences and Diagnostic Solutions businesses will be spun-off to BD shareholders and simultaneously merged with a wholly owned subsidiary of Waters. BD’s shareholders are expected to own approximately 39.2% of the combined company, and existing Waters’ shareholders are expected to own approximately 60.8% of the combined company. In connection with the transaction, BD expects to receive a cash distribution of approximately $4 billion prior to completion of the combination, subject to adjustment for cash, working capital, and indebtedness. The transaction is expected to be generally tax-free for U.S. federal income tax purposes to BD and BD’s shareholders and Waters is expected to assume approximately $4 billion of incremental debt. The transaction is expected to close around the end of the first quarter of calendar year 2026, subject to receipt of required regulatory approvals, Waters shareholder approval, compliance with applicable U.S. Securities Exchange Commission (“SEC”) requirements, the receipt of a\nprivate letter ruling from the Internal Revenue Service regarding certain matters germane to the U.S. federal\nincome tax consequences of the transactions and satisfaction of other customary closing conditions.\nSurgical Instrumentation Platform\nIn August 2023, BD completed the sale of the Interventional segment’s Surgical Instrumentation platform pursuant to a definitive agreement that was signed in June 2023. BD recognized a pre-tax gain on the sale of approximately $268 million, which was recorded as a component of\nOther operating expense (income), net\nin fiscal year 2023. The historical financial results for the Surgical Instrumentation platform have not been classified as a discontinued operation. Additional information regarding this divestiture is contained in Note 2 to the consolidated financial statements contained in Item 8. Financial Statements and Supplementary Data, which is incorporated herein by reference.\nSpin-Off of Diabetes Care\nOn April 1, 2022, BD completed the separation and distribution of Embecta Corp. (“Embecta”), formerly BD's Diabetes Care business, into a separate, publicly-traded company. The historical results of the Diabetes Care business (previously included in BD’s Medical segment), as well as interest expense related to indebtedness incurred by Embecta prior to the spin-off date, have been reflected as discontinued operations in our consolidated financial statements for all periods prior to the spin-off date of April 1, 2022. Additional disclosures regarding our spin-off of the Diabetes Care business are provided in Note 2 to the consolidated financial statements contained in Item 8. Financial Statements and Supplementary Data, which is incorporated herein by reference.\nInternational Operations\nBD’s products are manufactured and sold worldwide. For reporting purposes, we organize our operations outside the United States as follows: EMEA (which includes Europe, the Middle East and Africa); Greater Asia (which includes countries in Greater China, Japan, South Asia, Southeast Asia, Korea, and Australia and New Zealand); Latin America (which includes Mexico, Central America, the Caribbean and South America); and Canada. BD has manufacturing operations outside the United States in Bosnia and Herzegovina, Brazil, Canada, China, Dominican Republic, France, Germany, Hungary, India, Ireland, Japan, Malaysia, Mexico, the Netherlands, Singapore, Spain, Switzerland, and the United Kingdom. Geographic information with respect to BD’s operations is included ",
  "item7_clean": "Management’s Discussion and Analysis of Financial Condition and Results of Operations\nThe following commentary should be read in conjunction with the consolidated financial statements and accompanying notes presented in this report. Within the tables presented throughout this discussion, certain columns may not add due to the use of rounded numbers for disclosure purposes. Percentages and earnings per share amounts presented are calculated from the underlying amounts. References to years throughout this discussion relate to our fiscal years, which end on September 30.\nDescription of the Company and Business Segments\nBecton, Dickinson and Company (“BD”) is a global medical technology company engaged in the development, manufacture and sale of a broad range of medical supplies, devices, laboratory equipment and diagnostic products used by healthcare institutions, physicians, life science researchers, clinical laboratories, the pharmaceutical industry and the general public. The Company's organizational structure is based upon three principal business segments, BD Medical (“Medical”), BD Life Sciences (“Life Sciences”) and BD Interventional (“Interventional”).\nBD’s products are manufactured and sold worldwide. Our products are marketed in the United States and internationally through independent distribution channels and directly to end-users by BD and independent sales representatives. We organize our operations outside the United States as follows: EMEA (which includes Europe, the Middle East and Africa); Greater Asia (which includes countries in Greater China, Japan, South Asia, Southeast Asia, Korea, Australia and New Zealand); Latin America (which includes Mexico, Central America, the Caribbean and South America); and Canada. We continue to pursue growth opportunities in emerging markets, which include the following geographic regions: Eastern Europe, the Middle East and Africa (collectively referred to below as “EMA”), as well as, Latin America and certain countries within Greater Asia.\nAs further discussed in Note 8 to the consolidated financial statements contained in Item 8. Financial Statements and Supplementary Data, effective October 1, 2025, we reorganized our organizational units into five distinct, separately-managed segments, based on the nature of our product and service offerings. BD’s new organizational structure is based upon the following five segments: Medical Essentials, Connected Care, BioPharma Systems, Interventional and Life Sciences, which remains a critical part of BD until the separation and combination of our Biosciences and Diagnostic Solutions business with Waters Corporation (“Waters”) is completed. Additional disclosures regarding the agreement to combine our Biosciences and Diagnostic Solutions business with Waters are provided in Note 1 to the consolidated financial statements contained in Item 8. Financial Statements and Supplementary Data.\nStrategic Objectives\nBD remains focused on delivering durable growth, creating shareholder value and making appropriate investments for the future. Our strategy is anchored in three key pillars: grow, simplify and empower. BD's management team aligns our operating model and investments with these key strategic pillars through continuous focus on the following underlying objectives:\nAccelerating innovation in smart devices, robotics, analytics, and artificial intelligence in order to enable new care settings, improve outcomes, streamline care workflows, and reduce costs within healthcare settings;\nFocusing on a strong portfolio of core leading products, solutions and services that deliver greater benefits to patients, healthcare workers and researchers;\nInvesting in research and development that leads to and expands category leadership, as well as results in a robust product pipeline;\nLeveraging our global scale in order to provide equitable access to affordable medical technologies around the world, including in under-resourced markets;\nSupplementing our internal growth through strategic acquisitions in faster growing market segments; and\nFocusing on cash management and an efficient capital structure in order to drive balance sheet productivity and strong shareholder returns.\nDriving operating effectiveness and margin expansion through deployment of our BD Excellence program to increase factory productivity and asset efficiencies;\nReducing complexity, increasing agility and improving customer experience by rationalizing our product portfolio, as well as by simplifying and optimizing our architecture and operating model;\nMaking strategic investments that prioritize a culture of quality and our quality management system to ensure we are a best-in-class, proactive quality-driven organization;\nEnhancing customer experiences through the digitalization of internal processes and go-to-market approaches;\nCollaborating across our supply chain to responsibly source materials and goods, as well as to reduce environmental impacts; and\nContinuing our investments in an enterprise-wide renewable energy strategy to create more resilient operations.\nFostering a purpose-driven culture with a focus on positive impact to all stakeholders–customers, patients, employees, shareholders and communities;\nCultivating an inclusive work environment that welcomes and celebrates diverse backgrounds and perspectives;\nGrowing and enabling talent through training, development and reskilling strategies; and\nDriving sustainability initiatives within our organizational units to support enterprise-wide collaboration towards our sustainability strategy.\nIn assessing the outcomes of these strategies as well as BD’s financial condition and operating performance, management generally reviews forecast data, monthly actual results, including segment sales, and other similar information. We also consider trends related to certain key financial data, including gross profit margin, selling and administrative expense, investment in research and development, return on invested capital, and cash flows.\nProposed Combination of Our Biosciences and Diagnostic Solutions Business with Waters\nAs noted above and as further discussed in Note 1 to the consolidated financial statements contained in Item 8. Financial Statements and Supplementary Data, we entered into a definitive agreement on July 13, 2025 to combine our Biosciences and Diagnostic Solutions business with Waters in a transaction that is expected to create an innovative life science and diagnostics leader with pioneering technologies.\nAcquisition of Edwards Lifesciences’ Critical Care Product Group\nOn September 3, 2024, we completed the acquisition of Edwards Lifesciences’ Critical Care product group, which we renamed as BD Advanced Patient Monitoring (“Advanced Patient Monitoring”), for total consideration of $3.914 billion. Advanced Patient Monitoring is a global leader in advanced monitoring solutions that expands BD’s portfolio of smart connected care solutions with its growing set of leading monitoring technologies, advanced AI-enabled clinical decision tools and robust innovation pipeline that complement our existing technologies serving operating rooms and intensive care units.\nBD reports the results associated with Advanced Patient Monitoring’s product offerings as a separate organizational unit within our Medical segment and additional disclosures relating to this acquisition are provided in Notes 11 and 16 to the consolidated financial statements contained in Item 8. Financial Statements and Supplementary Data.\nIn August 2023, we completed the sale of the Interventional segment's Surgical Instrumentation platform. The historical financial results for this platform have not been classified as a discontinued operation.\nIn April 2022, we completed the separation and distribution of Embecta Corp., formerly BD's Diabetes Care business, into a separate, publicly-traded company. Historical financial results have been reflected as discontinued operations in our consolidated financial statements.\nAdditional disclosures regarding the sale and separation are provided in Note 2 to the consolidated financial statements contained in Item 8. Financial Statements and Supplementary Data.\nKey Trends and Uncertainties Affecting Results of Operations\nOur operations, supply chain, suppliers and customers are exposed to various global macroeconomic factors and other risks which we continually evaluate to assess their potential impact to our operations and financial results.\nWe have been experiencing, and may continue to experience, some adverse impact to our results of operations due to market dynamics in China, such as volume-based procurement programs (“VoBP”) and the government’s focus to improve compliance of healthcare practitioners. Also, reductions or delays in governmental research funding has caused customers for certain of our instruments to delay or forgo purchases of these products. Lower demand for vaccines has also adversely impacted our results of operations. The future demand for our products and services could be impacted by other factors including higher interest rates and the deterioration of healthcare systems’ budgets.\nAdditionally, we have experienced, and may continue to experience, temporary shortages in supply of certain materials or components that are used in our products. The stable flow of global transport is critical to our operations and as such, events affecting the flow of logistics around the globe may adversely impact our supply chain and distribution channels. In general, major disruptions in the sourcing, manufacturing and distribution of our products could adversely impact our results of operations. Also, tariffs, sanctions or other trade barriers imposed by the United States, or against the United States from countries in which we do business, could adversely impact our supply chain costs, results of operations and our financial condition. Based upon the latest published tariffs that are currently in effect, we expect tariffs to adversely impact our operating expense for fiscal year 2026 and potentially beyond, primarily relating to any products (or components) imported from countries across our global supply chain which have no exemption opportunities. We continue to monitor international trade policy-related developments to assess their potential impacts to our operations. The ultimate impact of any existing or new tariffs or other changes in international trade policies is subject to a number of factors including, but not limited to, the duration of such tariffs, changes in tariff rates, the amount, scope and nature of the tariffs, any countermeasures that target countries may take, or any mitigating actions that may become available. While sourcing optimization and tariff exemptions for qualifying products are key\naspects of our mitigation strategy, the timing of such or the ultimate results we will realize from these efforts are uncertain. In addition, our tariff mitigation strategies may be challenged, rejected or eliminated through legislation or other challenges, or may otherwise not be effective.\nWe continue to invest in research and development, strategic tuck-in acquisitions, geographic expansion, and new product programs to drive further revenue and profit growth. Our ability to sustain our long-term growth will depend on a number of factors, including our ability to expand our core business (including strategic geographical expansion), and develop innovative new products, as well as continue to improve operating efficiency and organizational effectiveness.\nFor additional information on risk factors that may impact our business, results of operations, financial condition and cash flows, see Part I, Item 1A. Risk Factors.\nSummary of Financial Results\nWorldwide revenues in 2025 of $21.840 billion increased 8.2% from the prior-year period. This increase reflected the following impacts:\nIncrease (decrease) in current-year revenues\nForeign currency impact\nAcquisition of Advanced Patient Monitoring\nIncrease in revenues from the prior-year period\n\nOur corporate credit ratings at September 30, 2025 were unchanged compared with our ratings at September 30, 2024.\nLower corporate debt ratings and downgrades of our corporate credit ratings or other credit ratings may increase our cost of borrowing. We believe that given our debt ratings, our financial management policies, our ability to generate cash flow and the diversified nature of our businesses, we would have access to additional short-term and long-term capital should the need arise. A rating reflects only the view of a rating agency and is not a recommendation to buy, sell or hold securities. Ratings can be revised upward or downward at any time by a rating agency if such rating agency decides that circumstances warrant such a change.\nContractual Obligations\nIn the normal course of business, we enter into contracts and commitments that obligate us to make payments in the future. Information regarding our obligations under purchase, debt and lease arrangements are provided in Notes 6, 16 and 18, respectively, to the consolidated financial statements contained in Item 8. Financial Statements and Supplementary Data.\nCritical Accounting Estimates\nThe following discussion supplements the descriptions of our accounting policies contained in Note 1 to the consolidated financial statements contained in Item 8. Financial Statements and Supplementary Data. The preparation of the consolidated financial statements requires management to use estimates and assumptions that affect the reported amounts of assets, liabilities, revenues and expenses, as well as the disclosure of contingent assets and liabilities at the date of the consolidated financial statements. Some of those judgments can be subjective and complex and, consequently, actual results could differ from those estimates. Management bases its estimates and judgments on historical experience and on various other factors that are believed to be reasonable under the circumstances, the results of which form the basis for making judgments about the carrying values of assets and liabilities that are not readily apparent from other sources. For any given estimate or assumption made by management, it is possible that other people applying reasonable judgment to the same facts and circumstances could develop different estimates. Actual results that differ from management’s estimates could have an unfavorable effect on our consolidated financial statements. Management believes the following policy areas require more significant judgment:\nOur revenues are primarily recognized when the customer obtains control of the product sold, which is generally upon shipment or delivery, depending on the delivery terms specified in the sales agreement. Revenues associated with certain instruments and equipment for which installation is complex, and therefore significantly affects the customer’s ability to use and benefit from the product, are recognized when customer acceptance of these installed products has been confirmed. For leases and for certain service arrangements, including extended warranty and software maintenance contracts, revenue is recognized ratably over the contract term. The majority of revenues relating to extended warranty contracts associated with certain instruments and equipment is generally recognized within a few years whereas deferred revenue relating to software maintenance contracts is generally recognized over a longer period.\nOur agreements with customers within certain organizational units, primarily Medication Management Solutions, Diagnostic Solutions and Biosciences, contain multiple performance obligations that include both products and certain services noted above. Determining whether products and services are considered distinct performance obligations that should be accounted for separately may require judgment. The transaction price for these agreements is allocated to ea",
  "item2_clean": null
}