{
  "source_file": "bdx-20250630.htm",
  "form_type": "10-Q",
  "item1_clean": null,
  "item7_clean": null,
  "item2_clean": "Item 2. Management’s Discussion and Analysis of Financial Condition and Results of Operations\nThe following commentary should be read in conjunction with the condensed consolidated financial statements and accompanying notes presented in this report. Within the tables presented throughout this discussion, certain columns may not add due to the use of rounded numbers for disclosure purposes. Percentages and earnings per share amounts presented are calculated from the underlying amounts. References to years throughout this discussion relate to our fiscal years, which end on September 30.\nBecton, Dickinson and Company (“BD”) is a global medical technology company engaged in the development, manufacture and sale of a broad range of medical supplies, devices, laboratory equipment and diagnostic products used by healthcare institutions, physicians, life science researchers, clinical laboratories, the pharmaceutical industry and the general public. The Company's organizational structure is based upon three principal business segments, BD Medical (“Medical”), BD Life Sciences (“Life Sciences”) and BD Interventional (“Interventional”).\nBD’s products are manufactured and sold worldwide. Our products are marketed in the United States and internationally through independent distribution channels and directly to end-users by BD and independent sales representatives. We organize our operations outside the United States as follows: EMEA (which includes Europe, the Middle East and Africa); Greater Asia (which includes countries in Greater China, Japan, South Asia, Southeast Asia, Korea, Australia and New Zealand); Latin America (which includes Mexico, Central America, the Caribbean and South America); and Canada. We continue to pursue growth opportunities in emerging markets, which include the following geographic regions: Eastern Europe, the Middle East and Africa (collectively referred to below as “EMA”), as well as Latin America and certain countries within Greater Asia.\nProposed Combination of Our Biosciences and Diagnostic Solutions Business with Waters\nOn July 13, 2025, we entered into a definitive agreement to combine our Biosciences and Diagnostic Solutions business with Waters Corporation (“Waters”) in a transaction that is expected to create an innovative life science and diagnostics leader with pioneering technologies. Additional disclosures regarding the agreement are provided in Note 1 in the Notes to Condensed Consolidated Financial Statements.\nKey Trends and Uncertainties Affecting Results of Operations\nOur BD 2025 strategy for growth is anchored in three pillars: grow, simplify and empower. As we continue to execute this strategy, we have invested in research and development, strategic tuck-in acquisitions, geographic expansion, and new product programs to drive further revenue and profit growth. Our ability to sustain our long-term growth will depend on a number of factors, including our ability to expand our core business, and develop innovative new products, as well as continue to improve operating efficiency and organizational effectiveness. Our operations, supply chain, suppliers and customers are exposed to various global macroeconomic factors and other risks which we continually evaluate to assess their potential impact to our operations and financial results.\nWe have been experiencing, and may continue to experience, some adverse impact to our results of operations due to market dynamics in China, such as volume-based procurement programs (“VoBP”) and the government’s focus to improve compliance of healthcare practitioners. Also, reductions or delays in governmental research funding has caused customers for certain of our instruments to delay or forgo purchases of these products. Higher interest rates could also reduce the demand for capital purchases. Additionally, the future demand for our products and services could be impacted by deterioration in healthcare systems’ budgets and/or staffing levels.\nAdditionally, we have experienced, and may continue to experience, temporary shortages in supply of certain materials or components that are used in our products. The stable flow of global transport is critical to our operations and as such, events affecting the flow of logistics around the globe may adversely impact our supply chain and distribution channels. In general, major disruptions in the sourcing, manufacturing and distribution of our products could adversely impact our results of operations. Also, tariffs, sanctions or other trade barriers imposed by the United States, or against the United States from countries in which we do business, could adversely impact our supply chain costs, results of operations and our financial condition. Based upon the latest published tariffs that are currently in effect, we expect an estimated impact of $90 million from tariffs to our fiscal year 2025 operating expense, primarily relating to any products (or components) imported from countries across our global supply chain which have no exemption opportunities. We continue to monitor international trade policy-related developments to assess their potential impacts to our operations. The ultimate impact of any existing or new tariffs or other changes in international trade policies is subject to a number of factors including, but not limited to, the duration of such tariffs, changes in tariff rates, the amount, scope and nature of the tariffs, any countermeasures that target countries may take, or any mitigating actions that may become available. While sourcing optimization and tariff exemptions for qualifying products\nare key aspects of our mitigation strategy, the timing of such or the ultimate results we will realize from these efforts are uncertain.\nOverview of Financial Results and Financial Condition\nFor the three months ended June 30, 2025, worldwide revenues of $5.509 billion increased 10.4% from the prior-year period. This increase reflected the following impacts:\nIncrease (decrease) in current-period revenues\nForeign currency impact\nAcquisition of Advanced Patient Monitoring\nIncrease in revenues from the prior-year period\nVolume/other includes revenues attributable to products, services and licensing.\nRepresents the impact of accruals recognized in the third quarter of fiscal year 2024 relating to the Italian government medical device pay back legislation, as well as another legal matter, and which substantially relate to years prior to fiscal year 2024.\nCash flows from continuing operating activities were $2.076 billion in the first nine months of fiscal year 2025. At June 30, 2025, we had $820 million in cash and equivalents and short-term investments, including restricted cash. We continued to return value to our shareholders in the form of dividends. During the first nine months of fiscal year 2025, we paid cash dividends to common shareholders of $899 million.\nEach reporting period and given our worldwide operations, we face exposure to our results of operations from changes in foreign currencies. We calculate translational foreign currency impacts by converting our current-period local currency financial results using the prior-period foreign currency exchange rates and comparing these adjusted amounts to our current-period results, which allows us to compare results between periods as if exchange rates had remained constant period-over-period. The third quarter fiscal year 2025 impact of foreign currency on our revenues, which is primarily translational, is provided above. The translational impact on our earnings is provided further below. We evaluate our results of operations on both a reported and a foreign currency-neutral basis. As exchange rates are an important factor in understanding period-to-period comparisons, we believe the presentation of results on a foreign currency-neutral basis, excluding translational foreign currency impacts, in addition to reported results helps improve investors’ ability to understand our operating results and evaluate our performance in comparison to prior periods. We use results on a foreign currency-neutral basis as one measure to evaluate our performance. These results should be considered in addition to, not as a substitute for, results reported in accordance with U.S. generally accepted accounting principles (\"GAAP\"). Results on a foreign currency-neutral basis, as we present them, may not be comparable to similarly titled measures used by other companies and are not measures of performance presented in accordance with U.S. GAAP.\nResults of Operations\nThe following summarizes third quarter Medical revenues by organizational unit:\n\nThree months ended June 30,\nNine months ended June 30,\nEffective income tax rate\nImpact, in basis points, from specified items\nThe effective income tax rate for the three-month period of fiscal year 2025 compared with the prior-year period primarily reflected an unfavorable tax impact from discrete items in the current-year period, compared with a benefit recognized from discrete items in the prior-year period. The effective income tax rate for the nine-month period of fiscal year 2025 compared with the prior-year period primarily reflected a current-period tax impact from discrete items that was less favorable, compared with the benefit associated with discrete items recognized in the prior-year period. Additional disclosures regarding our effective income tax rates are provided in Note 14 in the Notes to Condensed Consolidated Financial Statements\nNet Income and Diluted Earnings per Share\nNet income and diluted earnings per share for the three and nine-month periods of fiscal years 2025 and 2024 were as follows:\nThree months ended June 30,\nNine months ended June 30,\nNet Income (Millions of dollars)\nDiluted Earnings per Share\nUnfavorable impact-specified items\nFavorable (unfavorable) impact-foreign currency translation\nLiquidity and Capital Resources\nThe following table summarizes our condensed consolidated statements of cash f"
}