{
  "source_file": "ben-20250930.htm",
  "form_type": "10-K",
  "item1_clean": "Through our specialist investment managers, our investment products are offered globally to retail, institutional and high-net-worth clients, which may include, among others, individual investors, institutional investors, sovereign wealth funds, defined benefit and contribution plans, endowments and charitable foundations, healthcare systems and insurance companies. Our investment products include mutual funds, closed-end funds, collective investment trusts, interval funds, private funds, institutional separate accounts, retail separately managed accounts, and other products. Our products and capabilities are designed to accommodate a variety of investment goals and preferences, from capital appreciation to capital preservation, as well as other investor preferences.\nWe are committed to partnering closely with our clients to understand their challenges and aspirations, and drawing on our investment capabilities and resources to offer and/or design the right investment solutions for them. We distribute and market globally our different capabilities under our brand names through various subsidiaries and multiple points of access, including directly to investors and through financial intermediaries. We primarily engage new institutional business through our relationships with pension, defined contribution and management consultants, direct sales efforts and additional mandates from our existing client relationships, as well as from our responses to requests for proposals. We also market and distribute our products through various subsidiaries to institutional investors with separate accounts.\nOur specialist investment managers provide investment management services pursuant to agreements with each of our investment products and/or clients, including products for which we provide sub-advisory services. Our investment management services include fundamental investment research and valuation analyses, including original economic, political, industry and company research, and analyses of suppliers, customers and competitors. Our management fees vary with the types of services that we provide, and fees may at times be waived or voluntarily reduced by the parties, among other things.\nOur specialist investment managers manage a fund’s portfolio of securities in accordance with the fund’s stated objectives. To support the funds’ operations, our subsidiaries either provide or arrange for the investment and other management, shareholder servicing and administrative services required by the funds. We outsource various administration, technology, transfer agency and other services for our funds to third-party providers. An investor may purchase shares of a mutual fund directly from us or through a broker-dealer, financial adviser, bank or other similar financial intermediary that provides investment advice to the investor, or an investor may purchase shares of a closed-end fund or ETF on the stock exchange where the fund is traded. Financial intermediaries may earn fees and commissions and receive other compensation with respect to fund shares sold to investors.\nThe applicable board of directors or trustees of our funds and our management personnel periodically review the investment management fee structures for the funds in light of fund performance, the level and range of services provided, industry conditions and other relevant factors. For our U.S. mutual funds, most of our investment management agreements between our subsidiaries and funds must be renewed each year, and must be approved annually by a vote of each fund’s board of directors or trustees as a whole and separately by a majority of the independent fund directors or trustees under the Investment Company Act of 1940 (the “Investment Company Act”), or by a vote of the holders of a majority of the fund’s outstanding voting securities, and such agreements generally may be terminated by either party without penalty after prior written notice. Our non-U.S. mutual funds, private funds, institutional and high-net-worth separate accounts, and the products for which we provide sub-advisory services, are typically subject to various termination rights and/or renewal provisions, which often provide for termination upon relatively short notice with little or no penalty.\nRetail Separately Managed Account Programs\nCertain of our specialist investment managers provide investment management services to retail separately managed account programs sponsored by various financial institutions. These programs typically allow securities brokers or other financial intermediaries to offer their clients the opportunity to choose from a number of investment management services\npursuing different investment strategies provided by one or more investment managers, and generally charge an all-inclusive fee that can cover asset management, asset allocation and custodial and administrative services.\nAlternative Products and Strategies\nCertain of our specialist investment managers manage alternative products and investment strategies which provide our clients with alternatives to traditional equity and fixed income products and services. Our alternative products include private credit funds and structured products, business development companies, hedge funds (such as funds of funds and custom advisory solutions), private equity funds, secondary private equity funds, venture capital funds and real estate funds. These products employ various investment strategies and approaches, including loan origination, collateralized loan obligations, high-yield credit, hedge fund advisory, private equity and infrastructure transactions in emerging markets, global macro, consumer loans, direct real estate investments, and custom-tailored investment programs.\nHigh-Net-Worth Investment Management, Trust and Custody Services\nThrough our Fiduciary Trust International related subsidiaries, we provide investment management and related services to, among others, high-net-worth individuals and families, family offices, foundations and institutional clients. Fiduciary Trust International offers investment management and advisory services across different investment styles and asset classes. The majority of these client assets are actively managed by individual portfolio managers, while a significant number of clients also seek multi-manager, multi-asset class solutions. We also may provide separately managed accounts, private funds, and trust, custody and related services, including administration, performance measurement, estate planning and tax planning.\nSales and Distribution\nOur global distribution group is responsible for sales, marketing and business development and maintains a regional distribution model, with regional teams responsible for driving initiatives in collaboration with global teams. Our groups collaborate to meet the needs of our advisors, clients and investors. There are many sales channels across each region, which may include retail, institutional, private wealth, retirement, insurance, and other specialty sales. Our global footprint and breadth of investment capabilities provide the opportunity for us to work with global financial institutions to add value through and beyond investing, including by providing thought leadership and building business relationships and global economic partnerships.\nIn addition, certain of our specialist investment managers have their own sales and marketing teams that distribute their products and services, primarily to institutional investors, both directly and through consultants. Consultants play a large role in institutional investment management by helping clients select and retain investment managers. Institutional investment management clients and their consultants tend to be highly sophisticated and investment performance driven.\nOur sales and distribution capabilities and related efforts are critical components of our business and may be impacted by global distribution trends and changes within the financial services industry. In the U.S., our distribution subsidiaries generally serve as the principal underwriters and distributors of shares of most of our mutual funds. Outside the U.S., certain of our non-U.S. subsidiaries provide sales, distribution and marketing services to our non-U.S. mutual funds. Some of our non-U.S. mutual funds, particularly our Luxembourg and Irish domiciled funds, are distributed globally on a cross-border basis, while others are distributed exclusively in local markets.\nWe earn sales and distribution fees primarily by distributing our mutual funds pursuant to distribution agreements with the funds. Under our distribution agreements with our U.S. mutual funds, we offer and sell the fund shares on a continuous basis and pay certain costs associated with selling, marketing and distributing the fund shares, including the costs of developing and producing sales literature, shareholder reports and prospectuses. Our sales and distribution fees primarily consist of upfront sales commissions and ongoing distribution fees, which generally will change with the overall level of gross sales, the size of individual transactions, and the relative mix of sales between different asset classes and types of investors.\nThe majority of our U.S. mutual funds, with the exception of certain money market funds and certain other funds specifically designed for purchase through separately managed account programs, have adopted distribution plans under Rule 12b-1 (the “Rule 12b-1 Plans”) promulgated under the Investment Company Act. The Rule 12b-1 Plans permit the funds to pay us for marketing, marketing support, advertising, printing and sales promotion services relating to the distribution of their shares, subject to the Rule 12b-1 Plans’ limitations on amounts based on daily average AUM. Similar arrangements exist for the distribution of non-U.S. mutual funds. The Rule 12b-1 Plans are established for one-year terms and must be approved annually by a vote of each fund’s board of directors or trustees as a whole and separately by a majority of the independent fund directors or trustees under the Investment Company Act, and such plans are subject to termination at any time by a majority vote of the independent fund directors or trustees or by the fund’s shareholders.\nWe pay the sales and distribution fees earned as revenues to the financial advisers and other intermediaries that sell our funds on our behalf. The distribution agreements with our U.S. mutual funds generally provide for us to pay commission expenses for sales of fund shares to qualifying broker-dealers and other independent financial intermediaries. These financial intermediaries receive various sales commissions and other fees for services in matching investors with funds whose asset classes match such investors’ goals and risk profiles. The intermediaries also may receive fees for their assistance in explaining the operations of the funds, and for reporting and various other distribution services. Other compensation may be offered to the extent not prohibited by federal or state laws or any self-regulatory agency, such as the Financial Industry Regulatory Authority (“FINRA”), applicable to our business. We are heavily dependent upon these third-party distribution and sales channels and business relationships. There is increasing competition for access to these channels, which has caused our distribution costs to rise and could cause further increases in the future as competition continues and service expectations increase.\nSimilar arrangements exist with the distribution of our non-U.S. mutual funds where, generally, our subsidiary that distributes the funds receives maintenance fees from the funds and pays certain fees to financial advisers, banks and other intermediaries.\nShareholder Servicing\nWe perform our shareholder servicing services directly or through third parties. Substantially all shareholder servicing fees are earned from our funds for ",
  "item7_clean": null,
  "item2_clean": null
}