{
  "source_file": "ben-20250630.htm",
  "form_type": "10-Q",
  "item1_clean": null,
  "item7_clean": null,
  "item2_clean": "Item 2. Management’s Discussion and Analysis of Financial Condition and Results of Operations.\nFORWARD-LOOKING STATEMENTS\nWhile forward-looking statements are our best prediction at the time that they are made, you should not rely on them and are cautioned against doing so. Forward-looking statements are based on our current expectations and assumptions regarding our business, the economy and other possible future conditions. Because forward-looking statements relate to the future, they are subject to inherent uncertainties, risks and changes in circumstances that are difficult to predict. They are neither statements of historical fact nor guarantees or assurances of future performance. Factors or events that could cause our actual results to differ may emerge from time to time, and it is not possible for us to predict all of them.\nOVERVIEW\nFranklin is a holding company with subsidiaries operating under our Franklin Templeton\nand/or subsidiary brand names. We are a global investment management organization that derives operating revenues and net income from providing investment management and related services to investors in jurisdictions worldwide. We deliver our investment capabilities through a variety of investment products, which include our sponsored funds, as well as institutional and high-net-worth separate accounts, retail separately managed account programs, sub-advised products and other investment vehicles. Related services include fund administration, sales and distribution, and shareholder servicing. We may perform services directly or through third parties. We offer our services and products under our various distinct brand names, including, but not limited to, Franklin\n, Benefit Street Partners\n, Brandywine Global Investment Management\n, ClearBridge Investments\n, Fiduciary Trust International™, Franklin Mutual Series\n, K2\n, Lexington Partners\nand Western Asset Management Company\n. We offer a broad product mix of equity, fixed income, alternative, multi-asset and cash management asset classes and solutions that meet a wide variety of specific investment goals and needs for individual and institutional investors. We also provide sub-advisory services to certain investment products sponsored by other companies which may be sold to investors under the brand names of those other companies or on a co-branded basis.\nDuring our third fiscal quarter, U.S. and global equity markets rebounded, despite significant volatility driven by uncertainty regarding U.S. trade tariffs. The S&P 500 Index and MSCI World Index increased 10.9% and 11.6% for the quarter and 8.8% and 9.7% for the fiscal year to date. Global bond markets provided positive results and the Bloomberg Global Aggregate Index increased 4.5% during the quarter and 1.8% for the fiscal year to date.\nOur total AUM at June 30, 2025 was $1,611.8 billion, 4% lower than at September 30, 2024 and 2% lower than at June 30, 2024. Monthly average AUM (“average AUM”) for both the three and nine months ended June 30, 2025 decreased 4% from the same periods in the prior fiscal year.\nThe business and regulatory environments in which we operate globally remain complex, uncertain and subject to change. We are subject to various laws, rules and regulations globally that impose restrictions, limitations, registration, reporting and disclosure requirements on our business, and add complexity to our global compliance operations.\nRESULTS OF OPERATIONS\n(in millions, except per share data)\nNet income attributable to Franklin Resources, Inc.\nDiluted earnings per share\nAs adjusted (non-GAAP):\nAdjusted operating income\nAdjusted operating margin\nAdjusted diluted earnings per share\nDefined as operating income divided by operating revenues.\n“Adjusted operating income,” “adjusted operating margin,” “adjusted net income” and “adjusted diluted earnings per share” are based on methodologies other than generally accepted accounting principles. See “Supplemental Non-GAAP Financial Measures” for definitions and reconciliations of these measures.\nASSETS UNDER MANAGEMENT\nAUM by asset class was as follows:\n\nInvestment Management Fees\nInvestment management fees decreased $49.1 million for the three months ended June 30, 2025 primarily due to a 4% decrease in average AUM, partially offset by a slight increase in performance fees. The decrease in average AUM for the three months ended June 30, 2025 primarily occurred in the fixed income asset class, partially offset by increases in the equity and multi-asset asset classes. Investment management fees increased $57.7 million for the nine months ended June 30, 2025 primarily due to one additional quarter of revenue earned by Putnam, which was acquired on January 1, 2024, and an increase in average equity and multi-asset AUM, partially offset by the impact of WAM outflows, a decrease in performance fees and catch-up fees recognized in the prior year at the closing of fundraising rounds in a secondary private equity fund, which ended in January 2024.\nOur effective investment management fee rate excluding performance fees (annualized investment management fees excluding performance fees divided by average AUM) was 40.5 basis points for both the three and nine months ended June 30, 2025, as compared to 40.2 and 41.4 basis points for the same period in the prior fiscal year. The increase in the fee rate for the three month period was primarily due to the impact of outflows at WAM, partially offset by significant intra-quarter daily volatility in the current year period that caused an unusual dispersion between simple monthly average AUM and daily average AUM, while the decrease for the nine month period was primarily due to higher AUM in lower fee equity products and catch-up fees recognized in the prior year at the closing of fundraising rounds in a secondary private equity fund, partially offset by the impact of outflows at WAM.\nPerformance fees were $60.6 million and $274.1 million for the three and nine months ended June 30, 2025 as compared to $56.6 million and $308.2 million for the same periods in the prior fiscal year. The increase for the three month period and decrease for the nine month period were primarily due to changes in the amount of performance fees earned by our alternative specialist investment managers.\nSales and Distribution Fees\nSales and distribution fees by revenue driver are presented below.\nSales and Distribution Fees\n\nAsset-based distribution fees decreased $0.7 million for the three months ended June 30, 2025, primarily due to a higher mix of lower fee assets, partially offset by a slight increase in the related average AUM. Asset-based distribution fees increased $68.1 million for the nine months ended June 30, 2025 primarily due to an increase of 6% in the related average AUM and one additional quarter of asset-based revenue related to Putnam products, partially offset by a higher mix of lower fee assets.\nSales-based fees decreased $5.7 million for the three months ended June 30, 2025, primarily due to a decrease of 12% in commissionable sales, and increased $11.2 million for the nine months ended June 30, 2025, primarily due to an increase of 2% in commissionable sales and one additional quarter of sales-based revenue related to Putnam products.\nShareholder Servicing Fees\nShareholder servicing fees decreased $1.9 million for the three months ended June 30, 2025, primarily due to lower levels of related AUM and increased $23.0 million for the nine months ended June 30, 2025 primarily due to one additional quarter of fees earned by Putnam, partially offset by lower margin-based fees.\nOPERATING EXPENSES\nThe table below presents the percentage change in each operating expense category.\n\nSee “Supplemental Non-GAAP Financial Measures” for additional information.\nIncludes impact of gains and losses on investments related to deferred compensation plans, which is offset in investment and other income (losses), net; minority interests in certain subsidiaries, which is offset in net income (loss) attributable to redeemable noncontrolling interests; and special termination benefits.\nSalaries, wages and benefits increased $3.2 million for the three months ended June 30, 2025, primarily due to annual salary increases and higher employee insurance costs, partially offset by the impact of headcount reductions. Salaries, wages and benefits increased $48.0 million for the nine months ended June 30, 2025, primarily due to annual salary increases and one additional quarter of expenses related to Putnam, partially offset by the impact of headcount reductions.\nIncentive compensation decreased $14.5 million for the three months ended June 30, 2025, primarily due to lower incentive compensation at certain specialist investment managers, partially offset by an increase in expense for deferred compensation awards. Incentive compensation increased $3.1 million for the nine months ended June 30, 2025, primarily due to one additional quarter of expenses related to Putnam, higher sales-related commissions, and higher annual acceleration of deferred compensation expense related to retirement-eligible employees, partially offset by lower incentive compensation at certain specialist investment managers and lower ongoing deferred compensation expense.\nAcquisition-related retention expenses increased $4.2 million for the three months ended June 30, 2025, primarily due to higher compensation associated with performance-based and time-based awards, and decreased $88.9 million for the nine months ended June 30, 2025, primarily due to lower compensation associated with time-based and performance-based awards, and lower costs associated with the acquisition of Putnam.\nOther compensation and benefits increased $12.3 million for the three months ended June 30, 2025, primarily due to an increase in special termination benefits and higher compensation expense related to minority interests; and decreased $40.4 million for the nine months ended June 30, 2025,"
}