{
  "source_file": "bfb-20250731.htm",
  "form_type": "10-Q",
  "item1_clean": null,
  "item7_clean": null,
  "item2_clean": "We present changes in certain measures, or line items, of the statements of operations that are adjusted to an “organic” basis. We use “organic change” for the following measures: (a) organic net sales; (b) organic cost of sales; (c) organic gross profit; (d) organic advertising expenses; (e) organic selling, general, and administrative (SG&A) expenses; (f) organic other expense (income), net; (g) organic operating expenses\n; and (h) organic operating income. To calculate these measures, we adjust, as applicable, for (1) acquisitions and divestitures, (2) other items, and (3) foreign exchange. We explain these adjustments below.\n“Acquisitions and divestitures.”\nThis adjustment removes (a) the gain or loss recognized on sale of divested brands and certain assets, (b) any non-recurring effects related to our acquisitions and divestitures (e.g., transaction, transition, and integration costs), (c) the effects of operating activity related to acquired and divested brands, including certain divested agency brands, for periods not comparable year over year (non-comparable periods), and (d) fair value changes to contingent consideration liabilities. Excluding non-comparable periods allows us to include the effects of acquired and divested brands only to the extent that results are comparable year over year. For the first quarter of fiscal 2026, we had the following acquisitions and divestitures adjustments:\nDuring fiscal 2023, we acquired Gin Mare Brand, S.L.U. and Mareliquid Vantguard, S.L.U., which owned the Gin Mare brand (Gin Mare). This adjustment removes the fair value adjustments to Gin Mare’s contingent consideration liability that is payable in cash no later than July 2027.\nDuring fiscal 2024, we sold our Finlandia vodka and Sonoma-Cutrer wine businesses and entered into related transition services agreements (TSAs) for these businesses. This adjustment removes the net sales, cost of sales, and operating expenses recognized pursuant to the TSAs related to distribution services in certain markets for the non-comparable period, which is activity from the first quarter of fiscal 2025.\nDuring the first quarter of fiscal 2025, we recognized a gain of $12 million on the sale of the Alabama cooperage. This adjustment removes the gain from our other expense (income), net and operating income.\nDuring the first quarter of fiscal 2026, we ended our sales, marketing, and distribution relationship with Korbel Champagne Cellars (Korbel relationship), effective June 30, 2025. This adjustment removes the transaction costs related to ending the relationship and the operating activity for the non-comparable period, which is the month of July of fiscal 2025 and 2026.\nOther items include the additional items outlined below.\n“Franchise tax refund.”\nDuring the first quarter of fiscal 2025, we recognized a $13 million franchise tax refund due to a change in franchise tax calculation methodology for the state of Tennessee. This modification lowered our annual franchise tax obligation and was retroactively applied to franchise taxes paid during fiscal 2020 through fiscal 2023. This adjustment removes the franchise tax refund from our other expense (income), net and operating income.\n“Restructuring initiative.”\nDuring the third quarter of fiscal 2025, our Board of Directors approved a plan to reduce our structural cost base and realign resources toward future sources of growth. This included reducing our workforce by approximately 12% and closing the Louisville-based Brown-Forman Cooperage. We also offered a special, one-time early retirement benefit to qualifying U.S. employees. During the first quarter of fiscal 2026, we incurred $12 million in restructuring and other charges associated with this initiative and completed the sale of the Brown-Forman\nOperating expenses include advertising expense, SG&A expense, restructuring and other charges, and other expense (income), net.\nCooperage facility and related assets. This adjustment removes the restructuring initiative impact from our operating expenses and operating income for the first quarter of fiscal 2026. See Note 6 to the Condensed Consolidated Financial Statements for more information.\n“Substitution drawback claims.”\nDuring the first quarter of fiscal 2026, we recognized a net benefit of $18 million related to the collection of substitution drawback claims filed with the U.S. Government between fiscal 2016 and 2019. As of the first quarter of fiscal 2026, all claims have been collected. This adjustment removes the benefit from our other expense (income), net and operating income.\nWe calculate the percentage change in certain line items of the statements of operations in accordance with GAAP and adjust to exclude the cost or benefit of currency fluctuations. Adjusting for foreign exchange allows us to understand our business on a constant-dollar basis, as fluctuations in exchange rates can distort the organic trend both positively and negatively. (In this report, “dollar” means the U.S. dollar unless stated otherwise.) To eliminate the effect of foreign exchange fluctuations when comparing across periods, we translate current-year results at prior-year rates and remove transactional and hedging foreign exchange gains and losses from current- and prior-year periods.\nWe use the non-GAAP measure “organic change,” along with other metrics, to: (a) understand our performance from period to period on a consistent basis; (b) compare our performance to that of our competitors; (c) calculate components of management incentive compensation; (d) plan and forecast; and (e) communicate our financial performance to the Board of Directors, stockholders, and investment community. We provide reconciliations of the “organic change” in certain line items of the statements of operations to their nearest GAAP measures in the tables under “Results of Operations - Fiscal 2026 Year-to-Date Highlights” and “Results of Operations - Year-Over-Year Period Comparisons.” We have consistently applied the adjustments within our reconciliations in arriving at each non-GAAP measure. We believe these non-GAAP measures are useful to readers and investors because they enhance the understanding of our historical financial performance and comparability between periods. When we provide guidance for organic change in certain measures of the statements of operations we do not provide guidance for the corresponding GAAP change, as the GAAP measure will include items that are difficult to quantify or predict with reasonable certainty, such as foreign exchange, which could have a significant impact to our GAAP income statement measures.\nFrom time to time, to explain our results of operations or to highlight trends and uncertainties affecting our business, we aggregate markets according to stage of economic development as defined by the International Monetary Fund (IMF), and we aggregate brands by beverage alcohol category. Below, we define the geographic and brand aggregations used in this report.\nGeographic Aggregations.\nIn “Results of Operations - Fiscal 2026 Year-to-Date Highlights,” we provide supplemental information for our top markets ranked by percentage of net sales. In addition to markets listed by country name, we include the following aggregations:\n“Developed International”\nmarkets are “advanced economies” as defined by the IMF, excluding the United States. Our top developed international markets were Germany, Australia, the United Kingdom, France, and Canada. This aggregation represents our net sales of branded products to these markets.\nmarkets are “emerging and developing economies” as defined by the IMF. Our top emerging markets were Mexico, Poland, Brazil, and Türkiye. This aggregation represents our net sales of branded products to these markets.\nincludes Brazil, Paraguay, Uruguay, and certain other surrounding territories.\nrepresents our net sales of branded products to global duty-free customers, other travel retail customers, and the U.S. military, regardless of customer location.\n“Non-branded and bulk”\nincludes net sales of used barrels, contract bottling services, and non-branded bulk whiskey, regardless of customer location.\nIn “Results of Operations - Fiscal 2026 Year-to-Date Highlights,” we provide supplemental information for our top brands ranked by percentage of net sales. In addition to brands listed by name, we include the following aggregations outlined below.\nincludes all whiskey spirits and whiskey-based flavored liqueurs. The brands included in this category are the Jack Daniel’s family of brands (excluding the “Ready-to-Drink” products defined below), the Woodford Reserve family of brands (Woodford Reserve), the Old Forester family of brands (Old Forester), The Glendronach, Benriach, Glenglassaugh, and Slane Irish Whiskey.\nincludes the Jack Daniel’s family of brands (excluding the “Ready-to-Drink” products defined below), Woodford Reserve, and Old Forester.\n“Super-premium American whiskey”\nincludes Woodford Reserve, Gentleman Jack, and other super-premium Jack Daniel’s expressions.\nincludes all ready-to-drink (RTD) and ready-to-pour (RTP) products. The brands included in this category are Jack Daniel’s RTD and RTP products (JD RTD/RTP), New Mix, and other RTD/RTP products.\n“Jack Daniel’s RTD/RTP”\nproducts include all RTD line extensions of Jack Daniel’s, such as Jack Daniel’s & Coca-Cola RTD, Jack Daniel’s & Cola, Jack Daniel’s Double Jack, Jack Daniel’s Country Cocktails, and other malt- and spirit-based Jack Daniel’s RTDs, along with Jack Daniel’s Winter Jack RTP.\n“Jack Daniel’s & Coca-Cola RTD”\nincludes all Jack Daniel’s & Coca-Cola RTD products and Jack Daniel’s bulk whiskey shipments for the production of these products.\nincludes el Jimador, the Herradura family of brands (Herradura), and other tequilas.\nincludes Korbel California Champagnes\n, Diplomático, Chambord, Gin Mare, Sonoma-Cutrer (which was divested on April 30, 2024), Finlandia Vodka (which was divested on November 1, 20"
}