{
  "source_file": "bg-20250930.htm",
  "form_type": "10-Q",
  "item1_clean": null,
  "item7_clean": null,
  "item2_clean": "MANAGEMENT’S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS\nThird Quarter 2025 Overview\nOn July 2, 2025, we completed our previously announced acquisition (the \"Acquisition\") of Viterra Limited (\"Viterra\"). Pursuant to the terms of the business combination agreement, Viterra shareholders received approximately 65.6 million registered shares of Bunge, with an aggregate value of approximately $5.3 billion as of July 2, 2025, and approximately $1.9 billion in cash, in return for 100% of the outstanding equity of Viterra. The Acquisition of Viterra creates a premier global agribusiness solutions company for food, feed and fuel, well positioned to meet the demands of increasingly complex markets and better serve farmers and end-customers.\nThis section is inclusive of the results of operations of Viterra from the date of Acquisition, July 2, 2025. As such, the Acquisition of Viterra is frequently one of the primary drivers of the year-over-year variances discussed throughout this section.\nNon-U.S. GAAP Financial Measures\nTotal earnings before interest and taxes (\"EBIT\") is an operating performance measure used by Bunge’s management to evaluate reportable segment operating activities as well as Corporate and Other results. Bunge also uses Segment EBIT, Corporate and Other EBIT, and Total EBIT to evaluate the operating performance of Bunge’s reportable segments and Total reportable segments together with Corporate and Other activities. Segment EBIT is the aggregate of the EBIT of each of Bunge’s Soybean Processing and Refining, Softseed Processing and Refining, Other Oilseeds Processing and Refining, and Grain Merchandising and Milling reportable segments. Total EBIT is the aggregate of the EBIT of Bunge’s reportable segments, together with Corporate and Other activities. Bunge’s management believes Segment EBIT, Corporate and Other EBIT, and Total EBIT are useful measures of operating profitability since the measures allow for an evaluation of performance without regard to financing methods or capital structure. In addition, EBIT is a financial measure that is widely used by analysts and investors in Bunge’s industry. Total EBIT is a non-U.S. GAAP financial measure and is not intended to replace Net income (loss) attributable to Bunge shareholders, the most directly comparable U.S. GAAP financial measure. Further, Total EBIT excludes EBIT attributable to noncontrolling interests and EBIT attributable to discontinued operations and is not a measure of consolidated operating results under U.S. GAAP and should not be considered as an alternative to Net income (loss) or any other measure of consolidated operating results under U.S. GAAP. See the reconciliation of Net income (loss) attributable to Bunge shareholders to Total EBIT below.\nNet Income (Loss) Attributable to Bunge Shareholders -\nFor the three months ended September 30, 2025, Net income attributable to Bunge shareholders was $166 million, a decrease of $55 million compared to $221 million, for the three months ended September 30, 2024. For the nine months ended September 30, 2025, Net income attributable to Bunge was $721 million, an increase of $186 million, compared to $535 million for the nine months ended September 30, 2024. The decrease for the three months ended September 30, 2025, was primarily due to higher net interest expense due to increased debt levels to finance the Acquisition as well as lower Corporate and Other EBIT, partially offset by higher Segment EBIT, as further discussed in the\nSegment Overview & Results of Operations\nsection below. The increase for the nine months ended September 30, 2025 was due to higher Segment EBIT, partially offset by lower EBIT in our Corporate and Other activities, as further discussed in the\nSegment Overview & Results of Operations\nsection below, and higher income tax expense as discussed further below.\nNet income (loss) attributable to Bunge shareholders - Earnings per share - Diluted -\nFor the three months ended September 30, 2025, Net income attributable to Bunge shareholders - diluted, was $0.84 per share, a decrease of $0.72 per share, compared to $1.56 per share for the three months ended September 30, 2024. For the nine months ended September 30, 2025, Net income attributable to Bunge shareholders - diluted, was $4.60 per share, an increase of $0.87 per share, compared to income of $3.73 per share for the nine months ended September 30, 2024.\n- For the three months ended September 30, 2025, Total EBIT was $403 million, a decrease of $4 million compared to $407 million for the three months ended September 30, 2024. For the nine months ended September 30, 2025, Total EBIT was $1,269 million, an increase of $244 million compared to Total EBIT of $1,025 million for the nine months ended September 30, 2024. The decrease in Total EBIT for the three months ended September 30, 2025, was primarily due to lower Corporate and Other EBIT, resulting from higher SG&A expense, partially offset by higher Segment EBIT, resulting primarily from higher gross profit in both of our Soybean Processing and Refining and Softseed Processing and Refining segments, as further discussed in the\nSegment Overview & Results of Operations\nsection below. The increase for the nine months ended September 30, 2025, was primarily due to higher Segment EBIT, resulting primarily from higher gross profit in our Soybean Processing and Refining segment, partially offset by lower Corporate and Other EBIT, resulting from higher SG&A expense, as further discussed in the\nSegment Overview & Results of Operations\nIncome Tax (Expense) Benefit -\nIncome tax expense was $86 million for the three months ended September 30, 2025 compared to $89 million for the three months ended September 30, 2024. Income tax expense was $290 million for the nine months ended September 30, 2025 compared to $236 million for the nine months ended September 30, 2024. The decrease for the three months ended September 30, 2025 was primarily due to lower pre-tax income in 2025, while the increase for the nine months ended September 30, 2025, was primarily due to higher pre-tax income in 2025.\nLiquidity and Capital Resources\n– At September 30, 2025, working capital, which equals Total current assets less Total current liabilities, was $10,622 million, an increase of $2,394 million, compared to working capital of $8,228 million at September 30, 2024, and an increase of $2,099 million, compared to working capital of $8,523 million at December 31, 2024. The increase in working capital at September 30, 2025, compared to September 30, 2024, and December 31, 2024, respectively, was primarily due to higher Inventories and Other current assets, partially offset by higher Short-term debt, as further discussed in\nLiquidity and Capital Resources\nSegment Overview & Results of Operations\nEffective July 1, 2025, we changed our reportable segments to align with our new value chain operational structure as a result of the completion of the Acquisition of Viterra. See\nNote 19 - Segment Information\nto our condensed consolidated financial statements. Further, we enhanced our volume reporting to align with the new segment reporting structure and with the Company's primary income-generating activities. Volumes are now reported as follows:\nSoybean Processing and Refining volumes represent (1) oilseed volumes processed (crushed) during a period, which approximate sales volumes to third parties during the same reporting period (2) merchandised volumes, which represent sales volumes of soybeans to third-party customers during a reporting period and (3) a supplemental refined oil production volume, which will also be provided representing the total refined volume during a reporting period.\nSoftseed Processing and Refining volumes represent (1) oilseed volumes processed (crushed) during a period, which approximate sales volumes to third parties during the same reporting period (2) merchandised volumes, which represent sales volumes of softseeds to third-party customers during a reporting period and (3) a supplemental refined oil production volume, which will also be provided representing the total refined volume during a reporting period.\nOther Oilseeds Processing and Refining volumes represent sales volumes to third-party customers.\nGrain Merchandising and Milling volumes represent sales volumes to third-party customers.\nFurther, effective January 1, 2025, Bunge is no longer separately presenting a Sugar & Bioenergy segment, as discussed in\nNote 19 - Segment Information\nto our condensed consolidated financial statements\nnor presenting Core and Non-core segment results.\nCorresponding prior period amounts have been recast to conform to the current period presentations described above.\nTherefore, our operations are now organized, managed and classified into four reportable segments based upon their similar economic characteristics, nature of products and services offered, production processes, types and classes of customer, and distribution methods. Reportable operations comprise our Soybean Processing and Refining, Softseed Processing and Refining, Other Oilseeds Processing and Refining, and Grain Merchandising and Milling reportable segments.\nOur remaining operations are not reportable segments, as defined by the applicable accounting standard, and are classified as Corporate and Other. Corporate and Other includes salaries and overhead for corporate functions, including acquisition and integration costs related to the Viterra Acquisition, that are not allocated to our individual reportable segments because the operating performance of each reportable segment is evaluated by the Company's chief operating\ndecision maker exclusive of these items, as well as certain other activities including Bunge Ventures, the Company's captive insurance activities, accounts receivable securitization activities, and certain income tax assets and liabilities. Corporate and Other also includes historica"
}