{
  "source_file": "bg-20241231.htm",
  "form_type": "10-K",
  "item1_clean": "bakery premixes. Our corn milling products primarily consist of dry-milled corn meals and flours, flaking and brewers' grits, soy-fortified corn meal, corn-soy blends, snack grits and meals, and other similar products. As part of our corn portfolio, we also sell whole grain and fiber ingredients in addition to wet-milled masa flours, some sold under the\nbrand in the United States. Additionally, we offer organic and non-GMO products in the United States, including corn varieties.\n—The primary customers for our wheat milling products are food processing, bakery, and food service companies. The primary customers for our corn milling products are companies in the food-processing sector, such as cereal, snack, bakery, brewing, and food service companies; industrial manufacturing companies; and the U.S. Government under its humanitarian assistance programs.\n—Competition is based on a variety of factors, including price, raw material procurement, brand recognition, product quality, nutritional profile, dietary trends, and distribution capabilities. In Brazil, our major competitors are M. Dias Branco, J. Macedo, Moinho Anaconda, and Grande Moinho Cearense, as well as many small regional producers. Our major competitors in North American corn milling include Cargill, Didion Inc., SEMO Milling, LLC, Life Line Foods, LLC, and Gruma S.A.B. de C.V.\nCorporate and Other includes salaries and overhead for corporate functions that are not allocated to our individual reporting segments because the operating performance of such reporting segments is evaluated by our chief operating decision maker exclusive of these items, as well as certain other activities including Bunge Ventures, the Company's captive insurance program, accounts receivable securitization activities, and certain income tax assets and liabilities.\nSugar and Bioenergy Segment\nOur Sugar and Bioenergy segment primarily comprised our 50% interest in BP Bunge Bioenergia, which was our joint venture with BP, as well as minor ethanol distribution sales activity. On October 1, 2024, we completed the sale of our 50% interest in BP Bunge Bioenergia to BP.\nThe joint venture was formed to cultivate sugar cane, produce and sell sugar and sugar ethanol, and create power cogeneration activities. The sugar produced at BP Bunge Bioenergia’s mills was sold in both the Brazilian domestic market, primarily in the confectionary and food processing industries, and export markets. The ethanol was sold primarily to customers for use in the Brazilian domestic market to meet demand for fuel, and also exported in the international market.\nBP Bunge Bioenergia operated on a stand-alone basis with a total of 11 mills located across the Southeast, North, and Midwest regions of Brazil. We accounted for our interest in the joint venture under the equity method of accounting. Accordingly, our reported Sugar and Bioenergy results include our share of the net earnings in BP Bunge Bioenergia for the period during which we had an interest in the joint venture. As our long-term goal has been to seek strategic opportunities for our investment in the joint venture, the operations are designated as Non-core in the period prior to the sale.\nRisk management is a fundamental aspect of our business. Our Board of Directors (\"Board\") oversees management’s approach to risk management, which is designed to support the achievement of our strategic objectives and enhance shareholder value. We regularly review our enterprise level risks, emerging risks and assess our risk tolerance levels and the effectiveness of our risk monitoring and risk management efforts. Our Board has established the Enterprise Risk Management Committee (\"ERMC\") to provide greater focus at the Board level on risk oversight tailored to our business and industries. Our Chief Risk Officer (\"CRO\") is the management lead of the ERMC, and oversees the enterprise risk management process of the Company, including climate-related risks and opportunities and their impacts on our business strategy, operations and investments. Additionally, each of our other Board committees considers risks within its area of responsibility. Bunge also has a Management Risk Committee (\"MRC\") in its enterprise risk management (\"ERM\") framework, responsible for reviewing and monitoring key exposures, emerging risks, and drivers of risk. The MRC serves as the most senior management-level risk governance body and reviews on an ongoing basis key enterprise risks, providing oversight for all risk management activities, including our risk framework. The risks covered by the MRC include but are not limited to commodity price risk; market risk; liquidity, interest rate, and financing risk; credit and counterparty risk; country risk; cybersecurity risk; and risks related to climate change. When considering these risks, three criteria are evaluated: the possibility of occurrence, magnitude of risk, and power to mitigate. These risks are directly linked to the substantive impact understood by Bunge, which include but are not limited to the impact related to the potential loss of customer demand for our products or the ability to supply products in sufficient volumes to meet demand.\nThe primary risks that our company is subject to are discussed under the heading \"Item 1A. Risk Factors\" and we also describe our efforts to hedge and actively manage our market risks, including those associated with our positions in physical and derivative markets for agricultural commodities, energy, inland and ocean freight, foreign currency, and interest rates under the heading \"Item 7A. Quantitative and Qualitative Disclosures About Market Risk.\"\nIn each country in which we conduct business, our operations and assets are subject to varying degrees of risk and uncertainty. We financially insure our businesses and assets in each country in a manner that we deem appropriate for a company of our size and activities, including against certain risks associated with the ongoing Ukraine-Russia war, based on an analysis of the relative risks, costs, and market availability of insurance. We believe that our geographic dispersion of assets helps mitigate the risk to our business from an adverse event affecting a specific facility. However, if we were to incur a significant loss or liability for which we were not insured in full or in part, it could have a materially adverse effect on our business, financial condition, and results of operations.\nOperating Segments and Geographic Areas\nWe have included financial information about our reportable segments and our operations by geographic area in\nNote 26- Segment Information\nResearch and Development, Innovation, Patents, and Licenses\nOur research and development activities are focused on developing products and improving processes that will drive growth or otherwise add value to our core business operations and create value for our customers. In our refined and specialty oils and milling businesses, we have several research and development centers globally to support product development and enhancement, working alongside our key customers. We monitor the latest advancements in our core areas via an external technology scouting program. Additionally, Bunge Ventures, our corporate venture capital and private capital markets principal investing arm, invests in start-ups and other early-stage companies that are developing new technologies relevant to our industries. Additionally, we invest capital and human resources in digital innovations, aimed at using technology, data and analytics to improve how we perform our most important functions across our value chains, including origination, production,\nlogistics, and customer experience.\nWe own trademarks, patents, and licenses covering certain of our products and manufacturing processes. However, neither our business as a whole nor any segment is dependent on any specific trademark, patent, or license.\nIn our Agribusiness segment, while there is a degree of seasonality in the growing season and procurement of our principal raw materials, such as oilseeds and grains, we typically do not experience material fluctuations in volume between the first and second half of the year, since we are geographically diversified between the northern and southern hemispheres, and we sell and distribute products throughout the year. However, the first quarter of the year has generally been our weakest in terms of financial results due to the timing of the North and South American oilseed harvests, as the North American harvest peaks in the third and fourth quarters, and the South American harvest peaks in the second quarter. Our North and South American grain merchandising and oilseed processing activities are, therefore, generally at lower levels during the first quarter.\nIn our Refined and Specialty Oils and Milling segments, demand for certain of our food items may be influenced by holidays and other annual events.\nGovernment Regulation\nIn each of the countries in which we operate, we are subject to a variety of laws and regulations governing various aspects of our business, including general business regulations as well as those governing the manufacturing, production, handling, storage, transport, marketing, and sale of our products. These include laws and regulations relating to facility licensing and permitting, food, and feed safety, the handling and production of regulated substances, nutritional and labeling requirements, global trade compliance and other matters. Our operations and those of our suppliers are also subject to restrictions on land use in certain protected areas, forestry reserve requirements, limitations on water use, as well as other environmental regulations. Additionally, from time-to-time, agricultural production shortfalls in certain regions, and growing demand for agricultural commodities for feed, food, and fuel use have caused prices for relevant agricultural commodities to rise. High commodity prices and regional crop shortfalls have led, and in the future may lead, governments to impose price controls, tariffs, export restrictions and other measures designed to ensure adequate domestic supplies and/or mitigate price increases in their domestic markets, as well as increase the scrutiny of competitive conditions in their markets.\nMany countries use and produce biofuels as alternatives to traditional fossil fuels. Biofuels convert crops, such as sugarcane, corn, soybeans, palm, rapeseed, canola, and other oilseeds, into ethanol, renewable diesel, or biodiesel to extend, enhance or substitute for fossil fuels. Production of biofuels has increased significantly in the last decade in response to both periods of high fossil fuel prices and to government incentives to produce biofuels offered in many countries, including the United States, Brazil, Argentina, and several South-East Asian and European countries. Furthermore, in several countries, governmental authorities are mandating biofuel use in transport fuels at specified levels. As such, the markets for agricultural commodities used in the production of biofuels have become increasingly affected by the growth of the biofuels industry and related legislation.\nWe are subject to various environmental protection and occupational health and safety laws and regulations in the countries in which we operate, and we incur costs to comply with these requirements. Compliance with applicable laws and regulations relating to environmental matters has not had a material financial or competitive effect on our business. However, due to our extensive operations across multiple industries and jurisdictions globally, we are exposed to the risk of claims and liabilities under these laws and regulations. Violations can result in substantial fines, administrative sanctions, criminal penalties, revocations of operating permits and/or shutdowns of our facilities, litigation, and other liabilities, as well as damage to our reputation.\nOur b",
  "item7_clean": "Includes components of long-term debt attributable to unamortized premiums of $32 million and excludes components of long-term debt attributable to fair value hedge accounting of $269 million.\nRepresents future minimum payments under non-cancelable leases with initial terms of one year or more. Minimum lease payments have not been reduced by minimum sublease income receipts of $57 million due in future periods under non-cancelable subleases.\nRepresents purchase commitments for time on ocean freight vessels and railroad freight lines for the purpose of transporting agricultural commodities. The ocean freight service agreements are short term contracts with a duration of less than a year. Ocean freight service agreements with terms in excess of one year are included in non-cancelable lease obligations. The railroad freight service agreements require a minimum monthly payment regardless of the actual level of freight services used. The costs of our freight supply agreements are typically passed through to our customers as a component of the prices we charge for our products. However, changes in the market value of such freight services compared to the rates at which we have contracted them may affect margins on the sales of agricultural commodities.\nRepresents other purchase commitments and obligations, such as take-or-pay contracts, throughput contracts, and debt commitment fees.\nDoes not include estimated payments of liabilities associated with uncertain income tax positions. As of December 31, 2024, Bunge had uncertain income tax liabilities of $75 million, including interest and penalties. At this time, we are unable to make a reasonably reliable estimate of the timing of payments in individual years in connection with these tax liabilities; therefore, such amounts are not included in the above contractual obligations table. See\nNote 14- Income Taxes\nto our consolidated financial statements.\nEmployee Benefit Plans\nWe expect to contribute $14 million to our defined benefit pension plans and $4 million to our postretirement benefit plans in 2025. Further, we expect approximately $508 million in benefit payments related to our defined benefit pension and postretirement benefit plans in 2025. The expected benefit payments in 2025 include $487 million related to the lump sum payments and transfer of all remaining benefits due to the future conversion of the buy-in contract to a buy-out arrangement for one of Bunge's defined benefit U.S. pension plans. See\nNote 18- Employee Benefit Plans\nfor further information.\nCritical Accounting Policies and Estimates\nOur accounting policies are more fully described in\nNote 1- Nature of Business, Basis of Presentation and Significant Accounting Policies\nForeign Currency Transactions and Translation of Foreign Currency Financial Statements\nOur reporting currency is the U.S. dollar. The functional currency of the majority of our foreign subsidiaries is their local currency. The determination of functional currency may require significant judgment to identify the currency of the primary economic environment in which a subsidiary operates. This may include an evaluation of a number of economic factors including, cash flow, sales price, sales market, expense, and financing indicators, as well, as the extent of the subsidiary’s intra-entity transactions. However, in accordance with U.S. GAAP, if a foreign entity's economy is determined to be highly inflationary, then such foreign entity's financial statements are remeasured as if the functional currency were the reporting currency.\nMonetary assets and liabilities denominated in currencies other than the functional currency are remeasured into their respective functional currencies at exchange rates in effect at the balance sheet date. The resulting exchange gain or loss is included in our consolidated statements of income as Foreign exchange (losses) gains - net unless the remeasurement gain or loss relates to an intercompany transaction that is of a long-term investment nature and for which settlement is neither planned nor anticipated in the foreseeable future, in which case the remeasurement gain or loss is reported as a component of Accumulated other comprehensive loss in our consolidated balance sheets.\nAt period-end, amounts included in the consolidated statements of income, comprehensive income, cash flows, and changes in equity are translated using average exchange rates during each period. Assets and liabilities are translated at period-end exchange rates and resulting foreign currency translation adjustments are recorded in the consolidated balance sheets as a component of Accumulated other comprehensive loss.\nInventories and Commodity Derivatives\nOur RMI, forward RMI purchase and sale contracts, and exchange-traded futures and options are primarily valued at fair value. RMI are freely-traded, have quoted market prices, may be sold without significant additional processing and have predictable and insignificant disposal costs (see\nto our consolidated financial statements for RMI balances as of December 31, 2024). We estimate the fair values of commodity inventories and forward purchase and sale contracts on these inventories based on commodity futures exchange quotations, broker or dealer quotations, or market transactions in either listed or over-the-counter (\"OTC\") markets with appropriate adjustments for differences in local markets where our inventories are located. Certain inventories may utilize significant unobservable data related to local market adjustments to determine fair value. The significant unobservable inputs for RMI and physically-settled forward purchase and sale contracts relate to certain management estimates regarding transportation costs and other local market or location-related adjustments, primarily freight-related adjustments in the interior of Brazil and the lack of market corroborated information in Canada. In both situations, we use proprietary information such as purchase and sale contracts and contracted prices to value freight, premiums, and discounts in our contracts. Counterparty credit and performance risk on forward commodity purchase and sale contracts is included in the determination of fair value. From time to time, we have experienced instances of counterparty non-performance as a result of significant declines in counterparty profitability under these contracts due to movements in commodity prices between the time the contracts were executed and the contractual forward delivery period. However, based on historical experience with our suppliers and customers, our own credit risk, and knowledge of current market conditions, we do not view non-performance risk to be a significant input to fair value for the majority of our forward commodity purchase and sale contracts.\nChanges in the fair values of these inventories and contracts are recognized in our consolidated statements of income as a component of Cost of goods sold. If we used different methods or factors to estimate fair values, amounts reported as Inventories and Unrealized gains and losses on derivative contracts in the consolidated balance sheets and Cost of goods sold in the consolidated statements of income could differ. Additionally, if market conditions change subsequent to year-end, amounts reported in future periods as Inventories, Unrealized gains and losses on derivative contracts, and Cost of goods sold could differ. See\nNote 15- Fair Value Measurements\nto our consolidated financial statements for further details of commodity inventories and forward purchase and sale contracts on these inventories carried at fair value.\nDerivatives - Designated Hedging Activities\nWe manage currency risk on certain forecasted purchases, sales and selling, general and administrative expenses with currency forwards designated as cash flow hedges. Assuming normal market conditions, the change in the market value of such derivative instruments has historically been, and is expected to continue to be, highly effective at offsetting changes in price movements of the hedged item. Gains and losses arising from open and closed hedging transactions are deferred in Accumulated other comprehensive loss, net of applicable income taxes, and recognized as a component of earnings in the consolidated statement of income in the same caption as the hedged items when the hedged item is recognized in earnings. If it is determined that the derivative hedging instruments are no longer effective at offsetting changes in the price of the hedged item, then the changes in the market value of the derivative instrument would be recorded immediately in the consolidated statements of income in the same caption as the hedged items. See\nNote 16- Derivative Instruments and Hedging Activities\nto our consolidated financial statements for further details and impacts of cash flow hedges on the consolidated financial statements.\nWhen we acquire a business, the consideration is first assigned to identifiable assets and liabilities, including intangible assets, based on estimated fair values, with any excess recorded as goodwill. Determining fair value requires significant estimates and assumptions based on an evaluation of a number of factors, including market participants, projected growth rates, the amounts and timing of future cash flows, the discount rates applied to the cash flows, and the determination of useful life of an asset.\nOur goodwill balance is not amortized to expense. Instead, it is tested for impairment at least annually. We generally perform our annual impairment analysis during the fourth quarter. If events or indicators of impairment occur between annual impairment analyses, we perform an impairment analysis at that date. These events or circumstances could include a significant change in the business climate, legal factors, operating performance indicators, competition, or sale or disposition of a significant asset. In testing for a potential impairment of goodwill, we: (1) determine our reporting units; (2) allocate goodwill to our various reporting units to which the acquired goodwill relates; (3) determine the carrying value, or book value, of our reporting units; (4) estimate the fair value of each reporting unit using a discounted cash flow model and/or a market multiples model based on guideline public companies; (5) compare the fair value of each reporting unit to its carrying value; and (6) if the estimated fair value of a reporting unit is less than the carrying value, we recognize an impairment charge for such amount, but not exceeding the total amount of goodwill allocated to that reporting unit.\nThe process of evaluating the potential impairment of goodwill is subjective and requires significant judgment at many points during the analysis, including the identification of our reporting units, identification and allocation of the assets and liabilities to each of our reporting units, and determination of fair value. In estimating the fair value of a reporting unit for the purposes of our annual or periodic impairment analysis, we make estimates and significant judgments about the future cash flows of that reporting unit aligned with management’s strategic business plans. Changes in judgment related to these assumptions and estimates could result in goodwill impairment charges. We believe the assumptions and estimates used are appropriate based on the information currently available to management. Estimates based on market earnings multiples of peer companies identified for the reporting unit may also be used, where available. Critical estimates in the determination of fair value under the income approach include, but are not limited to, assumptions about variables such as commodity prices, crop and related throughput and production volumes, profitability, future capital expenditures, other expenses, and discount rates, all of which are subject to a high degree of judgment. Critical estimates in the determination of fair value under the market approach include, but are not limited to, determination of the guideline public companies and selection of the market multiples.\nDuring the fourth quarter of 2024, we performed our annual impairment assessment using a discounted cash flow (\"DCF\") method from the income approach and a guideline public companies method (\"GPC\") from the market approach, giving equal emphasis to each. We determined equal emphasis was appropriate as the DCF method captured the growth and margin expectations specific to the reporting units; whereas the GPC method captured market-specific factors using a reasonably similar set of guideline public companies. The results of our annual impairment assessment determined that the estimated fair values of each of our goodwill reporting units exceeded each of their carrying values by a significant amount. See\nto our consolidated financial statements.\nProperty, Plant and Equipment and Other Finite-Lived Intangible Assets\nLong-lived assets include property, plant and equipment and other finite-lived intangible assets. Property, plant and equipment and finite-lived intangible assets are depreciated or amortized over their estimated useful life on a straight line basis. When facts and circumstances indicate the carrying values of these assets may be impaired, an evaluation of recoverability is performed by comparing the carrying value of the assets to the undiscounted projected future cash flows to be generated by such assets from their use and ultimate disposal. If the carrying value of our assets is not recoverable, we recognize an impairment loss in the amount that carrying value exceeds fair value. Impairment is recognized as a charge against results of operations. Our judgments related to the expected useful lives of these assets and our ability to realize undiscounted cash flows in excess of the carrying amount of such assets are affected by factors such as the ongoing maintenance of the assets, changes in economic conditions and changes in operating performance. As we assess the ongoing expected cash flows and carrying amounts of these assets, changes in these factors could cause us to realize material impairment charges.\nInvestments in Affiliates\nWe have investments in various unconsolidated joint ventures accounted for using the equity method, minus impairment. We review our investments annually or when an event or circumstances indicate that a potential decline in value may be other than temporary. We consider various factors in determining whether to recognize an impairment charge, including the length of time the fair value of the investment is expected to be below its carrying value, the financial condition, operating performance and near-term prospects of the affiliate, and our intent and ability to hold the investment for a period of time sufficient to allow for recovery of the fair value. During the third quarter of 2024, certain of the above factors indicated an other than temporary decline in value of one of our minority investments in North America. Critical estimates in the determination of the fair value include, but are not limited to, future expected cash flows, revenue growth, and discount rates. If we used different methods or factors to estimate fair value, the amount of recorded impairment and the carrying value of our investments could differ. Please refer to\nNote 10- Impairments\nNote 11- Investments in Affiliates and Variable Interest Entities\nto our consolidated financial statements for further details.\nWe are a party to a large number of claims and lawsuits, primarily non-income tax and labor claims in Brazil and non-income tax claims in Argentina, and we make provisions for potential liabilities arising from such claims when we deem them probable and reasonably estimable. These estimates of probable loss have been developed in consultation with in-house and outside counsel and are based on an analysis of potential results, assuming a combin",
  "item2_clean": null
}