{
  "source_file": "biib-20250930.htm",
  "form_type": "10-Q",
  "item1_clean": null,
  "item7_clean": "Item 7. Management’s Discussion and Analysis of Financial Condition and Results of Operations\nITEM 3. QUANTITATIVE AND QUALITATIVE DISCLOSURES ABOUT MARKET RISK\nWe are subject to certain risks that may affect our results of operations, cash flow and fair values of assets and liabilities, including volatility in foreign currency exchange rates, interest rate movements and equity price exposure as well as changes in economic conditions in the markets in which we operate as a result of the conflict between Russia and Ukraine and the military conflict in the Middle East. We manage the impact of foreign currency exchange rates and interest rates through various financial instruments, including derivative instruments such as foreign currency forward contracts, foreign currency options, interest rate lock contracts and interest rate swap contracts. We do not enter into financial instruments for trading or speculative purposes. The counterparties to these contracts are major financial institutions, and there is no significant concentration of exposure with any one counterparty.\nFOREIGN CURRENCY EXCHANGE RISK\nOur results of operations are subject to foreign currency exchange rate fluctuations due to the global nature of our operations. As a result, our consolidated financial position, results of operations and cash flow can be affected by market fluctuations in foreign currency exchange rates, primarily with respect to the Euro, British pound sterling, Canadian dollar and Swiss franc.\nWhile the financial results of our global activities are reported in U.S. dollars, the functional currency for most of our foreign subsidiaries is their respective local currency. Fluctuations in the foreign currency exchange rates of the countries in which we do business will affect our operating results, often in ways that are difficult to predict. In particular, as the U.S. dollar strengthens versus other currencies, the value of the non-U.S. revenue will decline when reported in U.S. dollars. The impact to net income as a result of a strengthening U.S. dollar will be partially mitigated by the value of non-U.S. expense, which will also decline when reported in U.S. dollars. As the U.S. dollar weakens versus other currencies, the value of the non-U.S. revenue and expense will increase when reported in U.S. dollars.\nWe have established revenue and operating expense hedging and balance sheet risk management programs to protect against volatility of future foreign currency cash flow and changes in fair value caused by volatility in foreign currency exchange rates.\nDuring the second quarter of 2018 the International Practices Task Force of the Center for Audit Quality categorized Argentina as a country with a projected three-year cumulative inflation rate greater than 100.0%, which indicated that Argentina's economy is highly inflationary. This categorization did not have a material impact on our results of operations or financial position as of September 30, 2025, and is not expected to have a material impact on our results of operations or financial position in the future.\nREVENUE AND OPERATING EXPENSE HEDGING PROGRAM\nOur foreign currency hedging program is designed to mitigate, over time, a portion of the impact resulting from volatility in exchange rate changes on revenue and operating expense. We use foreign currency forward contracts and foreign currency options to manage foreign currency risk, with the majority of our forward contracts and options used to hedge certain forecasted revenue and operating expense transactions denominated in foreign currencies in the next 24 months. We do not engage in currency speculation. For a more detailed disclosure of our revenue and operating expense hedging program, please read\nNote 10, Derivative Instruments,\nto our condensed consolidated financial statements included in this report.\nOur ability to mitigate the impact of foreign currency exchange rate changes on revenue and net income diminishes as significant foreign currency exchange rate fluctuations are sustained over extended periods of time. In particular, devaluation or significant deterioration of foreign currency exchange rates are difficult to mitigate and likely to negatively impact earnings. The cash flow from these contracts are reported as operating activities in our condensed consolidated statements of cash flow.\nBALANCE SHEET RISK MANAGEMENT HEDGING PROGRAM\nWe also use forward contracts to mitigate the foreign currency exposure related to certain balance sheet items. The primary objective of our balance sheet risk management program is to mitigate the exposure of foreign currency denominated net monetary assets and liabilities of foreign affiliates. In these instances, we principally utilize currency forward contracts. We have not elected hedge accounting for the balance sheet related items. The cash flow from these contracts are reported as operating activities in our condensed consolidated statements of cash flow.\nThe following quantitative information includes the impact of currency movements on forward contracts used in our revenue, operating expense and balance sheet hedging programs. As of September 30, 2025 and December 31, 2024, a hypothetical adverse 10.0% movement in foreign currency exchange rates compared to the U.S. dollar across all maturities would result in a hypothetical decrease in the fair value of forward contracts of approximately $289.4 million and $191.7 million, respectively. The estimated fair value change was determined by measuring the impact of the hypothetical exchange rate movement on outstanding forward contracts. Our use of this methodology to quantify the market risk of such instruments is subject to assumptions and the actual impact could be significantly different. The quantitative information about market risk is limited because it does not take into account all foreign currency operating transactions.\nCREDIT RISK\nFinancial instruments that potentially subject us to concentrations of credit risk include cash and cash equivalents, investments, derivatives and accounts receivable. We attempt to minimize the risks related to cash and cash equivalents and investments by investing in a broad and diverse range of financial instruments. We have established guidelines related to credit ratings and maturities intended to safeguard principal balances and maintain liquidity. Our investment portfolio is maintained in accordance with our investment policy, which defines allowable investments, specifies credit quality standards and limits the credit exposure of any single issuer. We minimize credit risk resulting from derivative instruments by choosing only highly rated financial institutions as counterparties.\nWe operate in certain countries where weakness in economic conditions, including the effects of the conflict between Russia and Ukraine and the military conflict in the Middle East, can result in extended collection periods. We continue to monitor these conditions, including the volatility associated with international economies and the relevant financial markets, and assess their possible impact on our business. To date, we have not experienced any significant losses with respect to the collection of our accounts receivable.\nWe believe that our allowance for doubtful accounts was adequate as of September 30, 2025 and December 31, 2024.\nITEM 4. CONTROLS AND PROCEDURES\nDISCLOSURE CONTROLS AND PROCEDURES AND INTERNAL CONTROL OVER FINANCIAL REPORTING\nCONTROLS AND PROCEDURES\nWe have carried out an evaluation, under the supervision and with the participation of our management, including our principal executive officer and principal financial officer, of the effectiveness of the design and operation of our disclosure controls and procedures (as defined in Rules 13a-15(e) or 15d-15(e) under the Securities Exchange Act of 1934, as amended), as of September 30, 2025. Based upon that evaluation, our principal executive officer and principal financial officer concluded that, as of the end of the period covered by this report, our disclosure controls and procedures are effective in ensuring that:\n(b) such information is accumulated and communicated to our management, including our principal executive officer and principal financial officer, as appropriate to allow timely decisions regarding required disclosure.\nIn designing and evaluating our disclosure controls and procedures, our management recognized that any controls and procedures, no matter how well designed and operated, can provide only reasonable assurance of achieving the desired control objectives, and our management necessarily was required to apply its judgment in evaluating the cost-benefit relationship of possible controls and procedures.\nCHANGES IN INTERNAL CONTROL OVER FINANCIAL REPORTING\nThere were no changes in our internal control over financial reporting during the quarter ended September 30, 2025, that have materially affected, or are reasonably likely to materially affect, our internal control over financial reporting.\nPART II OTHER INFORMATION\nITEM 1. LEGAL PROCEEDINGS\nFor a discussion of legal proceedings as of September 30, 2025, please read\nNote 21, Litigation,\nto our condensed consolidated financial statements included in this report, which is incorporated into this item by reference.\nITEM 1A. RISK FACTORS\nRisks Related to Our Business\nWe are substantially dependent on revenue from our products.\nOur revenue depends upon continued sales of our products as well as the financial rights we have in our anti-CD20 therapeutic programs. A significant portion of our revenue is concentrated on sales of our products in increasingly competitive markets. Any of the following negative developments relating to any of our products or any of our anti-CD20 therapeutic programs may adversely affect our revenue and results of operations or our stock price:\nthe introduction, greater acceptance or more favorable reimbursement of competing products, including new originator therapies, generics, prodrugs and biosimilars of existing products and products approved under abbreviated regulatory pathways;\nsafety or efficacy issues;\nlimitations and additional pressures on product pricing or price increases, including those relating to inflation and those resulting from governmental or regulatory requirements, including those relating to any future potential drug price negotiation under the IRA or other legislative or executive acts; increased competition, including from generic or biosimilar versions of our products; or changes in, or implementation of, reimbursement policies and practices of payors and other third parties;\nadverse legal, administrative, geopolitical, regulatory or legislative developments; and\nour ability to maintain a positive reputation among patients, healthcare providers and others, which may be impacted by our pricing and reimbursement decisions.\nLEQEMBI is in the early stages of commercial launch in the U.S. and certain international markets and SKYCLARYS is in the early stages of commercial launch in certain European markets. In addition to risks associated with new product launches and the other factors described in these Risk Factors, Biogen’s and Eisai’s ability to successfully commercialize LEQEMBI and our ability to successfully commercialize SKYCLARYS may be adversely affected due to:\nEisai’s ability to obtain and maintain adequate reimbursement for LEQEMBI;\nthe effectiveness of Eisai's and Biogen’s commercial strategy for marketing LEQEMBI;\nrequirements such as participation in a registry and the use of imaging or other diagnostics for LEQEMBI;\nour ability to obtain approval in other markets;\nthe approval and/or greater acceptance of other new products for the same or similar indications;\nEisai’s and Biogen’s ability to maintain a positive reputation among patients, healthcare providers and others in the Alzheimer’s disease community, which may be impacted by pricing and reimbursement decisions relating to LEQEMBI, which are made by Eisai and/or third parties;\nBiogen's ability to obtain and maintain adequate reimbursement for SKYCLARYS; and\nthe effectiveness of Biogen's commercial strategy for marketing SKYCLARYS.\nOur long-term success depends upon the successful development of new products and additional indications for our existing products.\nOur long-term success depends upon the successful development of new products from our research and development activities or our licenses or acquisitions from third parties, as well as the development of additional indications for our existing products. Product development is very expensive and involves a high degree of uncertainty and risk and is not always successful. Only a small number of research and development programs result in the commercialization of a product. It is difficult to predict the success and the time and cost of product development of novel approaches for the treatment of diseases. The development of novel approaches for the treatment of diseases, including development efforts in new modalities such as those based on the ASO platform and gene therapy, presents additional challenges and risks, including obtaining approval from regulatory authorities that have limited experience with the development of such therapies. For example, we are currently seeking approval\nof a subcutaneous formulation of LEQEMBI as a starting dose in the U.S. and any delays or challenges may impact our ability to realize the anticipated benefits from LEQEMBI.\nClinical trial data are subject to differing interpretations and even if we view data as sufficient to support the safety, effectiveness and/or approval of a product candidate, regulatory authorities may disagree and may require additional data, limit the scope of the approval or deny approval altogether. Furthermore, the approval of a product candidate by one regulatory agency does not mean that other regulatory agencies will also approve such product candidate.\nSuccess in preclinical work or early stage clinical trials does not ensure that later stage or larger scale clinical trials will be successful. Clinical trials may indicate that our product candidates lack efficacy, have harmful side effects, result in unexpected adverse events or raise other concerns that may significantly reduce or delay the likelihood of regulatory approval. This may result in terminated programs, significant restrictions on use, safety warnings in an approved label, adverse placement within the treatment paradigm or significant reduction in the commercial potential of the product candidate.\nEven if we could successfully develop new products or additional indications for our existing products, we may make a strategic decision to discontinue development of a product candidate or an additional indication for our existing products if, for example, we believe commercialization will be difficult relative to the standard of care or we prioritize other opportunities in our pipeline.\nIf we fail to compete effectively, our business and market position would suffer.\nThe biopharmaceutical industry and the markets in which we operate are intensely competitive. We compete in the marketing and sale of our products, the development of new products and processes, the acquisition of rights to new products with commercial potential and the hiring and retention of personnel. We compete with companies that have a greater number of products on the market and in the product pipeline, substantially greater financial, marketing, research and development and other resources, and other technological or competitive advantages.\nOur products continue to face increasing competition from the introduction of new originator therapies, generics, prodrugs and biosimilars of existing products and products approved under abbreviated regulatory pathways. Some of these products are likely to be sold at substantially lower prices than our branded products. The introduction of such prod",
  "item2_clean": "Other research and development costs primarily consist of indirect costs incurred in support of overall research and development activities and non-specific programs, including activities that benefit multiple programs, such as management costs, as well as depreciation, information technology and facility-based expenses and are not allocated to a specific program or stage.\nOther segment expense includes: amortization and impairment of acquired intangible assets; collaboration profit sharing/(loss reimbursement); (gain) loss on fair value remeasurement of contingent consideration; restructuring charges; gain on sale of priority review voucher, net; other (income) expense, net; and income tax (benefit) expense\nIn October 2025 we entered into a license agreement with Vanqua to acquire the worldwide rights to Vanqua's preclinical oral C5aR1 antagonist compound. In connection with the closing of this transaction, we expect to make an upfront payment to Vanqua of $\nmillion during the fourth quarter of 2025, which will be recognized within acquired in-process research and development, upfront and milestone expense in our condensed consolidated statements of income.\nSale of BYOOVIZ and OPUVIZ Rights\nIn October 2025 we completed the sale of our remaining commercial rights to two ophthalmology assets in Europe: BYOOVIZ, a ranibizumab biosimilar referencing LUCENTIS, and OPUVIZ, an aflibercept biosimilar referencing EYLEA. Samsung Bioepis will have full responsibility for commercialization of BYOOVIZ upon the transfer of commercial rights from Biogen back to Samsung Bioepis, effective as of January 2026.\nWe expect to recognize a minimal gain within our condensed consolidated statements of income during the fourth quarter of 2025.\nITEM 2. MANAGEMENT'S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS\nThe results of operations of HI-Bio, along with the estimated fair values of the assets acquired and liabilities assumed in the acquisition, have been included in our condensed consolidated financial statements since the closing of the HI-Bio acquisition on July 2, 2024.\nEXECUTIVE SUMMARY\nINTRODUCTION\nBiogen is a global biopharmaceutical company focused on discovering, developing and delivering innovative therapies for people living with serious and complex diseases. We have a broad portfolio of medicines to treat MS, have introduced the first approved treatment for SMA, co-developed treatments to address a defining pathology of Alzheimer’s disease and launched the first approved treatment to target a genetic cause of ALS. We market the first and only drug approved in the U.S., the E.U. and certain international markets for the treatment of FA in adults and adolescents aged 16 years and older. We are focused on advancing our pipeline in neurology, specialized immunology and rare diseases. We support our drug discovery and development efforts through internal research and development programs, external collaborations and acquisitions.\nOur marketed products include TECFIDERA, VUMERITY, AVONEX, PLEGRIDY and TYSABRI for the treatment of MS; SPINRAZA for the treatment of SMA; SKYCLARYS for the treatment of FA; and QALSODY for the treatment of ALS.\nWe also have collaborations with Eisai on the commercialization of LEQEMBI for the treatment of Alzheimer's disease and Supernus on the commercialization of ZURZUVAE for the treatment of PPD. We have certain business and financial rights with respect to RITUXAN for the treatment of non-Hodgkin's lymphoma, CLL and other conditions; RITUXAN HYCELA for the treatment of non-Hodgkin's lymphoma and CLL; GAZYVA for the treatment of CLL, follicular lymphoma and, following its approval in October 2025, lupus nephritis; OCREVUS for the treatment of PPMS and RMS; LUNSUMIO for the treatment of relapsed or refractory follicular lymphoma; COLUMVI, a bispecific antibody for the treatment of non-Hodgkin's lymphoma; and have the option to add other potential anti-CD20 therapies, pursuant to our collaboration arrangements with Genentech, a wholly-owned member of the Roche Group.\nWe commercialize a portfolio of biosimilars of advanced biologics including: BENEPALI, an etanercept biosimilar referencing ENBREL; IMRALDI, an adalimumab biosimilar referencing HUMIRA; FLIXABI, an infliximab biosimilar referencing REMICADE; and BYOOVIZ, a ranibizumab biosimilar referencing LUCENTIS, in certain international markets. We also have commercialization rights related to OPUVIZ, an aflibercept biosimilar referencing EYLEA, in certain international markets.\nFor additional information on our collaboration arrangements, please read\nNote 19, Collaborative and Other Relationships,\nto our condensed consolidated financial statements included in this report.\nWe seek to ensure an uninterrupted supply of medicines to patients around the world. To that end, we regularly review our manufacturing capacity, capabilities, processes and facilities. In order to support our future growth and drug development pipeline, we expanded our large molecule production capacity and built a large-scale biologics manufacturing facility in Solothurn, Switzerland. Solothurn is operational and has been approved for the manufacture of LEQEMBI. We believe that the Solothurn facility will support our anticipated near to mid-term needs for the manufacturing of biologic assets. The plant represents a significant increase in our overall manufacturing capacity. Additionally, we continue to invest to modernize, automate and support the capacity requirements for our pipeline and existing products at our existing manufacturing facilities in RTP, North Carolina. If we are unable to fully utilize our manufacturing facilities, we will incur additional excess capacity charges which would have a negative effect on our financial condition and results of operations.\nIn the longer term, our revenue growth will depend upon the successful clinical development, regulatory approval and launch of new commercial products as well as additional indications for our existing products, our ability to obtain and maintain patents and other rights related to our marketed products, assets originating from our research and development efforts and/or successful execution of external business development opportunities.\nBUSINESS ENVIRONMENT\nThe biopharmaceutical industry and the markets in which we operate are intensely competitive. Many of our competitors are working to develop or have commercialized products similar to those we market. In addition, the commercialization of certain of our own approved products, products of our collaborators and pipeline product candidates may negatively impact future sales of our existing products.\nOur products and revenue streams continue to face increasing competition in many markets from the introduction of new originator therapies, generics, biosimilars of existing products and products approved under abbreviated regulatory pathways. Some of these products are likely to be sold at substantially lower prices than branded products. Accordingly, the introduction of such products as well as other lower-priced competing products has, and in the future, may significantly reduce both the price that we are able to charge for our products and the volume of products we sell, which can negatively impact our revenue. In addition, in some markets, when a generic or biosimilar version of one of our products is commercialized, it may be automatically substituted for our product and significantly reduce our revenue in a short period of time.\nSales of our products depend, to a significant extent, on the availability and extent of adequate coverage, pricing and reimbursement from government health administration authorities, private health insurers and other organizations. When a new pharmaceutical product is approved, the availability of government and private reimbursement for that product may be uncertain, as is the pricing and amount for which that product will be reimbursed.\nDrug prices are under significant scrutiny in the markets in which our products are prescribed; for example the IRA has certain provisions related to drug pricing, including the ability for the U.S. government to set prices for certain drugs in Medicare. We expect drug pricing and other healthcare costs will continue to be subject to political and societal pressures on a global basis. As the policy environment remains dynamic, we will continue to monitor how uncertainty with respect to how the U.S. and foreign tariffs and the U.S. and international pricing may impact our business in the future.\nAdditionally, our ability to set the price for our products varies significantly from country to country and, as a result, so can the price or reimbursement of our products. Governments may use a variety of cost-containment measures to control the cost of products, including price cuts, mandatory rebates, value-based pricing and reference pricing (i.e., referencing prices in other countries and using those reference prices to set a price).\nOur failure to obtain or maintain adequate coverage, pricing or reimbursement for our products could have an adverse effect on our business, reputation, revenue and results of operations, could curtail or eliminate our ability to adequately fund research and development programs for the discovery and commercialization of new products and/or could cause a decline or volatility in our stock price.\nIn addition to the impact of competition, pricing actions and other measures being taken worldwide designed to reduce healthcare costs and limit the overall level of government expenditures, our sales and operations could also be affected by other risks of doing business internationally, including the impact of public health epidemics on employees, the global economy and the delivery of healthcare treatments, geopolitical events, tariffs, supply chain disruptions, foreign currency exchange fluctuations, changes in intellectual property legal protection"
}