{
  "source_file": "bldr-20250930.htm",
  "form_type": "10-Q",
  "item1_clean": null,
  "item7_clean": null,
  "item2_clean": "As a percentage of net sales, selling, general and administrative expenses increased to 24.6%, up from 22.6%, for the three months ended September 30, 2025 and 2024, respectively, primarily attributable to reduced operating leverage.\nInterest Expense, Net.\nInterest expense was $69.3 million in the third quarter of 2025, an increase of $15.0 million from the third quarter of 2024. The increase was primarily due to higher average debt balances.\nWe recorded income tax expense of $37.1 million and $89.0 million in the third quarters of 2025 and 2024, respectively. The decrease in the tax expense was primarily driven by a decrease in income before income taxes in the current period. Our effective tax rate was 23.3% in the third quarter of 2025, a decrease from 23.8% in the third quarter of 2024, primarily related to decreased permanent and other differences.\nNine Months ended September 30, 2025 Compared with the Nine Months ended September 30, 2024\n\nThe cyclical nature of the homebuilding industry;\nGeneral economic conditions in the markets in which we compete;\nThe volatility of lumber prices;\nThe pricing policies of our competitors;\nDisruptions in our supply chain; and\nThe production schedules of our customers.\nThe composition and level of working capital typically change during periods of increasing sales as we carry more inventory and receivables. Working capital levels typically increase in the first and second quarters of the year due to higher sales during the peak residential construction season. These increases may result in negative operating cash flows during this peak season, which historically have been financed through available cash and borrowing availability under credit facilities. Generally, collection of receivables and reduction in inventory levels following the peak building and construction season positively impact cash flow.\n\nOur level of indebtedness results in significant interest expense and could have the effect of, among other things, reducing our flexibility to respond to changing business and economic conditions. From time to time, based on market conditions and other factors and subject to compliance with applicable laws and regulations, we may repurchase or call our notes, repay, refinance or modify our debt or otherwise enter into transactions regarding our capital structure.\nIf industry conditions deteriorate or if we pursue additional acquisitions, we may be required to raise additional funds through the sale of capital stock or debt in the public capital markets or in privately negotiated transactions. There can be no assurance that any of these financing options would be available on favorable terms, if at all. Alternatives to help supplement our liquidity position could include, but are not limited to, idling or permanently closing additional facilities, adjusting our headcount in response to current business conditions, attempts to renegotiate leases, managing our working capital and/or divesting of non-core businesses. There are no assurances that these steps would prove successful or materially improve our liquidity position.\nConsolidated Cash Flows\n\nCash provided by operating activities was $1.0 billion for the nine months ended September 30, 2025, compared to cash provided by operating activities of $1.5 billion for the nine months ended September 30, 2024. The decrease in cash provided by operating activities was largely the result of lower net income in the first nine months of 2025.\nFor the nine months ended September 30, 2025, cash used in investing activities increased $0.6 billion compared to the nine months ended September 30, 2024, primarily due to using an additional $0.6 billion of cash for acquisitions.\nCash provided by financing activities was $0.3 billion for the nine months ended September 30, 2025, which consisted primarily of a net $0.7 billion received for the issuance of the 6.75% 2035 Notes, offset by $0.4 billion for repurchases of common stock. Cash used in financing activities was $0.7 billion for the nine months ended September 30, 2024, which consisted primarily of $1.2 billion for repurchases of common stock and $0.5 billion in net payments on the Revolving Facility, offset by a net $1.0 billion received for the issuance of the 6.375% 2034 Notes.\n\nsales for the three months ended September 30, 2025, were $3.9 billion, a 6.9% decrease from net sales of $4.2 billion for the three months ended September 30, 2024. Core organic sales decreased net sales by 10.6%, primarily due to decreases in the multi-family and single-family customer segments, while commodity price deflation decreased net sales by another 1.1%. These decreases were partially offset by an increase in net sales from acquisitions of 4.8%.\nThe following table shows net sales classified by product category:\n\nAs a percentage of net sales, selling, general and administrative expenses increased to 24.4% up from 22.7% for the nine months ended September 30, 2025 and 2024, respectively, primarily attributable to reduced operating leverage.\nInterest Expense, Net.\nInterest expense was $206.1 million in the nine months ended September 30, 2025, an increase of $51.5 million from the nine months ended September 30, 2024. Interest expense increased primarily due to higher average debt balances.\nWe recorded income tax expense of $114.6 million and $248.8 million for the nine months ended September 30, 2025 and 2024, respectively. The decrease in tax expense was primarily driven by a decrease in income before income taxes in the current period. Our effective tax rate was 22.1% in the first nine months ended September 30, 2025, an increase from 21.9% in the first nine months ended September 30, 2024, primarily related to a decrease in our stock-based compensation windfall benefit, partially offset by permanent and other differences.\nLIQUIDITY AND CAPITAL RESOURCES\n\nOur first and fourth quarters have historically been, and are generally expected to continue to be, adversely affected by weather causing reduced construction activity during these quarters. In addition, quarterly results historically have reflected, and are expected to continue to reflect, fluctuations from period to period arising from the following:\n\nWe believe the housing industry’s long-term outlook is positive and that it remains underbuilt due to growth in the underlying demographics compared to historical new construction levels. However, macroeconomic uncertainty, including fluctuations in interest rates, stock market volatility, impact of changes in tariffs and inflation, may continue to pressure near-term housing industry demand as homes are less affordable for consumers, investors and builders. We believe we are well-positioned to accelerate growth and capture market share as industry conditions improve in the long term. We will continue to focus on working capital by closely monitoring the credit exposure of our customers, maintaining the right level of inventory and by working with our vendors to improve payment terms. We strive to achieve the appropriate balance of short-term expense control while maintaining the expertise and capacity to grow the business.\n\nGross margin decreased $0.2 billion to $1.2 billion. Our gross margin percentage decreased to 30.4% in the third quarter of 2025 from 32.8% in the third quarter of 2024, a 2.4% decrease. This decrease was primarily driven by a below-normal starts environment.\n\nOur leading network of strategically located manufacturing facilities produces factory-built roof and floor trusses, wall panels, vinyl windows, custom millwork and trim, as well as engineered wood that we design and cut specifically for each home. We also assemble interior and exterior doors into pre-hung units for easy installation. Additionally, we distribute a wide range of building products, including lumber, sheet goods, windows, doors, millwork, and specialty items. Our services, which vary by market, include professional installation, turnkey framing, and shell construction. Supported by the latest construction innovations and digital solutions, we help drive greater efficiency across homebuilding.\nRECENT DEVELOPMENTS\nBusiness Combinations\n\nGross margin decreased $0.5 billion to $3.6 billion, and our gross margin percentage decreased to 30.5% for the nine months ended September 30, 2025, from 33.0% in the nine months ended September 30, 2024, a 2.5% decrease. This decrease was primarily attributed to a lower starts environment.\nSelling, General and Administrative Expenses.\nSelling, general and administrative expenses increased $31.5 million, or 1.1%. This increase was primarily due to additional operating expenses from locations acquired within the last twelve months and our ongoing ERP system implementation, partially offset by lower variable compensation due to decreased sales and the absence of prior year asset write-offs.\n\nThree Months Ended September 30, 2025 Compared with the Three Months Ended September 30, 2024\n\nCritical accounting policies are those that are both important to the accurate portrayal of a company’s financial condition and results, and require subjective or complex judgments, often as a result of the need to make estimates about the effect of matters that are inherently uncertain.\nTo prepare financial statements that conform to generally accepted accounting principles, we make estimates and assumptions that affect the amounts reported in our financial statements and accompanying notes. Certain estimates are particularly sensitive due to their significance to the financial statements and the possibility that future events may be significantly different from our expectations.\n\nOur Revolving Facility is primarily used for working capital, general corporate purposes and funding capital expenditures and growth opportunities. In addition, we may use borrowings under the Revolving Facility to facilitate debt repayment and consolidation, and to fund share repurchases. Availability under the Revo"
}