{
  "source_file": "blk-20241231.htm",
  "form_type": "10-K",
  "item1_clean": null,
  "item7_clean": "GAAP.\nOperating income of $7.6 billion increased $1.3 billion and operating margin of 37.1% increased 200 bps from 2023. Increases in operating income and operating margin reflected higher base fees, driven by the positive impact of markets on average AUM, organic base fee growth and fees on AUM acquired in the GIP Transaction, as well as higher performance fees and technology services revenue, partially offset by higher employee compensation and benefits expense, sales, asset and account expense, and general and administration expense. Expense for 2024 was impacted by the GIP Transaction, including nonrecurring retention-related deferred compensation expense, acquisition-related costs and amortization of intangible assets acquired in the GIP Transaction. In addition, expense for 2024 included a $50 million noncash impairment charge related to certain indefinite-lived open-end management contracts. Expense for 2023 included a restructuring charge of $61 million in connection with initiatives to reorganize specific platforms, primarily Aladdin and private markets, to stay ahead of client needs.\n\n(1) Operating income, as adjusted, and operating margin, as adjusted:\nManagement believes operating income, as adjusted, and operating margin, as adjusted, are effective indicators of BlackRock’s financial performance over time, and, therefore, provide useful disclosure to investors. Management believes that operating margin, as adjusted, reflects the Company’s long-term ability to manage ongoing costs in relation to its revenues. The Company uses operating margin, as adjusted, to assess the Company’s financial performance, to determine the long-term and annual compensation of the Company’s senior-level employees and to evaluate the Company’s relative performance against industry peers. Furthermore, this metric eliminates margin variability arising from the accounting of revenues and expenses related to distributing different product structures in multiple distribution channels utilized by asset managers.\n\nIn evaluating whether it is more likely than not that the fair value of indefinite-lived intangibles is less than its carrying value, BlackRock performs certain quantitative assessments and assessed various significant quantitative factors including AUM, revenue basis points, projected AUM growth rates, operating margins, tax rates and discount rates. In addition, the Company considered other qualitative factors including: (1) macroeconomic conditions such as a deterioration in general economic conditions, limitations on accessing capital, fluctuations in foreign exchange rates, or other developments in equity and credit markets; (2) industry and market considerations such as a deterioration in the environment in which the Company operates, an increased competitive environment, a decline in market-dependent multiples or metrics, a change in the market for an entity’s services, or regulatory, legal or political developments; and (3) Company-specific events, such as a change in management or key personnel, overall financial performance and litigation that could affect significant inputs used to determine the fair value of the indefinite-lived intangible asset. If an indefinite-lived intangible is determined to be more likely than not impaired, then the fair value of the asset, which is generally determined using an income approach, is compared with its carrying value and any excess of the carrying value over the fair value would be recognized as an expense in the period in which the impairment occurs.\n\nAcquisition-related costs\n. Acquisition-related costs include adjustments related to amortization and noncash impairment of intangible assets, other acquisition-related costs, including professional services expense and compensation costs for nonrecurring retention-related deferred compensation, and contingent consideration fair value adjustments incurred in connection with certain acquisitions. Management believes excluding the impact of these expenses when calculating operating income, as adjusted, provides a helpful indication of the Company’s financial performance over time, thereby providing helpful information for both management and investors while also increasing comparability with other companies.\n\nOperating income of $8.1 billion increased $1.5 billion and operating margin of 44.5% increased 280 bps from 2023. Earnings per diluted common share increased $5.84, or 15%, from 2023, reflecting higher operating income, partially offset by a higher effective tax rate and lower nonoperating income. The acquisition related expenses and the noncash impairment charge of $50 million described above have been excluded from as adjusted results for 2024. In addition, income tax expense for 2024 excluded the $137 million of benefit and the $14 million net noncash tax expense described above. The pre-tax restructuring charge of $61 million described above has been excluded from as adjusted results for 2023.\n\nLease costs – New York\n. In 2023, the Company continued to recognize lease expense within general and administration expense for both its current headquarters located at 50 Hudson Yards in New York and prior headquarters until the Company's lease on its prior headquarters expired in April 2023. The Company began lease payments related to its current headquarters in May 2023, but began recording lease expense in August 2021 when it obtained access to the building to begin its tenant improvements. Prior to the Company’s move to its current headquarters in February 2023, the impact of lease costs related to 50 Hudson Yards was excluded from operating income, as adjusted. In February 2023, the Company completed the majority of its move to 50 Hudson Yards and no longer excluded the impact of these lease costs. Subsequently, from February 2023 through April 2023, the Company excluded the impact of lease costs related to the Company's prior headquarters. Management believes excluding the impact of these respective New York lease costs (“Lease costs – New York”) when calculating operating income, as adjusted, is useful to assess the Company’s financial performance and ongoing operations, and enhances comparability among periods presented.\n\nRevenue used for calculating operating margin, as adjusted, is reduced to exclude all of the Company’s distribution fees, which are recorded as a separate line item on the consolidated statements of income, as well as a portion of investment advisory fees received that is used to pay distribution and servicing costs. For certain products, based on distinct arrangements, distribution fees are collected by the Company and then passed-through to third-party client intermediaries. For other products, investment advisory fees are collected by the Company and a portion is passed-through to third-party client intermediaries. However, in both structures, the third-party client intermediary similarly owns the relationship with the retail client and is responsible for distributing the product and servicing the client. The amount of distribution and investment advisory fees fluctuates each period primarily based on a predetermined percentage of the value of AUM during the period. These fees also vary based on the type of investment product sold and the geographic location where it is sold. In addition, the Company may waive fees on certain products that could result in the reduction of payments to the third-party intermediaries.\n\nAccrued compensation and benefits at December 31, 2024 increased $571 million from December 31, 2023, primarily due to higher 2024 incentive compensation accruals. Accounts payable and accrued liabilities at December 31, 2024 increased $296 million from December 31, 2023, primarily due to higher interest on borrowings and increased accruals, including accruals related to direct fund expense. Contingent consideration liabilities at December 31, 2024 increased $4.2 billion from December 31, 2023, primarily due to the contingent consideration liability in connection with the GIP Transaction, which will be settled all in stock, subject to the achievement of specified performance targets (See Note 3,\n, in the notes to the consolidated financial statements contained in Part II, Item 8 of this filing for more information). Other liabilities at December 31, 2024 decreased $343 million from December 31, 2023, primarily due to lower unit trust payables (substantially offset by a decrease in unit trust receivables recorded within other assets). Deferred income tax liabilities at December 31, 2024 decreased $172 million from December 31, 2023, primarily due to the effects of temporary differences associated with the intellectual property reorganization and the GIP Transaction.\n\nIn 2024, 2023 and 2022, the Company performed its annual impairment assessment, including evaluating various qualitative factors and performing certain quantitative assessments. In 2024, based on this assessment, the Company determined that the indefinite-lived intangible assets related to certain acquired open-end management contracts were impaired, and as a result, recorded a noncash impairment charge of $50 million, included within amortization and impairment of intangible assets expense on the consolidated statements of income. The impairment was primarily the result of a decrease in certain quantitative factors, including reduced growth expectation, lower revenue basis points and net client outflows, which caused the fair value to decline below its carrying value. While the Company believes all assumptions utilized in the analysis are reasonable and appropriate, changes in these estimates could produce different fair value amounts, which could drive additional impairment in future periods. In addition, the Company determined, that no impairment charges were required for any other intangible assets, and that the classification of indefinite-lived versus finite-lived intangibles was still appropriate and no changes were required to the expected lives of the finite-lived intangibles. In 2023 and 2022, the Company determined that no impairment charges were required and that the classification of indefinite-lived versus finite-lived intangibles was still appropriate and no changes were required to the expected lives of the finite-lived intangibles. The Company continuously monitors various factors, including AUM, for potential indicators of impairment.\n\nBlackRock's framework for long-term shareholder value creation is predicated on generating differentiated organic growth, leveraging scale to increase operating margins over time, and returning capital to shareholders on a consistent basis. BlackRock's diversified platform, in terms of style, product, client and geography, enables it to generate more stable cash flows through market cycles, positioning BlackRock to invest for the long-term by striking an appropriate balance between investing for future growth and prudent discretionary expense management.\n\nCash and cash equivalents at December 31, 2024 included $169 million of cash held by CIPs (see\nLiquidity and Capital Resources\nfor details on the change in cash and cash equivalents during 2024). Accounts receivable at December 31, 2024 increased $388 million from December 31, 2023, primarily due to higher base and performance fee receivables. Investments at December 31, 2024 increased $29 million from December 31, 2023 (for more information see\nherein). Goodwill and intangible assets, net at December 31, 2024 increased $12.9 billion from December 31, 2023, primarily due to the GIP Transaction and the SpiderRock Transaction, partially offset by amortization of intangible assets and a $50 million noncash impairment charge related to certain indefinite-lived intangible assets. Other assets at December 31, 2024 decreased $261 million from December 31, 2023, primarily related to a decrease in unit trust receivables (substantially offset by a decrease in unit trust payables recorded within other liabilities), partially offset by an increase in certain minority investments.\n\nFor finite-lived intangible assets, if potential impairment circumstances are considered to exist, the Company will perform a recoverability test, using an undiscounted cash flow analysis. Factors included in evaluating finite-lived customer relationships, technology related assets and trade names include technology services revenue trends, customer attrition rates, obsolescence rates, and royalty rates. For finite-lived management contracts, evaluation is based on changes in assumptions including AUM, revenue basis points, projected AUM growth rates, operating margins, tax rates and discount rates. Actual results could differ from these cash flow estimates, which could materially impact the impairment conclusion. If the carrying value of the asset is determined not to be recoverable based on the undiscounted cash flow test, the difference between the book value of the asset and its current estimated fair value would be recognized as an expense in the period in which the impairment occurs.\n\nDuring 2024, BlackRock recorded approximately $2.7 billion of finite-lived management contracts and investor relationships in connection with the GIP Transaction. The acquisition date fair values were determined using an income approach, which applied certain significant assumptions, which are inherently uncertain and unpredictable. These assumptions primarily included discounts rates ranging from 7%-11%, as well as estimated revenue projections based on AUM, AUM growth rates, revenue basis points, operating margins, and tax rates. While the Company believes these assumptions to be reasonable and appropriate, changes in these estimates could produce different fair value amounts.\n\nBlackRock’s strategy continues to be guided by the Company's clients' needs and focus on the long-term, which the Company believes better enables it to deliver durable returns for shareholders and create value for all of its stakeholders. BlackRock’s highly diversified multi-product platform was created to meet client needs in all market environments and provide clients with choice in how they seek to achieve their unique financial goals. BlackRock is positioned to provide alpha-seeking active, private markets, index and cash management investment strategies across asset classes and geographies. In addition, BlackRock leverages its world-class risk management, analytics and technology capabilities, including the Aladdin platform, on behalf of clients. BlackRock serves a diverse mix of institutional and retail clients across the globe, as well as investors in ETFs, maintaining differentiated client relationships and a fiduciary focus. The diversity of BlackRock’s platform facilitates the generation of organic growth in various market environments, and as client preferences evolve. BlackRock’s long-term strategy remains to keep alpha at the heart of BlackRock; drive growth in ETFs, private markets, and technology; be the global leader in sustainable investing; and lead as a whole portfolio advisor.\n\nThe ETF industry has been growing rapidly, driven by structural tailwinds including the use of ETFs as active tools, the migration from commission-based to fee-based wealth management, growth in model portfolios, expansion of digital wealth platforms, and the modernization of the bond market. BlackRock’s ETF growth strategy is centered on increasing scale and pursuing global growth themes in client and product segments, including Core, Strategic, which includes Fixed Income, Factors, Sustainable and Thematic ETFs, and Precision Exposures. BlackRock views ETFs as a technology that facilitates investing, and ETFs have become core to asset management. The Company believes that ETFs will continue to be a structural growth area as clients turn to ETFs as the preferred vehicle for investing strategies of all types. BlackRock has been a leader in expanding the market for ETFs by making th",
  "item2_clean": null
}