{
  "source_file": "bmy-20241231.htm",
  "form_type": "10-K",
  "item1_clean": "Acquisitions, Divestitures, Licensing and Other Arrangements\nProducts, Intellectual Property and Product Exclusivity\nResearch and Development\nMarketing, Distribution and Customers\nPricing, Price Constraints and Market Access\nGovernment Regulation\nSources and Availability of Raw Materials\nManufacturing and Quality Assurance\nEnvironmental Regulation\nHuman Capital Management and Resources\nBristol Myers Squibb Website",
  "item7_clean": "The $8.27 decrease in GAAP EPS in 2024 was primarily driven by a one-time, non-deductible Acquired IPRD charge resulting from the Karuna asset acquisition and SystImmune collaboration, which impacted full-year GAAP EPS by approximately $6.28 and the impact of certain specified items, primarily intangible asset impairments. After adjusting for specified items, the $6.36 decrease in non-GAAP EPS was primarily due to the aforementioned Acquired IPRD charges and higher interest expense partially offset by higher revenues.\nOur non-GAAP financial measures, including non-GAAP earnings and related EPS information, are adjusted to exclude specified items that represent certain costs, expenses, gains and losses and other items impacting the comparability of financial results. For a detailed listing of all specified items and further information, reconciliations and changes to our non-GAAP financial measures refer to “—Non-GAAP Financial Measures.”\nEconomic and Market Factors\nGovernmental Actions\nAs regulators continue to focus on prescription drugs, our products are facing increased pressures across the portfolio. These pressures stem from legislative and policy changes, including price controls, pharmaceutical market access, discounting, changes to tax and importation laws and other restrictions in the U.S., EU and other regions around the world. These pressures have resulted in lower prices, lower reimbursement rates and smaller populations for whom payers will reimburse, which can negatively impact our results of operations (including intangible asset impairment charges), operating cash flow, liquidity and financial flexibility. The IRA directs (i) the federal government to “negotiate” prices for select high-cost Medicare Part D (beginning in 2026) and Part B (beginning in 2028) drugs that are more than nine years (for small-molecule drugs) or 13 years (for biological products) from their initial FDA approval, (ii) manufacturers to pay a rebate for Medicare Part B and Part D drugs when prices increase faster than inflation and (iii) the formation of the Part D Manufacturer Program which replaced the Part D CGDP and established a $2,000 cap for out-of-pocket costs for Medicare beneficiaries as of January 2025, with manufacturers being responsible for 10% of costs up to the $2,000 cap and 20% after that cap is reached. In August 2024, as part of the first round of government price setting pursuant to the IRA, the HHS announced the \"maximum fair price\" for a 30-day equivalent supply of\n, which applies to the U.S. Medicare channel effective January 1, 2026. In January 2025, the HHS selected\nas a medicine subject to \"negotiation\" for government-set prices beginning in 2027. It is possible that more of our products could be selected in future years, which could, among other things, accelerate revenue erosion prior to expiry of intellectual property protections. We continue to evaluate the impact of the IRA on our results of operations, and it is possible that these changes may result in a material impact on our business and results of operations.\nIn addition, in December 2023, the Biden administration released a proposed framework that for the first time proposed that a drug’s price can be a factor in determining that the drug is not accessible to the public and, therefore, that the government could exercise “march-in rights” and license it to a third party to manufacture. We cannot predict whether the Trump administration will finalize the draft framework or if the government will propose other drug pricing policy changes. If pursued and finalized, these policies could reduce prices and reimbursement for certain of our products and could significantly impact our business and consolidated results of operations.\nAt the state level, multiple states have passed, are pursuing or are considering government action via legislation or regulations to change drug pricing and reimbursement (e.g., establishing prescription drug affordability boards, implementing manufacturer mandates tied to the Federal Public Health Service Act drug pricing program, etc.). Some of these state-level actions may also influence federal and other state policies and legislation. Given the current uncertainty surrounding the adoption, timing and implementation of many of these measures, as well as pending litigation challenging such laws, we are unable to predict their full impact on our business. However, such measures could modify or decrease access, coverage, or reimbursement of our products, or result in significant changes to our sales or pricing practices, which could have a material impact on our revenues and results of operations. With respect to the Federal Public Health Service Act drug pricing program, certain states have enacted laws regulating manufacturer pricing obligations under the program to date. Several additional states are considering similar potential legislation or other government actions, and we expect other states may do the same in the future.\nAdditionally, in connection with the IRA, the following changes have been made to U.S. tax laws, including (i) a 15% minimum tax that generally applies to U.S. corporations on adjusted financial statement income beginning in 2023 and (ii) a non-deductible 1% excise tax provision on net stock repurchases after December 31, 2022. Furthermore, countries are in the process of enacting changes to their tax laws to implement the agreement by the OECD to establish a global minimum tax. See risk factors on these items included under “Part I—Item 1A. Risk Factors—Product, Industry and Operational Risks—Increased pricing pressure and other restrictions in the U.S. and abroad continue to negatively affect our revenues and profit margins”, “—We could lose market exclusivity of a product earlier than expected” and “—Changes to tax regulations could negatively impact our earnings.”\nSignificant Product Approvals\nThe following is a summary of the significant approvals received:\nas a treatment for adult patients with ROS1-positive NSCL and for adult and pediatric patients 12 years of age and older with NTRK-positive solid tumors.\nOpdivo Qvantig (nivolumab and hyaluronidase-nvhy)\n\nYear Ended December 31,\nRoyalty income - divestitures\nRoyalty and licensing income\nProvision for restructuring\nIntegration expenses\nLitigation and other settlements\nIntangible asset impairment\nEquity investment losses/(gains), net\nDivestiture losses/(gains)\nOther (income)/expense, net\nInterest expense increased due to higher debt outstanding in connection with the issuance of the 2024 Senior Unsecured Notes. Refer to “Item 8. Financial Statements and Supplementary Data—Note 10. Financing Arrangements” for further information.\nRoyalty income decreased in 2024 primarily due to lower royalty rates for\n* starting in 2024, partially offset by higher royalties from diabetes business divestitures in 2024. Refer to “Item 8. Financial Statements and Supplementary Data—Note 4. Acquisitions, Divestitures, Licensing and Other Arrangements” for further information.\nProvision for restructuring includes exit and other costs primarily related to certain restructuring activities including plans discussed further in “Item 8. Financial Statements and Supplementary Data—Note 6. Restructuring.” Integration expenses includes costs incurred in connection with Celgene and other acquisitions.\nLitigation and other settlements includes amounts related to pricing, sales and promotional practices disputes and securities litigation matters, partially offset by income from the Eisai collaboration termination in 2024. Refer to \"Item 8. Financial Statements and Supplementary Data—Note 5. Other (Income)/Expense, Net.\" Litigation and other settlements in 2023 include $384 million of income related to the AZ settlement and $400 million of income related to the Nimbus' TYK2 program change of control provision, partially offset by $322 million expense recorded in connection with the BeiGene settlement.\nEquity investments generated gains in 2024 compared to losses in 2023 primarily driven by fair value adjustments for investments that have readily determinable fair value. Refer to \"Item 8. Financial Statements and Supplementary Data—Note 9. Financial Instruments and Fair Value Measurements\" for more information.\nOther in 2024 includes pension settlement charges of $119 million, related to the termination of the Bristol-Myers Squibb Puerto Rico, Inc. Retirement Income pension plan.\nYear Ended December 31,\n(Loss)/Earnings before income taxes\nIncome tax provision\nImpact of specified items\nEffective tax rate excluding specified items\nThe effective tax rate for 2024 was primarily impacted by (i) a $12.1 billion one-time, non-tax deductible charge for the acquisition of Karuna, (ii) jurisdictional earnings mix, including amortization of acquired intangible assets, (iii) impacts of impairments of intangible assets, and (iv) a release of income tax reserves of $644 million related to the resolution of Celgene's 2017-2019 IRS audit. Excluding the impact of specified items, the effective tax rate was impacted by the aforementioned Karuna non-tax deductible charge and jurisdictional earnings mix.\nThe effective tax rate for 2023 was primarily impacted by (i) a $656 million deferred income tax benefit following the receipt of a non-U.S. tax ruling regarding the deductibility of a statutory impairment of subsidiary investments, (ii) higher tax benefits attributed to foreign currency on net operating loss and other carryforwards, and (iii) a $193 million valuation allowance reversal related to unrealized equity investment losses. Excluding the impact of specified items, the effective tax rate was impacted by revised guidance regarding deductibility of certain research and development expenses which reduced income taxes attributable to 2023 pre-tax income by approximately $160 million and was the primary reason for a $240 million reduction to previously estimated income taxes for 2022 upon finalization of the U.S. Federal income tax return.\nRefer to “Item 8. Financial Statements and Supplementary Data—Note 7. Income Taxes” for additional information.\nIn December 2022, the EU member states unanimously voted to adopt a Directive implementing the Pillar Two (global minimum tax) rules giving member states until December 31, 2023 to implement the Directive into national legislation. Certain jurisdictions in which we operate, under the OECD/G20 Inclusive Framework, have enacted legislation that adopts a subset of such rules effective January 1, 2024, with the remaining rules becoming effective January 1, 2025. These rules and associated legislative changes may significantly impact our tax provision and results of operations.\nNon-GAAP Financial Measures\nOur non-GAAP financial measures, such as non-GAAP earnings and related EPS information, are adjusted to exclude certain costs, expenses, gains and losses and other specified items that are evaluated on an individual basis. These items are adjusted after considering their quantitative and qualitative aspects and typically have one or more of the following characteristics, such as being highly variable, difficult to project, unusual in nature, significant to the results of a particular period or not indicative of past or future operating results. These items are excluded from non-GAAP earnings and related EPS information because the Company believes they neither relate to the ordinary course of the Company's business nor reflect the Company's underlying business performance. Similar charges or gains were recognized in prior periods and will likely reoccur in future periods, including (i) amortization of acquired intangible assets, including product rights that generate a significant portion of our ongoing revenue and will recur until the intangible assets are fully amortized, (ii) unwinding of inventory purchase price adjustments, (iii) acquisition and integration expenses, (iv) restructuring costs, (v) accelerated depreciation and impairment of property, plant and equipment and intangible assets, (vi) costs of acquiring a priority review voucher, (vii) divestiture gains or losses, (viii) stock compensation resulting from acquisition-related equity awards, (ix) pension, legal and other contractual settlement charges, (x) equity investment and contingent value rights fair value adjustments (including fair value adjustments attributed to limited partnership equity method investments), (xi) income resulting from the change in control of the Nimbus TYK2 Program and (xii) amortization of fair value adjustments of debt acquired from Celgene in our 2019 exchange offer, among other items. Deferred and current income taxes attributed to these items are also adjusted for considering their individual impact to the overall tax expense, deductibility and jurisdictional tax rates. Certain other significant tax items are also excluded such as the impact resulting from a non-U.S. tax ruling regarding the deductibility of a statutory impairment of subsidiary investments and release of income tax reserves relating to the Celgene acquisition. We also provide international revenues for our priority products excluding the impact of foreign exchange. We calculate foreign exchange impacts by converting our current-period local currency financial results using the prior period average currency rates and comparing these adjusted amounts to our current-period results. Reconciliations of these non-GAAP financial measures to the most comparable GAAP measures are included in Exhibit 99.1 to our Form 8-K filed on February 6, 2025 and are incorporated herein by reference.\nNon-GAAP information is intended to portray the results of our baseline performance, supplement or enhance management's, analysts' and investors’ overall understanding of our underlying financial performance and facilitate comparisons among current, past and future periods. This information is not intended to be considered in isolation or as a substitute for the related financial measures prepared in accordance with GAAP and may not be the same as or comparable to similarly titled measures presented by other companies due to possible differences in method and in the items being adjusted. We encourage investors to review our financial statements and publicly-filed reports in their entirety and not to rely on any single financial measure.\nSpecified items were as follows:\n\nYear Ended December 31,\nDollars in millions, except per share data\nNet (loss)/earnings attributable to BMS\nGAAP\nWeighted-average common shares outstanding – diluted – GAAP\nIncremental shares attributable to share-based compensation plans\nWeighted-average common shares outstanding – diluted – Non-GAAP\nDiluted (loss)/earnings per share attributable to BMS\nGAAP\nFinancial Position, Liquidity and Capital Resources\nOur net debt position was as follows:\nCash and cash equivalents\nMarketable debt securities – current\nMarketable debt securities – non-current\nTotal cash, cash equivalents and marketable debt securities\nShort-term debt obligations\nLiquidity and Capital Resources\nWe regularly assess our anticipated working capital needs, debt and leverage ratio levels, debt maturities, capital expenditure requirements, dividend payouts, potential share repurchases and future investments or acquisitions in order to maximize shareholder return, efficiently finance our ongoing operations and maintain flexibility for future strategic transactions. We also regularly evaluate our capital structure to ensure financial risks, adequate liquidity access and lower cost of capital are efficiently managed, which may lead to the issuance of additional debt securities, the repurchase of debt securities prior to maturity or the issuance or repurchase of common stock.\nWe believe that our existing cash, cash equivalents and marketable debt securities together with cash generated from operations in the next few years, and, if required, from the issuance o",
  "item2_clean": null
}