{
  "source_file": "brka-20250930.htm",
  "form_type": "10-Q",
  "item1_clean": null,
  "item7_clean": null,
  "item2_clean": "Forward-Looking Statements\nInvestors are cautioned that certain statements contained in this document as well as some statements in periodic press releases and some oral statements of Berkshire officials during presentations about Berkshire or its subsidiaries are “forward-looking” statements within the meaning of the Private Securities Litigation Reform Act of 1995 (the “Act”). Forward-looking statements include statements which are predictive in nature, which depend upon or refer to future events or conditions, or which include words such as “expects,” “anticipates,” “intends,” “plans,” “believes,” “estimates” or similar expressions. In addition, any statements concerning future financial performance (including future revenues, earnings or growth rates), ongoing business strategies or prospects and possible future Berkshire actions, which may be provided by management, are also forward-looking statements as defined by the Act. Forward-looking statements are based on current expectations and projections about future events and are subject to risks, uncertainties and assumptions about Berkshire and its subsidiaries, economic and market factors and the industries in which we do business, among other things. These statements are not guarantees of future performance and we have no specific intention to update these statements.\n\nLosses and loss adjustment expenses declined $1.2 billion (30.1%) in the third quarter and $484 million (4.9%) in the first nine months of 2025 compared to 2024, and the loss ratio declined 26.5 percentage points in the third quarter and 3.9 percentage points in the first nine months of 2025 compared to 2024. The comparative decline in the third quarter was primarily due to a reduction in ultimate loss estimates for prior accident years’ claims of $190 million in 2025 compared to an increase in ultimate loss estimates of $789 million in 2024. Prior accident years’ ultimate loss estimates increased $211 million in the first nine months of 2025 compared to $561 million in 2024. A significant portion of the year-to-date increases in 2024 and 2025 related to GUARD. Otherwise, the development of estimated ultimate claim liabilities for prior accident years in the first nine months of 2024 reflected lower-than-expected property, medical professional liability and workers’ compensation losses. Claim costs for liability coverages continue to be negatively impacted by unfavorable social inflation trends, including the impacts of jury awards and litigation costs.\n\nPremiums written increased $563 million (5.0%) in the third quarter and $1.8 billion (5.6%) in the first nine months of 2025 compared to 2024, reflecting an increase in policies-in-force. Premiums earned increased $565 million (5.3%) in the third quarter and $1.7 billion (5.3%) in the first nine months of 2025 compared to 2024.\nLosses and loss adjustment expenses increased $413 million (5.4%) in the third quarter and $613 million (2.7%) in the first nine months of 2025 compared to 2024. GEICO’s loss ratio (losses and loss adjustment expenses to premiums earned) was 71.5% in the third quarter and 70.8% in the first nine months of 2025, an increase of 0.1 percentage points and a decrease of 1.8 percentage points, respectively, compared to the corresponding periods in 2024. The loss ratio decline in the first nine months reflected higher average earned premiums per policy, lower claims frequencies, lower catastrophe losses and more favorable development of prior accident years’ claims estimates, partially offset by increases in average claims severities. Losses and loss adjustment expenses from Hurricane Helene were approximately $260 million in the third quarter and first nine months of 2024.\n\nThe industrial products group includes complex metal components and products for aerospace, power and general industrial markets (Precision Castparts Corp. (“PCC”)), specialty chemicals (The Lubrizol Corporation (“Lubrizol”)), metal cutting tools/systems (IMC International Metalworking Companies (“IMC”)), and Marmon Holdings, Inc. (“Marmon”), which consists of more than 100 autonomous manufacturing and service businesses, internally aggregated into twelve groups, and includes equipment leasing for the rail, intermodal tank container and mobile crane industries. The industrial products group also includes equipment and systems for the livestock and agricultural industries (CTB International), drag reducing agents for pipelines (LiquidPower Specialty Products), a structural steel fabrication products business (W&W|AFCO) and beginning in August 2025, a manufacturer of rodent control products (Bell Laboratories).\nRevenues of the industrial products group were $9.5 billion in the third quarter and $28.1 billion in the first nine months of 2025, increases of $515 million (5.8%) and $960 million (3.5%), respectively, compared to the same periods in 2024. Pre-tax earnings increased $362 million (24.3%) in the third quarter and $550 million (11.7%) in the first nine months of 2025 compared to 2024. Pre-tax earnings as a percentage of revenues for the group were 18.7% for the first nine months of 2025, an increase of 1.3 percentage points compared to 2024.\n\nMarmon’s pre-tax earnings increased 19.7% in the third quarter and 7.5% in the first nine months of 2025 compared to 2024. The comparative increase in earnings in the third quarter of 2025 was driven by the Rail & Leasing, Transportation Products, Retail Solutions and Plumbing & Refrigeration groups. The Rail & Leasing group’s earnings increase reflected higher lease rates, gains from asset sales and improved operational efficiencies in the repair operations. The third quarter earnings increase in the Transportation Products and Retail Solutions groups were primarily attributable to higher revenues, whereas the earnings increase in the Plumbing & Refrigeration group reflected higher volumes and copper spreads. Operating results among the twelve business groups for the first nine months of 2025 were mixed compared to 2024. The Plumbing & Refrigeration, Transportation Products, Water Technologies, Retail Solutions, Rail & Leasing, Industrial Products and Specialty groups contributed meaningful increases in earnings, due to a combination of higher revenue, copper spreads and operating margins. These increases were partially offset by declines in the Electrical and Metal Services groups. Earnings in the first nine months of 2025 also included income from the reduction and settlement of liabilities in connection with a prior business acquisition.\n\nPre-tax earnings of our consumer products group were relatively unchanged in the third quarter and declined $105 million (8.0%) in the first nine months of 2025 compared to 2024. In the third quarter of 2025, Duracell determined certain of its battery product components manufactured in the U.S. were eligible for the refundable advanced manufacturing production income tax credits beginning in the 2023 tax year. Duracell recorded the eligible credits for the 2023, 2024 and first nine months of 2025 periods in the third quarter of 2025. Under U.S. GAAP, these credits are reflected in pre-tax earnings, not as income tax expense. Before the impact of these credits, pre-tax earnings of the consumer products group declined significantly in the third quarter and in the first nine months of 2025 compared to 2024. These declines were primarily attributable to lower earnings from Jazwares, Forest River, Duracell, and Fruit of the Loom, generally reflecting lower gross margins and higher selling, general and administrative expenses, as percentages of revenues and were partially offset by higher earnings from Brooks Sports, attributable to a combination of increased sales and gross margins.\n\nBNSF\nRailroad operating revenues increased slightly in the third quarter and first nine months of 2025 compared to 2024. Car/unit volumes increased 0.8% in the third quarter and 2.1% in the first nine months of 2025 compared to the same periods in 2024. Average revenue per car/unit increased 0.8% in the third quarter and declined 1.4% in the first nine months of 2025 versus 2024, generally attributable to lower fuel surcharge revenue and unfavorable business mix, partially offset by core pricing gains. Pre-tax earnings increased 3.6% in the third quarter and 6.8% in the first nine months of 2025 compared to 2024.\nOperating revenues from consumer products were $2.1 billion in the third quarter of 2025, unchanged from 2024, and $6.1 billion in the first nine months, a decrease of 1.4% from 2024. The revenues in 2025 reflected lower average revenue per car/unit, substantially offset by slightly higher volumes. Volumes increased 2.2% in the third quarter and 3.7% in the first nine months of 2025 compared to 2024. The volume increases were primarily due to higher intermodal shipments resulting from higher West Coast imports and an increase in automotive vehicle volumes.\n\nUnderwriting expenses decreased $587 million (29.2%) in the third quarter and $606 million (12.4%) in the first nine months of 2025 compared to 2024. The expense ratio decreased 9.3 percentage points in the third quarter and 1.9 percentage points in the first nine months of 2025 compared to 2024. Underwriting expenses included foreign currency exchange losses from the remeasurement of certain non-U.S. Dollar denominated liabilities of $29 million in the third quarter and $229 million in the first nine months of 2025 and $171 million in the third quarter and $120 million in the first nine months of 2024. Additionally, underwriting expenses in the third quarter and first nine months of 2024 included a $490 million charge in connection with a settlement agreement reached concerning certain non-insurance affiliates that filed voluntary petitions under Chapter 11 of the bankruptcy code in the United States Bankruptcy Court for the District of New Jersey in 2023. See Note 22 to the accompanying Consolidated Financial Statements. Otherwise,"
}