{
  "source_file": "bro-20250930.htm",
  "form_type": "10-Q",
  "item1_clean": null,
  "item7_clean": null,
  "item2_clean": "We are a diversified insurance agency, wholesale brokerage, insurance programs, specialty insurance business and service organization headquartered in Daytona Beach, Florida. As an insurance intermediary, our principal sources of revenue are commissions paid by insurance companies and, to a lesser extent, fees paid directly by customers. Commission revenues generally represent a percentage of the premium paid by an insured and are affected by fluctuations in both premium rate levels charged by insurance companies and the insureds’ underlying “insurable exposure units,” which are units that insurance companies use to measure or express insurance exposed to risk (such as property values, sales or payroll levels) to determine what premium to charge the insured. Insurance companies establish these premium rates based upon many factors, including loss experience, risk profile and reinsurance rates paid by such insurance companies, none of which we control. We also participate in capitalized captive insurance facilities for the purpose of having additional capacity to place coverage, drive additional revenues and to participate in underwriting results. The limit the Company's exposure to claims expenses through reinsurance or by only participating in certain tranches of the underwriting. We also operate registered insurance companies to support our national flood insurance program and to support our cross-collateralized segregated captive cell businesses. We do not participate in earnings of the collateralized segregated captive cells.\nThe volume of business from new and existing customers, fluctuations in insurable exposure units, changes in premium rate levels, changes in general economic and competitive conditions, a reduction of purchased limits, or the occurrence of catastrophic weather events all affect our revenues. For example, higher levels of inflation, an increase in the value of insurable exposure units or a general decline in economic activity, could increase or decrease the value of insurable exposure units. Conversely, increasing costs of litigation settlements and awards could cause some customers to seek higher levels of insurance coverage. Historically, we have grown our revenues as a result of our focus on new business, customer retention and acquisitions. We foster a strong, decentralized sales and service culture, which enables responsiveness to changing business conditions and drives accountability for results.\nThe term “core commissions and fees” excludes profit-sharing contingent commissions, and therefore, it represents the revenues earned directly from specific insurance policies sold, and specific fee-based services rendered. The net change in core commissions and fees reflects the aggregate changes attributable to: (i) net new and lost accounts; (ii) net changes in our customers’ exposure units, deductibles or insured limits; (iii) net changes in insurance premium rates or the commission rate paid to us by our carrier partners; (iv) the net change in fees paid to us by our customers and (v) any businesses acquired or disposed of.\nWe also earn profit-sharing contingent commissions, which are commissions based primarily on underwriting results, but in select situations may reflect additional considerations for volume, growth and/or retention. These commissions, which are included in our commissions and fees in the Consolidated Statements of Income, are estimated and accrued throughout the year based on actual premiums written and knowledge, to the extent it is available, of losses incurred. Payments are primarily received in the first and second quarters of each subsequent year, based upon the aforementioned considerations for the prior year(s), but may differ from the amount estimated and accrued due to the lack of complete visibility regarding loss information until they are received. Over the last three years, profit-sharing contingent commissions have averaged approximately 3.6% of commissions and fee revenues.\nFee revenues primarily relate to services other than securing coverage for our customers, and for fees negotiated in lieu of commissions. Fee revenues are generated by: (i) our Specialty Distribution segment, which earn fees primarily for the issuance of insurance policies on behalf of insurance carriers and (ii) our Retail segment in our large-account customer base, where we primarily earn fees for securing insurance for our customers, in our F&I businesses where we earn fees for assisting our customers with creating and selling warranty and service risk management programs and fees for Medicare Set-aside services, Social Security disability services and Medicare benefits advocacy services. Fee revenues as a percentage of our total commissions and fees, represented 21.1% in 2024 and 23.9% in 2023.\nFor the three months ended September 30, 2025, our total commissions and fees growth rate was 34.2%, and our consolidated Organic Revenue growth rate was 3.5%.\nHistorically, investment and other income has consisted primarily of interest earnings on operating cash and where permitted, on premiums collected and held in a fiduciary capacity before being remitted to insurance companies. Our policy as it relates to the Company’s capital is to invest available funds in high-quality, short-term money-market funds and fixed income investment securities. Investment income also includes gains and losses realized from the sale of investments. Other income primarily reflects other miscellaneous revenues.\n\nIncome before income taxes for the three months ended September 30, 2025 decreased from the third quarter of 2024 by $6 million or 1.9%, due to Acquisition/Integration Costs associated with the acquisition of Accession and increases in the change in estimated acquisition earnout payables, partially offset by Organic Revenue growth, leveraging our expense base, net new business and income from acquisitions completed in the past twelve months.\nInformation Regarding Non-GAAP Financial Measures\nWe view Organic Revenue and Organic Revenue growth as important indicators when assessing and evaluating our performance on a consolidated basis and for each of our two segments, because they allow us to determine a comparable, but non-GAAP, measurement of revenue growth that is associated with the revenue sources that were a part of our business in both the current and prior year and that are expected to continue in the future. We also view EBITDAC, EBITDAC - Adjusted, EBITDAC Margin and EBITDAC Margin - Adjusted as important indicators when assessing and evaluating our performance, as they present more comparable measurements of our operating margins in a meaningful and consistent manner. As disclosed in our most recent proxy statement, we use Organic Revenue growth, and EBITDAC Margin - Adjusted as key performance metrics for our short-term and long-term incentive compensation plans for executive officers and other key employees.\n\n(1) \"Income Before Income Taxes Margin\" is defined as income before income taxes divided by total revenues.\n(2) A non-GAAP financial measure.\nNMF = Not a meaningful figure\nCommissions and Fees\nCommissions and fees, including profit-sharing contingent commissions and earned premiums, for the three months ended September 30, 2025 increased $395 million to $1,550 million, or 34.2%, over the same period in 2024. Core commissions and fees revenue for the third quarter of 2025 increased $349 million or 30.9%, composed of: (i) approximately $40 million of net new and renewal business, which reflects an Organic Revenue growth rate of 3.5%; (ii) $307 million from acquisitions that had no comparable revenues in the same period of 2024; (iii) an increase from the impact of Foreign Currency Translation of $5 million and an offsetting decrease from (iv) $3 million related to commissions and fees revenue from businesses or books of business divested in the preceding twelve months. Profit-sharing contingent commissions for the third quarter of 2025 increased by $46 million, or 170%, compared to the same period in 2024. This increase was driven primarily by (i) improved underwriting results, growth in premium volume and qualifying for certain profit-sharing contingent commissions that we did not qualify for in the prior year and (ii) recent acquisitions.\n\nCommissions and fees, including profit-sharing contingent commissions and earned premiums, for the nine months ended September 30, 2025, increased $638 million to $4,183 million, or 18.0%, over the same period in 2024. Core commissions and fees revenue for the nine months ended September 30, 2025 increased $587 million or 17.1%, composed of: (i) approximately $157 million of net new and renewal business, which reflects an Organic Revenue growth rate of 4.6%; (ii) $429 million from acquisitions that had no comparable revenues in the same period of 2024; (iii) an increase from the impact of Foreign Currency Translation of $11 million and (iv) an offsetting decrease of $10 million related to commissions and fees revenue from businesses or books of business divested in the preceding twelve months. Profit-sharing contingent commissions for the nine months ended September 30, 2025 increased by $51 million, or 46.4%, compared to the same period in 2024. This increase was driven primarily by (i) improved underwriting results, increased premium volume and qualifying for certain profit-sharing contingent commissions that we did not qualify for in the prior year and (ii) recent acquisitions.\nInvestment and Other Income\nInvestment and other income for the three months ended September 30, 2025 increased $25 million from the same period in 2024. Investment income for the nine months ended September 30, 2025 increased $35 million, from the same period in 2024. The increase was driven by approximately $42 million of interest income earned from the proceeds of the Company’s follow-on common stock offering and senior notes issuance in June 2025, which was held "
}