{
  "source_file": "bro-20241231.htm",
  "form_type": "10-K",
  "item1_clean": null,
  "item7_clean": "Other operating expenses represented 14.8% of total revenues for 2024 as compared to 15.3% for the year ended December 31, 2023. Other operating expenses for 2024 increased $60 million, or 9.2%, from the same period of 2023. This change includes: (i) $27 million of other operating expenses related to stand-alone acquisitions that had no comparable costs in the same period of 2023; (ii) increased information technology-related costs; (iii) and to a lesser extent, increased variable costs associated with revenue growth, offset by (iv) the 1Q23 Nonrecurring Cost (v) other operating expenses associated with certain third-party claims administration and adjusting services businesses divested in the fourth quarter of 2023 and (vi) the year-over-year decrease of approximately $21 million in the value of assets held to fund the associated liabilities within our deferred compensation plan, which was substantially offset within employee compensation and benefits, as noted above.\n\nEmployee compensation and benefits expense as a percentage of total revenues was 50.1% for the year ended December 31, 2024 as compared to 51.4% for the year ended December 31, 2023, and increased 10.0%, or $219 million. This increase included $69 million of compensation costs related to stand-alone acquisitions that had no comparable costs in the same period of 2023. Therefore, employee compensation and benefits expense attributable to those offices that existed in the same time periods of 2024 and 2023 increased by $150 million, or 6.9%. This underlying employee compensation and benefits expense increase was primarily related to: (i) an increase in staff costs attributable to new hires; (ii) an increase in producer compensation associated with revenue growth; (iii) an increase in non-cash stock-based compensation driven by the strong financial performance of the Company and (iv) the year-over-year increase of approximately $21 million in the value of deferred compensation liabilities driven by changes in the market prices of our deferred compensation plan, with such amount substantially offset within other operating expenses as we hold assets to fund these liabilities, partially offset by (v) employee compensation and benefits associated with certain third-party claims administration and adjusting services businesses divested in the fourth quarter of 2023.\n\nThe volume of business from new and existing customers, fluctuations in insurable exposure units, changes in premium rate levels, changes in general economic and competitive conditions, a reduction of purchased limits or the occurrence of catastrophic weather events all affect our revenues. For example, higher levels of inflation, an increase the value of insurable exposure units, or a general decline in economic activity, could increase or decrease the value of insurable exposure units. Conversely, increasing costs of litigation settlements and awards could cause some customers to seek higher levels of insurance coverage. Historically, we have grown our revenues as a result of our focus on new business, customer retention and acquisitions. We foster a strong, decentralized sales and service culture, which enables responsiveness to changing business conditions and drives accountability for results.\n\nWe are subject to numerous litigation and claims that arise in the ordinary course of business. If it is probable that a liability has been incurred at the date of the financial statements and the amount of the loss is estimable, an accrual for the costs to resolve these claims is recorded in accrued expenses in the accompanying financial statements. Professional fees related to these claims are included in other operating expenses in the accompanying Consolidated Statement of Income as incurred. Management, with the assistance of in-house and outside counsel, determines whether it is probable that a liability has been incurred and estimates the amount of loss based upon analysis of individual issues. New developments or changes in settlement strategy in dealing with these matters may significantly affect the required reserves and affect our net income.\n\nThe Retail segment’s total revenues in 2024 increased 8.8%, or $221 million, over 2023, to $2,729 million. The $223 million increase in core commissions and fees was driven by the following: (i) approximately $81 million related to the core commissions and fees revenue from acquisitions that had no comparable revenues in the same period of 2023; (ii) an increase of $143 million related to net new and renewal business; (iii) an increase from the impact of Foreign Currency Translation of $8 million; and (iv) an offsetting decrease of $6 million related to commissions and fees recorded in 2023 from businesses since divested. Profit-sharing contingent commissions in 2024 decreased 12.0%, or $6 million, over 2023, to $44 million. This decrease was primarily the result of not qualifying for certain profit-sharing contingent commissions in 2024, due to higher loss ratios experienced by our insurance carrier partners. The Retail segment’s total commissions and fees increased 8.7% and the Organic Revenue growth rate was 5.8% for 2024. The Organic Revenue growth rate was driven by net new business written during the preceding twelve months and growth on renewals of existing customers. Renewal business was impacted by moderating insurance premium rates and exposure units.\n\nAs discussed in Note 15 “Segment Information” of the Notes to Consolidated Financial Statements, we operate three reportable segments: Retail, Programs and Wholesale Brokerage. On a segmented basis, changes in amortization, depreciation and interest expenses generally result from activity associated with acquisitions. Likewise, other income consists primarily of miscellaneous income and therefore can fluctuate between comparable periods. As such, management primarily focuses on the Organic Revenue growth rate and EBITDAC Margin when evaluating the operational efficiency of a segment.\n\nEBITDAC - Adjusted for 2024 increased 7.5%, or $57 million, from the same period in 2023, to $818 million. EBITDAC Margin - Adjusted for 2024 decreased to 30.0% from 30.3% in the same period in 2023. The decrease in EBITDAC Margin - Adjusted was primarily driven by (i) a decrease in profit-sharing contingent commissions, (ii) higher non-cash stock-based compensation and (iii) higher compensation due to investments in employees, which was partially offset by (iv) the net increase in revenue as described above and (v) leveraging our expense base.\n\nThe Programs segment’s total revenue for 2024 increased 19.4%, or $227 million, as compared to the same period in 2023, to $1,400 million. The $185 million increase in core commissions and fees revenue was driven by: (i) approximately $224 million of net new renewal business and fee revenues; (ii) an offsetting decrease of $97 million related to commissions and fees revenue from business divested in the preceding twelve months and (iii) $57 million from acquisitions that had no comparable revenues in the same period of 2023. Profit-sharing contingent commissions in 2024 increased 46.2%, or $30 million, from 2023, to $95 million which was primarily driven by qualifying for certain contingent commissions that we did not qualify for in the prior year, favorable loss ratios, prior year adjustments and acquisitions. Total commissions and fees increase 18.5% and the Organic Revenue growth rate was 22.4% for 2024. The Organic Revenue growth was driven primarily by strong net new business, good retention as well as exposure unit expansion across several of our programs and claims revenue associated with hurricanes Helene and Milton.\n\nTotal debt at December 31, 2023 was $3,796 million net of unamortized discount and debt issuance costs, which was a decrease of $146 million compared to December 31, 2022. The decrease includes: the scheduled principal payments related to our various existing floating-rate debt term notes in total of $250 million; offset by the amortization of discounted debt related to our various unsecured Senior Notes, and debt issuance cost amortization of $4 million and the net increase of $100 million balance on the Revolving Credit Facility.\n\nCommissions and fees, including profit-sharing contingent commissions and earned premiums for 2024, increased $506.0 million to $4,705 million, or 12.1% over 2023. Core commissions and fees in 2024 increased $470 million, composed of (i) approximately $415 million of net new and renewal business, which reflects an Organic Revenue growth rate of 10.4%; (ii) $146 million from acquisitions that had no comparable revenues in the same period of 2023; (iii) an increase from the impact of Foreign Currency Translation of $10 million and (iv) an offsetting decrease of $101 million related to commissions and fees revenue from businesses or books of business divested in the preceding twelve months. Profit-sharing contingent commissions for 2024 increased by $36 million, or 27.7%, compared to the same period in 2023. This increase was driven primarily by (i) improved underwriting results, overall growth of the business, as well as qualifying for certain profit-sharing contingent commissions that we did not qualify for in the prior year and (ii) recent acquisitions.\n\nEBITDAC - Adjusted for 2024 increased 16.8%, or $29 million, from the same period in 2023, to $202 million. EBITDAC Margin - Adjusted for 2024 increased to 32.8% from 32.0% for the same period in 2023 due to: (i) total revenues growth; (ii) certain nonrecurring operating expenses in the prior year; and (iii) leveraging our expense base.\n\nCash flows generated from operating activities totaled $1,174 million and $1,010 million for the years ended December 31, 2024 and 2023, respectively, representing an increase of $164 million, 16.2%. Operating cash flows generated in 2024 included $1,002 million from net income before non-controlling interests with $277 million of non-cash adjustments, offset by $105 million from changes in working capital. The growth in cash from operations is primarily due to increased operating margins from strong organic revenue growth, offset by an increase in our taxes paid, net of refunds, of $84 million mainly due to the 2023 deferral of $121 million related to certain federal income tax payments due to Hurricane Idalia tax relief, which was announced by the Internal Revenue Service (\"IRS\") on August 30, 2023. These deferred income tax payments were paid by the IRS deadline of February 15, 2024.\n\nBeginning January 1, 2024, we no longer exclude Foreign Currency Translation from the calculation of EBITDAC - Adjusted and EBITDAC Margin - Adjusted. Prior periods are presented on the same basis so that the calculations of EBITDAC - Adjusted and EBITDAC Margin - Adjusted are comparable for both periods. We no longer exclude Foreign Currency Translation from the calculation of these earnings measures because fluctuations in Foreign Currency Translation affect both our revenues and expenses, largely offsetting each other. Therefore, excluding Foreign Currency Translation from these earnings measures provides no meaningful incremental value in evaluating our financial performance.\n\nTotal debt at December 31, 2024 was $3,824 million net of unamortized discount and debt issuance costs, which was an increase of $28 million compared to December 31, 2023. The increase includes: the issuance of $600 million senior notes, $150 million of net additions to the Revolving Credit Facility and the amortization of discounted debt related to our various unsecured senior notes and debt issuance cost amortization of $4 million; offset by the repayment of $719 million in senior notes and floating-rate debt balances net of Revolving Credit Facility activity and the addition of deferred financing costs and discount on debt of $7 million.\n\nWe believe that of our significant accounting and reporting policies, the more critical policies include our accounting for revenue recognition, business combinations and purchase price allocations, intangible asset impairments, non-cash stock-based compensation and reserves for litigation. In particular, the accounting for these areas is subject to uncertainty, because it requires significant use of judgment to be made by management. Different assumptions in the application of these policies could result in material changes in our consolidated financial position or consolidated results of operations.\n\nWe are a diversified insurance agency, wholesale brokerage, insurance programs and services headquartered in Daytona Beach, Florida. As an insurance intermediary, our principal sources of revenue are commissions paid by insurance companies and, to a lesser extent, fees paid directly by customers. Commission revenues generally represent a percentage of the premium paid by an insured and are affected by fluctuations in both premium rate levels charged by insurance companies and the insureds’ underlying “insurable exposure units,” which are units that insurance companies use to measure or express insurance exposed to risk (such as property values, sales or payroll levels) to determine what premium to charge the insured. Insurance companies establish these premium rates based upon many factors, including loss experience, risk profile and reinsurance rates paid by such insurance companies, none of which we control. We also participate in capitalized captive insurance facilities (the \"Captives\") for the purpose of having additional capacity to place coverage, drive additional revenues and to participate in underwriting results. The Captives focus on property insurance for earthquake and wind exposed properties underwritten by certain of our MGUs and limit the Company's exposure to claims expenses through reinsurance or by only participating in certain tranches of the underwriting.\n\nIn connection with acquisitions, we record the estimated value of the net tangible assets purchased and the value of the identifiable intangible assets purchased, which primarily consist of purchased customer accounts. Purchased customer accounts include the right to represent insureds or claimants supported by the physical records and files obtained from acquired businesses that contain information about insurance policies, customers and other matters essential to policy renewals of delivery of services. Their value primarily represents the present value of the underlying net cash flows expected to be received over the estimated future duration of the acquired customer relationships. The valuation of purchased customer accounts involves significant estimates and assumptions concerning matters such as cancellation frequency, expenses and discount rates. Any change in these assumptions could affect the carrying value of purchased customer accounts. Purchased customer accounts are amortized on a straight-line basis over the related estimated lives, generally 15 years. The excess of the purchase price of an acquisition over the fair value of the identifiable tangible and intangible assets is assigned to goodwill and is not amortized.\n\nManagement assesses the recoverability of our goodwill and our amortizable intangibles and other long-lived assets annually and whenever events or changes in circumstances indicate that the carrying value of such assets may not be recoverable. Any of the following factors, if present, may trigger an impairment review: (i) a significant underperformance relative to historical or projected future operating results, (ii) a significant negative industry or economic trend, and (iii) a significant decline in our market capitalization. If the recoverability of these assets is unlikely because of the existence of one or more of the above-referenced factors, an impairment analysis is performed. Management must make assumptions regarding estimated future cash flows and other factors to determine the fair value of these assets. I",
  "item2_clean": null
}