{
  "source_file": "bsx-20241231.htm",
  "form_type": "10-K",
  "item1_clean": "Thrombectomy Catheters to treat deep vein thrombosis,\nEKOS™ Ultrasound Assisted Thrombolysis systems used to treat pulmonary embolisms and\nVarithena™ Polidocanol Injectable Foam used to improve the symptoms of superficial venous incompetence and the appearance of visible varicosities.\nOur interventional oncology and embolization product offerings include the following:\nTheraSphere™ Y-90 radioactive glass microspheres used in the treatment of hepatocellular carcinoma (HCC), the most common type of liver cancer,\nRenegade™ HI-FLO™ Microcatheter and Fathom™ Guidewire System and Interlock™ - 35 Fibered IDC™ and Interlock™ - 18 Fibered IDC™ Occlusion System for peripheral embolization,\nEMBOLD™ Detachable Coil System, used for arterial and venous embolizations in the peripheral vasculature and\nICEFX™ and Visual ICE™ Cryoablation Systems for destruction of tissue, using image-guided needles to enable cryoablation visualization for optimal tumor coverage\nIn the third quarter of 2024, we completed our acquisition of Silk Road Medical, Inc. (Silk Road Medical), a publicly traded medical device company that has developed an innovative platform of products to prevent stroke in patients with carotid artery disease through a minimally-invasive procedure called transcarotid artery revascularization.\nWe encounter significant competition across our product lines and in each market in which we sell our products and solutions, some from companies that may have greater financial, sales and marketing resources than we do. Our primary competitors include large manufacturers with multiple lines of business and competing products, as well as a wide range of medical device companies that sell a single or limited number of competitive products or participate in only a specific market segment. In certain countries, and particularly in China, we also face competition from domestic medical device companies that may benefit from their status as local suppliers. We also face competition from non-medical device companies, which may offer alternative therapies for disease states that could also be treated using our products, or from companies offering technologies that could augment or replace procedures using our products.\nWe believe that our products and solutions compete primarily on their ability to deliver both differentiated clinical and economic outcomes for our customers by enabling physicians to perform diagnostic and therapeutic procedures safely and effectively often in a less-invasive and cost effective manner. We also compete on ease of use, comparative effectiveness, reliability and physician familiarity. In the current environment of managed care, with economically motivated buyers, consolidation among health care providers, increasing prevalence and importance of regional and national tenders, increased competition and declining reimbursement rates, we are also required to compete on the basis of price, value, reliability and efficiency. We recognize that our continued competitive success will depend upon our ability to:\noffer products and solutions that provide differentiated clinical and economic outcomes,\ncreate or acquire innovative, scientifically advanced technologies,\napply our technology and solutions cost-effectively and with superior quality across product lines and markets,\ndevelop or acquire proprietary products and solutions,\nattract and retain qualified personnel,\nobtain patent or other protection for our products,\nobtain required regulatory and reimbursement approvals,\ncontinually provide quality products and enhance our quality systems and\nsupply sufficient inventory at competitive prices to meet customer demand.\nResearch and Development\nOur investment in research and development is critical to driving our future growth. Our investment in research and development supports the following:\ninternal research and development programs, regulatory design and clinical science, as well as other programs obtained through our strategic acquisitions and alliances and\nengineering efforts that incorporate customer feedback into continuous improvement efforts for currently marketed and next-generation products.\nWe have directed our development efforts toward innovative technologies designed to expand current markets or enter adjacent markets. We continue to transform how we conduct research and development by identifying best practices, driving efficiencies and optimizing our cost structure, which we believe will enable increased development activity and faster concept-to-market timelines. Focused, cross-functional teams take a formal approach to new product design and development, helping us to manufacture and offer innovative products consistently and efficiently. Involving cross-functional teams early in the process is the cornerstone of our product development cycle. We believe this collaboration allows our teams to concentrate resources on the most viable and clinically relevant new products and technologies and to maximize cost and time savings as we bring them to market.\nIn addition to internal development, we work with leading research institutions, universities and clinicians around the world to develop, evaluate and clinically test our products. We continue to expand our collaborations to include research and development teams in our emerging market countries; these teams will focus on both global and local market requirements at a lower cost of development. We believe that these efforts will play a significant role in our future success.\nWe market our products and solutions to hospitals, clinics, outpatient facilities and medical offices in 127 countries worldwide. In addition, large group purchasing organizations, hospital networks and other buying groups are important to our business and represent a substantial portion of our net sales. Each of our businesses maintains dedicated sales forces and marketing teams focused on physicians who specialize in the diagnosis and treatment of different medical conditions, as well as on key hospital service line administrators.\nThe majority of our net sales are derived from countries in which we have direct sales organizations. We also have a network of distributors and dealers who offer our products in certain countries and markets. We expect to continue to leverage our infrastructure in markets where commercially appropriate and use third party distributors in those markets where it is not economical or strategic to establish or maintain a direct presence.\nManufacturing and Raw Materials\nWe are focused on continuously improving our supply chain effectiveness, strengthening our manufacturing processes and increasing operational efficiencies within our organization worldwide. In doing so, we seek to focus our internal resources on the development and commercial launch of new products and the enhancement of existing products. We also drive continuous improvement in product quality through process controls and validations, supplier and distribution controls and training and tools for our operations team. In addition, we remain focused on examining our operations and general business activities to enhance our operational effectiveness by identifying cost-improvement opportunities.\nWe remain committed to maintaining appropriate investments to ensure supply chain stability. We have an ongoing supplier resiliency program which identifies and mitigates risk and have taken measures to mitigate the impact of challenges within the global supply chain in recent years. We consistently monitor our inventory levels, manufacturing, sterilization and distribution capabilities and partnerships and maintain recovery plans to address potential disruptions. Many components used in the manufacturing of our products are readily fabricated from commonly available raw materials or off-the-shelf items available from multiple supply sources; however, certain items are custom made to meet our specifications.\nOn an on-going basis, we track supplier status and inventory in risk areas and take action to prevent shortages, monitoring safety stock levels and building up product supplies as warranted, and mitigating risk of technology and material shortages by identifying new vendors.\nPredictability in the supply of certain raw materials and components used in the manufacturing of our products has improved but continues to be a risk for certain materials and vendors. While we continue to believe we will have access to the raw materials and components that we need, these supply chain dynamics could result in increased costs to us or an inability to fully meet customer demand for certain of our products.\nProprietary Rights and Patent Litigation\nWe rely on a combination of patents, trademarks, trade secrets and other forms of intellectual property to protect our proprietary rights. We generally file patent applications in the U.S. and other countries where patent protection for our technology is appropriate and available. We hold patents worldwide that cover various aspects of our technology. In addition, we hold exclusive and non-exclusive licenses to a variety of third-party technologies covered by patents and patent applications. In the aggregate, these intellectual property assets and licenses are of material importance to our business; however, we believe that no single patent, trade secret, trademark, intellectual property asset or license is material in relation to our business as a whole.\nWe rely on non-disclosure and non-competition agreements with employees, consultants and other parties to protect, in part, trade secrets and other proprietary technology. There has been substantial litigation regarding patent and other intellectual property rights in the medical device industry, particularly in the areas in which we compete. We continue to defend ourselves against claims and legal actions alleging infringement of the patent rights of others. Additionally, we may find it necessary to initiate litigation to enforce our patent rights, to protect our trade secrets or know-how and to determine the scope and validity of the proprietary rights of others. Accordingly, we may seek to settle some or all of our pending litigation, particularly to manage risk over time. Settlement may include cross licensing of the patents that are the subject of the litigation as well as our other intellectual property and may involve monetary payments to or from third parties.\nWe maintain insurance policies providing limited coverage against securities claims. We are substantially self-insured with respect to product liability claims and fully self-insured with respect to intellectual property infringement claims. The absence of significant third-party insurance coverage increases our potential exposure to unanticipated claims or adverse decisions. See\nNote I – Commitments and Contingencies\nRegulatory Environment\nMedical Device Regulatory Approvals\nThe medical devices that we manufacture, market and commercialize are subject to regulation by numerous worldwide regulatory bodies, including the FDA and comparable international regulatory agencies. These agencies require manufacturers of medical devices to comply with applicable laws and regulations governing development, testing, manufacturing, labeling, marketing and distribution. Medical devices are also generally subject to varying levels of regulatory control based on risk level of the device.\nIn the U.S., authorization to distribute a new device can generally be met in one of two ways. The first process requires that a premarket notification (510(k)) be made to the FDA to demonstrate that the device is as safe and effective as, or substantially equivalent to, a legally marketed device (the “predicate” device). Applicants must submit performance data to establish substantial equivalence. In some instances, data from human clinical trials must also be submitted in support of a 510(k) premarket notification. If so, these data must be coll",
  "item7_clean": "In 2022, amounts reflect sales reserves established for Italian government payback provisions, not allocated to reportable segments, which are being disputed in the Italian court system.\nfor further discussion of our net sales and a comparison of our 2024 and 2023 net sales.\nIn 2023, we generated net sales of $14.240 billion compared to $12.682 billion in 2022. This increase of $1.558 billion, or 12.3 percent, included operational growth of 13.1 percent and the negative impact of 80 basis points from foreign currency fluctuations. Operational net sales growth included organic net sales growth of 12.3 percent in 2023 and the positive impact of 80 basis points driven by our majority stake investment in Acotec and the acquisitions of Apollo and Relievant during the first, second and fourth quarters of 2023, respectively, as well as the divestiture of our pathology business during the second quarter of 2023 and our acquisition of Baylis Medical Company, Inc. (Baylis Medical) during the first quarter of 2022, for which there were less than a full prior period of comparable net sales. The increase in our 2023 net sales was primarily driven by acquisitions as well as the strength and diversity of our product portfolio coupled with growth in the underlying markets in which we compete and strong commercial execution.\nOur gross profit was $11.490 billion in 2024 and $9.896 billion in 2023. The following is a reconciliation of our gross profit margins and a description of the drivers of the change from period to period:\nYear Ended December 31, 2022\nManufacturing and supply costs\nSales pricing, volume and mix\nNet impact of foreign currency fluctuations\nAll other, including inventory charges and other period expenses\nYear Ended December 31, 2023\nSales pricing, volume and mix\nAll other, including inventory charges and other period expenses\nYear Ended December 31, 2024\nThe primary factors contributing to the decrease in our gross profit margin for 2024 compared to 2023 were inventory charges, including related to the POLARx™ cryoablation system given the strong commercial adoption of our Farapulse™ Pulsed Field\nAblation System, strategic manufacturing capacity investments and other period expenses, partially offset by increased sales of higher margin products.\nThe primary factors contributing to the increase in our gross profit margin for 2023 compared to 2022 were increased sales of higher margin products, as well as improvements in manufacturing, raw material and component, and freight costs, partially offset by the unfavorable impact of foreign currency and period expenses.\nEU MDR Implementation Costs\nThe EU MDR replaced the existing European Medical Devices Directive (MDD) and Active Implantable Medical Device Directive (AIMDD) regulatory frameworks, and manufacturers of medical devices were required to comply with EU MDR beginning in May 2021 for new products and by May 2024 for medical devices that have a valid CE Certificate to the Directives issued before May 2021. In 2023, updates to the legislative text of the EU MDR were adopted by the European Parliament and the Council of the European Union, including an extension of the transitional period to 2027 for certain high risk class devices and 2028 for lower risk class medical devices that have a valid CE Certificate to the Directives issued before May 2021.\nWe began our EU MDR implementation efforts in late 2019 and have incurred cumulative expenses of $408 million through December 31, 2024, which are primarily being recorded within\nCost of product sold\n. We expect to incur total expenses of approximately $450 million to $500 million over the transition period.\nThe following table provides a summary of our key operating expenses:\nYear Ended December 31,\n\nWe allocate any excess purchase price over the fair value of the net tangible and identifiable intangible assets acquired in a business combination to goodwill. We test our goodwill balances, utilizing both the qualitative and quantitative approach described in FASB ASC Topic 350,\nIntangibles - Goodwill and Other\n(FASB ASC Topic 350), in the second quarter of each year as of April 1 for impairment, or more frequently if impairment indicators are present or changes in circumstances suggest an impairment may exist.\nWe assess goodwill for impairment at the reporting unit level, which is defined as an operating segment or one level below an operating segment, referred to as a component. For our 2024 annual impairment assessment, we identified the following reporting units for purposes of our annual goodwill impairment test: Interventional Cardiology, Rhythm Management, Peripheral Interventions, Endoscopy, Urology and Neuromodulation. Based on the criteria prescribed in FASB ASC Topic 350, we aggregated the Interventional Cardiology Therapies and Watchman components of our Cardiology operating segment into a single Interventional Cardiology reporting unit and aggregated the Cardiac Rhythm Management and Electrophysiology components into a single Rhythm Management reporting unit.\nIn performing annual impairment assessments, when a quantitative test is performed, we typically use the income approach, specifically the Discounted Cash Flow method, to derive the fair value of each of our reporting units in preparing our goodwill impairment assessments. We historically selected this method as being the most meaningful in preparing our goodwill assessments because we believe the income approach most appropriately measures the fair value of our income producing assets. We have considered using the market approach and cost approach but concluded they are not appropriate in valuing our reporting units given the lack of relevant market comparisons available for application of the market approach and the inability to replicate the value of the specific technology-based assets within our reporting units for application of the cost approach.\nIn applying the income approach, we make assumptions about the amount and timing of future expected cash flows, terminal value growth rates and appropriate discount rates. The amount and timing of future cash flows within our Discounted Cash Flow analysis is based on our most recent operational budgets, long range strategic plans and other estimates. The terminal\nvalue growth rate reflects our best estimates for stable, perpetual growth of our reporting units. We use estimates of market-participant risk-adjusted weighted average cost of capital as a basis for determining the discount rates to apply to our reporting units’ future expected cash flows.\nAlthough we use consistent methodologies in developing the assumptions and estimates underlying the fair value calculations used in our impairment tests, these estimates are uncertain by nature and can vary from actual results. The use of alternative valuation assumptions, including estimated revenue projections, growth rates, cash flows and discount rates could result in different fair value estimates.\nFuture events that could have a negative impact on the levels of excess fair value over carrying value of our reporting units include, but are not limited to, the following:\ndecreases in estimated market sizes or market growth rates due to greater-than-expected declines in procedural volumes, inclusive of those resulting from macroeconomic conditions, including inflationary pricing pressures and reductions in reimbursement levels,\ndeclines in our market share and penetration assumptions due to increased competition, an inability to develop or launch new and next-generation products and technology features in line with our commercialization strategies and market and/or regulatory conditions that may cause significant launch delays or product actions,\ndecreases in our forecasted profitability due to an inability to implement successfully and achieve timely and sustainable cost improvement measures consistent with our expectations,\nnegative developments in intellectual property litigation that may impact our ability to market certain products or increase our costs to sell certain products,\nthe level of success of ongoing and future research and development efforts, including those related to acquisitions and increases in the research and development costs necessary to obtain regulatory approvals and launch new products,\nthe level of success in managing the growth of acquired companies, achieving sustained profitability consistent with our expectations, establishing government and third-party payer reimbursement, supplying the market and increases in the costs and time necessary to integrate acquired businesses into our operations successfully,\nchanges in our reporting units or in the structure of our business as a result of future reorganizations, acquisitions or divestitures of assets or businesses and\nincreases in our market-participant risk-adjusted weighted average cost of capital and increases in our market-participant tax rate and/or changes in tax laws or macroeconomic conditions.\nNegative changes in one or more of these factors, among others, could result in future impairment charges.\nLegal and Product Liability Accruals\nWe are involved in various legal and regulatory proceedings, including intellectual property, breach of contract, securities litigation and product liability suits. In some cases, the claimants seek damages, as well as other relief, which, if granted, could require significant expenditures or impact our ability to sell our products. We are also the subject of certain governmental investigations, which could result in substantial fines, penalties and administrative remedies. We accrue anticipated costs of settlement, damages, losses for product liability claims and, under certain conditions, costs of defense, based on historical experience or to the extent specific losses are probable and estimable. Otherwise, we expense these costs as incurred. If the estimate of a probable loss is a range and no amount within the range is more likely, we accrue the minimum amount of the range. Litigation and product liability matters are inherently uncertain, and the outcomes of individual matters are difficult to predict and quantify. As such, significant judgment is required in determining our legal and product liability accruals. Our estimates related to our legal and product liability accruals may change as additional information becomes available to us, including information related to the nature or existence of claims against us, trial court or appellate proceedings, and mediation, arbitration or settlement proceedings.\nWe reduce our deferred tax assets by a valuation allowance if, based upon the weight of available evidence, it is more likely than not that we will not realize some portion or all the deferred tax assets. We consider relevant evidence, both positive and negative, to determine the need for a valuation allowance. Information evaluated includes our financial position and results of operations for the current and preceding years, the availability of deferred tax liabilities and tax carrybacks, as well as estimates of the impact of future taxable income and available prudent and feasible tax-planning strategies. The realizability assessments made at a given balance sheet date are subject to change, particularly if earnings of a subsidiary are inconsistent with expectations, or if we take operational or tax planning actions that could impact the future taxable earnings of a subsidiary. Each reporting period, we monitor the need for valuation allowances for each filing group in each jurisdiction where we are subject to tax. Based on currently available information, we believe that it is more likely than not that our deferred tax assets, net of valuation allowances, will be realized.\nWe establish reserves when we believe that certain positions are likely to be challenged despite our belief that our tax return positions are fully supportable. The calculation of our tax liabilities involves significant judgment based on individual facts, circumstances, and information available in addition to applying complex tax regulations across our global operations. To recognize an uncertain tax benefit in the consolidated financial statements, the taxpayer must determine if it is more likely than not that the position will be sustained, with the measurement of the resulting benefit calculated as the largest amount more than 50 percent likely to be realized upon resolution of the benefit. We review these tax uncertainties each reporting period to consider changing facts and circumstances, such as the progress of tax audits, and adjust them accordingly. Upon final resolution with tax authorities, we may prevail in positions for which reserves have been established, or we may be required to pay amounts more than established reserves. Although we believe that we have adequately provided for liabilities resulting from tax assessments by taxing authorities, positions taken by these tax authorities could have a material impact on our effective tax rate, results of operations, financial position and/or cash flows.\nNew Accounting Pronouncements\nNote P – New Accounting Pronouncements\nAdditional Information\nUse of Non-GAAP Financial Measures\nTo supplement our consolidated financial statements presented on a GAAP basis, we disclose certain non-GAAP financial measures, including adjusted net income (loss), adjusted net income (loss) attributable to common stockholders and adjusted net income (loss) per share (EPS) that exclude certain charges (credits); operational net sales, which exclude the impact of foreign currency fluctuations; and organic net sales, which exclude the impact of foreign currency fluctuations as well as the impact of certain acquisitions and divestitures with less than a full period of comparable net sales. These non-GAAP financial measures are not in accordance with U.S. GAAP and should not be considered in isolation from or as a replacement for the most directly comparable GAAP financial measures. Further, other companies may calculate these non-GAAP financial measures differently than we do, which may limit the usefulness of those measures for comparative purposes.\nTo calculate adjusted net income (loss), adjusted net income (loss) attributable to common stockholders and adjusted net income (loss) per share we exclude certain charges (credits) from GAAP net income and GAAP net income attributable to common stockholders, which include amortization expense, goodwill and other intangible asset impairment charges, acquisition/divestiture-related net charges (credits), investment portfolio net losses (gains) and impairments, restructuring and restructuring-related net charges (credits), certain litigation-related net charges (credits), EU MDR implementation costs, debt extinguishment net charges, deferred tax expenses (benefits) and certain discrete tax items. Amounts are presented after-tax using our effective tax rate, unless the amount is a significant unusual or infrequently occurring item in accordance with FASB ASC Topic 740-270-30, \"General Methodology and Use of Estimated Annual Effective Tax Rate.\"\nThe GAAP financial measure most directly comparable to adjusted net income (loss), adjusted net income (loss) attributable to common stockholders and adjusted net income (loss) per share are GAAP net income (loss), GAAP net income (loss) attributable to common stockholders and GAAP net income (loss) per common share - assuming dilution, respectively.\nTo calculate operational net sales growth rates, which exclude the impact of foreign currency fluctuations, we convert actual net sales from local currency to U.S. dollars using constant foreign currency exchange rates in the current and prior periods. To calculate organic net sales growth rates, we also remove the impact of acquisitions and divestitures with less than a full period of comparable net sales. The GAAP financial measure most directly comparable to operational ",
  "item2_clean": null
}