{
  "source_file": "bsx-20250930.htm",
  "form_type": "10-Q",
  "item1_clean": null,
  "item7_clean": "The impact of, diversion of management attention as a result of, and costs to cooperate with, litigate and/or resolve governmental investigations and our class action, product liability, contract and other legal proceedings,\nThe possibility of failure to protect our intellectual property rights and the outcome of patent litigation, and\nOur ability to secure our information technology and operational technology systems that support our business operations and protect our data integrity and products from a cyber-attack, other breach or other malicious actors that may have a material adverse effect on our business, reputation or results of operations, including increased risks as an indirect result of the ongoing Russia/Ukraine war and conflicts in the Middle East.\nInnovation and Certain Growth Initiatives\nThe timing, size and nature of our strategic growth initiatives and market opportunities, including with respect to our internal research and development platforms and externally available research and development platforms and technologies and the ultimate cost and success of those initiatives and opportunities,\nOur ability to complete planned clinical trials successfully, obtain regulatory approvals and launch new and next generation products in a timely manner consistent with cost estimates, including the successful completion of projects from in-process research and development,\nOur ability to identify and prioritize our internal research and development project portfolio and our external investment portfolio on profitable net sales growth opportunities as well as to maintain the estimated timing and costs of such projects and expected revenue levels for the resulting products and technologies,\nOur ability to develop, manufacture and market new products and technologies successfully and in a timely manner and the ability of our competitors and other third parties to develop products or technologies that render our products or technologies noncompetitive or obsolete,\nOur ability to execute appropriate decisions to discontinue, write-down or reduce the funding of any of our research and development projects, including projects from in-process research and development from our acquisitions, in our growth adjacencies or otherwise,\nOur dependence on acquisitions, alliances or investments to introduce new products or technologies and to enter new or adjacent growth markets and our ability to fund them or to fund contingent payments with respect to those acquisitions, alliances and investments, and\nThe potential failure to successfully integrate, collaborate or realize the expected benefits, including cost synergies, from strategic acquisitions, alliances and investments we have consummated or may consummate in the future.\nInternational Markets\nOur dependency on international net sales to achieve growth, and our ability to maintain or expand our worldwide market positions in the various markets in which we compete or seek to compete, including through investments in China and other Emerging Markets countries,\nThe timing and collectability of customer payments, as well as our ability to continue factoring customer receivables where we have factoring arrangements, or to enter new factoring arrangements with favorable terms,\nThe impact on pricing due to national and regional tenders, including value-based procurement practices and government-imposed payback provisions,\nGeopolitical and economic conditions, including civil unrest, terrorist activity, governmental changes, restrictions on the ability to transfer capital across borders, and changing tariff and trade policies,\nThe impact of the Russia/Ukraine war, conflicts in the Middle East, and tension in the Taiwan strait, and related, downstream effects thereof, including disruptions to operations or the impact of sanctions on U.S. manufacturers doing business in these regions,\nProtection of our intellectual property,\nOur ability to comply with established and developing U.S. and foreign legal and regulatory requirements, including FCPA, EU MDR and similar laws in other jurisdictions,\nOur ability to comply with U.S. and foreign export control, trade embargo and customs laws, and\nThe potential effect of foreign currency fluctuations and interest rate fluctuations on our net sales, operating expenses and resulting profit margins.\nOur ability to generate sufficient cash flow to fund operations, capital expenditures, global expansion initiatives, any litigation settlements and judgments, share repurchases and strategic investments and acquisitions as well as maintaining our investment grade ratings and managing our debt levels and financial covenant compliance,\nOur ability to access the public and private capital markets when desired and to issue debt or equity securities on terms reasonably acceptable to us,\nThe unfavorable resolution of open tax matters, exposure to additional tax liabilities and the impact of changes in U.S. and international tax laws,\nThe unfavorable resolution of open litigation matters, exposure to additional loss contingencies and legal provisions,\nThe impact of examinations and assessments by domestic and international taxing authorities on our tax provisions, financial condition or results of operations,\nThe possibility of counterparty default on our derivative financial instruments, and\nOur ability to collect outstanding and future receivables and/or sell receivables under our factoring programs.\nITEM 3.\nQUANTITATIVE AND QUALITATIVE DISCLOSURES ABOUT MARKET RISK\nWe develop, manufacture and sell medical devices globally and our earnings and cash flows are exposed to market risk from changes in currency exchange rates and interest rates. We address these risks through a risk management program that includes the use of derivative financial instruments. We operate the program pursuant to documented corporate risk management policies. We do not enter derivative transactions for speculative purposes. Gains and losses on derivative financial instruments substantially offset losses and gains on underlying hedged exposures. Furthermore, we manage our exposure to counterparty risk on derivative instruments by entering into contracts with a diversified group of major financial institutions and by actively monitoring outstanding positions.\nOur currency risk consists primarily of foreign currency denominated firm commitments, forecasted foreign currency denominated intercompany and third-party transactions and net investments in certain subsidiaries. We use both nonderivative (primarily European manufacturing operations) and derivative instruments to manage our earnings and cash flow exposure to changes in currency exchange rates. We had currency derivative instruments outstanding in the contract amount of $12.087 billion as of September 30, 2025 and $7.636 billion as of December 31, 2024. A ten percent appreciation in the U.S. dollar’s value relative to the hedged currencies would increase the derivative instruments’ fair value by $794 million as of September 30, 2025 compared to $322 million as of December 31, 2024. A ten percent depreciation in the U.S. dollar’s value relative to the hedged currencies would decrease the derivative instruments’ fair value by $970 million as of September 30, 2025 compared to $394 million as of December 31, 2024. Any increase or decrease in the fair value of our currency exchange rate sensitive derivative instruments would be substantially offset by a corresponding decrease or increase in the fair value of the hedged underlying asset, liability or forecasted transaction, resulting in minimal impacts on our unaudited consolidated statements of operations.\nOur interest rate risk relates primarily to U.S. dollar and euro-denominated borrowings partially offset by U.S. dollar cash investments. We have historically used interest rate derivative instruments to manage our earnings and cash flow exposure to changes in interest rates. We had no interest rate derivative instruments outstanding as of September 30, 2025 or December 31, 2024. As of September 30, 2025, $11.326 billion in aggregate principal amount of our outstanding debt obligations was at fixed interest rates, representing approximately 100.0 percent of our total debt, on an amortized cost basis. As of September 30, 2025, our outstanding debt obligations at fixed interest rates were comprised of senior notes.\nNote D – Hedging Activities and Fair Value Measurements\n\nThe following table presents our restructuring reserve balance:\nRestructuring reserve balance\nLitigation-related Net Charges (Credits)\nWe record certain legal and product liability charges, credits and costs of defense, which we consider to be unusual or infrequent and significant as\nLitigation-related net charges (credits)\nwithin our accompanying unaudited consolidated financial statements. We did not record any litigation-related net charges (credits) during the third quarter and first nine months of 2025 or 2024. All other legal and product liability charges, credits and costs are recorded within\nWe continue to assess certain litigation and claims to determine the amounts, if any, that management believes will be paid as a result of such claims and litigation, and therefore, additional losses may be accrued and paid in the future, which could materially adversely impact our operating results, cash flows and/or our ability to comply with the financial covenant required by our credit arrangements. Refer to\nNote H – Commitments and Contingencies\nThe following table provides a summary of our\nand average borrowing rate:\nThree Months Ended September 30,\nNine Months Ended September 30,\nAverage borrowing rate\nincreased during the third quarter and first nine months of 2025 compared to the prior year period primarily due to a higher average borrowing rate and higher average outstanding debt balances. Refer to\nLiquidity and Capital Resources\nNote E – Contractual Obligations and Commitments\nThe following table provides a reconciliation of our reported tax rate to the rate from continuing operations:\nThree Months Ended September 30,\nNine Months Ended September 30,\nImpact of certain receipts/charges\nRate from continuing operations\nThese receipts/charges are taxed at different rates than our rate from continuing operations.\nOur reported tax rate is affected by recurring items such as the amount of our earnings subject to differing tax rates in foreign jurisdictions and the impact of certain receipts and charges that are taxed at rates that differ from our rate from continuing operations.\nIn the third quarter and first nine months of 2025, the principal reason for the difference between the rate from continuing operations and our reported tax rate relates to certain acquisition-related net charges and certain discrete tax benefits primarily related to stock-based compensation.\nIn the third quarter of 2024, the principal reason for the difference between the rate from continuing operations and our reported tax rate relates to certain acquisition-related net charges. In the first nine months of 2024, the principal reasons for the difference between the rate from continuing operations and our reported tax rate relate to certain acquisition-related net charges, impairment charges and certain discrete tax benefits primarily related to stock-based compensation.\nOn July 4, 2025, the One Big Beautiful Bill Act (OBBBA) was signed into law. It includes significant changes to corporate income taxes including extending and modifying many provisions of the Tax Cuts and Jobs Act. Provisions of the OBBBA impacting the Company include the immediate expensing of U.S. performed research and development expenditures as well as modifications to the taxation of our international operations. Certain provisions will take effect beginning in 2026, while others apply retroactively to January 1, 2025. Based on our current analysis of OBBBA, we expect an immaterial impact to our overall effective tax rate, financial condition, results of operations, and cash flow in 2025.\nEffective January 1, 2024, many countries where we do business adopted a global minimum effective tax rate of 15% based on the Pillar Two framework issued by the Organization for Economic Cooperation and Development (OECD). The United States has not enacted the Pillar Two global minimum tax and as of June 28, 2025 the G7 countries announced an agreement to exempt U.S. companies from certain elements of the OECD global minimum tax framework. We expect that this agreement, if ultimately enacted into law in the relevant countries, would be beneficial to the Company. However, Pillar Two remains enacted law and significant uncertainty exists regarding the implementation of this agreement, the interpretation of the existing Pillar Two rules, whether such rules will be implemented consistently across taxing jurisdictions, how such rules interact with existing national tax laws and whether such rules are consistent with existing tax treaty obligations. Developments related to these uncertainties could impact our expectations regarding the impact of the Pillar Two global minimum tax on our tax rate from continuing operations in 2025 and beyond.\nFuture legislative developments regarding the applicability of the Pillar Two tax on U.S. companies and additional guidance by the U.S. Department of the Treasury regarding OBBBA could impact our expectations and interpretations regarding the impact on our tax rate from continuing operations.\nNote G – Income Taxes\nCritical Accounting Policies and Estimates\nLiquidity and Capital Resources\nBased on our current business plan, we believe our existing balance of\nCash and cash equivalents\n, future cash generated from operations, access to capital markets and existing credit facilities will be sufficient to fund our operations, invest in our infrastructure, pay our legal-related liabilities, pay taxes due, service and repay our existing debt and fund possible acquisitions for the next 12 months and for the foreseeable future.\nAs of September 30, 2025, we had $1.275 billion of unrestricted\nCash and cash equivalents\non hand, including approximately $61 million held by Acotec Scientific Holdings Limited, a less than wholly owned entity of which we acquired a majority stake investment during the first quarter of 2023.\n\nThe impact of increased pressure on the availability and rate of third-party reimbursement for our products and procedures in the U.S. and around the world, including with respect to the timing and costs of creating and expanding markets for new products and technologies,\nThe impact of potential goodwill and intangible asset impairment charges on our results of operations.\nRegulatory Compliance, Litigation and Data Protection\nThe impact of healthcare policy changes and legislative or regulatory efforts in the U.S., the EU and around the world to modify product approval or reimbursement processes, including a trend toward demonstrating clinical outcomes, comparative effectiveness and cost efficiency, as well as the impact of other healthcare reform legislation,\nRisks associated with our regulatory compliance and quality systems and activities in the U.S., the EU and around the world, including meeting regulatory standards applicable to manufacturing and quality processes,\nOur ability to minimize or avoid future field actions or FDA warning letters, or similar actions by regulatory agencies around the world, relating to our products and processes and the ongoing inherent risk of potential physician advisories related to our or our competitors' products,\nThe impact of increased scrutiny of and heightened global regulatory enforcement facing the medical device industry arising from political and regulatory changes, economic pressures or otherwise, including under U.S. Anti-Kickback Statute, U.S. False Claims Act and similar laws in other jurisdictions, U.S. Foreign Corrupt Practices Act (FCPA) and similar laws in other jurisdict",
  "item2_clean": "As part of our strategic imperative to drive global expansion, we are seeking to grow net sales and market share by expanding our global presence, including in Emerging Markets. Our Emerging Markets countries include all countries except the United States, Western and Central Europe, Japan, Australia, New Zealand and Canada.\nOur Emerging Markets' net sales represented 15 percent of our consolidated net sales during the third quarter and first nine months of 2025, respectively, and 16 percent and 17 percent during the third quarter and first nine months of 2024, respectively. During the third quarter of 2025, our Emerging Markets net sales grew 11.8 percent on a reported basis, which included operational net sales growth of 11.5 percent and a positive impact of 20 basis points from foreign currency fluctuations, compared to the prior year period. During the first nine months of 2025, our Emerging Markets net sales grew 10.0 percent on a reported basis, which included operational net sales growth of 11.2 percent and a negative impact of 110 basis points from foreign currency fluctuations, compared to the prior year period. Operational net sales growth in both periods was primarily driven by growth in China, fueled by the breadth of our portfolio and focus on innovation and strong commercial execution.\nEconomic Environment\nAs a global developer, manufacturer and marketer of medical devices, our business is subject to local and international macroeconomic trends as well as geopolitical factors. While global supply chain conditions have continued to improve, we have experienced, and may continue to experience, increases in cost and limited availability of certain raw materials, components, and other inputs necessary to manufacture and distribute our products due to constraints and inflation within the global supply chain, as well as increases in wage costs and the cost and time to distribute our products. Uncertainty around inflationary pressures, interest rates, trade and tariff policies, foreign currency fluctuations and changes in tax laws, as well as actions by governments in response thereto, could create additional economic challenges which could negatively impact our business operations and results. We continue to anticipate incurring incremental costs under the current schedule of tariffs on U.S. imports announced by the U.S. government, as well as the subsequent increase in tariffs introduced by China on U.S. manufactured products. While some of the announced tariffs have been adjusted and the U.S. and other governments continue negotiations on such measures, these and any further tariff increases on our products by the U.S., China or any other country or region, as well as sanctions or other measures that restrict international trade, could have a material adverse impact on our business operations and results. We continue to monitor the evolving situation while exploring opportunities to mitigate the impacts of such tariffs. There can be no guarantee that we will be able to offset the impact of tariffs, the ultimate impact of which will depend on various factors, including the timing, scope, duration and nature of any tariffs, any other trade restrictions or opportunities to mitigate such impacts. In addition, geopolitical developments and uncertainties, including related to various ongoing global conflicts and tensions, may create economic, supply chain, transportation, energy, and other challenges, including disruptions to business operations, which could negatively impact our business and results of operations.\nwas $3.542 billion and $10.175 billion for the third quarter and first nine months of 2025, respectively, and $2.897 billion and $8.395 billion for the third quarter and first nine months of 2024, respectively. The following is a reconciliation of our gross profit margin and a description of the drivers of the changes from period to period:\nPercentage of Net Sales\nGross profit margin - period ended September 30, 2024\nSales pricing, volume and mix\nAll other, including inventory charges and other period expenses\nGross profit margin - period ended September 30, 2025\nIn the third quarter of 2025, the primary factors that impacted gross profit margin were increased sales of higher margin products, partially offset by increased levels of tariffs and other period expenses. In the first nine months of 2025, the primary factors that impacted gross profit margin were inventory charges of approximately $90 million resulting from the global discontinuation of the ACURATE platform, increased levels of tariffs and other period expenses, partially offset by increased sales of higher margin products.\nThe following table provides a summary of our key operating expenses:\n\nThe following table presents our restructuring reserve balance:\nRestructuring reserve balance\nLitigation-related Net Charges (Credits)\nWe record certain legal and product liability charges, credits and costs of defense, which we consider to be unusual or infrequent and significant as\nLitigation-related net charges (credits)\nwithin our accompanying unaudited consolidated financial statements. We did not record any litigation-related net charges (credits) during the third quarter and first nine months of 2025 or 2024. All other legal and product liability charges, credits and costs are recorded within\nWe continue to assess certain litigation and claims to determine the amounts, if any, that management believes will be paid as a result of such claims and litigation, and therefore, additional losses may be accrued and paid in the future, which could materially adversely impact our operating results, cash flows and/or our ability to comply with the financial covenant required by our credit arrangements. Refer to\nNote H – Commitments and Contingencies\nThe following table provides a summary of our\nand average borrowing rate:\nThree Months Ended September 30,\nNine Months Ended September 30,\nAverage borrowing rate\nincreased during the third quarter and first nine months of 2025 compared to the prior year period primarily due to a higher average borrowing rate and higher average outstanding debt balances. Refer to\nLiquidity and Capital Resources\nNote E – Contractual Obligations and Commitments\nThe following table provides a reconciliation of our reported tax rate to the rate from continuing operations:\nThree Months Ended September 30,\nNine Months Ended September 30,\nImpact of certain receipts/charges\nRate from continuing operations\nThese receipts/charges are taxed at different rates than our rate from continuing operations.\nOur reported tax rate is affected by recurring items such as the amount of our earnings subject to differing tax rates in foreign jurisdictions and the impact of certain receipts and charges that are taxed at rates that differ from our rate from continuing operations.\nIn the third quarter and first nine months of 2025, the principal reason for the difference between the rate from continuing operations and our reported tax rate relates to certain acquisition-related net charges and certain discrete tax benefits primarily related to stock-based compensation.\nIn the third quarter of 2024, the principal reason for the difference between the rate from continuing operations and our reported tax rate relates to certain acquisition-related net charges. In the first nine months of 2024, the principal reasons for the difference between the rate from continuing operations and our reported tax rate relate to certain acquisition-related net charges, impairment charges and certain discrete tax benefits primarily related to stock-based compensation.\nOn July 4, 2025, the One Big Beautiful Bill Act (OBBBA) was signed into law. It includes significant changes to corporate income taxes including extending and modifying many provisions of the Tax Cuts and Jobs Act. Provisions of the OBBBA impacting the Company include the immediate expensing of U.S. performed research and development expenditures as well as modifications to the taxation of our international operations. Certain provisions will take effect beginning in 2026, while others apply retroactively to January 1, 2025. Based on our current analysis of OBBBA, we expect an immaterial impact to our overall effective tax rate, financial condition, results of operations, and cash flow in 2025.\nEffective January 1, 2024, many countries where we do business adopted a global minimum effective tax rate of 15% based on the Pillar Two framework issued by the Organization for Economic Cooperation and Development (OECD). The United States has not enacted the Pillar Two global minimum tax and as of June 28, 2025 the G7 countries announced an agreement to exempt U.S. companies from certain elements of the OECD global minimum tax framework. We expect that this agreement, if ultimately enacted into law in the relevant countries, would be beneficial to the Company. However, Pillar Two remains enacted law and significant uncertainty exists regarding the implementation of this agreement, the interpretation of the existing Pillar Two rules, whether such rules will be implemented consistently across taxing jurisdictions, how such rules interact with existing national tax laws and whether such rules are consistent with existing tax treaty obligations. Developments related to these uncertainties could impact our expectations regarding the impact of the Pillar Two global minimum tax on our tax rate from continuing operations in 2025 and beyond.\nFuture legislative developments regarding the applicability of the Pillar Two tax on U.S. companies and additional guidance by the U.S. Department of the Treasury regarding OBBBA could impact our expectations and interpretations regarding the impact on our tax rate from continuing operations.\nNote G – Income Taxes\nCritical Accounting Policies and Estimates\nLiquidity and Capital Resources\nBased on our current business plan, we believe our existing balance of\nCash and cash equivalents\n"
}