{
  "source_file": "bxp-20250930.htm",
  "form_type": "10-Q",
  "item1_clean": null,
  "item7_clean": null,
  "item2_clean": "PART I. FINANCIAL INFORMATION\nITEM 1.\nFinancial Statements (unaudited)\na) Consolidated Balance Sheets as of September 30, 2025 and December 31, 2024\nb) Consolidated Statements of Operations for the three and nine months ended September 30, 2025 and 2024\nc) Consolidated Statements of Comprehensive Income\nfor the three and nine months ended September 30, 2025 and 2024\nd) Consolidated Statements of Equity for the three and nine months ended September 30, 2025 and 2024\ne) Consolidated Statements of Cash Flows for the nine months ended September 30, 2025 and 2024\nBoston Properties Limited Partnership\na) Consolidated Balance Sheets as of September 30, 2025 and December 31, 2024\nb) Consolidated Statements of Operations for the three and nine months ended September 30, 2025 and 2024\nc) Consolidated Statements of Comprehensive Income\nL\nfor the three and nine months ended September 30, 2025 and 2024\nd) Consolidated Statements of Capital and Noncontrolling Interests for the three and nine months ended September 30, 2025 and 2024\ne) Consolidated Statements of Cash Flows for the nine months ended September 30, 2025 and 2024\nBXP, Inc. and Boston Properties Limited Partnership\nNotes to the Consolidated Financial Statements\nITEM 2.\nManagement’s Discussion and Analysis of Financial Condition and Results of Operations\n\nBXP, INC. AND BOSTON PROPERTIES LIMITED PARTNERSHIP\nfor the quarter ended September 30, 2025\n\nItem 2. Management’s Discussion and Analysis of Financial Condition and Results of Operations and Liquidity and Capital Resources, includes information specific to each entity, where applicable.\nThis report also includes separate Part I - Item 4. Controls and Procedures and Part II - Item 2. Unregistered Sales of Equity Securities and Use of Proceeds sections for each of BXP and BPLP, as well as separate Exhibits 31 and 32 certifications for each of BXP and BPLP."
}