{
  "source_file": "bxp-20241231.htm",
  "form_type": "10-K",
  "item1_clean": "Principal factors of competition in our primary business of owning, acquiring and developing premier workplaces are the quality of properties, leasing terms (including rent and other charges and allowances for tenant improvements), attractiveness and convenience of location, the quality and breadth of client services and amenities provided, and reputation as an owner and operator of premier workplaces in the relevant market. Additionally, our ability to compete depends upon, among other factors, trends in the national and local economies, investment alternatives, financial condition and operating results of current and prospective clients, availability and cost of capital, construction and renovation costs, taxes, utilities, governmental regulations, legislation and population trends.\n\n163 office and life sciences properties (including five properties under construction/redevelopment);\n14 retail properties (including one property under construction);\nseven residential properties (including one property under construction); and\nWe consider premier workplaces to be well-located buildings that are modern structures or have been modernized to compete with newer buildings, are professionally managed and maintained, and offer a number and type of amenities that are in high demand by clients that are focused on the importance of the physical work environment in recruiting and retaining the best and brightest employees. As such, these properties attract creditworthy clients and command upper-tier rental rates in their markets. We do not consider the expression “premier workplaces” a classification of our properties in accordance with any standard listing criteria in the real estate industry. We therefore caution investors that our use and definition of “premier workplaces” may be different than the use and definition of similar expressions and traditional classifications that may be used by other companies.\nWe are a full-service real estate company, with substantial in-house expertise and resources in acquisitions, development, financing, capital markets, construction management, property management, marketing, leasing, accounting, risk management, tax and legal services. For this reason, we refer to our tenants as “clients” due to the many facets of our continuous engagements with them, which span beyond the usual tenant/landlord relationship. Throughout this Annual Report, we use the terms “tenant” and “client” interchangeably.\nBXP manages BPLP as its sole general partner. Our principal executive office and Boston regional office are located at The Prudential Center, 800 Boylston Street, Suite 1900, Boston, Massachusetts 02199 and our telephone number is (617) 236-3300. In addition, we have regional offices at 2800 28th Street, Santa Monica, California 90405, 599 Lexington Avenue, New York, New York 10022, Two Embarcadero Center, San Francisco, California 94111, 1001 Fourth Avenue, Seattle, Washington 98154 and 2200 Pennsylvania Avenue NW, Washington, DC 20037.\nBoston Properties Limited Partnership\nBPLP is a Delaware limited partnership organized in 1997, and the entity through which BXP conducts substantially all of its business and owns, either directly or through subsidiaries, substantially all of its assets. BXP is the sole general partner of BPLP and, as of February 21, 2025, the owner of approximately 89.5% of the economic interests in BPLP. Economic interest was calculated as the number of common partnership units of BPLP\n\nOn December 13, 2024, a joint venture in which we have a 20% ownership interest fully placed in-service Skymark, a luxury residential property located in Reston, Virginia, that consists of 508 residential units aggregating approximately 417,000 net rentable square feet across a five-story, low-rise building and an iconic 39-story tower, which is one of the tallest buildings in Northern Virginia.\nDuring the year ended December 31, 2024, we recognized an other-than-temporary impairment loss on our investments in Colorado Center, Gateway Commons and Safeco Plaza of approximately $168.4 million, $126.1 million and $46.8 million, respectively (See Note 6 to the Consolidated Financial Statements).\nOn March 21, 2024, we completed the sale of a 45% interest in 290 Binney Street in Cambridge, Massachusetts. We retain a 55% ownership interest in the joint venture. The institutional investor funded approximately $97.2 million in cash at closing, which is less than 45% of the agreed upon carrying value of the property immediately prior to the transaction. The institutional investor will fund all construction costs until its equity balance is proportionate to its ownership percentage, after which we and the institutional investor will fund the development project based on our respective ownership interests. As of December 31, 2024, the equity balance for each of the investors is proportionate to their ownership percentage. The transaction did not qualify as a sale of real estate for financial reporting purposes as we continue to effectively control the property and thus will continue to account for the property on a consolidated basis in our financial statements and no gain was recognized in the Consolidated Statements of Operations. We provide customary development, property management and leasing services to the joint venture. 290 Binney Street is an approximately 573,000 net rentable square foot laboratory/life sciences development project located in Cambridge, Massachusetts.\nStock Option and Incentive Plan\nOn January 25, 2024, the Compensation Committee of BXP’s Board of Directors approved a new equity-based, multi-year, long-term incentive program (the “2024 MYLTIP”) as a performance based component of our overall compensation program under the BXP, Inc. 2021 Stock Incentive Plan (the “2021 Plan”) to certain executive officers of BXP. Under ASC 718 “Compensation - Stock Compensation,” the 2024 MYLTIP awards have an aggregate value of approximately $11.1 million, which amount will generally be amortized into earnings under the graded vesting method. (See Note 15 to the Consolidated Financial Statements).\nOn February 1, 2024, the three-year measurement period for our 2021 MYLTIP awards ended and, based on BXP’s absolute and relative TSR performance, the final payout was determined to be 112% of target, or an aggregate of approximately $12.6 million (after giving effect to employee separations). As a result, an aggregate of 155,625 2021 MYLTIP Units that had been previously granted were automatically forfeited.\nBusiness and Growth Strategies\nOur primary business objective is to maximize return on investment to provide our investors with the greatest possible total return at all points of the economic cycle. Our strategies to achieve this objective are:\nto target a few carefully selected dynamic gateway markets—Boston, Los Angeles, New York, San Francisco, Seattle and Washington, DC—and to be one of the leading, if not the leading, developers, owners and managers in each of those markets with a full-service office in each market providing property management, leasing, development, construction and legal expertise. We select markets and submarkets with a diverse economic base and a deep pool of prospective clients in various industries and where clients have demonstrated a preference for premier workplaces and other facilities. Additionally, our markets have historically been able to recruit new talent to them and as such created job growth that results in growth in rental rates and occupancy over time. We have explored, and may continue to explore for future investment, select domestic and international markets that exhibit these same traits;\nto emphasize markets and submarkets within those markets where the difficulty of receiving the necessary approvals for development and the necessary financing constitute high barriers to the creation of new supply, and where skill, financial strength and diligence are required to successfully develop,\n\nour relationships with institutional buyers and sellers of high-quality real estate assets;\nour ability to procure entitlements from multiple municipalities to develop sites and attract land owners to sell or partner with us; and\nour relationship with domestic and foreign investors who seek to partner with companies like ours.\nOpportunities to execute our external growth strategy fall into three categories:\nDevelopment in selected submarkets.\nWe believe the selected development of well-positioned premier workplaces as well as residential buildings and mixed-use complexes may be justified in our markets. We believe in acquiring land after taking into consideration timing factors relating to economic cycles and in response to market conditions that should allow for its development at the appropriate time. While we purposely concentrate in markets with high barriers-to-entry, we have demonstrated throughout our 55-year history, an ability to make carefully timed land acquisitions in submarkets where we can become one of the market leaders in establishing rent and other business terms. We believe that there are opportunities at key locations in our existing and other markets for a well-capitalized developer to acquire land or buildings with development or redevelopment potential.\nIn the past, we have been particularly successful at acquiring sites or options to purchase sites that need governmental approvals for development. Because of our development expertise, knowledge of the governmental approval process and reputation for quality development with local government regulatory bodies, we generally have been able to secure the permits necessary to allow development and to profit from the resulting increase in land value. We seek complex projects where we can add value through the efforts of our experienced and skilled management team leading to attractive returns on investment.\nOur strong regional relationships and recognized development expertise have enabled us to capitalize on unique build-to-suit opportunities. We intend to seek and expect to continue to be presented with such opportunities in the near term allowing us to earn relatively significant returns on these development opportunities through multiple business cycles.\nAcquisition of assets and portfolios of assets from institutions, including lenders, or individuals.\nWe believe that due to our size, management strength and reputation, we are well positioned to acquire portfolios of assets or individual properties from institutions or individuals if valuations meet our criteria. In addition, we believe that our market knowledge and our liquidity and access to capital may provide us with a competitive advantage when pursuing acquisitions. Opportunities to acquire properties may also come through the purchase of first mortgage or mezzanine debt. We are also able to appeal to sellers wishing to contribute on a tax-deferred basis their ownership of property for equity in a diversified real estate operating company that offers liquidity through access to the public equity markets in addition to a quarterly distribution. Our ability to offer common and preferred units of limited partnership in BPLP to sellers who would otherwise recognize a taxable gain upon a sale of assets for cash or BXP’s common stock may facilitate these types of acquisitions on a tax-efficient basis. Existing promulgated Treasury regulations may limit the tax benefits previously available to sellers in some variations of these transactions.\nAcquisition of underperforming assets and portfolios of assets\n. We believe that because of our in-depth market knowledge and development experience in each of our markets, our national reputation with brokers, financial institutions, owners of real estate and others involved in the real estate market and our access to competitively-priced capital, we are well-positioned to identify and acquire existing, underperforming properties for competitive prices and to add s",
  "item7_clean": "obligations, including rent concessions, deferrals or abatements, or to declare bankruptcy. Any one or more of the foregoing could:\nreduce our cash flows,\nadversely impact our ability to finance, refinance or sell a property,\nadversely impact our ability to continue paying distributions to our securityholders at current levels, or at all, and\nresult in additional legal and other costs to enforce our rights, collect rent and/or re-lease the space occupied by the distressed client;\nthe degree to which our clients’ businesses are negatively impacted could require us to write-off a client’s accrued rent balance and this could have a material adverse effect on our results of operations and liquidity;\nnew laws, governmental policies, and similar actions, including legal restrictions on prosecutions, could adversely impact public safety and thereby adversely affect (1) the desirability of clients to lease space in our properties or markets, and (2) businesses’ office re-population plans;\nthe impact of a pandemic could result in an event or change in circumstances that results in an impairment in the value of our properties or our investments in unconsolidated joint ventures, and any such impairment could have a material adverse effect on our results of operations in the periods in which the charge is taken;\nwe may be unable to restructure or amend leases with certain of our clients on terms favorable to us or at all;\nthe impact and validity of interpretations of lease provisions and applicable laws related to claims by clients regarding their obligations to pay rent as a result of a pandemic, and any adverse court rulings or decisions interpreting these provisions and laws, could have a material adverse effect on our results of operations and liquidity;\nthe impact of governmental and business travel limitations and restrictions could result in temporary or sustained periods of decreased demand for hotel stays at our hotel property;\nthe extent of labor shortages, disruptions in the supply chains, inflation impacting costs of materials, delays in permitting or inspections, and other factors could result in our failure to meet the development milestones set forth in any applicable lease agreement, which could provide the client the right to terminate its lease or entitle the client to monetary damages, delay the commencement or completion of construction and our anticipated lease-up plans for a development/redevelopment project or our overall development pipeline, including recognizing revenue for new leases, that may cause returns on investment to be less than projected, and/or increase the costs of construction of new or existing projects, any of which could adversely affect our investment returns, profitability and/or our future growth; and\nthe potential that business interruption, loss of rental income and/or other associated expenses related to our operations will not be covered in whole or in part by our insurance policies, which may increase unreimbursed liabilities.\nWe face risks associated with climate change and severe weather events, as well as the regulatory efforts intended to reduce the effects of climate change.\nThe physical effects of climate change could have a material adverse effect on our properties, operations and business. For example, many of our properties are located along the East and West coasts, particularly those in the central business districts of Boston, Los Angeles, New York, San Francisco, Seattle and Washington, DC. To the extent climate change causes changes in weather patterns, our markets could experience increases in storm intensity, extreme temperatures, rising sea-levels, extreme drought and/or wildfires. Over time, these conditions could result in declining demand for office space in our buildings or increased costs associated with infrastructure-related remediation projects. Climate change may also have indirect effects on our business by making property insurance unavailable or by increasing the cost of (i) property insurance on terms we find acceptable, (ii) real estate taxes or other assessments, (iii) energy and (iv) property maintenance. In addition, we face transition risks related to federal, state and local legislation and regulations that are being implemented, are under consideration to\n\nrevenue is primarily related to decreases in fees associated with tenant improvement projects in New York City and decreases in development income earned from unconsolidated joint ventures in the San Francisco and Washington DC regions. The decrease in management services revenue primarily related to the elimination of property and asset management fees earned from an unconsolidated joint venture in the Los Angeles region in which we acquired the joint venture partner’s interest in December 2023.\nGeneral and Administrative Expense\nGeneral and administrative expense decreased by approximately $10.2 million for the year ended December 31, 2024 compared to 2023 primarily due to decreases in compensation expense and other general and administrative expenses of approximately $10.1 million and $0.1 million, respectively. The decrease in compensation expense related to an approximately $8.9 million decrease in other compensation expenses and approximately $1.2 million decrease in the value of our deferred compensation plan.\nWages directly related to the development of rental properties are capitalized and included in real estate assets on our Consolidated Balance Sheets and amortized over the useful lives of the applicable asset or lease term. Capitalized wages for each of the year ended December 31, 2024 and 2023 were approximately $17.2 million and $16.1 million, respectively. These costs are not included in the general and administrative expenses discussed above.\nTransaction costs decreased by approximately $2.7 million for the year ended December 31, 2024 compared to 2023. In general, transaction costs relate to the formation of new joint ventures and the pursuit of other transactions are expensed as incurred.\nDepreciation and Amortization Expense\nBXP\nDepreciation and amortization expense increased by approximately $56.4 million for the year ended December 31, 2024 compared to 2023, as detailed below.\nDepreciation and Amortization for the year ended December 31,\nSame Property Portfolio\nProperties Acquired Portfolio\nProperties Placed In-Service Portfolio\nProperties in or Held for Development or Redevelopment Portfolio (1)\nDuring the year ended December 31, 2023, the Kendall Center Blue Parking Garage was taken out of service and demolished to support the development of 290 Binney Street, an approximately 573,000 net rentable square foot laboratory/life sciences project in Cambridge, Massachusetts. As a result, during the year ended December 31, 2023, we recorded approximately $0.8 million of accelerated depreciation expense for the demolition of the garage, of which approximately $0.2 million related to the step-up of real estate assets.\n\nas Kendall Center Green Garage) properties that bore interest at variable rates, which have all been hedged with interest rates swaps to fix SOFR for all or a portion of the applicable debt term. For a summary of our consolidated debt as of December 31, 2024 refer to the heading “\nLiquidity and Capital Resources—Debt Financing”\nItem 7—Management’s Discussion and Analysis of Financial Condition and Results of Operations.\nNoncontrolling Interests in Property Partnerships\nNoncontrolling interests in property partnerships decreased by approximately $11.1 million for the year ended December 31, 2024 compared to 2023, as detailed below.\nNoncontrolling Interests in Property Partnerships for the year ended December 31,\n767 Fifth Avenue (the General Motors Building)\n7 Times Square (formerly Times Square Tower) (1)\n601 Lexington Avenue (2)\nAtlantic Wharf Office Building\n343 Madison Avenue (3)\n300 Binney Street (4)\n290 Binney Street (5)\nThe decrease was primarily attributable to a decrease in lease revenue from our clients.\nThe decrease was primarily attributable to a decrease in lease revenue from our clients and depreciation and amortization expense related to new and expiring clients.\nProperty is held for future development.\nProperty was fully placed in service on October 31, 2024.\nProperty is currently in development.\nNoncontrolling Interest—Common Units of the Operating Partnership\nFor BXP, noncontrolling interest—common units of the Operating Partnership decreased by approximately $20.1 million for the\nended December 31, 2024 compared to 2023 due primarily to a decrease in allocable income, which was primarily the result of recognizing a greater non-cash impairment charge related to our investment in unconsolidated joint ventures during the\nended December 31, 2024. Due to our ownership structure, there is no corresponding line item on BPLP’s financial statements.\nLiquidity and Capital Resources\nOur principal liquidity needs for the next twelve months and beyond are to:\nfund normal recurring expenses;\nmeet debt service and principal repayment obligations and balloon payments on maturing debt, including:\n$700.0 million of principal outstanding on the 2023 Unsecured Term Loan due May 16, 2025,\n$100.0 million of principal outstanding on the 2024 Unsecured Term Loan due September 26, 2025, for which we have three, one-year extension options, subject to customary conditions,\n$1.0 billion of 3.650% unsecured senior notes due February 1, 2026, and\namounts that become due under BPLP’s unsecured commercial paper program\nfund capital calls from our unconsolidated joint venture investments to fund development costs, capital improvements, leasing costs and debt principal repayment;\nfund development and redevelopment costs;\n\ncompetition from other office, life sciences, hotel, retail and residential buildings;\nlocal real estate market conditions, such as oversupply or reduction in demand for office, life sciences, hotel, retail or residential space;\nchanges in interest rates and availability of financing;\nvacancies, changes in market rental rates and the need to periodically repair, renovate and re-let space;\ndelays in completion of development and redevelopment projects due to supply chain disruptions and labor shortages;\nincreased costs to maintain, renovate and develop our properties related to inflation;\nincreased operating costs, including insurance expense, utilities, real estate taxes, state and local taxes and heightened security costs;\ncivil disturbances, earthquakes and other natural disasters or terrorist acts or acts of war which may result in uninsured or underinsured losses or decrease the desirability to our clients in impacted locations;\nsignificant expenditures associated with each investment, such as debt service payments, real estate taxes (including reassessments and changes in tax laws), insurance and maintenance costs which are generally not reduced when circumstances cause a reduction in revenues from a property;\ndeclines in the financial condition of our clients and our ability to collect rents from our clients; and\ndecreases in the underlying value of our real estate.\nWe face potential adverse effects from major clients’ bankruptcies or insolvencies.\nThe bankruptcy or insolvency of a major client may adversely affect the income produced by our properties. Our clients could file for bankruptcy protection or become insolvent in the future. We cannot evict a client solely because of its bankruptcy. On the other hand, a bankrupt client may reject and terminate its lease with us. In such case, our claim against the bankrupt client for unpaid and future rent would be subject to a statutory cap that might be substantially less than the remaining rent actually owed under the lease, and, even so, our claim for unpaid rent would likely not be paid in full. This shortfall could adversely affect our cash flow and results of operations.\nOur properties face significant competition.\nWe face significant competition from developers, owners and managers of office, life sciences and residential properties and other commercial real estate, including sublease space available from our clients. Substantially all of our properties face competition from similar properties in the same market. This competition may affect our ability to attract and retain clients and may reduce the rents we are able to charge. These competing properties may have vacancy rates higher than our properties, which may result in their owners being willing to lease available space at lower rates than the space in our properties.\nWe face potential difficulties or delays renewing leases or re-leasing space.\nWe derive most of our income from rent received from our clients. If a client experiences a downturn in its business or other types of financial distress, it may be unable to make timely rental payments. Also, when our clients decide not to renew their leases, renew for less space or terminate early, we may not be able to re-let the space or there could be a substantial delay in re-letting the space. Even if clients decide to renew or lease new space, the terms of renewals or new leases, including the cost of required renovations or concessions to clients, may be less favorable to us than current lease terms. As a result, our cash flow could decrease and our ability to make distributions to our securityholders could be adversely affected.\nOur actual costs to develop properties may exceed our budgeted costs.\nWe intend to continue to develop and substantially renovate office, life sciences, retail and residential properties. Our current and future development and construction activities may be exposed to the following risks:\n\nwe may incur construction costs for a development project that exceed our original estimates due to increased materials, labor, leasing or other costs, increases in interest rates, or supply chain disruptions, any of which could make completion of the project less profitable because market rents may not increase sufficiently to compensate for the increase in construction costs;\nwe may be unable to obtain, or face delays in obtaining, required zoning, land-use, building, occupancy, and other governmental permits and authorizations, which could result in increased costs and could require us to abandon our activities entirely with respect to a project;\nwe may abandon development opportunities after we begin to explore them and, as a result, we may lose deposits or fail to recover expenses already incurred;\nwe may expend funds on and devote management’s time to projects that we do not complete;\nwe may be unable to complete construction and/or leasing of a property on schedule or at all; and\nwe may suspend development projects after construction has begun due to changes in economic conditions or other factors, and this may result in the write-off of costs, payment of additional costs or increases in overall costs when the development project is restarted.\nInvestment returns from our developed properties may be less than anticipated.\n\ngenerally or in our properties in particular, which could increase vacancies in our properties or necessitate that we lease our properties on less favorable terms or both. In addition, future terrorist attacks in these markets could directly or indirectly damage our properties, both physically and financially, or cause losses that materially exceed our insurance coverage. As a result of the foregoing, our ability to generate revenues and the value of our properties could decline materially. See also “\n—Some potential losses are not covered by insurance.\nWe face risks associated with security breaches, incidents, and compromises through cyber-attacks, cyber intrusions or otherwise, as well as other significant disruptions of our information technology (IT) networks and related systems.\nWe face risks associated with security breaches, incidents, and compromises, whether through cyber attacks or cyber intrusions over the internet, malware",
  "item2_clean": null
}