{
  "source_file": "tmb-20250525x10k.htm",
  "form_type": "10-K",
  "item1_clean": "Unconsolidated Equity Investments\nWe have two unconsolidated equity investments. Our most significant equity method investment is our joint venture with respect to Ardent Mills, a milling business.\nThe following discussion pertains to all of our reporting segments.\nConagra Brands is a branded consumer packaged goods food company that operates in many sectors of the food industry, with a significant focus on the sale of branded, value-added consumer food products, as well as foodservice items and ingredients.\nRaw Materials and Packaging\nWe use many different raw materials, most of which are commodities, to make and package our products. The prices paid for raw materials used in making our food generally reflect factors such as global economic conditions, trade barriers or restrictions, supply and demand, weather, commodity market fluctuations, currency fluctuations, tariffs, and the effects of governmental agricultural programs, and may be impacted by supply chain disruptions including disruptions caused by pandemics, epidemics, and disease, in humans and animals, such as the avian flu. Although the prices of raw materials can be expected to fluctuate as a result of these factors, we believe such raw materials to be in adequate supply and generally available from numerous sources. From time to time, we have faced increased costs for many of our significant raw materials, packaging, and energy inputs. We seek to mitigate higher input costs through productivity and pricing initiatives and the use of derivative instruments to economically hedge a portion of forecasted future consumption.\nWe experience intense competition for sales of our food items in our major markets. Our food items compete with widely advertised, well-known, branded food, as well as private branded and customized food items. Some of our competitors are larger and have greater resources than we have. We compete primarily on the basis of quality, product innovation, value, customer service, brand recognition, and brand loyalty.\nDemand for certain of our food items may be influenced by holidays, changes in seasons, or other annual events. For example, sales of frozen foods tend to be marginally higher during the winter months, pie sales are highest in November and December due to holidays, and production of certain of our products occurs seasonally, during or immediately following the purchase of agricultural crops.\nTrademarks and Intellectual Property\nOur intellectual property rights, including our trademarks, licensing agreements, trade secrets, patents, and copyrights are of material importance to our business, and we attempt to protect such rights by pursuing remedies available to us under trademark, copyright, trade secret, and patent laws, as well as entering into licensing, third-party nondisclosure and assignment agreements, and policing of third-party misuses of our intellectual property. Some of our products are sold under licensing arrangements with others, including our licensing arrangement with Dolly Parton and our licenses of the\ntrademarks. We also own certain intellectual property rights that are licensed to third parties, such as the\n\nITEM 1. BUSINESS\nGeneral Development of Business\nConagra Brands, Inc. (the “Company”, “Conagra Brands”, “we”, “us”, or “our”), headquartered in Chicago, is one of North America’s leading branded food companies.\nWe combine a 100-year history of making quality food with agility and a relentless focus on collaboration and innovation. The company’s portfolio is continuously evolving to satisfy consumers’ ever-changing food preferences.\nConagra’s brands include\nBOOMCHICKAPOP\nWe began as a Midwestern flour-milling company and entered other commodity-based businesses throughout our history. We were initially incorporated as a Nebraska corporation in 1919 and reincorporated as a Delaware corporation in 1976. Over time, we transformed into the branded, pure-play consumer packaged goods food company we are today. Growing our food businesses has also been fueled by innovation, organic growth of our brands, and expansion into adjacent categories, including through acquisitions. We are focused on delivering sustainable, profitable growth with strong and improving returns on our invested capital.\nNarrative Description of Business\nWe compete throughout the food industry and focus on adding value for our customers who operate in the retail food and foodservice channels.\nOur operations, including our reporting segments, are described below. Our locations, including manufacturing facilities, within each reporting segment, are described in Item 2,\nOur reporting segments are as follows:\nThe Grocery & Snacks reporting segment principally includes branded, shelf-stable food products sold in various retail channels in the United States.\nRefrigerated & Frozen\nThe Refrigerated & Frozen reporting segment principally includes branded, temperature-controlled food products sold in various retail channels in the United States.\nThe International reporting segment principally includes branded food products, in various temperature states, sold in various retail and foodservice channels outside of the United States.\nThe Foodservice reporting segment includes branded and customized food products, including meals, entrees, sauces, and a variety of custom-manufactured culinary products packaged for sale to restaurants and other foodservice establishments primarily in the United States.\n\nPresident and Chief Executive Officer\nExecutive Vice President and Chief Financial Officer\nExecutive Vice President, General Counsel and Corporate Secretary\nExecutive Vice President, Chief Human Resources Officer\nExecutive Vice President, Chief Supply Chain Officer\nExecutive Vice President and Chief Operating Officer\nExecutive Vice President and President New Platforms and Acquisitions\nSenior Vice President and Corporate Controller\nSean M. Connolly has served as our President and Chief Executive Officer and a member of the Board since April 6, 2015. Prior to that, he served as President and Chief Executive Officer and a director of The Hillshire Brands Company (a branded food products company) from June 2012 to August 2014, Executive Vice President of Sara Lee Corporation (a branded food products company and the predecessor to Hillshire), and Chief Executive Officer, Sara Lee North American Retail and Foodservice, from January 2012 to June 2012. Prior to joining Sara Lee in anticipation of the spin-off of Hillshire, Mr. Connolly served as President of Campbell North America, the largest division of Campbell Soup Company (a branded food products company), from October 2010 to December 2011, President, Campbell USA from 2008 to 2010, and President, North American Foodservice for Campbell from 2007 to 2008. Before joining Campbell in 2002, he served in various marketing and brand management roles at The Procter & Gamble Company (a consumer packaged goods company).\nDavid S. Marberger has served as Executive Vice President and Chief Financial Officer since August 2016. Prior to joining Conagra Brands, he served as Chief Financial Officer of Prestige Brands Holdings, Inc. (a provider of over-the-counter healthcare products) from October 2015 until July 2016. Prior to that, Mr. Marberger served as the Senior Vice President and Chief Financial Officer of Godiva Chocolatier, Inc. (a global manufacturer and supplier of premium chocolates) from 2008 until October 2015. Prior to that, Mr. Marberger served Tasty Baking Company (a manufacturer and supplier of baked goods) as Executive Vice President and Chief Financial Officer from 2006 to 2008 and as Senior Vice President and Chief Financial Officer from 2003 to 2006. From 1993 until 2003, he served in various roles at Campbell Soup Company (a branded food products company), where he last held the position of Vice President, Finance, Food and Beverage Division.\nCarey L. Bartell has served as Executive Vice President, General Counsel and Corporate Secretary since June 2022. In this role, Ms. Bartell oversees all legal and governmental affairs activity for the company. Previously, Ms. Bartell served as Vice President and Chief Counsel leading the company’s litigation efforts and compliance programs. Ms. Bartell joined Conagra in 2016. Prior to Conagra, Ms. Bartell worked for eight years at Hospira, Inc., a global pharmaceutical and medical device company, as Senior Counsel and then Vice President, Legal. In this role, she oversaw the company’s litigation, labor, employment, and immigration law, and advised senior management and the board of directors regarding diverse legal and business risks. Ms. Bartell began her career in private practice at a Chicago law firm, first as an Associate and then Partner, where she practiced primarily in the areas of litigation and labor & employment law.\nCharisse Brock has served as Executive Vice President and Chief Human Resources Officer since November 2015 and previously served as Senior Vice President and Interim Chief Human Resources Officer from August 2015 until November 2015. Prior to serving in these roles, Ms. Brock served as Vice President of Human Resources for the Consumer Foods segment of Conagra Brands from September 2010 until August 2015. Ms. Brock joined Conagra Brands in 2004 as Director of Human Resources, supporting the Refrigerated Foods Group. Prior to joining Conagra Brands, she served for 15 years at The Quaker Oats Company (a branded food products company) (which was acquired by PepsiCo during her tenure) in its Consumer Foods Division.\nAlexandre “Ale” O. Eboli has served as Executive Vice President and Chief Supply Chain Officer for Conagra Brands since August 2021. Mr. Eboli has end-to-end supply chain responsibilities for the company, overseeing the manufacturing, procurement, environment, health and safety, plant quality, logistics, and transportation and warehousing teams. Mr. Eboli joined Conagra Brands with 25 years of experience of global end-to-end supply chain leadership within the consumer packaged goods industry and has held a variety of roles in finance, planning, distribution, logistics and manufacturing. Prior to Conagra, Mr. Eboli served as the Head of Supply Chain, North America for The Unilever Group, where he was responsible for overseeing manufacturing facilities and contract\n\nmanufacturers producing personal care, food and ice cream products as well as the related planning, procurement, manufacturing, engineering, logistics, quality, manufacturing excellence and customer service functions.\nThomas M. McGough has served as Executive Vice President and Chief Operating Officer since May 2024. He served as the Company’s Executive Vice President and Co-Chief Operating Officer from October 2018 until May 2024; as the Company’s President, Operating Segments from May 2017 until October 2018 and as the Company’s President of Consumer Foods from May 2013 until May 2017. Mr. McGough also served as the Company’s President, Grocery Products from 2011 until May 2013 and as Vice President in the Company’s Consumer Foods organization from 2007 to 2011. Prior to joining the Company, he served in various roles at H.J. Heinz (a food processing company), where he began his career in 1990.\nNoelle O’Mara has served as Executive Vice President and President, New Platforms and Acquisitions since May 2024. Prior to joining Conagra, she served as Group President and Chief Marketing Officer at Tyson Foods, from August 2019 to November 2022, where she was responsible for their prepared foods business unit. Prior to joining Tyson in 2016, Ms. O'Mara spent over a decade at Kraft Foods Group leading various brands and portfolios.\nWilliam E. Johnson has served as Senior Vice President and Corporate Controller since June 2023. He joined the Company as Assistant Controller in September 2019 and, prior to that, he was Director of Internal Audit at Kiewit Corporation, a North American construction and engineering organization, from Ju",
  "item7_clean": "ITEM 7. MANAGEMENT’S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS\nThe following discussion and analysis is intended to provide a summary of significant factors relevant to our financial performance and condition. The discussion and analysis should be read together with our consolidated financial statements and related notes in Item 8, Financial Statements and Supplementary Data. Results for the fiscal year ended May 25, 2025 are not necessarily indicative of results that may be attained in the future.\nFORWARD-LOOKING STATEMENTS\nThe information contained in this report includes forward-looking statements within the meaning of the federal securities laws. Examples of forward-looking statements include statements regarding our expected future financial performance or position, results of operations, business strategy, plans and objectives of management for future operations, and other statements that are not historical facts. You can identify forward-looking statements by their use of forward-looking words, such as “may”, “will”, “anticipate”, “expect”, “believe”, “estimate”, “intend”, “plan”, “should”, “seek”, or comparable terms.\nReaders of this report should understand that these forward-looking statements are not guarantees of performance or results. Forward-looking statements provide our current expectations and beliefs concerning future events and are subject to risks, uncertainties, and factors relating to our business and operations, all of which are difficult to predict and could cause our actual results to differ materially from the expectations expressed in or implied by such forward-looking statements. These risks, uncertainties, and factors include: risks associated with general economic and industry conditions, including inflation, reduced consumer confidence and spending, declining benefits or increased limitations under government food assistance programs for consumers, rising unemployment, recessions, increased energy costs, supply chain challenges, increased tariffs and taxes, labor cost increases or shortages, currency rate fluctuations, actual or threatened hostilities or war, and or other geopolitical conflicts; risks related to the availability and prices of commodities and other supply chain resources, including raw materials, packaging, energy, and transportation, weather conditions, health pandemics or outbreaks of disease, or other geopolitical uncertainty; disruptions or inefficiencies in our supply chain and/or operations; risks related to the effectiveness of our hedging activities and ability to respond to volatility in commodities; risks related to the ultimate impact of, including reputational harm caused by, any product recalls and product liability or labeling litigation, including litigation related to lead-based paint and pigment and cooking spray; risks related to our ability to execute operating and value creation plans and achieve returns on our investments and targeted operating efficiencies from cost-saving initiatives, and to benefit from trade optimization programs; risks related to our ability to deleverage on currently anticipated timelines, and to continue to access capital on acceptable terms or at all; risks related to the Company’s competitive environment, cost structure, and related market conditions; risks related to our ability to respond to changing consumer preferences including health and wellness perceptions and the success of our innovation and marketing investments; risks associated with actions by our customers, including changes in distribution and purchasing terms; risks related to the seasonality of our business; risks associated with our contract manufacturing arrangements and other third-party service provider dependencies; risks associated with actions of governments and regulatory bodies that affect our businesses, including the ultimate impact of new or revised regulations or interpretations including to address climate change; risks related to the Company’s ability to execute on its strategies or achieve expectations related to environmental, social, and governance matters, including as a result of evolving legal, regulatory, and other standards, processes, and assumptions, the pace of scientific and technological developments, increased costs, the availability of requisite financing, and changes in carbon pricing or carbon taxes; risks related to a material failure in or breach of our or our vendors’ information technology systems and other cybersecurity incidents; risks related to our ability to identify, attract, hire, train, retain and develop qualified personnel; risk of increased pension, labor or people-related expenses; risks and uncertainties associated with intangible assets, including any future goodwill or intangible assets impairment charges; risks relating to\n\nThe discussion that follows should be read together with the consolidated financial statements and related notes contained in this report. Results for fiscal 2025 are not necessarily indicative of results that may be attained in the future.\nEXECUTIVE OVERVIEW\nConagra Brands, Inc. (the “Company”, “Conagra Brands”, “we”, “us”, or “our”), headquartered in Chicago, is one of North America’s leading branded food companies.\nWe combine a 100-year history of making quality food with agility and a relentless focus on collaboration and innovation. The company’s portfolio is continuously evolving to satisfy consumers’ ever-changing food preferences.\nConagra’s brands include\nBOOMCHICKAPOP\nFiscal 2025 performance compared to fiscal 2024 reflected a decrease in net sales, with organic (excludes the impacts of foreign exchange, acquisitions, and divestitures) decreases in our Grocery & Snacks, Refrigerated & Frozen, and Foodservice segments, partially offset by an increase in our International segment. Overall gross profit decreased primarily as a result of lower net sales, input cost inflation, and unfavorable operating leverage, partially offset by productivity. Excluding items impacting comparability, overall segment operating profit decreased in all of our segments compared to the prior year. Corporate expenses and selling, general and administrative (“SG&A”) expenses were higher primarily due to items impacting comparability, as discussed below, partially offset by lower incentive compensation expense. We recognized higher equity method investment earnings, lower interest expense, and lower income tax expense, in each case compared to fiscal 2024. Excluding items impacting comparability, our effective tax rate was lower compared to fiscal 2024.\nDiluted earnings per share were $2.40 and $0.72 in fiscal 2025 and 2024, respectively. The increase in diluted earnings per share reflected higher net income. See\n“Items Impacting Comparability”\nbelow as several significant items affected the comparability of year-over-year results.\nTrends Impacting our Business\nOur industry continues to be impacted by shifting consumer behavior, commodity cost fluctuations, exchange rate volatility, labor cost inflation, input cost inflation, supply chain pressures, and other global macroeconomic challenges. Although rapidly changing trade policies and announcements of potential tariff increases caused increased uncertainty in the second half of fiscal 2025, we saw little impact to our results in fiscal 2025 due to delayed implementation or effect of the announced tariffs. Throughout fiscal 2025, we experienced an elevated amount of input cost inflation and negative impacts from foreign exchange rates, which we were able to partially offset through our on-going productivity initiatives.\nOur industry is anticipating increased supply chain challenges, commodity cost volatility, and consumer and economic uncertainty due to rapid changes in global trade policies including increasing or fluctuating tariffs. We expect inflation and tariffs to negatively impact our\ncosts of goods sold in fiscal 2026. We expect consumer trends to continue to evolve and our volumes to improve over time; however, in the near-term, we expect economic pressures on consumers, including the challenges of high inflation and the impact of increased or fluctuating tariffs, and related price increases, to continue to negatively impact our volumes throughout fiscal 2026.\nWe also expect foreign exchange rates to continue to negatively impact our earnings through fiscal 2026.\nWe will continue to evaluate the evolving macroeconomic environment to take action to mitigate the impact on our business, consolidated results of operations, and financial condition.\n\nWe expect to have sufficient cash flows from the above cited sources to meet the material cash requirements of these contractual obligations as they become settleable in the ordinary course of business.\nCapital Expenditures\nWe continue to make investments in our business and operating facilities. Our preliminary estimate of capital expenditures for fiscal 2026 is approximately $450 million.\nIn fiscal 2025, we used $11.0 million of cash, which was the net result of $1.69 billion generated from operating activities, $542.2 million used in investing activities, $1.16 billion used in financing activities, and a decrease of $2.4 million due to the effects of changes in foreign currency exchange rates.\nCash generated from operating activities totaled $1.69 billion in fiscal 2025, as compared to $2.02 billion generated in fiscal 2024. The decrease in operating cash flows for fiscal 2025 compared to fiscal 2024 was primarily driven by lower operating profits, lower dividend payments received from one of our equity method investments, and higher inventory balances. These decreases were partially offset by the accelerated receipt of our outstanding receivables in exchange for a slightly higher prompt pay discount, which increased our cash flow from operations by approximately $140 million. Operating cash flows in fiscal 2025 also benefited from lower tax payments as a result of lower taxable income and recent interactions with the U.S. Internal Revenue Service (“IRS”) allowing for additional tax deductions.\nCash used in investing activities totaled $542.2 million in fiscal 2025 compared to $375.0 million in fiscal 2024. Investing activities in fiscal 2025 consisted primarily of capital expenditures totaling $389.3 million, and the purchases of an existing contract manufacturer and Sweetwood Smoke & Co. for a total of $230.6 million, net of cash acquired, which were partially offset by net proceeds totaling $76.8 million from the sale of our ownership stake in ATFL. Investing activities in fiscal 2024 consisted primarily of capital expenditures totaling $388.1 million.\nCash used in financing activities totaled $1.16 billion in fiscal 2025 compared to $1.66 billion in fiscal 2024. Financing activities in fiscal 2025 principally reflected repayments of long-term debt of $281.3 million, net short-term borrowing repayments of $125.6 million, cash dividends paid of $669.2 million, and common stock repurchases of $64.0 million. Financing activities in fiscal 2024 principally reflected repayments of long-term debt of $1.77 billion, the issuance of long-term debt totaling $500.0 million, net short-term borrowing issuances of $290.6 million, and cash dividends paid of $659.3 million.\nCash Held by International Subsidiaries\nThe Company had cash and cash equivalents of $68.0 million at May 25, 2025 and $77.7 million at May 26, 2024, of which $61.6 million at May 25, 2025 and $66.7 million at May 26, 2024 was held in foreign countries. A deferred tax liability is provided for certain undistributed foreign earnings that are not considered to be indefinitely reinvested or cannot be remitted in a tax-neutral transaction. Other undistributed foreign earnings are invested indefinitely and therefore we have not provided deferred taxes on those earnings.\nCRITICAL ACCOUNTING ESTIMATES\nThe process of preparing financial statements requires the use of estimates on the part of management. The estimates used by management are based on our historical experiences combined with management’s understanding of current facts and circumstances. Certain of our accounting estimates are considered critical as they are both important to the portrayal of our financial condition and results and require significant or complex judgment on the part of management. The following is a summary of certain accounting estimates considered critical by management.\nOur Audit/Finance Committee has reviewed management’s development, selection, and disclosure of the critical accounting estimates.\n—We offer various forms of advertising, trade promotions, and consumer incentives which are primarily recorded as a reduction in revenue. Advertising costs are expensed as incurred and recorded in SG&A expenses.\n\nNet sales for fiscal 2025 in our International segment reflected a 5.7% decrease due to unfavorable foreign exchange rates, a 3.9% increase in organic price/mix, and a 3.4% decrease in organic volume, in each case compared to fiscal 2024. The unfavorable foreign exchange rates were primarily due to the devaluation of the Mexican Peso relative to the US dollar. Fiscal 2025 and 2024 included $23.6 million and $93.2 million, respectively, of net sales related to our ownership stake in Agro Tech Foods Limited (“ATFL”), which was sold in the first quarter of fiscal 2025.\nNet sales for fiscal 2025 in our Foodservice segment included a decrease in organic volume of 8.1% compared to fiscal 2024, driven by the ongoing softness in restaurant traffic and the impact of lost business from the prior year. Organic price/mix increased by 3.3% compared to fiscal 2024, reflecting inflation-driven pricing. Additionally, we estimate that net sales in our Foodservice segment during fiscal 2025 were impacted by approximately $3 million due to the temporary manufacturing disruptions in our\nSG&A Expenses (Includes general corporate expenses)\nSG&A expenses totaled $1.54 billion for fiscal 2025, an increase of $49.8 million compared to fiscal 2024. SG&A expenses for fiscal 2025 reflected the following:\nItems impacting comparability of earnings\nnet charges of $91.1 million in connection with our restructuring plans and\nnet charges totaling $88.7 million related to legacy legal matters.\nOther changes in expenses compared to fiscal 2024\na decrease in short-term incentive expense of $43.9 million primarily due to a decrease in the estimated level of achievement of certain performance targets,\na decrease in advertising and promotion expense of $26.4 million,\nan increase in salary, wage, and fringe benefit expense of $18.4 million due to merit and employee insurance costs,\na decrease in consulting and professional fees of $11.8 million, partially due to the implementation of a new enterprise resource planning software system in Mexico in the prior year, and\nan increase in share-based payment expense of $10.5 million.\nSG&A expenses for fiscal 2024 included the following items impacting the comparability of earnings:\nnet charges of $47.5 million in connection with our restructuring plans,\nnet charges of $34.8 million related to legacy legal matters, and\na net gain of $8.1 million primarily associated with insurance proceeds from the previous fire that occurred at one of our manufacturing facilities.\nSegment Operating Profit\n\ninflation, and unfavorable operating leverage, partially offset by productivity. In addition, we recognized a benefit of $11.3 million and $14.4 million in fiscal 2025 and 2024, respectively, related to insurance proceeds for lost sales from our fiscal 2023 brand recall on\n. The decrease in gross profits was partially offset by lower SG&A expenses compared to fiscal 2024.\nSegment operating profit in our Refrigerated & Frozen segment for fiscal 2025 reflected a decrease in gross profits of $211.3 million compared to fiscal 2024. The decrease was driven by the net sales decline discussed above, impacts of input cost inflation, ",
  "item2_clean": null
}