{
  "source_file": "carr-20241231.htm",
  "form_type": "10-K",
  "item1_clean": "ITEM 1. BUSINESS\nCarrier Global Corporation (\"we\" or \"our\" or the \"Company\") is a global leader in intelligent climate and energy solutions with a focus on providing differentiated, digitally-enabled lifecycle solutions to our customers. Our portfolio includes industry-leading brands such as Carrier, Viessmann, Toshiba, Automated Logic and Carrier Transicold that offer innovative heating, ventilating and air conditioning (\"HVAC\"), refrigeration and cold chain transportation solutions to help make the world safer and more comfortable. We also provide a broad array of related building services, including audit, design, installation, system integration, repair, maintenance and monitoring.\nThrough our performance-driven culture, we anticipate creating long-term shareowner value by investing strategically to strengthen our product position in homes, buildings and across the cold chain in order to drive profitable growth. We believe our business segments are well positioned to benefit from favorable secular trends, including the mega-trends of urbanization, population growth and demographic shifts, food security and safety, digitalization, global connectivity and energy efficiency. Coupled with our industry-leading brands and track record of innovation, we continue to provide market-leading solutions for our customers.\nIn addition, we continue to invest in product and technology innovation within our offerings as well as invest in new business models including Carrier Energy, our solution to reduce demands on power grids and energy infrastructure by better managing energy consumption and reducing end-customer energy costs. This new business model is also expected to provide a digital connection between the end-customers and Carrier, providing us with opportunities to offer services and aftermarket parts and components over the life of a product.\nFor the year ended December 31, 2024, our net sales were $22.5 billion and our operating profit was $2.6 billion. Our net sales for 2024 were derived from the Americas (52%), Europe, Middle East and Africa (\"EMEA\") (31%) and Asia-Pacific (17%). Our international operations, including U.S. export sales, represented approximately 50% of our net sales for 2024. During the same period, new equipment comprised 75% and parts and service comprised 25% of our net sales.\n* Segment sales include inter-company sales.\nSeparation from United Technologies Corporation\nOn April 3, 2020 (the \"Distribution Date\"), United Technologies Corporation, (\"UTC\"), since renamed RTX Corporation (\"Raytheon Technologies Corporation\" or \"RTX\") completed the spin-off of Carrier into an independent publicly traded company (the \"Separation\") through a pro rata distribution (the \"Distribution\") on a one-for-one basis of all of the outstanding shares of common stock of Carrier to UTC shareowners who held shares of UTC common stock as of the close of business on March 19, 2020, the record date of the Distribution. In addition, we entered into several agreements with UTC and Otis Worldwide Corporation (\"Otis\") that govern various aspects of the relationship among us, UTC and Otis following the Separation and Distribution. As of December 31, 2024, only certain portions of the Tax Matters Agreement (\"TMA\") remain in effect.\nWe globally manage our business operations through two segments: HVAC and Refrigeration. Each respective segment's major products, services and distribution methods are as follows:\nThe HVAC segment provides products, controls, services and solutions to meet the heating, cooling and ventilation needs of our customers while enhancing building performance, health and energy efficiency. Products and services include air conditioners, heating systems, heat pumps, building automation systems, aftermarket components, repair and maintenance services and rentals as well as modernization and upgrades through the product lifecycle. Our products and services cover a wide range of customers, including in the residential, commercial, education, healthcare, technology, retail, hospitality, data center, and infrastructure markets, among others. Products and solutions are sold directly to building contractors and owners and indirectly through joint ventures, independent sales representatives, distributors, wholesalers, dealers and retail outlets. Our established brands include Carrier, Viessmann, Toshiba, Automated Logic, Bryant, CIAT, Day & Night, Heil, NORESCO and Riello which offer an innovative and complete portfolio of products that provide numerous solutions for our customers. These products, in addition to the markets they serve, provide future service opportunities including replacement components, preventative and on-demand contractual maintenance and repair, digital monitoring and modifications/upgrades.\nThe Refrigeration segment provides products, services and monitoring for reliable transport and preservation of food, medicine and other perishable cargo. Products include trucks, trailers, shipping containers and intermodal applications to meet customer needs for both ground transport and ocean freight, while services include maintenance, repair, and monitoring. Products and services are sold directly to transportation companies and indirectly through joint ventures, independent sales representatives, distributors, wholesalers and dealers. Products and services are sold under established brand names, including Carrier Transicold and Sensitech. We provide customers the flexibility to select solutions from a very broad range of technologies including fossil fuel applications and electric solutions to best adhere to their objectives and preferences as well as regulatory requirements. In addition, our focus on digitalization and innovation is expanding our offering of service and aftermarket solutions, including on-demand and subscription-based monitoring of customer cargo. Through the lifecycle of the product, we also offer modifications and upgrades to the current installed base, improving energy efficiency, noise or other customer requirements.\nPortfolio Transformation\nIn 2023, we began the journey to further simplify our company and accelerate our business strategy. Our actions transformed our business portfolio in an effort to establish us as a pure-play, global leader in intelligent climate and energy solutions. We believe that our greater focus on breakthrough innovation, electrification, energy-efficient solutions, the use of environmentally friendly refrigerants and connected ecosystems will further strengthen our global leadership position in our end-markets and provide responsible solutions for our customers.\nOn April 25, 2023, we announced that we entered into a Share Purchase Agreement (the “Agreement”) to acquire the climate solutions business (the \"VCS Business\") of Viessmann Group GmbH & Co. KG (“Viessmann”), a privately-held company. The VCS Business develops intelligent, integrated and sustainable technologies, including heat pumps, boilers, photovoltaic systems, home battery storage and digital solutions, primarily for residential customers in Europe. The acquisition was completed on January 2, 2024 and reported within our HVAC segment.\nOn June 2, 2024, we completed the sale of our Access Solutions business (\"Access Solutions\") to Honeywell International Inc. (\"Honeywell\") for cash proceeds of $5.0 billion. Access Solutions, historically reported in our Fire & Security segment, is a global supplier of physical security and digital access solutions supporting the hospitality, commercial, education and military markets. We recognized a net gain on the sale of $1.8 billion.\nOn July 1, 2024, we completed the sale of our Industrial Fire business (\"Industrial Fire\") for cash proceeds of $1.4 billion. Industrial Fire, historically reported in our Fire & Security segment, is a leading manufacturer of a full spectrum of fire detection and suppression solutions and services in critical high-hazard environments, including oil and gas, power generation, marine and offshore facilities, automotive, data centers and aircraft hangars. We recognized a net gain on the sale of $319 million.\nOn October 1, 2024, we completed the sale of our Commercial Refrigeration business (\"CCR\") for cash proceeds of $679 million. CCR, historically reported in our Refrigeration segment, is a global supplier of turnkey solutions for commercial refrigeration systems and services, with a primary focus on serving food retail customers, cold storage facilities and warehouses. We recognized a net gain on the sale of $292 million. The net proceeds received are subject to working capital and other adjustments provided in the stock purchase agreement.\nOn December 2, 2024, we completed the sale of our Commercial and Residential Fire business (\"CRF Business\") for cash proceeds of $2.9 billion. The CRF Business, historically reported in our Fire & Security segment, is a leading manufacturer of fire detection and alarm solutions for both commercial and residential applications. We recognized a net gain on the sale of $1.4 billion. The net proceeds received are subject to working capital and other adjustments provided in the stock purchase agreement.\nOur vision is to be a global leader in intelligent climate and energy solutions with a focus on providing differentiated, digitally-enabled lifecycle solutions to our customers. To achieve our vision, our core business strategy is to create innovative, differentiated products and solutions to provide a fully-integrated customer experience in order to be our customer’s preferred provider. We believe our strategy is supported by significant favorable secular trends, our industry-leading brands and track record of innovation. Our business strategy is built around the following pillars to drive long-term growth and deliver shareholder value:\nDifferentiated Products, Channels and Brands\nOur strategy involves driving organic growth by further enhancing our proven track record of innovation, which is focused on designing smarter, more connected and more efficient sustainable systems and solutions. Our strategy also relies on our iconic, industry-leading brands and on strengthening our long-term relationships with channel partners and customers by offering solutions that anticipate customer needs with a focus on technologies related to energy efficiency, emissions, air quality, electrification, refrigerants with lower global warming potential and noise reduction.\nDigitally-Enabled Lifecycle Solutions\nWe are focused on offering a comprehensive and differentiated suite of sustainable technologies and services. We expect that these solutions increase our total available market opportunity, enhance our predictive service and maintenance capabilities, strengthen our customer intimacy and increase aftermarket growth. Beginning with product design, our product offerings are moving towards digitally-enabled solutions that connect us to our customers throughout the product’s full lifecycle and help us grow our aftermarket sales. We plan to meet our customer’s needs by offering a wider-range of aftermarket products and services including replacement components, preventative and on-demand maintenance and repair, digital monitoring and modifications/upgrades. Our digitally-enabled lifecycle solutions include Abound, a cloud-based building platform that unlocks and unites building data to create healthy, sustainable and intelligent solutions for indoor spaces. It gathers data from disparate systems, sensors and sources; identifies opportunities to optimize performance; and works with healthy building solutions to improve occupant experiences. In addition, our Lynx digital platform, developed in collaboration with Amazon Web Services (“AWS”), allows customers to leverage data to enhance visibility, resiliency, agility and efficiency in the cold chain to reduce loss of cargo, lower operations costs and support real-time decisions.\nExpand Portfolio with Energy Management ",
  "item7_clean": "present after performing step zero, we would perform a quantitative impairment analysis to estimate fair value.\nFor our 2024 goodwill and indefinite-lived intangible assets impairment tests, we elected to perform qualitative step zero assessments\nfor all tests (except one) to determine if it was more likely than not that the fair values of our reporting units and indefinite-lived intangible assets were below carrying value. We considered macroeconomic factors including global economic growth, general macroeconomic trends for the markets in which our reporting units operate and where the intangible assets are utilized and the forecasted growth of the global industrial products industry. In addition to these macroeconomic factors, among other things, we considered the reporting units’ current results and forecasts, changes in the nature of each business, any significant legal, regulatory, contractual, political or other business climate factors, changes in the industry and competitive environment, changes in the composition or carrying amount of net assets and any intention to sell or dispose of a reporting unit or cease the use of any indefinite-lived intangible assets.\nBased upon our qualitative analysis, we determined that our goodwill and indefinite-lived intangible assets were\nFor the remaining goodwill test, we elected to perform a quantitative test to determine if it was more likely than not that the fair value of our Refrigeration reporting unit was below carrying value. We utilized a discounted cash flow method under the income approach to estimate the fair value of the reporting unit. The approach relies on our estimates of future cash flows, long-term growth rates, discount rates and income tax rates and explicitly addressed factors such as timing, growth and margins with due consideration given to forecasting, market and geographic risk. The results did not indicate any goodwill impairment. A significant increase in the discount rate, decrease in the long-term growth rate or substantial reductions in our end markets and volume assumptions could have a negative impact on the estimated fair value of this reporting unit.\nRevenue Recognition from Contracts with Customers\nRevenue is recognized when control of a good or service promised in a contract (i.e., performance obligation) is transferred to a customer. Control is obtained when a customer has the ability to direct the use of and obtain substantially all of the remaining benefits from that good or service. A significant portion of our performance obligations are recognized at a point-in-time when control of the product transfers to the customer, which is generally the time of shipment. The remaining portion of our performance obligations are recognized over time as the customer simultaneously obtains control as we perform work under a contract, or if the product being produced for the customer has no alternative use and we have a contractual right to payment.\nA performance obligation is a distinct good, service or a bundle of goods and services promised in a contract. Some of our contracts with customers contain a single performance obligation, while others contain multiple performance obligations most commonly when a contract spans multiple phases of a product life-cycle such as production, installation, maintenance and support. We identify performance obligations at the inception of a contract and allocate the transaction price to each distinct performance obligation. Revenue is recognized when or as the performance obligation is satisfied. When there are multiple performance obligations within a contract, we allocate the transaction price to each performance obligation based on its relative stand-alone selling price.\nWe primarily generate revenue from the sale of products to customers and recognize revenue at a point in time when control transfers to the customer. Transfer of control is generally based on the shipping terms of the contract. In addition, we recognize revenue on an over-time basis on installation and service contracts. For over-time performance obligations requiring the installation of equipment, revenue is recognized using costs incurred to date relative to total estimated costs at completion to measure progress. Incurred costs represent work performed, which correspond with and best depict transfer of control to the customer. Contract costs include direct costs such as labor, materials and subcontractors’ costs and, where applicable, indirect costs.\nThe transaction price allocated to performance obligations reflects our expectations about the consideration we will be entitled to receive from a customer. We include variable consideration in the estimated transaction price when there is a basis to reasonably estimate the amount and when it is probable that a significant reversal of revenue recognized would not occur when the uncertainty associated with variable consideration is subsequently resolved. In addition, we customarily offer our customers incentives to purchase products to ensure an adequate supply of our products in distribution channels. The principal incentive programs provide reimbursements to distributors for offering promotional pricing for products. We account for estimated incentive payments as a reduction in sales at the time a sale is recognized.\nWe account for income taxes in accordance with ASC 740,\n(\"ASC 740\"). Deferred tax assets and liabilities are determined based on temporary differences between financial reporting and tax bases of assets and liabilities, applying enacted tax rates expected to be in effect for the year in which the differences are expected to reverse. We recognize future tax benefits to the extent that realizing these benefits is considered in our judgment to be more likely than not. For those jurisdictions where the expiration date of tax carryforwards or the projected operating results indicate that realization is not likely, a valuation allowance is provided. We review the realizability of our deferred tax asset valuation allowances on a quarterly basis, or whenever events or changes in circumstances indicate that a review is required and will adjust our estimate if significant events so dictate. To the extent that the ultimate results differ from our original or adjusted estimates, the effect will be recorded in the provision for income taxes in the period that the matter is finally resolved.\nIn the ordinary course of business, there is inherent uncertainty in quantifying our income tax positions. We assess our income tax positions and record tax benefits for all years subject to examination based upon management’s evaluation of the facts, circumstances and information available at the reporting date. For those tax positions where it is more likely than not that a tax benefit will be sustained, we have recorded the largest amount of tax benefit with a greater than 50% likelihood of being realized upon ultimate settlement with a taxing authority that has full knowledge of all relevant information. For those income tax positions where it is not more likely than not that a tax benefit will be sustained, no tax benefit has been recognized in the Consolidated Financial Statements.\nContingent Liabilities\nWe are involved in various litigation, claims and administrative proceedings, including those related to environmental (including asbestos) and legal matters. In accordance with ASC 450,\n(\"ASC 450\"), we record accruals for loss contingencies when it is probable that a liability will be incurred and the amount of the loss can be reasonably estimated. These accruals are generally based upon a range of possible outcomes. If no amount within the range is a better estimate than any other, we accrue the minimum amount. In addition, these estimates are reviewed periodically and adjusted to reflect additional information when it becomes available. We are unable to predict the final outcome of these matters based on the information currently available. However, we do not believe that the resolution of any of these matters will have a material adverse effect upon our competitive position, results of operations, cash flows or financial condition.\nAs described in Note 23 – Commitments and Contingent Liabilities in the accompanying Notes to the Consolidated Financial Statements in this Annual Report, contractual, regulatory and other matters, including asbestos claims, may arise in the ordinary course of business that subject us to claims or litigation. We have recorded reserves in the consolidated financial statements related to these matters, which are developed using input derived from actuarial estimates and historical and anticipated experience depending on the nature of the reserve, and in certain instances in consultation with legal counsel, internal and external consultants and engineers. Subject to the uncertainties inherent in estimating future costs for these types of liabilities, we believe our estimated reserves are reasonable and do not believe the final determination of the liabilities with respect to these matters would have a material adverse effect upon our competitive position, results of operations, cash flows or financial condition. See the \"Risk Factors\" section in this Annual Report for additional information.\nRecent Accounting Pronouncements\nSee Note 3 – Summary of Significant Accounting Policies in the accompanying Notes to the Consolidated Financial Statements in this Annual Report for a discussion of recent accounting pronouncements and their effect on our financial statements.\n\nPercentage of net sales\nGross margin increased by $819 million compared with the year ended December 31, 2023. The main driver of the increase related to ongoing customer demand, pricing improvements and our continued focus on productivity initiatives. Operating results associated with the VCS Business since the date of acquisition further benefited gross margin during the period. However, the results of the VCS Business included inventory step-up, backlog amortization and intangible asset amortization resulting from the recognition of acquired assets at fair value. These costs had a 260 basis point unfavorable impact on gross margin as a percentage of\n. As a result, gross margin as a percentage of\ndecreased by 60 basis points compared with the same period of 2023.\nFor the year ended December 31, 2024, operating expenses, including\nEquity method investment net earnings\n, was $3.3 billion, a 11% increase compared with the same period of 2023. The components were as follows:\nFor the Year Ended December 31,\nSelling, general and administrative\nResearch and development\nEquity method investment net earnings\nOther income (expense), net\nPercentage of net sales\nFor the year ended December 31, 2024,\nSelling, general and administrative\nexpenses were $3.2 billion, a 23% increase compared with the same period of 2023. The increase is primarily due to incremental expenses associated with the VCS Business since the date of acquisition. In addition, higher compensation and other employee-related costs further contributed to the increase. The current year also included $95 million of acquisition and divestiture-related costs compared with $123 million during the year ended December 31, 2023.\nResearch and development\ncosts relate to new product development and new technology innovation. Due to the variable nature of program development schedules, year-over-year spending levels can fluctuate. In addition, we continue to invest to prepare for future energy efficiency and refrigerant regulation changes and in digital controls technologies.\nInvestments over which we do not exercise control, but have significant influence, are accounted for using the equity method of accounting. For the year ended December 31, 2024,\nEquity method investment net earnings\nwere $231 million, a 9% increase compared with the same period of 2023. The increase was primarily driven by higher earnings in HVAC joint ventures across all regions. The increase was partially offset by a $23 million charge associated with the devaluation of U.S. Dollar denominated balances at an HVAC equity investment in Egypt. In addition, prior year results include a $16 million benefit recognized in connection with a favorable tax ruling at a minority owned joint venture.\nOther income (expense), net\nprimarily includes the impact of gains and losses related to the sale of businesses or interests in our equity method investments, foreign currency gains and losses on transactions that are denominated in a currency other than an entity's functional currency and hedging-related activities. During the year ended December 31, 2024, we completed the sale of CCR and recognized a gain on the sale of $318 million. In addition, we recognized a $46 million gain associated with our share of United Technologies Corporation's conclusion of certain income tax matters from their 2017 and 2018 tax audit with the Internal Revenue Service (\"IRS\"). In connection with the acquisition of the VCS Business, we recognized an $86 million loss on the mark-to-market valuation of our window forward contracts associated with the expected cash outflows of the Euro-denominated purchase price.\nDuring the year ended December 31, 2023, we recognized a $96 million loss on the mark-to-market valuation of our window forward contracts associated with the expected cash outflows of the Euro-denominated purchase price of the VCS Business. In addition, the carrying value of our previously held equity investments in Toshiba Carrier Corporation (\"TCC\") were recognized at fair value at the date of acquisition. As a result, we recognized an $8 million non-cash loss associated with the increase in our ownership interest.\nNon-Operating Income (Expense), net\nyear ended December 31, 2024\nNon-operating income (expense), net\nmpared with the same period of\n2023. The components were as follows:\nFor the Year Ended December 31,\nNon-service pension benefit (expense)\nInterest (expense) income, net\nNon-operating income (expense), net\nNon-operating income (expense), net\nincludes the results from activities other than normal business operations such as interest expense, interest income and the non-service components of pension and post-retirement obligations. Interest expense is affected by the amount of debt outstanding and the interest rates on that debt. For the year ended December 31, 2024, interest expense\n\nfor additional information regarding the terms of our long-term debt obligations.\nScheduled maturities of long-term debt, excluding amortization of discount, are as follows:\nThe following table presents our credit ratings and outlook as of\nS&P\nBBB\nA2\nP2\nBBB+\nF1\nThe long-term rating was upgraded by Moody's to Baa2 on May 13, 2024. Fitch's was updated to BBB+ on October 18, 2024.\nFitch upgraded its short-term rating to F1 from F2 and revised its outlook to stable from positive on October 18, 2024.\nS&P revised its outlook to positive from stable in December 2023.\nPortfolio Transformation\nOn June 2, 2024, we completed the divestiture of Access Solutions for cash proceeds of $5.0 billion. On July 1, 2024, we completed the divestiture of Industrial Fire for cash proceeds of $1.4 billion. On October 1, 2024, we completed the divestiture of CCR for cash proceeds of $679 million, subject to customary working capital and other adjustments. On December 2, 2024, we completed the divestiture of the CRF Business for cash proceeds of $2.9 billion, subject to customary working capital and other adjustments. Consistent with our capital allocation strategy, the net proceeds will be used to fund repayment of debt, investments in organic and inorganic growth initiatives and capital returns to shareowners as well as for general corporate purposes.\nShare Repurchase Program\nWe may purchase our outstanding common stock from time to time subject to market conditions and at our discretion. Repurchases occur in the open market or thro",
  "item2_clean": null
}