{
  "source_file": "cat-20241231.htm",
  "form_type": "10-K",
  "item1_clean": "The competitive environment for reciprocating engines in marine, oil and gas, industrial and electric power generation systems along with turbines in oil and gas and electric power generation consists of a few larger global competitors that compete in a variety of markets that Caterpillar serves, and a substantial number of smaller companies that compete in a limited-size product range, geographic region and/or application. Principal global competitors include Cummins Inc., Deutz AG, Rolls-Royce Power Systems AG and Siemens Energy AG. Other competitors, such as Volvo Penta AB, FPT Industrial SpA (Iveco Group), INNIO Group, GE Vernova Inc., Kawasaki Heavy Industries Ltd., MAN Energy Solutions SE (VW), Weichai Power Co., Ltd., and other emerging market competitors compete in certain markets in which Caterpillar competes. An additional set of competitors, including Aggreko plc, Generac Holdings Inc., Rehlko Energy, Baker Hughes Co., and others, are primarily packagers who source engines and/or other components from domestic and international suppliers and market products regionally and internationally through a variety of distribution channels. In rail-related businesses, our global competitors include Wabtec Corp, Greenbrier Companies, Inc., Voestalpine AG, Vossloh AG, Alstom SA, and Siemens Mobility A/S. We also compete with other companies on a more limited range of products, services and/or geographic regions.\nThe Energy & Transportation portfolio includes the following products and related parts:\nReciprocating engine powered generator sets\nReciprocating engines, drivetrain and integrated systems and solutions supplied to the industrial industry as well as Caterpillar machinery\nIntegrated systems and solutions used in the electric power generation industry\nTurbines, centrifugal gas compressors and related services\nReciprocating engines, drivetrain and integrated systems and solutions for the marine and oil and gas industries\nDiesel-electric locomotives and components and other rail-related products and services\nFinancial Products Segment\n\nThe business of our Financial Products Segment is primarily conducted by Cat Financial, Insurance Services and their respective subsidiaries and affiliates. Cat Financial is a wholly owned finance subsidiary of Caterpillar Inc., and it provides retail and wholesale financing alternatives to customers and dealers around the world for Caterpillar products and services, as well as financing for power generation facilities that, in most cases, incorporate Caterpillar products. Retail financing is primarily comprised of installment sale contracts and other equipment-related loans, working capital loans, finance leases, operating leases, and revolving charge accounts. Wholesale financing to Caterpillar dealers consists primarily of inventory and rental fleet financing. In addition, Cat Financial purchases short-term wholesale trade receivables from Caterpillar. The various financing plans offered by Cat Financial are designed to support sales of Caterpillar products and services and generate financing income for Cat Financial. A significant portion of our activity is conducted in North America, and we have additional offices and subsidiaries in Latin America, Asia/Pacific, Europe and Africa.\nFor over 40 years, Cat Financial has been providing financing for Caterpillar products, contributing to our knowledge of asset values, industry trends, financing structures and customer needs.\n\nOur company strategy, rolled out in 2017, reflects our legacy and our continuing commitment to meet the needs of our customers and the communities in which we live and work. United by our Values, Caterpillar employees around the world share a focused view of our business through the Operating & Execution Model, through which we are making strategic choices today to create long-term profitable growth. Since 2017, we focused on three strategic areas: Expanded Offerings, Operational Excellence and Services. In 2022, we updated our strategy to also include Sustainability as a strategic area. For nearly 100 years, our longstanding commitment to sustainability has inspired us to set and achieve meaningful environmental, social and governance goals. It’s also allowed us to develop innovative products, technologies and services to support our customers on their sustainability journey. The addition of sustainability as a strategic area, together with operational excellence, expanded offerings and services, highlights our work to help customers build a better, more sustainable world.\nCurrently, we have five operating segments, of which four are reportable segments and are described below.\n\nOur Energy & Transportation segment supports customers in oil and gas, power generation, marine, rail and industrial applications, including Caterpillar machines. The product and services portfolio includes reciprocating engines, generator sets, integrated systems and solutions, turbines and turbine-related services, electrified powertrain and zero-emission power sources and service solutions development, the remanufacturing of Caterpillar engines and components, remanufacturing services for other companies, diesel-electric locomotives and other rail-related products and services as well as product support of on-highway engines.\nRegulatory emissions standards require us to continue to make investments as new products and new regulations are introduced. Ongoing compliance with these regulations remains a focus. Emissions compliance in developing markets is complex due to rapidly evolving and unique requirements where enforcement processes can often vary. We employ robust product development, manufacturing processes and testing to help us comply with these regulations.\n\nOur dealers do not deal exclusively with our products; however, in most cases sales and servicing of our products are the dealers’ principal business. We sell some products, primarily turbines and locomotives, directly to end customers through sales forces employed by the company. At times, these employees are assisted by independent sales representatives.\nWhile the large majority of our worldwide dealers are independently owned and operated, we own and operate a dealership in Japan that covers approximately 80% of the Japanese market: Nippon Caterpillar Division. We are currently operating this Japanese dealer directly and we report its results in the All Other Segment. There are also three independent dealers in the Southern Region of Japan.\n\nWith 2024 sales and revenues of $64.809 billion, Caterpillar is the world’s leading manufacturer of construction and mining equipment, off-highway diesel and natural gas engines, industrial gas turbines and diesel-electric locomotives. The company principally operates through its three primary segments - Construction Industries, Resource Industries and Energy & Transportation - and also provides financing and related services through its Financial Products segment. Caterpillar is also a leading U.S. exporter. Through a global network of independent dealers and direct sales of certain products, Caterpillar builds long-term relationships with customers around the world.\n\nWe source our raw materials and manufactured components from suppliers both domestically and internationally. These purchases include unformed materials and rough and finished parts. Unformed materials include a variety of steel products, which are then cut or formed to shape and machined in our facilities. Rough parts include various sized steel and iron castings and forgings, which are machined to final specification levels inside our facilities. Finished parts are ready to assemble components, which are made either to Caterpillar specifications or to supplier developed specifications. We machine and assemble some of the components used in our machines, engines and power generation units and to support our after-market dealer parts sales. We also purchase various goods and services used in production, logistics, offices and product development processes. We maintain global strategic sourcing models to meet our global facilities’ production needs while building long-term supplier relationships and leveraging enterprise spend. We expect our suppliers to maintain, at all times, industry-leading levels of quality and the ability to timely deliver raw materials and component products for our machine and engine products. However, in some cases, increases in demand or supply chain disruptions have led to parts and components constraints across some products. We use a variety of agreements with suppliers to protect our intellectual property and processes to monitor and mitigate risks of the supply base causing a business disruption. The risks monitored include supplier financial viability, the ability to increase or decrease production levels, business continuity, quality and delivery.\n\nCaterpillar’s global workforce is united by Our Values In Action, Caterpillar’s Code of Conduct. Integrity, Excellence, Teamwork, Commitment and Sustainability provide the foundation for our values-based culture. Our human capital management principles are embedded in our values. Our values unite us, and reflect our diverse cultures, languages, geographies, and businesses, as one Caterpillar team.\nThe health and safety of our employees is an important focus at Caterpillar. Our safety driven strategy is focused on preventing serious injuries and learning from those closest to the work. In 2024, the Company achieved a recordable injury frequency rate of 0.43, compared to the 2023 recordable injury frequency rate of 0.40. We strive to continually reduce our recordable injuries utilizing programs that amplify our safety culture globally.\nTalent and Leadership Development\nIn addition to our focus on values and safety, we strive to continually attract, develop, engage, and retain a high-performing global team that executes our enterprise strategy of long-term profitable growth. We are committed to fostering an inclusive environment and a workforce that is representative of the diverse customers and communities we serve around the globe. Our Values In Action enable every individual to achieve their fullest potential and every team to help drive business success. These principles guide us in our daily operating rhythm. In addition, we make on-going investments in our team to develop employees and help individuals reach their full potential.\nOur leadership development programs focus on encouraging a variety of experiences to help employees broaden understanding and increase perspective. Our leadership curriculums include building resilient and high performing teams as core development principles. Additionally, skill-based programs to upskill our manufacturing employees are developed locally and tailored to the specific needs of the business. All employees have access to mentoring programs that connect participants with senior leaders and peers who can support their career goals and development.\nOur global internships, engineering co-ops, and career programs for engineering, marketing, and manufacturing provide development opportunities for early career employees. We also have a continual focus on strengthening technical, professional and leadership capabilities at every level using contemporary learning strategies to foster high performance. Strategic talent reviews and succession planning occur at a minimum, annually, across our businesses. Mentoring programs connect participants with senior leaders and peers who can support their career goals and development.\nOur 14 Employee Resource Groups (ERGs), which are sponsored and supported by leadership, help ensure different voices and perspectives contribute to our strategy for long-term profitable growth. They also engage our employees, helping contribute to development and retention. Our ERGs provide many contributions to help further our business strategy including partnerships with recruiters and earl",
  "item7_clean": "Energy & Transportation’s total sales were $28.854 billion in 2024, an increase of $853 million, or 3 percent, compared with $28.001 billion in 2023. The increase was primarily due to favorable price realization.\nOil and Gas – Sales were about flat. Decreased sales in reciprocating engines used in well servicing applications were offset by increased sales in reciprocating engines used in gas compression applications and increased sales for turbines and turbine-related services.\nPower Generation – Sales increased in large reciprocating engines, primarily data center applications. Turbines and turbine-related services increased as well.\nIndustrial – Sales decreased in EAME and North America.\nTransportation – Sales increased in marine and rail services, partially offset by lower sales of reciprocating engine aftermarket parts.\nEnergy & Transportation’s profit was $5.736 billion in 2024, an increase of $800 million, or 16 percent, compared with $4.936 billion in 2023. The increase was mainly due to favorable price realization.\nEnergy & Transportation’s profit as a percent of total sales was 19.9 percent in 2024, compared with 17.6 percent in 2023.\nFinancial Products Segment\nFinancial Products’ segment revenues were $4.053 billion in 2024, an increase of $268 million, or 7 percent, compared with $3.785 billion in 2023. The increase was primarily due to a favorable impact from higher average financing rates across all regions of $153 million and a favorable impact from higher average\nof $127 million driven by North America.\nFinancial Products’ segment profit was $932 million in 2024, an increase of $23 million, or 3 percent, compared with $909 million in 2023. The increase was mainly due to a favorable impact from higher average earning assets of $54 million, an insurance settlement of $33 million, and a favorable impact from equity securities of $32 million. These favorable impacts were partially offset by an increase in SG&A expenses of $54 million and an unfavorable impact from returned or repossessed equipment of $34 million.\nCorporate Items and Eliminations\nExpense for corporate items and eliminations was $1.711 billion in 2024, a decrease of $379 million from 2023, primarily driven by the absence of the divestiture of the company's Longwall business in 2023, partially offset by unfavorable impacts of segment reporting methodology differences.\n2023 COMPARED WITH 2022\nRESTRUCTURING COSTS\nIn 2025, we expect to incur about $150 million to $200 million of restructuring costs. We expect that prior restructuring actions will result in an incremental benefit to operating costs, primarily Costs of goods sold and SG&A expenses, of about $25 million in 2025 compared with 2024.\nAdditional information related to restructuring costs is included in Note 24 — \"Restructuring income/costs\" of Part II, Item 8 \"Financial Statements and Supplemental Data.\"\nGLOSSARY OF TERMS\nAdjusted Operating Profit Margin\n– Operating profit excluding restructuring income/costs as a percent of sales and revenues.\nAdjusted Profit Per Share\n– Profit per share excluding restructuring income/costs, a discrete tax benefit for a tax law change related to currency translation, pension and OPEB mark-to-market gains/losses and certain deferred tax valuation allowance adjustments in 2023.\n– Primarily includes activities such as: business strategy; product management and development; manufacturing and sourcing of wear and maintenance components primarily for Cat® products; parts distribution; integrated logistics solutions; distribution services responsible for dealer development and administration, including a wholly owned dealer in Japan; dealer portfolio management and ensuring the most efficient and effective distribution of machines, engines and parts; brand management and marketing strategy; and digital investments for new customer and dealer solutions that integrate data analytics with state-of-the-art digital technologies while transforming the buying experience.\nConsolidating Adjustments\n– Elimination of transactions between Machinery, Energy & Transportation and Financial Products.\nConstruction Industries\n– A segment primarily responsible for supporting customers using machinery in infrastructure and building construction applications. Responsibilities include business strategy, product design, product management and development, manufacturing, marketing and sales and product support. The product portfolio includes asphalt pavers; backhoe loaders; cold planers; compactors; compact track loaders; forestry machines; material handlers; motor graders; pipelayers; road reclaimers; skid steer loaders; telehandlers; track-type loaders; track-type tractors (small, medium); track excavators (mini, small, medium, large); wheel excavators; wheel loaders (compact, small, medium); and related parts and work tools.\nCorporate Items and Eliminations\n– Includes corporate-level expenses, timing differences (as some expenses are reported in segment profit on a cash basis), methodology differences between segment and consolidated external reporting, certain restructuring costs and inter-segment eliminations.\n– With respect to sales and revenues, currency represents the translation impact on sales resulting from changes in foreign currency exchange rates versus the U.S. dollar. With respect to operating profit, currency represents the net translation impact on sales and operating costs resulting from changes in foreign currency exchange rates versus the U.S. dollar. Currency only includes the impact on sales and operating profit for the Machinery, Energy & Transportation line of business; currency impacts on Financial Products revenues and operating profit are included in the Financial Products portions of the respective analyses. With respect to other income/expense, currency represents the effects of forward and option contracts entered into by the company to reduce the risk of fluctuations in exchange rates (hedging) and the net effect of changes in foreign currency exchange rates on our foreign currency assets and liabilities for consolidated results (translation).\n– Represents dealer machine and engine inventories, excluding aftermarket parts.\nEAME\n– A geographic region including Europe, Africa, the Middle East and Eurasia.\n– Assets consisting primarily of total finance receivables net of unearned income, plus equipment on operating leases net of accumulated depreciation at Cat Financial.\nEnergy & Transportation\n– A segment primarily responsible for supporting customers using reciprocating engines, turbines, diesel-electric locomotives and related services across industries serving Oil and Gas, Power Generation, Industrial and Transportation applications, including marine- and rail-related businesses as well as product support of on-highway engines. Responsibilities include business strategy, product design, product management, development and testing, manufacturing, marketing and sales and product support. The product and services portfolio includes turbines, centrifugal gas compressors, and turbine-related services; reciprocating engine-powered generator sets; integrated systems\nand solutions used in the electric power generation industry; reciprocating engines, drivetrain and integrated systems and solutions for the marine and oil and gas industries; reciprocating engines, drivetrain and integrated systems and solutions supplied to the industrial industry as well as Caterpillar machines; electrified powertrain and zero-emission power sources and service solutions development; and diesel-electric locomotives and components and other rail-related products and services, including remanufacturing and leasing. Responsibilities also include the remanufacturing of Caterpillar reciprocating engines and components and remanufacturing services for other companies.\n– The company defines Financial Products as our finance and insurance subsidiaries, primarily Caterpillar Financial Services Corporation (Cat Financial) and Caterpillar Insurance Holdings Inc. (Insurance Services). Financial Products’ information relates to the financing to customers and dealers for the purchase and lease of Caterpillar and other equipment.\nFinancial Products Segment\n– Provides financing alternatives to customers and dealers around the world for Caterpillar products and services, as well as financing for power generation facilities that, in most cases, incorporate Caterpillar products. Financing plans include operating and finance leases, revolving charge accounts, installment sale contracts, repair/rebuild financing, working capital loans and wholesale financing plans. The segment also provides insurance and risk management products and services that help customers and dealers manage their business risk. Insurance and risk management products offered include physical damage insurance, inventory protection plans, extended service coverage and maintenance plans for machines and engines, and dealer property and casualty insurance. The various forms of financing, insurance and risk management products offered to customers and dealers help support the purchase and lease of Caterpillar equipment. The segment also earns revenues from Machinery, Energy & Transportation, but the related costs are not allocated to operating segments. Financial Products’ segment profit is determined on a pretax basis and includes other income/expense items.\n– A geographic region including Central and South American countries and Mexico.\nMachinery, Energy & Transportation (ME&T)\n– The company defines ME&T as Caterpillar Inc. and its subsidiaries, excluding Financial Products. ME&T’s information relates to the design, manufacturing and marketing of its products.\nMachinery, Energy & Transportation Other Operating (Income) Expenses\n– Comprised primarily of gains/losses on disposal of long-lived assets, gains/losses on divestitures and legal settlements and accruals.\n– Manufacturing costs exclude the impacts of currency and represent the volume-adjusted change for variable costs and the absolute dollar change for period manufacturing costs. Variable manufacturing costs are defined as having a direct relationship with the volume of production. This includes material costs, direct labor and other costs that vary directly with production volume, such as freight, power to operate machines and supplies that are consumed in the manufacturing process. Period manufacturing costs support production but are defined as generally not having a direct relationship to short-term changes in volume. Examples include machinery and equipment repair, depreciation on manufacturing assets, facility support, procurement, factory scheduling, manufacturing planning and operations management.\nMark-to-market gains/losses\n– Represents the net gain or loss of actual results differing from the company’s assumptions and the effects of changing assumptions for our defined benefit pension and OPEB plans. These gains and losses are immediately recognized through earnings upon the annual remeasurement in the fourth quarter, or on an interim basis as triggering events warrant remeasurement.\nPension and Other Postemployment Benefits (OPEB)\n– The company’s defined-benefit pension and postretirement benefit plans.\n– The impact of net price changes excluding currency and new product introductions. Price realization includes geographic mix of sales, which is the impact of changes in the relative weighting of sales prices between geographic regions.\n– A segment primarily responsible for supporting customers using machinery in mining, heavy construction and quarry and aggregates. Responsibilities include business strategy, product design, product management and development, manufacturing, marketing and sales and product support. The product portfolio includes large track-type tractors; large mining trucks; hard rock vehicles; electric rope shovels; draglines; hydraulic shovels; rotary drills; large wheel loaders; off-highway trucks; articulated trucks; wheel tractor scrapers; wheel dozers; landfill compactors; soil compactors; wide-body trucks; select work tools; machinery components; electronics and control systems and related parts. In addition to equipment, Resource Industries also develops and sells technology products and services to provide customers fleet management, equipment management analytics, autonomous machine capabilities, safety services and mining performance solutions. Resource Industries also manages areas that provide services to other parts of the company, including strategic procurement, lean center of excellence, integrated manufacturing, research and development for hydraulic systems, automation, electronics and software for Caterpillar machines and engines.\nRestructuring income/costs\n– May include costs for employee separation, long-lived asset impairments, contract terminations and (gains)/losses on divestitures. These costs are included in Other operating (income) expenses except for defined-benefit plan curtailment losses and special termination benefits, which are included in Other income (expense). Restructuring costs also include other exit-related costs, which may consist of accelerated depreciation, inventory write-downs, building demolition, equipment relocation and project management costs and LIFO inventory decrement benefits from inventory liquidations at closed facilities, all of which are primarily included in Cost of goods sold.\n– With respect to sales and revenues, sales volume represents the impact of changes in the quantities sold for Machinery, Energy & Transportation as well as the incremental sales impact of new product introductions, including emissions-related product updates. With respect to operating profit, sales volume represents the impact of changes in the quantities sold for Machinery, Energy & Transportation combined with product mix as well as the net operating profit impact of new product introductions, including emissions-related product updates. Product mix represents the net operating profit impact of changes in the relative weighting of Machinery, Energy & Transportation sales with respect to total sales. The impact of sales volume on segment profit includes inter-segment sales.\n– Machinery, Energy & Transportation services revenues include, but are not limited to, aftermarket parts and other service-related revenues and exclude most Financial Products revenues, discontinued products and captive dealer services.\nLIQUIDITY AND CAPITAL RESOURCES\n\nIncludes revenues from Machinery, Energy & Transportation of $711 million and $690 million in 2024 and 2023, respectively.\nCONSOLIDATED OPERATING PROFIT\nThe chart above graphically illustrates reasons for the change in consolidated operating profit between 2023 (at left) and 2024 (at right). Caterpillar management utilizes these charts internally to visually communicate with the company’s board of directors and employees. The bar entitled Other includes\nconsolidating adjustments\nMachinery, Energy & Transportation other operating (income) expenses\nOperating profit was $13.072 billion in 2024, an increase of $106 million, or 1 percent, compared with $12.966 billion in 2023. The profit impact of lower sales volume of $1.298 billion, higher selling, general and administrative (SG&A) and research and development (R&D) expenses of $201 million, and higher restructuring costs of $165 million were more than offset by favorable price realization of $1.238 billion, the absence of the impact of the divestiture of the company's Longwall business in 2023 of $586 million and favorable manufacturing costs of $246 million. The increase in SG&A/R&D expenses was primarily driven by investments aligned with strategic initiatives. Favorable manufacturing costs largely reflected lower freight.\nFor the twelve months ended December 31, 2024, restructuring costs increased primarily due to the divestitures of certain non-U.S. entities.\nOperating profit margin was 20.2 perc",
  "item2_clean": null
}