{
  "source_file": "cb-20241231.htm",
  "form_type": "10-K",
  "item1_clean": "NPE), our wholesale and specialty division\nChubb Bermuda (5 percent of this segment’s 2024 NPE), our high excess retail division\nProducts and Distribution\nThe Commercial Insurance operations provide a broad range of P&C, financial lines, and A&H products targeted to U.S and Canadian-based middle market customers in a variety of industries, while the Small Commercial operations provide a broad range of P&C, workers' compensation, small commercial management and professional liability for small businesses based in the U.S.\nCommercial Insurance products and services offered include traditional P&C lines of business, including Package, which combines property and general liability, workers' compensation, automobile, umbrella; financial lines of business, including professional liability, management liability and cyber risk coverage; and other lines including environmental, A&H, and\ninternational coverages. Commercial Insurance distributes its insurance products through a North American network of independent retail agents and regional, multinational and digital brokers. Generally, our customers purchase insurance through a single retail agent or broker, do not employ a risk management department, and do not retain significant risk through self-insured retentions. The majority of our customers purchase a Package product or a portfolio of products, which is a collection of insurance offerings designed to cover various needs.\nSmall Commercial Insurance products and services offered include property and casualty lines of business, including a business owner policy which contains property and general liability; financial l\nines, including professional liability, management liability, and cyber risk coverage; and other lines including workers’ compensation, automobile liabilit\ny, and international coverages. Products are generally offered through a North American network of independent agents and retail brokers, as well as eTraditional, which are digital platforms where we electronically quote, bind, and issue for agents and brokers. An example of this is the Chubb Marketplace.\nMajor Accounts provides a broad array of commercial lines of products and services, including traditional and specialty P&C, risk management, and A&H products to large U.S. and Canadian-based institutional organizations and corporate companies. Major Accounts distributes its insurance products primarily through a limited number of retail brokers. In addition to using brokers, certain products are also distributed through general agents, independent agents, managing general agents (MGA), managing general underwriters, alliances, affinity groups, and direct marketing operations. Products and services offered include property, professional liability, cyber risk, excess casualty, workers’ compensation, general liability, automobile liability, commercial marine, surety, environmental, construction, medical risk, inland marine, and A&H coverages, as well as claims and risk management products and services.\nThe Major Accounts operations are organized into the following distinct business units, each offering specialized products and services targeted at specific markets:\nChubb Global Casualty offers a range of customized risk management primary casualty products designed to help large insureds, including national accounts, manage risk for workers’ compensation, general liability, and automobile liability coverages. Chubb Global Casualty also provides products which insure specific global operating risks of U.S.-based multinational companies and include deductible programs, captive programs, and paid or incurred loss retrospective plans. Within Chubb Global Casualty, Chubb Alternative Risk Solutions Group underwrites contractual indemnification policies which provide prospective coverage for loss events within the insured’s policy retention levels, and underwrites assumed loss portfolio transfer (LPT) contracts in which insured loss events have occurred prior to the inception of the contract.\nProperty provides products and services including primary, quota share and excess all-risk insurance, risk management programs and services, commercial, inland marine, and aerospace products.\nCasualty provides coverages including umbrella and excess liability, environmental risk, casualty programs for commercial construction related projects for companies and institutions, medical risk specialty liability products for the healthcare industry, and casualty insurance solutions for commercial real estate.\nSurety offers a wide variety of surety products and specializes in underwriting both commercial and contract bonds and has the capacity for bond issuance on an international basis.\nAccident & Health (A&H) products are targeted to large corporate and affinity groups, and include employee benefit plans, occupational accident, student accident, and worldwide travel accident and global medical programs. With respect to products that include supplemental medical and hospital indemnity coverages, we typically pay fixed amounts for claims and are therefore insulated from rising healthcare costs. A&H also provides specialty consumer lines products, including credit card enhancement programs (identity theft, rental car collision damage waiver, trip travel, and purchase protection benefits).\nFinancial Lines provides management liability and professional liability (D&O and E&O), transactional risk, and cyber risk products to public companies as well as to private and not-for-profit organizations.\nESIS Inc. (ESIS) is an in-house third-party claims administrator that performs claims management and risk control services for domestic and international organizations as well as for the North America Commercial P&C Insurance segment. ESIS services include comprehensive medical managed care; integrated disability services; pre-loss control and risk management; health, safety, and environmental consulting; salvage and subrogation; and healthcare recovery services. The net results for ESIS are included in North America Commercial P&C Insurance’s administrative expenses.\nWestchester is our wholesale and specialty division that serves the market for business risks that tend to be hard to place or not easily covered by traditional policies due to unique or complex exposures. Westchester provides specialty products for property,\ncasualty, environmental, professional liability, inland marine, product recall, small business, and pet insurance, with digital and program coverages in the U.S. Products are offered through the wholesale distribution channel. In 2024, Westchester expanded its operations through the acquisition of Healthy Paws Pet Insurance LLC, a managing general agent specializing in pet insurance, from Aon plc. Chubb has been the exclusive underwriter of Healthy Paws Pet Insurance LLC since 2013.\nChubb Bermuda is our high excess retail division which provides commercial insurance products on an excess basis including excess liability, D&O, professional liability, property, and political risk, the latter being written by Sovereign Risk Insurance Ltd., a wholly-owned managing agent. Chubb Bermuda focuses on Fortune 1000 companies and targets risks that are generally low in frequency and high in severity. Products are offered primarily through the Bermuda offices of major, internationally recognized insurance brokers.\nCompetitive Environment\nThe Commercial Insurance operations compete against numerous insurance companies ranging from large national carriers to small and mid-size insurers who provide specialty coverages and standard P&C products. Recent competitive developments include the growth of new digital-based distribution models. Westchester competes against a number of large, national carriers as well as regional competitors and other entities offering risk alternatives such as self-insured retentions and captive programs, and also employs digital-based distribution. Chubb Bermuda competes against international commercial carriers writing business on an excess of loss basis.\nMajor Accounts competes against a number of large, global carriers as well as regional competitors and other entities offering risk alternatives such as self-insured retentions and captive programs. The markets in which we compete are subject to significant cycles of fluctuating capacity and wide disparities in price adequacy. We pursue a specialist strategy and focus on market opportunities where we can compete effectively based on service levels and product design, while still achieving an adequate level of profitability. We also achieve a competitive advantage through Major Accounts’ innovative product offerings and our ability to provide multiple products to a single client due to our nationwide local presence. In addition, all our domestic commercial units are able to deliver global products and coverage to customers in concert with our Overseas General Insurance segment.\nNorth America Personal P&C Insurance (12 percent of 2024 Consolidated NPE)\nThe North America Personal P&C Insurance segment includes the business written by Chubb Personal Risk Services division, which includes high-net-worth personal lines business, with operations in the U.S. and Canada. This segment provides affluent and high-net-worth individuals and families with homeowners, high value automobile and collector cars, valuable articles (including fine arts), personal and excess liability/umbrella, travel insurance, cyber, and recreational marine insurance and services. Our homeowners business, including valuable articles, represented 69 percent of North America Personal P&C Insurance’s net premiums earned in 2024.\nProducts and Distribution\nChubb Personal Risk Services offers comprehensive personal insurance products and services to meet the evolving needs of high-net-worth families and individuals. Our seamless customer experience and superior coverage protect not only our clients’ most valuable possessions, but also their standard of living. Our target customers consist of high-net-worth consumers with insurance needs that typically extend beyond what mass market carriers can offer. These coverages are offered on both an admitted and excess and surplus lines basis through independent regional agents and brokers, as well as digital partnerships.\nCompetitive Environment\nChubb Personal Risk Services competes against insurance companies of varying sizes that sell personal lines products through various distribution channels, including retail agents as well as online distribution channels. We achieve a competitive advantage through our ability to address the specific needs of high-net-worth families and individuals, to provide superior service to our customers, and to develop and deploy digital production and processes.\nNorth America Agricultural Insurance (5 percent of 2024 Consolidated NPE)\nThe North America Agricultural Insurance segment comprises our U.S. and Canadian based businesses that provide a variety of coverages including crop insurance, primarily Multiple Peril Crop Insurance (MPCI) and crop-hail insurance through Rain and Hail Insurance Service, Inc. (Rain and Hail), as well as farm and ranch and specialty P&C commercial insurance products and services through our Chubb Agribusiness unit.\nProducts and Distribution\nRain and Hail provides comprehensive MPCI and crop-hail insurance coverages.\nMPCI is federally subsidized crop protection from numerous causes of loss, including drought, excessive moisture, freeze, disease and more. The MPCI program is offered in conjunction with the U.S. Department of Agriculture. MPCI products include revenue protection (defined as providing both commodity price and yield coverages), yield protection, margin protection, prevented planting coverage, and replant coverage. For additional information on our MPCI program, refer to “Crop Insurance” under Item 7.\nCrop-Hail coverage provides crop protection from damage caused by hail and/or fire, with options ",
  "item7_clean": "Net of valuation allowance for uncollectible reinsurance.\nThe estimate of the liabilities includes provisions for claims that have been reported but are unpaid at the balance sheet date (case reserves) and for obligations on claims that have been incurred but not reported (IBNR) at the balance sheet date. IBNR may also include provisions to account for the possibility that reported claims may settle for amounts that differ from the established case reserves. Loss reserves also include an estimate of expenses associated with processing and settling unpaid claims (loss expenses). Our loss reserves comprise approximately 77 percent casualty-related business, which typically encompasses long-tail risks, and\nother risks where a high degree of judgment is required.\nThe process of establishing loss reserves for property and casualty claims can be complex and is subject to considerable uncertainty as it requires the use of informed estimates and judgments based on circumstances underlying the insured losses\nknown at the date of accrual. For example, the reserves established for high excess casualty claims, asbestos and environmental claims, claims from major catastrophic events, or for our various product lines each require different assumptions and judgments to be made. The effects of inflation create additional uncertainty, while climate change could, over time, add new uncertainties to the loss reserving process.\nNecessary judgments are based on numerous factors and may be revised as additional experience and other data become available and are reviewed, as new or improved methods are developed, or as laws change. Hence, ultimate loss payments may differ from the estimate of the ultimate liabilities made at the balance sheet date. Changes to our previous estimates of prior period loss reserves impact the reported calendar year underwriting results adversely if our estimates increase or favorably if our estimates decrease. The potential for variation in loss reserve estimates is impacted by numerous factors. Reserve estimates for casualty lines are particularly uncertain given the lengthy reporting patterns and corresponding need for IBNR.\nCase reserves for those claims reported by insureds or ceding companies to us prior to the balance sheet date and where we have sufficient information are determined by our claims personnel as appropriate based on the circumstances of the claim(s), standard claim handling practices, and professional judgment. Furthermore, for our Brandywine run-off operations and our assumed reinsurance operation, Global Reinsurance, we may adjust the case reserves as notified by the ceding company if the judgment of our respective claims department differs from that of the cedant.\nWith respect to IBNR reserves and those claims that have been incurred but not reported prior to the balance sheet date, there is, by definition, limited actual information to form the case reserve estimate and reliance is placed upon historical loss experience and actuarial methods to estimate the ultimate loss obligations and the corresponding amount of IBNR. IBNR reserve estimates are generally calculated by first projecting the ultimate amount of losses for a product line and subtracting paid losses and case reserves for reported claims. The judgments involved in projecting the ultimate losses may pertain to the use and interpretation of various standard actuarial reserving methods that place reliance on the extrapolation of actual historical data, lo\nss development patterns, industry data, and other benchmarks, as appropriate. The estimate of the required IBNR reserve also requires judgment by actuaries and management to reflect the impact of more contemporary and subjective factors, both qualitative and quantitative. Among some of these factors that might be considered are changes in business mix or volume, changes in ceded reinsurance structures, changes in claims handling practices, reported and projected loss trends, inflation, the legal environment, and the terms and conditions of the contracts sold to our insured parties.\nDetermining management's best estimate\nOur recorded reserves represent management's best estimate of the provision for unpaid claims as of the balance sheet date, and establishing them involves a process that includes collaboration with various relevant parties in the company. For information on our reserving process, refer to Note 8 to the Consolidated Financial Statements.\nSensitivity to underlying assumptions\nWhile we believe that our reserve for unpaid losses and loss expenses at December 31, 2024, is adequate, new information or emerging trends that differ from our assumptions may lead to future development of losses and loss expenses that is significantly greater or less than the recorded reserve, which could have a material effect on future operating results. As noted previously, our best estimate of required loss reserves for most portfolios is judgmentally selected for each origin year after considering the results from a number of reserving methods and is not a purely mechanical process. Therefore, it is difficult to convey, in a simple and quantitative manner, the impact that a change to a single assumption will have on our best estimate. In the examples below, we attempt to give an indication of the potential impact by isolating a single change for a specific reserving method that would be pertinent in establishing the best estimate for the product line described. We consider each of the following sensitivity analyses to represent a reasonably likely deviation in the underlying assumption.\nNorth America Commercial P&C Insurance - Workers' Compensation\nGiven the long reporting and paid development patterns for workers' compensation business, the development factors used to project actual current losses to ultimate losses for our current exposure require considerable judgment that could be material to consolidated loss and loss expense reserves. Specifically, adjusting ground up ultimate losses by a one percentage point change in the tail factor (i.e., 1.04 changed to either 1.05 or 1.03) would cause a change of approximately $1.1 billion, either positive or negative, for the projected net loss and loss expense reserves. This represents an impact of about 10.9 percent relative to recorded net loss and loss expense reserves of approximately $10.2 billion.\nNorth America Commercial P&C Insurance – Liability\nAs is the case for Workers’ Compensation above, given the long reporting and paid development patterns, the development factors used to project actual current losses to ultimate losses for our current exposure require considerable judgment that could\nbe material to consolidated loss and loss expense reserves. Specifically, for our main U.S. Excess/Umbrella portfolios, a five percentage point change in the tail factor (e.g., 1.10 changed to either 1.15 or 1.05) would cause a change of approximately $0.8 billion, either positive or negative, for the projected net loss and loss expense reserves. This represents an impact of about 18 percent relative to recorded net loss and loss expense reserves of approximately $4.3 billion for these portfolios.\nThe reserve portfolio for our Chubb Bermuda operations contains exposure to high excess liability, D&O and other professional liability coverage (typically with attachment points in excess of $100 million and gross limits of up to $150 million). Due to the layer of exposure covered, the expected frequency for this book is very low. As a result of the low frequency/high severity nature of the book, a small difference in the actual vs. expected claim frequency, either positive or negative, could result in a material change to the projected ultimate loss if such change in claim frequency was related to a policy where significant limits were deployed.\nNorth America Personal P&C Insurance\nDue to the relatively short-tailed nature of many of the coverages involved (e.g., homeowners property damage), most of the incurred losses in Personal Lines are resolved within a few years of occurrence. As shown in our loss triangle disclosure, the vast majority (over 90 percent) of Personal Lines net ultimate losses and allocated loss adjustment expenses are typically paid within five years of the accident date and almost 80 percent within two years. Even though there are significant reserves associated with some liability exposures such as personal excess/umbrella liability, our incurred loss triangle also shows a roughly consistent pattern of only relatively minor movements in incurred estimates over time by accident year especially after twenty-four months of maturity. While the liability exposures are subject to additional uncertainties from more protracted resolution times, the main drivers of volatility in the Personal Lines business are relatively short-term in nature and relate to things like natural catastrophes, non-catastrophe weather events, man-made risks, and individual large loss volatility from other fortuitous claim events.\nNorth America Agricultural Insurance\nApproximately 58 percent of the reserves for this segment are from the crop related lines, which all have short payout patterns, with the majority of the liabilities expected to be resolved in the ensuing twelve months. Claim reserves for our Multiple Peril Crop Insurance (MPCI) product are set on a case-by-case basis and our aggregate exposure is subject to state level risk sharing formulae as well as third-party reinsurance. The majority of the development risk arises out of the accuracy of case reserve estimates and the time needed for final crop conditions to be assessed. We do not view our Agriculture reserves as substantially influenced by the general assumptions and risks underlying more typical P&C reserve estimates.\nOverseas General Insurance\nCertain long-tail lines, such as casualty and financial lines, are particularly susceptible to changes in loss trend and claim inflation. Heightened perceptions of tort and settlement awards around the world can increase the demand for these products as well as contributing to the uncertainty in the reserving estimates. Our reserving methods rely on loss development patterns estimated from historical data and while we attempt to adjust such factors for known changes in the current tort environment, it is possible that such factors may not entirely reflect all recent trends in tort environments. For example, when applying the reported loss development method, the lengthening of our selected loss development patterns by six months would increase reserve estimates on long-tail casualty and financial lines for accident years 2022 and prior by approximately $500 million. This represents an impact of 10.1 percent relative to recorded net loss and loss expense reserves of approximately $4.9 billion.\nAt December 31, 2024, net unpaid losses and loss expenses for the Global Reinsurance segment aggregated to $1.9 billion, consisting of $756 million of case reserves and $1,112 million of IBNR. In comparison, at December 31, 2023, net unpaid losses and loss expenses for the Global Reinsurance segment aggregated to $1.7 billion, consisting of $744 million of case reserves and $909 million of IBNR.\nFor our catastrophe business, we principally estimate unpaid losses and loss expenses on an event basis by considering various sources of information, including specific loss estimates reported by our cedants, ceding company and overall industry loss estimates reported by our brokers, and our internal data regarding reinsured exposures related to the geographical location of the event. Our internal data analysis enables us to establish catastrophe reserves for known events with more certainty at an earlier date than would be the case if we solely relied on reports from third parties to determine carried reserves.\nFor our casualty reinsurance business, we generally rely on ceding companies to report claims and then use that data as a key input to estimate unpaid losses and loss expenses. Due to the reliance on claims information reported by ceding companies, as well as other factors, the estimation of unpaid losses and loss expenses for assumed reinsurance includes certain risks and uncertainties that are unique relative to our direct insurance business. These include, but are not necessarily limited to, the following:\nThe reported claims information could be inaccurate;\nTypically, a lag exists between the reporting of a loss event to a ceding company and its reporting to us as a reinsurance claim. The use of a broker to transmit financial information from a ceding company to us increases the reporting lag. Because most of our reinsurance business is produced by brokers, ceding companies generally first submit claim and other financial information to brokers, who then report the proportionate share of such information to each reinsurer of a particular treaty. The reporting lag generally results in a longer period of time between the date a claim is incurred and the date a claim is reported compared with direct insurance operations. Therefore, the risk of delayed recognition of loss reserve development is higher for assumed reinsurance than for direct insurance lines; and\nThe historical claims data for a particular reinsurance contract can be limited relative to our insurance business in that there may be less historical information available. Further, for certain coverages or products, such as excess of loss contracts, there may be relatively few expected claims in a particular year so the actual number of claims may be susceptible to significant variability. In such cases, the actuary often relies on industry data from several recognized sources.\nWe mitigate the above risks in several ways. In addition to routine analytical reviews of ceding company reports to ensure reported claims information appears reasonable, we perform regular underwriting and claims audits of ceding companies to ensure reported claims information is accurate, complete, and timely. As appropriate, audit findings are used to adjust claims in the reserving process. We also use our knowledge of the historical development of losses from individual ceding companies to adjust the level of adequacy we believe exists in the reported ceded losses. If pricing a renewal contract, we compare data in the renewal submission to our financial data and investigate any discrepancies.\nOn occasion, there will be differences between our carried loss reserves and unearned premium reserves and the amount of loss reserves and unearned premium reserves reported by the ceding companies. This is due to the fact that we receive consistent and timely information from ceding companies only with respect to case reserves. For IBNR, we use historical experience and other statistical information, depending on the type of business, to estimate the ultimate loss. We estimate our unearned premium reserve by applying estimated earning patterns to net premiums written for each treaty based upon that treaty's coverage basis (i.e., risks attaching or losses occurring). At December 31, 2024, the case reserves, net of retrocessions, reported to us by our ceding companies approximated our recorded case reserves. Our policy is to post additional case reserves in addition to the amounts reported by our cedants when our evaluation of the ultimate value of a reported claim is different than the evaluation of that claim by our cedant.\nTypically, there is inherent uncertainty around the length of paid and reported development patterns, especially for certain casualty lines such as excess workers' compensation or general liability, which may take decades to fully develop. This uncertainty is accentuated by the need to supplement client development patterns with industry development patterns due to the sometimes low statistical credibility of the data. The underlying source and selection of the final development patterns",
  "item2_clean": null
}