{
  "source_file": "cb-20250930.htm",
  "form_type": "10-Q",
  "item1_clean": null,
  "item7_clean": null,
  "item2_clean": "Refer to Note 8 to the Consolidated Financial Statements for detail on prior period development.\nNet premiums written increased $163 million, or 2.9 percent, for the three months ended September 30, 2025, and includes a 3.4 percentage point unfavorable impact of two non-recurring items that benefited the prior year quarter. Middle market and small commercial grew 3.6 percent, including a 3.3 percentage point unfavorable impact of lower workers’ compensation annual payroll-related audit premium adjustments, which are made in the third quarter every year. Major accounts and specialty were up 2.5 percent, and includes a 3.4 percent unfavorable impact from a one-off structured transaction which occurred in 2024, with E&S up 6.6 percent.\nNet premiums written increased $483 million, or 3.1 percent, for the nine months ended September 30, 2025, which includes P&C lines growth of 2.9 percent and financial lines growth of 3.9 percent. Middle market and small commercial grew 6.5 percent, with P&C lines up 8.1 percent and financial lines up 0.7 percent. Major accounts retail and specialty grew 0.9 percent, with property and other short-tail lines down 3.1 percent, casualty up 4.9 percent, and financial lines up 7.7 percent.\nThe increase in premiums was across a number of lines, most notably in primary and excess casualty and in our small and mid-market commercial E&S, reflecting new business and rate increases. The increases were partially offset by rate decreases in our Large Risk and E&S brokerage property lines.\nNet premiums earned decreased $30 million, or 0.6 percent, for the three months ended September 30, 2025, and increased $355 million, or 2.4 percent, for the nine months ended September 30, 2025, both reflecting the growth in net premiums written described above. The growth for the three months ended September 30, 2025 was unfavorably impacted by the one-off structured transaction described above and lower workers' compensation annual payroll-related audit premium adjustments that were fully earned when written.\nThe combined ratio decreased for the three and nine months ended September 30, 2025, reflecting lower catastrophe losses. The CAY combined ratio excluding catastrophe losses was relatively flat for the three and nine months ended September 30, 2025, reflecting a change in the mix of business and earned rate exceeding loss trends in certain lines, partially offset by higher loss trends relative to earned rate growth in financial lines, and an increase in the expense ratio reflecting one-off benefits in the prior year. The ratio was also favorably impacted from lower year-over-year large structured transactions as described above.\nNorth America Personal P&C Insurance\nThe North America Personal P&C Insurance segment comprises operations that provide high net worth personal lines products, including homeowners and complementary products such as valuable articles, excess liability, automobile, and recreational marine insurance and services in the U.S. and Canada.\n\nITEM 2. Management's Discussion and Analysis of Financial Condition and Results of Operations\nThe following is a discussion of our results of operations, financial condition, and liquidity and capital resources as of and for the three and nine months ended September 30, 2025.\nAll comparisons in this discussion are to the corresponding prior year period unless otherwise indicated. All dollar amounts are rounded. However, percent changes and ratios are calculated using whole dollars. Accordingly, calculations using rounded dollars may differ.\nForward-Looking Statements\nConsolidated Operating Results\nSegment Operating Results\nNet Realized and Unrealized Gains (Losses)\nEffective Income Tax Rate\nNon-GAAP Reconciliation\nNet Investment Income\nCritical Accounting Estimates\nCatastrophe Management\nGlobal Property Catastrophe Reinsurance Program\nInformation Provided In Connection With Outstanding Debt of Subsidiaries\nForward-Looking Statements\nThe Private Securities Litigation Reform Act of 1995 provides a “safe harbor” for forward-looking statements. Any written or oral statements made by us or on our behalf may include forward-looking statements that reflect our current views with respect to future events and financial performance. These forward-looking statements are subject to certain risks, uncertainties, and other factors that could, should potential events occur, cause actual results to differ materially from such statements. These risks, uncertainties, and other factors, which are described in more detail elsewhere herein and in other documents we file with the SEC, include but are not limited to:\nactual amount of new and renewal business, premium rates, underwriting margins, market acceptance of our products, and risks associated with the introduction of new products and services and entering new markets; the competitive environment in which we operate, including trends in pricing or in policy terms and conditions, which may differ from our projections, and changes in market conditions that could render our business strategies ineffective or obsolete;\nlosses arising out of natural or man-made catastrophes; actual loss experience from insured or reinsured events and the timing of claim payments; the uncertainties of the loss-reserving and claims-settlement processes, including the difficulties associated with assessing environmental damage and asbestos-related latent injuries, the impact of aggregate-policy-coverage limits, the impact of bankruptcy protection sought by various asbestos producers and other related businesses, and the timing of loss payments;\nchanges in the distribution or placement of risks due to increased consolidation of insurance and reinsurance brokers; material differences between actual and expected assessments for guaranty funds and mandatory pooling arrangements; the ability to collect reinsurance recoverable, credit developments of reinsurers, and any delays with respect thereto and changes in the cost, quality, or availability of reinsurance;\nuncertainties relating to governmental, legislative and regulatory policies, developments, actions, investigations, and treaties; judicial decisions and rulings, new theories of liability, legal tactics, and settlement terms; the effects of data privacy or cyber laws or regulation; global political conditions and possible business disruption or economic contraction that may result from such events;\nthe impact of changes in tax laws, guidance and interpretations, such as the implementation of the Organization for Economic Cooperation and Development international tax framework, or the increasing number of challenges from tax authorities in the current global tax environment;\nseverity of pandemics and related risks, and their effects on our business operations and claims activity, and any adverse impact to our insureds, brokers, agents, and employees; actual claims may exceed our best estimate of ultimate insurance losses incurred which could change including as a result of, among other things, the impact of legislative or regulatory actions taken in response to a pandemic;\ndevelopments in global financial markets, including changes in interest rates, stock markets, and other financial markets; increased government involvement or intervention in the financial services industry; the cost and availability of financing, and foreign currency exchange rate fluctuations; changing rates of inflation; and other general economic and business conditions, including the depth and duration of potential recession;\nthe availability of borrowings and letters of credit under our credit facilities; the adequacy of collateral supporting funded high deductible programs; and the amount of dividends received from subsidiaries;\nchanges to our assessment as to whether it is more likely than not that we will be required to sell, or have the intent to sell, available-for-sale fixed maturity investments before their anticipated recovery;\nactions that rating agencies may take from time to time, such as financial strength or credit ratings downgrades or placing these ratings on credit watch negative or the equivalent;\nthe effects of public company bankruptcies and accounting restatements, as well as disclosures by and investigations of public companies relating to possible accounting irregularities, and other corporate governance issues;\nacquisitions made performing differently than expected, our failure to realize anticipated expense-related efficiencies or growth from acquisitions, and the impact of acquisitions on our pre-existing organization;\nrisks associated with being a Swiss corporation, including reduced flexibility with respect to certain aspects of capital management and the potential for additional regulatory burdens; share repurchase plans and share cancellations;\nloss of the services of any of our executive officers without suitable replacements being recruited in a reasonable time frame;\nthe ability of our technology resources, including information systems and security, to perform as anticipated such as with respect to preventing material information technology failures or third-party infiltrations or hacking resulting in consequences adverse to Chubb or its customers or partners; the ability of our company to increase use of data analytics and technology as part of our business strategy and adapt to new technologies; and\nmanagement’s response to these factors and actual events (including, but not limited to, those described above).\nThe words “believe,” “anticipate,” “estimate,” “project,” “should,” “plan,” “expect,” “intend,” “hope,” “feel,” “foresee,” “will likely result,” “will continue,\n” and variations thereof and similar expressions, identify forward-looking statements.\nYou are cautioned not to place undue reliance on these forward-looking statements, which speak only as of the dates such statements were made. We undertake no obligation to publicly update or review any forward-looking statemen"
}