{
  "source_file": "cboe-20250930.htm",
  "form_type": "10-Q",
  "item1_clean": null,
  "item7_clean": null,
  "item2_clean": "Cash and spot markets\nTotal revenues less cost of revenues\nCash and Spot Markets\nCash and spot markets revenues less cost of revenues increased for the three months ended September 30, 2025 compared to the same period in 2024 primarily due to increases in transaction and clearing fees less liquidity payments and routing and clearing costs (“net transaction and clearing fees”) in the Europe and Asia Pacific and Global FX segments. Net transaction and clearing fees increased primarily due to a 26% increase in Cboe European equities matched ADNV, a 9% increase in Global FX net capture, and a 20% increase in Cboe Clear Europe net settlement volumes.\nCash and spot markets revenues less cost of revenues increased for the nine months ended September 30, 2025 compared to the same period in 2024 primarily due to increases in net transaction and clearing fees in the Europe and Asia Pacific and Global FX segments. Net transaction and clearing fees increased primarily due to a 36% increase in Cboe European equities matched ADNV, a 12% increase in Global FX ADNV, and a 22% increase in Cboe Clear Europe net settlement volumes, partially offset by a decrease in net transaction and clearing fees in the North American equities segment primarily due to a 40% decrease in U.S. Equities net capture.\nData Vantage revenues less cost of revenues increased for the three and nine months ended September 30, 2025 compared to the same periods in 2024 primarily due to increases in access and capacity fees and proprietary market data fees. Access and capacity fees increased primarily due to increases in logical port fees and physical port fees in the Options, North American Equities, and Europe and Asia Pacific segments, driven by increased customer demand. Proprietary market data fees increased primarily due to increases in proprietary market data fees in the Options, Europe and Asia Pacific, and North American Equities segments.\nDerivatives markets revenues less cost of revenues increased for the three months ended September 30, 2025 compared to the same periods in 2024 primarily due to an increase in net transaction and clearing fees driven by a 31% increase in multi-listed options ADV and a 15% increase in index options ADV, partially offset by a decrease in net transaction and clearing fees in the Futures segment primarily due to a 27% decrease in ADV.\nDerivatives markets revenues less cost of revenues increased for the nine months ended September 30, 2025 compared to the same periods in 2024 primarily due to an increase in net transaction and clearing fees driven by a 26% increase in multi-listed options ADV and a 16% increase in index options ADV, partially offset by a decrease in net transaction and clearing fees in the Futures segment primarily due to an 11% decrease in ADV.\nTotal operating expenses for the three months ended September 30, 2025 compared to the same period in 2024 increased $10.6 million, or 5%, primarily due to an increase in compensation and benefits. Total operating expenses for the nine months ended September 30, 2025 compared to the same period in 2024 decreased $53.3 million, or 7%, primarily due to the impairment of assets charge recorded to the Digital segment in the second quarter of 2024, coupled with a decrease in depreciation and amortization and other expenses, partially offset by an increase in compensation and benefits and the impairment of assets recorded related to the wind down of Cboe's Japanese equities business.\nThe following summarizes changes in operating expenses for the three and nine months ended September 30, 2025 compared to the three and nine months ended September 30, 2024 (in millions, except percentages):\nCompensation and benefits\nDepreciation and amortization\nTechnology support services\nProfessional fees and outside services\nTravel and promotional expenses\nAcquisition-related costs\nImpairment of assets\nTotal operating expenses\nCompensation and Benefits\nCompensation and benefits increased for the three months ended September 30, 2025 compared to the same period in 2024 primarily due to a $5.6 million increase in accrued bonuses as a result of strong Company performance, a $2.7 million increase in salaries and wages primarily due to merit increases, and a $1.2 million increase in equity compensation related to executive transitions, partially offset by a $1.6 million increase in capitalized wages as a result of an increase in internally developed software.\nCompensation and benefits increased for the nine months ended September 30, 2025 compared to the same period in 2024 primarily due to a $10.5 million increase in accrued bonuses as a result of strong Company performance, an $8.0 million increase in salaries and wages primarily due to merit increases, a $3.8 million increase in equity compensation related to executive transitions and a $2.6 million increase in benefits, partially offset by a $6.6 million increase in capitalized wages as a result of an increase in internally developed software.\nDepreciation and Amortization\nDepreciation and amortization decreased for the three and nine months ended September 30, 2025 compared to the same periods in 2024 primarily due to declines in amortization under the discounted cash flow method for the intangibles acquired in the Merger and monthly amortization for developed and existing technology ending or written down to zero since the third quarter of 2024.\nTechnology Support Services\nTechnology support services increased for the three and nine months ended September 30, 2025 compared to the same periods in 2024 due to increases in cloud services, data center hosting, market data, and hardware maintenance, partially offset by a decrease in purchased hardware.\nProfessional Fees and Outside Services\nProfessional fees and outside services decreased for the three months ended September 30, 2025 compared to the same period in 2024 primarily due to decreases in regulatory costs related to CAT expenses and consulting fees, partially offset by increases in legal fees and accounting fees.\nProfessional fees and outside services decreased for the nine months ended September 30, 2025 compared to the same period in 2024 primarily due to decreases in consulting fees and contract services, partially offset by increases in regulatory costs related to CAT expenses and accounting fees.\nTravel and Promotional Expenses\nTravel and promotional expenses decreased for the three and nine months ended September 30, 2025 compared to the same periods in 2024 primarily due to decreases in marketing and advertising expenses related to the timing of the spend in the prior year versus the current year.\nFacilities costs increased for the three and nine months ended September 30, 2025 compared to the same periods in 2024 primarily due to an increase in repairs and maintenance, partially offset by decreases in cleaning costs and services costs.\nAcquisition-Related Costs\nAcquisition-related costs increased for the three months ended September 30, 2025 compared to the same period in 2024 primarily due to increases in professional fees.\nAcquisition-related costs decreased for the nine months ended September 30, 2025 compared to the same period in 2024 primarily due to decreases in retention-related compensation costs associated with prior acquisitions and professional fees.\nImpairment of Assets\nImpairment of assets increased for the three months ended September 30, 2025 compared to the same period in 2024 primarily due to the impairment of Cboe Japan's assets of $4.5 million during the three months ended September 30, 2025 as a result of the wind down of the Company's Japanese equities business.\nImpairment of assets decreased for the nine months ended September 30, 2025, compared to the same period in 2024 primarily due to the impairment of assets of $81.0 million recognized in the former Digital segment during the nine months ended September 2024, partially offset by the impairment of Cboe Japan's assets of $21.6 million during the nine months ended September 30, 2025 as a result of the wind down of the Company's Japanese equities business.\nOther expenses decreased for the three months ended September 30, 2025 compared to the same period in 2024 primarily due to a decrease in bad debt expense.\nOther expenses decreased for the nine months ended September 30, 2025 compared to the same period in 2024 primarily due to a decrease in bad debt expense and a change in contingent consideration related to prior acquisitions recorded in 2024, which did not recur in 2025.\nAs a result of the items above, operating income for the three months ended September 30, 2025 was $370.3 million, compared to operating income of $307.4 million for the three months ended September 30, 2024, an increase of $62.9 million.\nAs a result of the items above, operating income for the nine months ended September 30, 2025 was $1,063.3 million, compared to operating income of $799.9 million for the nine months ended September 30, 2024, an increase of $263.4 million.\nInterest expense increased for the three and nine months ended September 30, 2025 compared to the same periods in 2024 primarily due to an increase in Cboe Clear Europe commitment fees.\nInterest income increased for the three months ended September 30, 2025 compared to the same period in 2024 primarily due to income from U.S. treasury bills as a result of additional investments of cash and cash equivalents.\nInterest income increased for the nine months ended September 30, 2025 compared to the same period in 2024 primarily due to income from U.S. treasury bills as a result of additional investments of cash and cash equivalents coupled with increases in interest earned on higher cash and cash equivalents balances.\nEarnings on Investments, Net\nEarnings on investments, net increased for the three and nine months ended September 30, 2025 compared to the same periods in 2024 primarily due to a $45.6 million gain on the Company’s investment in 7Ridge Fund (whic"
}