{
  "source_file": "cbre-20241231.htm",
  "form_type": "10-K",
  "item1_clean": "CBRE is the world’s largest commercial real estate services and investments firm. Our competitive advantage comes from our considerable scale and ability to offer integrated solutions to real estate investors and occupiers in more than 100 countries. We are global market leaders in most of our lines of business and drive significant growth from bundling our services, while helping clients optimize real estate costs, value, investment returns and workplace experiences. These capabilities, combined with our extensive knowledge platform (research, data, strategy, etc.), allow us to generate superior outcomes for our clients, which include nearly 90% of Fortune 100 companies in 2024, and many of the world’s largest institutional real estate investors.\nOur growth opportunity is enhanced by the large and expanding total addressable market for our services. We are focused on cementing our leadership position in each of our businesses with a strategy that achieves diversification and growth across four dimensions: geographies, clients, property types and services. We are committed to deploying our resources and capital across these four dimensions in parts of our business that benefit from secular tailwinds and/or provide cyclical resilience. Examples of how we have expanded our participation in secularly favored and resilient businesses and enlarged our total addressable market include our investments in the global project management firm, Turner & Townsend, in which we hold a majority ownership interest; the flexible office platform, Industrious, in which we acquired full ownership in January 2025; J&J Worldwide Services, a provider of facilities management and related services to the U.S. federal government; and Direct Line Global, a provider of technical facilities management services to data centers. In addition, we have increased our focus on geographies, such as Japan, and asset classes, such as industrial, multi-family and data centers, that are positioned for growth. As a result, we have built a larger and more resilient services offering. Our platform – the resources and infrastructure that support our professionals and underpin our growth, such as research, marketing, data and technology – combined with our balance sheet strength, provide us access to top talent and compelling growth opportunities.\nAs of December 31, 2024, we served clients through three business segments: Advisory Services, Global Workplace Solutions and Real Estate Investments, and a fourth segment, called Corporate and other, which encompasses our platform and non-core investments.\nOn January 1, 2025, we combined our project management business with our Turner & Townsend subsidiary and increased our ownership in the combined entity to 70%. We will publicly report financial results for a fourth business segment, Project Management, beginning in the first quarter of 2025. We also will establish a new business segment, Building Operations & Experience, in 2025, comprised of enterprise and local facilities management, property management and flexible workplace solutions, including Industrious. Our four business segments beginning in 2025 will be (1) Advisory Services; (2) Building Operations & Experience; (3) Project Management; and (4) Real Estate Investments.\nAdvisory Services provides a comprehensive range of services globally, including property leasing; capital markets, which includes property sales and mortgage origination; mortgage servicing; valuation and property management. With a global network of experts that have a deep understanding of their local markets, we offer comprehensive insights and solutions across a wide range of real estate assets, including offices, retail outlets, and critical facilities (including data centers, laboratories, government facilities, manufacturing environments, warehouses and other mission-critical facilities). Our client base is comprised of large occupiers and investors that contract for our services across multi-market portfolios as well as local market clients that we serve on a one-off basis.\nWe are leaders in each of our five primary business lines globally (property leasing, capital markets, mortgage servicing, valuation and property management) and in most key local markets across the world. We leverage our platform to attract and retain top talent and provide differentiated insights to our clients through our investments in research, data, technology tools and property marketing. We also focus on end-to-end client solutions through the bundling of our various services. For example, as our investor clients seek to optimize the value and performance of their assets across the real estate lifecycle, we often bring together expertise from property sales, mortgage originations, leasing, valuations and property management. While many of our business lines in this segment are sensitive to changes in macro-economic conditions, their\ncyclicality is lessened by the value investors and occupiers place on our insights and consulting services through cycles as they adjust their real estate portfolios and strategies to changing market circumstances. In contrast, our loan servicing, property management and valuations businesses, while a smaller part of our revenue mix, have proven to be more resilient across economic cycles. For example, in the last six years, we have organically grown our loan servicing revenue at a low-double digit compound annual growth rate (CAGR) and revenue in property management at a mid-single digit CAGR, despite challenging macroeconomic conditions. We remain committed to growing these resilient business lines further, particularly where they benefit from sustained demand tailwinds.\nGlobal Workplace Solutions\nGlobal Workplace Solutions (GWS) is the leading global provider of integrated facilities management and project management solutions for major occupiers of commercial real estate. This segment benefits from multiple tailwinds, most notably multi-national corporations’ increased desire to outsource and consolidate real estate services to optimize costs, operational efficiencies and workplace experiences. Our GWS Enterprise business typically serves large global corporations including many of the Fortune 500, through multi-year contracts, while our GWS Local business meets the needs of smaller occupiers with more localized portfolios.\nWith facilities management experts in more than 100 countries, we perform mission-critical technical services and maintenance in more locations worldwide than any other provider. This allows us to deliver tailored property solutions at both a local and global level, while improving quality and experience, reducing cost and mitigating risk. We provide these services across virtually all asset types, including offices, retail outlets, and critical facilities (including data centers, laboratories, government facilities, manufacturing environments, warehouses and other mission-critical facilities). We achieve growth by investing in (a) superior talent and processes that deliver service excellence; (b) capabilities to perform a wide range of in-house technical services that increase operational efficiency and reliability while lowering costs and carbon emissions; (c) proprietary technology and data solutions that allow us to amass data at scale and deliver actionable insights to clients for managing complex challenges; and (d) ongoing acquisition activity, including the acquisition of larger companies such as Norland Managed Services, which marked our entry into the local facilities management space; the Johnson Controls Global Workplace Solutions business, which substantially scaled our core enterprise facilities management business; J&J Worldwide Services, which markedly increased our facilities-related services to the U.S. federal government; and Direct Line Global, which enhanced our capabilities and participation in the data center management space, as well as numerous in-fill transactions.\nOur project management business delivers program management, project management and cost consultancy services across commercial real estate, infrastructure and natural resources sectors. In early 2025, we completed our plan to merge our wholly owned CBRE Project Management services business into Turner & Townsend, our majority-owned program and project management subsidiary. Our combined capabilities make us a leading global, full-service building consulting, program, project and cost management provider, which completed nearly 50,000 projects/programs in 2024. We manage a wide range of programs and projects from small repairs/refurbishments in corporate facilities to billion-dollar-plus advanced manufacturing plants to sophisticated infrastructure projects such as data centers, airports and power stations. We also increasingly serve clients for net-zero program management and energy and sustainability solutions. Our scale, highly diverse capabilities and technology investments allow us to solve our clients’ biggest challenges in managing capital projects around the world.\nReal Estate Investments\nReal Estate Investments (REI) is a major real assets developer, investor and operator. This segment is comprised of two businesses: investment management and real estate development.\nWith $146 billion (as of December 31, 2024) in assets under management, CBRE Investment Management (IM) is one of the leading investment platforms for global real assets. IM invests capital on behalf of pension funds, insurance companies, sovereign wealth funds, and other institutional investors in real estate, infrastructure, master limited partnerships and other assets. Its growth opportunity is enhanced by investors’ growing appetite for investment alternatives, including real estate and infrastructure, that diversify their holdings and offer potentially higher returns compared to traditional investment strategies. Much like other parts of our company, IM is diversified across many dimensions – investment strategies, sectors, geographies, risk profiles and execution formats. We hold a co-investment in many of our investment funds and programs, which span private direct real estate, private indirect real estate through third-party operators, listed real assets and private infrastructure.\nOur real estate development business – Trammell Crow Company (TCC) provides leading-edge development services to real estate investors, owners and occupiers. TCC has been the largest commercial developer in the U.S. for more than a\ndecade and has a track record of developing best-in-class buildings across multiple property sectors in top-tier markets in the U.S. and Europe. Our portfolio represents a diversified mix of projects that are either 100% owned or in which we participate financially via co-investment with strategic capital partners or through fee-based developments, such as built-to-suit projects. Our in-process portfolio and pipeline totaled over $32 billion (as of December 31, 2024) and spanned all major asset classes. We have a track record of generating high investment returns for our capital partners and the company and our conservative, risk-mitigated capital structures enable us to time asset dispositions when market circumstances are most favorable.\nWe drive growth in this segment by: (a) providing IM and TCC real-time access to the broader CBRE global brand, on-the-ground market intelligence, supplemented by their own investments in research/data, which enables them to identify early and invest in secularly favored markets/products with tailwinds; (b) leveraging CBRE’s balance sheet to create opportunities for co-investment alongside our investor clients in our fund vehicles and developments; and (c) driving strong and ongoing collaboration between IM and TCC.\nCorporate and Other Segment\nThe Corporate and other segment houses most costs associated with our platform – the resources and infrastructure that support our professionals and support ou",
  "item7_clean": "Item 7. Management’s Discussion and Analysis of Financial Condition and Results of Operations.\nThe following discussion provides an analysis of the company’s financial condition and results of operations from management’s perspective and should be read in conjunction with the consolidated financial statements and related notes included in this Annual Report. Discussion regarding our financial condition and results of operations for the year ended December 31, 2023 and comparisons between the years ended December 31, 2023 and 2022 are included in Part II, Item 7. “Management’s Discussion and Analysis of Financial Condition and Results of Operations” in the company’s 2023\nfiled with the SEC on February 20, 2024.\nCBRE is the world’s largest commercial real estate services and investment firm (based on 2024 revenue). In 2024, we served clients through three business segments – Advisory Services, Global Workplace Solutions (GWS) and Real Estate Investments (REI) – which are described in “Item 1. Business” in this Annual Report. We generate revenue from both resilient sources (large multi-year portfolio and per-project contracts) and non-recurring sources, including commissions generated by transactions. Our revenue mix has become more weighted towards resilient revenue sources, particularly occupier outsourcing, and our dependence on cyclical property sales and lease transaction revenue has declined. Non-recurring transactional revenue and earnings within our Advisory Services segment (notably property sales and leasing) have historically been highest in the year’s fourth quarter due to a focus on completing transactions prior to year-end, but such seasonality has decreased as transactions have comprised a smaller proportion of our total revenue.\nBusiness Environment\nThe operating environment for commercial real estate improved in 2024, particularly in the second half of the year. This was most prominently evident in real estate leasing markets. A healthy economic outlook and improved return-to-office momentum made companies increasingly confident to move forward with office leasing plans. Demand was particularly strong for the highest-quality space and expanded from primary to secondary markets as the year progressed. Improved capital availability and lower borrowing costs – along with the perception that interest rates would fall further – buoyed investor sentiment and led to increased real estate sales and financing activity in the second half of 2024. These factors also improved the operating backdrop for development and investment asset sales late in the year. Meanwhile, outsourcing services continued to gain favor with major corporations and other large occupiers of space, boosting demand for facilities and project management services.\nResults of Operations\nThe following presents highlights of CBRE’s performance for the year ended December 31, 2024 (percentages represent comparison to 2023 results):\n$35.8B\n$20.9B\n$968M\nGAAP Earnings Per Share (EPS)\n$2.7B\nAn improved operating environment supported strong growth for CBRE in 2024. Overall, net revenue increased 14.2%. This included 14.1% net revenue growth in our resilient businesses\n(including facilities management, project management, property management, loan servicing, recurring investment management fees and valuations), and 14.3% net revenue growth in our transactional businesses\n(property sales, leasing, mortgage origination, carried interest and incentive fees in our investment management business, and development fees).\n________________________________________________________________________________________________________________________________________\nSee Non-GAAP Financial Measures section in Item 7 of this Annual Report.\nWe allocated significant capital last year on projects designed to enhance our capabilities, augment our growth profile and expand our total addressable market. Our capital deployment totaled approximately $1.8 billion, and included $1.1 billion in M&A and other strategic investments, including the acquisition of J&J Worldwide Services, a provider of outsourcing\nservices to the U.S. federal government and Direct Line Global, which provides technical data center management. In addition, we deployed $644 million in share buybacks (repurchasing 5,110,624 shares).\nThe following table sets forth items derived from our consolidated statements of operations for the years ended December 31, 2024 and 2023 (dollars in millions):\nYear Ended December 31,\nFacilities management\nCommercial mortgage origination\nInvestment management\nDevelopment services\nCorporate, other and eliminations\nPass-through costs also recognized as revenue\nOperating, administrative and other\nDepreciation and amortization\nTotal costs and expenses\nGain on disposition of real estate\nEquity (loss) income from unconsolidated subsidiaries\nInterest expense, net of interest income\nIncome before provision for income taxes\nProvision for income taxes\nLess: Net income attributable to non-controlling interests\nNet income attributable to CBRE Group, Inc.\nYear Ended December 31, 2024 Compared to Year Ended December 31, 2023\nWe reported consolidated net income of $968 million for the year ended December 31, 2024 on revenue of $35.8 billion as compared to consolidated net income of $986 million on revenue of $31.9 billion for the year ended December 31, 2023.\nThe revenue increase reflected growth in leasing activity, particularly for office and retail space, commercial mortgage origination, loan servicing, property management, and continued strong growth in the GWS segment, which benefited from strong new business activity, contract expansions, and acquisitions. We began to see an increase in property sales in our Advisory Services segment in the second half of 2024. Revenue increased in the REI segment, driven by higher incentive and development fees.\nForeign currency translation had minimal net impact on revenue during the year ended December 31, 2024. Foreign currency translation strength in the British pound sterling was offset by weakness in the Japanese yen.\nCost of revenue increased 12.2%, during the year ended December 31, 2024 as compared to the same period in 2023 due to revenue growth, consisting of higher pass-through costs, higher compensation, and higher indirect reimbursed costs. Foreign currency translation had a 0.1% positive impact on total cost of revenue. Cost of revenue increased slightly to 80.6% of total revenue from 80.4% driven by higher costs to support growth in revenues.\nOperating, administrative and other expenses increased 9.8% as compared to the same period last year. The increase was driven by an increase in restructuring and indirect tax expenses this year compared to 2023 as the cost savings initiatives in the GWS segment were largely completed. Foreign currency translation had a 0.1% positive impact on total operating expenses during the year ended December 31, 2024. Operating expenses as a percentage of revenue decreased to 14.0% from 14.3%, as operating expenses grew slower than revenue.\nDepreciation and amortization expense increased by 8.4% during the year ended December 31, 2024, as compared to the same period in 2023, reflecting higher depreciation and amortization expense related to assets acquired from recent acquisitions such as J&J Worldwide Services.\nGain on disposition of real estate increased by $115 million in 2024, driven by the monetization of real estate development assets in the REI segment.\nWe incurred an equity loss of $19 million in 2024 compared to equity income of $248 million in the same period in 2023. This was mainly due to an unusually large development asset disposition in the first-quarter 2023 that did not recur in 2024. In addition, we recorded higher unrealized net losses related to our non-core strategic equity investments, including Altus Power, Inc. (Altus), during the year ended December 31, 2024. These losses were partially offset by equity income recognized in relation to investments in TCC real estate development projects.\nOther income decreased to $39 million from $61 million, driven primarily by a one-time gain of approximately $34 million recognized in 2023 associated with the remeasurement of an investment in an unconsolidated subsidiary to fair value as of the date the remaining controlling interest was acquired. This decrease was partially offset by positive fair value adjustments on certain financial instruments this year as compared to the same period last year.\nInterest expense, net of interest income, increased 44.3% in 2024 as compared to the same period 2023. This increase was primarily due to the issuance of new debt during the first quarter of 2024, the impact of higher interest rates, and increased borrowings on the revolving credit and commercial paper facilities.\nOur provision for income taxes on a consolidated basis was $182 million for the year ended December 31, 2024 as compared to $250 million in 2023. Our effective tax rate decreased to 15.0% in 2024 from 19.5% in 2023. The decrease is primarily related to the reversal of unrecognized tax positions.\nThe Organization for Economic Co-operation & Development (OECD) Pillar Two Model Rules established a minimum global effective tax rate of 15% on country-by-country profits of large multinational companies. European Union member states along with many other countries adopted or expect to adopt the OECD Pillar Two Model effective January 1, 2024 or thereafter. The OECD and other countries continue to publish guidelines and legislation which include transition and safe harbor rules. We continue to monitor new legislative changes and assess the global impact of the Pillar Two Model Rules. The impact of Pillar Two top-up taxes was insignificant for 2024.\nAs of December 31, 2024, our operations were organized around, and we publicly report financial results for, three global business segments: (1) Advisory Services; (2) Global Workplace Solutions; and (3) Real Estate Investments. We also have a Corporate and Other segment. For additional information on our segments, see Note 19 – Segments of the Notes to Consolidated Financial Statements set forth in Item 8 of this Annual Report.\nIn early January 2025, we combined our project management business with our Turner & Townsend majority-owned subsidiary and will publicly report financial results for a fourth business segment, Project Management, beginning in the first quarter of 2025. In addition, we acquired full ownership of Industrious, a provider of premium flexible workplace solutions in January 2025, and will establish a new business segment, Building Operations & Experience, in 2025, comprised of enterprise and local facilities management, property management and flexible workplace solutions. Our four business segments beginning in 2025 will be (1) Advisory Services; (2) Building Operations & Experience; (3) Project Management; and (4) Real Estate Investments.\nThe following table summarizes our results of operations for our Advisory Services operating segment for the years ended December 31, 2024 and 2023 (dollars in millions):\nYear Ended December 31,\nCommercial mortgage origination\nTotal segment net revenue\nPass-through costs also recognized as revenue\nTotal segment revenue\nOperating, administrative and other\nDepreciation and amortization\nTotal costs and expenses\nEquity income from unconsolidated subsidiaries\nAdd-back: Depreciation and amortization\nCosts associated with efficiency and cost-reduction initiatives\nOne-time gain associated with remeasuring an investment in an unconsolidated subsidiary to fair value as of the date the remaining controlling interest was acquired\nSegment operating profit and segment operating profit on revenue margin\nSegment operating profit on net revenue margin\nYear Ended December 31, 2024 Compared to Year Ended December 31, 2023\nRevenue increased 13.0% in 2024 as compared to the same period in 2023. Global leasing revenue rose 12.2% driven by the Americas which grew 13.3%, including 15.8% in the United States, APAC which grew 10.6% and the United Kingdom, which grew 10.5%. Property sales revenue was up 10.1%, reflecting an increase in property sales in the second half of 2024. The company’s loan origination business benefited from higher loan fees, partially offset by a decrease in interest earnings on escrow balances. Property management also grew solidly, up 15.4%, fueled by growth across regions and in the U.S. and continued growth from the Brookfield portfolio. Foreign currency translation had a 0.2% negative impact on total revenue in 2024, primarily driven by weakness in the Japanese yen and Brazilian real, partially offset by strength in the British pound sterling.\nCost of revenue increased 13.8%, primarily reflecting business growth, higher reimbursable expenses in property management, higher professional compensation and higher commission expense. Foreign currency translation had a 0.1% positive impact on cost of revenue. Cost of revenue slightly increased to 61.0% of total revenue from 60.6% for the same period in 2023 primarily due to higher commissions, driven by revenue growth.\nOperating, administrative and other expenses slightly increased by 1.1%, in 2024 as compared to the same period in 2023, driven by higher variable employee compensation costs. The increase was partially offset by lower restructuring expenses as the Advisory Services segment recorded significant restructuring expenses in the first half of 2023, as the segment went through cost reduction initiatives that did not recur this year. Foreign currency translation had a 0.2% positive impact on total operating expenses.\nIn connection with the origination and sale of mortgage loans with servicing rights retained, we record servicing assets or liabilities based on the fair value of mortgage servicing rights (MSRs) on the date the loans are sold. Upon origination of a mortgage loan held for sale, the fair value of the mortgage servicing rights to be retained is included in the forecasted proceeds from the anticipated loan sale and results in a net gain (which is reflected in revenue). Our MSRs are initially recorded at fair value. Subsequent to the initial recording, MSRs are amortized in proportion to and over the period that the servicing income is expected to be received based on projections and timing of estimated future net cash flows and assessed for impairment based on the fair value each reporting period.\nFor the year ended December 31, 2024, MSRs contributed $123 million to operating income, offset by $138 million of amortization of related intangible assets. For the year ended December 31, 2023, MSRs contributed $84 million to operating income, offset by $144 million of amortization of related intangible assets. The increase was associated with higher origination activity given an increase in financing activities in the second half of 2024.\nOther income was $5 million in 2024 versus $46 million in 2023. In 2023, we recognized a one-time gain of approximately $34 million associated with remeasuring an investment in an unconsolidated subsidiary to fair value as of the date the remaining controlling interest was acquired.\nDepreciation and amortization expense decreased 5.9% primarily due to lower amortization of mortgage servicing rights as described above and due to accelerated depreciation expense recorded in the first half of 2023, as part of cost savings initiatives that did not recur this year.\nGlobal Workplace Solutions\nThe following table summarizes our results of operations for our Global Workplace Solutions (GWS) operating segment for the years ended December 31, 2024 and 2023 (dollars in millions):\nYear Ended December 31,\nFacilities management\nTotal segment net revenue\nPass-through costs also recognized as revenue\nTotal segment revenue\nOperating, administrative and other\nDepreciation and amortization\nTotal costs and expenses\nEquity (loss) income from unconsolidate",
  "item2_clean": null
}