{
  "source_file": "cci-20250930.htm",
  "form_type": "10-Q",
  "item1_clean": null,
  "item7_clean": null,
  "item2_clean": "We own, operate and lease shared communications infrastructure that is geographically dispersed throughout the U.S., including (1) approximately 40,000 towers and other structures, such as rooftops (collectively, \"towers\"), (2) approximately 105,000 small cell nodes either currently generating revenue or under contract and (3) approximately 90,000 route miles of fiber primarily supporting small cells and fiber solutions. Our towers, small cells and fiber solutions assets are collectively referred to herein as \"communications infrastructure,\" and the Company's customers on its communications infrastructure are referred to herein as \"tenants.\" The Company provides access, including space or capacity, to its communications infrastructure via long-term contracts in various forms, including lease, license, sublease and service agreements (collectively, \"tenant contracts\").\nOur towers have a significant presence in each of the top 100 basic trading areas, and the majority of our small cells and fiber assets are located in major metropolitan areas, including a presence in most major U.S. markets.\nOn March 13, 2025, management signed a definitive agreement (\"Strategic Fiber Agreement\") to sell our small cells and fiber solutions businesses, together with certain supporting assets and personnel (\"Fiber Business\"), with Zayo Group Holdings Inc. (\"Zayo\") acquiring the fiber solutions business and EQT Active Core Infrastructure fund (\"EQT\") acquiring the small cells business (\"Strategic Fiber Transaction\"). Under the Strategic Fiber Agreement, we will receive $8.5 billion in aggregate cash proceeds, subject to certain closing adjustments.\nAs the Strategic Fiber Transaction represents a material strategic shift for the Company, the Fiber Business' results and net assets are presented herein as discontinued operations and comparable prior periods have been recast to reflect this change. Related to the classification of the Fiber Business as \"held for sale\", the Company recognized a loss from disposal of discontinued operations of $231 million and $1.3 billion, inclusive of estimated transaction fees, for the three and nine months ended September 30, 2025, respectively. The Strategic Fiber Transaction is expected to close in the first half of 2026, subject to certain closing conditions and required government and regulatory approvals. Pending the closing of the Strategic Fiber Transaction, we will continue to operate the Fiber Business in accordance with the Strategic Fiber Agreement.\nFollowing the classification of the Fiber Business as discontinued operations, the Company has one reportable segment that constitutes consolidated results consisting of its towers operations. Unless otherwise noted, all activities and amounts reported below relate to the continuing operations of the Company and exclude activities and amounts related to discontinued operations. See notes 3 and 11 to our condensed consolidated financial statements for a discussion of discontinued operations and our operating segment.\nSite rental revenues represented 94% of our third quarter 2025 consolidated net revenues. The vast majority of our site rental revenues are of a recurring nature and are derived from long-term tenant contracts.\nAs a leading provider of towers in the U.S., our strategy is to create long-term stockholder value via a combination of (1) growing cash flows generated from our existing portfolio of towers, (2) returning a meaningful portion of our cash generated by operating activities to our common stockholders in the form of dividends and share repurchases and (3) investing capital efficiently to grow cash flows. Our strategy is based, in part, on our belief that the U.S. is the most attractive market in the world for towers. We measure our efforts to create \"long-term stockholder value\" by the combined payments of dividends to stockholders and growth in our per-share results. The key elements of our strategy are to:\nGrow cash flows from our existing towers.\nWe are focused on maximizing the recurring site rental cash flows generated from providing our tenants with long-term access to our towers, which we believe is the core driver of value for our stockholders. Tenant additions or modifications of existing tenant equipment (collectively, \"tenant additions\") enable our tenants to expand coverage and capacity in order to meet increasing demand for data while generating high incremental returns for our business. We believe our towers provide an efficient and cost-effective\nsolution for our wireless tenants' growing networks that provides an opportunity to generate cash flows and increase stockholder return.\nReturn cash generated by operating activities to stockholders in the form of dividends and share repurchases\n. We believe that distributing a meaningful portion of our cash generated by operating activities appropriately provides stockholders with increased certainty for a portion of expected long-term stockholder value while still allowing us to retain sufficient flexibility to invest in our business and deliver growth. We believe this decision reflects the translation of the high-quality, long-term contractual cash flows of our business into stable capital returns to stockholders.\nInvest capital efficiently to grow cash flows.\nIn addition to adding tenants to our existing towers, we seek to invest our available capital, including the net cash generated by our operating activities and external financing sources, in a manner that will increase long-term stockholder value. These investments include acquisition of land interests, making improvements and structural enhancements to our existing towers, and constructing and acquiring new towers that we expect will generate future cash flow growth and attractive long-term returns by adding tenants to those assets over time.\nOur strategy to create long-term stockholder value is based on our belief that there will be considerable future demand for our towers based on the location of our assets and the rapid and continuing growth in the demand for data. We believe that such demand for our towers will continue, will result in growth of our cash flows due to tenant additions on our existing towers, and will create other growth opportunities for us, such as demand for newly constructed or acquired towers, as described above. Further, we seek to augment the long-term value creation associated with growing our recurring site rental cash flows by offering certain ancillary site development services.\nHighlights of Business Fundamentals and Results\nWe operate as a REIT for U.S. federal income tax purposes\nAs a REIT, we are generally entitled to a deduction for dividends that we pay and, therefore, are not subject to U.S. federal corporate income tax on our net taxable income that is currently distributed to our stockholders.\nTo remain qualified and be taxed as a REIT, we are generally required to annually distribute to our stockholders at least 90% of our REIT taxable income, after the utilization of our net operating loss carryforwards (\"NOLs\") (determined without regard to the dividends paid deduction and excluding net capital gain).\nSee note 7 to our condensed consolidated financial statements for further discussion of our REIT status.\nPotential growth resulting from the increasing demand for data\nWe expect existing and potential new tenant demand for our towers will result from (1) new technologies, (2) increased usage of mobile entertainment, mobile internet, and machine-to-machine applications, (3) adoption of other emerging and embedded wireless devices (including smartphones, laptops, tablets, wearables and other devices), (4) increasing smartphone penetration, (5) wireless carrier focus on expanding both network quality and capacity, (6) the adoption of other bandwidth-intensive applications (such as cloud services, artificial intelligence and video communications), (7) the availability of additional spectrum and (8) increased government initiatives to support connectivity throughout the U.S.\nWe expect U.S. wireless carriers will continue to focus on improving network quality and expanding capacity (including through 5G initiatives). We believe our towers provide an efficient and cost-effective solution to our wireless tenants' growing infrastructure needs.\nTenant additions on our towers are achieved at a low incremental operating cost, delivering high incremental returns.\nSubstantially all of our towers can accommodate additional tenancy, either as currently constructed or with appropriate modifications.\nInvesting capital efficiently to grow cash flows (see also\n\"Item 2. MD&A—General Overview—Strategy\"\nWe had discretionary capital expenditures of $104 million for the nine months ended September 30, 2025. The capital expenditures predominately related to improvements to existing towers in order to support additional tenants and purchases of land underneath our towers.\nWe expect to continue to construct and acquire new towers based on our tenants' needs and generate attractive long-term returns by adding additional tenants over time.\nSite rental revenues under long-term tenant contracts\nOur tenant contracts have initial terms generally between five to 15 years, with contractual escalators and multiple renewal periods generally between five to 10 years each, exercisable at the option of the tenant.\nAs of September 30, 2025, our weighted-average remaining term was approximately six years, exclusive of renewals exercisable at the tenants' option, currently representing approximately $28.1 billion of expected future cash inflows.\nMajority of our revenues from large wireless carriers\nFor the nine months ended September 30, 2025, approximately 89% of our site rental revenues were derived from T-Mobile, AT&T and Verizon Wireless.\nMajority of land under our towers under long-term control\nFor the nine months ended September 30, 2025, approximately 90% of our towers site rental gross margin and approximat"
}