{
  "source_file": "cdns-20250930.htm",
  "form_type": "10-Q",
  "item1_clean": null,
  "item7_clean": null,
  "item2_clean": "(In millions, except percentages)\nProvision for income taxes\nOur provision for income taxes for the three and nine months ended September 30, 2025 was primarily attributable to federal, state and foreign income taxes on our anticipated fiscal 2025 income. We also recognized tax benefits of $15.1 million and $36.6 million related to stock-based compensation that vested or was exercised during the respective periods. The increase in our provision for income taxes during the three and nine months ended September 30, 2025, as compared to the three and nine months ended September 30, 2024, was primarily attributable to an increase in our earnings and nondeductible expenses.\nOn July 4, 2025, the One Big Beautiful Bill Act (“OBBBA”) was enacted in the United States. The OBBBA includes significant provisions, such as the permanent extension of certain expiring provisions of the Tax Cuts and Jobs Act, modifications to the international tax framework and the restoration of favorable tax treatment for certain business provisions including the immediate expensing of United States research and development expenditures. The legislation has multiple effective dates, with certain provisions effective in fiscal 2025 and others effective from fiscal 2026. We recognized the fiscal 2025 tax effects of the OBBBA in our provision for income taxes for the three months ended September 30, 2025, in accordance with ASC 740, Income Taxes. The OBBBA did not materially impact our estimated fiscal 2025 effective tax rate.\nIn 2021, the Organisation for Economic Co-operation and Development (“OECD”) announced Pillar Two Model Rules which call for the taxation of large multinational corporations, such as Cadence, at a global minimum tax rate of 15%. The currently enacted Pillar Two Model Rules did not have a material impact to our provision for income taxes for the three and nine months ended September 30, 2025.\nOur provision for income taxes for the three and nine months ended September 30, 2024 was primarily attributable to federal, state and foreign income taxes on our then anticipated fiscal 2024 income. We also recognized tax benefits of $12.6 million and $40.8 million related to stock-based compensation that vested or was exercised during the respective periods.\nOur future effective tax rates may also be materially impacted by tax amounts associated with our foreign earnings at rates different from the United States federal statutory rate, research credits, the tax impact of stock-based compensation, accounting for uncertain tax positions, business combinations, closure of statutes of limitations or settlement of tax audits and changes in tax law. A significant amount of our foreign earnings is generated by our subsidiaries organized in Ireland and Hungary. Our future effective tax rates may be adversely affected if our earnings were to be lower in countries where we have lower statutory tax rates relative to earnings in countries where we have higher statutory tax rates. We currently expect that our fiscal 2025 effective tax rate will be approximately 29%. We expect that our quarterly effective tax rates will vary from our fiscal 2025 effective tax rate as a result of recognizing the income tax effects of stock-based awards in the quarterly periods that the awards vest or are settled and other items that we cannot anticipate. For additional discussion about how our effective tax rate could be affected by various risks, see Part I, Item 1A, “Risk Factors,” in our Annual Report.\nLiquidity and Capital Resources\n\nItem 2. Management’s Discussion and Analysis of Financial Condition and Results of Operations\nWe urge you to consider these factors carefully in evaluating the forward-looking statements contained in this Quarterly Report. All subsequent written or oral forward-looking statements attributable to our company or persons acting on our behalf are expressly qualified in their entirety by these cautionary statements. The forward-looking statements included in this Quarterly Report are made only as of the date of this Quarterly Report. We disclaim any obligation to update these forward-looking statements, except as required by law.\nis a global market leader that develops computational, AI-driven software, accelerated hardware, and intellectual property (“IP”) solutions for engineers and scientists to bring new and innovative products to life. Many of the world’s most innovative technology companies use our solutions and services to deliver transformational products to multiple industries that drive the global economy. The products these companies develop are some of the most complex systems in the world. Since our inception, we have been at the forefront of technology innovation. We work closely with our customers, helping them solve their most complex challenges in the semiconductor and electronic systems industries to unlock limitless opportunities.\nOur customers include semiconductor companies that design and manufacture semiconductor devices and systems companies that design and manufacture products containing many different types of semiconductors, which they either make themselves or buy from a semiconductor company. Semiconductors, also referred to as integrated circuits (“ICs”), or chips, are at the heart of almost every major industry. Semiconductors are the catalyst for innovation in many industries including automotive, aerospace, biotech, hyperscale and cloud computing, data centers, telecommunications, medical technology, industrial internet of things (“IIoT”), and AI. They are found in a wide variety of consumer products such as cell phones, automobiles, computers, home appliances, home security, drones, and home entertainment systems.\nOur Intelligent System Design™ (“ISD”) strategy allows us to deliver solutions to our customers to solve their most complex product development challenges. Our industry-leading computational software, accelerated hardware, and IP enable us to adapt to our customers' dynamic design requirements, allowing them to meet their critical business and environmental concerns including time-to-market and sustainability. The creation of even the most seemingly simple electronic systems and products typically includes a complex design process and requires highly trained engineers with various areas of specialized knowledge and skill sets. Our ability to deliver innovative products that keep up with increasing complexity allows our customers to be successful in meeting their business goals and objectives.\nIn alignment with our ISD strategy, we group our solutions in three product categories: Core EDA, Semiconductor IP, and System Design and Analysis. Core EDA includes our software, hardware, and services used to design and verify a wide variety of semiconductors. Our Semiconductor IP portfolio includes silicon subsystems, software, and services that are used in semiconductor design. The System Design and Analysis category includes our software and services used to design and verify a wide variety of physical electronic systems. Leveraging our AI and computational software expertise, we have integrated the multiphysics domain (also known as “computational fluid dynamics,” or “CFD”) with our EDA solutions to provide customers with complete system-level design and analysis solutions. These categories are tightly integrated to provide complete design solutions for our customers.\nFor additional information about our products, see the discussion in Item 1, “Business,” under the heading “Product Categories,” in our Annual Report.\nManagement uses certain performance indicators to manage our business, including revenue, certain elements of operating expenses and cash flow from operations, and we describe these items further below under the headings “Results of Operations” and “Liquidity and Capital Resources.”\nAs part of our ISD strategy, we invest in and acquire complementary businesses, joint ventures, services and technologies and IP rights. The size and timing of these investments and acquisitions may affect comparability of revenue, expenses and cash flows between fiscal periods.\nDuring the second quarter of fiscal 2024, we completed our acquisition of BETA CAE Systems International AG (“BETA CAE”), a system analysis platform provider of multi-domain, engineering simulation solutions. For the three and nine months ended September 30, 2025, revenue associated with contracts assumed with our acquisition of BETA CAE was primarily classified as product and maintenance revenue in our System Design and Analysis product category, and cost of revenue associated with these contracts was primarily classified as cost of product and maintenance in our condensed consolidated income statements.\nDuring the second quarter of fiscal 2025, we completed our acquisition of a holding company containing the VLAB Works business (“VLAB Works”). VLAB Works is a leader in virtual models for hardware verification and software development. Additionally, during the third quarter of fiscal 2025, we acquired the Artisan foundation IP business from Arm Limited. The acquisition of Artisan foundation IP furthers our comprehensive IP strategy by expanding our design IP offerings with standard cell libraries, memory compilers, and general purpose I/Os (“GPIOs”) optimized for advanced process nodes at leading foundries. For the three and nine months ended September 30, 2025, revenue associated with contracts assumed with our acquisition of VLAB Works was primarily classified as product and maintenance revenue in our Core EDA product category. For the three and nine months ended September 30, 2025, revenue associated with contracts assumed with our acquisition of the Artisan foundation IP business was primarily classified as product and maintenance revenue in our IP product category. The cost of revenue associated with these contracts was primarily classified as cost of product and maintenance in our condensed consolidated income statements.\nOn "
}