{
  "source_file": "cdw-20241231.htm",
  "form_type": "10-K",
  "item1_clean": "CDW Corporation (together with its subsidiaries, the “Company,” “CDW” or “we”), a Fortune 500 company and member of the S&P 500 Index, is a leading multi-brand provider of information technology (“IT”) solutions to business, government, education and healthcare customers in the United States (“US”), the United Kingdom (“UK”) and Canada. Our broad array of offerings ranges from discrete hardware and software products to integrated IT solutions and services that include on-premise and cloud capabilities across hybrid infrastructure, digital experience and security.\nWe are vendor, technology and consumption model unbiased, offering a broad selection of products and multi-branded IT solutions. Our solutions are delivered in physical, virtual and cloud-based environments through approximately 10,900 customer-facing coworkers, including sellers, highly-skilled specialists and engineers. We are a leading sales channel partner for many original equipment manufacturers (“OEMs”), software publishers, cloud providers (collectively, our “vendor partners”) and wholesale distributors, whose products we sell or include in the solutions we offer. We provide our vendor partners with a cost-effective way to reach customers and deliver a consistent brand experience through our established end-market coverage, technical expertise and extensive customer access.\nWe simplify the complexities of technology solutions across design, selection, procurement, integration and management for our customers. Our goal is to have our customers, regardless of their size, view us as a trusted adviser and extension of their IT workforce. Our multi-brand offering approach across our vendor partners enables us to provide the solutions and services that best address each customer’s specific requirements to enable their desired business outcomes.\nWe have capabilities to provide integrated IT solutions in approximately 150 countries for customers with primary locations in the US, UK and Canada, which are large and growing markets. These are highly fragmented markets served by thousands of IT resellers and solutions providers. We believe that demand for IT will outpace general economic growth in the markets we serve, fueled by new technologies, including hybrid and cloud computing and artificial intelligence, as well as growing end-user demand for security, efficiency and productivity.\nWe are positioned in the middle of the IT ecosystem where we procure products from OEMs, software publishers, cloud providers and wholesale distributors and provide added value to our customers by helping them navigate through complex options and implement the best solution for their business. In this role, we believe we provide unique value to both our vendor partners and our customers.\nOur value proposition to our customers\nOur value proposition to our vendor partners\nBroad selection of products and multi-branded IT solutions\nAccess to over 250,000 customers\nValue-added services with integration capabilities\nLarge and established customer channels\nHighly-skilled specialists and engineers\nStrong distribution and implementation capabilities\nSolutions across IT lifecycle\nCustomer relationships driving insight into technology roadmaps\nWe provide integrated IT solutions to over 250,000 business, government, education and healthcare customers throughout the US, UK and Canada.\nWe serve our customers through sales teams focused on customer end-markets that are supported by highly-skilled specialists and engineers. Our market segmentation allows us to customize our offerings and to provide enhanced expertise in designing and implementing IT solutions that meet our customer’s specific needs.\nWe have three reportable segments: Corporate, Small Business and Public. Our Corporate segment primarily serves US private sector business customers with more than 250 employees. Our Small Business segment primarily serves US private sector business customers with up to 250 employees. Our Public segment is comprised of government agencies and education and healthcare institutions in the US. We also have two other operating segments: CDW UK and CDW Canada, each of which do not meet the reportable segment quantitative thresholds and, accordingly, are included in an all other category (“Other”).\nIn our US business, which represents approximately 90% of our Net sales, we currently have five dedicated customer channels: corporate, small business, government, education and healthcare, each of which generated $1.5 billion or greater in Net sales in 2024. Net sales to customers in the UK and Canada combined generated $2.5 billion in 2024. We believe this diversity of customer end-markets provides us with multiple avenues for growth and has been a key factor in our ability to weather economic and technology cycles and gain market share.\nWe offer more than 100,000 products and services from more than 1,000 vendor partners, including well-established companies such as Adobe, APC, Apple, Amazon Web Services, Broadcom Inc., Cisco, Dell Technologies, Google, Hewlett Packard Enterprise, HP Inc., IBM, Intel, Lenovo, Microsoft, NetApp, Nutanix, Palo Alto Networks, Pure Storage and Samsung, as well as from emerging technology companies. This broad portfolio of vendor partners and technologies enables us to offer customers significant options and meet customer demand for the products and solutions that best meet their needs. We believe our value proposition to vendor partners enables us to evolve our offering as new technologies emerge and new companies seek us as a channel partner.\nIn 2024, we generated $2.0 billion of Net sales from each of our three largest vendor partners. We have received the highest level of certification from major vendor partners such as Broadcom Inc., Cisco, Dell Technologies, Hewlett Packard Enterprise, IBM, Lenovo, Microsoft, NetApp, Nutanix, Palo Alto Networks and Samsung which reflects the extensive product and solution knowledge and capabilities that we bring to our customers. These certifications also provide us with access to favorable pricing, tools and resources, including vendor incentive programs, which we use to provide additional value to our customers. Our vendor partners also regularly recognize us with top awards and select us to develop and grow new customer solutions.\nWe may purchase all or only some of the products our vendor partners offer for resale to our customers or for inclusion in the solutions we offer. Each vendor partner agreement provides for specific terms and conditions, which may include one or more of the following: product return privileges, price protection policies, purchase discounts and vendor incentive programs, such as purchase or sales rebates and cooperative advertising reimbursements. We also purchase software from major software publishers and cloud providers for resale to our customers or for inclusion in the solutions we offer. Our agreements allow us to resell cloud based solutions, software or other licensed products to the end-user customer.\nIn addition to purchasing products directly from our vendor partners, we purchase products from wholesale distributors for resale to our customers or for inclusion in the solutions we offer. These wholesale distributors provide logistics management and supply-chain services for us, as well as for our vendor partners.\nInventory Management\nWe operate two distribution centers in North America and one distribution center in the UK, which combined provide more than 1 million square feet in size. Leveraging our distribution and logistics capabilities, we handle and ship approximately 26 million units annually on an aggregate basis from our distribution centers.\nWe also have drop-shipment arrangements with many of our OEMs and wholesale distributors, which permit us to offer products to our customers without having to take physical delivery at our distribution centers. These arrangements represented approximately 54% of total North America Net sales in 2024.\nWe believe that the location of our distribution centers allows us to efficiently ship products to our customers and provide timely access to our principal distributors. We believe that our logistics and configuration capabilities delivered by our highly-skilled and certified team enable us to customize technology for our customers to meet their unique needs.\nWe believe competitive sources of supply are available in substantially all of the product categories that we offer.\nThe market for technology products, solutions and services is highly competitive and subject to economic conditions and rapid technological changes. This competitive environment includes the ability to tailor solutions to customer needs, the quality and breadth of product and service offerings, knowledge and expertise of sales force, customer service, price, product availability, speed of delivery and credit availability. We face competition from resellers, manufacturers who sell directly to customers, large service providers and system integrators, cloud providers, e-commerce companies, and office supply retailers, among others. Smaller, local or regional value-added resellers typically focus on a single solution suite or portfolio of solutions from one or two vendor partners.\nWe believe we are well positioned to compete within this marketplace due to our competitive advantages. We expect the competitive landscape to continue to evolve as new technologies and consumption models emerge, such as cloud-based and other “as a service” solutions, hyper-converged infrastructure, embedded software solutions and solutions that incorporate artificial intelligence. While innovation can help our business as it creates new offerings for us to sell, it can also disrupt our business model and create new and stronger competitors. For additional information on the risks associated with competition, see “Item 1A. Risk Factors.”\nWe believe we have sustainable competitive advantages that differentiate us in the marketplace. We focus on providing high quality service to gain new customers and retain existing customers. We have built a strong sales organization and deep services and solutions capabilities over time and expect to continue to invest to enhance these capabilities. We believe the combination of our competitive advantages of scale, performance-driven culture and enhanced capabilities will help drive sustainable, profitable growth for us today and in the future. Our scale enables us to have a national and international footprint, as well as invest in resources to meet specific customer end-market needs. Our sellers are organized around unique customer end-markets that are both vertically and geographically focused. Our scale enables our ability to invest in specialists and engineers who work directly with our sellers to help customers implement complex IT solutions. We have cross-border relationships that enable us to serve the needs of our US, UK and Canadian-based customers in approximately 150 countries. Our strong, execution-oriented culture is underpinned by our compensation system.\nOur offerings range from discrete hardware and software products and services to complex integrated solutions including one or more of these elements. We believe our customers increasingly view technology purchases as integrated solutions vital to their strategies, business outcomes and missions rather than discrete product and services categories. Our hardware category includes notebooks/mobile devices (including tablets), network communications (“netcomm products”), collaboration hardware, data storage and servers, desktop computers and other hardware. Our software category includes cloud solutions, software assurance, application suites, security, virtualization, collaboration and productivity applications, operating systems and network management. Our services include advisory and design, software development, implementation, managed services and warranties.\nIT is ",
  "item7_clean": "Item 7. Management’s Discussion and Analysis of Financial Condition and Results of Operations\nUnless otherwise indicated or the context otherwise requires, as used in this “Management’s Discussion and Analysis of Financial Condition and Results of Operations,” the terms “we,” “us,” “the Company,” “our,” “CDW” and similar terms refer to CDW Corporation and its subsidiaries. “Management’s Discussion and Analysis of Financial Condition and Results of Operations” should be read in conjunction with the Consolidated Financial Statements and the related notes included elsewhere in this report. This discussion contains forward-looking statements that are subject to numerous risks and uncertainties. Actual results may differ materially from those contained in any forward-looking statements. See “Forward-Looking Statements” above.\nCDW Corporation (“Parent”), a Fortune 500 company and member of the S&P 500 Index, is a leading multi-brand provider of information technology (“IT”) solutions to business, government, education and healthcare customers in the United States (“US”), the United Kingdom (“UK”) and Canada. Our broad array of offerings ranges from discrete hardware and software products to integrated IT solutions and services that include on-premise and cloud capabilities across hybrid infrastructure, digital experience and security.\nWe have three reportable segments: Corporate, Small Business and Public. Our Corporate segment primarily serves US private sector business customers with more than 250 employees. Our Small Business segment primarily serves US private sector business customers with up to 250 employees. Our Public segment is comprised of government agencies and education and healthcare institutions in the US. We also have two other operating segments: CDW UK and CDW Canada, each of which do not meet the reportable segment quantitative thresholds and, accordingly, are included in an all other category (“Other”).\nWe are vendor, technology and consumption model unbiased, with a solutions portfolio including more than 100,000 products and services from more than 1,000 leading and emerging brands. Our solutions are delivered in physical, virtual and cloud-based environments through approximately 10,900 customer-facing coworkers, including sellers, highly-skilled specialists and engineers. We are a leading sales channel partner for many original equipment manufacturers, software publishers, cloud providers (collectively, our “vendor partners”) and wholesale distributors, whose products we sell or include in the solutions we offer. We provide our vendor partners with a cost-effective way to reach customers and deliver a consistent brand experience through our established end-market coverage, technical expertise and extensive customer access.\nWe may sell all or only select products that our vendor partners offer. Each vendor partner agreement provides for specific terms and conditions, which may include one or more of the following: product return privileges, price protection policies, purchase discounts and vendor incentive programs, such as purchase or sales rebates and cooperative advertising reimbursements. We also resell software for major software publishers. Our agreements with software publishers allow the end-user customer to acquire software or licensed products and services. In addition to helping our customers determine the best software solutions for their needs, we help them manage their software agreements, including warranties and renewals. A significant portion of our advertising and marketing expenses are reimbursed through cooperative advertising programs with our vendor partners. These programs are at the discretion of our vendor partners and are typically tied to sales or other commitments to be met by us within a specified period of time.\nTrends and Key Factors Affecting our Financial Performance\nWe believe the following key factors may have a meaningful impact on our business performance, influencing our ability to generate sales and achieve our targeted financial and operating results:\nGeneral economic conditions are a key factor affecting our results as they can impact our customers’ willingness and ability to spend on information technology. Macroeconomic uncertainty persists as a result of the inflationary environment and the corresponding level of interest rates driven by monetary policy. The uncertainty in the current economic environment resulted in, and may continue to result in, a delay, pause or reduction of investments in technology by our customers.\nCustomers are evaluating the complex technology landscape in order to balance priorities and focus on solutions that lead to business optimization, cost management and security risk management, resulting in a more measured approach to their IT spending. We have orchestrated solutions by leveraging security, software and hybrid and cloud offerings to help customers achieve their objectives.\nChanges and uncertainty related to spending policies, budget priorities, timing and funding levels, including stimulus packages, are key factors influencing the purchasing levels of government, healthcare and education customers. As the duration and ongoing impact of current economic conditions remain uncertain, current and future budget priorities and funding levels for government, healthcare and education customers may be adversely affected, leading to lower IT spend.\nTechnology trends drive customer purchasing behaviors in the market. Current technology trends are focused on delivering greater flexibility and efficiency, as well as designing and managing IT securely. These trends are driving customer adoption of cloud, artificial intelligence, software defined architectures and hybrid on-premise and off-premise combinations. The trends are further driven by the evolution of the IT consumption model to more “as a service” offerings, including software as a service and infrastructure as a service, in addition to ongoing managed and professional service arrangements. Technology trends are likely to evolve as customers prioritize spend that will produce the most important outcomes for their business.\nKey Business Metrics\nWe monitor a number of financial and non-financial measures and ratios on a regular basis in order to track the progress of our business and make adjustments as necessary. Financial measures include both US GAAP, the accounting principles generally accepted in the United States of America, and Non-GAAP, which excludes or includes amounts that are not normally included or excluded in the most directly comparable measure calculated and presented in accordance with US GAAP. We believe that the most important of these measures and ratios include Gross profit, Gross profit margin, Operating income, Operating income margin, Non-GAAP operating income, Non-GAAP operating income margin, Net income, Non-GAAP net income, Net income per diluted share, Non-GAAP net income per diluted share, Average daily sales, Net cash provided by operating activities, Adjusted free cash flow, Cash conversion cycle and Net debt. These measures and ratios are closely monitored by management, so that actions can be taken, as necessary, in order to achieve financial objectives.\nFor the definitions, discussion of management’s use of Non-GAAP measures and reconciliations to the most directly comparable US GAAP measure, see “Results of Operations - Non-GAAP Financial Measure Reconciliations.”\nThe results of certain key business metrics for the comparative periods are as follows:\nYear Ended December 31,\n(dollars in millions, except per share amounts)\nOperating income margin\nNon-GAAP operating income\nNon-GAAP operating income margin\nNet income per diluted share\nNon-GAAP net income per diluted share\nCash conversion cycle (in days)\nNet cash provided by operating activities\nAdjusted free cash flow\nDefined as Net sales divided by the number of selling days. There were 254 selling days for both the years ended December 31, 2024 and 2023.\nDefined as Total debt minus Cash and cash equivalents and Short-term investments.\nDefined as days of sales outstanding related to the current portion of Accounts receivable and certain receivables due from vendors, plus days of supply in Merchandise inventory, minus days of purchases outstanding related to the current portion of Accounts payable and Accounts payable-\ninventory financing, based on a rolling three-month average.\nDefined as Net cash provided by operating activities less capital expenditures, adjusted to include cash flows from financing activities that relate to the purchase of inventory.\nResults of Operations\nResults of operations, including Gross profit margin and Operating income margin, expressed as Gross profit and Operating income as a percentage of Net sales, respectively, for the years ended December 31, 2024 and 2023 are below. For additional information on Net sales, Gross profit and Operating income by segment, see the “Segment Results of Operations.”\nYear Ended December 31,\n(dollars in millions)\nSelling and administrative expenses\nOperating income margin\nInterest expense, net\nIncome before income taxes\n*nm - Not meaningful\nThe year ended December 31, 2024 compared with the year ended December 31, 2023\nNet sales decreased $377 million, or 1.8%, with lower Net sales across all operating segments. The decrease was primarily due to a decrease in netcomm, partially offset by an increase in notebooks/mobile devices. Continued economic uncertainty and the complex technology landscape has led customers to be cautious and measured in their approach to technology spending, leading to a decline in Net sales.\nGross profit decreased $50 million, or 1.1%, primarily due to lower Net sales across all operating segments. Gross profit margin, expressed as a percentage of Net sales, increased 10 basis points to 21.9% primarily driven by a higher contribution of netted down revenue, primarily software as a service, partially offset by lower product margin due to mix and rate in notebooks/mobile devices.\nSelling and administrative expenses decreased $20 million, or 0.7%, primarily due to lower performance-based compensation, including equity-based compensation, consistent with lower attainment against certain financial measures, and lower workforce optimization costs, partially offset by a higher provision for expected credit losses and transformation and other related costs in the current year.\nOperating income decreased $30 million, or 1.8%, to $1,651 million for the year ended December 31, 2024, compared to $1,681 million for the year ended December 31, 2023.\nInterest expense, net decreased $12 million, or 5.3%, primarily due to increased interest income earned on higher average cash balances.\nIncome tax expense was $358 million for the year ended December 31, 2024, compared to $346 million for the year ended December 31, 2023. The effective income tax rate, expressed by calculating income tax expense as a percentage of Income before income taxes, was 24.9% and 23.9% for 2024 and 2023, respectively. The higher effective income tax rate for the year ended December 31, 2024 as compared to the prior year was primarily attributable to lower excess tax benefits on equity-based compensation.\nSegment Results of Operations\nNet sales by segment, in dollars and as a percentage of total Net sales, and the year-over-year dollar and percentage change in Net sales by segment are as follows:\nYear Ended December 31,\n(dollars in millions)\nThere were 254 selling days for both the years ended December 31, 2024 and 2023. Average daily sales is defined as Net sales divided by the number of selling days.\nGross profit by segment, in dollars and Gross profit margin by segment, defined as Gross profit dollars as a percentage of Net sales by segment, and the year-over-year percentage change are as follows:\nYear Ended December 31,\n(dollars in millions)\nGross Profit Dollar Change\nIncludes the financial results for our other operating segments, CDW UK and CDW Canada, which do not meet the reportable segment quantitative thresholds.\nOperating income by segment, in dollars and as a percentage of Net sales by segment, and the year-over-year percentage change are as follows:\nYear Ended December 31,\n(dollars in millions)\nOperating Income Margin\nOperating Income Margin\nOperating Income Dollar Change\nTotal Operating income\n*nm - Not meaningful\nSegment operating income includes the segment’s direct operating income, allocations for certain Headquarters’ costs, allocations for income and expenses from logistics services, certain inventory adjustments and volume rebates and cooperative advertising from vendors.\nIncludes the financial results for our other operating segments, CDW UK and CDW Canada, which do not meet the reportable segment quantitative thresholds.\nIncludes Headquarters’ function costs that are not allocated to the segments.\nThe year ended December 31, 2024 compared with the year ended December 31, 2023\nCorporate segment Net sales decreased $124 million, or 1.4%, primarily due to a decrease in netcomm products, partially offset by an increase in notebooks/mobile devices and software.\nCorporate segment Gross profit dollars decreased $28 million, or 1.3%, although partially offset by increased netted down revenue. Gross profit margin remained relatively consistent at 23.8%.\nCorporate segment Operating income increased $33 million, or 3.9%, primarily due to lower performance-based compensation, including equity-based compensation, consistent with lower attainment against certain financial measures, and lower payroll expenses.\nSmall Business segment Net sales decreased $33 million, or 2.1%, primarily due to a decline across all hardware categories, partially offset by an increase in services.\nSmall Business segment Gross profit dollars decreased $9 million, or 2.4%. Gross profit margin remained consistent at 23.2%.\nSmall Business segment Operating income increased $4 million, or 2.1%, as Gross profit dollars declined but were more than offset by a decrease across various selling and administrative expenses.\nPublic segment Net sales decreased $148 million, or 1.8%, primarily due to a decrease across various hardware categories. Most notably netcomm products decreased across all sales channels and collaboration products decreased within the Education sales channel, partially offset by an increase in notebooks/mobile devices across all channels.\nPublic segment Gross profit dollars decreased $8 million, or 0.5%. Gross profit margin increased 20 bps, to 20.3%, primarily due to increased netted down revenue.\nPublic segment Operating income increased $11 million, or 1.5%, primarily due to decreased acquisition and integration costs.\nNet sales in Other, which is comprised of results from our UK and Canadian operations, decreased $73 million, or 2.9%, primarily due to a decrease in software related to the UK operations.\nOther Gross profit dollars decreased $5 million, or 0.9%. Gross profit margin increased 40 bps, to 19.8%, due to increased netted down revenue.\nOther Operating income decreased $30 million, or 21.1%, primarily due to increased transformation initiative expense, lower Gross profit dollars and increased bad debt expense for expected credit losses.\nNon-GAAP Financial Measure Reconciliations\nGenerally, a non-GAAP financial measure is a numerical measure of a company’s performance or financial condition that either excludes or includes amounts that are not normally included or excluded in the most directly comparable measure calculated and presented in accordance with US GAAP. Non-GAAP measures used by management may differ from similar measures used by other companies, even when similar terms are used to identify such measures.\nOur non-GAAP performance measures include Non-GAAP operating income, Non-GAAP operating income margin, Non-GAAP net income, Non-GAAP net income per diluted share and Net sales on a constant currency basis, and our ",
  "item2_clean": null
}