{
  "source_file": "cf-20241231.htm",
  "form_type": "10-K",
  "item1_clean": "Each project is expected to qualify under Section 45Q of the Internal Revenue Code for tax credits per metric ton of sequestered CO\nDecarbonization projects in our existing network also include our electrolyzer project at our Donaldsonville complex to produce ammonia with hydrogen sourced from an electrolysis process that produces no CO\nemissions. Commissioning of the 20-megawatt alkaline water electrolysis plant to produce hydrogen was suspended due to an issue experienced in the fourth quarter of 2024. Upon identification and remediation of the issue, we expect to resume commissioning activities. At full electrolyzer capacity, we will be able to produce approximately 20,000 tons of low-carbon ammonia per year.\nOur decarbonization projects also include front-end engineering and design (FEED) studies to inform our evaluation of whether, and how best, to invest in export-oriented, low-carbon ammonia capacity at our Blue Point complex in Ascension Parish, Louisiana, to supply developing clean energy markets and traditional ammonia markets where demand for low-carbon product is emerging.\nCF INDUSTRIES HOLDINGS, INC.\nIn the fourth quarter of 2024, we received results from a FEED study evaluating the use of autothermal reforming (ATR) ammonia production technology alongside CCS to enable the production of low-carbon ammonia. ATR technology, when combined with CCS to capture and sequester process CO\nemissions, is expected to reduce CO\nemissions from the ammonia production process by more than 90% compared to conventional ammonia plants. The FEED study results estimate the costs of a project with these attributes to be approximately $4 billion for the approximately 1.4 million metric ton capacity greenfield ATR ammonia facility and CCS technologies. Additionally, we estimate approximately $500 million would be required for the scalable common infrastructure for our Blue Point complex, such as ammonia storage and a vessel loading dock.\nWe have entered into joint development agreements (JDAs) with two potential partners, Mitsui & Co., Ltd. and JERA Co., Inc. for the development of the greenfield low-carbon ammonia capacity. Our evaluation includes assessing whether the ammonia production technology under consideration will satisfy carbon intensity and other requirements for potential end users. Should a positive final investment decision (FID) be reached to construct greenfield low-carbon ammonia capacity at our Blue Point complex, construction and commissioning is expected to take approximately four years from a positive FID.\nIn addition to discussions with existing customers who have interest in using low-carbon ammonia for traditional applications, we are engaged in discussions regarding the supply of low-carbon ammonia for new applications. We are evaluating and are in various stages of discussions with other companies for long-term offtake and/or potential joint investments related to new and traditional applications for low-carbon ammonia. These discussions continue to advance as we gain greater clarity regarding demand for low-carbon ammonia, including associated carbon intensity requirements, government incentives and regulatory developments.\nWe were founded in 1946 as Central Farmers Fertilizer Company, and were owned by a group of regional agriculture cooperatives for the first 59 years of our existence. Central Farmers became CF Industries in 1970.\nOriginally established as a fertilizer brokerage company, we expanded owning and operating fertilizer manufacturing and distribution facilities in the early 1950s with a principal objective of assured supply for our owners. At various times in our history, we manufactured and/or distributed nitrogen, phosphate and potash fertilizers.\nWe operated as a traditional manufacturing and supply cooperative until 2002, when we adopted a new business model that established financial performance as our principal objective, rather than assured supply for our owners. A critical aspect of the new business model was to establish a more economically driven approach to the marketplace.\nIn August 2005, we completed the initial public offering (IPO) of our common stock, which is listed on the New York Stock Exchange. In connection with the IPO, we consummated a reorganization transaction whereby we ceased to be a cooperative and our pre-IPO owners’ equity interests in CF Industries were cancelled in exchange for all of the proceeds of the offering and shares of our common stock. At the time of the IPO, our assets consisted of one wholly owned nitrogen manufacturing facility in Louisiana, United States; a joint venture nitrogen manufacturing facility in Alberta, Canada, of which we owned 66 percent; a phosphate mining and manufacturing operation in Florida, United States; and distribution facilities throughout North America.\nIn April 2010, we acquired Terra Industries Inc. (Terra), a leading North American producer and marketer of nitrogen fertilizer products for a purchase price of $4.6 billion, which was paid in cash and shares of our common stock. As a result of the Terra acquisition, we acquired five nitrogen fertilizer manufacturing facilities; an approximately 75.3% interest in Terra Nitrogen Company, L.P. (TNCLP), a publicly traded limited partnership; and certain joint venture interests.\nPrior to April 30, 2013, we owned 66 percent of Canadian Fertilizers Limited (CFL), a joint venture nitrogen manufacturing facility in Alberta, Canada. On April 30, 2013, CF Industries acquired all of the outstanding interests in CFL that it did not already own and CFL became our wholly owned subsidiary.\nIn March 2014, we exited our phosphate mining and manufacturing business, which was located in Florida, through a sale to The Mosaic Company. As a result, we became focused solely on nitrogen manufacturing and distribution.\nIn July 2015, we acquired the remaining 50% equity interest in CF Fertilisers UK Group Limited (formerly known as GrowHow UK Group Limited) (CF Fertilisers UK) not previously owned by us, and CF Fertilisers UK became wholly owned by us. This transaction added CF Fertilisers UK’s nitrogen manufacturing complexes in Ince, United Kingdom and Billingham, United Kingdom to our consolidated manufacturing capacity. Due to the substantial increase in the cost of natural gas in the United Kingdom, in 2022, we closed the Ince facility, and in 2023, we ceased operations of the ammonia plant at the Billingham facility, which was idled in September 2022. Since that time, we have imported ammonia for upgrade into AN and other nitrogen products at the Billingham facility.\nCF INDUSTRIES HOLDINGS, INC.\nIn February 2016, our strategic venture with CHS commenced, at which time CHS made a capital contribution of $2.8 billion to CFN in exchange for membership interests in CFN, which represented approximately 11% of the total membership interests of CFN.\nIn late 2015 and 2016, we completed capacity expansion projects at our Donaldsonville complex in Louisiana and our Port Neal complex in Iowa. These projects, originally announced in 2012, included the construction of new ammonia, urea, and UAN plants at our Donaldsonville complex and new ammonia and urea plants at our Port Neal complex. These plants increased our overall production capacity by approximately 25%, improved our product mix flexibility at Donaldsonville, and improved our ability to serve upper-Midwest urea customers from our Port Neal location. The total capital cost of the capacity expansion projects was $5.2 billion.\nPrior to April 2, 2018, Terra Nitrogen, Limited Partnership, which owns and operates our Verdigris nitrogen manufacturing facility in Oklahoma, was a subsidiary of TNCLP. On April 2, 2018, Terra Nitrogen GP Inc., the sole general partner of TNCLP and an indirect wholly owned subsidiary of CF Holdings, completed its purchase of all of the publicly traded common units of TNCLP (the Purchase). Upon completion of the Purchase, CF Holdings owned, through its subsidiaries, 100 percent of the general and limited partnership interests of TNCLP.\nOn December 1, 2023, we acquired an ammonia production facility located in Waggaman, Louisiana from Dyno Nobel Louisiana Ammonia, LLC (DNLA), a U.S. subsidiary of Australia-based Incitec Pivot Limited (IPL), pursuant to an asset purchase agreement with DNLA and IPL. The facility has a nameplate capacity of 880,000 tons of ammonia annually. In connection with the closing of the acquisition on December 1, 2023, we entered into a long-term ammonia offtake agreement providing for us to supply up to 200,000 tons of ammonia per year to IPL’s Dyno Nobel, Inc. subsidiary. Under the terms of the asset purchase agreement, $425 million of the $1.675 billion purchase price, subject to adjustment, was allocated by the parties to the ammonia offtake agreement. We funded the balance of the final purchase price, after adjustment, with $1.221 billion of cash on hand.\nProduct Tons and Nutrient Tons\nWe also provide certain supplementary volume information measured in nutrient tons. Nutrient tons represent the weight of the product’s nitrogen content, which varies by product. Ammonia represents 82% nitrogen content, granular urea represents 46% nitrogen content, UAN represents between 28% and 32% nitrogen content and AN represents between 29% and 35% nitrogen content.\nOur reportable segments consist of the following segments: Ammonia, Granular Urea, UAN, AN and Other. These segments are differentiated by products. We use gross margin to evaluate segment performance and allocate resources. Total other operating costs and expenses (consisting primarily of selling, general and administrative expenses and other operating—net) and non-operating expenses (consisting primarily of interest and income taxes), are centrally managed and are not included in the measurement of segment profitability reviewed by management. See Note 22—Segment Disclosures for additional information.\nCF INDUSTRIES HOLDINGS, INC.\n\nTerminal and Warehouse Locations\nTotal Storage Capacity\n_______________________________________________________________________________\nCapacity is expressed as the equivalent volume of UAN measured on a 32% nitrogen content basis.\nThe owned facilities that store UAN also can store ammonia.\nOur lease agreements are typically for periods of one to four years and commonly contain provisions for automatic renewal that can extend the lease term unless cancelled by either party.\nThe principal customers for our nitrogen products are cooperatives, retailers, independent fertilizer distributors, traders, wholesalers and industrial users. Sales are generated by our internal marketing and sales force. CHS was our largest customer in 2024 and accounted for approximately 12% of our consolidated net sales. We have a strategic venture with CHS under which CHS has a minority equity interest in CFN. See Note 19—Noncontrolling Interest for additional information on our strategic venture with CHS.\nOur markets are global and intensely competitive, based primarily on delivered price and, to a lesser extent, on reliability, customer service and product quality. During the peak demand periods, product availability and delivery time also play a role in the buying decisions of customers.\nOur primary competitors with North American operations include Nutrien Ltd., Koch Fertilizer LLC, LSB Industries, CVR Partners, LP and Yara International. There is also significant competition from products sourced from other regions of the world, including some with lower natural gas or other feedstock costs, which may include the benefit of government subsidies. Because ammonia, urea and UAN are widely-traded fertilizer products and there are limited barriers to entry, we experience competition from foreign-sourced products continuously. Producers of nitrogen-based fertilizers located in the Middle East, Trinidad, Africa and Russia have been major exporters to North America in recent years.\nOur primary United",
  "item7_clean": "(in millions, except as noted)\nGross margin percentage\nSales volume by product tons (000s)\nSales volume by nutrient tons (000s)\nAverage selling price per product ton\nAverage selling price per nutrient ton\nGross margin per product ton\nGross margin per nutrient ton\nDepreciation and amortization\nUnrealized net mark-to-market (gain) loss on natural gas derivatives\nN/M\n_______________________________________________________________________________\nNutrient tons represent the tons of nitrogen within the product tons.\nYear Ended December 31, 2024 Compared to Year Ended December 31, 2023\nNet sales in our Other segment decreased $61 million, or 11%, to $503 million in 2024 from $564 million in 2023 due to a 7% decrease in average selling prices and a 5% decrease in sales volume. Average selling prices decreased to $239 per ton in 2024 compared to $256 per ton in 2023 as lower global energy costs reduced the global market clearing price required to meet global demand. The decrease in sales volume was due primarily to lower DEF sales volume, partially offset by higher nitric acid sales volume.\nCost of sales in our Other segment averaged $143 per ton in 2024, a 4% decrease from $149 per ton in 2023, due primarily to the impact of lower realized natural gas costs, including the impact of realized derivatives, partially offset by higher costs for maintenance activity.\n. Gross margin in our Other segment decreased by $35 million, or 15%, to $201 million in 2024 from $236 million in 2023, and our gross margin percentage was 40.0% in 2024 compared to 41.8% in 2023. The decrease in gross margin was due primarily to a 7% decrease in average selling prices, which decreased gross margin by $32 million, a 5% decrease in sales volume, which decreased gross margin by $23 million, and a net increase in manufacturing, maintenance and other costs, which decreased gross margin by $1 million. These factors that decreased gross margin were partially offset by a decrease in realized natural gas costs, including the impact of realized derivatives, which increased gross margin by $23 million. Gross margin includes the impact of a $2 million unrealized net mark-to-market gain on natural gas derivatives in 2024 compared to a $4 million gain in 2023.\nCF INDUSTRIES HOLDINGS, INC.\nLiquidity and Capital Resources\nOur primary uses of cash are generally for operating costs, working capital, capital expenditures, debt service, investments, taxes, share repurchases, dividends, and our clean energy initiatives. Our working capital requirements are affected by several factors, including demand for our products, selling prices, raw material costs, freight costs and seasonal factors inherent in the business. We may also utilize our cash to fund acquisitions. In addition, we may from time to time seek to retire or purchase our outstanding debt through cash purchases, in open market or privately negotiated transactions or otherwise. Such repurchases, if any, will depend on prevailing market conditions, our liquidity requirements, contractual restrictions and other factors. The amounts involved may be material.\nGenerally, our primary source of cash is cash from operations, which includes cash generated by customer advances. We may also from time to time access the capital markets or engage in borrowings under our revolving credit agreement.\nAs of December 31, 2024, our cash and cash equivalents balance was $1.61 billion, a decrease of $418 million from $2.03 billion at December 31, 2023. At December 31, 2024, we were in compliance with all applicable covenant requirements under our revolving credit agreement and senior notes, and unused borrowing capacity under our revolving credit agreement was $750 million.\nIn each of the quarters of 2024, quarterly dividends of $0.50 per common share were declared and paid, representing a 25% increase from the quarterly dividends of $0.40 per common share that were declared and paid in each of the quarters of 2023.\nCash equivalents include highly liquid investments that are readily convertible to known amounts of cash with original maturities of three months or less. Under our short-term investment policy, we may invest our cash balances, either directly or through mutual funds, in several types of investment-grade securities, including notes and bonds issued by governmental entities or corporations. Securities issued by governmental entities include those issued directly by the U.S. and Canadian federal governments; those issued by state, local or other governmental entities; and those guaranteed by entities affiliated with governmental entities.\nWe make capital expenditures to sustain our asset base, increase our capacity or capabilities, improve plant efficiency, comply with various environmental, health and safety requirements, and invest in our clean energy strategy. Capital expenditures totaled $518 million in 2024 compared to $499 million in 2023.\nCapital expenditures in 2025 are estimated to be in the range of $500 million to $550 million. Planned capital expenditures are generally subject to change due to delays in regulatory approvals or permitting, unanticipated increases in cost, changes in scope and completion time, performance of third parties, delays in the receipt of equipment, adverse weather, defects in materials and workmanship, labor or material shortages, transportation constraints, acceleration or delays in the timing of the work and other unforeseen difficulties. Any of these changes in planned capital expenditures, individually or in the aggregate, could have a material impact on our results of operations and cash flows.\nIn addition, our decarbonization projects include FEED studies to inform our evaluation of whether, and how best, to invest in an export-oriented, low-carbon ammonia capacity at our Blue Point complex in Ascension Parish, Louisiana, to supply developing energy markets and traditional ammonia markets where demand for low-carbon product is emerging. Our estimated capital expenditures for 2025, which are described above, exclude any amounts that would be required in connection with this project, and such amounts could be significant. See “Overview of CF Holdings—Our Strategy,” above, for additional information on our clean energy initiatives.\nAcquisition of Waggaman Ammonia Production Facility\nOn December 1, 2023, we acquired an ammonia production facility located in Waggaman, Louisiana from Dyno Nobel Louisiana Ammonia, LLC (DNLA), a U.S. subsidiary of Australia-based Incitec Pivot Limited (IPL), pursuant to an asset purchase agreement with DNLA and IPL. In connection with the acquisition, we entered into a long-term ammonia offtake agreement providing for us to supply up to 200,000 tons of ammonia per year to IPL’s Dyno Nobel, Inc. subsidiary. Under the terms of the asset purchase agreement, $425 million of the purchase price of $1.675 billion, subject to adjustment, was allocated by the parties to the ammonia offtake agreement. We funded the balance of the initial purchase price on the acquisition date with $1.223 billion of cash on hand.\nCF INDUSTRIES HOLDINGS, INC.\nThe consideration transferred on the acquisition date reflected an estimated net working capital adjustment and other adjustments to the purchase price, which was subject to further adjustment pursuant to the terms of the asset purchase agreement. The purchase price adjustments required under the asset purchase agreement were finalized in the second quarter of 2024, which resulted in a $2 million reduction in the purchase price. As a result, the final purchase price was $1.221 billion.\nShare Repurchase Programs\nOn November 3, 2021, our Board of Directors (the Board) authorized the repurchase of up to $1.5 billion of CF Holdings common stock through December 31, 2024 (the 2021 Share Repurchase Program). The 2021 Share Repurchase Program was completed in the second quarter of 2023. On November 2, 2022, the Board authorized the repurchase of up to $3 billion of CF Holdings common stock commencing upon completion of the 2021 Share Repurchase Program and effective through December 31, 2025 (the 2022 Share Repurchase Program). Repurchases under our share repurchase programs may be made from time to time in the open market, through privately negotiated transactions, through block transactions, through accelerated share repurchase programs, or otherwise. The manner, timing and amount of repurchases will be determined by our management based on the evaluation of market conditions, stock price, and other factors.\nThe following table summarizes the share repurchases under the 2022 Share Repurchase Program.\nShares repurchased in 2023:\nTotal shares repurchased in 2023\nShares repurchased in 2024:\nTotal shares repurchased in 2024\nShares repurchased as of December 31, 2024\n______________________________________________________________________________\nAs defined in the 2022 Share Repurchase Program, amounts reflect the price paid for the shares of common stock repurchased, excluding commissions paid to brokers and excise taxes.\nIn 2024, we repurchased approximately 18.8 million shares under the 2022 Share Repurchase Program for approximately $1.51 billion, of which $10 million was accrued and unpaid as of December 31, 2024. In 2024, we retired approximately 18.7 million shares of repurchased stock, and we held approximately 0.4 million shares of treasury stock as of December 31, 2024.\nIn 2023, we completed the 2021 Share Repurchase Program with the repurchase of approximately 2.3 million shares for $155 million, and we repurchased 5.6 million shares under the 2022 Share Repurchase Program for $425 million.\nThe policies or laws of governments around the world can result in the imposition of taxes, duties, tariffs or other restrictions or regulatory requirements on imports and exports of raw materials, finished goods or services from a particular country or region of the world. The policies and laws of governments can also impact the subsidization of natural gas prices, and subsidies or quotas applied to domestic producers or farmers. Due to the critical role that fertilizers play in food production, the construction and operation of fertilizer plants often are influenced by economic, political and social objectives. Additionally, the import or export of fertilizer can be subject to local taxes imposed by governments which can have the effect of either encouraging or discouraging import and export activity. The impact of changes in governmental policies or laws or the political or social objectives of a country could have a material impact on fertilizer demand and selling prices and therefore could impact our liquidity. In addition, changing political leadership, including the new U.S. presidential administration and regulatory leadership, have proposed, and may propose further, policy, regulatory, and enforcement changes, which are and may continue to be subject to administrative and judicial challenges, that create additional uncertainty for our business.\nCF INDUSTRIES HOLDINGS, INC.\nCanada Revenue Agency Competent Authority Matter\nIn connection with the matter described above under “Items Affecting Comparability of Results—Canada Revenue Agency Competent Authority Matter,” in the third quarter of 2024, we were informed that the CRA granted us discretionary interest relief for certain tax years from 2006 through 2011. In the fourth quarter of 2024, we received interest relief from the CRA consisting of interest refunds of $21 million and related interest of $2 million. In addition, interest relief from the Alberta TRA is estimated to be approximately $16 million, consisting of interest refunds of $15 million and related interest of $1 million, based on current estimates and foreign currency exchange rates as of December 31, 2024. We expect to receive the interest refunds from the Alberta TRA in the first half of 2025.\nRepatriation of Foreign Earnings and Income Taxes\nWe have operations in Canada, the United Kingdom and a 50% interest in a joint venture in Trinidad. Historically, the estimated additional U.S. and foreign income taxes due upon repatriation of the earnings of these foreign operations to the United States were recognized in our consolidated financial statements as the earnings were recognized, unless the earnings were considered to be permanently reinvested based upon our then current plans. However, the cash payment of the income tax liabilities associated with repatriation of earnings from foreign operations occurred at the time of the repatriation. As a result, the recognition of income tax expense related to foreign earnings, as applicable, and the payment of taxes resulting from repatriation of those earnings could occur in different periods.\nIn light of changes made by the Tax Cuts and Jobs Act, commencing with the 2018 tax year, the United States no longer taxes earnings of foreign subsidiaries even when such earnings are earned or repatriated to the United States, unless such earnings are subject to U.S. rules on passive income or certain anti-abuse provisions. Foreign subsidiary earnings may still be subject to withholding taxes when repatriated to the United States.\nCash balances held by our joint venture are maintained at sufficient levels to fund local operations as accumulated earnings are repatriated from the joint venture on a periodic basis.\nAs of December 31, 2024, approximately $346 million of our consolidated cash and cash equivalents balance of $1.61 billion was held by our Canadian and United Kingdom subsidiaries. As of December 31, 2024, we recorded a deferred tax liability of $14 million on the undistributed earnings of our Canadian subsidiaries for which the Company does not have an indefinite reinvestment assertion. We have not provided for deferred taxes on the remainder of undistributed earnings from our foreign subsidiaries because such earnings would not give rise to additional tax liabilities upon repatriation.\nRevolving Credit Agreement\nWe have a senior unsecured revolving credit agreement (the Revolving Credit Agreement), which provides for a revolving credit facility of up to $750 million with a maturity of October 26, 2028 and includes a letter of credit sub-limit of $125 million. Borrowings under the Revolving Credit Agreement may be used for working capital, capital expenditures, acquisitions, share repurchases and other general corporate purposes. CF Industries is the lead borrower, and CF Holdings is the sole guarantor, under the Revolving Credit Agreement.\nBorrowings under the Revolving Credit Agreement can be denominated in U.S. dollars, Canadian dollars, euros and British pounds. Borrowings in U.S. dollars bear interest at a per annum rate equal to, at our option, an applicable adjusted term Secured Overnight Financing Rate or base rate plus, in either case, a specified margin. We are required to pay an undrawn commitment fee on the undrawn portion of the commitments under the Revolving Credit Agreement and customary letter of credit fees. The specified margin and the amount of the commitment fee depend on CF Holdings’ credit rating at the time.\nThe Revolving Credit Agreement contains representations and warranties and affirmative and negative covenants, including one financial covenant. The financial covenant requires that the total net leverage ratio (as defined in the Revolving Credit Agreement) be not greater than 3.75:1.00 (the Maximum Total Net Leverage Ratio) as of the last day of each fiscal quarter, provided that, if any borrower or subsidiary consummates a material acquisition during any fiscal quarter, CF Industries may elect to increase the Maximum Total Net Leverage Ratio to 4.25:1.00 for the period of four consecutive fiscal quarters commencing with such fiscal quarter (and no further such election may be made unless and until the Maximum Total Net Leverage Ratio is less than or equal to 3.75:1.00 as of the end of two consecutive fiscal quarters after",
  "item2_clean": null
}