{
  "source_file": "cfg-20250930.htm",
  "form_type": "10-Q",
  "item1_clean": null,
  "item7_clean": null,
  "item2_clean": "Results of Operations\nAnalysis of Financial Condition\nCritical Accounting Estimates\nAccounting and Reporting Developments\nNon-GAAP Financial Measures\nCitizens Financial Group, Inc. | 5\nFORWARD-LOOKING STATEMENTS\nThis document contains forward-looking statements within the meaning of the Private Securities Litigation Reform Act of 1995. Any statement that does not describe historical or current facts is a forward-looking statement. These statements often include the words “believes,” “expects,” “anticipates,” “estimates,” “intends,” “plans,” “goals,” “targets,” “initiatives,” “potentially,” “probably,” “projects,” “outlook,” “guidance” or similar expressions or future conditional verbs such as “may,” “will,” “likely,” “should,” “would,” and “could.”\nForward-looking statements are based upon the current beliefs and expectations of management, and on information currently available to management. Our statements speak as of the date hereof, and we do not assume any obligation to update these statements or to update the reasons why actual results could differ from those contained in such statements in light of new information or future events. We caution you, therefore, against relying on any of these forward-looking statements. They are neither statements of historical fact nor guarantees or assurances of future performance. While there is no assurance that any list of risks and uncertainties or risk factors is complete, important factors that could cause actual results to differ materially from those in the forward-looking statements include the following, without limitation:\nNegative economic, business, and political conditions, including as a result of the interest rate environment, supply chain disruptions, tariffs, inflationary pressures, and labor shortages that adversely affect the general economy, housing prices, the job market, consumer confidence, and spending habits;\nThe general state of the economy and employment, as well as general business and economic conditions, and changes in the competitive environment;\nOur capital and liquidity requirements under regulatory standards and our ability to generate capital and liquidity on favorable terms;\nThe effect of changes in our credit ratings on our cost of funding, access to capital markets, ability to market our securities, and overall liquidity position;\nThe effect of changes in the level of commercial and consumer deposits on our funding costs and net interest margin;\nOur ability to execute on our strategic business initiatives and achieve our financial performance goals across our Consumer and Commercial businesses, including our Private Bank;\nThe effects of geopolitical instability, including the wars in Ukraine and the Middle East, on economic and market conditions, inflationary pressures and the interest rate environment, commodity price and foreign exchange rate volatility, and heightened cybersecurity risks;\nOur ability to comply with heightened supervisory requirements and expectations as well as new or amended regulations;\nLiabilities and business restrictions resulting from litigation and regulatory investigations;\nThe effect of changes in interest rates on our net interest income, net interest margin, mortgage originations, mortgage servicing rights, and mortgages held for sale;\nChanges in interest rates and market liquidity, as well as the magnitude of such changes, which may reduce interest margins, impact funding sources, and affect the ability to originate and distribute financial products in the primary and secondary markets;\nFinancial services reform and other current, pending, or future legislation or regulation that could have a negative effect on our revenue and businesses;\nEnvironmental risks, such as physical or transition risks associated with climate change, and social and governance risks that could adversely affect our reputation, operations, business, and customers;\nA failure in, or breach of, our compliance with laws, as well as operational or security systems or infrastructure, or those of our third-party vendors or other service providers, including as a result of cyberattacks; and\nManagement’s ability to identify and manage these and other risks.\nCitizens Financial Group, Inc. | 6\nIn addition to the above factors, we also caution that the actual amounts and timing of any future common stock dividends or share repurchases will be subject to various factors, including our capital position, financial performance, balance sheet growth, market conditions, and regulatory considerations, as well as any other factors that our Board of Directors deems relevant in making such a determination. Therefore, there can be no assurance that we will repurchase shares from, or pay any dividends to, holders of our common stock, or as to the amount of any such repurchases or dividends.\nINTRODUCTION\nCitizens Financial Group, Inc. is one of the nation’s oldest and largest financial institutions, with $222.7 billion in assets as of September 30, 2025. Headquartered in Providence, Rhode Island, we offer a broad range of retail and commercial banking products and services to individuals, small businesses, middle-market companies, large corporations, and institutions. We help our customers reach their potential by listening to them and by understanding their needs in order to offer tailored advice, ideas, and solutions. In Consumer Banking, we provide an integrated experience that includes mobile and online banking, a full-service customer contact center, and the convenience of approximately 3,100 ATMs and approximately 1,000 branches in 14 states and the District of Columbia. Consumer Banking products and services include a full range of banking, lending, savings, wealth management, and small business offerings. In Commercial Banking, we offer a broad complement of financial products and solutions, including lending and leasing, deposit and treasury management services, foreign exchange, interest rate and commodity risk management solutions, as well as loan syndication, corporate finance, merger and acquisition, and debt and equity capital markets capabilities.\nEXECUTIVE SUMMARY\nThis summary highlights select financial information of the Company as well as information regarding certain significant events and transactions occurring during the nine months ended September 30, 2025. This summary should be read in conjunction with this entire document for a more complete understanding of trends, events, commitments, uncertainties, liquidity, capital resources, and critical accounting policies and estimates. Each of these items, taken individually or collectively, could have an impact on the Company’s financial condition, results of operations, and cash flows. For additional information regarding our financial performance and condition, see “Results of Operations” and “Analysis of Financial Condition.”\nKey Financial Highlights\nNet income of $494 million and $1.3 billion for the three and nine months ended September 30, 2025, respectively, increased $112 million and $195 million, with earnings per diluted common share up $0.28 to $1.05 and up $0.54 to $2.74, compared to the same periods in 2024.\nNet interest income of $1.5 billion and $4.3 billion for the three and nine months ended September 30, 2025, respectively, increased $119 million and $95 million compared to the same periods in 2024, driven by higher net interest margin reflecting lower funding costs, the time-based benefits of the Non-Core portfolio runoff, terminated swap impacts, and fixed-rate asset repricing benefits.\nNet interest margin on an FTE basis of 3.00% and 2.95% for the three and nine months ended September 30, 2025, respectively, increased 23 basis points and 10 basis points compared to the same periods in 2024, driven by lower funding costs, the time-based benefits of the Non-Core portfolio runoff, terminated swap impacts, and fixed-rate asset repricing benefits.\nNoninterest income of $630 million and $1.8 billion for the three and nine months ended September 30, 2025, respectively, increased $98 million and $172 million compared to the same periods in 2024, primarily driven by higher wealth, mortgage banking, capital markets, and service charge fees.\nCitizens Financial Group, Inc. | 7\nNoninterest expense of $1.3 billion and $4.0 billion for the three and nine months ended September 30, 2025, respectively, increased $76 million and $50 million compared to the same periods in 2024, driven by salaries and employee benefits reflecting hiring related to the Private Bank and Private Wealth build-out, strong capital markets fee performance, and increased medical benefit costs. The increase during the nine-month period was partially offset by a decline in other operating expense primarily driven by lower FDIC deposit insurance costs.\nProvision expense of $154 million and $471 million for the three and nine months ended September 30, 2025, respectively, decreased $18 million and $54 million compared to the same periods in 2024, reflecting runoff of the Non-Core portfolio and improving loan mix.\nThe efficiency ratio of 63.03% and 65.16% for the three and nine months ended September 30, 2025, respectively, compared to 66.23% and 67.28% for the same periods in 2024.\nROTCE of 11.75% and 10.84% for the three and nine months ended September 30, 2025, respectively, compared to 9.45% and 9.63% for the same periods in 2024.\nTangible book value per common share of $36.73 increased 14% from December 31, 2024, driven by a decrease in common shares outstanding of nine million and a net increase in tangible common equity of $1.6 billion. The increase in tangible common equity is primarily attributable to increases in AOCI of $1.3 billion and retained earnings of $644 million, including net income of $1.3 billion for the nine months ended September 30, 2025.\nSee “Non-GAAP Financial Measures” for more information regarding the ROTCE and tangible book value per common share non-GAAP financial measures prese"
}