{
  "source_file": "cfg-20241231.htm",
  "form_type": "10-K",
  "item1_clean": "retail and commercial non-branch offices, though certain lines of business serve national markets. At December 31, 2024, we had total assets of $217.5 billion, total deposits of $174.8 billion and total stockholders’ equity of $24.3 billion.\nWe are a BHC incorporated under Delaware state law in 1984 and our primary federal regulator is the FRB. CBNA is our banking subsidiary, whose primary federal regulator is the OCC.\nWe manage our business through two primary business segments: Consumer Banking and Commercial Banking. Our activities outside these segments are classified as Non-Core or Other. Non-Core includes our indirect auto and certain purchased consumer loan portfolios that we discontinued the origination of in 2023 as part of our balance sheet optimization strategy. Other includes treasury activities, wholesale funding, the securities portfolio, community development assets, and other unallocated assets, liabilities, capital, revenues, provision (benefit) for credit losses and expenses, including income tax expense. For additional information regarding our business segments see the “Business Operating Segments” section of Item 7 and Note 26 in Item 8.\nConsumer Banking Segment\nConsumer Banking serves consumer customers and small businesses, with products and services that include deposits, mortgage and home equity lending, credit cards, small business loans, and wealth management and investment services largely across our 14-state traditional banking footprint. We also offer education and point-of-sale finance loans in addition to select digital deposit products nationwide. Citizens Private Bank integrates wealth management and banking services to serve high- and ultra-high-net-worth individuals and families, as well as businesses.\nConsumer Banking operates a multi-channel distribution network with a workforce of approximately 5,000 branch colleagues, 1,000 branches, including 143 in-store locations, and 3,100 ATMs. Our network includes approximately 1,000 specialists covering lending, savings and investment needs as well as a broad range of small business products and services. We serve customers on a national basis through telephone service centers and our online and mobile platforms where we offer customers the convenience of depositing funds, paying bills and transferring money between accounts and from person to person, as well as a host of other everyday transactions.\nCommercial Banking Segment\nCommercial Banking primarily serves companies and institutions and strives to be a trusted advisor to our clients and preferred provider for their banking needs. We offer a broad complement of financial products and solutions, including lending and leasing, deposit and treasury management services, foreign exchange, interest rate and commodity risk management solutions, as well as syndicated loans, corporate finance, mergers and acquisitions, and debt and equity capital markets capabilities.\nCommercial Banking is organized around client segments and their banking needs. Corporate Banking, Commercial Real Estate, Capital Markets and Advisory, and Treasury Solutions work together to understand client needs and provide comprehensive solutions to meet those needs. We acquire new clients through a coordinated approach to the market, leveraging deep industry knowledge in specialized banking groups and a geographic coverage model.\nCitizens Financial Group, Inc. | 6\nCorporate Banking serves commercial and industrial clients and corporate clients in the United States. In several areas, such as Aerospace, Defense and Government Services, Communications, Transportation and Logistics, Food and Restaurants, Human Capital Management, and Gaming we offer a more dedicated and tailored approach to better meet the unique needs of these client segments.\nCommercial Real Estate provides customized debt capital solutions for middle-market operators, institutional developers, investors, and REITs. Commercial Real Estate provides financing for projects primarily in the multi-family, office, industrial, retail, healthcare and hospitality sectors.\nCapital Markets and Advisory serves clients through key product groups including Corporate Finance, Capital Markets, and Global Markets. Corporate Finance provides advisory services to middle-market and mid-corporate clients, including mergers and acquisitions and capital structure advice. The team works closely with industry-sector specialists within capital markets to advise our clients. Corporate Finance also provides acquisition and follow-on financing for new and recapitalized portfolio companies of key sponsors, with services meeting the unique and time-sensitive needs of private equity firms, management companies and funds, and underwriting and portfolio management expertise for leveraged transactions and relationships. Capital Markets originates, structures and underwrites credit and equity facilities targeting middle-market, mid-corporate and private equity sponsors. They focus on offering value-added ideas to optimize their capital structures, including advising on and facilitating mergers and acquisitions, valuations, tender offers, financial restructurings, bond and equity underwriting, asset sales, divestitures and other corporate reorganizations and business combinations. Capital Markets also provides sales and trading across loan, fixed income and equity products, as well as other brokerage services including equity research. Global Markets provides foreign exchange, interest rate and commodities risk management services.\nThe Treasury Solutions product group supports Commercial Banking and certain small business clients with treasury management solutions, including domestic and international products and services related to receivables, payables, information reporting and liquidity management, as well as commercial credit cards and trade finance.\nOur mission is to help our customers, colleagues and communities reach their potential, and our vision is to become a top-performing bank distinguished by our customer-centric culture, mindset of continuous improvement, product innovation, and excellent capabilities. We strive to understand customer and client needs so we can tailor advice and solutions to help make them more successful. Our business strategy is designed to maximize the full potential of our business, drive sustainable growth and enhance profitability. Our success rests on our ability to distinguish ourselves as follows:\nMaintain a high-performing, customer-centric organization:\nWe continually strive to enhance our “customer-first” culture by emphasizing the “voice of the customer” to deliver the best possible banking experience. We seek to deepen relationships with our customers by offering a full suite of products designed to meet their unique needs. In addition, we are taking talent management to the next level, with a goal of attracting, developing and retaining great people, while ensuring strong leadership, teamwork, and a sense of empowerment, accountability and urgency.\nDevelop differentiated value propositions to acquire, deepen, and retain core customer segments:\nOur focus is on select customer segments where we believe we are well positioned to compete. In Consumer Banking, we focus on serving mass affluent and affluent customers, small businesses and high-net-worth individuals. Our Private Bank serves high- and ultra-high-net-worth individuals, family offices, private equity/venture capital firms, and business clients through integrated wealth management and banking services. In Commercial Banking, we focus on serving customers in the middle-market, mid-corporate, and select industry verticals. By developing differentiated and targeted value propositions, building our fee-based businesses and developing innovative product solutions, we believe we can attract new customers, deepen relationships with existing customers and deliver an enhanced customer experience.\nCitizens Financial Group, Inc. | 7\nBuild excellent capabilities designed to help us stand out from competitors:\nWe strive to deliver seamless, omni-channel experiences that allow customers to interact with us when, where and how they choose. We are enhancing capabilities in key areas including technology, payments, data and analytics, private bank and wealth, collections and fraud, and digital (mobile/online banking and omni-channel servicing). We are on a multi-year digital transformation journey across our Consumer and Commercial organizations to digitize end-to-end customer experiences and transform our marketing to drive consumer-direct acquisition in order to satisfy rapidly changing customer preferences. We strive to use advanced data analytics and artificial intelligence for personalization and to provide timely, insight-driven, tailored advice in order to deliver solutions to consumer and commercial customers throughout their lifecycles.\nOperate with financial discipline and a mindset of continuous improvement to self-fund investments:\nWe believe that continued focus on operational efficiency is critical to our future profitability and ability to continue to reinvest to drive future growth. We launched the first Tapping our Potential (“TOP”) initiative in 2014 and have launched additional programs in subsequent years. These programs are designed to transform how we operate and to improve the effectiveness, efficiency, and competitiveness of our franchise. Our TOP 9 program was completed in 2024, and we launched a TOP 10 program in 2025 to allow us to continue to self-fund investments.\nPrudently grow and optimize our balance sheet:\nWe operate with a strong balance sheet with regard to capital and liquidity, coupled with a well-defined and prudent risk appetite. We continue to focus on thoughtfully growing our balance sheet by actively managing capital and resource allocations towards relationships-oriented growth to generate attractive risk-adjusted returns. Our goal is to be good stewards of our resources and continue to rigorously evaluate our execution.\nModernize our technology and operational models to improve delivery, organizational agility and speed to market:\nWe are continuing to modernize our technology environment by strengthening our infrastructure and migrating applications to the cloud. We have deployed and scaled an agile operating model to improve our speed-to-market, deliver innovative products and services and strengthen collaboration across teams. We also continue to actively incubate new innovative ideas and harness external innovation through FinTech partnerships and access to venture capital firms to help deliver differentiated value-added experiences for our customers. We continue to experiment with and deploy transformative technologies like Machine Learning (ML) and Artificial Intelligence (AI/Gen AI) across our customer-facing businesses and functions to drive value-add impact and improved experiences for our colleagues and customers.\nEmbed risk management within our culture and operations:\nGiven that the quality of our risk management program directly affects our ability to execute our strategy, we continue to work to further strengthen our risk management culture. Moreover, we are committed to continuously enhancing our processes and talent, and to making improvements in the platform including ongoing investments in risk technology and frameworks. These actions are designed to support and enhance our risk management capabilities and regulatory profile.\nThe financial services industry is highly competitive. Our branch footprint is predominantly in the New England, Mid-Atlantic and Midwest regions, though certain lines of business serve national markets. Within these markets, we face competition from community banks, super-regional and national financial institutions, credit unions, savings and loan associations, mortgage banking firms, consumer finance companies, securities brokerage firms, insurance companies, money market f",
  "item7_clean": "Tangible book value per common share of $32.34 increased 5% from 2023.\nFor additional information regarding our financial performance, see “Results of Operations — 2024 compared with 2023” included in this report.\nCitizens Financial Group, Inc. | 40\nRESULTS OF OPERATIONS — 2024 compared with 2023\nNet interest income is our largest source of revenue and is the difference between the interest earned on interest-earning assets (generally loans and investment securities) and the interest expense incurred in connection with interest-bearing liabilities (generally deposits and borrowed funds). The level of our net interest income is primarily a function of the difference between the effective yield on our average interest-earning assets and the effective cost of our interest-bearing liabilities. Factors that influence our net interest income include, but are not limited to, the pricing and mix of interest-earning assets and interest-bearing liabilities which, in turn, are impacted by external factors such as economic conditions, competition for loans and deposits, the monetary policy of the FRB and market interest rates. For further discussion, refer to the “Market Risk” and “Risk Governance” sections of this report.\nCitizens Financial Group, Inc. | 41\nThe following table presents the major components of our net interest income. Average balance represents amortized cost, excluding the unamortized basis adjustments related to the transfer of certain HTM securities from AFS, and LHFS. The yield/rate is based on annualized interest income or expense for the periods presented and includes the impact of hedging activities associated with the respective asset and liability categories.\nTable 2: Major Components of Net Interest Income\nYear Ended December 31,\n(dollars in millions)\nInterest-bearing cash and due from banks and deposits in banks\nTaxable investment securities\nNon-taxable investment securities\nTotal investment securities\nCommercial and industrial\nCommercial real estate\nResidential mortgages\nTotal loans and leases\nInterest-earning assets\nNoninterest-earning assets\nLiabilities and Stockholders’ Equity\nChecking with interest\nTotal interest-bearing deposits\nShort-term borrowed funds\nLong-term borrowed funds\nTotal borrowed funds\nTotal interest-bearing liabilities\nNoninterest-bearing demand deposits\nOther noninterest-bearing liabilities\nStockholders’ equity\nTotal liabilities and stockholders’ equity\nInterest rate spread\nNet interest income and net interest margin\nNet interest income and net interest margin, FTE\nMemo: Total deposits (interest-bearing and noninterest-bearing demand)\nSee Note 1 for information regarding updates to the Consolidated Balance Sheets during 2024.\nNet interest income and net interest margin is presented on a FTE basis using the federal statutory tax rate of 21%. The FTE impact is predominantly attributable to commercial and industrial loans for the periods presented.\nNet interest income decreased $608 million, or 10%, compared to 2023, reflecting lower net interest margin and a decrease of 2% in average interest-earning assets.\nNet interest margin on a FTE basis decreased 25 basis points compared to 2023, reflecting higher funding and swap costs and the impact of building liquidity, partially offset by higher interest-earning-asset yields and the benefit of Non-Core portfolio runoff.\nCitizens Financial Group, Inc. | 42\nAverage interest-earning assets decreased $3.6 billion compared to 2023, driven by a decline in total loans and leases, partially offset by an increase in investment securities and cash held in interest-bearing deposits.\nAverage deposits were stable compared to 2023.\nAverage total borrowed funds decreased $2.5 billion compared to 2023, reflecting a decline in FHLB advances driven by Non-Core portfolio runoff, partially offset by a remix of funding to long-term senior debt and secured borrowings collateralized by loans.\nTable 3: Changes in Net Interest Income Due to Average Volume and Average Rate\nYear Ended December 31,\n(dollars in millions)\nInterest-bearing cash and due from banks and deposits in banks\nTaxable investment securities\nNon-taxable investment securities\nTotal investment securities\nCommercial and industrial\nCommercial real estate\nResidential mortgages\nTotal loans and leases\nTotal interest income\nChecking with interest\nTotal interest-bearing deposits\nShort-term borrowed funds\nLong-term borrowed funds\nTotal borrowed funds\nTotal interest expense\nVolume and rate changes are allocated on a consistent basis using the respective percentage changes in average balances and average rates.\nSee Note 1 for information regarding updates to the Consolidated Balance Sheets during 2024.\nCitizens Financial Group, Inc. | 43\nTable 4: Noninterest Income\nYear Ended December 31,\n(dollars in millions)\nService charges and fees\nCapital markets fees\nMortgage banking fees\nForeign exchange and derivative products\nLetter of credit and loan fees\nSecurities gains, net\nSee Note 1 for information regarding updates to the Consolidated Statements of Operations during 2024.\nIncludes bank-owned life insurance income and other income for all periods presented.\nThe primary drivers for the change in noninterest income for the year ended December 31, 2024, compared to 2023, are described below.\nCapital markets fees increased given higher underwriting, M&A advisory and loan syndication fees.\nCard fees increased driven primarily by higher credit card fees, including favorable vendor contract negotiations.\nWealth fees reflect increased sales activity and higher asset management fees.\nForeign exchange and derivative products revenue decreased given reduced client activity related to interest rate and commodities hedging.\nMortgage banking fees declined reflecting lower production and servicing fees and a decline in MSR valuation, net of hedge impact.\nTable 5: Noninterest Expense\nYear Ended December 31,\n(dollars in millions)\nSalaries and employee benefits\nEquipment and software\nOther operating expense\nThe decrease in noninterest expense for the year ended December 31, 2024, compared to 2023, was driven primarily by other operating expense associated with FDIC deposit insurance, reflecting an estimate of CBNA’s special assessment of $31 million and $225 million, respectively, recognized in 2024 and 2023. Other operating expense also reflects lower fraud losses and marketing and travel-related expenses. These decreases were partially offset by salaries and employee benefits reflecting hiring related to our Private Bank and Private Wealth build-out and commercial middle market bankers in expansion markets, and equipment and software given technology investments and maintenance.\nFor more information regarding CBNA’s special assessment, see “Regulation and Supervision - Deposit Insurance” in Item 1.\nCitizens Financial Group, Inc. | 44\nProvision for Credit Losses\nThe provision for credit losses is the result of a detailed analysis performed to estimate our ACL. The total provision for credit losses includes the provision for loan and lease losses and the provision for unfunded commitments. Refer to “Analysis of Financial Condition — Credit Quality” for more information.\nProvision expense of $687 million for 2024 was stable compared to 2023. The provision expense for 2024 reflects higher reserves against the CRE office portfolio, primarily driven by elevated interest rates and return-to-office dynamics and unsecured products and education loans given recent inflationary pressures and government actions, partially offset by a decline in total loans and leases.\nIncome tax expense of $379 million decreased $43 million and our effective income tax rate of 20.1% decreased from 20.8% compared to 2023. These decreases reflect a higher benefit from tax-advantaged investments.\nBusiness Operating Segments\nWe have three business operating segments: Consumer Banking, Commercial Banking, and Non-Core. See Note 26 for more information regarding our business operating segments.\nThe following table presents certain financial data of our business operating segments. Total business operating segment financial results differ from total consolidated financial results. These differences are reflected in Other non-segment operations.\nTable 6: Selected Financial Data for Business Operating Segments\nYear Ended December 31,\nYear Ended December 31,\nYear Ended December 31,\n(dollars in millions)\nProfit (loss) before credit losses\nIncome (loss) before income tax expense (benefit)\nIncome tax expense (benefit)\nTotal loans and leases\nInterest-earning assets\n\n$54 million compared to 2023\ndriven primarily by salaries and employee benefits reflecting lower headcount.\nNet charge-offs increased $103 million compared to 2023, driven by the office segment of CRE, partially offset by a decline in commercial and industrial.\nNet interest income increased $12 million compared to 2023, driven by a decline in funding costs relative to the highest-cost marginal funding sources during 2024, including secured borrowings collateralized by auto loans and FHLB advances.\nAverage loans and leases decreased $4.8 billion compared to 2023, driven by planned Non-Core portfolio runoff.\nRESULTS OF OPERATIONS — 2023 compared with 2022\nCitizens Financial Group, Inc. | 46\nANALYSIS OF FINANCIAL CONDITION\nTable 7: Amortized Cost and Fair Value of Securities\n(dollars in millions)\nU.S. Treasury and other\nState and political subdivisions\nMortgage-backed securities:\nFederal agencies and U.S. government sponsored entities\nTotal mortgage-backed securities\nCollateralized loan obligations\nTotal debt securities available for sale\nMortgage-backed securities:\nFederal agencies and U.S. government sponsored entities\nTotal mortgage-backed securities\nAsset-backed securities\nTotal debt securities held to maturity\nTotal debt securities available for sale and held to maturity\nEquity securities, at cost\nEquity securities, at fair value\nExcludes portfolio level basis adjustments of $(75) million and $60 million, respectively, for securities designated in active fair value hedge relationships under the portfolio layer method at December 31, 2024 and 2023.\nIncluded in other assets in the Consolidated Balance Sheets.\nThe primary objective of our securities portfolio is to provide a readily available source of liquidity. The portfolio primarily includes high quality, highly liquid investments reflecting our ongoing commitment to maintain strong contingent liquidity levels and pledging capacity.\nAs of December 31, 2024, U.S. Treasuries and mortgage-backed securities issued by GNMA and GSEs represented 98% of the fair value of our debt securities portfolio, with approximately $36.0 billion of unencumbered high-quality liquid securities serving as potential collateral for borrowings from the FHLB, FRB discount window, and the Fixed Income Clearing Corporation bilateral repurchase agreement market.\nFor further discussion of the use of our securities as liquidity collateral and liquidity requirements, see the “Liquidity Risk Management and Governance” and “Regulation and Supervision — Liquidity Requirements” sections in this document.\nWe manage our securities portfolio duration and convexity risk through asset selection and securities structure, and maintain duration levels within our risk appetite in the context of our broader interest rate risk framework and limits. As of December 31, 2024, the portfolio’s average effective duration, including recent hedging actions to reduce duration, was 3.7 years compared to 3.9 years as of December 31, 2023.\nCitizens Financial Group, Inc. | 47\nTable 8: Amortized Cost of AFS and HTM Securities by Contractual Maturity\nAs of December 31, 2024\nDistribution of Maturities\nAfter 1 Year Through 5 Years\nAfter 5 Years Through 10 Years\n(dollars in millions)\nU.S. Treasury and other\nState and political subdivisions\nMortgage-backed securities:\nFederal agencies and U.S. government sponsored entities\nCollateralized loan obligations\nTotal debt securities available for sale\nMortgage-backed securities:\nFederal agencies and U.S. government sponsored entities\nAsset-backed securities\nTotal debt securities held to maturity\nTotal debt securities\nActual maturities may differ from contractual maturities because issuers may have the right to call or prepay obligations with or without incurring penalties.\nThe weighted-average yield is computed based on a constant effective interest rate over the contractual life of each security and considers the contractual\ncoupon, amortization of premiums and accretion of discounts. Yields exclude the impact of related hedging derivatives.\nTable 9: Composition of Loans and Leases, Excluding LHFS\n(dollars in millions)\nCommercial and industrial\nCommercial real estate\nResidential mortgages\nTotal loans and leases\nSee Note 1 for a description of changes made to the Company’s loans and leases presentation during 2024.\nThe decrease in total loans and leases as of December 31, 2024 compared to December 31, 2023 reflects a $4.7 billion decrease in commercial given market conditions resulting in relatively low client demand and lower line of credit utilization, partially offset by growth in the Private Bank. Retail decreased $2.1 billion, primarily driven by planned Non-Core portfolio runoff, partially offset by growth in home equity and mortgage, including the Private Bank.\nCitizens Financial Group, Inc. | 48\nTable 10: Fixed and Variable Rate Loans and Leases by Maturity\n(dollars in millions)\nAfter 1 Year Through 5 Years\nAfter 5 Years Through 15 Years\nTotal Loans and Leases\nCommercial and industrial\nCommercial real estate\nTotal commercial fixed rate\nCommercial and industrial\nCommercial real estate\nTotal commercial variable rate\nResidential mortgages\nTotal retail fixed rate\nResidential mortgages\nTotal retail variable rate\nTotal loans and leases\nMaturity is based on scheduled principal repayment date.\nIncludes floating-rate commercial loans hedged to fixed rate to manage our exposure to the variability in interest cash flows. See “Market Risk” for additional information regarding our use of interest rate derivatives to hedge our loan portfolio.\nCitizens Financial Group, Inc. | 49\nSee Note 1 for a description of changes made to the Company’s loans and leases presentation during 2024.\nThe ACL is comprised of the ALLL and the allowance for unfunded lending commitments. As described in Note 6, the ACL is maintained at a level the Company believes to be appropriate to absorb expected lifetime credit losses over the contractual life of a loan or lease and on unfunded lending commitments, inclusive of recoveries. We consider extensive historical loss experience, including the impact of loss mitigation and restructuring programs that we offer to borrowers experiencing financial difficulty, as well as projected loss severity as a result of loan default.\nManagement evaluates the appropriateness of the ACL on a quarterly basis. The evaluation of both quantitative and qualitative information is performed by assessing groups of assets that share similar risk characteristics as well as certain individual loans and leases that do not share similar risk characteristics with the collective group. Loans are generally grouped by product type and are assessed for credit losses using econometric models.\nThe quantitative evaluation of the adequacy of the ACL utilizes a single economic forecast as its foundation and is primarily based on econometric models that use known or estimated data as of the balance sheet date and forecasted data over the reasonable and supportable period. Known and estimated data include current PD, LGD and EAD for commercial loans, timing and amount of expected draws for unfunded lending commitments, and FICO, LTV, and term for retail loans. The mix and level of loan balances, delinquency levels, assigned risk ratings, previous loss experience, current business conditions, amount and timing of expected future cash flows, and factors specific to commercial",
  "item2_clean": null
}