{
  "source_file": "chtr-20241231.htm",
  "form_type": "10-K",
  "item1_clean": "We believe that offering a wide variety of video programming choices influences a customer’s decision to subscribe to and retain our video and Internet services. We obtain basic and premium programming, usually pursuant to written contracts from a number of suppliers. We have also been successful in obtaining access to the related programmer streaming applications pursuant to those contracts. Media corporation and broadcast station group consolidation has, however, resulted in fewer suppliers and additional selling power on the part of programming suppliers.\nProgramming is usually made available to us for a license fee, which is generally paid based on the number of customers to whom we make that programming available. Programming license fees may include various discounts such as “volume” discounts and other financial incentives and/or ongoing marketing support, as well as discounts for service penetration. We receive revenue to carry home shopping channels. We also offer VOD and pay-per-view channels of movies and events that are subject to a revenue split with the content provider.\nResidential Services\nWe face intense competition for residential customers, both from existing competitors and, as a result of the rapid development of new technologies, services and products, from new entrants.\nInternet Competition\nOur residential Internet service faces competition across our footprint from fiber-to-the-home (\"FTTH\"), fixed wireless broadband, Internet delivered via satellite and DSL services. AT&T Inc. (\"AT&T\"), Frontier Communications Corporation (“Frontier”) and Verizon are our primary FTTH competitors and several of these FTTH competitors deliver 1 Gbps broadband speed (and some deliver multi Gbps) in at least a portion of their footprints which overlap our footprint. Additionally, several national mobile network operators offer long-term evolution (“LTE”) or 5G delivered cell phone home Internet service (fixed wireless access from cell phone towers) in our markets. In several markets, we also face competition from one or more fixed wireless providers that deliver point-to-point Internet connectivity. DSL service is offered across our footprint often at prices lower than our Internet services, although typically at speeds much lower than the minimum speeds we offer as part of our Spectrum pricing and packaging. In addition, commercial areas, such as retail malls, restaurants and airports, offer WiFi Internet service. Numerous local governments are also considering or actively pursuing publicly subsidized WiFi Internet access networks. In addition, providers are constructing open access networks that can deliver services from multiple underlying Internet service providers. These options offer alternatives to cable-based Internet access. We face terrestrial broadband Internet (defined by the FCC as at least 100 Mbps) competition from three primary competitors, AT&T, Frontier and Verizon, in approximately 25%, 9% and 6% of our operating footprint, respectively.\nOur residential video service faces growing competition across our footprint from a number of other sources, including companies that deliver linear network programming, movies and television shows on demand and other video content over broadband Internet connections to televisions, computers, tablets and mobile devices. Increasingly, exclusive television content, including marquee content like live sporting events, is becoming available from sources other than traditional MVPDs. These competitors include virtual MVPDs such as YouTube TV, Hulu Live, Sling TV, Philo and DirecTV Stream. Other online video business models and products have also developed, some offered by programmers, including, (i) subscription video on demand (“SVOD”) services such as Netflix, Apple TV+, Amazon Prime and Hulu Plus, (ii) programmer streaming applications such as Max, Disney+, Peacock and Paramount+, (iii) ad-supported free online video products, including YouTube and Pluto TV, some of which offer programming for free to consumers that we currently purchase for a fee, (iv) pay-per-view products, such as iTunes, and (v) additional offerings from mobile providers which continue to integrate and bundle video services and mobile products. Historically, we have generally viewed SVOD online video services as complementary to our own video offering and, in the case of programmer streaming applications, we are packaging with the linear offerings. However, services from virtual MVPDs and programmer streaming applications, as well as piracy and password sharing, negatively impact the number of customers purchasing our video product.\nOur residential video service also faces competition from DBS service providers, which have a national footprint and compete in all of our operating areas. DBS providers offer satellite-delivered pre-packaged programming services that can be received by relatively small and inexpensive receiving dishes. DBS providers offer aggressive promotional pricing and video services\nthat are comparable in many respects to our residential video service. Our residential video service also faces competition from large telecommunications companies, primarily Verizon, which offer wireline video services in significant portions of our operating areas.\nOur mobile service faces competition from national mobile network operators including AT&T, Verizon and T-Mobile US, Inc. (\"T-Mobile\"), as well as a variety of regional operators and mobile virtual network operators. Most carriers offer unlimited data packages to customers while some also offer free or highly discounted devices. Various operators also offer wireless Internet services delivered over networks which they continue to enhance to deliver faster speeds. AT&T, Verizon and T-Mobile continue to expand 5G mobile services, and consolidations in the telecom industry continue to increase competition as they seek to offer converged connectivity services similar to ours. We also compete for retail activations with other resellers that buy bulk wholesale service from wireless service providers for resale.\nOur residential voice service competes with wireless and wireline phone providers across our footprint, as well as other forms of communication, such as text messaging on cellular phones, instant messaging, social networking services, video conferencing and email. We also compete with “over-the-top” phone providers as well as companies that sell phone cards at a cost per minute for both national and international service. The increase in the number of different technologies capable of carrying voice services and the number of alternative communication options available to customers as well as the replacement of wireline services by wireless have intensified the competitive environment in which we operate our residential voice service.\nAdditional Competition\nIn some of our operating areas, other regional competitors have built networks that offer Internet, video, mobile and voice services that compete with our services. We also compete with other sources of news, information and entertainment, including over-the-air television broadcast reception, live events, movie theaters and the Internet. Competition is also posed by fixed wireless and satellite master antenna television systems serving MDUs, such as condominiums, apartment complexes, and private residential communities.\nWe face intense competition across each of our business services product offerings. Our SMB Internet, video, mobile and voice services face competition from a variety of providers as described above. Our enterprise solutions face competition from the competitors described above as well as cloud-based application-service providers, managed service providers and other telecommunications carriers, such as metro and regional fiber-based carriers.\n\nSMB\nSMB\nTotal Voice Customers\nEnterprise Primary Service Units (\"PSUs\")\nWe calculate the aging of customer accounts based on the monthly billing cycle for each account in accordance with our collection policies. On that basis, as of December 31, 2024 and 2023, customers include approximately 102,500 and 135,800 customers, respectively, whose accounts were over 60 days past due, approximately 12,100 and 54,700 customers, respectively, whose accounts were over 90 days past due, and approximately 13,600 and 286,000 customers, respectively, whose accounts were over 120 days past due. The decrease in accounts past due is predominately due to revisions to customer account balances associated with the end of the Federal Communications Commission's (“FCC”) Affordable Connectivity Program (\"ACP\"), including balance write-offs and conversion to payment plans.\nCustomer relationships include the number of customers that receive one or more levels of service, encompassing Internet, video, mobile and voice services, without regard to which service(s) such customers receive. Customers who reside in residential multiple dwelling units (“MDUs”) and that are billed under bulk contracts are counted based on the number of billed units within each bulk MDU. Total customer relationships exclude enterprise and mobile-only customer relationships.\nMonthly residential revenue per residential customer is calculated as total residential annual revenue divided by twelve divided by average residential customer relationships during the respective year and excludes mobile-only customers.\nMonthly SMB revenue per SMB customer is calculated as total SMB annual revenue divided by twelve divided by average SMB customer relationships during the respective year and excludes mobile-only customers.\nMobile lines include phones and tablets which require one of our standard rate plans (e.g., \"Unlimited\" or \"By the Gig\"). Mobile lines exclude wearables and other devices that do not require standard phone rate plans.\nEnterprise PSUs represent the aggregate number of fiber service offerings counting each separate service offering at each customer location as an individual PSU.\nResidential Services\nConnectivity Services\nWe provide our customers with a suite of broadband connectivity services, including fixed Internet, WiFi and mobile, which when bundled together provides our customers with a differentiated converged connectivity experience while saving consumers money.\nWe offer Spectrum Internet products with speeds up to 1 Gbps across our entire footprint. Spectrum Internet bundled with our in-home Advanced WiFi allows multiple people within a single household to stream high definition (“HD”) video content while simultaneously using our Internet service for other purposes including two-way video conferencing, gaming and virtual reality, among other things.\nOur in-home WiFi product provides our Internet customers with high performance wireless routers and a managed WiFi service to maximize their wireless Internet experience. We offer Advanced WiFi service across all of our footprint along with WiFi 6E routers capable of delivering speeds over 2 Gbps. In 2024, we began offering WiFi 7 routers capable of delivering speeds over 10 Gbps. With Advanced WiFi, customers enjoy a cloud-optimized WiFi connection and have the ability to view and control their WiFi network through our Spectrum app (“My Spectrum\nApp”). The service enables parental control schedules and Spectrum Security Shield which is automatically enabled and protects all devices in the home using network-based security. Customers also have the option to add Spectrum WiFi pods to Advanced WiFi. WiFi pods are small, discreet access points that plug into electrical outlets in the home, providing broader and more consistent WiFi coverage.\nWe also offer the capabilities of the Advanced WiFi service to MDUs as Advanced Community WiFi (“ACW”). With ACW, tenants receive the same visibility and control over their apartment’s WiFi networks through the My Spectrum App, while building managers are able to see and manage the entire building’s network through a purpose-built prop",
  "item7_clean": "Certain of our accounting policies require our management to make difficult, subjective and/or complex judgments. Management has discussed these policies with the Audit Committee of Charter’s Board of Directors, and the Audit Committee has reviewed the following disclosure. We consider the following policies to be the most critical in understanding the estimates, assumptions and judgments that are involved in preparing our financial statements, and the uncertainties that could affect our results of operations, financial condition and cash flows:\nCapitalization of labor and overhead costs\nDefined benefit pension plans\nCapitalization of labor and overhead costs\nCosts associated with network construction or upgrades, placement of the customer drop to the dwelling and the placement of outlets within a dwelling along with the costs associated with the deployment of new customer premise equipment necessary to provide Internet, video or voice services, are capitalized. Costs capitalized include materials, direct labor and certain indirect costs. These indirect costs consist of compensation and overhead costs associated with support functions. While our capitalization is based on specific activities, once capitalized, we track these costs on a composite basis by fixed asset category at the cable system level, and not on a specific asset basis. For assets that are sold or retired, we remove the estimated applicable cost and accumulated depreciation. The costs of disconnecting service and removing customer premise equipment from a dwelling and the costs to reconnect a customer drop or to redeploy previously installed customer premise equipment are charged to operating expense as incurred. Costs for repairs and maintenance are charged to operating expense as incurred, while plant and equipment replacement, including replacement of certain components, betterments, and replacement of cable drops and outlets, are capitalized.\nWe make judgments regarding the installation and construction activities to be capitalized. We capitalized direct labor and overhead of $2.4 billion and $2.3 billion for the years ended December 31, 2024 and 2023, respectively. We capitalize direct labor and overhead using standards developed from actual costs and applicable operational data. We calculate standards annually (or more frequently if circumstances dictate) for items such as the labor rates, overhead rates, and the actual amount of time required to perform a capitalizable activity. For example, the standard amounts of time required to perform capitalizable activities are based on studies of the time required to perform such activities. Overhead rates are established based on an analysis of the nature of costs incurred in support of capitalizable activities, and a determination of the portion of costs that is directly attributable to capitalizable activities. The impact of changes that resulted from these studies were not material in the periods presented.\nLabor costs directly associated with capital projects are capitalized. Capitalizable activities performed in connection with installations include such activities as:\ndispatching a “truck roll” to the customer’s dwelling or business for service connection or placement of new equipment;\ncosts to package and ship new equipment to a customer's home for self-installation;\nverification of serviceability to the customer’s dwelling or business (i.e., determining whether the customer’s dwelling is capable of receiving service by our cable network);\ncustomer premise activities performed by in-house field technicians and third-party contractors in connection with the installation, replacement and betterment of equipment and materials to enable Internet, video or voice services; and\nverifying the integrity of the customer’s network connection by initiating test signals downstream from the headend to the customer premise equipment, as well as testing signal levels at the utility pole or pedestal.\nJudgment is required to determine the extent to which overhead costs incurred result from specific capital activities, and therefore should be capitalized. The primary costs that are included in the determination of the overhead rate are (i) employee benefits and payroll taxes associated with capitalized direct labor, (ii) direct variable costs associated with capitalizable activities, (iii) the cost of support personnel, such as care personnel and dispatchers, who assist with capitalizable installation activities, and (iv) indirect costs directly attributable to capitalizable activities.\nWhile we believe our existing capitalization policies are appropriate, a significant change in the nature or extent of our operating practices could affect management’s judgment about the extent to which we should capitalize direct labor or overhead in the future. We monitor the appropriateness of our capitalization policies and perform updates to our internal studies on an ongoing basis to determine whether facts or circumstances warrant a change to our capitalization policies.\nWe recognize deferred tax assets and liabilities for temporary differences between the financial reporting basis and the tax basis of our assets and liabilities and expected benefits of utilizing loss carryforwards, including indefinite lived carryovers such as the Section 163(j) interest limitation. Valuation allowances are established when management determines that it is more likely than not that some portion or the entire deferred tax asset will not be realized. In evaluating the need for a valuation allowance, management takes into account various factors, including the expected level of future taxable income, available tax planning strategies and reversals of existing taxable temporary differences. The impact on deferred taxes of changes in tax rates and tax law, if any, applied to the years during which temporary differences are expected to be settled, are reflected in the consolidated financial statements in the period of enactment. In determining our tax provision for financial reporting purposes, we establish a\nreserve for uncertain tax positions unless such positions are determined to be “more likely than not” of being sustained upon examination, based on their technical merits. There is considerable judgment involved in making such a determination. We recognize interest and penalties accrued on uncertain income tax positions as part of the income tax provision. See Note 16 to the accompanying consolidated financial statements contained in “Part II. Item 8. Financial Statements and Supplementary Data” for additional discussion.\nDefined benefit pension plans\nWe sponsor qualified and unqualified defined benefit pension plans that provide pension benefits to a majority of employees who were employed by TWC before the merger with TWC. As of December 31, 2024, the accumulated benefit obligation and fair value of plan assets was $2.2 billion and $2.3 billion, respectively, and the net funded asset was recorded as a $125 million noncurrent asset, $3 million current liability and $15 million long-term liability. As of December 31, 2023, the accumulated benefit obligation and fair value of plan assets was $2.4 billion and $2.6 billion, respectively, and the net funded asset was recorded as a $149 million noncurrent asset, $3 million current liability and $19 million long-term liability. In June 2023, we purchased a buy-in group annuity contract from a highly rated insurer and in October 2023, we announced plans to fully terminate the qualified pension plan. The benefit obligation for the qualified pension plan is determined on a plan termination basis for which it is assumed that a portion of eligible active and deferred vested participants will elect lump sum payments.\nPension benefits are based on formulas that reflect the employees’ years of service and compensation during their employment period. Actuarial gains or losses are changes in the amount of either the benefit obligation or the fair value of plan assets resulting from experience different from that assumed or from changes in assumptions. We have elected to follow a mark-to-market pension accounting policy for recording the actuarial gains or losses annually during the fourth quarter, or earlier if a remeasurement event occurs during an interim period. We use a December 31 measurement date for our pension plans.\nWe recognized net periodic pension cost of $23 million and $216 million in 2024 and 2023, respectively. Net periodic pension benefit or cost is determined using certain assumptions, including the expected long-term rate of return on plan assets, discount rate and mortality assumptions. We determined the discount rate used to compute pension cost based on the yield of a large population of high-quality corporate bonds with cash flows sufficient in timing and amount to settle projected future defined benefit payments. In developing the expected long-term rate of return on assets, we considered the current pension portfolio’s composition, past average rate of earnings, and our asset allocation targets. We used a discount rate of 5.08% to determine the December 31, 2024 pension plan benefit obligation. A decrease in the discount rate of 25 basis points would result in a $68 million increase in our pension plan benefit obligation as of December 31, 2024 and net periodic pension cost recognized in 2024 under our mark-to-market accounting policy. The expected long-term rate of return on plan assets used to determine net periodic pension benefit for the year ended December 31, 2025 is expected to be 5.00%. A decrease in the expected long-term rate of return of 25 basis points to 4.75%, while holding all other assumptions constant, would result in an increase in our 2025 net periodic pension cost of approximately $6 million. See Note 20 to the accompanying consolidated financial statements contained in “Part II. Item 8. Financial Statements and Supplementary Data” for additional discussion on these assumptions.\nResults of Operations\nThe following table sets forth the consolidated statements of operations for the periods presented (dollars in millions, except per share data):\nYear Ended December 31,\nOperating costs and expenses (exclusive of items shown separately below)\nDepreciation and amortization\nOther operating (income) expense, net\nIncome from operations\nOther Income (Expense):\nInterest expense, net\nIncome before income taxes\nConsolidated net income\nLess: Net income attributable to noncontrolling interests\nNet income attributable to Charter shareholders\nEARNINGS PER COMMON SHARE ATTRIBUTABLE TO CHARTER SHAREHOLDERS:\nWeighted average common shares outstanding, basic\nWeighted average common shares outstanding, diluted\n\nReference is made to “Part I. Item 1A. Risk Factors” and “Cautionary Statement Regarding Forward-Looking Statements,” which describe important factors that could cause actual results to differ from expectations and non-historical information contained herein. In addition, the following discussion should be read in conjunction with the audited consolidated financial statements and accompanying notes thereto of Charter included in “Part II. Item 8. Financial Statements and Supplementary Data.”\nWe are a leading broadband connectivity company and cable operator with services available to an estimated 57 million homes and businesses in 41 states through our Spectrum brand. Over an advanced communications network, we offer a full range of state-of-the-art residential and business services including Spectrum Internet, TV, Mobile and Voice. For small and medium-sized companies, Spectrum Business delivers the same suite of broadband products and services coupled with special features and applications to enhance productivity, while for larger businesses and government entities, Spectrum Enterprise provides highly customized, fiber-based solutions. Spectrum Reach delivers tailored advertising and production for the modern media landscape. We also distribute award-winning news coverage and sports programming to our customers through Spectrum Networks. See “Part I. Item 1. Business — Products and Services” for further description of these services, including customer statistics for different services.\nDuring the year ended December 31, 2024, we lost 508,000 Internet customers while adding 2,117,000 mobile lines. Our Internet customer growth was challenged by the end of the FCC’s ACP, lower customer move rates and the competitive environment. While our retention programs for the customers impacted by the end of ACP subsidies have been successful in retaining the vast majority of ACP customers, the end of the ACP subsidy program has been disruptive to our business and resulted in customer losses during the year. In September, Spectrum launched a new brand platform, Life Unlimited, which emphasizes the power of Spectrum’s advanced network and cutting-edge connectivity products and services along with a new and simplified pricing and packaging strategy that better utilizes its seamless connectivity and entertainment products to offer lower promotional and persistent bundled pricing to drive growth. Additionally, Spectrum announced new customer commitments focused on reliable connectivity, transparency, exceptional service and a focus on always improving.\nOur mobile line growth continued to benefit from our pricing and packaging strategy, including our Anytime Upgrade offering and Phone Balance Buyout program. Our Internet and mobile product bundles, including Spectrum One, provide a differentiated connectivity experience by bringing together Spectrum Internet, Advanced WiFi and Unlimited Spectrum Mobile to offer consumers fast, reliable and secure online connections on their favorite devices at home and on the go in high-value packages. Anytime Upgrade allows certain customers to upgrade their devices whenever they want, eliminating traditional wait times, upgrade fees and condition requirements. Our Phone Balance Buyout program makes switching mobile providers easier by helping customers pay off balances on ported lines.\nWe spent $2.2 billion on our subsidized rural construction initiative during the year ended December 31, 2024 and activated approximately 393,000 subsidized rural passings. We currently offer Spectrum Internet products with speeds up to 1 Gbps across our entire footprint. Our network evolution initiative is progressing. We are upgrading our network to deliver symmetrical and multi-gigabit speeds across our footprint and are now offering symmetrical speeds in all of our step 1 high split markets. In 2024, we began offering certain seamless entertainment applications including, among others, Max, Disney+, ESPN+, Paramount+, ViX Premium and Tennis Channel Plus to customers in certain packages and reached agreements with several other programmers that will add Discovery+, Peacock, AMC+ and BET+ in certain packages in 2025. We now have\ncompleted deals with every major programmer to deliver better flexibility and greater value to our customers by including seamless entertainment applications with our Spectrum TV services at no additional cost. We also continue to evolve our video product and are deploying Xumo stream boxes to new video customers. Xumo combines a live TV experience with access to hundreds of content applications, and features unified search and discovery, along with a curated content offering based on a customer’s interests and subscriptions. In September 2024, we launched our Life Unlimited brand platform which includes a new customer commitment that provides performance and service benchmarks and a new and simplified pricing structure designed to drive more value into our relationships.\nBy continually improving our product set and offering consumers the opportunity to save money by switching to our services, we believe we can continue to penetrate our expanding footprint and sell additional products to our existing customers. We see opera",
  "item2_clean": null
}