{
  "source_file": "ci-20241231.htm",
  "form_type": "10-K",
  "item1_clean": "We offer clinical programs to help our clients, including third-party administrators, drive better whole-person health outcomes through our Care Delivery (MD Live by Evernorth\n(\"MD Live\") virtual care, in-home care and physical primary care) and Care Management (EviCore by Evernorth\n(\"EviCore\"), benefits management, behavioral health services, network services and health coaching capabilities) offerings.\nClients and Customers\nWe provide products and services in the Evernorth Health Services segment to clients and customers, as described below.\nWe provide services to managed care organizations, health insurers, third-party administrators, employers, union-sponsored benefit plans, workers' compensation plans, government health programs, providers, clinics, hospitals and others. We provide services to a majority of clients in our Cigna Healthcare segment.\nPrescription drugs are dispensed to patients connected to the service offerings we provide to clients. Prescription drugs are dispensed primarily through networks of retail pharmacies under nonexclusive contracts with us and via home delivery pharmacies, including Express Scripts Pharmacy, and specialty pharmacies, including Accredo.\nEvernorth Health Services has three clients that each drive significant revenues for the segment:\nExpress Scripts and Centene Corporation (\"Centene\") have a multi-year agreement, which began January 1, 2024, to manage pharmacy benefit services for Centene's customers, providing them with access to the extensive Express Scripts national network of retail pharmacies.\nExpress Scripts and Prime Therapeutics LLC (\"Prime\") have an agreement to deliver improved choice and affordability for Prime's clients and customers by enhancing retail pharmacy networks, providing access to Accredo and Express Scripts Pharmacy, and providing pharmaceutical manufacturer value.\nThe Department of Defense (\"DoD\") TRICARE\nis the military health care program available to active-duty service members, active-duty family members, National Guard and Reserve members and their family members, retirees and retiree family members, survivors and certain former spouses.\nThe primary competitive factors in the industry include the ability to negotiate with retail pharmacies to ensure retail pharmacy networks meet the needs of clients and customers; provide home delivery and specialty pharmacy services; negotiate pricing of\nprescription drugs with drug manufacturers; manage cost and quality of specialty drugs; specialize in claim adjudication and benefit administration; improve access, outcomes, and efficiencies within the health care ecosystem; deliver quality primary and behavioral care in virtual-led hybrid settings, in the workplace and in home-based settings; navigate the complexities of government-reimbursed business including Medicare, Medicaid and the public exchanges; and use the information obtained about drug, behavioral and medical utilization patterns and consumer behavior to reduce costs for clients and customers and assess the level of service provided.\nOur focus on improving the health and vitality of those we serve will allow us to further differentiate ourselves from our primary competitors. Our primary competitors include independent and managed care pharmacy benefit managers; retail, home delivery and specialty pharmacies; specialty drug distributors; health plans; third-party benefit administrators; group purchasing organizations; clinical solutions companies, health care data analytics companies; and care services providers.\nWe maintain an inventory of brand-name and generic pharmaceuticals in our home delivery pharmacies, specialty pharmacies and specialty distributor. Our specialty pharmacies and specialty distributor also carry biopharmaceutical products to meet the needs of our customers, including pharmaceuticals for the treatment of rare or chronic diseases; if a drug is not in our inventory, we can generally obtain it from a supplier within a reasonable amount of time.\nWe purchase pharmaceuticals either directly from manufacturers or through authorized wholesalers. Evernorth Health Services uses one wholesaler for approximately half of our pharmaceutical purchases, but holds contracts with other wholesalers if needs for an alternate source arise. Generic pharmaceuticals are generally purchased directly from manufacturers.\nCIGNA HEALTHCARE\nCigna Healthcare includes the U.S. Healthcare and International Health operating segments, which provide comprehensive medical plan services and coordinated solutions to clients and customers. Excluding the businesses pending divestiture to Health Care Service Corporation (\"HCSC\"), Cigna Healthcare is predominately comprised of foundational growth businesses.\nMultifaceted approach to affordability\nwith a focus on high-quality care to lower costs and drive better outcomes through deep collaborative partnerships with high-performing providers and superior clinical expertise and analytics to guide customers to the highest quality, most affordable sites of care.\nTalented and experienced people\nwho bring a highly consultative orientation to market and partner with clients to understand their business and goals to address the unique health needs of their population.\nModular portfolio of products, services and funding options\nthat provides choice and enables us to build and tailor a unique combination to meet the specific needs of each client.\nPartnering with Evernorth to drive cross-enterprise leverage\nto deliver a spectrum of integrated solutions that create value and savings for our customers, clients and partners.\nWe offer administrative services only (\"ASO\") and insurance funding solutions to employers, groups and individuals along with other\nhealth care benefits and solutions to improve the quality of care, lower costs and help customers achieve better health outcomes. Funding solutions, referring to the entity assuming financial risk, are described in the Premiums and Fees section below.\nPrincipal Products and Services\nU.S. Healthcare Medical Plans\nEmployer Medical Plans\ninclude health maintenance organizations (\"HMOs\"), LocalPlus\n, Network and Open Access Plus offered through our insurance companies, and third-party administrators (\"TPAs\"). These plans use cost-sharing incentives to encourage the use of \"in-network\" rather than \"out-of-network\" health care providers. Preferred Provider Organization (\"PPO\") plan offerings feature broader provider access than the other plans, do not require referrals and typically have a higher cost-share for out-of-network services. Plans are offered nationwide, and our funding solutions include ASO\ninsured guaranteed cost (\"GC\") and insured experience rated (\"ER\").\nConsumer-Driven Products\nare paired with employer medical plans and offer customers a tax-advantaged way to pay for eligible health care expenses. Health savings accounts, health reimbursement accounts and flexible spending accounts encourage customers to play an active role in managing their health and health care costs.\nIndividual and Family Plans (\"IFPs\")\nare Patient Protection and Affordable Care Act (\"ACA\") compliant exclusive provider organizations (\"EPOs\") or HMO plans marketed to individuals under age 65 without access to health care coverage through an employer or government program such as Medicare or Medicaid. Customers receive comprehensive health care benefits and have access to a local network of health care providers who have been selected with cost and quality in mind. Plans are currently offered in 11 states with a GC funding solution.\nIn January 2024, the Company entered into a definitive agreement to sell the Medicare Advantage, Medicare Individual Stand-Alone Prescription Drug Plans, Medicare and Other Supplemental Benefits, and CareAllies businesses within the U.S. Healthcare operating segment to HCSC subject to applicable regulatory approvals and other customary closing conditions, including adjustments to align with the final balance sheet of the divested businesses (the \"HCSC transaction\"). See Note 5 to the Consolidated Financial Statements for further information.\nMedicare Advantage Plans\nallow Medicare-eligible customers to receive health care benefits, including prescription drugs, through a managed care health plan. Our plans include HMO and PPO plans with a GC funding solution marketed to individuals and qualified employer groups in 29 states and the District of Columbia.\nMedicare Individual Stand-Alone Prescription Drug (\"Part D\") Plans\nprovide a number of prescription drug plan options, as well as service and information support to Medicare-eligible individuals. Our stand-alone plans offer the coverage of Medicare combined with the flexibility to select a product that provides enhanced benefits and a formulary that aligns with the individual's needs. Plans are offered nationwide with a GC funding\nMedicare Supplement Plans\nprovide Medicare-eligible customers with federally standardized Medigap plans. Customers may select among the various Center for Medicare and Medicaid Services (\"CMS\") standardized plan designs to meet their unique needs and may visit any health care provider or facility that accepts Medicare throughout the United States without the need for a referral. Plans are offered in 48 states and the District of Columbia with a GC funding solution.\nU.S. Healthcare Benefits and Solutions\nThe following benefits and solutions are offered nationwide with various funding solutions to enhance the benefits from our health care medical plans.\nsolutions consist of a broad national network of providers, including one of the largest virtual networks in the United States, specialty case and utilization management, a 24/7-accessible crisis intervention phone line, employee assistance programs, and work/life programs.\nConsumer Health Engagement\nsolutions include an array of health management, disease management and wellness programs to improve customers' health and well-being.\nCost Containment Programs\nare designed to reduce the cost of covered health care services and supplies by reducing out-of-network costs, protecting customers from balance billing and educating customers regarding the availability of lower cost in-network services. We negotiate discounts with out-of-network providers, review provider bills and recover overpayments.\nsolutions include HMO plans, PPO plans, EPO plans, traditional indemnity plans and a discount program. Employers and other groups may purchase our products as standalone products or in conjunction with medical products. IFP standalone dental PPO plans are available in 49 states and sold to individuals under age 65 and retirees without access to dental coverage through an employer or a government program.\nsolutions and benefits may be combined with our medical and behavioral health offerings by leveraging the capabilities of Evernorth Health Services.\ninsurance coverage is offered to self-funded clients whose group health plans are administered by Cigna Healthcare. Stop-loss insurance provides reimbursement for claims in excess of a predetermined amount for individuals, the entire group or both.\nInternational Health\nofferings include medical, dental, pharmacy, vision, life, accidental death and dismemberment, and disability risks. We provide products and services that meet the needs of multinational employers, intergovernmental and nongovernmental organizations, and globally mobile individuals with a focus on keeping employees healthy and productive. Products and services are offered worldwide except as limited by applicable law and include ASO, GC and ER funding solutions.\nofferings include medical, dental, pharmacy and vision as well as life coverage. Customers include employers and individuals located in specific geographies (China, Singapore, Hong Kong, Spain and India, along with various countries in the Middle East) where the products and services are purchased. Offerings include ASO, GC and ER funding solutio",
  "item7_clean": "million and $9,855 million as of December 31, 2024 and December 31, 2023, respectively. See Notes 11A and 12 to the Consolidated Financial Statements for a discussion of our fair value measurements, the procedures performed by management to determine that the amounts represent appropriate estimates and our accounting policy regarding unrealized appreciation on debt securities.\nEffect if Different Assumptions Used.\nIf the derived market rates used to calculate fair value increased by 100 basis points, the fair value of the total debt security portfolio of $9.4 billion would decrease by approximately $0.5 billion, resulting in an after-tax decrease to shareholders' equity of approximately $0.4 billion as of December 31, 2024.\nSEGMENT REPORTING\nThe following section of this MD&A discusses the results of each of our segments. See Note 1 to the Consolidated Financial Statements for further description of our segments.\nIn segment discussions, we present \"adjusted revenues\" and \"pre-tax adjusted income (loss) from operations,\" defined as income (loss) before income taxes excluding pre-tax income (loss) attributable to noncontrolling interests, net investment gains/losses, amortization of acquired intangible assets and special items. The Company uses \"pre-tax adjusted income (loss) from operations\" and \"adjusted revenues\" as its principal financial measures of segment operating performance because management believes these metrics reflect the underlying results of business operations and facilitate analysis of trends in underlying revenue, expenses and profitability. The Cigna Group share of certain investment results of its joint ventures reported in the Cigna Healthcare segment using the equity method of accounting are also excluded. Special items are matters that management, including the chief operating decision maker, believes are not representative of the underlying results of operations due to their nature or size. Ratios presented in this segment discussion exclude the same items as adjusted revenues and pre-tax adjusted income (loss) from operations. See Note 22 to the Consolidated Financial Statements for additional discussion of these metrics and a reconciliation of income (loss) before income taxes to pre-tax adjusted income (loss) from operations, as well as a reconciliation of Total revenues to adjusted revenues. Note 22 to the Consolidated Financial Statements also explains that segment revenues include both external revenues and sales between segments that are eliminated in Corporate.\nIn these segment discussions, we also present \"pre-tax margin,\" calculated as pre-tax adjusted income (loss) from operations divided by adjusted revenues.\nSee the \"Executive Overview\" section of this MD&A for summarized financial results of each of our segments.\nEvernorth Health Services Segment\nEvernorth Health Services includes a broad range of coordinated and point solution health services and capabilities, as well as those from partners across the health care system, within our Pharmacy Benefit Services and Specialty and Care Services operating segments. As described in the introduction to Segment Reporting, Evernorth Health Services' performance is measured using adjusted revenues and pre-tax adjusted income (loss) from operations.\nKey Factors Affecting Segment Performance\nKey factors that impact both Pharmacy Benefit Services and Specialty and Care Services:\nPharmacy claim volume (also referred to as utilization) relates to processing prescription claims filled by retail pharmacies in our network and dispensing prescription claims from our home delivery and specialty pharmacies, along with other claims. Pharmacy claim volume (utilization) is impacted by new clients or organic customer growth through the expansion of existing clients.\nThe mix of claims generally considers the type of drug and distribution method used for dispensing and fulfilling. In addition to the types of drugs, the mix of generic or biosimilar claims also impacts our results. Generally, a higher mix of generic and biosimilar drugs reduces revenues and increases income from operations, as generic and biosimilar drugs are typically priced lower than the branded drugs they replace, providing positive impacts or our clients, our customers and us.\nPharmaceutical manufacturer inflation also impacts our pricing because most of our contracts provide that we bill clients and pay pharmacies based on a generally recognized price index for pharmaceuticals. Therefore, the rate of inflation for prescription drugs and our efforts to manage this inflation for our clients continue to be significant drivers of our revenues and cost of revenues in the current environment.\nOur client contract pricing is impacted by our ongoing ability to negotiate favorable contracts for pharmacy network, pharmaceutical and wholesaler purchasing and manufacturer rebates on our clients' behalf (also referred to as affordability improvements). Through these affordability services, we seek to improve the effectiveness of our integrated and fee-for-service solutions, for the benefit of our new and existing clients, by continuously innovating, improving affordability and implementing drug purchasing contract initiatives. Our continued affordability improvements further reduce drug costs for the benefit of our consumers and clients, and we share in the value delivered, which generally results in a favorable impact on our income from operations.\nKey factors that impact Specialty and Care Services:\nCustomer growth generally results in increased revenues and income from operations. This generally includes both organic customer growth through the expansion of existing business and new business, as well as higher volume in our specialty distribution services where we deliver pharmaceuticals and medical supplies directly to health care providers, clinics and hospitals, primarily to physicians who regularly order costly specialty pharmaceuticals. This business provides competitive pricing on pharmaceuticals and medical supplies and leverages our distribution platform to improve our results.\nClient growth, both organic and new business, in our Care Services business generally results in increased revenues and income from operations. This includes client movement in our virtual care, in-home care, physical primary care, benefits management and behavioral health services as we expand our businesses and build upon our cross-enterprise leverage.\nResults of Operations\nFor the Years Ended December 31,\n(Dollars in millions)\n\nPre-tax adjusted (loss) income from operations\nN/M\nprimarily reflect premiums and net investment income associated with COLI and our run-off operations and revenues from other non-strategic businesses.\nPre-tax adjusted (loss) income from operations\ndecreased primarily driven by unfavorable margins in our non-strategic businesses.\nCorporate reflects amounts not allocated to operating segments, including net interest expense (defined as interest on corporate financing less net investment income on investments not supporting segment and other operations), certain litigation matters, expense associated with our frozen pension plans, charitable contributions, operating severance, certain overhead and enterprise-wide project costs, and eliminations for products and services sold between segments.\nFor the Years Ended December 31,\nPre-tax adjusted loss from operations\nCommentary regarding percentage changes represents the driver's impact on the overall category.\nPre-tax adjusted loss from operations\ndecreased 1%, primarily due to lower pension and operating costs (-7%), partially offset by higher interest rates on our indebtedness (+6%).\nINVESTMENT ASSETS\nInformation regarding our investment assets is included in Notes 11, 12, 13 and 15 to the Consolidated Financial Statements.\nFuture realized and unrealized investment results will be driven largely by market conditions, and these future conditions are not reasonably predictable. We believe that the vast majority of our investments will continue to perform under their contractual terms. We manage the portfolio for long-term economics and therefore we expect to hold a significant portion of these assets for the long term. Although future declines in investment fair values remain possible due to interest rate movements and credit deterioration due to both investment-specific uncertainties and global economic uncertainties as discussed below, we do not expect these losses to have a material unfavorable effect on our financial condition or liquidity. The below discussion addresses the strategies and risks associated with our various classes of investment assets. See Item 1A \"Risk Factors\" for additional information regarding risks associated with our investment portfolio.\nThe carrying value of our debt securities portfolio decreased from $9.9 billion as of December 31, 2023 to $9.4 billion as of December 31, 2024, primarily\nreflecting net sales activity\n. Our portfolio remains in a net unrealized depreciation position due to generally increasing interest rates over the past few years.\nAs of December 31, 2024, $8.1 billion, or 86%, of the debt securities in our investment portfolio were investment grade (Baa and above, or equivalent) and the remaining $1.3 billion were below investment grade. The majority of the bonds that are below investment grade were rated at the higher end of the non-investment grade spectrum. These quality characteristics have not materially changed since the prior year and remain consistent with our investment strategy.\nInvestments in debt securities are diversified by issuer, geography and industry. On an aggregate basis, the debt securities portfolio continues to perform according to original expectations, which includes a long-term economic investment strategy. Primary risks facing many of the issuers in our portfolio include ongoing geopolitical events and economic conditions, including expectations for a longer period of higher inflation and interest rates. To date, most issuers have been successful in managing these issues without a meaningful change in credit quality. We continue to monitor the economic environment and its effect on our portfolio; we also continue to consider the impact of various factors in determining the allowance for credit losses on debt securities, which is discussed in Note 11 to the Consolidated Financial Statements.\nCommercial Mortgage Loans\nAs of December 31, 2024, our $1.4 billion commercial mortgage loan portfolio consisted of approximately 45 fixed-rate loans, diversified by property type, location and borrower. These loans are carried in our Consolidated Balance Sheets at their unpaid principal balance, net of an allowance for expected credit losses. As a result of increasing market interest rates since the majority of these loans were made, the carrying value exceeds the market value of these loans as of December 31, 2024. Given the quality and diversity of the underlying real estate, positive debt service coverage and significant borrower cash invested in the property generally ranging between 30 and 40%, we remain confident that the vast majority of borrowers will continue to perform as expected under their contract terms. For further discussion of the results and changes in key credit quality indicators, see Note 11 to the Consolidated Financial Statements.\nOffice sector fundamentals have been and continue to be weak, and values are experiencing stress due to multiple headwinds: expanded work-from-home flexibility, shorter term leases, elevated tenant improvement allowances and corporate migration to lower cost states. Additionally, the current macroeconomic headwinds are impacting capital markets and reducing investor appetite for capital-intensive assets (e.g., offices and regional shopping malls). Our commercial mortgage loan portfolio has no exposure to regional shopping malls and approximately 25% exposure to office properties. Although future losses remain possible due to further credit deterioration, we do not expect these losses to have a material unfavorable effect on our results of operations, financial condition or liquidity.\nOther Long-Term Investments\nOther long-term investments of $4.6 billion as of December 31, 2024 included investments in securities limited partnerships and real estate limited partnerships, direct investments in real estate joint ventures and other deposit activity that is required to support various insurance and health services businesses. These limited partnership entities typically invest in mezzanine debt or equity of privately held companies and equity real estate. Given our subordinate position in the capital structure of these underlying entities, we assume a higher level of risk for higher expected returns. To mitigate risk, these investments are diversified by industry sector or property type and geographic region. No single partnership investment exceeded 3% of our securities and real estate limited partnership portfolio.\nWe expect continued volatility in private equity and real estate fund performance going forward as fair market valuations are adjusted to reflect market and portfolio transactions. Less than 4% of our other long-term investments are exposed to real estate in the office sector.\nUnconsolidated Subsidiary Investments Portfolio\nWe participate in an insurance joint venture in China with a 50% ownership interest. We account for this joint venture under the equity method of accounting. Our 50% share of the investment portfolio supporting the joint venture's liabilities was approximately $15.6 billion as of December 31, 2024. These investments were comprised of approximately 75% debt securities, including government and corporate debt diversified by issuer, industry and geography; 15% equities, including mutual funds, equity securities and private equity partnerships; and 10% long-term deposits and policy loans. We continuously review the joint venture's investment strategy and its execution. There were no investments with a material unrealized loss as of December 31, 2024. See Note 14 to the Consolidated Financial Statements for additional information regarding unconsolidated subsidiaries.\nMARKET RISK\nOur assets and liabilities include financial instruments subject to the risk of potential losses from adverse changes in market rates and prices. Our primary market risk exposure from financial instruments is our interest-rate risk exposure to fixed-rate, medium-term instruments. Changes in market interest rates affect the value of instruments that promise a fixed return.\nConsistent with disclosure requirements, the following items have been excluded from this consideration of market risk for financial instruments: changes in the fair values of insurance-related assets and liabilities as disclosed in Note 9 to the Consolidated Financial Statements (because their primary risks are insurance rather than market risk); changes in the fair values of investments recorded using the equity method of accounting and liabilities for pension and other postretirement and postemployment benefit plans (and related assets); and changes in the fair values of other significant assets and liabilities, such as goodwill, taxes and various accrued liabilities (because they are not financial instruments, their primary risks are other than market risks).\nOur Management of Market Risks\nWe predominantly rely on two techniques to manage our exposure to market risk:\nInvestment/liability matching.\nWe generally select investment assets with characteristics (such as duration, yield, currency and liquidity) that correspond to the underlying characteristics of our related insurance and contractholder liabilities so that we can match the investments to our obligations. Shorter-term investments generally support shorter-term life and health liabilities. Medium-term, fixed-rate investments support interest-sensitive and medium-term health liabili",
  "item2_clean": null
}