{
  "source_file": "ci-20250930.htm",
  "form_type": "10-Q",
  "item1_clean": null,
  "item7_clean": null,
  "item2_clean": "MANAGEMENT'S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS\nIn this MD&A, our consolidated measures \"adjusted income from operations,\" earnings per share on that same basis and \"adjusted revenues\" are not determined in accordance with GAAP and should not be viewed as substitutes for the most directly comparable GAAP measures of \"shareholders' net income,\" \"earnings per share\" and \"total revenues.\" We also use pre-tax adjusted income (loss) from operations and adjusted revenues to measure the results of our segments.\nThe Company uses \"pre-tax adjusted income (loss) from operations\" and \"adjusted revenues\" as its principal financial measures of segment operating performance because management believes these metrics reflect the underlying results of business operations and facilitate analysis of trends in underlying revenue, expenses and profitability. We define adjusted income (loss) from operations as shareholders' net income (or income (loss) before income taxes less pre-tax income (loss) attributable to noncontrolling interests for the segment metric) excluding net investment gains/losses, amortization of acquired intangible assets and special items. The Cigna Group's share of certain investment results of its joint ventures reported in the Cigna Healthcare segment using the equity method of accounting are also excluded. Special items are matters that management believes are not representative of the underlying results of operations due to their nature or size. Adjusted income (loss) from operations is measured on an after-tax basis for consolidated results and on a pre-tax basis for segment results. Consolidated adjusted income (loss) from operations is not determined in accordance with GAAP and should not be viewed as a substitute for the most directly comparable GAAP measure, shareholders' net income. See the below Financial Highlights section for a reconciliation of consolidated adjusted income from operations to shareholders' net income.\nThe Company defines adjusted revenues as total revenues excluding the following adjustments: special items and The Cigna Group's share of certain investment results of its joint ventures reported in the Cigna Healthcare segment using the equity method of accounting. Special items are matters that management believes are not representative of the underlying results of operations due to their nature or size. We exclude these items from this measure because management believes they are not indicative of past or future underlying performance of the business. Adjusted revenues is not determined in accordance with GAAP and should not be viewed as a substitute for the most directly comparable GAAP measure, total revenues. See the below Financial Highlights section for a reconciliation of consolidated adjusted revenues to total revenues.\nCAUTIONARY NOTE REGARDING FORWARD-LOOKING STATEMENTS\nForward-looking statements are subject to risks and uncertainties, both known and unknown, that could cause actual results to differ materially from those expressed or implied in forward-looking statements. Such risks and uncertainties include, but are not limited to: our ability to achieve our strategic and operational initiatives; our ability to adapt to changes in an evolving and rapidly changing industry; our ability to compete effectively, differentiate our products and services from those of our competitors, and maintain or increase market share; price competition, inflation and other pressures that could compress our margins or result in premiums that are insufficient to cover the cost of services delivered to our customers; the potential for actual claims to exceed our estimates related to expected medical claims; our ability to develop and maintain satisfactory relationships with health care payors, physicians, hospitals, other health service providers and with producers and consultants; our ability to maintain relationships with one or more key pharmaceutical manufacturers or if payments made or discounts provided decline; changes in the pharmacy provider marketplace or pharmacy networks; changes in drug pricing or industry pricing benchmarks; our ability to invest in and properly maintain our information technology and other business systems; our ability to prevent or contain effects of a potential cyberattack or other privacy or data security incident; risks related to our use of artificial intelligence and machine learning; political, legal, operational, regulatory, economic and other risks that could affect our multinational operations, including currency exchange rates; risks related to strategic\nYou should not place undue reliance on forward-looking statements, which speak only as of the date they are made, are not guarantees of future performance or results, and are subject to risks, uncertainties and assumptions that are difficult to predict or quantify. The Cigna Group undertakes no obligation to update or revise any forward-looking statement, whether as a result of new information, future events or otherwise, except as may be required by law.\nEXECUTIVE OVERVIEW\nFinancial Highlights\nConsolidated Results of Operations (GAAP basis)\nThree Months Ended September 30,\nNine Months Ended September 30,\n(Dollars in millions)\n\ndecreased 5%, primarily reflecting the closing of the HCSC transaction (defined below) in the three months ended March 31, 2025.\nincreased 16% and 17%, primarily reflecting higher utilization of prescription drugs from customer growth in Evernorth Health Services.\ndecreased 21% and 10%, primarily driven by the impact of the HCSC transaction (-25% and -15%, respectively), partially offset by higher premium rates within our ongoing U.S. Healthcare businesses (+4% in both periods).\nFees and other revenues\nincreased 13% and 14%, primarily reflecting growth in affordability services (defined in the \"Segment Reporting\" section) within our Pharmacy Benefit Services operating segment.\nNet investment income\nincreased 174% and 2%, primarily due to the absence of the $182 million impairment of the dividend receivable in the third quarter of 2024 related to VillageMD accrued dividends. For the nine months ended, this impact was offset by lower average assets, due in part to the impact of the HCSC transaction.\nPharmacy and other service costs\nincreased 17% and 18%, primarily reflecting higher utilization of prescription drugs from customer growth in Evernorth Health Services.\nMedical costs and other benefit expenses\ndecreased 18% and 8%, primarily driven by the impact of the HCSC transaction (-26% and -16%, respectively), partially offset by higher medical costs within our ongoing U.S. Healthcare businesses (+8% in both periods).\nSelling, general and administrative (\"SG&A\") expenses\ndecreased 6% for the three months ended and was flat for the nine months ended. Both periods were primarily impacted by the HCSC transaction (-16% and -8%, respectively), partially offset by the strategic optimization program (+5% and +4%, respectively) and supporting business growth (+3% and +4%, respectively). See Note 14 to the Consolidated Financial Statements for further discussion of the strategic optimization program.\nGain (loss) on sale of businesses\nprimarily reflects the HCSC transaction for the three and nine months ended. See the \"Divestiture of Medicare Advantage and Related Businesses\" section below and Note 5 to the Consolidated Financial Statements for further discussion of the HCSC transaction.\nfor the three and nine months ended increased, reflecting the absence of the impairment of VillageMD equity securities that was recorded in the three and nine months periods in 2024.\nThe effective tax rate\ndecreased for the three and nine months ended, primarily driven by the absence of a valuation allowance related to the impairment of equity securities recorded in 2024 (-18% in both periods), partially offset by the absence of state tax benefits recorded in 2024 (+3% and +5%, respectively). See Note 15 to the Consolidated Financial Statements for further discussion of these matters.\nDivestiture of Medicare Advantage and Related Businesses\nOn March 19, 2025, the Company completed the sale of our Medicare Advantage, Medicare Individual Stand-Alone Prescription Drug Plans, Medicare and Other Supplemental Benefits, and CareAllies businesses within the U.S. Healthcare operating segment to Health Care Service Corporation (\"HCSC,\" and such transaction, the \"HCSC transaction\"). The purchase price increased from $3.3 billion to $4.9 billion, reflecting higher statutory surplus for the legal entities when conveyed to HCSC and post-closing contractual adjustments. The Company received approximately $4.2 billion cash proceeds at closing. We expect receipt of the remaining approximately $0.6 billion in the fourth quarter of 2025 upon HCSC's collection of amounts due from the Centers for Medicare and Medicaid Services (\"CMS\") and completion of post-closing contractual adjustments. See Note 5 to the Consolidated Financial Statements for further information.\nLIQUIDITY AND CAPITAL RESOURCES\nWe maintain liquidity at two levels: the subsidiary level and the parent company level.\nCash requirements at the subsidiary level generally consist of pharmacy, medical costs and other benefit payments; expense requirements, primarily for employee compensation and benefits, information technology, and facilities costs; income taxes; and debt service.\nOur subsidiaries normally meet their liquidity requirements by maintaining appropriate levels of cash, cash equivalents and short-term investments; using cash flows from operating activities; matching durations of investments to estimated durations for the related insurance and contractholder liabilities; selling investments; and borrowing from affiliates, subject to applicable regulatory limits.\nParent Company Level.\nCash requirements at the parent company level generally consist of debt service, payment of declared dividends to shareholders, le"
}