{
  "source_file": "cl-20241231.htm",
  "form_type": "10-K",
  "item1_clean": "ITEM 1. BUSINESS\nGeneral Development of the Business\nColgate-Palmolive Company (together with its subsidiaries, “we,” “us,” “our,” the “Company” or “Colgate”) is a caring, innovative growth company reimagining a healthier future for all people, their pets and our planet. We seek to deliver consistent compounded earnings per share growth to help drive superior total shareholder return, as well as to provide Colgate people with an innovative and inclusive work environment. We do this by developing and selling science-led products globally that make people’s and their pets’ lives healthier and more enjoyable and by embracing our Sustainability & Social Impact Strategy across our organization. Our products are marketed in over 200 countries and territories throughout the world. Colgate was founded in 1806 and incorporated under the laws of the State of Delaware in 1923.\nFor recent business developments and other information, refer to the information set forth under the captions “Management’s Discussion and Analysis of Financial Condition and Results of Operations–Executive Overview,” “– Outlook,” “–Results of Operations” and “– Liquidity and Capital Resources” in Part II, Item 7 of this report.\nDescription of the Business\nWe operate in two product segments: Oral, Personal and Home Care; and Pet Nutrition. We are a leader in Oral Care with global leadership in the toothpaste and manual toothbrush categories according to market share data. We sell our toothpastes under brands such as Colgate, Darlie, elmex, hello, meridol, Sorriso and Tom’s of Maine, our toothbrushes under brands such as Colgate, Darlie, elmex and meridol and our mouthwashes under brands such as Colgate, elmex and meridol. Our Oral Care business also includes pharmaceutical products for dentists and other oral health professionals.\nWe are a leader in many product categories of the Personal Care market with global leadership in liquid hand soap, according to market share data, which we sell under brands such as Palmolive, Protex and Softsoap. Our Personal Care products also include Irish Spring, Palmolive and Protex bar soaps, Irish Spring, Palmolive, Sanex and Softsoap shower gels, Lady Speed Stick, Sanex, Speed Stick and Tom’s of Maine deodorants and antiperspirants, EltaMD, Filorga and PCA SKIN skin health products and Palmolive shampoos and conditioners.\nWe manufacture and market a wide array of products for the Home Care market, including Ajax, Axion and Palmolive dishwashing liquids, Ajax, Fabuloso and Murphy household cleaners and Suavitel, Soupline, Fluffy and Cuddly fabric conditioners.\nSales of Oral, Personal and Home Care products accounted for 43%, 18% and 17%, respectively, of our total worldwide Net sales in 2024. Geographically, Oral Care is a substantial part of our business in Asia Pacific.\nThrough our Hill’s Pet Nutrition segment (“Hill’s” or “Pet Nutrition”), we are a leader in specialty pet nutrition products for dogs and cats with products marketed in over 80 countries and territories worldwide. Hill’s markets pet foods primarily under two brands. Hill’s Science Diet, which is called Hill’s Science Plan in Europe, is a range of products for everyday nutritional needs. Hill’s Prescription Diet is a range of therapeutic pet foods to help nutritionally support dogs and cats in different stages of health. Sales of Pet Nutrition products accounted for 22% of our total worldwide Net sales in 2024.\nFor more information regarding our worldwide Net sales by product category, refer to Note 1, Nature of Operations and Note 13, Segment Information to the Consolidated Financial Statements.\nFor additional information regarding market share data, see\nMarket Share Information\nin Part II, Item 7 of this report.\nDistribution; Raw Materials; Competition; Trademarks and Patents\nOur Oral, Personal and Home Care products are sold to a variety of retailers, wholesalers and distributors worldwide. Pet Nutrition products are sold by authorized pet supply retailers, veterinarians and eCommerce retailers. Certain of our products are also sold direct-to-consumer. Our sales to Walmart, Inc. and its affiliates represented approximately 11% of our Net sales in 2024. No other customer represented more than 10% of our Net sales in 2024. We support our products with advertising, promotion and other marketing (with increasing emphasis on digital) to build awareness and trial of our products. Our products are marketed by a direct sales force at individual operating subsidiaries or business units and by distributors or brokers.\nThe majority of raw and packaging materials used in our products is purchased from other companies and is available from several sources. No single raw or packaging material represents, and no single supplier provides, a significant portion of our total material requirements. We do, however, purchase certain key raw and packaging materials from single-source suppliers or a limited number of suppliers. For certain materials, new suppliers may have to be qualified under industry, governmental and/or Colgate standards (including those relating to responsible sourcing), which can require additional investment and/or take a significant period of time. Raw and packaging material commodities, such as resins, essential oils, tropical oils, pulp, tallow, corn, poultry and soybeans, are subject to market price variations. For further information regarding the impact of changes in commodity prices, see Item 1A, “Risk Factors - Volatility in material and other costs has in the past and may continue to adversely impact our profitability” and Item 7, “Management’s Discussion and Analysis of Financial Condition and Results of Operations.”\nOur products are sold in a highly competitive global marketplace which has experienced increased retail trade concentration, the substantial growth of eCommerce, the integration of traditional and digital operations at key retailers and the growing presence of large-format retailers, discounters and eCommerce retailers. Products similar to ours are available from multinational and local competitors in the U.S. and around the world. Certain of our competitors are larger and have greater resources than we do. In addition, the substantial growth in eCommerce has encouraged the entry of new competitors and business models. In certain geographies, we also face strong local competitors, who may be more agile and have better local consumer insights than we do. Private label brands sold by retailers are also a source of competition for certain of our products.\nThe retail landscape in many of our markets continues to evolve as a result of the continued growth of eCommerce, changing consumer behavior and preferences (as consumers increasingly shop online, including to compare prices and product availability) and the increased presence of alternative retail channels, such as subscription services and direct-to-consumer businesses. We face competition in several aspects of our business, including pricing, promotional activities, new products and brand introductions and expansion into new geographies and channels.\nWe consider trademarks to be material to our business. We follow a practice of seeking trademark protection in the U.S. and throughout the world where our products are sold. Principal global and regional trademarks include Colgate, Palmolive, Darlie, elmex, hello, meridol, Sorriso, Tom’s of Maine, EltaMD, Filorga, Irish Spring, Lady Speed Stick, PCA SKIN, Protex, Sanex, Softsoap, Speed Stick, Ajax, Axion, Fabuloso, Murphy, Soupline and Suavitel, as well as Hill’s Science Diet and Hill’s Prescription Diet. Our rights in these trademarks endure for as long as they are used and/or registered. Although we actively develop and maintain a portfolio of patents, no single patent is considered significant to the business as a whole.\nGovernment Regulations\nAs a global company, we are subject to extensive governmental regulations, including environmental rules and regulations, in the U.S. and abroad. The most significant government regulations that impact our business are discussed below. We are also subject to laws and regulations relating to sustainability, labor and employment practices, artificial intelligence and taxation. It is our policy and practice to comply with all government regulations applicable to our business. In 2024, compliance with these regulations did not have, and we do not expect such compliance in the future to have, a material adverse effect on our capital expenditures, earnings or competitive position. For further discussion of how global legal and regulatory requirements may impact our business, see Part I, Item 1A, “Risk Factors.”\n: Legal and regulatory requirements apply to most aspects of our products, including their development, ingredients, formulation, manufacture, packaging, labeling, storage, transportation, distribution, export, import, advertising, sale and environmental impact. U.S. federal authorities, including the U.S. Food and Drug Administration, the Federal Trade Commission, the Consumer Product Safety Commission, the Occupational, Safety and Health Administration and the Environmental Protection Agency, regulate different aspects of our business, along with parallel authorities at the state and local levels and comparable authorities overseas.\nAnti-Corruption, Anti-Bribery, Commercial Bribery and Competition\n: We are subject to anti-corruption laws and regulations, including the U.S. Foreign Corrupt Practices Act and other laws that generally prohibit the making or offering of improper payments to foreign government officials and political figures for the purpose of obtaining or retaining business or to gain an unfair business advantage, and laws that prohibit commercial bribery. In addition, our selling practices are regulated by competition law authorities in the U.S. and abroad.\nPrivacy and Data Protection\n: Our collection, storage, transfer and/or processing of customer, consumer, employee, vendor and other stakeholder information and personal data is subject to important data protection laws and regulations in the U.S. and abroad, including the General Data Protection Regulation.\n: We are subject to laws and sanctions imposed by the U.S., including those imposed by the U.S. Treasury Department’s Office of Foreign Asset Control (“OFAC”) and/or by other jurisdictions that may prohibit us or certain of our affiliates from doing business in certain countries or restrict the kind of business that may be conducted. For information regarding the impact of the war in Ukraine, refer to Part II, Item 7 “Management’s Discussion and Analysis of Financial Condition and Results of Operations - Executive Overview.”\nHuman Capital Management\nHuman capital matters at Colgate are managed by our Global Human Resources function, led by our Chief Human Resources Officer, with oversight from the Personnel and Organization Committee of our Board of Directors (the “Board”). As of December 31, 2024, we had approximately 34,000 employees based in over 100 countries. Approximately two-thirds of our revenues are generated from markets outside the U.S. and over 80% of our employees are located outside the U.S. Approximately 33% of our employees are based in Asia Pacific, 30% are based in Latin America, 17% are based in North America, 15% are based in Europe and 5% are based in Africa/Eurasia. Our global workforce covers a broad range of functions, from manufacturing employees to management personnel and certain of our employees are represented by unions or works councils.\nColgate’s Culture and Core Values\nColgate’s purpose is to reimagine a healthier future for all people, their pets and our planet. We believe Colgate people are crucial to our ongoing business success and aim to recruit, develop and retain strong talent with diverse backgrounds and perspectives. As the owner of the world’s most penetrated brand, our business success relies on our ability to market our brands ",
  "item7_clean": "ITEM 7. MANAGEMENT’S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS\nBusiness Organization\nColgate-Palmolive Company (together with its subsidiaries, “we,” “us,” “our,” the “Company” or “Colgate”) is a caring, innovative growth company reimagining a healthier future for all people, their pets and our planet. We seek to deliver consistent compounded earnings per share growth to help drive superior total shareholder return, as well as to provide Colgate people with an innovative and inclusive work environment. We do this by developing and selling science-led products globally that make people’s and their pets’ lives healthier and more enjoyable and by embracing our Sustainability & Social Impact Strategy across our organization.\nWe are tightly focused on two product segments: Oral, Personal and Home Care; and Pet Nutrition. Within these segments, we follow a closely defined business strategy to grow our key product categories and increase our overall market share. Within the categories in which we compete, we prioritize our efforts based on their capacity to maximize the use of the organization’s core competencies and strong global equities and to deliver sustainable, profitable long-term growth.\nOperationally, we are organized along geographic lines with management teams having responsibility for the business and financial results in each region. We compete in more than 200 countries and territories worldwide with established businesses in all regions contributing to our sales and profitability. Approximately two-thirds of our Net sales are generated from markets outside the U.S., with approximately 45% of our Net sales coming from emerging markets (which consist of Latin America, Asia (excluding Japan), Africa/Eurasia and Central Europe). This geographic diversity and balance help to reduce our exposure to business and other risks in any one country or part of the world.\nThe Oral, Personal and Home Care product segment is managed geographically in five reportable operating segments: North America, Latin America, Europe, Asia Pacific and Africa/Eurasia, all of which sell primarily to a variety of retailers, wholesalers, distributors, dentists and, in some geographies, skin health professionals. Through Hill’s Pet Nutrition, we also compete on a worldwide basis in the pet nutrition market, selling products principally through authorized pet supply retailers, veterinarians and eCommerce retailers. We also sell certain of our products direct-to-consumer. We are engaged in manufacturing and sourcing of products and materials on a global scale and have major manufacturing facilities, warehousing facilities and distribution centers in every region around the world.\nIn connection with management changes, we realigned the reporting structure of our skin health business effective July 1, 2024. Accordingly, commencing with the quarter ended September 30, 2024, the results of the skin health business previously reported within the Europe reportable operating segment are reported with our other skin health businesses in the North America reportable operating segment, with no impact on the Company's consolidated results of operations or financial position. The Company has recast its historical geographic segment information to conform to the new reporting structure.\nOn an ongoing basis, management focuses on a variety of key indicators to monitor business health and performance. These indicators include net sales (including volume, pricing and foreign exchange components), organic sales growth (net sales growth excluding the impact of foreign exchange, acquisitions and divestments), a non-GAAP financial measure, and gross profit margin, selling, general and administrative expenses, operating profit, net income and earnings per share, in each case, on a GAAP and a non-GAAP basis, as well as measures used to optimize the management of working capital, capital expenditures, cash flow and return on capital. In addition, we review market share, household penetration and other data to assess how our brands are performing within their categories on a global and regional basis. The monitoring of these indicators and our Code of Conduct and corporate governance practices help to maintain business health and strong internal controls. For additional information regarding non-GAAP financial measures and the Company’s use of market share data and the limitations of such data, see “Non-GAAP Financial Measures” and “Market Share Information” below.\nThe war in Ukraine, and the related geopolitical tensions, have had and continue to have a significant impact on our operations in Ukraine and Russia, though it has not been material to our Consolidated Financial Statements. We have no manufacturing facilities in Russia. For the year ended December 31, 2024, our business in the Eurasia region constituted approximately 1% of our consolidated net sales and approximately 2% of our consolidated operating profit.\n(Dollars in Millions Except Per Share Amounts)\nWe have experienced, and expect to continue to experience, risks related to the impact of the war in Ukraine, including increases in the costs and, in certain cases, limitations on the availability of certain raw and packaging materials and commodities (including oil and natural gas), supply chain and logistics challenges, import restrictions, foreign currency volatility and reputational concerns. We also have faced and continue to face challenges to our ability to repatriate cash from Russia and identify banking partners to support our Russian operations and we may face challenges to our ability to protect our assets in Russia. We also continue to monitor the impact of sanctions, export controls and import restrictions imposed generally and in response to the war in Ukraine.\nThe Conflict in the Middle East\nThe conflict in the Middle East has not had a material impact on our Consolidated Financial Statements. Uncertainties and risks remain as to the duration of the conflict and its impact on geopolitical relations and stability in North Africa, the wider Middle East and nearby regions. The conflict has impacted and may continue to impact, among other things, supply chain and logistics, the availability and price of raw and packaging materials and commodities such as oil, consumer sentiment and consumption and category growth rates in the region.\nTo achieve our business and financial objectives, we are focused on delivering consistent compounded earnings per share growth through driving organic sales growth, operational efficiencies and leveraging the strength of our balance sheet. We believe increased household penetration and improved brand health are the keys to consistent organic sales growth and aim to achieve these through science-led, core and premium innovation, pursuing higher-growth adjacent categories and segments and expanding in faster-growing channels and markets. We aim to deliver margin expansion and cash flow growth through operating leverage and efficiency. We continue to prioritize our investments in high growth segments within our Oral Care, Personal Care and Pet Nutrition businesses. We also seek to lead in the development of human capital and to maximize the impact of our Sustainability & Social Impact Strategy. We are building and scaling our capabilities in areas such as innovation, digital, data, analytics and artificial intelligence, enabling us to be more responsive in today’s rapidly changing world. We continue to invest behind our brands, including through advertising, and to develop initiatives to build strong relationships with consumers, retailers and dental, veterinary and skin health professionals. We continue to believe that growth opportunities are greater in those areas of the world in which economic development and rising consumer incomes expand the size and number of markets for our products.\nThe investments needed to drive growth are supported through continuous, Company-wide initiatives to lower costs and increase effective asset utilization. Through these initiatives, which are referred to as our funding-the-growth initiatives, we seek to become even more effective and efficient throughout our businesses. These initiatives are designed to reduce costs associated with direct materials, indirect expenses, distribution and logistics and advertising and promotional materials, among other things, and encompass a wide range of projects, examples of which include raw material substitution, reduction of packaging materials, consolidating suppliers to leverage volumes and increasing manufacturing efficiency through SKU reductions and formulation simplification.\nSignificant Items Impacting Comparability\nDuring the quarter ended June 30, 2023, we reassessed with our legal and tax advisers certain tax deductions taken in prior years by one of our subsidiaries and concluded that it was more likely than not that the deductions would not be sustained by the courts in that jurisdiction. The value of the tax deductions was not material to us in any year in which they were taken. The cumulative effect of the change in tax position of $148 was reflected as a discrete item in the quarter ended June 30, 2023 income tax expense, partially offset by the reversal of certain prior years’ withholding tax reserves of $22 that were no longer required (hereinafter referred to as the “foreign tax matter”). The tax liability was paid in the quarter ended September 30, 2023. See Note 10, Income Taxes, to the Consolidated Financial Statements for additional information.\nDuring the quarter ended March 31, 2023, we recorded a charge of $267 as a result of a decision of the United States Court of Appeals for the Second Circuit (the “Second Circuit”) affirming a grant of summary judgment to the plaintiffs in a\n(Dollars in Millions Except Per Share Amounts)\nlawsuit under the Employee Retirement Income Security Act (“ERISA”) seeking the recalculation of benefits and other relief associated with a 2005 residual annuity amendment to the Colgate-Palmolive Company Employees’ Retirement Income Plan (the “Retirement Plan”). The decision resulted in an increase in the obligations of the Retirement Plan, which based on the current funded status of the Retirement Plan and depending on further developments in the litigation, may require a cash contribution by the Company in 2025. In June 2023, we filed a petition for certiorari to the United States Supreme Court requesting permission for an appeal to that court, which was denied in October 2023. Also, in June 2023, the plaintiffs filed a motion to enter a revised final judgment in the United States District Court for the Southern District of New York (the “District Court”) to address certain unresolved calculation issues, which we opposed. In March 2024, the District Court granted the plaintiffs’ motion and found for the plaintiffs on those calculation issues. We have appealed that decision to the Second Circuit. See Note 12, Commitments and Contingencies to the Consolidated Financial Statements for additional information.\nDuring the quarter ended March 31, 2023, we announced a voluntary recall of select Fabuloso multi-purpose cleaner products sold in the United States and Canada. The costs associated with the voluntary recall had a $25 impact on our Operating profit in the quarter ended March 31, 2023.\nOn January 27, 2022, the Board approved a targeted productivity program (the “2022 Global Productivity Initiative”). All initiatives under the program have been implemented and the program concluded on December 31, 2024. The 2022 Global Productivity Initiative resulted in the reallocation of resources towards our strategic priorities and faster growth businesses, efficiencies in our operations and the streamlining of our supply chain to reduce structural costs. Total pretax charges from the implementation of the 2022 Global Productivity Initiative were $228 ($186 aftertax). Total annualized pretax savings from the 2022 Global Productivity Initiative were approximately $125 ($100 aftertax). See “Restructuring and Related Implementation Charges” below and Note 3, Restructuring and Related Implementation Charges to the Consolidated Financial Statements for additional information.\nIn the years ended December 31, 2024 and 2023, we incurred pretax costs of $85 (aftertax costs of $73) and $32 (aftertax costs of $25), respectively, resulting from the 2022 Global Productivity Initiative.\nLooking forward, we expect global macroeconomic, political and market conditions to remain challenging, including as a result of inflation, high interest rates, foreign currency volatility and developments in trade relations following the imposition of new and/or additional tariffs by the United States and other countries. We have taken and are taking additional pricing to try to offset the increases in raw and packaging material costs we have seen in recent years. This has negatively impacted consumer demand for our products. Additionally, inflation has impacted the broader economy with consumers around the world facing widespread rising prices as well as high interest rates resulting from measures to address inflation.\nRecent developments in trade relations and the imposition of new and/or additional tariffs by the United States and other countries, including following the United States’ February 2025 executive orders imposing tariffs on imports from Canada, Mexico and China, may contribute to inflationary pressures and, as a result, may impact consumer demand for our products. We are following the dynamic situation closely and evaluating the impact of such tariffs and any retaliatory actions taken by other countries on our business, results of operations, cash flows and financial condition. While we have made and will make efforts to mitigate the impact of these and any additional tariffs imposed by the United States and/or other countries, they could impact the cost and/or price of our products, the cost and availability of raw and packaging materials and commodities and/or consumer demand for our products due to, among other things, the impact of such tariffs on the global economy, inflationary pressures or geopolitical relations.\nSuch inflation and developments in trade relations as well as high interest rates may negatively impact consumer consumption or discretionary spending and/or change their purchasing patterns by foregoing purchasing certain of our products or by switching to “private label” or to our lower-priced product offerings. Although we continue to devote significant resources to support our brands and market our products at multiple price points, these changes could reduce demand for and sales volumes of our products or result in a shift in our product mix from higher margin to lower margin product offerings. In light of this challenging environment, we expect continued volatility across all of our categories and it is therefore difficult to predict category growth rates in the near term.\n(Dollars in Millions Except Per Share Amounts)\nGiven that approximately two-thirds of our Net sales originate in markets outside the U.S., we have experienced and will likely continue to experience volatile foreign currency fluctuations, particularly in Argentina and Türkiye, which are considered hyper-inflationary economies. Effective January 1, 2025, we designated Nigeria as a hyper-inflationary economy. Consequently, the functional currency for our Nigerian subsidiary will be the U.S. dollar and the impact of all future Nigerian currency fluctuations will be recorded in income. However, this designation is not expected to have a material impact on the Company's Consolidated Financial Statements. As discussed above, we continue to experience higher raw and packaging material costs, including the impact of transactional foreign exchange. While we have taken, and will continue to take, measures to mitigate the effect of these con",
  "item2_clean": null
}