{
  "source_file": "clx-20250630.htm",
  "form_type": "10-K",
  "item1_clean": "partners, including China, particularly due to the imposition of tariffs by the U.S. and retaliatory tariffs by those partners); and other global events, have significantly increased global macroeconomic uncertainty and volatility. Sustained macroeconomic uncertainty and volatility and geopolitical instability could undermine global consumer confidence and could continue to reduce consumer spending and purchasing power, thereby reducing demand for the Company's products, and continue to disrupt global supply chains, impacting the availability and cost of transportation, logistics, raw materials, commodities, labor and packaging. Furthermore, U.S. government policy or election outcomes may prompt nationalist sentiment abroad, potentially resulting in targeted boycotts of U.S. products and services, which could adversely affect demand for the Company’s products in certain international markets and negatively impact financial results. This uncertainty and volatility also make it difficult for the Company, as well as its customers, suppliers, distributors and business partners to anticipate the resulting impacts and to accurately forecast, make financial projections, and plan future business activities, which may, in turn, cause customers to limit their purchase orders or affect their ability to pay amounts owed to the Company in a timely manner or at all, or adversely affect its business partners' ability to supply or provide services. These situations continue to evolve, and there is significant uncertainty as to their full or related impacts on the global economy and geopolitical relations, in general, and on the Company’s business, in particular. These geopolitical conflicts and tensions may also heighten other risks disclosed in this Report, including relating to cybersecurity, any of which could have an adverse impact on the Company’s business, results of operations, cash flows and/or financial condition.\nThe Company has experienced, and expects to continue to experience, the indirect impacts of the conflicts in Ukraine and the Middle East, including increases in the cost of raw and packaging materials and commodities (including the price of oil), supply chain and logistics challenges, and it is not possible to predict the broader or longer-term consequences of these conflicts or the sanctions and export controls imposed in response to each conflict. Increasing unfavorable macroeconomic and geopolitical conditions have caused, and may also lead to, recession risk, increased credit and collectability risks, higher borrowing costs or reduced availability of capital and credit markets, reduced liquidity, asset impairments, declines in the value of the Company's financial instruments, and failures of counterparties including financial institutions and insurers. If any financial institution party to the Company's credit or other financing arrangements were to declare bankruptcy or become insolvent, they may be unable to perform under their agreements with the Company, which could result in reduced borrowing capacity. In addition, if any parties with which the Company conducts business are unable to access funds pursuant to such instruments or lending arrangements with such a financial institution, such parties’ ability to continue to fund their business and perform their obligations to the Company could be adversely affected. Any of these factors could negatively and materially impact the Company's business, financial condition, and results of operations.\nMarket and category declines and the Company’s product and geographic mix may adversely impact the Company’s ability to meet sales growth targets, profitability and financial results.\nA large percentage of the Company’s revenues comes from mature markets that are subject to high levels of competition. During fiscal year 2025, 86% of the Company’s net sales were attributable to U.S. markets, including U.S. territories. U.S. markets for consumer goods are considered more mature and commonly characterized by high household penetration, particularly with respect to our most significant product categories. The Company’s ability to achieve its sales growth targets depends on its ability to successfully introduce new products, brands, line extensions, and product innovations, or enter or expand into adjacent product categories, sales channels, markets or countries. Even if we are successful at increasing sales, a general decline in the markets for the Company’s product categories has had, and may in the future have, a negative impact on the Company’s financial condition, results of operations and ability to meet its sales growth targets. Further, the Company’s product, category and/or geographic mix may hinder the Company’s ability to meet these strategic targets, especially in conjunction with ongoing macroeconomic volatility, which would adversely impact its profitability and financial results.\nThe Company faces intense competition in its markets, which could lead to reduced net sales, net earnings and cash flow.\nThe Company faces intense competition from consumer product companies both in the U.S. and in its international markets, and our ability to maintain or gain market share may be impacted by the actions by competitors. The Company’s ability to achieve sales growth depends on its ability to drive growth through innovation, including as part of its IGNITE strategy, expand into new products and categories, channels and countries, invest in its established brands and enhanced merchandising, grow categories with retailers and capture market share from competitors. Most of the Company’s products compete with other widely advertised, promoted and merchandised brands within each product category. The Company also faces competition from retailers, including club stores, grocery stores, drugstores, dollar stores, mass merchandisers, e-commerce retailers and subscription services, which are increasingly offering “private label” brands that are typically sold at lower prices and compete with the Company’s products in certain categories. Increased purchases of “private label” products or other lower priced brands could negatively impact net sales of the Company’s higher-margin products or there could be a shift in product mix to lower-margin offerings, and this would negatively impact its net earnings and profits. The Company’s products generally compete on the basis of product performance, brand reputation and recognition, image and price, thereby requiring substantial expenditures for advertising, sales promotion and trade merchandising to gain and maintain market position. The Company is also\n\neach calendar year. The volume and sales of grilling products may be affected by weather conditions.\nNet sales to the Company’s largest customer, Walmart Stores, Inc. and its affiliates, were 27%, 25% and 26% of consolidated net sales for each of the fiscal years ended June 30, 2025, 2024 and 2023, respectively, and occurred across all of the Company’s reportable segments. No other customers accounted for 10% or more of the Company’s consolidated net sales in any of these fiscal years. The Company’s five largest customers accounted for nearly half of the Company’s consolidated net sales for each of the fiscal years 2025, 2024 and 2023.\nThe markets for consumer products are highly competitive. The Company’s products compete with other nationally advertised brands and with “private label” brands within each category. Competition comes from similar and alternative products, some of which are produced and marketed by major multinational or national companies having financial resources greater than those of the Company. In addition, the Company faces competition from retailers, including club stores, grocery stores, drugstores, dollar stores, mass merchandisers, e-commerce retailers and subscription services. The Company’s products generally compete on the basis of product performance, brand reputation and recognition, image and price. A newly introduced consumer product (whether improved or newly developed) usually encounters intense competition requiring substantial expenditures for advertising, sales promotion and trade merchandising support. If a product gains consumer acceptance, it typically requires continued advertising and promotional support and ongoing product innovation to maintain its relative market position. For further information regarding the intense competition the Company faces, see “Risk Factors – The Company faces intense competition in its markets, which could lead to reduced net sales, net earnings and cash flow.” in Item 1.A.\nEnvironmental Matters\nFor information regarding noncapital expenditures related to environmental matters, see the discussions below under “Risk Factors – Environmental matters create potential liabilities that could adversely affect the Company’s financial condition and results of operations.” in Item 1.A. No material capital expenditures relating to environmental compliance are presently anticipated.\nHUMAN CAPITAL MANAGEMENT\nThe Clorox Company is led by its purpose to champion people to be well and thrive every single day, including employees, consumers and communities served around the world.\nClorox employees are committed to making a meaningful, positive impact through their work and to authentically living the Company’s values: to do the right thing, put people at the center and play to win. These foundational values underpin everything the Company does and are essential to achieving long-term success.\nThe Company’s purpose and values also are fully embedded in its IGNITE strategy, alongside its integrated goals for sustainability which promote healthy lives, a clean world and thriving communities, all supported by strong corporate governance.\n\nWidespread use of social media and networking sites by consumers has greatly increased the accessibility and speed of dissemination of information (whether accurate or inaccurate). Negative publicity, posts or comments about the Company, its brands, its products, its marketing activities, whether accurate or inaccurate, or disclosure of non-public sensitive information about the Company, could be widely disseminated through the use of social media or in other formats. Additionally, marketing initiatives may not have the desired effect on a brand’s or product’s image. Such events, if they were to occur, could harm the Company’s image and adversely affect its business, financial condition and results of operations, as well as require resources to rebuild the Company’s reputation.\nIn addition, the legal, regulatory and ethical landscape around the use of artificial intelligence and machine learning is rapidly evolving. While the Company’s success may increasingly become dependent on its ability to adopt and effectively leverage this emerging technology, it may not be able to do so in an effective manner. This technology could also prove to be, among other things, false, biased, or inconsistent with the Company’s values and strategies, which could lead to operational disruptions, flawed decision-making, increased costs, or reputational harm. Further, the use of generative artificial intelligence tools may compromise confidential or sensitive information, put the Company’s intellectual property at risk, or subject the Company to claims of intellectual property infringement, all of which could damage the Company's reputation.\nDependence on key customers could adversely affect the Company’s business, financial condition and results of operations.\nA limited number of customers account for a large percentage of the Company’s net sales. Net sales to the Company’s largest customer, Walmart Stores, Inc. and its affiliates, were 27%, 25%, and 26% of consolidated net sales for the fiscal years ended June 30, 2025, 2024, and 2023, respectively, and occurred across all of the Company’s reportable segments. The Company’s five largest customers accounted for nearly half of",
  "item7_clean": "ITEM 7. MANAGEMENT’S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS\nThis information appears under “Management’s Discussion and Analysis of Financial Condition and Results of Operations,” in Exhibit 99.1, which is incorporated herein by reference.\nITEM 7.A. QUANTITATIVE AND QUALITATIVE DISCLOSURES ABOUT MARKET RISK\nThis information appears under “Quantitative and Qualitative Disclosures about Market Risk” in “Management’s Discussion and Analysis of Financial Condition and Results of Operations,” in Exhibit 99.1, which is incorporated herein by reference.",
  "item2_clean": null
}