{
  "source_file": "clx-20250930.htm",
  "form_type": "10-Q",
  "item1_clean": null,
  "item7_clean": null,
  "item2_clean": "as a percentage of net sales, increased by 20 basis points in the current period as compared to the prior period, while dollars were essentially flat. The increase in research and development costs as a percentage of net sales was primarily due to lower net sales in the current period related to the ERP transition. The Company continues to invest in product innovation and cost savings.\nLoss on divestiture, interest expense, other (income) expense, net and the effective tax rate on earnings\nOther (income) expense, net\nEffective tax rate on earnings\nof $118 in the prior period reflected the loss on the divestiture of the Better Health VMS business. See notes to condensed consolidated financial statements for further information.\nOther (income) expense, net\nwas ($5) and ($22) in the current and prior periods, respectively. The variance between the current and prior periods was primarily due to lapping the benefit of insurance recoveries mainly related to the cyberattack in fiscal year 2024.\nThe effective tax rate on earnings\nand 41.8% for the current and prior periods, respectively.The higher tax rate in the prior period as compared to the current period was primarily driven by the nondeductibility of the loss on the divestiture of the Better Health VMS business in the prior period.\nDiluted net earnings per share\nDiluted net earnings per share\nDiluted net earnings per share (EPS)\ndecreased by $0.15, or 19%, in the current period, primarily due to lower net sales in the current period, partially offset by the loss relating to the divestiture of the Better Health VMS business in the prior period.\nSEGMENT RESULTS\nThe following presents the results of the Company’s reportable segments and Corporate and Other. See notes to condensed consolidated financial statements for further discussion of the principal measure of segment profitability used by management, segment adjusted earnings (losses) before interest and income taxes (segment adjusted EBIT):\nReportable segment total\nSegment adjusted EBIT\nReportable segment total\nCyberattack costs, net of insurance recoveries\nDigital capabilities and productivity enhancements investment\nEarnings before income taxes\nSee “Non-GAAP Financial Measures” below for reconciliation of segment adjusted EBIT to earnings before income taxes, the most directly comparable GAAP financial measure.\nSEGMENT RESULTS (Continued)\nSegment adjusted EBIT\nVolume, net sales and segment adjusted EBIT decreased by 16%, 19% and 47%, respectively, during the current period. The volume decrease was primarily due to lower shipments in the current period following the incremental shipments related to the ERP transition in the fourth quarter of fiscal year 2025. The variance between volume and net sales was primarily due to unfavorable price mix. The decrease in segment adjusted EBIT was primarily due to lower net sales and higher manufacturing and logistics costs.\nSegment adjusted EBIT\nVolume, net sales and segment adjusted EBIT decreased by 18%, 19% and 55%, respectively, during the current period. The volume decrease was primarily due to lower shipments in the current period following the incremental shipments related to the ERP transition in the fourth quarter of fiscal year 2025. The decrease in segment adjusted EBIT was mainly due to lower net sales.\nSegment adjusted EBIT\nVolume, net sales and segment adjusted EBIT decreased by 22%, 23% and 42%, respectively, during the current period. The volume decrease was primarily due to lower shipments in the current period following the incremental shipments related to the ERP transition in the fourth quarter of fiscal year 2025. The decrease in segment adjusted EBIT was primarily due to lower net sales, partially offset by lower advertising investments as compared to the prior period.\nSegment adjusted EBIT\nBoth volume and net sales decreased by 2%, and segment adjusted EBIT decreased by 46% during the current period. The volume decrease was primarily due to lower shipments in the current period following the incremental shipments related to the ERP transition in the fourth quarter of fiscal year 2025. The decrease in segment adjusted EBIT was primarily due to higher manufacturing and logistics costs.\nSEGMENT RESULTS (Continued)\nCorporate and Other includes certain non-allocated administrative and other costs, various other non-operating income and expenses, as well as the results of the Better Health VMS business, through the date of divestiture.\nSegment adjusted EBIT\nNet sales decreased by 89% in the current three month period due to the divestiture of the Better Health VMS business in the first quarter of fiscal year 2025.\nSegment adjusted EBIT increased by 25% in the current three month period. The increase in segment adjusted EBIT in the current three month period was primarily due to reductions in employee related expenses primarily due to lower employee incentive compensation and lower Better Health VMS operating expenses in the current period due to the divestiture.\nIn the first quarter of fiscal year 2025, the Company completed the divestiture of its Better Health VMS business. See notes to condensed consolidated financial statements for further information.\nFINANCIAL POSITION AND LIQUIDITY\nThe Company’s financial condition and liquidity remained strong as of September 30, 2025. The following table summarizes cash activities:\nNet cash provided by operations\nNet cash (used for) provided by investing activities\nNet cash used for financing activities\nOperating Activities\nNet cash provided by operations was $93 in the current three month period, compared with $221 in the prior three month period. The decrease was primarily driven by lower cash earnings partially offset by lower working capital in the current three month period (lower Accounts receivable and higher Accounts payable and accrued liabilities partially offset by higher Inventories). The lower cash earnings, lower Accounts receivable balance and higher inventories balance were primarily due to the lower shipments in the current three month period following the incremental shipments related to the ERP transition in the fourth quarter of fiscal year 2025. The higher Accounts payable and accrued liabilities balance was due to the timing of payments.\nPayment Terms Extension and Supply Chain Financing\nThe Company has arranged for a global financial institution to offer a voluntary supply chain finance (SCF) program for the benefit of the Company’s suppliers. The Company’s current payment terms do not exceed 120 days in keeping with industry standards. The Company’s operating cash flows are directly impacted as a result of the extension of payment terms with suppliers. There would not be an expected material impact to the Company’s liquidity or capital resources if the financial institution or a supplier terminated the SCF arrangement. While the Company does not have direct access to information on, or influence over, which invoices a participating supplier elects to sell to the financial institution, the Company expects that the majority of these amounts have been sold to the financial institution. Refer to the notes to condensed consolidated financial statements for detail on the SCF program.\nInvesting Activities\nNet cash used for investing activities was $34 in the current three month period, compared with net cash proceeds of $89 in the prior three month period. The year-over-year change was mainly due to net proceeds from the sale of the Better Health VMS business in the prior three month period.\nFINANCIAL POSITION AND LIQUIDITY (Continued)\nFinancing Activities\nNet cash used for financing activities was $59 in the current three month period, compared with $237 in the prior three month period. The year-over-year change was mainly due to higher cash sourced from short term borrowings in the current three month period.\nCapital Resources and Liquidity\nAs of September 30, 2025\n, current liabilities exceeded current assets by $539, primarily due to the Company's Glad venture agreement terminal obligation coming due for payment in January 2026. This balance is classified within Accounts payable and accrued l\niabilities as it is reasonably expected to be settled within one year. The venture agreement terminal obligation is expected to be repaid through the Company’s anticipated ability to generate positive cash flows from operations in the future, access to capital markets enabled by our strong short-term and long-term credit ratings and current borrowing availability.\nNotwithstanding potential unforeseen adverse market conditions and as part of the Company’s regular assessment of its cash needs, the Company believes it will have the funds necessary to support its short- and long-term liquidity and operating needs, including its digital capabilities and productivity enhancements investment and venture agreement terminal obligation based on its anticipated ability to generate positive cash flows from operations in the future, access to capital markets enabled by our strong short-term and long-term credit ratings and current borrowing availability.\nThe Company has an agreement with The Procter & Gamble Company (P&G) for the Company’s Glad bags and wraps business. As of both September 30, 2025 and June 30, 2025, P&G had a 20% interest in the venture.\nThis agreement is now scheduled to expire in January 2026 as\nthe parties jointly did not opt to further extend the term of the agreement. Upon termination of the agreement, the Company is required to purchase P&G’s 20% interest for cash at fair value as established by predetermined valuation procedures.\nThe Company performed a valuation of the Glad bags and wraps business in the third quarter of fiscal year 2025 in connection with an update of the Company’s financial projections. As of September 30, 2025 and June 30, 2025 the estimated fair value of P&G’s interest in the venture was $476, of which $488 and $501, respectively, was recognized and reflected in Account"
}