{
  "source_file": "cme-20241231.htm",
  "form_type": "10-K",
  "item1_clean": "We have further focused on building upon cloud-based data distribution capabilities as a more flexible and potentially efficient means of providing data to our clients.\nIn 2024, CME Group futures and options had a record average daily volume\nof 26.5 million contracts\n, with a volume record in our interest rates asset class for the\nconsecutive year. It was also a year of volume records for multiple products, including Treasury futures and Ultra 10 Year Treasury Note futures, SOFR futures, Bitcoin futures, Natural Gas (futures and options), Metals futures and options and a record number of contracts executed via Basis Trade at Index Close (\"BTIC\"). We continue to expand and deepen our customer base worldwide and offer customers around the world the most broad and diversified portfolio of benchmark products. Some of our new products introduced over the past year include:\nAdditional Cryptocurrency Reference Rates and Real-Time Indices\nOptions on Euro short-term Rate Futures (€STR)\nE-mini S&P 500 Equal Weight Futures\nEuro-denominated Bitcoin and Ether Futures\nCredit Futures and Repo on Corporate Bonds on BrokerTec\nCBOT Wheat - Euronext Milling Wheat No. 2 Spread futures contract and the KC HRW Wheat - Euronext Milling Wheat No. 2 Spread futures contract\nOptions on Bloomberg Commodity Index (BCOM) Futures\nYen- and U.S.-dollar denominated micro Nikkei Futures\nOptions on E-mini Select Sector Futures and Dow Jones U.S. Real Estate Index Futures\nIn addition to the individual product launches noted above, we have completed many product extensions across our asset classes, including short-dated options products (Monday options on U.S. Treasury Futures, Tuesday and Thursday options on WTI Crude Oil, Tuesday and Thursday options on Gold, Silver, and Copper, and Bitcoin Friday futures).\nWe continue to expand and deepen our customer base worldwide and offer customers around the world with the most broad and diversified portfolio of benchmark products. We believe we have a significant opportunity to expand the participation of our non-U.S. customer base in our markets. Our penetration of these markets lags our development in the U.S., and we believe that there is room for significant growth and development of these financial market\ns. In 2024, approximately 31% of our electronic futures and options volume was from transactions reported as outside the U.S. and approximately 54% of our market data revenue was derived from outside the U.S. We also achieved 17% growth in trading volume during European trading hours and 7% growth during Asia Pacific trading hours in 2024 compared to 2023. We have increased our customer base and continue to target cross-asset opportunities across client segments and across cash and futures platforms, driving sale and generating new client participation across all regions. We have a history of providing customer value and responsiveness and believe our products and services position us to help our customers adapt to and comply with new regulations, while enabling them to\nefficiently manage their risks. We continue to add new channel partners to help us expand the reach of CME Group offerings. We have a broad distribution network around the globe comprised of a combination of internal and external channels and proprietary front-end capabilities.\nCME Group continues to introduce tools which assist our clients in managing their risks. The FX and Metals Market Profile Tools on Quant Analytics offer simple and effective methods for clients to compare and contrast our leading FX and metals products and liquidity pools side-by-side, which in turn enables clients to analyze their opportunity to minimize costs and achieve best execution by accessing highly complementary liquidity pools across cash and futures markets. We expect to continue to expand our analytics suite in the future as well.\nIn 2024, we launched €STRWatch to help clients manage risk around European Central Bank (ECB) policy decisions. This tool builds on the success of CME Group’s FedWatch, SOFRWatch and TreasuryWatch tools.\nCME Group Volatility Indexes (CVOL) comprises a total of 42 indexes, including 7 unique broad-based benchmarks such as the Treasury Volatility Index and Commodity Volatility Index.\nIn 2025, we are planning to launch CME FX Spot+ as another tool for our customers to increase access, transparency and trading opportunities across spot FX and FX futures markets. CME FX Spot+ is an all-to-all spot FX marketplace that will connect liquidity between two trading environments, whereby spot FX participants will have expanded access to CME FX futures liquidity in OTC spot terms within an open, transparent, central limit order book environment, while FX futures market users will have expanded access to OTC FX liquidity.\nWe continue to enhance our retail strategy focusing on the growth of top-tier and large new-to-futures brokers, which resulted in a record number of new retail accounts. Retail remains a core tenet of our new client acquisition strategy, and we are focused on bringing new-to-futures brokers to our markets.\nDiversify our Business and Revenue\n\nTogether, our platforms offer:\ncertainty and flexibility of execution;\nextensive capabilities to facilitate complex and demanding trading;\ndirect market access;\nopen access, price transparency and anonymity;\nconvenience and efficiency;\nconnectivity through highly secure, resilient and low-latency network options;\naccess to market data; and\nglobal distribution, including connectivity through high-speed international telecommunications hubs in key financial centers.\nWe maintain comprehensive business continuity and disaster recovery plans, as well as facilities designed to provide nearly continuous availability of our markets in the event of a business disruption or disaster. We also maintain incident and crisis management plans that address responses to disruptive events.\nThe customer base of our derivatives exchanges includes professional traders, financial institutions, institutional and individual investors, major corporations, manufacturers, producers, governments and central banks. Customers may be members of one or more of our exchanges. Rights to directly access our derivatives markets will depend upon the nature of the customer, such as whether the entity or individual is a member of one of our exchanges or has executed an agreement with us for direct access.\nU.S. trading rights and privileges are exchange-specific. Open outcry trading is conducted exclusively by our members. Membership on one of our derivatives exchanges also enables a customer to trade specific products at lower fees. Under the terms of the organizational documents of our exchanges, our members have certain rights that relate primarily to trading right protections, certain trading fee protections and certain membership benefit protections. In 2024\nour contract volume was from trades by our members.\nCME Clearing Business:\nThrough our clearing house operated by CME, we provide clearing and settlement services for a broad range of exchange-traded futures and options on futures contracts and OTC derivatives. Our integrated clearing function is designed to ensure the safety and the soundness of our markets by serving as the counterparty to every trade, becoming the buyer to each seller and the seller to each buyer, and limiting counterparty credit risk. The clearing house marks open positions to market at least twice a trading day, requiring payments from clearing firms whose positions have lost value and making payments to clearing firms whose positions have gained value. For select cleared-only markets, positions are marked-to-market daily, with the capacity to mark-to-market more frequently as market conditions warrant. The CME ClearPort front-end system provides access to our flexible clearing services over multiple asset classes. For certain of these exchange-traded derivatives contracts, the clearing house assists in the administration of physical delivery of the underlying product. The clearing house does not guarantee physical delivery. Rather, in the event of a delivery failure, the clearing house has a financial performance obligation to the clearing member whose actions or omissions did not cause or contribute to the delivery failure. The clearing house also monitors the risk and operational capabilities for facilitating the delivery for physically deliverable exchange-traded derivatives contracts as outlined below.\nThe majority of clearing and transaction fees received from clearing firms represents charges for trades executed and cleared on behalf of their customers. One firm represented at least 10% of our clearing and transaction fees revenue for 2024. In the event a clearing firm were to withdraw, our experience indicates that the customer portion of the firm's trading activity would likely transfer to one or more other clearing firms of the exchange.\nCash Markets Business:\nOur cash markets business comprises BrokerTec and EBS, primarily operated on CME Globex. Certain BrokerTec products are cleared through third-party clearing houses. BrokerTec is fully integrated with all major ISVs for order entry and staging as well as post trade for clearing and settlement, offering an efficient and fully electronic end-to-end trade workflow solution. BrokerTec and EBS offer anonymous and disclosed trading venues, offering clients multiple execution and distribution options and the benefit of an established and far-reaching distribution network of liquidity providers and consumers.\nBrokerTec operates global electronic trading for fixed income and money market products, with a leading position in cash U.S. Treasuries, European Government Bonds, and Repo on European Union (E.U.), United Kingdom (U.K.), U.S. and other international G10, emerging market fixed income instruments and Supranational and Agency Bonds. It facilitates trading for banks and non-bank professional trading firms. The BrokerTec Central Limit Order Book is a dealer-to-dealer electronic trading platform operated on CME Globex. BrokerTec Quote is a Request For Quote platform provided on third-party technology, that offers a dealer-to-client trading solution for the global government bond repo (including Emerging Markets) and credit repo markets. BrokerTec Quote also offers securities lending in European debt. BrokerTec Stream is a relationship-based trading platform offering U.S. Treasury instruments.\nEBS provides for the trading of global FX products across major and emerging market currencies and Spot Precious Metals. EBS Market is a Central Limit Order Book electronic trading platform for spot FX, Spot Precious Metals and NDFs. EBS Direct is a relationship-based trading platform offering Spot FX, Spot Precious Metals (and previously, FX forwards and FX swaps until the cessation of that business in April 2024).\nMarket Data Business:\nWe offer a variety of market data services through industry-leading market data platforms and third-party distribution partners, which are designed to meet the risk-management, trading, investment and business needs of our global client base. To this end, we provide proprietary real-time and historical market data related to CME Group’s deeply liquid exchanges and cash markets businesses. We further offer derived cash markets pricing, third-party and alternative data sets, as well as a wide range of analytic tools. As customers continue to leverage cloud technology to improve and evolve their businesses, CME Group has taken a leading role by becoming the first derivatives marketplace to provide live market data natively on the Google Cloud. CME Group is also the distributor of leading benchmark equity and commodity indices on behalf of third parties, as well as a distributor and licensor of our own proprietary benchmarks and indices, including CME Term SOFR Reference Rates (CME Term SOFR) and Term €STR Reference Rates, which adhere to the IOSCO Principles for Financial B",
  "item7_clean": "ITEM 7. MANAGEMENT’S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS\nINTRODUCTION\nManagement’s Discussion and Analysis of Financial Condition and Results of Operations is organized as follows:\n: Includes an overview of our business; current economic, competitive and regulatory trends relevant to our business; our current business strategy; and our primary sources of operating and non-operating revenues and expenses.\nCritical Accounting Policies\n: Provides an explanation of accounting policies that may have a significant impact on our financial results and the estimates, assumptions and risks associated with those policies.\nResults of Operations\n: Includes an analysis of our 2024 financial results and a discussion of any known events or trends that are likely to impact future results.\nLiquidity and Capital Resources\n: Includes a discussion of our future cash requirements, capital resources, significant planned expenditures and financing arrangements.\nReferences in this discussion and analysis to \"we\" and \"our\" are to CME Group Inc. (CME Group) and its consolidated subsidiaries, collectively. References to \"exchange\" are to Chicago Mercantile Exchange Inc. (CME), the Board of Trade of the City of Chicago, Inc. (CBOT), New York Mercantile Exchange, Inc. (NYMEX) and Commodity Exchange, Inc. (COMEX), collectively, unless otherwise noted.\nEXECUTIVE SUMMARY\nCME Group, a Delaware stock corporation, is the holding company for CME, CBOT, NYMEX, COMEX, NEX and their respective subsidiaries. The holding company structure is designed to provide strategic and operational flexibility. CME Group's Class A common stock is listed on the Nasdaq Global Select Market (Nasdaq) under the ticker symbol \"CME.\"\nOur exchange consists of designated contract markets for the trading of futures and options contracts. We also clear futures, options and swaps contracts through our clearing house. Futures contracts, options contracts and swaps contracts provide investors with vehicles for protecting against, and potentially profiting from, price changes in financial instruments and physical commodities.\nWe are a global company with customer access available virtually all over the world. Our customers consist of professional traders, financial institutions, individual and institutional investors, major corporations, manufacturers, producers, governments and central banks. Customers include both members of the exchange and non-members.\nWe offer our customers the opportunity to trade futures contracts and options contracts on a range of products, including those based on interest rates, equity indexes, foreign exchange, energy, metals and agricultural commodities. Through our cash markets business, we offer fixed income trading through BrokerTec and foreign currency trading through EBS. Our products provide a means for hedging, speculating and allocating assets. We identify new products by monitoring economic trends and their impact on the risk management and speculative needs of our existing and prospective customers.\nMost of our products are available for trading through our electronic trading platforms. These execution facilities offer our customers immediate trade execution and price transparency. In addition, trades can be executed through privately negotiated transactions that are cleared and settled through our clearing house.\nOur clearing house clears, settles and guarantees futures and options contracts traded through our exchanges, in addition to cleared swaps products. Our clearing house's performance guarantee is an important function of our business. Because of this guarantee, our customers do not need to evaluate the credit of each potential counterparty or limit themselves to a selected set of counterparties. This flexibility increases the potential liquidity available for each trade. Additionally, the substitution of our clearing house as the counterparty to every transaction allows our customers to establish a position with one party and offset the position with another party. This contract offsetting process provides our customers with flexibility in establishing and adjusting positions and provides for collateral and margining efficiencies. Certain BrokerTec contracts are cleared at third-party clearing houses.\nEconomic Environment.\nOur customers continue to use our markets as an effective and transparent means to manage risk and meet their investment needs. Trading activity in our centralized markets has fluctuated due to the ongoing uncertainty in the financial markets, fluctuations in the availability of credit, variations in the amount of assets under management as well as the\nFederal Reserve Bank’s interest rate policy. We continue to maintain high quality and diverse products as well as various clearing and market data services, which support our customers in any economic environment.\nCompetitive Environment.\nOur industry is competitive and we continue to encounter competition in all aspects of our business. We expect competition to continue to intensify, especially in light of ongoing regulatory development in the financial services industry. Competition is influenced by our brand and reputation; the efficiency and security of our clearing, settlement and support services; depth and liquidity of our markets; capital and margin efficiencies; diversity of product offerings, including frequency and quality of new product development and innovative services; our ability to position and expand upon existing products to address changing market needs; efficient and seamless customer experience; transparency, reliability, anonymity and security of transaction processing; the regulatory environment; connectivity, accessibility, flexibility in execution methods, and distribution; and technology capability and innovation, as well as overall transaction costs. We believe we are very well positioned with respect to these factors. Our asset classes contain products designed to address differing risk management needs, and customers are able to achieve operational and capital efficiencies by accessing our diverse products through our platforms and our clearing house. We compete in a large and expanding financial services trading, clearing and settlement marketplace globally. As markets continue to evolve, we will continue to adapt our trading technology and clearing services to meet the needs of our customers. The competitive environment to which we are subject is discussed in \"Item 1 - Business\" beginning o\nRegulatory Environment.\nOur exchange-traded derivatives exchanges and other businesses are regulated and we serve a customer base that includes regulated institutions and individuals. Developments in the regulatory environment have the potential to significantly impact our business. Compliance with regulations may require us and our customers to dedicate significant financial and operational resources, which could advers\nely affect our profitability. The regulatory environment to which we are subject is discussed in \"Item 1 - Business\" beginning on page\nOur strategy focuses on maximizing futures and options growth globally, diversifying our business and revenues and delivering unparalleled customer efficiencies and operational excellence, including through our partnership with Google Cloud. This strategy allows us to continue to develop into a more broadly diversified financial exchange that provides trading and clearing solutions across a wide range of products and asset classes. Our strategic initiatives are discussed in \"Item 1 - Business\" beginning o\nClearing and transaction fees.\nA majority of our revenue is derived from clearing and transaction fees, which include electronic trading fees, surcharges for privately negotiated transactions and other volume-related charges for exchange-traded and over-the-counter (OTC) contracts. Because clearing and transaction fees are assessed on a per-contract or notional value basis, revenues and profitability fluctuate with changes in contract volume. In addition to the business trends noted earlier, our contract volume, and consequently our revenues, tend to increase during periods of economic and geopolitical uncertainty as our customers seek to manage their exposure to, or speculate on, the market volatility resulting from that uncertainty.\nWhile volume has the most significant impact on our clearing and transaction fees revenue, there are four other factors that also influence this source of revenue:\nthe percentage of trades executed by customers who are members compared with non-member customers.\nCustomers benefit from volume discounts and limits on fees as part of our effort to increase liquidity in certain products. We offer various incentive programs to promote trading and clearing in various products and geographic locations. We may periodically change fees, volume discounts, fee limits and member discounts, perhaps significantly, based on our review of operations and the business environment.\nWe offer exchange-traded futures and options contracts as well as cleared-only interest rate swap contracts. We also offer foreign exchange spot and forward contracts and fixed income products. Rates are varied by product in order to optimize revenue on existing products and to encourage contract volume upon introduction of new products.\nOur exchange and platforms are an international marketplace that brings together buyers and sellers mainly through our electronic trading as well as through open outcry trading and privately negotiated transactions. Any customer who is guaranteed by a clearing firm and who agrees to be bound by our exchange rules is able to obtain direct access to our electronic platforms. Open outcry trading is conducted exclusively by our members, who may execute trades on behalf of\ncustomers or for themselves. Beginning in July 2023, open outcry trading is now limited to Secured Overnight Financing Rate (SOFR) options products following the permanent closure of most of our open outcry pits.\nTypically, customers submitting trades through our electronic platforms are charged fees for using the platforms in addition to the fees assessed on all transactions executed on our exchange. Customers entering into privately negotiated transactions also incur additional charges beyond the fees assessed on other transactions.\nMember/non-member mix.\nGenerally, member customers are charged lower fees than our non-member customers. Holding all other factors constant, revenue decreases if the percentage of trades executed by members increases, and increases if the percentage of non-member trades increases.\nClearing and transaction fees for cash markets business\n. Our cash markets business provides matching services whereby we match a buyer and seller of financial instruments to allow both parties to complete the trade bilaterally or through a third-party clearing house. We are not involved in the settlement of the contract but charge a transaction fee generally based on volume or notional value of the trade for providing the matching service. BrokerTec Americas also generates revenue from a matched principal business. This business serves as a fully matched counterparty to offsetting positions entered into by clients on our electronic trading platform to facilitate anonymity and access to clearing and settlement. Revenue is generated from this business generally on a transaction fee basis.\nRevenue is also derived from other sources, including market data and information services and other various services related to our exchange operations.\nMarket data and information services.\nWe receive market data and information services revenue from the dissemination of our market data to subscribers. Subscribers can obtain access to our market data services either directly or through third-party distributors.\nOur service offerings include access to real-time, delayed and end-of-day quotations, trade and summary market data for our products and other data sources. Users of our basic service receive real-time quotes and pay a flat monthly fee for each screen, or device, displaying our market data. Alternatively, customers can subscribe to market data provided on a limited group of products. The fee for this service is also a flat rate per month.\nPricing for our market data services is based on the value of the service provided and the price of comparable services offered by our competitors. Increases or decreases in our market data and information services revenue are influenced by changes in our price structure and incentive programs for existing market data offerings, introduction of new market data services and changes in the number of devices in use. General economic factors that affect the financial services industry, which constitutes our primary customer base, also influence revenue from our market data services.\nOther revenue includes access and communication fees. Access and communication fees are connectivity fees charged to members and clearing firms that utilize our various telecommunications networks and communications services. Our communication services include our co-location program as well as the connectivity charges to customers of the CME Globex platform. Access fee revenue varies depending on the type of connection provided to customers.\nOther revenues also include fees for collateral management, equity subscription fees and fees for trade order routing through agreements from various strategic relationships as well as other services to members and clearing firms.\nThe majority of our expenses do not vary directly with changes in our contract volume. However, licensing and other fee agreements can vary directly with certain equity, energy and swap volumes.\nCompensation and benefits.\nCompensation and benefits expense is our most significant expense and includes employee wages, bonuses, stock-based compensation, benefits and employer taxes. Changes in this expense are driven by fluctuations in the number of employees, increases in wages as a result of labor market conditions, changes in rates for employer taxes and other cost increases affecting benefit plans. In addition, this expense is affected by the composition of our workforce. The expense associated with our bonus and stock-based compensation plans can also have a significant impact on this expense category.\nThe bonus component of our compensation and benefits expense is based on our financial performance. Under the performance criteria of our annual incentive plans, the bonus funded under the plans is based on achieving certain financial performance targets established by the compensation committee of our board of directors. The compensation committee has discretion to make equitable adjustments to the cash earnings performance calculation to reflect effects of unplanned operating results or capital expenditures to meet intermediate- to long-term growth opportunities.\nIn general, stock-based compensation is a non-cash expense related to restricted stock and performance share grants. Stock-based compensation varies depending on the quantity and fair value of awards granted. The fair value of restricted stock awards\nand other performance share grants is based on either the share price on the date of the grant or a model of expected future stock prices.\nProfessional fees and outside services.\nThis expense includes fees for consulting services received on strategic and technology initiatives; regulatory and other compliance matters; temporary labor as well as legal and accounting fees. This expense may fluctuate as a result of changes in services required to complete initiatives, handle legal proceedings and comply with regulatory and compliance requirements.\nDepreciation and amortization.\nDepreciation and amortization expense results from the depreciation of long-lived assets such as buildings, leasehold improvements, furniture, fixtures and equipment. This expense also includes the amort",
  "item2_clean": null
}