{
  "source_file": "cme-20250930.htm",
  "form_type": "10-Q",
  "item1_clean": null,
  "item7_clean": null,
  "item2_clean": "(amounts in thousands)\nIn the third quarter and first nine months of 2025, overall metal contract volumes increased when compared with the same periods in 2024. We believe gold volumes increased as a result of increased price volatility caused by investors using gold as a safe-haven alternative investment due to uncertainty in other markets. The decreases in silver and copper volumes are due to reductions in demand for the metals due to economic instability as well as risk aversion by traders. We believe these factors contributed to higher overall metals volumes in the third quarter and first nine months of 2025 compared with the same periods in 2024.\nAverage Rate per Contract\nThe average rate per contract increased in the third quarter and first nine months of 2025 when compared with the same periods in 2024. The increases in the average rate per contract were primarily due to higher commodities, energy and metals contract volumes as a percentage of total volumes. In addition, the overall increases in average rate per contract were due to an increase in our fee structure, which went into effect on February 1, 2025.\nCash Markets Business\nTotal clearing and transaction fees revenues in the third quarter and first nine months of 2025 include $69.8 million and $215.4 million, respectively, of transaction fees attributable to the cash markets business, compared with $68.5 million and $207.9 million, respectively, in the third quarter and first nine months of\n2024. This revenue includes BrokerTec Americas LLC's fixed income volume and EBS's foreign exchange volume.\n(amounts in millions)\nBrokerTec fixed income transaction fees\nEBS foreign exchange transaction fees\nThe related average daily notional value for the\nthird quarter and first nine months of\n2025 and 2024 were as follows:\n(amounts in billions)\nEuropean Repo (in euros)\nOverall average daily notional values for the cash markets business were higher in the third quarter and first nine months of 2025 when compared with the same periods in 2024 due to higher overall U.S. debt issuances. U.S. debt issuances were significantly higher in the third quarter and first nine months of 2025 as a result of the increase of the debt ceiling in early 2025, which resulted in an increase in U.S. Repo volumes. The increase in the third quarter of 2025 was partially offset by lower volatility within our U.S. Treasury products, as a result of more clarity surrounding the Federal Reserve's interest rate policy decision as well as consistent trends in inflation data.\n\n(amounts in thousands)\nSOFR futures and options:\nFutures expiring within two years\nFutures expiring beyond two years\nU.S. Treasury futures and options:\nFederal Funds futures and options\nIn the third quarter of 2025, interest rate contract volume was lower compared to the same period in 2024, due to lower overall market volatility. We believe the lower volatility was a result of more clarity surrounding the Federal Reserve's interest rate policy decision as well as consistent trends in inflation data.\nOverall interest rate contract volume increased in the first nine months of 2025 when compared with the same period in 2024, due to higher overall volatility in early 2025. We believe this was due to market uncertainty surrounding the Federal Reserve's interest rate policy decision as well as mixed inflation data in the first half of 2025. In addition, new and existing geopolitical tensions as well as the potential economic impacts of anticipated and implemented tariffs also led to higher overall volatility in the first half of 2025. We believe these factors contributed to higher overall interest rate volume in the first nine months of 2025 when compared with the same period in 2024.\nEquity Index and Cryptocurrency Products\nThe following table summarizes average daily contract volume for our key equity index and cryptocurrency products.\n\nConcentration of Revenue\nWe bill a substantial portion of our clearing and transaction fees directly to our clearing firms. The majority of clearing and transaction fees received from clearing firms represent charges for trades executed and cleared on behalf of their customers\n. One individual firm represented at least\nur clearing and transaction fees in the first nine months of 2025. Should a clearing firm withdraw, we believe that the customer portion of the firm’s trading activity would likely transfer to another clearing firm of the exchange. Therefore, we do not believe we are exposed to significant risk from the ongoing loss of revenue received from or through a particular clearing firm.\nOther Sources of Revenue\nMarket data and information services\n. During the third quarter and first nine months of 2025, overall market data and information services revenues increased when compared with the same periods in 2024, largely due to price increases for certain products as well as higher usage of certain products.\nThe two largest resellers of our market data represented approximately 31% of our market data and information services revenue in the first nine months of 2025. Despite this concentration, we consider exposure to significant risk of revenue loss to be minimal. In the event that one of these vendors no longer subscribes to our market data, we believe the majority of that vendor’s customers would likely subscribe to our market data through another reseller. Additionally, several of our largest institutional customers that utilize services from our two largest resellers report usage and remit payment of their fees directly to us.\n\nGiven our cash flow generation, our ability to pay down debt levels and our ability to refinance existing debt facilities if necessary, we expect to maintain an investment grade rating. If our ratings are downgraded below investment grade within certain specified time periods due to a change of control, we are required to make an offer to repurchase our fixed rate notes at a price equal to 101% of the principal amount, plus accrued and unpaid interest. No report of any rating agency is incorporated by reference herein.\nLiquidity and Cash Management\n. Cash and cash equivalents totaled $2.4 billion an\nd $2.9 billion at September 30, 2025 and December 31, 2024, respectively. The balance retained in cash and cash equivalents is a function of anticipated or possible short-term cash needs, prevailing interest rates, our corporate investment policy and alternative investment choices. A majority of our cash and cash equivalents balance is invested in money market mutual funds that invest only in U.S. Treasury securities, U.S. government agency securities and U.S. Treasury security reverse repurchase agreements and short-term bank deposits. Our exposure to credit and liquidity risk is minimal given the nature of the investments. Cash that is not available for general corporate purposes because of regulatory requirements or other restrictions is classified as restricted cash and is included in cash performance bonds and guaranty fund contributions, other current assets or other assets in the consolidated balance sheets.\nOn December 5, 2024, we announced that our board of directors has approved a shar\ne repurchase program under which we are authorized to repurchase up to $3.0 billion of our outstanding Class A common stock, par value $0.01 per share (the common stock), from time to time through open market transactions, block trades, privately negotiated purchase transactions or other purchase techniques and may include purchases effected pursuant to one or more trading plans established pursuant to Rule 10b5-1 under the Exchange Act. The timing of any repurchases and the number of shares repurchased under the share repurchase program are within our discretion and may be affected by various factors, including general market and economic conditions; the market price of the common stock; CME Group’s earnings, financial condition, capital requirements and levels of indebtedness; legal requirements; and other considerations. The share repurchase program has no expiration date, does not obligate us to acquire any particular amount of common stock and may be modified, suspended or terminated at any time. As of September 30, 2025, the maximum remaining value of shares to be repurchased was $2,991.8 million.\nRegulatory Requirements\nCME is regulated by the CFTC as a Derivatives Clearing Organization (DCO). DCOs are required to maintain capital, as defined by the CFTC, in an amount at least equal to one year of projected operating expenses as well as cash, liquid securities, or a line of credit at least equal to six months of projected operating expenses. CME was designated by the Financial Stability Oversight Council as a systemically important financial market utility under Title VIII of the Dodd-Frank Wall Street Reform and Consumer Protection Act. As a result, CME must comply with CFTC regulations applicable to a systemically important DCO for financial resources and liquidity resources. CME is in compliance with all DCO financial requirements.\nCME, CBOT, NYMEX and COMEX are regulated by the CFTC as Designated Contract Markets (DCM). DCMs are required to maintain capital, as defined by the CFTC, in an amount at least equal to one year of projected operating expenses as well as cash, liquid securities or a line of credit at least equal to six months of projected operating expenses. Our DCMs are in compliance with all DCM financial requirements.\nBrokerTec Americas LLC is required to maintain sufficient net capital under Securities Exchange Act of 1934, as amended (Exchange Act), Rule 15c3-1 (the Net Capital Rule). The Net Capital Rule focuses on liquidity and is designed to protect securities customers, counterparties, and creditors by requiring that broker-dealers have sufficient liquid resources on hand at all times to satisfy claims promptly. Rule 15c3-3, or the customer protection rule, which complements Rule 15c3-1, is designed to ensure that customer property (securit"
}