{
  "source_file": "cmg-20250930.htm",
  "form_type": "10-Q",
  "item1_clean": null,
  "item7_clean": null,
  "item2_clean": "ITEM 2. MANAGEMENT’S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS\nCautionary Note Regarding Forward-Looking Statements\nAs of September 30, 2025, we owned 3,822 Chipotle restaurants throughout the United States and 94 international Chipotle restaurants. Additionally, we had seven international partner-operated restaurants. We manage our U.S. operations based on 11 regions and aggregate our operations to one reportable segment.\nThroughout “Management’s Discussion and Analysis of Financial Condition and Results of Operations” we discuss the following key operating metrics which we believe will drive our financial results and long-term growth model. We believe these metrics are useful to investors because management uses these metrics to assess the growth of our business and the effectiveness of our marketing and operational strategies:\nComparable restaurant sales\nFood, beverage, and packaging as a percentage of total revenue\nLabor as a percentage of total revenue\nOccupancy as a percentage of total revenue\nOther operating costs as a percentage of total revenue\nNew restaurant openings\nThird Quarter 2025 Financial Highlights, year-over-year:\nTotal revenue increased 7.5% to $3.0 billion\nComparable restaurant sales increased 0.3%\nDiluted earnings per share was $0.29, a 3.6% increase from $0.28\n. Comparable restaurant sales increased 0.3% for the three months ended September 30, 2025. The increase is attributable to a 1.1% increase in average check, partially offset by lower transactions of 0.8%. Comparable restaurant sales represent the change in period-over-period total revenue for company-owned restaurants in operation for at least 13 full calendar months. Digital sales represented 36.7% of total food and beverage revenue. For full-year 2025, management is anticipating comparable restaurant sales declines in the low-single digit range.\nRestaurant Development.\nDuring the three months ended September 30, 2025, we opened 84 restaurants, which included 64 restaurants with a Chipotlane. We remain on track to open approximately 315 to 345 company-owned restaurants in 2025 and expect to open approximately 350 to 370 restaurants in 2026, which includes 10 to 15 international partner-operated restaurants. We expect that at least 80% of our new company-owned restaurants will include a Chipotlane.\nPartner-Operated Restaurants.\nDuring the three months ended September 30, 2025, we opened two partner-operated restaurants in the Middle East.\nThe following table details company-owned restaurant unit data for the periods indicated.\nChipotle permanent closures\nChipotle relocations\nTotal at end of period\nThe following table details partner-operated restaurant unit data for the periods indicated.\nPartner-operated openings\nTotal at end of period\nResults of Operations\nOur results of operations as a percentage of total revenue and period-over-period change are discussed in the following section.\n\n(dollars in millions)\n(dollars in millions)\nFood and beverage revenue\nDelivery service revenue\nAverage restaurant sales\nComparable restaurant sales increase/(decrease)\nAverage restaurant sales refers to the average trailing 12-month food and beverage revenue for company-owned restaurants in operation for at least 12 full calendar months.\nThe following is a summary of the change in restaurant sales for the period indicated:\n(dollars in millions)\nFor the period ended September 30, 2024\nComparable restaurant sales\nRestaurants not yet in comparable base opened in 2025\nRestaurants not yet in comparable base opened in 2024\nFor the period ended September 30, 2025\nFood, Beverage and Packaging Costs\n(dollars in millions)\n(dollars in millions)\nFood, beverage and packaging\nAs a percentage of total revenue\nFood, beverage and packaging costs decreased 0.6% as a percentage of total revenue for the three months ended September 30, 2025 compared to the three months ended September 30, 2024. The decrease was primarily due to a 0.6% benefit from menu price increases in the prior year and, to a lesser extent, cost of sales efficiencies. This decrease was partially offset by a 0.3% inflation, primarily in beef and chicken, and a 0.3% impact from the newly enacted tariffs.\nFood, beverage and packaging costs decreased 0.2% as a percentage of total revenue for the nine months ended September 30, 2025 compared to the nine months ended September 30, 2024. The decrease was primarily due to a 0.7% benefit from menu price increases in the prior year and, to a lesser extent, from cost of sales efficiencies. This decrease was partially offset by a 0.5% inflation across several ingredient costs, primarily beef and chicken, and a 0.1% impact from the newly enacted tariffs.\nDue to goods imported prior to the enactment of tariffs, we anticipate about a 40 basis point increase in food, beverage and packaging costs during the fourth quarter of 2025 relating to tariffs. We estimate that the tariffs enacted since April 2025 will increase food, beverage and packaging costs by about 50 basis points on an ongoing basis. These estimates could vary based on future tariff policy changes.\n(dollars in millions)\n(dollars in millions)\nAs a percentage of total revenue\nLabor costs increased 0.3% as a percentage of total revenue for the three months ended September 30, 2025 compared to the three months ended September 30, 2024. Labor increased primarily due to a 0.5% impact of lower sales volumes and 0.2% from restaurant wage inflation. These increases were partially offset by a 0.5% benefit from menu price increases in the prior year.\nLabor costs increased 0.5% as a percentage of total revenue for the three and nine months ended September 30, 2025 compared to the three and nine months ended September 30, 2024. The increase was primarily due to a 0.7% impact of lower sales volumes and 0.4% from restaurant wage inflation, including minimum wage increases for our restaurants in California. This increase is partially offset by a 0.6% benefit from menu price increases in the prior year.\n(dollars in millions)\n(dollars in millions)\nAs a percentage of total revenue\nOccupancy costs increased 0.2% as a percentage of total revenue for t\nonths ended September 30, 2025 compared to the three months ended September 30, 2024. The increase was due to the impact from lower sales volumes, as a 0.1% benefit from menu price increases in the prior year was offset by expenses associated with new restaurants.\nOccupancy costs increased 0.3% as a percentage of total revenue for t\nonths ended September 30, 2025 compared to the nine months ended September 30, 2024. The increase was due to the impact from lower sales volumes, as a 0.1% benefit from menu price increases in the prior year was offset by expenses associated with new restaurants.\nOther Operating Costs\n(dollars in millions)\n\nProvision for income taxes\nEffective income tax rate\nThe effective income tax rate increased 0.2% for the three months ended September 30, 2025 compared to the three months ended September 30, 2024. The increase was primarily driven by a 0.6% reduction in tax benefits related to option exercises and equity vesting, partially offset by 0.8% in lower non-deductible expenses. Additionally, for the three months ended September 30, 2024, we released certain income tax reserves, which did not similarly recur during the current period impacting the rate by 0.4%.\nThe effective income tax rate remained flat for the nine months ended September 30, 2025 compared to the nine months ended September 30, 2024. The nine months ended September 30, 2025 had a 0.6% decrease in non-deductible expenses, offset mostly by a 0.5% reduction in tax benefits related to option exercises and equity vesting.\nSeasonal factors cause our profitability to fluctuate from quarter to quarter. Historically, our average daily restaurant sales and net income are lower in the first and fourth quarters due, in part, to the holiday season and because fewer people eat out during periods of inclement weather (the winter months) than during periods of mild or warm weather (the spring, summer and fall months). Other factors also have a seasonal effect on our results. For example, restaurants located near colleges and universities generally do more business during the academic year. Seasonal factors, however, might be moderated or outweighed by other factors that may influence our quarterly results, such as unexpected publicity impacting our business in a positive or negative way, disease outbreak, epidemic or endemic, the impact of inflation and consumer sentiment on consumer spending, fluctuations in food or packaging costs, the timing of holidays, or the timing of menu price increases or promotional activities and other marketing initiatives. The number of trading days in a quarter can also affect our results, although, on an overall annual basis, changes in trading days do not have a significant impact.\nOur quarterly results are also affected by other factors such as the amount and timing of non-cash stock-based compensation expense and related tax rate impacts, litigation, settlement costs and related legal expenses, impairment charges and non-operating costs, timing of marketing or promotional expenses, the number and timing of new restaurants opened in a quarter, and closure of restaurants. New restaurants typically have higher operating costs following opening because of the expenses associated with their opening and operating inefficiencies in the months immediately following opening. Accordingly, results for a particular quarter are not necessarily indicative of results to be expected for any other quarter or for any year.\nLiquidity and Capital Resources\nCash and Investments\n, we had a cash and marketable investments balance of\n, non-marketable investments of\nof restricted cash. After funding the current operations in our restaurants and support centers, the first planned use of our cash flow from operations is to provide capital for the continued inv"
}