{
  "source_file": "cmi-20250930.htm",
  "form_type": "10-Q",
  "item1_clean": null,
  "item7_clean": null,
  "item2_clean": "ITEM 2. Management’s Discussion and Analysis of Financial Condition and Results of Operations\nCummins Inc. and its consolidated subsidiaries are hereinafter sometimes referred to as “Cummins,” “we,” “our” or “us.”\nCAUTIONARY STATEMENTS REGARDING FORWARD-LOOKING INFORMATION\nCertain parts of this quarterly report contain forward-looking statements intended to qualify for the safe harbors from liability established by the Private Securities Litigation Reform Act of 1995. Forward-looking statements include those that are based on current expectations, estimates and projections about the industries in which we operate and management’s beliefs and assumptions. Forward-looking statements are generally accompanied by words such as \"anticipates,\" \"expects,\" \"forecasts,\" \"intends,\" \"plans,\" \"believes,\" \"seeks,\" \"estimates,\" \"could,\" \"should,\" \"may\" or words of similar meaning. These statements are not guarantees of future performance and involve certain risks, uncertainties and assumptions, which we refer to as \"future factors,\" which are difficult to predict. Therefore, actual outcomes and results may differ materially from what is expressed or forecasted in such forward-looking statements. Some future factors that could cause our results to differ materially from the results discussed in such forward-looking statements are discussed below and shareholders, potential investors and other readers are urged to consider these future factors carefully in evaluating forward-looking statements. Readers are cautioned not to place undue reliance on forward-looking statements, which speak only as of the date hereof. Future factors that could affect the outcome of forward-looking statements include the following:\nGOVERNMENT REGULATION\nany adverse consequences from changes in tariffs and other trade disruptions;\nany adverse consequences resulting from entering into agreements with the U.S. Environmental Protection Agency (EPA), California Air Resources Board, the Environmental and Natural Resources Division of the U.S. Department of Justice and the California Attorney General's Office to resolve certain regulatory civil claims regarding our emissions certification and compliance process for certain engines primarily used in pick-up truck applications in the U.S., which became final and effective in April 2024, (collectively, the Settlement Agreements), including required additional mitigation projects, adverse reputational impacts and potential resulting legal actions;\nincreased scrutiny from regulatory agencies, as well as unpredictability in the adoption, implementation and enforcement of emission standards around the world;\nevolving environmental and climate change legislation and regulatory initiatives;\nchanges in international, national and regional trade laws, regulations and policies;\nchanges in taxation;\nglobal legal and ethical compliance costs and risks;\nfuture bans or limitations on the use of diesel-powered products;\nBUSINESS CONDITIONS / DISRUPTIONS\nraw material, transportation and labor price fluctuations and supply shortages;\naligning our capacity and production with our demand;\nthe actions of, and income from, joint ventures and other investees that we do not directly control;\nlarge truck manufacturers' and original equipment manufacturers' customers discontinuing outsourcing their engine supply needs or experiencing financial distress, or change in control;\nPRODUCTS AND TECHNOLOGY\nvariability in material and commodity costs;\nthe development of new technologies that reduce demand for our current products and services;\nlower than expected acceptance of new or existing products or services;\nproduct liability claims;\nour sales mix of products;\nGENERAL\nclimate change, global warming, more stringent climate change regulations, accords, mitigation efforts, greenhouse gas regulations or other legislation designed to address climate change;\nour plan to reposition our portfolio of product offerings through exploration of strategic acquisitions, divestitures or exiting the production of certain product lines or product categories and related uncertainties of such decisions;\nincreasing interest rates;\nchallenging markets for talent and ability to attract, develop and retain key personnel;\nexposure to potential security breaches or other disruptions to our information technology (IT) environment and data security;\nthe use of artificial intelligence in our business and in our products and challenges with properly managing its use;\npolitical, economic and other risks from operations in numerous countries including political, economic and social uncertainty and the evolving globalization of our business;\ncompetitor activity;\nincreasing competition, including increased global competition among our customers in emerging markets;\nfailure to meet sustainability expectations or standards, or achieve our sustainability goals;\nlabor relations or work stoppages;\nforeign currency exchange rate changes;\nthe performance of our pension plan assets and volatility of discount rates;\nthe price and availability of energy;\ncontinued availability of financing, financial instruments and financial resources in the amounts, at the times and on the terms required to support our future business; and\nother risk factors described in Part II, Item 1A in this quarterly report and our\n, under the caption \"Risk Factors.\"\nShareholders, potential investors and other readers are urged to consider these factors carefully in evaluating the forward-looking statements and are cautioned not to place undue reliance on such forward-looking statements. The forward-looking statements made herein are made only as of the date of this quarterly report and we undertake no obligation to publicly update any forward-looking statements, whether as a result of new information, future events or otherwise.\nORGANIZATION OF INFORMATION\n\nThe following Management’s Discussion and Analysis of Financial Condition and Results of Operations (MD&A) was prepared to provide the reader with a view and perspective of our business through the eyes of management and should be read in conjunction with our\n. Our MD&A is presented in the following sections:\nEXECUTIVE SUMMARY AND FINANCIAL HIGHLIGHTS\nRESULTS OF OPERATIONS\nREPORTABLE SEGMENT RESULTS\nOUTLOOK\nLIQUIDITY AND CAPITAL RESOURCES\nAPPLICATION OF CRITICAL ACCOUNTING ESTIMATES\nRECENTLY ISSUED ACCOUNTING PRONOUNCEMENTS\nEXECUTIVE SUMMARY AND FINANCIAL HIGHLIGHTS\nWe are a global power leader committed to powering a more prosperous world. Since 1919, we have delivered innovative solutions that move people, goods and economies forward. Our five reportable operating segments - Engine, Components, Distribution, Power Systems and Accelera offer a broad portfolio, including advanced diesel, alternative fuel, electric and hybrid powertrains; integrated power generation systems; critical components such as aftertreatment, turbochargers, fuel systems, controls, transmissions, axles and brakes; and zero emissions technologies like battery and electric powertrain systems and electrolyzers. With a global footprint, deep technical expertise and an extensive service network, we deliver dependable, cutting-edge solutions tailored to our customers' needs, supporting them through the energy transition with our Destination Zero strategy. We sell our products to original equipment manufacturers (OEMs), distributors, dealers and other customers worldwide. We have long-standing relationships with many of the leading manufacturers in the markets we serve, including PACCAR Inc., Traton Group, Daimler Trucks AG and Stellantis N.V. We serve our customers through a service network of approximately 650 wholly-owned, joint venture and independent distributor locations and more than 19,000 Cummins certified dealer locations in approximately 190 countries and territories.\nOur segment reporting structure is organized according to the products and markets each segment serves. The Engine segment produces engines (15 liters and smaller) and associated parts for sale to customers in on-highway and various off-highway markets. Our engines are used in trucks of all sizes, buses and recreational vehicles, as well as in various industrial applications, including construction, agriculture, power generation systems and other off-highway applications. The Components segment sells axles, drivelines, brakes and suspension systems for commercial diesel and natural gas applications, aftertreatment systems, turbochargers, fuel systems, valvetrain technologies, automated transmissions and electronics. The Distribution segment includes wholly-owned and partially-owned distributorships engaged in wholesaling engines, generator sets and service parts, as well as performing service and repair activities on our products, maintaining relationships with various OEMs throughout the world and providing selected sales and aftermarket support for our Accelera business. The Power Systems segment is an integrated power provider, which designs, manufactures and sells standby and prime power generators, engines (16 liters and larger) for standby and prime power generator sets and industrial applications (including mining, oil and gas, marine, rail and defense), alternators and other power components. The Accelera segment designs, manufactures, sells and supports electrified power systems with innovative components and subsystems, including battery, fuel cell and electric powertrain technologies as well as hydrogen production technologies. The Accelera segment is currently in the early stages of commercializing these technologies with efforts primarily focused on the development of electrified power systems and related components and subsystems and our electrolyzers for hydrogen production. We continue to serve all our markets as they adopt electrification and alternative power technologies, meeting the needs of our OEM partners and end customers.\nOur financial performance depends, in large part, on varying c"
}