{
  "source_file": "cms-20241231.htm",
  "form_type": "10-K",
  "item1_clean": "CMS Energy was formed as a corporation in Michigan in 1987 and is an energy company operating primarily in Michigan. It is the parent holding company of several subsidiaries, including Consumers, an electric and gas utility, and NorthStar Clean Energy, primarily a domestic independent power producer and marketer. Consumers’ customer base consists of a mix of primarily residential, commercial, and diversified industrial customers. NorthStar Clean Energy, through its subsidiaries and equity investments, is engaged in domestic independent power production, including the development and operation of renewable generation, and the marketing of independent power production.\nCMS Energy manages its businesses by the nature of services each provides, and operates principally in three business segments: electric utility; gas utility; and NorthStar Clean Energy, its non‑utility operations and investments. Consumers’ consolidated operations account for the substantial majority of CMS Energy’s total assets, income, and operating revenue. CMS Energy’s consolidated operating revenue was $7.5 billion in 2024 and 2023, and $8.6 billion in 2022.\nFor further information about operating revenue, income, and assets and liabilities attributable to all of CMS Energy’s business segments and operations, see Item 8. Financial Statements and Supplementary Data—CMS Energy Consolidated Financial Statements and Notes to the Consolidated Financial Statements.\nConsumers has served Michigan customers since 1886. Consumers was incorporated in Maine in 1910 and became a Michigan corporation in 1968. Consumers owns and operates electric generation and distribution facilities and gas transmission, storage, and distribution facilities. It provides electricity and/or natural gas to 6.8 million of Michigan’s 10 million residents. Consumers’ rates and certain other aspects of its business are subject to the jurisdiction of the MPSC and FERC, as well as to NERC reliability standards, as described in CMS Energy and Consumers Regulation.\nConsumers’ consolidated operating revenue was $7.2 billion in 2024 and 2023, and $8.2 billion in 2022. For further information about operating revenue, income, and assets and liabilities attributable to Consumers’ electric and gas utility operations, see Item 8. Financial Statements and Supplementary Data—Consumers Consolidated Financial Statements and Notes to the Consolidated Financial Statements.\nConsumers owns its principal properties in fee, except that most electric lines, gas mains, and renewable generation projects are located below or adjacent to public roads or on land owned by others and are accessed by Consumers through easements, leases, and other rights. Almost all of Consumers’ properties are subject to the lien of its First Mortgage Bond Indenture. For additional information on Consumers’ properties, see Business Segments—Consumers Electric Utility—Electric Utility Properties and Consumers Gas Utility—Gas Utility Properties.\nIn 2024, Consumers served 1.9 million electric customers and 1.8 million gas customers in Michigan’s Lower Peninsula. Presented in the following map are Consumers’ service territories:\nElectric service territory\nGas service territory\nCombination electric and gas service territory\nCMS Energy and Consumers—The Triple Bottom Line\nFor information regarding CMS Energy’s and Consumers’ purpose and impact on the “triple bottom line” of people, planet, and prosperity, see Item 7. Management’s Discussion and Analysis of Financial Condition and Results of Operations—Executive Overview.\nConsumers Electric Utility\nElectric Utility Operations:\nConsumers’ electric utility operations, which include the generation, purchase, distribution, and sale of electricity, generated operating revenue of $5.1 billion in 2024, $4.7 billion in 2023, and $5.4 billion in 2022. Consumers’ electric utility customer base consists of a mix of primarily residential, commercial, and diversified industrial customers in Michigan’s Lower Peninsula.\nPresented in the following illustration is Consumers’ 2024 electric utility operating revenue of $5.1 billion by customer class:\nConsumers’ electric utility operations are not dependent on a single customer, or even a few customers, and the loss of any one or even a few of Consumers’ largest customers is not reasonably likely to have a material adverse effect on Consumers’ financial condition.\nIn 2024, Consumers’ electric deliveries were 37 billion kWh, which included ROA deliveries of four billion kWh, resulting in net bundled sales of 33 billion kWh. In 2023, Consumers’ electric deliveries were 36 billion kWh, which included ROA deliveries of three billion kWh, resulting in net bundled sales of 33 billion kWh.\nConsumers’ electric utility operations are seasonal. The consumption of electric energy typically increases in the summer months, due primarily to the use of air conditioners and other cooling equipment.\nPresented in the following illustration are Consumers’ monthly weather-normalized electric deliveries (deliveries adjusted to reflect normal weather conditions) to its customers, including ROA deliveries, during 2024 and 2023:\nConsumers’ 2024 summer peak demand was 8,030 MW, which included ROA demand of 603 MW. For the 2023-2024 winter season, Consumers’ peak demand was 5,594 MW, which included ROA demand of 410 MW. As required by MISO reserve margin requirements, Consumers owns or controls, through long-term PPAs, short-term capacity purchases, and auction capacity purchases, all of the capacity required to supply its projected firm peak load and necessary reserve margin for summer 2025.\nElectric Utility Properties:\nConsumers owns and operates electric generation and distribution facilities. For details about Consumers’ electric generation facilities, see the Electric Utility Generation and Supply Mix section that follows this Electric Utility Properties section. Consumers’ distribution system consists of:\n270 miles of high-voltage distribution overhead lines operating at 138 kV\nfour miles of high-voltage distribution underground lines operating at 138 kV\n4,646 miles of high-voltage distribution overhead lines operating at 46 kV and 69 kV\n18 miles of high-voltage distribution underground lines operating at 46 kV\n81,924 miles of electric distribution overhead lines\n9,775 miles of underground distribution lines\n1,098 substations with an aggregate transformer capacity of 28 million kVA\nConsumers is interconnected to the interstate high-voltage electric transmission system owned by METC and operated by MISO. Consumers is also interconnected to neighboring utilities and to other transmission systems.\nElectric Utility Generation and Supply Mix:\nConsumers’ Clean Energy Plan details its strategy to meet customers’ long-term energy needs. The Clean Energy Plan was most recently revised and approved by the MPSC in 2022. Under Michigan’s integrated resource planning process, Consumers will file updates\nto its Clean Energy Plan in 2026. Together with updates to its renewable energy plan that Consumers filed in November 2024, these updated plans will serve as Consumers’ blueprint to meeting the requirements of the 2023 Energy Law that was enacted in Michigan in November 2023.\nUnder its Clean Energy Plan, Consumers will eliminate the use of coal in owned generation in 2025. Specifically, Consumers retired the D.E. Karn coal-fueled generating units in June 2023 and plans to retire the J.H. Campbell coal-fueled generating units in 2025. In order to continue providing controllable sources of electricity to customers while expanding its investment in renewable energy, Consumers purchased the Covert Generating Station, a natural gas-fueled generating facility with 1,200 MW of nameplate capacity, in May 2023. Consumers has also contracted to purchase 400 MW of capacity from battery storage facilities, which will be located in Michigan’s Lower Peninsula and are expected to be operational by 2027.\nIn November 2024, Consumers filed updates to its renewable energy plan, proposing an addition of up to 9,000 MW of both purchased and owned solar energy resources and up to 2,800 MW of new, competitively bid wind capacity. These actions will enable Consumers to achieve 60 percent renewable energy by 2035 and 100 percent clean energy by 2040. For further information on Consumers’ progress towards reducing carbon emissions and towards meeting the requirements of the 2023 Energy Law, see Item 7. Management’s Discussion and Analysis of Financial Condition and Results of Operations—Executive Overview and Outlook—Consumers Electric Utility Outlook and Uncertainties.\nPresented in the following table are details about Consumers’ 2024 electric generation and supply mix:\nName and Location (Michigan)\nNumber of Units and Year Entered Service\n(MW)\nCoal steam generation\nJ.H. Campbell 1 & 2 – West Olive\nJ.H. Campbell 3 – West Olive\nOil/Gas steam generation\nD.E. Karn 3 & 4 – Essexville\nLudington – Ludington\nConventional hydro generation\nCovert Generating Station – Covert\nGas combustion turbines\nZeeland (simple cycle) – Zeeland\nCrescent Wind Farm – Hillsdale County\nEnergy Park – Tuscola County\nGratiot Farms Wind Project – Gratiot County\nHeartland Farms Wind Project – Gratiot County\nEnergy Park – Mason County\nSolar Gardens – Allendale, Cadillac, and Kalamazoo\nBattery storage capacity\nBatteries – Grand Rapids, Cadillac, Kalamazoo, and Standish\nTotal owned generation\nCoal generation – T.E.S. Filer City\nGas generation – MCV Facility\nOther gas generation\nOther renewable generation\nNet interchange power\nTotal purchased and interchange power\nLess distribution and transmission loss\nTotal net bundled sales\nWith the exception of wind and solar generation, the amount represents generation capacity during the summer months (planning year 2024 capacity as reported to MISO and limited by interconnection service limits). For wind and solar generation, the amount represents installed capacity during the summer months.\nConsumers plans to retire these generating units in 2025.\nRepresents Consumers’ share of the capacity of the J.H. Campbell 3 unit, net of the 6.69‑percent ownership interest of the Michigan Public Power Agency and Wolverine Power Supply Cooperative, Inc, each a non\nRepresents Consumers’ 51‑percent share of the capacity of Ludington. DTE Electric holds the remaining 49‑percent ownership interest.\nRepresents Consumers’ share of net pumped-storage generation. The pumped-storage facility consumes electricity to pump water during off-peak hours for storage in order to generate electricity later during peak‑demand hours.\nRepresents purchases under long-term PPAs.\nFor information about Consumers’ long-term PPA related to the MCV Facility, see Item 8. Financial Statements and Supplementary Data—Notes to the Consolidated Financial Statements—Note 3, Contingencies and Commitments—Contractual Commitments.\nRepresents the net amount of generation offered to and purchased from the MISO energy market.\nPresented in the following table are the sources of Consumers’ electric supply for the last three years:\nYears Ended December 31\nTotal owned generation\nRenewable energy generation\nNet interchange power\nTotal purchased and interchange power\nRepresents Consumers’ share of net pumped-storage generation. During 2024, the pumped-storage facility consumed 1,721 GWh of electricity to pump water during off-peak hours for storage in order to generate 1,263 GWh of electricity later during peak-demand hours.\nRepresents purchases under long-term PPAs.\nRepresents purchases from a nuclear generating facility that closed in May 2022.\nRepresents the net amount of generation offered to and purchased from the MISO energy market.\nDuring 2024, 42 percent of the electric energy Consumers provided to customers was generated by its natural gas‑fueled generating units, which burned 107 Bcf of natural gas and produced a combined total of 14,856 GWh of electricity.\nIn order to obtain the gas it needs for electric generat",
  "item7_clean": "Item 7. Management’s Discussion and Analysis of Financial Condition and Results of Operations\nThis Management’s Discussion and Analysis of Financial Condition and Results of Operations is a combined report of CMS Energy and Consumers.\nCMS Energy is an energy company operating primarily in Michigan. It is the parent holding company of several subsidiaries, including Consumers, an electric and gas utility, and NorthStar Clean Energy, primarily a domestic independent power producer and marketer. Consumers’ electric utility operations include the generation, purchase, distribution, and sale of electricity, and Consumers’ gas utility operations include the purchase, transmission, storage, distribution, and sale of natural gas. Consumers’ customer base consists of a mix of primarily residential, commercial, and diversified industrial customers. NorthStar Clean Energy, through its subsidiaries and equity investments, is engaged in domestic independent power production, including the development and operation of renewable generation, and the marketing of independent power production.\nCMS Energy and Consumers manage their businesses by the nature of services each provides. CMS Energy operates principally in three business segments: electric utility; gas utility; and NorthStar Clean Energy, its non‑utility operations and investments. Consumers operates principally in two business segments: electric utility and gas utility. CMS Energy’s and Consumers’ businesses are affected primarily by:\nregulation and regulatory matters\nstate and federal legislation\nenergy commodity prices\ntheir securities’ credit ratings\nThe Triple Bottom Line\nCMS Energy’s and Consumers’ purpose is to provide safe, reliable, affordable, clean, and equitable energy in service of their customers. In support of this purpose, CMS Energy and Consumers couple digital transformation with the “CE Way,” a lean operating model designed to improve safety, quality, cost, delivery, and employee morale.\nCMS Energy and Consumers measure their progress toward the purpose by considering their impact on the “triple bottom line” of people, planet, and prosperity; this consideration takes into account not only the economic value that CMS Energy and Consumers create for customers and investors, but also their responsibility to social and environmental goals. The triple bottom line balances the interests of employees, customers, suppliers, regulators, creditors, Michigan’s residents, the investment community, and other stakeholders, and it reflects the broader societal impacts of CMS Energy’s and Consumers’ activities.\nCMS Energy’s Sustainability Report, which is available to the public, describes CMS Energy’s and Consumers’ progress toward world class performance measured in the areas of people, planet, and prosperity.\nThe people element of the triple bottom line represents CMS Energy’s and Consumers’ commitment to their employees, their customers, the residents of local communities in which they do business, and other stakeholders.\nThe safety of co-workers, customers, and the general public is a priority of CMS Energy and Consumers. Accordingly, CMS Energy and Consumers have worked to integrate a set of safety principles into their business operations and culture. These principles include complying with applicable safety, health, and security regulations and implementing programs and processes aimed at continually improving safety and security conditions.\nCMS Energy and Consumers also place a high priority on customer value and on providing a hometown customer experience. Consumers’ customer-driven investment program is aimed at improving safety and increasing electric and gas reliability.\nIn September 2023, Consumers filed its Reliability Roadmap, an update to its previous Electric Distribution Infrastructure Investment Plan filed in 2021, with the MPSC. The Reliability Roadmap outlines a five-year strategy to improve Consumers’ electric distribution system and the reliability of the grid. The plan proposes the following spending for projects designed to reduce the number and duration of power outages to customers through investment in infrastructure upgrades, vegetation management, and grid modernization:\ncapital expenditures of $7 billion through 2028; this amount is $3 billion higher than proposed in the previous plan\nmaintenance and operating spending of $1.7 billion through 2028, reflecting an increase of $300 million over the previous plan\nIn the electric rate case it filed in May 2024, Consumers outlined its proposal to begin implementing the Reliability Roadmap and requested rate recovery of the investments needed to support the plan’s key objectives.\nCentral to Consumers’ commitment to its customers are the initiatives it has undertaken to keep electricity and natural gas affordable, including:\nreplacement of coal-fueled generation and PPAs with a cost-efficient mix of renewable energy, less-costly dispatchable generation sources, and energy waste reduction and demand response programs\ntargeted infrastructure investment to reduce maintenance costs and improve reliability and safety\nsupply chain optimization\neconomic development to increase sales and reduce overall rates\ninformation and control system efficiencies\nemployee and retiree health care cost sharing\ncost-effective financing\nworkforce productivity enhancements\nWhile CMS Energy and Consumers have experienced some supply chain disruptions and inflationary pressures, they have taken steps to mitigate the impact on their ability to provide safe and reliable service to customers.\nThe planet element of the triple bottom line represents CMS Energy’s and Consumers’ commitment to protect the environment. This commitment extends beyond compliance with various state and federal environmental, health, and safety laws and regulations. Management considers climate change and other environmental risks in strategy development, business planning, and enterprise risk management processes.\nCMS Energy and Consumers continue to focus on opportunities to protect the environment and reduce their carbon footprint from owned generation. CMS Energy, including Consumers, has decreased its combined percentage of electric supply (self-generated and purchased) from coal by 23 percentage points since 2015. Additionally, as a result of actions already taken through 2024, initial measurement data indicates Consumers has:\nreduced carbon dioxide emissions from owned generation by more than 30 percent since 2005\nreduced methane emissions by nearly 30 percent since 2012\nreduced the volume of water used to generate electricity by more than 50 percent since 2012\nreduced landfill waste disposal by more than two million tons since 1992\nenhanced, restored, or protected more than 11,700 acres of land since 2017\nSince 2005, Consumers has reduced its sulfur dioxide and particulate matter emissions by nearly 95 percent and its NOx emissions by more than 86 percent. Consumers began tracking mercury emissions in 2007; since that time, it has reduced such emissions by more than 92 percent.\nPresented in the following illustration are Consumers’ reductions in these emissions:\nIn November 2023, Michigan enacted the 2023 Energy Law, which among other things:\nraised the renewable energy standard from the present 15\npercent requirement to 50 percent by 2030 and 60 percent by 2035; renewable energy generated anywhere within MISO can be applied to meeting this standard, with certain limitations\nset a clean energy standard of 80 percent by 2035 and 100 percent by 2040; low- or zero-carbon emitting resources, such as nuclear generation and natural gas generation coupled with carbon capture, are considered clean energy sources under this standard\nenhanced existing incentives for energy efficiency programs and returns earned on new clean or renewable PPAs\ncreated a new energy storage standard that requires electric utilities to file plans by 2029 to obtain new energy storage that will contribute to a Michigan target of 2,500 MW based on their pro rata share\nexpanded the statutory cap on distributed generation resources to ten percent\nConsumers filed updates to its renewable energy plan in November 2024 and plans to file updates to its Clean Energy Plan in 2026. Together, these updated plans will serve as Consumers’ blueprint to meeting the requirements of the 2023 Energy Law by focusing on increasing the generation of renewable energy, deploying energy storage, helping customers use less energy, and offering demand response programs to reduce demand during critical peak times.\nConsumers’ Clean Energy Plan details its strategy to meet customers’ long-term energy needs and was most recently revised and approved by the MPSC in 2022 under Michigan’s integrated resource planning process. The Clean Energy Plan outlines Consumers’ long-term strategy for delivering safe, reliable, affordable, clean, and equitable energy to its customers. This strategy includes:\nending the use of coal in owned generation in 2025, 15 years sooner than initially planned\npurchasing the Covert Generating Station, a natural gas-fueled generating facility with 1,200 MW of nameplate capacity, allowing Consumers to continue to provide controllable sources of electricity to customers; this purchase was completed in May 2023\nsoliciting capacity from sources able to deliver to Michigan’s Lower Peninsula, including battery storage facilities\nConsumers’ proposed updates to its renewable energy plan include:\nthe addition of up to 9,000 MW of both purchased and owned solar energy resources\nthe addition of up to 2,800 MW of new, competitively bid wind capacity\nthe co-location of battery energy storage with its renewable energy assets to optimize those assets\nCoupled with updates to the Clean Energy Plan, these actions will enable Consumers to achieve 60 percent renewable energy by 2035 and 100 percent clean energy by 2040, and will also contribute to Consumers’ achievement of the net-zero emissions goals discussed below.\nNet-zero methane emissions from natural gas delivery system by 2030:\nUnder its Methane Reduction Plan, Consumers plans to reduce methane emissions from its system by about 80 percent, from 2012 baseline levels, by accelerating the replacement of aging pipe, rehabilitating or retiring outdated infrastructure, and adopting new technologies and practices. The remaining emissions will likely be offset by purchasing and/or producing renewable natural gas. To date, Consumers has reduced methane emissions by nearly 30 percent.\nNet-zero greenhouse gas emissions target for the entire business by 2050:\nThis goal incorporates greenhouse gas emissions from Consumers’ natural gas delivery system, including suppliers and\ncustomers, and has an interim goal of reducing customer emissions by 25 percent by 2035. Consumers expects to meet this goal through carbon offset measures, renewable natural gas, energy efficiency and demand response programs, and the adoption of cost-effective emerging technologies once proven and commercially available.\nAdditionally, to advance its environmental stewardship in Michigan and to minimize the impact of future regulations, Consumers set the following goals for the five-year period 2023 through 2027:\nto enhance, restore, or protect 6,500 acres of land through 2027; Consumers has enhanced, restored, or protected more than 5,000 acres of land towards this goal\nto reduce water usage by 1.7 billion gallons through 2027; Consumers has reduced water usage by more than 1.3 billion gallons towards this goal\nto annually divert a minimum of 90 percent of waste from landfills (through waste reduction, recycling, and reuse); during 2024, Consumers’ rate of waste diverted from landfills was 92 percent\nCMS Energy and Consumers are monitoring numerous legislative, policy, and regulatory initiatives, including those to regulate and report greenhouse gases, and related litigation. While CMS Energy and Consumers cannot predict the outcome of these matters, which could affect them materially, they intend to continue to move forward with their clean and lean strategy.\nThe prosperity element of the triple bottom line represents CMS Energy’s and Consumers’ commitment to meeting their financial objectives and providing economic development opportunities and benefits in the communities in which they do business. CMS Energy’s and Consumers’ financial strength allows them to maintain solid investment-grade credit ratings and thereby reduce funding costs for the benefit of customers and investors, to attract and retain talent, and to reinvest in the communities they serve.\nIn 2024, CMS Energy’s net income available to common stockholders was $993 million, and diluted EPS were $3.33. This compares with net income available to common stockholders of $877 million and diluted EPS of $3.01 in 2023. In 2024, electric and gas rate increases were offset partially by higher interest charges and increased depreciation and property taxes, reflecting higher capital spending. A more detailed discussion of the factors affecting CMS Energy’s and Consumers’ performance can be found in the Results of Operations section that follows this Executive Overview.\nOver the next five years, Consumers expects weather-normalized electric deliveries to increase compared to 2024. This outlook reflects strong growth in electric demand, offset partially by the effects of energy waste reduction programs. Weather-normalized gas deliveries are expected to remain stable relative to 2024, reflecting modest growth in gas demand, offset by the effects of energy waste reduction programs.\nPerformance: Impacting the Triple Bottom Line\nCMS Energy and Consumers remain committed to delivering safe, reliable, affordable, clean, and equitable energy in service of their customers and positively impacting the triple bottom line of people, planet, and prosperity. During 2024, CMS Energy and Consumers:\ncreated a Clean Energy Workforce Development Program for people employed in the building trades to receive training and certifications in the areas of advanced energy efficiency, lead abatement, and other work\nburied power lines in multiple Michigan communities under a targeted undergrounding pilot program in efforts to improve electric service for Consumers’ electric customers\nbegan installation of nearly 3,000 line sensors, 100 automatic transfer reclosers, and 1,200 iron utility poles to improve electric reliability and help prevent power outages\nexpanded Consumers’ MI Clean Air program to include several renewable natural gas projects being developed and constructed across Michigan, increasing options for customers to offset emissions associated with their natural gas use\ncollaborated with the Muskegon County Resource Recovery Center to develop a 250-MW solar energy center, Consumers’ first large-scale, self-developed solar project, that is expected to power 40,000 homes by 2026\nupdated Consumers’ Transportation Electrification Plan, aiming to power over 1,500 new fast charging locations and serve one million electric vehicles in Michigan by 2030\nlaunched a new workplace electric vehicle charging program, offering rebates to businesses that install chargers, with a goal of equipping over 500 workplaces by 2030\ncompleted the final phase of the Mid-Michigan Pipeline project, replacing and upgrading 55 miles of natural gas transmission pipeline in five Michigan counties, ensuring safe and reliable gas flow to homes and businesses prior to the winter season\nCMS Energy and Consumers will continue to utilize the CE Way to enable them to achieve world class performance and positively impact the triple bottom line. Consumers’ investment plan and the regulatory environment in which it operates also drive its ability to impact the triple bottom line.\nOver the next five years, Consumers expects to make significant expenditures on infrastructure upgrades, replacements, and clean generation. While it has a large number of potential investm",
  "item2_clean": null
}