{
  "source_file": "cnc-20250930.htm",
  "form_type": "10-Q",
  "item1_clean": null,
  "item7_clean": null,
  "item2_clean": "Management's Discussion and Analysis of Financial Condition and Results of Operations.\nThe following discussion of our financial condition and results of operations should be read in conjunction with our consolidated financial statements and the related notes included elsewhere in this filing. The discussion contains forward-looking statements that involve known and unknown risks and uncertainties.\nEXECUTIVE OVERVIEW\nWe are a leading healthcare enterprise that is committed to helping people live healthier lives. The Company takes a local approach – with local brands and local teams – to provide fully integrated, high-quality and cost-effective services to government-sponsored and commercial healthcare programs, focusing on under-insured and uninsured individuals. Centene offers affordable and high-quality products to more than 1 in 15 individuals across the nation, including Medicaid and Medicare members (including Medicare Prescription Drug Plans) as well as individuals and families served by the Health Insurance Marketplace.\nOur results of operations depend on our ability to manage expenses associated with health benefits (including estimated costs incurred) and selling, general and administrative (SG&A) costs. We measure operating performance based upon two key ratios. The health benefits ratio (HBR) represents medical costs as a percentage of premium revenues, excluding premium tax revenues that are separately billed, and reflects the direct relationship between the premiums received and the medical services provided. The SG&A expense ratio represents SG&A costs as a percentage of premium and service revenues, excluding premium taxes separately billed.\nTrends and Uncertainties\nIn 2025, we have experienced an accelerated increase in medical cost trend. The drivers of trend include increasing medical demand, expanded access to care facilitated by program changes at the state level, and the rapid release and availability of new, high-cost pharmaceuticals. Increasingly, state healthcare policies are providing for expanded access through carve-ins for incremental coverage (for example, behavioral healthcare and home and community-based services).\nThe medical cost drivers are likely intensified by an environment where legislative changes to the United States healthcare model have been widely publicized (and with increasing intensity over the last nine months). Changes to the model include references to members in certain programs who may lose eligibility and certain provider reimbursement models that may be reduced in the future. Changes in Medicaid and Marketplace, including potential changes in the availability of enhanced Advance Premium Tax Credits (APTCs) for Marketplace products coupled with the One Big Beautiful Bill Act (OBBBA), create member uncertainty surrounding the future availability, affordability, funding, and access to health insurance. This backdrop may be prompting members to seek care at an increased rate (given potential eligibility and subsidy funding shifts) and providers may be modifying operations, all further exacerbating the medical cost trend.\nWe continue to work with our state partners to establish Medicaid premium rates that appropriately match the acuity of the population as well as reflect the most recent medical cost trend. We also provide states with data to help them analyze the implications of policy decisions as well as design effective risk adjustment programs. In Marketplace, we completed the process of refiling 2026 policy year rates during the third quarter of 2025 to reflect a higher projected baseline of Marketplace morbidity than previously expected. Barring state-specific changes, we expect to be able to take corrective pricing actions for 2026 in states representing approximately 95% of our Marketplace membership.\nAdditionally, we are committed to ensuring that the affordability of healthcare is maintained for our government partners and members and continue to address the cost trend through the implementation of new clinical initiatives and care management plans, thoughtful network design, and ongoing rigor to combat fraud, waste and abuse.\nRegulatory: Medicaid\nThe COVID-19 pandemic impacted our business as it relates to Medicaid eligibility changes. From the onset of the public health emergency (PHE) through March 2023, our Medicaid membership increased by 3.6 million members (excluding new states North Carolina and Delaware and various state product expansions or managed care organization changes). Since March 31, 2023, redeterminations are the primary driver of our Medicaid membership decline. While some states may still be concluding the redetermination process for certain populations of members, we anticipate that future reductions could occur resulting from ongoing state redetermination processes. We continue to work with our state partners to match rates to acuity post-redeterminations.\nThe OBBBA, passed in July 2025, includes requirements that may reduce the number of members eligible for state Medicaid Expansion programs by requiring work or community engagement by members and for state Medicaid agencies to redetermine member eligibility at more frequent intervals, along with adding a \"Cost Sharing\" or \"Co-Pay\" for certain medical services. These changes could have the effect of increasing the overall morbidity of the Medicaid Expansion population largely beginning in 2027, subject to state implementation plans. Several other provisions of the OBBBA, such as adjustments to provider taxes and state directed payments beginning in 2028, may have the effect of reducing the amount of federal funding for Medicaid, which could result in changes in the design of Medicaid programs, including coverage of benefits, eligibility, and/or provider payment rates. The OBBBA also includes a restriction against paying certain providers designated as \"prohibited entities\" as of October 1, 2025, which has the potential to create access to care issues and network gaps. An extended government shutdown may delay regulatory guidance and implementation of these requirements and other rulemaking changes.\nRegulatory: Commercial\nThe American Rescue Plan Act (ARPA), enacted in March 2021, initially enhanced eligibility for APTCs for enrollees in the Health Insurance Marketplace. The enhanced eligibility extended by the Inflation Reduction Act (IRA), enacted in August 2022, expires at the end of 2025.\nThe Marketplace Integrity & Affordability Final Rule (Final Rule) was published in the Federal Register on June 25, 2025. The Final Rule makes changes to policies to strengthen program integrity measures in the Marketplace. For example, the Special Enrollment Period for those under 150% of the Federal Poverty Level (FPL) has been repealed beginning August 25, 2025. Several of the provisions of the Final Rule have been stayed due to ongoing litigation. These include a requirement for certain consumers who automatically re-enroll into a fully subsidized Marketplace plan will be re-enrolled into the same plan with a $5 premium until the consumer updates their exchange application to confirm APTC eligibility. Additionally, exchanges may no longer accept a consumer's self-attestation of projected annual household income when the Internal Revenue Service (IRS) cannot verify it due to lack of tax return data; rather, exchanges must verify household income using other trusted data sources.\nIn addition, the OBBBA placed additional restrictions on APTC requirements. For example, beginning January 1, 2026, should individuals mis-estimate their projected income, the OBBBA requires them to reimburse the IRS for the full amount of excess tax credit received. In addition, as of January 1, 2026, the OBBBA prohibits individuals from receiving APTCs if they enroll in health coverage through a Special Enrollment Period associated with their income. We anticipate that the combined effect of the expiration of the enhanced APTCs, the Final Rule, and the OBBBA will reduce 2026 Marketplace membership and continue to increase the overall morbidity of the Marketplace population. We completed the process of refiling 2026 policy year rates during the third quarter of 2025 to reflect a higher projected baseline of Marketplace morbidity than previously expected. Barring state-specific changes, we expect to be able to take corrective pricing actions for 2026 in states representing approximately 95% of our Marketplace membership. We continue to advocate for legislation and regulations aimed at leveraging Medicaid and the Health Insurance Marketplace to maintain health insurance coverage and affordability for consumers.\nRegulatory: Medicare\nThe IRA significantly changed Medicare Part D, impacting stand-alone Medicare Prescription Drug Plans (PDPs) as well as the Part D benefit in many of our Medicare Advantage plans beginning in 2025, most notably by eliminating the coverage gap and capping members' annual out-of-pocket costs at $2,000 in order to provide more predictable and affordable prescription drug coverage for Medicare beneficiaries. The members' Part D annual out-of-pocket cap for 2026 is $2,100. The IRA changes effective for 2025 result in a meaningful shift in cost-sharing responsibilities between members, drug companies, Centers for Medicare and Medicaid Services (CMS), and PDPs and have resulted in a significant increase in our premiums in consideration for our PDPs' responsibility for a larger portion of total Part D benefit costs. To help mitigate significant premium impacts and address these changes, CMS introduced the Medicare Part D Premium Stabilization Demonstration program. This program began in calendar year 2025 and was intended by CMS to exist for three years. The parameters of the program are expected to be different each year. CMS believes the demonstration will provide plans greater flexibility to manage costs and assist in stabilizing beneficiary premiums. We continue to advocate for policies th"
}