{
  "source_file": "cnc-20241231.htm",
  "form_type": "10-K",
  "item1_clean": "OVERVIEW\nOur mission is to transform the health of the communities we serve, one person at a time. Centene is a leading healthcare enterprise that is committed to helping people live healthier lives. The Company takes a local approach – with local brands and local teams – to provide fully integrated, high-quality and cost-effective services to government-sponsored and commercial healthcare programs, focusing on under-insured and uninsured individuals. Centene offers affordable and high-quality products to more than 1 in 15 individuals across the nation, including Medicaid and Medicare members (including Medicare Prescription Drug Plans) as well as individuals and families served by the Health Insurance Marketplace.\nCentene provides access to high-quality healthcare, innovative programs and a wide range of health solutions that help families and individuals get well, stay well and be well. Our uniquely local approach – with local brands and local teams who live in, care about and directly influence the communities they serve – is a key differentiator in our ability to provide access to quality care to our members. Centene treats the whole person, an approach that is delivered locally and backed by the scale of Centene's expertise, data and resources. Through this approach and our commitment to sustainable partnerships, we work with local community organizations to realize our mission of transforming the health of the communities we serve, one person at a time.\nWe are focused on making strategic decisions and investments to create additional value in the short-term and to seek opportunities that position the organization for long-term strength, profitability, growth and innovation. In addition to creating shareholder value, we are modernizing and improving how we work in order to propel our organization to new levels of success and elevate the member and provider experiences.\nDuring 2024, we operated in four segments: Medicaid, Medicare, Commercial and Other.\nincludes the Temporary Assistance for Needy Families (TANF) program; Medicaid Expansion programs; the Aged, Blind or Disabled (ABD) program; the Children's Health Insurance Program (CHIP); Long-Term Services and Supports (LTSS); Foster Care; Medicare-Medicaid Plans (MMP), which cover beneficiaries who are dually eligible for Medicaid and Medicare; and other state-based programs.\nincludes Medicare Advantage, Medicare Supplement, Dual Eligible Special Needs Plans (D-SNPs) and Medicare Prescription Drug Plans (PDP), also known as Medicare Part D.\nincludes the Health Insurance Marketplace product along with individual, small group and large group commercial health insurance products.\nincludes our pharmacy operations, Envolve Benefit Options' vision and dental services, clinical healthcare, behavioral health, the TRICARE program, and corporate management companies, among others.\nFor the year ended December 31, 2024, our Medicaid, Medicare, Commercial and Other segments accounted for 62%, 14%, 21% and 3%, respectively, of our total external revenues. Our membership totaled 28.6 million as of December 31, 2024. For the year ended December 31, 2024, our total revenues and net earnings attributable to Centene were $163.1 billion and $3.3 billion, respectively, and our total cash flow from operations was $154 million.\nOur initial health plan commenced operations in Wisconsin in 1984. We were organized in Wisconsin in 1993 as a holding company for our initial health plan and reincorporated in Delaware in 2001. Our stock is publicly traded on the New York Stock Exchange under the ticker symbol \"CNC.\"\nINDUSTRY AND OPERATIONS\nWe provide a full spectrum of managed healthcare products and services, primarily through Medicaid, Medicare and commercial products.\nMedicaid is the largest publicly funded program in the United States and provides health insurance to low-income families and individuals with disabilities. Medicaid is funded jointly by federal and state governments, with the majority of funding provided by the federal government and administered by the states. Each state establishes its own eligibility standards, benefit packages, payment rates and program administration within federal standards. As a result, there are 56 Medicaid programs - one for each U.S. state, each U.S. territory and the District of Columbia. Eligibility is based on a combination of household income and assets, often determined by an income level relative to the federal poverty level. Many states have selected Medicaid managed care as a means of delivering quality healthcare and controlling costs.\nMedicaid helps meet the needs of various populations through the following products and programs:\nThe TANF program covers low-income families with children.\nMedicaid Expansion covers all individuals under age 65 with incomes up to 138% of the federal poverty level, subject to each state's election. The federal government pays 90% of the costs for Medicaid Expansion coverage for these beneficiaries.\nThe ABD program covers low-income individuals with chronic physical disabilities or behavioral health impairments. ABD beneficiaries represent a growing portion of all Medicaid recipients and typically utilize more services as a result of their more complicated health status.\nCHIP helps to expand coverage primarily to children whose families earn too much to qualify for Medicaid, yet not enough to afford private health insurance. Historically, children have represented the largest Medicaid eligible population. Costs are primarily composed of pediatrics and family care, which tend to be more predictable than those associated with other healthcare issues predominantly affecting the adult population.\nLTSS is a Medicaid product that covers Institutional/Residential Care (Nursing and Intermediate Care Facilities) and Home and Community Based Services (HCBS) for beneficiaries requiring assistance with their activities of daily living. The largest groups receiving LTSS, by spending, are older individuals and individuals with physical disabilities, followed by individuals with intellectual and developmental disabilities, those with serious mental illness and/or serious emotional disturbance and other populations. States are increasingly turning to managed care as a solution to provide coordinated, holistic care to their LTSS beneficiaries.\nThe majority of children in foster care qualify for Medicaid. The federal government has enacted legislation establishing requirements for state child welfare agencies related to the health and well-being of children in foster care, including the provision of grants and technical assistance to enable states to meet these needs and make explicit connections with Medicaid. In addition, under the ACA, former foster care children are eligible for Medicaid until the age of 26, provided that they turned 18 while in foster care and were enrolled in Medicaid at that time.\nA portion of Medicaid beneficiaries are dual-eligible, low-income seniors and people with disabilities who are enrolled in both Medicaid and Medicare. According to CMS, there were more than 12 million dual-eligible enrollees in 2023. These members may receive assistance from Medicaid for benefits, such as nursing home care, HCBS and/or assistance with Medicare premiums and cost-sharing depending on their income level. Dual-eligibles use more services due to their tendency to have more chronic health issues. We serve dual-eligibles primarily through our ABD, LTSS, MMP and Medicare Advantage D-SNPs lines of business.\nWhile Medicaid programs have directed funds to many individuals who cannot afford or otherwise maintain health insurance coverage, they did not initially address the inefficient and costly manner in which the Medicaid population tends to access healthcare. Medicaid recipients in non-managed care programs typically have not sought preventive care or routine treatment for chronic conditions, such as asthma and diabetes. When they do seek care, it is typically fragmented and not coordinated such as seeking healthcare in hospital emergency departments, which is typically more expensive. As a result, many states without managed care programs have found that the costs of providing Medicaid benefits have increased while the medical outcomes for the recipients remained unsatisfactory.\nAccordingly, in an effort to improve quality of care and the affordability of healthcare, the majority of states have mandated that their TANF recipients enroll in managed care plans and many are considering moving to a mandated managed care approach for additional populations and products. CMS estimates the total Medicaid program will grow from $877 billion in 2023 to $1.2 trillion by 2030. Medicaid spending is projected to increase at an average annual rate of 5% between 2023 and 2030. Additionally, approximately 40% of Medicaid spend in 2023 was in Medicaid fee-for-service. Based on these trends, we believe a significant market opportunity exists for managed care organizations (MCOs) with operations and programs focused on the distinct socio-economic, cultural and healthcare needs of the uninsured population and the Medicaid populations.\nWe are the largest Medicaid health insurer in the country, serving 13 million Medicaid recipients in 30 states as of December 31, 2024. Our Medicaid contracts with the states of Florida and New York accounted for approximately 10% or more of our consolidated Medicaid premium revenues individually in the year ended December 31, 2024.\nMedicare is the federal health insurance program for people ages 65 and over, which was expanded to cover people under 65 with certain disabilities and people with end-stage renal disease requiring dialysis or kidney transplant. Medicare consists of four parts, labeled A through D. Part A provides hospitalization benefits financed largely through Social Security taxes and requires beneficiaries to pay out-of-pocket deductibles and coinsurance. Part B provides benefits for medically necessary services and supplies including outpatient care, physician services and home health care. Parts A and B are referred to as Original Medicare.\nAs an alternative to Original Medicare, beneficiaries may elect to receive their Medicare benefits through Part C, also known as Medicare Advantage. Under Medicare Advantage, MCOs contract with CMS to provide services directly to Medicare beneficiaries as well as through employer and union groups. MCOs typically receive fixed monthly premium per member from CMS that varies based upon the county in which the member resides, demographic factors of the member such as age, gender and institutionalized status and the health status of the member. Any benefits that are not covered by Medicare may result in an additional monthly premium charged to the enrollee or through portions of payments received from CMS that may be allocated to these benefits, according to CMS regulations and guidance. Typically, as our Medicare Advantage members reach their deductibles and out-of-pocket maximums, our medical costs rise, creating seasonality in the business with a higher percentage of earnings in the first half of the year.\nThe Congressional Budget Office estimates the total Medicare market will grow from $1.0 trillion in 2023 to $1.6 trillion by 2030. Medicare spending is estimated to have increased 6% in fiscal 2024 and is projected to increase at an average annual rate of 7% between 2023 and 2030. Over 40% of Medicare spend in 2023 was in Medicare fee-for-service, representing a notable market opportunity to increase penetration of the Medicare Advantage products.\nAs of December 31, 2024, we served 1.1 million Medicare Advantage members across 37 states, primarily under the brand name Wellcare, with the highest concentration of lower-income, complex members compared to our peers. Revenues from CMS are significant to the segment. Consistent with our strategy, we have reduced our Medicare Advantage footprint to 32 states ",
  "item7_clean": "ITEM 7.\nManagement's Discussion and Analysis of Financial Condition and Results of Operations\nEXECUTIVE OVERVIEW\nWe are a leading healthcare enterprise that is committed to helping people live healthier lives. The Company takes a local approach – with local brands and local teams – to provide fully integrated, high-quality and cost-effective services to government-sponsored and commercial healthcare programs, focusing on under-insured and uninsured individuals. Centene offers affordable and high-quality products to more than 1 in 15 individuals across the nation, including Medicaid and Medicare members (including Medicare Prescription Drug Plans) as well as individuals and families served by the Health Insurance Marketplace.\nWe provide access to high-quality healthcare, innovative programs and a wide range of health solutions that help families and individuals get well, stay well and be well. Our uniquely local approach – with local brands and local teams who live in, care about and directly influence the communities they serve – is a key differentiator in our ability to provide access to quality care to our members. Centene treats the whole person, an approach that is delivered locally and backed by the scale of Centene's expertise, data and resources. Through this approach and our commitment to sustainable partnerships, we work with local community organizations to realize our mission of transforming the health of the communities we serve, one person at a time.\nOur record of organic growth and strategic acquisitions have given us the size, scale and privilege of providing local high-quality and affordable health care to more than 28.6 million Americans. As of December 31, 2024, we were the largest Medicaid health insurer in the country, serving more than 13 million Medicaid recipients in 30 states. We were the largest Marketplace carrier, serving 4.4 million members across 29 states, served 1.1 million Medicare Advantage members across 37 states and were the largest stand-alone Medicare Prescription Drug Plan (PDP) provider serving 6.9 million members in 50 states and the District of Columbia. Consistent with our strategy, we have reduced our Medicare Advantage footprint to 32 states as of January 1, 2025.\nOur results of operations depend on our ability to manage expenses associated with health benefits (including estimated costs incurred) and selling, general and administrative (SG&A) costs. We measure operating performance based upon two key ratios. The health benefits ratio (HBR) represents medical costs as a percentage of premium revenues, excluding premium tax revenues that are separately billed, and reflects the direct relationship between the premiums received and the medical services provided. The SG&A expense ratio represents SG&A costs as a percentage of premium and service revenues, excluding premium taxes separately billed.\nIn November 2022, we divested our ownership stakes in our Spanish and Central European businesses and as a result recorded an impairment charge of $163 million, or $140 million after-tax. During 2023, we recognized an additional loss on sale of $13 million, or $10 million after-tax.\nIn December 2022, we completed the divestiture of Magellan Rx for $1.3 billion and recognized a gain of $269 million, or $99 million after-tax. During 2023, we recorded a reduction to the previously reported gain of $22 million, or $10 million after-tax, due to the finalization of working capital adjustments.\nIn January 2023, we sold Magellan Specialty Health for $646 million in cash and stock, including an estimated working capital adjustment, and recognized a gain of $79 million, or $63 million after-tax. During 2024, we recorded an additional gain on sale of $83 million for achievement of contingent consideration related to the sale and finalization of working capital adjustments.\nIn January 2023, we also completed the divestitures of Centurion and HealthSmart and recorded impairments of $259 million ($181 million after-tax) and $36 million ($27 million after-tax), respectively, in 2022. During 2023, we recognized a gain of $15 million, or $10 million after-tax, on the divestiture of the Centurion business reflecting additional proceeds for contingent consideration, partially offset by net working capital adjustments.\nIn June 2023, we completed the divestiture of our majority stake in Apixio and recognized a gain of $93 million, or $67 million after-tax.\nIn December 2023, we completed the divestiture of Operose Health Group (Operose Health) and recognized an impairment of $140 million, or $128 million after-tax.\nIn January 2024, we completed the divestiture of Circle Health Group (Circle Health) for $931 million. Upon closing the divestiture, we settled the foreign currency swap associated with the divestiture and recorded a corresponding gain of $20 million.\nIn October 2024, we completed the divestiture of Collaborative Health Systems (CHS) and recognized a pre-tax gain of $17 million, or $13 million after-tax.\nThe above-noted divestitures are drivers of certain year-over-year variances discussed throughout this section.\nRegulatory Trends and Uncertainties\nThe United States government, policymakers and healthcare experts continue to discuss and debate various elements of the United States healthcare model. We remain focused on the promise of delivering access to high-quality, affordable healthcare to all of our members and believe we are well positioned to meet the needs of the changing healthcare landscape.\nThe American Rescue Plan Act (ARPA), enacted in March 2021, initially enhanced eligibility for the premium tax credit for enrollees in the Health Insurance Marketplace. The enhanced eligibility extended by the Inflation Reduction Act (IRA), enacted in August 2022, expires at the end of 2025. We continue to advocate for legislation and regulations aimed at leveraging Medicaid and the Health Insurance Marketplace to maintain health insurance coverage and affordability for consumers.\nThe IRA significantly changes Medicare PDPs in 2025, most notably by eliminating the coverage gap and capping members' annual out-of-pocket cost at $2,000 in order to provide more predictable and affordable prescription drug coverage for Medicare beneficiaries. The IRA changes effective for 2025 result in a meaningful shift in cost-sharing responsibilities between members, drug companies, CMS, and PDPs and will result in a significant increase in our premiums in consideration for our PDPs responsibility for a larger portion of total Part D benefit costs.\nThe COVID-19 pandemic impacted our business as it relates to Medicaid eligibility changes. From the onset of the public health emergency (PHE) through March 2023, our Medicaid membership increased by 3.6 million members (excluding new states North Carolina and Delaware and various state product expansions or managed care organization changes). Since March 31, 2023, redeterminations are the primary driver of our Medicaid membership decline. While some states may still be concluding the redetermination process for certain populations of members, we anticipate that any remaining reductions will be limited as the majority of states have substantially completed their unwinding processes as of December 2024. We continue to work with our state partners to match rates to acuity post-redeterminations.\nIn addition, newly finalized Centers for Medicare and Medicaid Services (CMS) regulations will require beneficiaries dually enrolled in Medicare and in a Medicaid Managed Care Plan to receive integrated care through the Medicaid company's Medicare Advantage Dual Eligible Special Needs Plans (D-SNPs) beginning in 2030, with certain restrictions beginning in 2027. However, some states have already moved or are planning to exclusively align dual-eligible enrollment under an aligned D-SNP before this timeframe. We believe we are positioned well given our overlapping Medicaid and Medicare Advantage footprints and are committed to navigating evolving regulations.\nWe also closely monitor state legislation across our markets and are advocating for and seeing adoption of coverage expansions for Medicaid populations (e.g., North Carolina), postpartum (now in effect for 48 states, the District of Columbia and the U.S. Virgin Islands), foster care children, among others, as well as mitigating adverse legislation addressing pharmacy, prior authorization and other issues. The Consolidated Appropriations Act, 2023 outlined key coverage expansion provisions, which went into effect in January 2024, requiring states to provide 12 months of continuous coverage for children under Medicaid and the Children's Health Insurance Program (CHIP).\nWe have four decades of experience, spanning seven presidents from both sides of the aisle, in delivering high-quality healthcare services on behalf of states and the federal government to under-insured and uninsured families, commercial organizations. This expertise has allowed us to deliver cost-effective services to our government partners and our members. With trends in the personalization of healthcare technology, we continue the use of data and analytics to improve the provider and member experience. We continue to believe we have both the capacity and capability to successfully navigate industry changes to the benefit of our members, customers, providers and shareholders.\nFor additional information regarding regulatory trends and uncertainties, see Part I, Item 1 \"\nBusiness - Regulation\nOur financial performance for 2024 is summarized as follows:\nYear-end membership of 28.6 million, an increase of 1.1 million members, or 4% over 2023.\nTotal revenues of $163.1 billion, representing 6% growth year-over-year.\nPremium and service revenues of $145.5 billion, representing 4% growth year-over-year.\nHBR of 88.3% for 2024, compared to 87.7% for 2023.\nSG&A expense ratio of 8.5% for 2024, compared to 9.0% for 2023.\nAdjusted SG&A expense ratio of 8.5% for 2024, compared to 8.9% for 2023.\nDiluted earnings per share (EPS) of $6.31 for 2024, compared to $4.95 for 2023.\nAdjusted diluted EPS of $7.17 for 2024, compared to $6.68 for 2023, representing 7% growth year-over-year.\nOperating cash flows of $154 million for 2024, compared to $8.1 billion for 2023.\nA reconciliation from GAAP diluted EPS to Adjusted Diluted EPS is highlighted below, and additional detail is provided under the heading \"\nNon-GAAP Financial Presentation\nWe reference adjusted SG&A expense ratio defined as adjusted SG&A expenses, which excludes acquisition and divestiture related expenses and other items, divided by premium and service revenues. We also reference effective tax rate on adjusted earnings, defined as GAAP income tax expense (benefit) excluding the income tax effects of adjustments to net earnings divided by adjusted earnings (loss) before income tax expense.\nYear Ended December 31,\nGAAP diluted EPS attributable to Centene\nAmortization of acquired intangible assets\nAcquisition and divestiture related expenses\nIncome tax effects of adjustments\nAdjusted diluted EPS\nOther adjustments include the following pre-tax items:\n(a) net gain on the previously reported divestiture of Magellan Specialty Health due to the achievement of contingent consideration and finalization of working capital adjustments of $83 million, or $0.16 per share ($0.12 after-tax), net gain on the sale of property of $24 million, or $0.04 per share ($0.03 after-tax), gain on the previously reported divestiture of Circle Health of $20 million, or $0.04 per share ($0.12 after-tax), gain on the sale of CHS of $17 million, or $0.03 per share ($0.02 after-tax), Health Net Federal Services asset impairment due to the 2024 final ruling on the TRICARE Managed Care Support Contract of $14 million, or $0.03 per share ($0.02 after-tax), severance costs due to a restructuring of $13 million, or $0.02 per share ($0.01 after-tax), an additional loss on the divestiture of our Spanish and Central European businesses of $7 million, or $0.01 per share ($0.01 after-tax) and gain on the previously reported divestiture of HealthSmart due to the finalization of working capital adjustments of $7 million, or $0.01 per share ($0.01 after-tax).\n(b) Circle Health impairment of $292 million, or $0.53 per share ($0.47 after-tax), Operose Health impairment of $140 million, or $0.26 per share ($0.24 after-tax), real estate impairments of $105 million, or $0.19 per share ($0.16 after-tax), gain on the sale of Apixio of $93 million, or $0.17 per share ($0.12 after-tax), severance costs due to a restructuring of $79 million, or $0.15 per share ($0.11 after-tax), gain on the sale of Magellan Specialty Health of $79 million, or $0.14 per share ($0.11 after-tax), a reduction to the previously reported gain on the sale of Magellan Rx of $22 million, or $0.04 per share ($0.02 after-tax), gain on the previously reported divestiture of Centurion of $15 million, or $0.03 per share ($0.02 after-tax) and an additional loss on the divestiture of our Spanish and Central European businesses of $13 million, or $0.02 per share ($0.01 after-tax).\nThe income tax effects of adjustments are based on the effective income tax rates applicable to each adjustment. In addition, the year ended December 31, 2024, includes a tax benefit of $1 million, or $0.00 per share, related to tax adjustments on previously reported divestitures. The year ended December 31, 2023 includes a one-time income tax benefit of $69 million, or $0.13 per share, resulting from the distribution of long-term stock awards to the estate of the Company's former CEO and tax expense of $3 million, or $0.01 per share, related to tax adjustments on previously reported divestitures.\nCurrent and Future Operating Drivers\nThe following items contributed to our 2024 results of operations as compared to the previous year:\nIn October 2024, our subsidiary, Meridian Health Plan of Michigan, commenced the contract awarded by the Michigan Department of Health and Human Services (MDHHS) to continue serving as a Medicaid health plan for the Comprehensive Health Care Program. The contract has a five-year term, with three optional one-year extensions, for a total of eight possible contract years.\nIn September 2024, our subsidiary, Superior HealthPlan (Superior), commenced the contract awarded by the Texas Health and Human Services Commission to continue to provide healthcare coverage to the Aged, Blind or Disabled (ABD) population in the state's STAR+PLUS program. The contract has a six-year term with a maximum of three additional two-year extensions.\nIn September 2024, our subsidiary, NH Healthy Families, commenced the contract awarded by the New Hampshire Department of Health and Human Services to continue providing physical health, behavioral health and pharmacy services for New Hampshire's Medicaid managed care program, known as Medicaid Care Management. The contract has a five-year term.\nIn July 2024, our subsidiaries, Carolina Complete Health and WellCare of North Carolina, began coordinating physical and other health services with Local Management Entities/Managed Care Organizations under the state's new Tailored Plan program. The Tailored Plans are integrated health plans designed for individuals with significant behavioral health needs or intellectual/developmental disabilities.\nIn June 2024, our subsidiary, Western Sky Community Care, concluded serving members upon the expiration of its New Mexico Medicaid managed care contract.\nIn April 2024, our subsidiary, Oklahoma Complete Health, commenced the statewide contracts to provide managed care for the SoonerSelect and SoonerSelect Children's Specialty Plan programs. The new contracts have a one-year term with five, one-year renewal options.\nIn January 2024, our subsidiary, Nebraska Total Care, commenced the statewide Medicaid managed care contract to continue serving the state's Medicaid Managed Care Program, known as Heritage Health. The initial contra",
  "item2_clean": null
}