{
  "source_file": "cnp-20250930.htm",
  "form_type": "10-Q",
  "item1_clean": null,
  "item7_clean": null,
  "item2_clean": "Completion of construction and energization of the line is anticipated to occur in the third quarter of 2027.\nTexas Legislation (CenterPoint Energy, Houston Electric and CERC)\nThe Registrants are evaluating the effects of certain legislation passed in 2025 and associated PUCT rulemaking projects, including the following pieces of legislation that became law during the 89th Texas Legislature:\nHouse Bill 4384, effective June 20, 2025, allows LDCs to recover post in-service carry costs (PISCC) in GRIP filings. This allows LDCs to defer for future recovery as a regulatory asset PISCC, depreciation associated with unrecovered gross plant and ad valorem taxes associated with unrecovered gross plant.\nSenate Bill 231, effective June 20, 2025, revises the types of temporary generation units that may be used by a utility to have a maximum generation capacity of not more than 5 MW and be rapidly deployable.\nSenate Bill 1963, effective September 1, 2025, allows ERCOT utilities to securitize system restoration costs using a third-party government agency, which may allow for the debt to be off balance sheet and an abbreviated proceeding timeline. This bill also lowered the system restoration costs threshold from $100 million to $50 million, provided the effectiveness tests are met.\nSenate Bill 482, effective September 1, 2025, results in increased penalties for assaulting a utility worker to a third-degree felony, equal to assaulting a first responder, and for harassing a utility worker to a Class A misdemeanor.\nSolar Panel Issues (CenterPoint Energy)\nTransmission and Distribution System Resiliency Plan (CenterPoint Energy and Houston Electric)\nFollowing feedback from customers, external experts and other stakeholders, including elected officials and local agencies, Houston Electric filed a revised SRP with the PUCT on January 31, 2025 for review and approval. The filed SRP proposed to invest approximately $5.75 billion over a three-year period from 2026 to 2028 for transmission and distribution infrastructure, information technology and cybersecurity assets and event response capability. This plan proposed 39 resiliency-enhancing measures and a microgrid pilot program to be implemented over the three-year period. The SRP as filed had an estimated capital cost of approximately $5.54 billion and an estimated operations and maintenance expense of approximately $211 million. Approximately $2.17 billion of such cost was for transmission-related investments, and approximately $3.58 billion was for distribution-related investments. Intervenor testimony was filed on April 8, 2025, and PUCT staff testimony was filed on April 15, 2025. On June 12, 2025, Houston Electric announced that it had reached a settlement agreement with parties to its SRP, which provides for approximately $3.18 billion in distribution-related investments. The proposed transmission investments were removed from the SRP and will be implemented as appropriate outside of the SRP process. The agreement also includes the deferral of more than $240 million of the approximate $3.18 billion in SRP costs until the second half of 2029, which will help reduce the bill impact for customers by spreading costs over a four-year period instead of three years. Once approved, and while some cost recovery would be deferred into 2029, it is expected that all SRP work agreed upon in the settlement agreement will be completed in the proposed 2025 to 2028 timeframe. On July 31, 2025, Houston Electric delivered a presentation on the SRP at a PUCT open meeting, and on August 8, 2025, Houston Electric responded to a PUCT memo dated July 30, 2025 that requested additional information. On August 21, 2025, the SRP was additionally discussed at a PUCT open meeting and the PUCT requested further clarification related to the vegetation management resiliency measure included in the SRP. On September 11, 2025, the PUCT granted Houston Electric a window to file supplemental evidence related to the vegetation management measure included in the SRP on or before October 13, 2025. Houston Electric filed such supplemental evidence on October 6, 2025. The PUCT staff must file a recommendation on the sufficiency of the supplemental evidence by October 27, 2025. A decision from the PUCT is anticipated in the fourth quarter of 2025.\nRate Change Applications\nThe Registrants are routinely involved in rate change applications before state regulatory authorities. Those applications include general rate cases, where the entire cost of service of the utility is assessed and reset. In addition, the Registrants are periodically involved in proceedings to adjust their capital tracking mechanisms (e.g., CSIA, DCRF, DRR, GRIP, TCOS, ECA, CECA and TDSIC), their decoupling mechanisms (e.g., decoupling and SRC), and their energy efficiency cost trackers (e.g., CIP, DSMA, EECRF, EEFC and EEFR).\nMinnesota Gas Rate Case.\nOn November 1, 2023, CERC filed an application with the MPUC requesting an adjustment to delivery charges in 2024 and 2025 for the natural gas business in Minnesota. The requested increase is approximately 6.5% or $85 million for 2024 and an additional approximately 3.7% or $52 million for 2025. The need for a rate change is primarily driven by continuing investment in the safety and reliability of the natural gas system, including new Intelis natural gas meters that feature an integrated safety shutoff valve, changes to depreciation rates that better reflect the actual life and salvage characteristics of assets and changes in other costs to serve customers. The request reflects a proposed 10.3% ROE on a 52.5% equity ratio. Interim rates for 2024 of $69 million, subject to refund, were implemented as of January 1, 2024. A request for interim rates of $33 million for 2025 was filed on September 30, 2024, approved at the December 3, 2024 hearing and approved by an order issued December 20, 2024. A unanimous settlement agreement was filed on November 25, 2024. The settlement provided for an increase of $60.8 million for 2024 and an additional $42.7 million for 2025. The parties agreed to an overall cost of capital of 7.07% for 2024 and 2025. The ALJ filed a report on February 13, 2025 recommending that the MPUC approve the settlement agreement. As required by the December 20, 2024 order, the difference between 2024 interim rates and the settled amount of $60.8 million was refunded to customers in March 2025. Exceptions to the ALJ report were filed on April 18, 2025. On May 29, 2025, the MPUC approved the settlement agreement. A final order approving the settlement agreement was issued by the MPUC on June 27, 2025 and final rates were implemented on September 1, 2025.\nHouston Electric Rate Case.\nOn March 6, 2024, Houston Electric filed an application with the PUCT requesting authority to change rates and charges for electric transmission and distribution service. The requested increase was approximately $17 million (1%) for retail customers and $43 million (6.6%) for wholesale transmission service, excluding TCRF and rate case expenses. The need for a rate increase was primarily driven by continuing investment that has been made to support customer growth and to bolster the safety and reliability of Houston Electric’s transmission and distribution system. The request reflected a proposed 10.4% ROE and a 45% equity ratio. Errata testimony was filed to correct minor errors included in the initial filing, which reduced the requested increase to $56 million compared to then-current rates. Houston Electric reached a settlement agreement with certain parties and submitted the agreement to the PUCT on January 29, 2025. The settlement reflects a $47 million reduction in annual revenues and a 9.65% ROE and a weighted average cost of capital of 6.606% based upon an as-filed 4.29% cost of debt, an agreed ROE of 9.65% and an agreed regulatory capital structure of 56.75% long-term debt and 43.25% equity. A final order approving the settlement agreement was issued by the PUCT on March 13, 2025. Final retail delivery rates were implemented on April 28, 2025. Final wholesale transmission rates were superseded by interim TCOS rates that went into effect on the same date.\n. CEOH filed its Application and Standard Filing Requirement in October 2024 and the related testimony in November 2024. The filing seeks a revenue requirement increase of approximately $100 million based on a requested ROE of 10.4% and an equity percentage of 54.13%. The need for a rate increase was primarily driven by continuing investment in the safety and reliability of the natural gas system. On May 16, 2025, the PUCO staff filed its staff report recommending a revenue requirement range of $340.8 million to $350.3 million and a net increase of $25.1 million to $34.6 million based on an ROE range from 9.05% to 10.07% with a capitalization ratio of 52.3% common equity and 47.7% long-term debt. The PUCO staff recommendation includes amortization over 49 years and 65 years for CEP and DRR regulatory assets, respectively, compared to CEOH’s proposal to amortize over seven years. On June 16, 2025, CEOH filed objections to the PUCO staff report and supplemental testimony. On July 11, 2025, CEOH filed a stipulation and recommendation that outlined the agreed upon terms between CEOH, the Federal Executive Agencies, Ohio Energy Group, the City of Dayton, the Retail Energy Supply Association, Interstate Gas Supply, LLC and the PUCO staff. One intervening party to the case, Spire Marketing, Inc., is a non-opposing party, while another intervening party to the case, the Office of the Ohio Consumers’ Counsel, filed its testimony in opposition to the stipulation and recommendation on July 29, 2025. The stipulation and recommendation included a revenue requirement of $371.3 million, which would result in a revenue requirement increase of $59.6 million based on a rate of return of 7.1% comprised of a ROE of 9.85% with a capitalization ratio of 52.9% common equity, 47."
}