{
  "source_file": "cnp-20241231.htm",
  "form_type": "10-K",
  "item1_clean": "MISO-Related Activity\nIndiana Electric is a member of the MISO, a FERC-approved regional transmission organization. The MISO serves the electric transmission needs of much of the Midcontinent region and maintains operational control over Indiana Electric’s electric transmission facilities and generation facilities as well as other utilities in the region. Indiana Electric is an active participant in the MISO energy markets, bidding its owned generation into the Day Ahead and Real Time markets and procuring power for its retail customers at Locational Marginal Pricing as determined by the MISO market. MISO-related purchase and sale transactions are recorded using settlement information provided by the MISO. These purchase and sale transactions are accounted for on at least a net hourly position.\nMISO-related activity for the year ended December 31, 2024 was as follows:\nRepresents intervals when purchases from the MISO were in excess of generation sold to the MISO.\nRepresents intervals when sales to the MISO were in excess of purchases from the MISO. Net sales were insignificant during 2024 primarily due to the retirement of SIGECO’s A.B. Brown coal generating facilities in 2023 and SIGECO’s exit from joint operations in the Warrick 4 coal generating facility on January 1, 2024.\nAs of December 31, 2024, Indiana Electric had interconnections with Louisville Gas and Electric Company, Duke Energy Shared Services, Inc., Indianapolis Power & Light Company, Hoosier Energy Rural Electric Cooperative, Inc. and Big Rivers Electric Corporation providing the ability to simultaneously interchange approximately 645 MW during peak load periods. Indiana Electric, as required as a member of the MISO, has turned over operational control of the interchange facilities\nand its own transmission assets to the MISO. Indiana Electric, in conjunction with the MISO, must operate the bulk electric transmission system in accordance with NERC Reliability Standards. As a result, interchange capability varies based on regional transmission system configuration, generation dispatch, seasonal facility ratings and other factors. Indiana Electric is in compliance with reliability standards promulgated by NERC.\nSIGECO Securitization Subsidiary\nSIGECO has a special purpose subsidiary, SIGECO Securitization Subsidiary, which it consolidates. This consolidated special purpose subsidiary is a wholly-owned, bankruptcy-remote entity that was formed solely for the purpose of facilitating the securitization financing of qualified costs. The obligations of the SIGECO Securitization Bonds are repaid through charges imposed on customers in Indiana Electric’s service territory. For further discussion of the SIGECO Securitization Bonds and the outstanding balance as of December 31, 2024, see Note 12 to the consolidated financial statements.\nThere are no other electric transmission and distribution utilities in Indiana Electric’s service area. Indiana Electric is a vertically integrated utility that owns the generation, transmission, and distribution components of a utility.\nFor another provider of transmission and distribution services to provide such services in Indiana Electric’s territory, it would be required to obtain IURC approval of such service territory. Indiana service territory certificates are exclusive. Distributed generation (i.e., power generation located at or near the point of consumption) could result in reduced demand for Indiana Electric’s distribution services but has not been a significant factor to date.\nIndiana Electric’s revenues are primarily derived from rates that it collects from customers in its service territory based on the amount of electricity it delivers. Indiana Electric’s revenues and results of operations are subject to seasonality, weather conditions and other changes in electricity usage, with revenues generally being higher during the warmer months when more electricity is used for cooling purposes, and during the cooler months when more electricity is used for heating purposes.\nNatural Gas (CenterPoint Energy and CERC)\nCenterPoint Energy’s and CERC’s Natural Gas engage in regulated intrastate natural gas sales to, and natural gas transportation and storage for, residential, commercial, industrial and transportation customers. CenterPoint Energy’s and CERC’s Natural Gas provide permanent pipeline connections through interconnects with various interstate and intrastate pipeline companies through CEIP. CenterPoint Energy’s and CERC’s Natural Gas also provided services in Minnesota consisting of residential appliance repair and maintenance services along with HVAC equipment sales and home repair protection plans to natural gas customers in Indiana, Mississippi, Ohio and Texas through a third party as of December 31, 2024.\nFor information regarding the properties of the Natural Gas reportable segment, read “Properties — Natural Gas (CenterPoint Energy and CERC)” in Item 2 of this report, which information is incorporated herein by reference.\nOn February 19, 2024, CenterPoint Energy, through its subsidiary CERC Corp., entered into the LAMS Asset Purchase Agreement to sell its Louisiana and Mississippi natural gas LDC businesses. The transaction was approved by final orders issued by the MPSC on December 3, 2024 and by the LPSC on December 17, 2024.\n\nFor a discussion of certain of CenterPoint Energy’s and CERC’s Natural Gas’ ongoing regulatory proceedings, see “Management’s Discussion and Analysis of Financial Condition and Results of Operations — Liquidity and Capital Resources — Regulatory Matters” in Item 7 of Part II of this report, which discussion is incorporated herein by reference.\nDepartment of Transportation (CenterPoint Energy and CERC)\nCenterPoint Energy and CERC are subject to regulation by PHMSA under the NGPSA and the HLPSA. The NGPSA delegated to PHMSA through DOT the authority to regulate gas pipelines. The HLPSA delegated to PHMSA through DOT the authority to develop, prescribe and enforce federal safety standards for the transportation of hazardous liquids by pipeline. Every four years PHMSA is up for reauthorization by Congress and with that reauthorization comes changes to the legislative requirements that Congress sets forth for the oversight of natural gas and hazardous liquid pipelines. In 2020, the PIPES Act was enacted. The PIPES Act reauthorized PHMSA through 2023 and imposed a few new mandates on the agency. The law establishes a PHMSA technology pilot, authorizes a new idled pipe operating status and contains process protections for operators during PHMSA enforcement proceedings. Section 114 of the PIPES Act is a self-mandating rule for natural gas pipeline operations like CERC’s that focuses on processes and procedures to eliminate or reduce emissions during normal operations. Further, Section 113 of the PIPES Act directed PHMSA to develop regulations to require natural gas pipeline operators to implement leak detection and repair programs, as well as requirements for mitigating emissions in operations. The PIPES Act of 2023 was approved by the House Transportation and Infrastructure Committee on December 6, 2023 to reauthorize PHMSA’s safety programs for the next four years. Final versions of the Section 113 Leak Detection and Repair, and Safety of Natural Gas Distribution Pipelines, 2020 PIPES Act rules remain frozen until a Department of Transportation appointee can review and proceed further.\nIn January 2021, PHMSA published a final rule amending the federal Pipeline Safety Regulations to ease regulatory burdens on the construction, operation, and maintenance of gas transmission, distribution, and gathering systems.\nCenterPoint Energy and CERC anticipate that compliance with PHMSA’s regulations, performance of the remediation activities by CenterPoint Energy’s and CERC’s Natural Gas and intrastate pipelines, and verification of records on maximum allowable operating pressure will continue to require increases in both capital expenditures and operating costs. The level of expenditures will depend upon several factors, including age, location and operating pressures of the facilities. In particular, the cost of compliance with the DOT’s integrity management rules will depend on integrity testing and the repairs found to be necessary by such testing. Changes to the amount of pipe subject to integrity management, whether by expansion of the definition of the type of areas subject to integrity management procedures or of the applicability of such procedures outside of those defined areas, may also affect the costs incurred. Implementation by PHMSA of the PIPES Act, in particular the final rule implementing Section 113, acts reauthorizing PHMSA or other future acts may result in other regulations or the reinterpretation of existing regulations that could impact compliance costs. In addition, CenterPoint Energy and CERC may be subject to the DOT’s enforcement actions and penalties if they fail to comply with pipeline regulations.\nENVIRONMENTAL MATTERS\nThe following discussion is based on environmental matters in the Registrants’ businesses as of December 31, 2024. The Registrants’ operations are subject to stringent and complex laws and regulations pertaining to the environment. As an owner or operator of natural gas pipelines, distribution systems and storage, electric transmission and distribution systems, steam electric and renewable generation systems and the facilities that support these systems, the Registrants must comply with these laws and regulations at the federal, state and local levels. These laws and regulations can restrict or impact the Registrants’ business activities in many ways, including, but not limited to:\nrestricting the way the Registrants can handle or dispose of wastes, including wastewater discharges and air emissions;\nlimiting or prohibiting construction activities in sensitive areas such as wetlands, coastal regions or areas inhabited by endangered species;\nrequiring remedial action and monitoring to mitigate environmental conditions caused by the Registrants’ operations or attributable to former operations;\nenjoining the operations of facilities with permits issued pursuant to such environmental laws and regulations; and\nimpacting the demand for the Registrants’ services by directly or indirectly affecting the use or price of fossil fuels, including, but not limited to, natural gas.\nTo comply with these requirements, the Registrants may need to spend substantial amounts and devote other resources from time to time to, among other activities:\nconstruct or acquire new facilities and equipment;\nacquire permits for facility operations or purchase emissions allowances;\nmodify, upgrade or replace existing and proposed equipment; and\ndecommission or remediate waste management areas, fuel storage facilities and other locations.\nFailure to comply with these laws and regulations may trigger a variety of administrative, civil and criminal enforcement measures, including the assessment of monetary penalties, revocation of permits, the imposition of remedial actions and monitoring and the issuance of orders enjoining future operations. Certain environmental statutes impose strict, joint and several liability for costs required to assess, clean up and restore sites where hazardous substances have been stored, disposed or released. Moreover, it is not uncommon for neighboring landowners and other third parties to file claims for personal injury and/or property damage allegedly caused by the release of hazardous substances or other waste products into the environment.\nIncreasingly, environmental regulation has resulted in more restrictions and limitations on activities that may impact the environment. There can be no assurance as to the amount or timing of future expenditures for environmental compliance or remediation and monitoring, and actual future expenditures may be different from the amounts currently anticipated. The Registrants try to ",
  "item7_clean": "On February 19, 2024, CERC Corp. entered into the LAMS Asset Purchase Agreement to sell its Louisiana and Mississippi natural gas LDC businesses. The purchase price for the Louisiana and Mississippi natural gas LDC businesses is $1.2 billion and subject to adjustment as set forth in the LAMS Asset Purchase Agreement, including adjustments based on net working capital, regulatory assets and liabilities and capital expenditures at closing. The transaction is not subject to a financing condition and is expected to close by the end of the first quarter of 2025, subject to satisfaction of customary closing conditions. The businesses include approximately 12,000 miles of main pipeline in Louisiana and Mississippi serving more than 300,000 customers. The Louisiana and Mississippi natural gas LDC businesses are reflected in CenterPoint Energy’s Natural Gas reportable segment and CERC’s single reportable segment, as applicable. For further information, see Note 4 to the consolidated financial statements.\nRegulatory Proceedings.\nFor further information, see Note 7 to the consolidated financial statements. For information related to our pending and completed regulatory proceedings to date in 2024 and to date in 2025, see “—Liquidity and Capital Resources —Regulatory Matters” below.\nIn 2024, CenterPoint Energy issued or borrowed a combined $4.0 billion in new debt, including Houston Electric’s issuance of $900 million aggregate principal amount of general mortgage bonds and a $500 million term loan, CERC’s issuance of $400 million principal amount of senior notes, SIGECO’s issuance of $160 million aggregate principal amount of first mortgage bonds, and CenterPoint Energy’s issuance of $700 million aggregate principal amount of senior notes and $1.3 billion aggregate principal amount of junior subordinated notes. During 2024, CenterPoint Energy repaid or redeemed a combined $0.9 billion of debt, including $500 million of its senior notes, $350 million of its floating rate senior notes and $22 million of SIGECO’s first mortgage bonds. For further information about debt transactions in 2024, see Note 12\nto the consolidated financial statements.\nOn January 29, 2025, CenterPoint Energy, Houston Electric, CERC and SIGECO each entered into Extension Agreements to, among other things, extend the maturity date of the lenders’ commitments under each of their respective Credit Agreements by one year, from December 6, 2027 to December 6, 2028.\nAdditionally, on January 31, 2025, SIGECO issued $165 million aggregate principal amount of 5.69% First Mortgage Bonds, Series 2025A, Tranche A due 2055. Total net proceeds from SIGECO’s January 2025 issuance of first mortgage bonds, net of transaction expenses and fees, were approximately $164 million, which will be used for the acquisition of Posey Solar.\nCERTAIN FACTORS AFFECTING FUTURE EARNINGS\nOur past earnings and results of operations are not necessarily indicative of our future earnings and results of operations. The magnitude of our future earnings and results of our operations will depend on or be affected by numerous factors that apply to all Registrants unless otherwise indicated including:\nThe business strategies and strategic initiatives, restructurings, joint ventures and acquisitions or dispositions of assets or businesses involving us or our industry, including the ability to successfully complete such strategies, initiatives, transactions or plans on the timelines we expect or at all, such as the announced sale of our Louisiana and Mississippi natural gas LDC businesses, which we cannot assure will have the anticipated benefits to us;\nindustrial, commercial and residential growth in our service territories and changes in market demand, including in relation to the expansion of data centers, energy export facilities, including hydrogen facilities, electrification of industrial processes and transport and logistics, as well as the effects of energy efficiency measures and demographic patterns;\nour ability to fund and invest planned capital and the timely recovery of our investments, including the timing of and amounts sought for those related to Indiana Electric’s generation transition plan as part of its IRPs and Houston Electric’s GHRI and SRP;\nour ability to successfully construct, operate, repair and maintain electric generating facilities, natural gas facilities, TEEEF and electric transmission facilities, including complying with applicable environmental standards and the implementation of a well-balanced energy and resource mix, as appropriate;\ntimely and appropriate rate actions that allow and authorize timely recovery of costs and a reasonable return on investment, including the timing of and amounts sought for recovery of Houston Electric’s TEEEF leases and restoration costs relating to the May 2024 Storm Events and Hurricane Beryl, and requested or favorable adjustments to rates and approval of other requested items as part of base rate proceedings;\nour ability to finalize Houston Electric’s proposal to release its 15 large 27 MW to 32 MW TEEEF units to the San Antonio area and complete one or more other future transactions involving the units on acceptable terms and conditions within the anticipated timeframe;\neconomic conditions in regional and national markets, including changes to inflation and interest rates, and their effect on sales, prices and costs;\nweather variations and other natural phenomena, including the impact of severe weather events on operations, capital, legislation and/or regulations, such as in connection with the February 2021 Winter Storm Event, the May 2024 Storm Events and Hurricane Beryl;\nvolatility in the markets for natural gas as a result of, among other factors, tariffs, legislation, bans, potential retaliatory trade measures taken against the United States or related governmental action, as well as armed conflicts, including the conflict in the Middle East and any broader related conflict, and the conflict in Ukraine, and the related sanctions on certain Russian entities;\ndisruptions to the global supply chain, including as a result of volatility in commodity prices, trade agreements, geopolitical and economic uncertainty, regulatory and policy instability, severe weather events, tariffs, bans, retaliatory trade measures, legislation and governmental action impacting the supply chain, that could prevent CenterPoint Energy from securing the resources needed to, among other things, fully execute on its 10-year capital plan or achieve its net zero and GHG emissions reduction goals;\nnon-payment for our services due to financial distress of our customers and the ability of our customers, including REPs, to satisfy their obligations to CenterPoint Energy, Houston Electric and CERC, and the negative impact on such ability related to adverse economic conditions and severe weather events;\npublic health threats, and their effect on our operations, business and financial condition, our industries and the communities we serve, U.S. and world financial markets and supply chains, potential regulatory actions and changes in customer and stakeholder behavior relating thereto;\nstate and federal legislative and regulatory actions or developments affecting various aspects of our businesses, including, among others, any actions resulting from the May 2024 Storm Events and/or Hurricane Beryl, energy\nderegulation or re-regulation, pipeline integrity and safety and changes in regulation and legislation pertaining to trade, health care, finance and actions regarding the rates charged by our regulated businesses;\nour ability to execute Houston Electric’s GHRI and SRP;\ndirect or indirect effects on our facilities, resources, operations, reputation and financial condition resulting from terrorism, cyberattacks or intrusions, data security breaches or other attempts to disrupt our businesses or the businesses of third parties, or other catastrophic events such as fires, earthquakes, explosions, leaks, floods, droughts, hurricanes, tornadoes, derecho events, ice storms and other severe weather events, terrorism, wildfires, pandemic health events, geopolitical conflict or other occurrences;\nrisks relating to potential wildfires, including damages to our network and losses in excess of insurance liability coverage;\ntax legislation, including the effects of or changes to or the repeal of the IRA (which includes but is not limited to any potential changes to tax rates, CAMT imposed, tax credits and/or interest deductibility), as well as any changes in tax laws under the current or future administrations, and uncertainties involving state commissions’ and local municipalities’ regulatory requirements and determinations regarding the treatment of EDIT and our rates;\nour ability to mitigate weather impacts through normalization or rate mechanisms, and the effectiveness of such mechanisms;\nactions by credit rating agencies, including any potential downgrades to credit ratings;\nmatters affecting regulatory approval, legislative actions, construction, implementation of necessary technology or other issues with respect to major capital projects that result in delays or cancellation or in costs that cannot be recouped in rates;\nlocal, state and federal legislative and regulatory actions or developments relating to the environment, including, among others, those related to global climate change, air emissions, GHG emissions, carbon emissions, wastewater discharges and the handling and disposal of CCR that could impact operations, cost recovery of generation plant costs and related assets, and CenterPoint Energy’s net zero and GHG emissions reduction goals;\nthe impact of unplanned facility outages or other closures;\nthe sufficiency of our insurance coverage, including availability, cost, coverage and terms and ability to recover claims;\nthe availability and prices of raw materials and services and changes in labor for current and future construction projects and operations and maintenance costs, including our ability to control such costs;\nimpacts from CenterPoint Energy’s pension and postretirement benefit plans, such as the investment performance and increases to net periodic costs as a result of plan settlements and changes in assumptions, including discount rates;\nchanges in interest rates and their impact on costs of borrowing and the valuation of CenterPoint Energy’s pension benefit obligation;\ncommercial bank and financial market conditions, including disruptions in the banking industry, our access to capital, the cost of such capital, the results of our financing and refinancing efforts, including availability of funds in the debt capital markets, and impacts on our vendors, customers and suppliers;\ninability of various counterparties to meet their obligations to us;\nthe extent and effectiveness of our risk management activities;\ntimely and appropriate regulatory actions, which include actions allowing requested securitization for any hurricanes or other severe weather events, such as the May 2024 Storm Events and Hurricane Beryl, or natural disasters or other amounts sought for recovery of costs, including stranded coal-fired generation asset costs;\nour ability to attract, effectively transition, motivate and retain management and key employees and maintain good labor relations;\nchanges in technology, particularly with respect to efficient battery storage or the emergence or growth of new, developing or alternative sources of generation, and their adoption by consumers, and our ability to anticipate and adapt to technological changes;\nour success in adopting, developing and deploying AI;\nthe impact of climate change and alternate energy sources on the demand for natural gas and electricity generated or transmitted by us;\nthe timing and outcome of any audits, disputes and other proceedings related to taxes;\nthe recording of impairment charges;\npolitical and economic developments and actions, including energy and environmental policies under the new presidential administration;\nCenterPoint Energy’s ability to execute on its strategy, initiatives, targets and goals, including its net zero and GHG emissions reduction goals and its operations and maintenance expenditure goals;\nthe outcome of litigation, including litigation related to the February 2021 Winter Storm Event and Hurricane Beryl;\nthe effect of changes in and application of accounting standards and pronouncements; and\nother factors discussed in “Risk Factors” in Part I, Item 1A of this report and in other reports that the Registrants file from time to time with the SEC.\nCENTERPOINT ENERGY CONSOLIDATED RESULTS OF OPERATIONS\nCenterPoint Energy’s results of operations are affected by seasonal fluctuations in the demand for electricity and natural gas. CenterPoint Energy’s results of operations are also affected by, among other things, the actions of various governmental authorities having jurisdiction over rates its subsidiaries charge, debt service costs, income tax expense, its subsidiaries ability to collect receivables from REPs and customers and its ability to recover its regulatory assets. For information regarding factors that may affect the future results of our consolidated operations, read “Risk Factors” in Part I, Item 1A of this report.\nIncome available to common shareholders for the years ended December 31, 2024, 2023 and 2022 was as follows:\nYear Ended December 31,\nFavorable (Unfavorable)\nTotal Utility Operations\nCorporate & Other (1)\nTotal CenterPoint Energy\nIncludes energy performance contracting and sustainable infrastructure services through Energy Systems Group through the date of sale on June 30, 2023, unallocated corporate costs, interest income and interest expense, intercompany eliminations and the reduction of income allocated to preferred shareholders through September 1, 2023, the date of the redemption of all of the outstanding shares of the Series A Preferred Stock.\n2024 Compared to 2023\nCenterPoint Energy reported income available to common shareholders of $1,019 million for 2024 compared to income available to common shareholders of $867 million for 2023.\nIncome available to common shareholders increased $152 million primarily due to the following items:\nan increase in income available to common shareholders of $17 million for the Electric reportable segment, as further discussed below;\nan increase in income available to common shareholders of $31 million for the Natural Gas reportable segment, as further discussed below; and\nan increase in income available to common shareholders of $104 million for Corporate and Other, primarily due to $50 million of income allocated to holders of Series A Preferred Stock in 2023 prior to the redemption of all outstanding shares of Series A Preferred Stock in September 2023 as discussed in Note 11 to the consolidated financial statements, a loss on sale of $13 million and current tax expense of $32 million related to the divestiture of Energy Systems Group recorded in 2023 further discussed in Note 4 to the consolidated financial statements, $19 million due to remeasurement of deferred income tax balances recorded during 2023, as well as $8 million due to lower state income taxes. The remaining variance is due largely to an increase in borrowing costs.\n2023 Compared to 2022\nCenterPoint Energy reported income available to common shareholders of $867 million for 2023 compared to income available to common shareholders of $1,008 million for 2022.\nIncome available to common shareholders decreased $141 million primarily due to the following items:\nan increase in income available to common shareholders of $51 million for the Electric reportable segment, as further discussed below;\nan increase in income available to common shareholders of $41 million for the Natural Gas reportable segment, as further discussed below; and\na decrease in income available to common shareholders of $233 million for Corporate and Other, primarily due to a pre-tax ",
  "item2_clean": null
}