{
  "source_file": "coin-20241231.htm",
  "form_type": "10-K",
  "item1_clean": "We are deeply invested in building the most secure and compliant platform. We hold customer assets one-to-one at all times. We do not act on customer assets, including staking, lending, rehypothecating, or engaging in fractional reserve banking, without customer consent.\nWe strive to build products that are easy to use and that our customers love. We obsess over quality and craft in our products. We strive to make buying, storing, and using crypto easy.\nWe offer products and services to three customer groups:\nRetail customers seeking to invest in or trade crypto assets and engage onchain.\nBusinesses that include market makers, asset managers, hedge funds, banks, wealth platforms, registered investment advisors, payment platforms, and public and private corporations.\nEntrepreneurs, creators, merchants, crypto asset issuers, organizations and financial institutions, and other groups building decentralized protocols, applications, products, or other services onchain.\nOur platform serves as a trusted and compliant on-ramp to the onchain economy and enables our users to engage in a wide variety of activities with their crypto assets in both our own proprietary and third-party product experiences enabled by access to decentralized applications. Our business consists of\nTransaction products\nOur platform is designed to serve a wide variety of consumers, whether they are buying their first crypto asset or are advanced traders. We offer two trading experiences:\n: Our simple trading experience offers customers the ability to buy, sell, and convert crypto assets using the basic interface of our platform, and includes value-added services such as fixed price quotes and recurring trades. Simple trading focuses on consumers of all experience levels who are prioritizing ease of use.\n: Our advanced trading experience offers traders access to spot and derivatives order books, real-time market information through interactive charts, a live trade history on the advanced trade view, and other trading tools. Advanced trading focuses on sophisticated traders who are prioritizing a robust set of features to meet their more complex needs and higher volume.\nWe generate fees from consumers trading on our platform, including through volume-based transaction fees and a spread depending on the type of trade. Simple trading and advanced trading fees differ due to both the typical nature of the transactions and unique benefits of each offering. Generally, simple trading fees are higher than those on advanced trading because advanced traders typically trade at higher volumes than simple traders.\nCoinbase Prime is our full-service prime brokerage platform, where our institutional customers can access deep pools of liquidity across a network of trading venues. We offer volume-based pricing and charge a transaction fee for executed trades.\nWe provide market infrastructure in the form of trading venues for customers to trade spot and derivatives. We currently provide access to three trading venues: the Coinbase Exchange, the Coinbase International Exchange, and the Coinbase Derivatives Exchange. These markets generate revenue by charging a transaction fee for executed trades.\nBase is an L2 Ethereum blockchain offering fast, cheap, global onchain transactions. In 2024, Base reduced median transaction fees by more than 90% to enable sub-one cent median transactions. Base’s goal is to bring one million developers and one billion users onchain to build a global economy. Base aspires to be the best place to build applications, create content, and earn money onchain. Coinbase generates revenue from sequencer fees paid each time a transaction is processed on the Base blockchain.\nCoinbase Wallet is a self-custodial wallet software product, which we offer globally. Coinbase Wallet enables users to engage and transact with the full universe of Dapps and actively engage in the onchain economy without the need for a centralized intermediary. Customers can also link their Coinbase account to their Coinbase Wallet to more easily transfer assets between the two. In 2024, Coinbase launched “smart wallet,” which is an improved self-custody technology that enables instant onboarding with no separate app or extension, and no need to memorize a seed phrase. Coinbase Wallet now includes smart\nwallet compatibility. A benefit of Coinbase Wallet is that consumers have sole control over their private keys and/or seed phrase, which are stored directly on their mobile devices or personal storage accounts and not with a centralized entity. Because the private key is unilaterally controlled by the user, Coinbase is unable to assist in recovery in the event a user loses their key or seed phrase.\nSubscription products and other services\nStablecoins play a key role in updating the financial system and advancing economic freedom by combining the benefits of crypto rails, which are global, cheap, and fast, with an asset that is stable relative to fiat currencies. We offer a variety of stablecoins denominated in multiple fiat currencies on our platform, and we continue to explore partnerships with a number of stablecoin issuers to expand our offerings.\nIn 2018, we partnered with Circle Internet Financial, LLC (“Circle”) to launch USDC, with the goal of driving global, mainstream adoption of stablecoins. Circle and its affiliate, Circle Internet Financial Europe SAS, are the issuers of USDC, a stablecoin redeemable on a one-to-one basis for U.S. dollars, and Circle Internet Financial Europe SAS is the issuer of EURC, a stablecoin redeemable on a one-to-one basis for Euros. In August 2023, we entered into an updated arrangement with Circle to (i) support USDC; (ii) help drive long-term success of the stablecoin ecosystem; and (iii) share in the economics of the reserves backing stablecoins in circulation both on and off our platform (the “Circle Agreement”). Pursuant to the Circle Agreement, Circle pays us for our role in the growth of USDC: the greater the proportion of USDC in circulation generally and on our platform, the greater our revenue generated under the Circle Agreement. The Circle Agreement has an initial three-year term. Upon completion of the initial term, we and Circle will discuss in good faith whether any modifications to the Circle Agreement are warranted. If such modifications are not agreed upon, the Circle Agreement will automatically renew for additional three-year terms unless we or Circle fail to meet ongoing obligations under the Circle Agreement.\nHistorically, we have observed that customers holding USDC on our platform are more likely to use other products such as trading. Therefore, where permitted, we pay rewards to both consumer and institutional customers who hold USDC to incentivize on-platform balances and deeper engagement with our product suite. In 2024, we began paying rewards onchain to customers holding USDC balances in Coinbase Wallet.\nStaking is one of our most popular services. Certain blockchain protocols, such as Ethereum and Solana, rely on staking to validate blockchain transactions, an essential operation to these protocols’ operations and an alternative consensus mechanism to mining. Network participants can designate a certain amount of their crypto assets on the network to validate transactions and earn rewards. Today, many users choose to outsource the technical processes involved in staking by staking through a service provider.\nWe provide an onchain staking service, which allows our customers to stake their assets with a few clicks. Our customers maintain full ownership of their crypto assets while earning staking rewards. Customers who stake their assets receive compensation, paid out by applicable blockchain protocols, in\nthe form of the network’s crypto asset. The rewards rates, expressed as an annual percentage yield, vary by asset. In return for the services we provide, we earn a fixed percentage commission on all staking rewards received.\nBecause staking rewards depend on the relevant protocol and network conditions, the estimated rewards rate for each asset made available for staking is displayed on our website and through our platform, and is calculated by periodically consulting onchain data to determine the total amount. We only facilitate staking of a consumer’s crypto assets in response to a direct instruction from that consumer, and the staked crypto assets remain the property of the consumer and in our custody while staked. According to certain protocol rules, staked crypto assets cannot be sold or transferred while they remain staked, and we do not use or allocate consumers’ staked crypto assets for any other purpose.\nSubject to jurisdiction, we support eight staking assets through our platform for consumers as of December 31, 2024: Cardano (ADA), Avalanche (AVAX), Cosmos (ATOM), Polkadot (DOT), Ethereum (ETH), MATIC (POL), Solana (SOL), and Tezos (XTZ). As of December 31, 2024, approximately $15.2 billion worth of these assets were held on behalf of individual consumers staked through our platform, as adjusted to USD.\nFor our institutional customers, our staking process varies by customer. In addition to operating our own validator nodes to provide staking services, we utilize third-party service providers to operate validator nodes on our customers’ behalf. Institutional customers receive rewards directly from the protocol as we do not stake on behalf of these customers. The fees we charge to institutional customers depend on the customer agreement and the selected service. As of December 31, 2024, over $8.1 billion worth of assets were staked by institutional customers through Coinbase Prime, as adjusted to USD.\nWe also operate a cbETH token wrapping service. cbETH is an Ethereum-based “wrapped staking token” that represents ownership of ETH staked through our platform. Eligible customers can obtain cbETH tokens by wrapping their staked ETH or by purchasing cbETH tokens on our exchange or on third-party exchanges. A cbETH holder can sell or transfer their cbETH within the Coinbase app or send cbETH to a self-custody wallet or to other addresses on the Ethereum blockchain. Selling or otherwise transferring cbETH automatically transfers ownership of the underlying staked ETH, along with any rewards earned.\nWe may suffer losses due to staking, delegating, and other related services provided to our customers.\nCoinbase One is a consumer subscription product for which consumers pay a monthly or annual fee to unlock a variety of benefits, including limited reduced transaction fee trading, higher staking and USDC rewards than non-Coinbase One subscribers, priority customer service support, and offers from third-party partners. In 2024, we launched an additional subscription tier, Coinbase One Premium, offering consumers enhanced benefits, including unlimited zero trading fees on simple trading and concierge support for a higher subscription fee.\nInstitutional financing\nFinancing is an increasingly important offering to our institutional customers. We offer integrated financing products and services to institutional customers that meet our credit criteria to access liquidity for their hedging, trading, and working capital needs.\nOur lending product set includes tools to allow clients to trade in real time, products that enable leverage and short access across our Prime and Markets offerings, and structured loans supporting client working capital and other needs.\nIn addition to lending, we borrow fiat and crypto assets, including USDC, from third parties, including eligible institutional customers, to facilitate our financing products. We also offer a managed lending product for eligible institutional customers under our Agency Lending offering.\nThe terms of our lending and borrowing arrangements may vary modestly from customer to customer. For additional information, see\nNote 4. Collateralized Arrangements and Financing\nRisk Factors—We provide secured loans to our customers, which e",
  "item7_clean": "Other income, net changed for the year ended December 31, 2024 as compared to 2023, due to:\na decrease in gains on strategic investments, net driven by a gain of $49.9 million resulting from an equity investment transaction with Circle US Holding, Inc. during the third quarter of 2023; and\na net gain on the repurchase of certain of our 2026 Convertible Notes and certain of our Senior Notes during 2023.\nThere were no material changes to note within other.\nProvision for (benefit from) income taxes\nYear Ended December 31,\n(in thousands, except %)\nProvision for (benefit from) income taxes\nFor the year ended December 31, 2024 as compared to 2023, the increase in provision for income taxes was primarily due to higher pretax income, partially offset by tax benefits from stock-based compensation. Additionally, the 2023 income tax provision reflected a benefit from the reduction of a valuation allowance recorded on impairment charges and strategic investments.\nIn December 2021, the Organization for Economic Cooperation and Development introduced Pillar Two model rules imposing a 15% global minimum tax on companies such as ours. We operate in several jurisdictions that have introduced Pillar Two legislation with effect from January 1, 2024. Pillar Two did not have a material impact on our tax provision for 2024. However, we may be impacted in future years as this framework is modified and adjusted in the jurisdictions where we operate.\nNon-GAAP Financial Measure\nIn addition to our results determined in accordance with GAAP, we believe Adjusted EBITDA, a non-GAAP financial performance measure, is useful information to help investors evaluate our operating performance because it: enables investors to compare this measure and component adjustments to similar information provided by peer companies and our past financial performance; provides additional company-specific adjustments for certain items that may be included in income from operations but that we do not consider to be normal, recurring, operating expenses (or income) necessary to operate our business given our operations, revenue generating activities, business strategy, industry, and regulatory environment; and provides investors with visibility to a measure management uses to evaluate our ongoing operations and for internal planning and forecasting purposes. For example:\nWe believe it is useful to exclude certain non-cash expenses, such as depreciation and amortization and stock-based compensation, from Adjusted EBITDA because the amounts of such expenses can vary significantly from period to period and may not directly correlate to the underlying performance of our business operations.\nWe believe it is useful to exclude certain items that we do not consider to be normal, recurring, cash operating expenses and therefore, not reflective of our ongoing business operations. For example, we exclude: (i) other (income) expense, net, as the income and expenses recognized in this line item are not part of our core operating activities and are considered non-operating activities under GAAP, (ii) gains and losses on crypto assets held for investment (post-adoption of ASU 2023-08) because such investments are considered primarily long-term holdings, we do not plan on engaging in regular trading of crypto assets, and, as an operating company, our investing activities in crypto are not part of our revenue generating activities, which are based on transactions on our platform and the sales of subscriptions and services, and (iii) the impact of our restructuring in 2023, which was not related to our normal business operations.\nWe believe Adjusted EBITDA is useful to measure a company’s operating performance without regard to items such as stock-based compensation expense, depreciation and amortization expense, interest expense, other (income) expense, net, restructurings, and benefit from or provision for income taxes that can vary substantially from company to company depending upon their financing, capital structures, and the method by which assets were acquired.\nLimitations of Adjusted EBITDA\nWe believe that Adjusted EBITDA may be helpful to investors for the reasons noted above. However, Adjusted EBITDA is presented for supplemental informational purposes only, has limitations as an analytical tool, and should not be considered in isolation or as a substitute for financial information presented in accordance with GAAP. There are a number of limitations related to Adjusted EBITDA rather than net income (loss), which is the nearest GAAP equivalent of Adjusted EBITDA. Some of these limitations are that Adjusted EBITDA excludes:\nprovision for (benefit from) income taxes;\ninterest expense, or the cash requirements necessary to service interest or principal payments on our debt, which reduces cash available to us;\ndepreciation and amortization expense and, although these are non-cash expenses, the assets being depreciated and amortized may have to be replaced in the future;\nstock-based compensation expense, which has been, and will continue to be for the foreseeable future, a significant recurring expense for our business and an important part of our compensation strategy;\nnet gains or losses on our crypto assets held for investment, net, after the adoption of ASU 2023-08;\nother (income) expense, net, which represents foreign exchange gains or losses, gains or losses on strategic investments, net, gains on the repurchase of certain of our long-term debt, and other non-operating income and expense activity;\nnon-recurring lease charges, which represent a non-recurring fee and write-off related to an early lease termination;\nnon-recurring accrued legal contingencies, settlements, and related costs, which reduces cash available to us;\nimpairment on crypto assets still held, net, which represents impairment on crypto assets still held and is a non-cash expense, prior to the adoption of ASU 2023-08; and\nthe impact of restructuring, which is not related to normal operations but impacted our results in 2023.\nIn addition, other companies, including companies in our industry, may calculate Adjusted EBITDA differently or may use other measures to evaluate their performance, all of which could reduce the usefulness of our disclosure of Adjusted EBITDA as a tool for comparison. A reconciliation is provided below for Adjusted EBITDA to Net income (loss), the most directly comparable financial measure stated in accordance with GAAP. Investors are encouraged to review the related GAAP financial measure and the reconciliation of Adjusted EBITDA to Net income (loss), and not to rely on any single financial measure to evaluate our business.\nRevised definition of Adjusted EBITDA\nDuring the first quarter of 2024, we revised our definition of Adjusted EBITDA as follows and recast the prior period for comparability:\nto adjust for other (income) expense, net in total, as the entire line item represents non-operating activity, and as a majority of the activity recorded in other (income) expense, net had been included in the calculation of Adjusted EBITDA previously in separate rows while this combined presentation is more streamlined and easily reconciled to our Consolidated Statements of Operations;\nto revise our definition of Adjusted EBITDA to remove the adjustment for crypto asset borrowing costs on Prime Financing, as even though these costs are akin to interest expense on debt, we believe they represent normal, recurring, operating expenses necessary to expand and grow Prime Financing; and\nto revise our definition of Adjusted EBITDA to change what is adjusted with respect to gains and losses on crypto assets in connection with the adoption of ASU 2023-08, adjusting post-adoption only for gains and losses on crypto assets held for investment, as they do not represent normal, recurring, operating expenses (or income) necessary to operate our business.\nThe following table provides a reconciliation of Net income (loss) to Adjusted EBITDA. The prior period comparative reconciliation has been updated to conform to the current period presentation (in thousands):\nYear Ended December 31,\nAdjusted to exclude the following:\nProvision for (benefit from) income taxes\nDepreciation and amortization\nStock-based compensation expense\nGains on crypto assets held for investment, net (post-adoption of ASU 2023-08)\nNon-recurring lease charges\nNon-recurring accrued legal contingencies, settlements, and related costs\nImpairment on crypto assets still held, net (pre-adoption of ASU 2023-08)\nRevised definition no longer adjusts for:\nCrypto asset borrowing costs\nOther impairment expense\nRevised definition newly adjusts for:\nAdditional other income, net\nAdjusted EBITDA, previous definition\nAmount in 2023 excludes stock-based compensation expense recognized in relation to restructuring, which is included below in the restructuring line in this table. See\nNote 20. Restructuring\n\nITEM 7. MANAGEMENT'S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS\nThe following discussion and analysis of our financial condition and results of operations should be read in conjunction with our Consolidated Financial Statements and the accompanying notes thereto included elsewhere\ne following discussion and analysis contains forward-looking statements that involve risks and uncertainties, as well as assumptions that, if they never materialize or prove incorrect, could cause our results to differ materially from those expressed or implied by such forward-looking statements. Factors that could cause or contribute to these differences include,\n. Unless otherwise expressly stated or the context otherwise requires, references to “we,” “our,” “us,” “the Company,” and “Coinbase” refer to Coinbase Global, Inc. and its c\nDuring 2024, we made progress against our goals of driving revenue growth, crypto utility, and regulatory clarity. We advanced the crypto economy by deepening institutional adoption, scaling international growth, and expanding real-world utility. Our investments in core products like derivatives and Coinbase One, as well as our focus on global expansion drove revenue growth, while innovations such as USDC rewards showcased the power of onchain finance.\nFor the year ended December 31, 2024, our net revenue was $6.3 billion, including $4.0 billion in transaction revenue and $2.3 billion in subscription and services revenue. For the year ended December 31, 2023, our net revenue was $2.9 billion, including $1.5 billion in transaction revenue and $1.4 billion in subscription and services revenue.\nFor the year ended December 31, 2024, our net income was $2.6 billion and Adjusted EBITDA was $3.3 billion. For the year ended December 31, 2023, our net income was $0.1 billion and Adjusted EBITDA was $1.0 billion.\nFor 2025, we believe that we are well-positioned to drive revenue growth across all macroeconomic environments, and we remain committed to advancing regulatory clarity. Despite multiple Federal Funds Rate decreases in late 2024, future interest rate decreases are not certain. If they continue, they may materially impact our subscription and services and other revenue. We plan to dynamically adjust our expense base in order to be responsive to market conditions and revenue opportunities, increasing or decreasing it as needed, especially with respect to certain variable expenses. In the first quarter of 2025, we expect technology and development and general and administrative expenses to grow modestly as compared to the fourth quarter of 2024, primarily due to headcount growth and variable infrastructure and customer support expenses. Additionally, we expect sales and marketing expenses to grow, as compared to the fourth quarter of 2024, primarily due to expected higher USDC rewards expense and variable non-brand marketing spend.\nKey Business Metrics\nIn addition to the measures presented in our Consolidated Financial Statements, we use the key business metrics listed below to evaluate our business, measure our performance, identify trends affecting our business, and make strategic decisions:\nYear Ended December 31,\n\nDecember 31, 2024 and 2023\nFor the years ended December 31, 2024 and 2023 we generated 83% and 88%, respectively, of total revenue in the U.S. No other country accounted for more than 10% of total revenue during the years presented. International revenue comprised mainly transaction revenue in both years presented.\nYear Ended December 31,\n(in thousands, except %)\nOther transaction revenue, net\nTotal transaction revenue\nPrior period amounts were reclassified to conform to current period presentation. See\nTransaction revenue increased for the year ended December 31, 2024 as compared to 2023, due to:\nan increase in consumer transaction revenue of $2.6 billion due to a 195% increase in consumer Trading Volume. This increase was offset in part by a decrease of $482.5 million attributed to a lower average blended fee rate, primarily due to changes in the mix of Trading Volume from Simple to Advanced trading;\nan increase in institutional transaction revenue of $139.1 million primarily due to a 139% increase in institutional Trading Volume, as well as growth in revenue from derivatives trading on our international exchange, which was launched in the second quarter of 2023; and\nan increase in other transaction revenue of $77.8 million from transactions on Base, which was launched in the third quarter of 2023, as well as higher revenue from instant transfer withdrawals.\nThe percentage of transaction revenue from trading on our platform broken down by crypto asset was as follows:\nYear Ended December 31,\n____________________________________\nNo other crypto asset individually represented more than 10% of the total.\nSubscription and services revenue\nYear Ended December 31,\n(in thousands, except %)\nInterest and finance fee income\nCustodial fee revenue\nOther subscription and services revenue\nTotal subscription and services revenue\nPrior period amounts were reclassified to conform to current period presentation. See\nSubscription and services revenue increased for the year ended December 31, 2024 as compared to 2023, due to:\nan increase in stablecoin revenue of $138.3 million primarily due to higher average customer USDC assets on platform and corporate balances, and $104.7 million attributable to an increase in overall USDC market capitalization, partially offset by increased expenses that are deducted prior to allocation of income from the arrangement with Circle;\nan increase of $350.5 million in blockchain rewards primarily due to higher average prices for Solana and Ethereum, as well as higher native units staked driving growth in both U.S. and international revenue, partially offset by a $62.3 million decrease attributable to changes in reward rates, primarily for Ethereum and Solana;\nan increase in interest and finance fee income primarily reflecting growth of $43.8 million in finance fees driven by higher average volumes of Prime Financing loan receivables, and growth of $25.0 million in interest income attributable to higher average customer custodial cash and cash equivalents balances;\nan increase in custodial fee revenue reflecting growth in average crypto assets and USDC under custody of $81.5 billion primarily driven by higher crypto asset prices, mainly Bitcoin, Solana, and Ethereum; and\nan increase in other subscription and services revenue primarily due to growth of $87.9 million in Coinbase One revenue, as the number of paid subscribers grew driven by positive market conditions and improvements to our product offerings, and an increase in revenue from expanding supported assets on our developer products.\nYear Ended December 31,\n(in thousands, except %)\nCorporate interest and other income\nOther revenue increased for the year ended December 31, 2024 as compared to 2023, primarily due to higher average cash and cash equivalents balances.\nCertain prior period amounts have been reclassified to",
  "item2_clean": null
}