{
  "source_file": "coin-20250930.htm",
  "form_type": "10-Q",
  "item1_clean": null,
  "item7_clean": null,
  "item2_clean": "ITEM 2. MANAGEMENT’S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS\nThe following discussion and analysis of our financial condition and results of operations should be read in conjunction with our Condensed Consolidated Financial Statements and the accompanying notes thereto included elsewhere\nDecember 31, 2024 (the “Annual Report”)\ne following discussion and analysis contains forward-looking statements that involve risks and uncertainties, as well as assumptions that, if they never materialize or prove incorrect, could cause our results to differ materially from those expressed or implied by such forward-looking statements. Factors that could cause or contribute to these differences include,\n. Unless otherwise expressly stated or the context otherwise requires, references to “we,” “ou\nr,” “us,” “the Company,” and “Coinbase” refer to Coinbase Global, Inc. and its consolidated subsidiaries. For all narrative provided in this Item 2, two numbers presented consecutively represent figures for the three and nine months ended September 30, 2025 as compared to the corresponding periods in 2024, respectively, unless otherwise noted.\nDuring the third quarter of 2025, we continued to make progress towards our mission by expanding access to trading through innovative derivative products, listing more spot assets, and expanding our offerings in markets globally. We completed the acquisition of Deribit in August, which we believe will play\na key role in our goal to be the premier global platform for crypto derivatives, and we launched U.S. perpetual futures. We continue to scale payments with USDC, which reached an all-time high in market capitalization, new partnerships, and crypto rewards for purchases through the Coinbase One Card.\nFor the three and nine months ended September 30, 2025, our net revenue was $1.8 billion and $5.2 billion, respectively, including $1.0 billion and $3.1 billion in transaction revenue and $746.7 million and $2.1 billion in subscription and services revenue. For the same periods in 2024, our net revenue was $1.1 billion and $4.1 billion, respectively, including $572.5 million and $2.4 billion in transaction revenue and $556.1 million and $1.7 billion in subscription and services revenue.\nFor the three and nine months ended September 30, 2025, our net income was $432.6 million and $1.9 billion, and Adjusted EBITDA was $800.7 million and $2.2 billion. For the same periods in 2024, our net income was $75.5 million and $1.3 billion, and Adjusted EBITDA was $448.6 million and $2.1 billion.\nDespite multiple Federal Funds Rate decreases in late 2024 and 2025, future interest rate decreases are not certain. If interest rates continue to decline, they may materially impact our subscription and services and other revenue. We plan to dynamically adjust our expense base in order to be responsive to market conditions and revenue opportunities, increasing or decreasing it as needed, especially with respect to certain variable expenses. In the fourth quarter of 2025, we expect technology and development and general and administrative expenses to increase as compared to the third quarter of 2025, primarily driven by a full fourth quarter of Echo and Deribit expenses and headcount growth. Additionally, we expect sales and marketing expenses to generally be in line with the third quarter of 2025, reflecting inclusion of a full fourth quarter of Deribit expenses, and dependent on USDC balances in Coinbase products and performance marketing opportunities throughout the quarter.\nKey Business Metrics\nIn addition to the measures presented in our Condensed Consolidated Financial Statements, we use the key business metrics listed below to evaluate our business, measure our performance, identify trends affecting our business, and make strategic decisions:\nThree Months Ended September 30,\nNine Months Ended September 30,\n\nMTUs for the three month period r\nepresent quarterly MTUs, which are calculated as the average of each month’s MTUs in each respective quarter. MTUs fo\nr the nine month period are calculated as the average of the quarterly MTUs within the period.\nRepresents Assets on Platform as of September 30, 2025 and 2024.\nS\nee the section titled “\nNon-GAAP Financial Measure\n” below for a reconciliation of net income to Adjusted EBITDA and an explanation for why we consider Adjusted EBITDA to be a helpful metric for investors.\nMonthly Transacting Users\nWe define a Monthly Transacting User (“MTU”) as a consumer who actively or passively transacts in one or more products on our platform at least once during the rolling 28-day period ending on the date of measurement. MTUs engage in transactions that generate both transaction revenue and subscription and services revenue. Revenue-generating transactions include active transactions, such as buying or selling crypto assets or passive transactions such as earning staking rewards and USDC rewards. MTUs also engage in transactions that are non-revenue generating, such as consumers sending and receiving crypto assets between wallets and off-platform accounts on a non-expedited basis. MTUs may overstate the number of unique consumers due to differences in product architecture or user behavior.\n\nfor the three and nine months ended September 30, 2025 as compared to 2024, primarily due to an increase in trading users, influenced by overall crypto market sentiment and activity, including higher average prices for certain crypto assets.\nWe define Assets on Platform (“AOP”) as the total United States (“U.S.”) dollar equivalent value of USDC and crypto assets held or managed on behalf of customers in digital wallets on our platform, including our custody services but excluding assets for which the customer holds full or partial keys, calculated based on the market price on the date of measurement. AOP demonstrates the scale of balances held across our suite of products and services, the trust customers place in us to securely store their assets, and the underlying growth of the cryptoeconomy. AOP also represents a monetization opportunity through our products and services, including from trading and the adoption and use of USDC, staking, custody, and institutional financing, when customers use these assets to engage with these products and services.\nThe following table sets forth the value of AOP by asset (in thousands, except percentages):\nXRP\nUSDC\nIncludes various other crypto asset balances, none of which individually represented more than 5% of total AOP.\nAOP at September 30, 2025 increased as compared to September 30, 2024, primarily reflecting higher Bitcoin AOP, including $114.8 billion of growth attributable to price and $73.9 billion of growth attributable to units. Separately, we attribute the growth in USDC AOP primarily to our USDC rewards program, combined with deeper integration of USDC across our products.\nWe define Trading Volume as the total U.S. dollar equivalent value of spot matched trades transacted between a buyer and seller through our platform during the period of measurement. Trading Volume does not include derivatives volume on our platform or trades executed on third-party venues. Trading Volume represents the product of the quantity of assets transacted and the trade price at the time the transaction was executed. As trading activity directly impacts transaction revenue, we believe this measure is a reflection of liquidity on our order books, trading health, and the underlying growth of the cryptoeconomy. Institutions incur lower fees per transaction than consumers and, as a result, the impact of changes in consumer Trading Volume on transaction revenue is more pronounced than the impact of changes in institutional Trading Volume.\nGenerally, Trading Volume on our platform is primarily influenced by overall market dynamics, namely the price of crypto assets, crypto asset volatility, and macroeconomic conditions, and by our share of total crypto market spot trading volume. In periods of high crypto asset prices and crypto asset volatility, we have generally experienced correspondingly high levels of Trading Volume. In recent quarters, we have also seen market events, product announcements, and competition as influential factors.\nTrading Volume (in billions)\nTotal Trading Volume\nTrading Volume by crypto asset\nXRP\nUSDT\n____________________________________\nIncludes various other crypto assets, none of which\nindividually represented more than 10% of our total Trading Volume.\nFor the three and nine months ended September 30, 2025 as compared to 2024, Trading Volume increased primarily reflecting an increase of 66% and 27% in global crypto market spot trading volume (the USD equivalent value of all matched trades transacted between buyers and sellers across all exchanges), as well as due to increases in our share of this market volume for the crypto assets that comprise the majority of our Trading Volume. These increases were offset in part by a decrease of $39.7 billion and $34.9 billion attributed to a decline in our share of stablecoin pair market volume driven by an intentional pricing change made in March of 2025 as we evolved our stablecoin strategy.\nResults of Operations\n\nIncludes corporate USDC balances and USDC held on behalf of customers in eligible Coinbase products.\na decrease of $79.8 million and $225.6 million due to lower average interest rates, which declined 93 and 95 basis points;\nincreases in blockchain rewards for the three months ended comparative period, driven by higher average crypto asset prices, primarily for Ethereum and Solana; and\nan increase in other subscription and services revenue, primarily due to growth of Coinbase One, reflecting a higher number of paid subscribers.\nThere were no material changes to note within interest and finance fee income.\n(in thousands, except %)\nCorporate interest and other income\nOther revenue changed for the three and nine months ended September 30, 2025 as compared to 2024, "
}