{
  "source_file": "coo-20241031.htm",
  "form_type": "10-K",
  "item1_clean": "CooperSurgical has broad product offerings for fertility evaluations and IVF procedures by OB/GYN professionals, reproductive endocrinologists and embryologists. In fertility clinics, our products include media, micro-tools and lab equipment. Additionally, CooperSurgical offers services to clinics and families undergoing assisted reproductive technologies including donor gametes, cryostorage, and genomic services.\nMarket for Fertility and Women's Health Care\nCooperSurgical participates in the market for women's and family health care with its diversified product lines at various points of health care delivery: OB/GYN medical offices, hospitals and surgery centers, and fertility clinics. CooperSurgical’s business also includes cryostorage services for gametes, cord blood and cord tissue.\nCooperSurgical expects that OB/GYN medical offices and fertility clinics will continue to move away from private practice ownership and toward group practices, private equity, corporate or other ownership. As the consolidation trend continues it will have increased influence over supply chain control, group purchases, value analysis committees, product evaluation and procurement. We believe CooperSurgical's broad product portfolio can benefit in this changing environment as customers look to standardize and consolidate vendors.\nTrends specific in the OB/GYN market include:\nThe increase in office-based and outpatient procedures, given increased access to care, high patient satisfaction, reduction of healthcare costs and comparative clinical outcomes.\nA focus on reducing pregnancy and childbirth complications.\nThe obstetrician being a key contributor to stem cell storage, facilitating the collection of cord blood and cord tissue following delivery in most markets.\nInitial evaluation and treatments for infertility, such as uterine assessment, ovulatory medications and intrauterine insemination (IUI), beginning with the OB/GYN and then transitioning to fertility clinics.\nTrends specific in the fertility market include:\nInfertility rates are increasing globally, and there is a significant unmet need for fertility products and services.\nThe maternal age is increasing.\nPatient awareness of, and access to, services is increasing.\nThe number of fertility clinics is rising worldwide.\nTHE COOPER COMPANIES, INC. AND SUBSIDIARIES\nSingle parents by choice and LGBTQIA+ individuals are starting families.\nImproved product offerings such as donor activity and cryopreservation services are becoming available.\nTechnology improvements are being developed for both male and female infertility challenges.\nWorldwide disposable income is increasing.\nCOMPETITION\nThe markets in which we participate are highly competitive and involve the continual search for technological and scientific innovations. Competitive factors in these markets include technological and scientific advances, product quality and availability, price, customer service including response time and effective communication of product information to clinicians and consumers, and manufacturing processes. Competitors may have greater financial resources, larger research and development budgets, larger sales forces, greater market penetration and/or larger manufacturing capacity. Both CooperVision and CooperSurgical compete predominantly on the basis of product quality and differentiation, technological benefits, price, service levels and reliability.\nCooperVision Competition\nCooperVision's largest competitors in the worldwide market and its primary competitors in the spherical, toric and multifocal lens categories of that market are Johnson & Johnson Vision Care, Inc., Alcon Inc. and Bausch + Lomb. To a lesser extent, CooperVision also competes with manufacturers of eyeglasses and providers of other forms of vision correction including ophthalmic surgery. We believe that in order to compete successfully in the numerous categories of the contact lens market, companies must offer differentiated products that are priced competitively and manufactured efficiently. CooperVision competes in its markets by producing high, medium and low-volume lenses made with a variety of materials for a broader range of market niches, as well as offering a wide range of lens parameters, leading to a higher rate of successful fitting for practitioners and better visual acuity for patients. Our ability to compete successfully with a full range of silicone hydrogel products is an important factor to achieving success in our business. We also compete based on our customer and professional services.\nCooperSurgical Competition\nCooperSurgical focuses on selected segments of the fertility and women's health care market with a diversified portfolio including fertility products and services, medical devices, cryostorage (such as cord blood and cord tissue storage) and contraception. CooperSurgical's strategy includes developing and acquiring new solutions to complement our current offerings. In the fertility market, CooperSurgical competes against Vitrolife Group, FujiFilm-Irvine Scientific, Hamilton Thorne, and Fairfax Cryobank and Fairfax EggBank. We also compete with fertility clinics offering their own services. Larger companies such as Johnson & Johnson, Medtronic and Hologic have offerings that compete with our medical device products. In the stem cell storage field, we compete primarily with ViaCord, a division of Revvity, in the United States, as well as other smaller companies globally. With Paragard, we compete with manufacturers of hormonal IUDs including Bayer and AbbVie, Long Acting Reversible Contraceptives including Organon, and other forms of birth control. We are aware of a non-hormonal IUD under development, which may compete with Paragard in the future. Further, the continued consolidation of medical offices and fertility clinics may impact the competition for our products and services.\nRESEARCH AND DEVELOPMENT\nThe Company employs approximately 400 people in research and development. CooperVision's product development and clinical research is supported by internal and external specialists in lens design, formulation science, polymer chemistry, engineering, clinical trials, microbiology and biochemistry. CooperVision's research and development activities primarily include programs to develop new contact lens designs, myopia management, and manufacturing technologies, along with improving formulations and existing products.\nCooperSurgical conducts research and development in-house, and works with external specialists when necessary, in mechanical, electrical, biomedical and software engineering, as well as life sciences. CooperSurgical research and development activities are focused on innovating, improving, and advancing our products and services including, instruments, devices, consumables, digital services, and manufacturing technologies.\nGOVERNMENT REGULATION\nTHE COOPER COMPANIES, INC. AND SUBSIDIARIES\nOur products are subject to extensive regulation by the FDA in the United States and a variety of regulatory agencies in other countries. The process of obtaining regulatory approvals and the subsequent compliance with applicable federal, state, local and foreign statutes and regulations requires the expenditure of substantial time and financial resources. These regulations govern, among other things, the design and development, testing, manufacturing, labeling, storage, record keeping, premarket clearance, approval or certification, post-market vigilance reporting, advertising and promotion, and sales and distribution of medical devices and pharmaceutical products. Failure to comply with the applicable regulations, which are subject to established and new legislation and change, could result in enforcement action by the FDA, or other U.S. or foreign government agencies which may include, among other things, any of the following consequences: warning letters, civil penalties, refusal or withdrawal of approvals or certifications, license suspension or revocation, product recalls, operating restrictions, suspension or shutdown of production, and criminal prosecution.\nRegulation in the United States\nMost of our products are medical devices, which must comply with the Federal Food, Drug and Cosmetic Act (FDCA) and the regulations promulgated by the FDA thereunder. The FDA classifies medical devices into one of three classes—Class I, II or III—depending on the degree of risk associated with each medical device and the extent of control needed to ensure the medical device's safety and effectiveness. Both CooperVision and CooperSurgical develop and market medical devices subject to different levels of FDA regulation depending on the classification and risk profile of the device. Class III devices, such as extended wear contact lenses, require extensive premarket testing and approval, while Class I and II devices require lower levels of regulation. The majority of CooperSurgical's products are Class II devices. Unless an exemption applies, each medical device we wish to distribute commercially in the United States will require either premarket notification to the FDA requesting clearance for commercial distribution under Section 510(k) of the FDCA, a premarket approval (PMA) from the FDA, or a de novo classification and request for marketing authorization submitted to and granted by the FDA.\nIf we are required to obtain a 510(k) clearance for a device that we wish to market, we must submit a premarket notification to the FDA demonstrating that the device is substantially equivalent to a device commercially distributed in the United States before May 28, 1976 (a pre-amendments device), or to a device that was found to be substantially equivalent to a pre-amendments device. If the FDA agrees that the device is substantially equivalent, it will grant 510(k) clearance to commercially market the device. If the FDA determines that the device is not substantially equivalent to a legally marketed device, the FDA automatically designates the device as a Class III device. The sponsor of a device automatically designated as Class III must either fulfill more rigorous PMA requirements or request a risk-based classification determination for the device in accordance with the de novo process. The de novo process is a pathway to market for novel medical devices that are low to moderate risk and are not substantially equivalent to a predicate device.\nA PMA application must be submitted if the device cannot be cleared through the 510(k) premarket notification procedures, or if the device has been previously classified as Class III. The PMA process is much more demanding than the 510(k) premarket notification process. A PMA application must be supported by extensive data including, but not limited to, technical, pre-clinical, clinical trials, manufacturing and labeling to demonstrate to the FDA's satisfaction the safety and effectiveness of the device for its intended use. Prior to commencing human clinical trials, submission of an application for an investigational device exemption (IDE) and receipt of IDE approval from the FDA is required if the device under evaluation presents a significant risk to human health. The process of gathering supporting information leading up to PMA application, and the subsequent FDA review, can take several years.\nA majority of the medical devices we currently market have received FDA clearance through the 510(k) process or approval through the PMA process. Because we cannot be assured that any new products we develop, or any product enhancements, will be exempt from the premarket clearance or approval requirements, or will be subject to the shorter 510(k) clearance process rather than the PMA process, significant delays in the introduction of any new products or product enhancements may occur.\nAfter a device is placed on the market, numerous regulatory requirements apply. These include: establishment registration and device listing with the FDA; the FDA's Q",
  "item7_clean": "Management's Discussion and Analysis of Financial Condition and Results of Operations.\nNote numbers refer to “Notes to Consolidated Financial Statements” in Item 8. Financial Statements and Supplementary Data.\nResults of Operations\nWithin the tables presented, percentages are calculated based on the underlying whole-dollar amounts and, therefore, may not recalculate exactly from the rounded numbers used for disclosure purposes.\nWe are optimistic about the long-term prospects for the worldwide contact lens and general health care markets, and the resilience of and growth prospects for our businesses and products. However, we face significant risks and uncertainties in our global operating environment as further described in the “Risk Factors” section in Part I, Item 1A of this filing. These risks include uncertain global and regional business, political and economic conditions, including but not limited to those associated with man-made or natural disasters, pandemic conditions, inflation, foreign exchange rate fluctuations, regulatory developments, supply chain disruptions, and escalating global trade barriers. These risks and uncertainties have adversely affected our sales, cash flow and performance in the past and could further adversely affect our future sales, cash flow and performance.\n- We compete in the worldwide contact lens market with our spherical, toric, multifocal and toric multifocal contact lenses offered in materials like silicone hydrogel Aquaform technology. We believe that there will be lower contact lens wearer dropout rates as technology improves and enhances the wearing experience through a combination of improved designs and materials and the growth of preferred modalities such as single-use and monthly wearing options. CooperVision also competes in the myopia management and specialty eye care contact lens markets with myopia management contact lenses using its ActivControl technology and with products such as orthokeratology (ortho-k) and scleral lenses. CooperVision has FDA approval for its MiSight 1 day lens, which is the first and only FDA-approved product indicated to slow the progression of myopia in children with treatment initiated between the ages of 8-12. Further, CooperVision has Chinese NMPA approval for its MiSight 1 day lens for use in China. CooperVision is focused on greater worldwide market penetration using recently introduced products, and we continue to expand our presence in existing and emerging markets, including through acquisitions.\nOur ability to compete successfully with a full range of silicone hydrogel products is an important factor to achieving our desired future levels of sales growth and profitability. CooperVision manufactures and markets a wide variety of silicone hydrogel contact lenses. Our single-use silicone hydrogel product franchises, clariti, MyDay and MyDay Energys remain a focus as we expect increasing demand for these products, as well as future single-use products, as the global contact lens market continues to shift to this modality. Outside of single-use, the Biofinity and Avaira Vitality product families comprise our focus in the FRP, or frequent replacement product, market which encompasses the monthly and two-week modalities. Included in this segment are unique products such as Biofinity Energys, which helps individuals with digital eye fatigue.\nOur CooperSurgical business competes in the fertility and women's health care market through its diversified portfolio of products and services, including fertility products and services, medical devices, cryostorage (such as cord blood and cord tissue storage) and contraception. CooperSurgical has established its market presence and distribution system by developing products and acquiring companies, products and services that complement its business model.\nCompetitive factors in the segments in which CooperSurgical competes include technological and scientific advances, product quality and availability, price and customer service (including response time and effective communication of product information to physicians, consumers, fertility clinics and hospitals).\nTHE COOPER COMPANIES, INC. AND SUBSIDIARIES\nManagement’s Discussion and Analysis of Financial Condition and Results of Operations\nCooperVision Net Sales\nThe contact lens market has two major product categories:\nToric and multifocal lenses including lenses that, in addition to correcting near- and farsightedness, address more complex visual defects such as astigmatism and presbyopia by adding optical properties of cylinder and axis, which correct for irregularities in the shape of the cornea; and\nSpherical lenses, including lenses that correct near- and farsightedness uncomplicated by more complex visual defects, myopia management lenses, which slow the progression of and correct myopia in age-appropriate children, and other specialty lenses.\nCooperVision Net Sales by Category\nTHE COOPER COMPANIES, INC. AND SUBSIDIARIES\nManagement’s Discussion and Analysis of Financial Condition and Results of Operations\n2024 vs 2023 % Change\nToric and multifocal\nIn the fiscal year ended October 31, 2024, the growth experienced across all categories was partially offset by unfavorable foreign exchange rate fluctuations, which approximated $14.6 million.\nToric and multifocal grew primarily through the success of MyDay and Biofinity.\nSphere, other grew primarily through MyDay, MiSight and Biofinity.\n\"Other\" products represented approximately 1% of net sales in fiscal 2024 and 2023.\nCooperVision Net Sales by Geography\nCooperVision competes in the worldwide soft contact lens market and services in three primary regions: the Americas, EMEA and Asia Pacific.\n2024 vs. 2023 % Change\nEMEA\nCooperVision's growth in net sales across all regions was primarily attributable to increased sales of silicone hydrogel contact lenses. Refer to CooperVision Net Sales by Category above for further discussion.\nCooperSurgical Net Sales\nCooperSurgical supplies the fertility and women's health care market with a diversified portfolio of products and services in two categories:\nOffice and surgical offerings include products that facilitate surgical and non-surgical procedures that are commonly performed primarily by obstetricians and gynecologists in hospitals, surgery centers, and medical offices. This includes medical devices, cryostorage (such as cord blood and cord tissue storage), and contraception.\nFertility offerings include highly specialized products and services that target the IVF process, including diagnostics testing with a goal to make fertility treatment safer, more efficient and convenient. This includes fertility consumables and equipment, donor gamete services, and genomic services (including genetic testing).\nTHE COOPER COMPANIES, INC. AND SUBSIDIARIES\nManagement’s Discussion and Analysis of Financial Condition and Results of Operations\nCooperSurgical Net Sales by Category\n2024 vs. 2023 % Change\nIn the fiscal year ended October 31, 2024, office and surgical net sales increased primarily due to the addition of Cook Medical on November 1, 2023. Fertility net sales increased due to an increase in revenue from consumable products and genetic testing.\nThe above growth experienced across all categories was partially offset by unfavorable foreign exchange rate fluctuations, which approximated $9.5 million.\nConsolidated gross margin was relatively flat at 67% in fiscal 2024 compared to 66% in fiscal\nSelling, General and Administrative (SGA) Expenses\n2024 vs. 2023 % Change\nCooperVision's SGA expenses increased in fiscal 2024 compared to fiscal 2023 primarily due to a $31.8 million release of contingent consideration liability associated with SightGlass Vision's regulatory approval milestone in fiscal 2023 and increased selling activities in fiscal 2024.\nTHE COOPER COMPANIES, INC. AND SUBSIDIARIES\nManagement’s Discussion and Analysis of Financial Condition and Results of Operations\nCooperSurgical's SGA expenses decreased in fiscal 2024 compared to fiscal 2023 primarily due to the payment of a $45.0 million termination fee under an asset purchase agreement related to Cook Medical’s reproductive health business in fiscal 2023, partially offset by an increase in selling activities and distribution costs.\nexpenses increased in fiscal 2024 compared to fiscal 2023 primarily due to share-based compensation related expenses and corporate support functions.\nResearch and Development (R&D) Expenses\n2024 vs. 2023 % Change\nerVision's R&D expenses increased in fiscal 2024 compared to fiscal 2023 primarily due to myopia management programs and R&D projects. CooperVision's R&D activities are primarily focused on the development of contact lenses, manufacturing technology and process enhancements.\nCooperSurgical's R&D expenses increased in fiscal 2024 compared to fiscal 2023 mainly due to an increase in R&D project spend. CooperSurgical's R&D activities are focused on developing and refining diagnostic and therapeutic products including medical interventions, surgical devices and fertility solutions.\nAmortization Expense\n2024 vs. 2023 % Change\nCooperVision's amortization expense for fiscal 2024 comp\ndecreased primarily due to more intangible assets becoming fully amortized during fiscal 2024.\nCooperSurgical's amortization expense increased in fiscal 2024 compared to fiscal 2023, primarily due to the amortization of intangible assets recently acquired through acquisitions.\n2024 vs. 2023 % Change\nCooperVision's operating income increased in fiscal 2024 compared to fiscal 2023, primarily due to the increase in net sales outpaced the increase in operating expenses.\nCooperSurgical's operating income increased in fiscal 2024 compared to fiscal 2023, primarily due to payment of a $45.0 million termination fee under an asset purchase agreement related to Cook Medical’s reproductive health business in fiscal 2023 and decrease in advertising and marketing expenses in fiscal 2024.\nTHE COOPER COMPANIES, INC. AND SUBSIDIARIES\nManagement’s Discussion and Analysis of Financial Condition and Results of Operations\nCorporate operating loss increased in fiscal 2024 compared to fiscal 2023, primarily due to higher share-based compensation expenses.\n2024 vs. 2023 % Change\nInterest expense increased during fiscal 2024 compared to the prior year, primarily due to higher interest rates and higher debt balances.\nForeign exchange loss\nForeign exchange loss was primarily associated with the relative weakening of the U.S. dollar against foreign currencies and the effect on intercompany receivables.\nOther expense, net decreased in fiscal 2024, primarily due to a decrease in loss on minority investments.\nProvision for Income Taxes\nThe effective tax rates for fiscal 2024 and 2023 were 32.6% and 28.7%, respectively. The increase was primarily due to changes in the geographic composition of pre-tax earnings and an increase in the UK statutory tax rate from 19% to 25%.\nThe effective tax rate for fiscal 2024 was higher than the U.S. federal statutory rate primarily due to foreign earnings subject to U.S. tax and foreign earnings in jurisdictions with higher tax rates. The effective tax rate for fiscal 2023 was higher than the U.S. federal statutory rate primarily due to foreign earnings subject to U.S. tax.\nSee Note 6. Income Taxes for further information.\nTHE COOPER COMPANIES, INC. AND SUBSIDIARIES\nManagement’s Discussion and Analysis of Financial Condition and Results of Operations\nCAPITAL RESOURCES AND LIQUIDITY\nWorking capital at October 31, 2024, and October 31, 2023, was $928.7 million and $735.9 million, respectively. The increase in working capital was primarily due to increases in trade accounts receivable, prepaid expenses and other current assets, and inventories, partially offset by an increase in other current liabilities.\nOperating activities\nInvesting activities\nFinancing activities\nEffect of exchange rate changes on cash, cash equivalents, restricted\ncash and restricted cash equivalents\nNet decrease in cash, cash equivalents, restricted cash and\nrestricted cash equivalents\nCash provided by operating activities in fiscal 2024 increased compared to fiscal 2023, primarily due to increases in net income, and non-cash add backs such as deferred income taxes and share-based compensation expenses in fiscal 2024 and the release of $31.8 million contingent consideration liability associated with SightGlass Vision's regulatory approval milestone in fiscal 2023, offset by net changes in operating capital.\nCash used in investing activities in fiscal 2024 increased compared to cash used in investing activities in fiscal 2023, primarily attributable to $343.4 million cash paid for acquisitions in fiscal 2024.\nCash provided by financing activities in fiscal 2024 was primarily attributable to funds received from the 2024 Revolving Credit Facility, partially offset by repayments to fully repay all borrowings outstanding under the 2020 Term Loan Facility and the 2020 Revolving Credit Facility. See Note 5. Financing Arrangements for further information.\nCash used in financing activities in fiscal 2023 was primarily due to repayments of $338.0 million on the 2021 364-day term loan, partially offset by $172.6 million of funds drawn on the 2020 Revolving Credit Facility.\nThe following is a summary of the maximum commitments and the net amounts available to us under different credit facilities as of October 31, 2024:\nOutstanding Borrowings\nOutstanding Letters of Credit\nTotal Amount Available\n2024 Revolving Credit\nAs of October 31, 2024, the Company was in compliance with all debt covenants. On May 1, 2024, the Company entered into a Revolving Credit Agreement. The Company drew on the 2024 Credit Agreement to fully repay borrowings outstanding under the 2020 Term Loan and 2020 Revolving Credit Facility and terminated the 2020 Credit Agreement. See Note 5. Financing Arrangements for further information.\nConsidering recent market conditions, we have re-evaluated our operating cash flows and cash requirements and continue to believe that current cash, cash equivalents, future cash flow from operating activities and cash available under our 2024 Credit Agreement will be sufficient to meet our anticipated cash needs, including working capital needs, capital expenditures and contractual obligations for at least 12 months from the issuance date of the Consolidated Financial Statements included in this annual report. To the extent additional funds are necessary to meet our liquidity needs such as\nTHE COOPER COMPANIES, INC. AND SUBSIDIARIES\nManagement’s Discussion and Analysis of Financial Condition and Results of Operations\nfor acquisitions, share repurchases or other activities as we execute our business strategy, we anticipate that additional funds could be obtained through the incurrence of additional indebtedness, additional equity financings or a combination of these potential sources of funds; however, such financing may not be available on favorable terms, or at all.\nIn March 2017, the authorization under the 2012 Share Repurchase Program (2012 Program) was increased to $1.0 billion by the Company's Board of Directors. As of October 31, 2024, $256.4 million remained authorized for repurchase under the program. See Note 8. Stockholders’ Equity for additional information. In fiscal 2024, there were no share repurchases under the 2012 Program.\nIn December 2023, the Company's Board of Directors decided to end the declaration of the semiannual dividend.\nOn February 16, 2024, the Company effected a four-for-one stock split of its outstanding shares of common stock. All share and per share information has been retroactively adjusted to reflect the stock split for all periods presented. The par value of the common stock remains $0.10 per share.\nContractual Obligations\n\nManagement estimates and judgments are an integral part of financial statements prepared in accordance with GAAP. We consider an accounting estimate critic",
  "item2_clean": null
}