{
  "source_file": "coo-20250731.htm",
  "form_type": "10-Q",
  "item1_clean": null,
  "item7_clean": null,
  "item2_clean": "Item 2. Management’s Discussion and Analysis of Financial Condition\nand Results of Operations\nNote numbers refer to “Notes to Consolidated Condensed Financial Statements” in Item 1. Unaudited Financial Statements.\nForward-Looking Statements\nAdverse changes in the global or regional general business, political and economic conditions, including the impact of continuing uncertainty and instability of certain countries, man-made or natural disasters and pandemic conditions, that could adversely affect our global markets, and the potential adverse economic impact and related uncertainty caused by these items.\nThe impact of international conflicts and the global response to international conflicts on the global and local economy, financial markets, energy markets, currency rates and our ability to supply product to, or through, affected countries.\nOur substantial and expanding international operations and the challenges of managing an organization spread throughout multiple countries and complying with a variety of legal, compliance and regulatory requirements.\nThe actual imposition or threats of tariffs, customs duties and fees by the U.S. government and other nations in response and other retaliatory actions, such as trade protection measures, import or export licensing requirements, new or different customs duties, trade embargoes and sanctions and other trade barriers, as well as the impact of the Company’s efforts to mitigate the effects of such tariffs or similar measures.\nForeign currency exchange rate and interest rate fluctuations including the risk of fluctuations in the value of foreign currencies or interest rates that would decrease our net sales and earnings.\nOur existing and future variable rate indebtedness and associated interest expense is impacted by rate increases, which could adversely affect our financial health or limit our ability to borrow additional funds.\nChanges in tax laws, examinations by tax authorities, and changes in our geographic composition of income.\nAcquisition-related adverse effects including the failure to successfully achieve the anticipated net sales, margins and earnings benefits of acquisitions, integration delays or costs and the requirement to record significant adjustments to the preliminary fair value of assets acquired and liabilities assumed within the measurement period, required regulatory approvals for an acquisition not being obtained or being delayed or subject to conditions that are not anticipated, adverse impacts of changes to accounting controls and reporting procedures, contingent liabilities or indemnification obligations, increased leverage and lack of access to available financing (including financing for the acquisition or refinancing of debt owed by us on a timely basis and on reasonable terms).\nCompliance costs and potential liability in connection with U.S. and foreign laws and health care regulations pertaining to privacy and security of personal information, such as the Health Insurance Portability and Accountability Act of 1996 (HIPAA) and the California Consumer Privacy Act (CCPA) in the U.S. and the General Data Protection Regulation (GDPR) requirements in Europe, including but not limited to those resulting from data security breaches.\nA major disruption in the operations of our manufacturing, accounting and financial reporting, research and development, distribution facilities or raw material supply chain due to challenges associated with integration of acquisitions, man-made or natural disasters, pandemic conditions, cybersecurity incidents or other causes.\nA major disruption in the operations of our manufacturing, accounting and financial reporting, research and development or distribution facilities due to the failure to perform by third-party vendors, including cloud computing providers or other technological problems, including any related to our information systems maintenance, enhancements or new system deployments, integrations or upgrades.\nA successful cybersecurity attack which could interrupt or disrupt our information technology systems, or those of our third-party service providers, or cause the loss of confidential or protected data.\nTHE COOPER COMPANIES, INC. AND SUBSIDIARIES\nItem 2. Management’s Discussion and Analysis of Financial Condition\nand Results of Operations\nMarket consolidation of large customers globally through mergers or acquisitions resulting in a larger proportion or concentration of our business being derived from fewer customers.\nDisruptions in supplies of raw materials, particularly components used to manufacture our silicone hydrogel lenses.\nNew U.S. and foreign government laws and regulations, and changes in existing laws, regulations and enforcement guidance, which affect areas of our operations including, but not limited to, those affecting the health care industry, including the contact lens industry specifically and the medical device or pharmaceutical industries generally, including but not limited to the EU Medical Devices Regulation (MDR) and the EU In Vitro Diagnostic Medical Devices Regulation (IVDR).\nLegal costs, insurance expenses, settlement costs and the risk of an adverse decision, prohibitive injunction or settlement related to product liability, patent infringement, contractual disputes, or other litigation.\nLimitations on sales following product introductions due to poor market acceptance.\nNew competitors, product innovations or technologies, including but not limited to, technological advances by competitors, new products and patents attained by competitors, and competitors' expansion through acquisitions.\nReduced sales, loss of customers, reputational harm and costs and expenses, including from claims and litigation related to product recalls and warning letters.\nFailure to receive, or delays in receiving, regulatory approvals or certifications for products.\nFailure of our customers and end users to obtain adequate coverage and reimbursement from third-party payers for our products and services.\nThe requirement to provide for a significant liability or to write off, or accelerate depreciation on, a significant asset, including goodwill, other intangible assets and idle manufacturing facilities and equipment.\nThe success of our research and development activities and other start-up projects.\nDilution to earnings per share from acquisitions or issuing stock.\nImpact and costs incurred from changes in accounting standards and policies.\nRisks related to environmental laws and requirements applicable to our facilities, products or manufacturing processes, including evolving regulations regarding the use of hazardous substances or chemicals in our products.\nRisks related to environmental, social and corporate governance (ESG) issues, including those related to regulatory and disclosure requirements, climate change and sustainability.\nWe caution investors that forward-looking statements reflect our analysis only on their stated date. We disclaim any intent to update them except as required by law.\nTHE COOPER COMPANIES, INC. AND SUBSIDIARIES\nItem 2. Management’s Discussion and Analysis of Financial Condition\nand Results of Operations\nResults of Operations\nIn this section, we discuss the results of our operations for the third quarter of fiscal 2025 ended July 31, 2025, compared with the same period of fiscal 2024. We discuss our cash flows and current financial condition under “Capital Resources and Liquidity.” Within the tables presented, percentages are calculated based on the underlying whole-dollar amounts and, therefore, may not recalculate exactly from the rounded numbers used for disclosure purposes.\nWe are optimistic about the long-term prospects for the worldwide contact lens and general health care markets, and the resilience of and growth prospects for our businesses and products. However, we face significant risks and uncertainties in our global operating environment as further described in the Part II, Item 1A \"Risk Factors\" herein. These risks include uncertain global and regional business, political and economic conditions, including but not limited to those associated with man-made or natural disasters, pandemic conditions, inflation, foreign exchange rate fluctuations, regulatory developments, supply chain disruptions, and escalating global trade barriers and disruptions, such as the impact of tariffs. These risks and uncertainties have adversely affected our sales, cash flow and performance in the past and could further adversely affect our future sales, cash flow and performance.\n- We compete in the worldwide contact lens market with our spherical, toric, multifocal, and toric multifocal contact lenses offered in materials like silicone hydrogel Aquaform technology. We believe that there will be lower contact lens wearer dropout rates as technology improves and enhances the wearing experience through a combination of improved designs and materials and the growth of preferred modalities such as single-use and monthly wearing options. CooperVision also competes in the myopia management and specialty eye care contact lens markets with myopia management contact lenses using its ActivControl technology and with products such as orthokeratology (ortho-k) and scleral lenses. CooperVision has U.S. Food and Drug Administration (FDA) approval for its MiSight 1 day lens, which is the first and only FDA-approved product indicated to slow the progression of myopia in children with treatment initiated between the ages of 8-12. Further, CooperVision has Chinese National Medical Products Administration (NMPA) approval for its MiSight 1 day lens for use in China. CooperVision is focused on greater worldwide market penetration using recently introduced products, and we continue to expand our presence in existing and emerging markets, including through acquisitions.\nOur ability to compete successfully with a full range of silicone hydrogel products is an important factor to achieving our desired"
}