{
  "source_file": "cop-20250930.htm",
  "form_type": "10-Q",
  "item1_clean": null,
  "item7_clean": null,
  "item2_clean": "2025 production increased by 83 MBOED or four percent from the same period a year ago.\nThird-quarter 2025 production resulted in $5.9 billion of cash provided by operating activities. We returned over $2.2 billion to shareholders, consisting of $1.3 billion through share repurchases and $1.0 billion through our ordinary dividend. We ended the quarter with cash, cash equivalents, restricted cash and short-term investments totaling $6.6 billion and long-term investments in debt securities of $1.1 billion.\nAlso in the third quarter of 2025, we re-invested $2.9 billion into the business in the form of capital expenditures and investments, with over half of the expenditures related to flexible, short-cycle unconventional plays in the Lower 48 segment, where our production has access to both domestic and export markets.\nConocoPhillips 2025 Q3 10-Q\nManagement’s Discussion and Analysis\nBusiness Environment\nCommodity prices are the most significant factor impacting our profitability and related returns on and of capital to our shareholders. Dynamics that could influence world energy markets and commodity prices include, but are not limited to, global economic health, supply or demand disruptions or fears thereof caused by civil unrest, global pandemics, military conflicts, actions taken by OPEC Plus and other major oil producing countries, environmental laws, tariffs, governmental policies and weather-related disruptions. Our strategy is to create value through price cycles by delivering on the financial, operational and ESG priorities that underpin our value proposition.\nOur earnings and operating cash flows generally correlate with price levels for crude oil and natural gas, which are subject to factors external to the company and over which we have no control. The following graph depicts the trend in average benchmark prices for WTI crude oil, Brent crude oil and U.S. Henry Hub natural gas:\nBrent crude oil prices averaged $69.07 per barrel in the third quarter of 2025, a decrease of 14 percent compared with $80.18 per barrel in the third quarter of 2024. WTI at Cushing crude oil prices averaged $64.93 per barrel in the third quarter of 2025, a decrease of 14 percent compared with $75.10 per barrel in the third quarter of 2024. Oil prices were lower in the third quarter of 2025 as global oil supplies increased faster than global oil demand.\nU.S. Henry Hub natural gas prices averaged $3.07 per MMBTU in the third quarter of 2025, an increase of 43 percent compared with $2.15 per MMBTU in the third quarter of 2024. U.S. Henry Hub prices improved due to stronger demand and lower inventory levels versus the same time last year. We expect a risk of volatility in regional markers to remain throughout 2025.\nOur realized bitumen price averaged $41.58 per barrel in the third quarter of 2025, a decrease of 12 percent compared with $47.32 per barrel in the third quarter of 2024. The decrease in the third quarter of 2025 was driven by falling WTI prices due to concerns over a slowdown in global trade and OPEC Plus increasing production targets, partly offset by strengthened WCS differentials due to additional egress capacity at the Trans Mountain Pipeline Expansion.\nFor the third quarter of 2025, our total average realized price was $46.44 per BOE, a decrease of 14 percent compared with $54.18 per BOE in the third quarter of 2024.\nConocoPhillips 2025 Q3 10-Q\nManagement’s Discussion and Analysis\nKey Operating and Financial Summary\nReported third-quarter 2025 earnings per share of $1.38;\nGenerated cash provided by operating activities of $5.9 billion;\nRaised ordinary dividend by 8% to $0.84 per share;\nDelivered total company and Lower 48 production of 2,399 MBOED and 1,528 MBOED, respectively;\nExceeded $3 billion in dispositions in 2025 and on track to meet $5 billion disposition target by year-end 2026;\nAdvanced commercial LNG strategy by signing 20-year sales and purchase agreements at PALNG Phase 2 and Rio Grande LNG Train 5, expected to commence in 2030 and 2031, respectively;\nDistributed over $2.2 billion to shareholders, including $1.3 billion through share repurchases and $1.0 billion through the ordinary dividend; and\nEnded the quarter with cash, cash equivalents, restricted cash and short-term investments of $6.6 billion and long-term investments of $1.1 billion.\nFourth-quarter 2025 production is expected to be 2.30 to 2.34 MMBOED.\nFull-year production guidance has been raised to 2.375 MMBOED, compared to prior guidance of 2.35 to 2.37 MMBOED.\nAll other guidance remains unchanged. Guidance includes the impact from closed dispositions.\nConocoPhillips 2025 Q3 10-Q\nResults of Operations\nResults of Operations\nUnless otherwise indicated, discussion of consolidated results for the three- and nine-month periods ended September 30, 2025, is based on a comparison with the corresponding period of 2024.\nConsolidated Results\nSummary Operating Statistics\nAverage Net Production\nConsolidated operations\n\nWe are subject to legal proceedings, claims and liabilities that arise in the ordinary course of business. We accrue for losses associated with legal claims when such losses are considered probable and the amounts can be reasonably estimated.\nConocoPhillips 2025 Q3 10-Q\nCapital Resources and Liquidity\nLegal and Tax Matters\nWe are subject to various lawsuits and claims, including, but not limited to, matters involving oil and gas royalty and severance tax payments, gas measurement and valuation methods, contract disputes, environmental damages, climate change, personal injury and property damage. Our primary exposures for such matters relate to alleged royalty and tax underpayments on certain federal, state and privately owned properties, claims of alleged environmental contamination and damages from historic operations and climate change. We will continue to defend ourselves vigorously in these matters.\nOur legal organization applies its knowledge, experience and professional judgment to the specific characteristics of our cases, employing a litigation management process to manage and monitor the legal proceedings against us. Our process facilitates the early evaluation and quantification of potential exposures in individual cases. This process also enables us to track those cases that have been scheduled for trial and/or mediation. Based on professional judgment and experience in using these litigation management tools and available information about current developments in all our cases, our legal organization regularly assesses the adequacy of current accruals and determines if adjustment of existing accruals, or establishment of new accruals, is required.\nWe are subject to the same numerous international, federal, state and local environmental laws and regulations as other companies in our industry. We occasionally receive requests for information or notices of potential liability from the U.S. EPA and state environmental agencies alleging that we are a potentially responsible party under the CERCLA or an equivalent state statute. On occasion, we also have been made a party to cost recovery litigation by those agencies or by private parties. These requests, notices and lawsuits assert potential liability for remediation costs at various sites that typically are not owned by us, but allegedly contain waste attributable to our past operations. As of September 30, 2025, there were 16 sites around the U.S. in which we were identified as a potentially responsible party under CERCLA and comparable state laws. For remediation activities in the U.S. and Canada, our consolidated balance sheet included total accrued environmental costs of $210 million at September 30, 2025, compared with $206 million at December 31, 2024. We expect to incur a substantial amount of these expenditures within the next 30 years.\nNotwithstanding any of the foregoing, and as with other companies engaged in similar businesses, environmental costs and liabilities are inherent concerns in our operations and products, and there can be no assurance that material costs and liabilities will not be incurred. However, we currently do not expect any material adverse effect upon our results of operations or financial position as a result of compliance with current environmental laws and regulations.\nContinuing political and social attention to the issue of global climate change has resulted in a broad range of proposed or promulgated state, national and international laws focusing on GHG emissions reduction. These laws apply or could apply in countries where we have interests or may have interests in the future. Laws in this field continue to evolve and while it is not possible to accurately estimate either a timetable for implementation or our future compliance costs relating to implementation, such laws, if enacted, could have a material impact on our results of operations and financial condition.\nCompany Response to Climate-Related Risks\nThe objective of our Climate Risk Strategy is to manage climate-related risk, optimize opportunities and equip the company to respond to changes in key uncertainties, including government policies around the world, emissions reduction technologies, alternative energy technologies and changes in consumer trends. The strategy guides our choices around portfolio composition, emissions reductions, targets, incentives, emissions-related technology development, and our climate-related policy and finance sector engagement.\nOur Climate Risk Strategy is intended to enable us to responsibly meet the global demand for energy, deliver competitive returns on and of capital and work to meet our operational emissions-reduction targets. First, meeting global energy demand requires a focus on delivering production that will best compete in any energy demand scenario. This production will be delivered from resources with a competitive cost of supply and low GHG intensity, as well as portfolio diversity by market and asset type. Next, our focus is on deliveri"
}