{
  "source_file": "cor-20250930.htm",
  "form_type": "10-K",
  "item1_clean": "The majority of U.S. Healthcare Solutions’ sales force is led nationally, with geographic focus and specialized by either healthcare provider type or size. Customer service representatives are centralized to respond to customer needs in a timely and effective manner. U.S. Healthcare Solutions also has support professionals focused on its various technologies and service offerings. U.S. Healthcare Solutions’ sales teams also serve national account customers through close coordination with local distribution centers and ensure that our customers are receiving service offerings that meet their needs. Our International Healthcare Solutions’ businesses each have independent sales forces that specialize in their respective product and service offerings. In addition, we have an enterprise-wide marketing team that coordinates branding and all other marketing activities across the Company.\nWe have a diverse customer base that includes institutional and retail healthcare providers as well as pharmaceutical manufacturers. Institutional healthcare providers include acute care hospitals, health systems, mail order pharmacies, long-term care and other alternate care pharmacies, providers of pharmacy services to such facilities, physicians, and physician group practices. Retail healthcare providers include national and regional retail drugstore chains, independent community pharmacies, pharmacy departments of supermarkets and mass merchandisers, and veterinarians. We are typically the primary source of supply for our healthcare provider customers. Our manufacturer customers include branded, generic, and biotechnology manufacturers of prescription pharmaceuticals, as well as over-the-counter product and health and beauty aid manufacturers. In addition, we offer a broad range of value-added solutions designed to enhance the operating efficiencies and competitive positions of our customers, thereby allowing them to improve the delivery of healthcare to patients and consumers.\nWe continually seek to strengthen our existing customer relationships and seek new customers to enhance our revenues, results of operations, financial position, and cash flows. Our top 10 customers, including governmental agencies and group purchasing organizations (“GPO”), represented approximately 66% of revenue in fiscal 2025. In fiscal 2025, Walgreens and Boots together accounted for approximately 25% of revenue and Evernorth Health Services accounted for approximately 13% of revenue. The loss of any key customer or GPO relationship could adversely affect future revenue and results of operations. Additionally, from time to time, key contracts may be terminated in accordance with their terms or extended, renewed, or replaced prior to their expiration dates. If those contracts are not renewed, or are extended, renewed, or replaced at less favorable terms, they may negatively impact our revenue, results of operations, financial position, and cash flows.\nWe obtain pharmaceutical and other products from manufacturers, none of which accounted for 10% or more of our purchases in fiscal 2025. The loss of a supplier could adversely affect our business if alternate sources of supply are unavailable since we are committed to be the primary source of pharmaceutical products for a majority of our customers. We believe that our relationships with our suppliers are generally good. The 10 largest suppliers in fiscal 2025 accounted for approximately 57% of our purchases.\nThe U.S. Healthcare Solutions operating segment’s distribution facilities in the U.S. primarily operate under a single enterprise resource planning (“ERP”) system. U.S. Healthcare Solutions’ ERP system provides for, among other things, electronic order entry by customers, invoice preparation and purchasing, and inventory tracking. Our International Healthcare Solutions operating segment operates under various operating systems. We continue to make investments to enhance and\nupgrade the operating systems utilized by our International Healthcare Solutions operating segments, including, but not limited to, Alliance Healthcare. We also continue to invest in cybersecurity capabilities as a key priority to improve and enhance our cyber resiliency.\nAdditionally, we continue to improve our entity-wide infrastructure environment to drive efficiency, capabilities, and speed to market, and we are seeking to use AI to improve our business operations, financial position, and results of operations.\nTo comply with pedigree and other supply chain custody requirements, we have made significant investments in our secure supply chain information systems (see Item 1A. Risk Factors -\nIncreasing governmental efforts to regulate the pharmaceutical supply chain may increase our costs and reduce our profitability)\n. We will continue to invest in advanced information systems and automated warehouse technology.\nU.S. Healthcare Solutions has made significant investments in its electronic ordering systems. U.S. Healthcare Solutions’ systems are intended to strengthen customer relationships by helping customers to reduce operating costs, and by providing them a platform for various basic and value-added services, including product demand data, inventory replenishment, single-source billing, third-party claims processing, real-time price and incentive updates, and price labels.\nU.S. Healthcare Solutions processes a substantial portion of its purchase orders, invoices, and payments electronically, and it continues to make substantial investments to expand its electronic interface with its suppliers. U.S. Healthcare Solutions has warehouse operating systems, which are used to manage the majority of its transactional volume. The warehouse operating systems have improved U.S. Healthcare Solutions’ productivity and operating leverage.\nWe operate in a highly competitive global environment in the distribution of pharmaceuticals and related healthcare services. Our largest competitors are McKesson Corporation (“McKesson”), Cardinal Health, Inc. (“Cardinal”), and UPS Logistics, among others. Our U.S. human health distribution businesses compete with both McKesson and Cardinal, as well as national generic distributors and regional distributors within pharmaceutical distribution. In addition, we compete with manufacturers who sell directly to customers, chain drugstores who manage their own warehousing, specialty distributors, and packaging and healthcare technology companies. Alliance Healthcare, MWI Animal Health, World Courier, and our consulting businesses also face competition from a variety of entities. In all areas, competitive factors include price, product offerings, value-added service programs, service and delivery, credit terms, and customer support.\nIntellectual Property\nWe use a number of trademarks and service marks. All of the principal trademarks and service marks used in the course of our business have been registered in the U.S. and, in some cases, in foreign jurisdictions, or are the subject of pending applications for registration.\nWe have developed or acquired various proprietary products, processes, software, and other intellectual property that are used either to facilitate the conduct of our business or that are made available as products or services to customers. We generally seek to protect such intellectual property through a combination of trade secret, patent and copyright laws, and through confidentiality and other contractually imposed protections.\nWe hold patents and have patent applications pending that relate to certain of our products, particularly our automated pharmacy dispensing equipment, our medication and supply dispensing equipment, certain warehousing equipment, and some of our proprietary packaging solutions. We seek patent protection for our proprietary intellectual property from time to time as appropriate.\nAlthough we believe that our patents or other proprietary products and processes do not infringe upon the intellectual property rights of any third parties, third parties may assert infringement claims against us from time to time.\nHuman Capital Resources\nWe believe our success in the global marketplace depends on our ability to attract and retain a talented and skilled workforce. We aspire to accelerate business results by fostering a dynamic workplace, with the aim of supporting employees to perform at their full potential, contribute to our success, and pursue opportunities for professional development and career advancement.\nAs of September 30, 2025, we had more than 51,000 employees globally, of which approximately 47,000 were full-time employees and approximately 41% were U.S.-based employees.\nAs of September 30, 2025, approximately 24% of our global employees were covered by collective bargaining agreements, nearly all of whom were employees located outside of the U.S.\nInvestment in Team Members and Culture\nWe consider talent attraction, retention, and development opportunities to be key drivers in pursuit of our strategic priorities. We support employee growth and advancement by offering a variety of benefits to eligible employees including:\nLeadership and professional development programs and resources;\nLeadership and executive coaching;\nTuition reimbursement;\nOpportunities to volunteer and participate in mentorship and support programs, such as our employee resource groups, which celebrate the shared backgrounds and experiences of our team members and aim to strengthen our intersecting communities inside and outside of Cencora;\nRecognition opportunities for excellence, such as our True Blue team member recognition program; and\nPersonalized learning and skill-building programs offered through our global learning experience platform.\nOur goal is to provide our team members with pathways for career development, access to programs and benefits that are designed to promote fuller, healthier lives and opportunities to meaningfully participate in their respective communities. Our talent development programs are designed to help provide a supportive and engaging work environment where team members can excel. Additionally, the Cencora Team Assistance Fund exists to help employees who are experiencing extreme financial hardship due to a catastrophic event outside of their control.\nWe are focused on helping our team members create healthier futures for themselves and their families, including by offering competitive and comprehensive compensation and benefits packages tailored to the specific needs of our employee populations in the various countries where we have operations.\nRecognizing the importance of investing in the health and wellness of our team members, our comprehensive benefits packages attempt to address the physical, emotional, financial, and social dimensions of wellness. Our offerings, which vary in the different geographic locations of our workforce, include (i) health and insurance benefits; (ii) paid time off; (iii) flexible work arrangements based on role; (iv) retirement and employee stock purchase plans; (v) paid parental and caregiver leave programs; and (vi) back-up child and elder care. We believe that these programs are important in supporting our team members’ overall well-being and professional growth.\nImportantly, we continue to make meaningful investments in supporting and building our talent and enhancing our culture. We conduct annual, Company-wide surveys to gauge employee satisfaction and identify areas in which we can enhance and improve employee experience. Employee surveys allow employee voices to be heard and are valuable in shaping our Company’s culture.\nWe strive to make our workplaces safe for all team members. In addition to utilizing a peer-to-peer safety program, we regularly convene Company leaders to review and evaluate safety data and issue operational excellence scorecards. Distribution center team members receive training on proper safety procedures and incentive opportunities, with safety performance tracke",
  "item7_clean": "ITEM 7.\nMANAGEMENT’S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS\nOur Management’s Discussion and Analysis of Financial Condition and Results of Operations (“MD&A”) includes the following: an overview that provides a summary of our segments and highlights from fiscal 2025; a more detailed analysis of our results of operations; our capital resources and liquidity, which discusses key aspects of our statements of cash flows, changes in our balance sheets and our financial commitments; and a summary of our critical accounting estimates that involve a significant level of estimation uncertainty. Our MD&A should be read in conjunction with the Consolidated Financial Statements and notes thereto contained herein.\nWe are one of the largest global pharmaceutical sourcing and distribution services companies, helping both healthcare providers and pharmaceutical and biotech manufacturers improve patient access to products and enhance patient care. We deliver innovative programs and services designed to increase the effectiveness and efficiency of the pharmaceutical supply chain in both human and animal health.\nWe are organized geographically based upon the products and services we provide to our customers, and we report our results under two reportable segments: U.S. Healthcare Solutions and International Healthcare Solutions.\nU.S. Healthcare Solutions Segment\nThe U.S. Healthcare Solutions reportable segment distributes a comprehensive offering of brand-name, specialty brand-name and generic pharmaceuticals, over-the-counter healthcare products, home healthcare supplies and equipment, and related services to a wide variety of healthcare providers, including acute care hospitals and health systems, independent and chain retail pharmacies, mail order pharmacies, medical clinics, long-term care and alternate site pharmacies, and other customers. The U.S. Healthcare Solutions reportable segment also provides pharmaceutical distribution (including plasma and other blood products, injectable pharmaceuticals, vaccines, and other specialty pharmaceutical products) and additional services to physicians who specialize in a variety of disease states, especially oncology and retina, and to other healthcare providers, including hospitals, specialty retinal practices, and dialysis clinics. The U.S. Healthcare Solutions reportable segment also provides pharmacy management, staffing and additional patient access and adherence support services, and supply management software to a variety of retail and institutional healthcare providers. Additionally, it delivers packaging solutions to institutional and retail healthcare providers. Through its animal health business, the U.S. Healthcare Solutions reportable segment sells pharmaceuticals, vaccines, parasiticides, diagnostics, micro feed ingredients, and various other products to customers in both the companion animal and production animal markets. It also offers demand-creating sales force services to manufacturers.\nInternational Healthcare Solutions Segment\nThe International Healthcare Solutions reportable segment consists of businesses that focus on international pharmaceutical wholesale and related service operations and global commercialization services. The International Healthcare Solutions reportable segment distributes pharmaceuticals and other healthcare products and provides related services to healthcare providers, including pharmacies, doctors, health centers and hospitals primarily in Europe. It is a leading global specialty transportation and logistics provider for the biopharmaceutical industry. It is also a provider of specialized services, including regulatory affairs, market access, pharmacovigilance, development consulting and scientific affairs, and quality management and compliance, for the life sciences industry. In Canada, the business drives innovative partnerships with manufacturers, providers, and pharmacies to improve product access and efficiency throughout the healthcare supply chain.\nRecently, we undertook a strategic review of our business to ensure alignment with our growth priorities and strategic drivers. As a result of this review, we have reorganized certain business components within our reporting structure. Beginning in the first quarter of fiscal 2026, our reporting structure will be comprised of U.S. Healthcare Solutions, International Healthcare Solutions, and Other. The U.S. Healthcare Solutions reportable segment will consist of U.S. Human Health (excluding legacy U.S. Consulting Services). The International Healthcare Solutions reportable segment will consist of Alliance Healthcare, Innomar, World Courier, and strategic components of PharmaLex. Other, which is not considered a reportable segment, will consist of businesses for which we have begun to explore strategic alternatives and includes MWI Animal Health, Profarma, U.S. Consulting Services and the other components of PharmaLex.\nThis executive summary provides highlights from the results of operations that follow:\nRevenue increased by $27.4 billion, or 9.3%, from the prior fiscal year due to growth in both reportable segments. The U.S. Healthcare Solutions segment grew its revenue by $25.6 billion, or 9.7%, from the prior fiscal year due to overall market growth largely driven by unit volume growth, including increased sales of specialty products to health systems and physician practices and increased sales of products labeled for diabetes and/or weight loss in the GLP-1 class of $7.7 billion, or 26.9%. International Healthcare Solutions’ revenue increased by $1.7 billion, or 6.1%, from the prior fiscal year.\nGross profit increased by $1,568.5 million, or 15.8%, from the prior fiscal year primarily due to the increase in gross profit in the U.S. Healthcare Solutions reportable segment and larger gains from antitrust litigation settlements. U.S. Healthcare Solutions’ gross profit increased by $1,482.3 million, or 23.1%, from the prior fiscal year primarily due to increased sales and the January 2025 acquisition of RCA. Gross profit in International Healthcare Solutions decreased $5.6 million, or 0.2%, from the prior fiscal year.\nTotal operating expenses increased by $1,115.2 million, or 14.4%, from the prior fiscal year primarily due to the January 2025 acquisition of RCA, a larger goodwill impairment in fiscal 2025, and an increase in acquisition-related deal and integration expenses, offset in part by a decrease in litigation and opioid-related expenses in the current fiscal year.\nTotal segment operating income increased by $574.7 million, or 15.8%, from the prior fiscal year. U.S. Healthcare Solutions’ operating income increased by $639.8 million, or 21.8%, from prior fiscal year in part due to the January 2025 acquisition of RCA. International Healthcare Solutions’ operating income decreased by $65.1 million, or 9.1%, from the prior fiscal year.\nOur effective tax rates were 30.6% and 24.2% in fiscal 2025 and 2024, respectively. Our effective tax rate in fiscal 2025 was higher than the U.S. statutory rate primarily due to the impairments of PharmaLex goodwill and an equity investment, which are largely not deductible for income tax purposes, U.S. state income taxes, and an increase in the amount of unrecognized tax benefits, offset in part by the benefit of income taxed at rates lower than the U.S. statutory rate.\nResults of Operations\nFiscal 2025 compared to Fiscal 2024\n\nAcquisition-related deal and integration expenses\nRestructuring and other expenses\nTotal operating expenses\nDistribution, selling, and administrative expenses increased by $832.7 million, or 14.7%, from the prior fiscal year primarily due to the January 2025 acquisition of RCA and to support our revenue growth. As a percentage of revenue, distribution, selling, and administrative expenses were 2.02% in the current fiscal year and represent an increase of 9 basis points compared to the prior fiscal year primarily due to the January 2025 acquisition of RCA, offset in part by our improved operating leverage from our 9.3% revenue growth from the prior fiscal year.\nDepreciation expense increased by 15.3% from the prior fiscal year. Amortization expense decreased by 16.1% from the prior fiscal year due to certain tradenames becoming fully amortized in connection with our company name change to Cencora and the gradual transition away from other tradenames used, which were acquired through prior acquisitions.\nLitigation and opioid-related expenses, net in fiscal 2025 included legal fees in connection with opioid lawsuits and investigations.\nLitigation and opioid-related expenses, net in fiscal 2024 included a $214.0 million litigation expense accrual for litigation related to the distribution of prescription opioid medications, a $49.1 million litigation expense accrual related to our animal health business (see Note 12 of the Notes to Consolidated Financial Statements) and $56.1 million of legal fees in connection with opioid lawsuits and investigations, offset in part by a net $92.2 million opioid litigation settlement accrual reduction primarily as a result of our prepayment of the net present value of a future obligation as permitted under our opioid settlement agreements.\nAcquisition-related deal and integration expenses in fiscal 2025 primarily included costs related to the acquisition of RCA, including expenses related to equity units retained by RCA physicians and members of management of $121.7 million and $19.6 million related to the remeasurement of the fair value of contingent consideration associated with the RCA acquisition (see Note 2 of the Notes to Consolidated Financial Statements), and the continued integration of PharmaLex. Acquisition-related deal and integration expenses in fiscal 2024 primarily related to the integration of Alliance Healthcare and PharmaLex.\nRestructuring and other expenses are comprised of the following:\nRestructuring and employee severance costs\nBusiness transformation efforts\nTotal restructuring and other expenses\nRestructuring and employee severance costs in fiscal 2025 primarily included expenses incurred related to workforce reductions in both of our reportable segments. Restructuring and employee severance costs in fiscal 2024 primarily included expenses incurred related to facility closures in connection with our office optimization plan and workforce reductions in both of our reportable segments.\nBusiness transformation efforts in fiscal 2025 and 2024 included rebranding costs associated with our name change to Cencora and non-recurring expenses related to significant strategic initiatives to improve operational efficiency, including certain technology initiatives. The majority of these costs related to services provided by third-party consultants.\nIn fiscal 2024, we experienced a cybersecurity event where data from our information systems was exfiltrated. In connection with this event, we incurred costs that were recorded in Other, net in the above table. The majority of the costs included in Other, net in fiscal 2024 related to this cybersecurity event.\nWe recorded goodwill impairments of $723.9 million and $418.0 million related to PharmaLex in fiscal 2025 and 2024, respectively (see Note 5 of the Notes to Consolidated Financial Statements).\n\nInterest expense, net increased $134.6 million, or 85.7%, from the prior fiscal year due to the increase in interest expense, offset in part by an increase in interest income. The increase in interest expense was primarily due to the issuance of our $1.8 billion of senior notes in December 2024 and the $1.5 billion variable-rate term loan, which we borrowed in January 2025 to finance a portion of the RCA acquisition, increased revolving credit facility borrowings to cover short-term working capital needs, and the May 2025 issuance of our €1.0 billion of senior notes, offset in part by the repayment of our $500 million of senior notes that matured in March 2025. The increase in interest income was driven by higher average investment cash balances in fiscal 2025 in comparison to fiscal 2024.\nOur effective tax rates were 30.6% and 24.2% in fiscal 2025 and 2024, respectively. Our effective tax rate in fiscal 2025 was higher than the U.S. statutory rate primarily due to the impairments of PharmaLex goodwill and an equity investment, which are largely not deductible for income tax purposes, U.S. state income taxes, and an increase in the amount of unrecognized tax benefits, offset in part by the benefit of income taxed at rates lower than the U.S. statutory rate. Our effective tax rate in fiscal 2024 was higher than the U.S. statutory rate primarily due to the PharmaLex goodwill impairment, which was largely not deductible for income tax purposes, and U.S. state income taxes, offset in part by the discrete tax benefits associated with foreign valuation allowance adjustments and the benefit of non-U.S. income taxed at rates lower than the U.S. statutory rate.\nCritical Accounting Policies and Estimates\nCritical accounting policies are those policies that involve accounting estimates and assumptions that can have a material impact on our financial position and results of operations and require the use of complex and subjective estimates based upon past experience and management’s judgment. Actual results may differ from these estimates due to uncertainties inherent in such estimates. Below are those policies applied in preparing our financial statements that management believes are the most dependent upon the application of estimates and assumptions. For a complete list of significant accounting policies, see Note 1 of the Notes to Consolidated Financial Statements.\nAllowances for Returns and Credit Losses\nTrade receivables are primarily comprised of amounts owed to us for our pharmaceutical distribution and services activities and are presented net of an allowance for customer sales returns and an allowance for credit losses. Our customer sales return policy generally allows customers to return products only if the products can be resold at full value or returned to suppliers for full credit. We record an accrual for estimated customer sales returns at the time of sale to the customer based upon historical customer return trends. The allowance for returns as of September 30, 2025 and 2024 was $1,625.8 million and $1,175.9 million, respectively.\nWe evaluate our receivables for risk of loss by grouping our receivables with similar risk characteristics. Expected losses are determined based on a combination of historical loss trends, current economic conditions, and forward-looking risk factors. Changes in these factors, among others, may lead to adjustments in our allowance for credit losses. The calculation of the required allowance requires judgment by management as to the impact of those and other factors on the ultimate realization of our trade receivables. We perform ongoing credit evaluations of our customers’ financial condition and maintain reserves for expected credit losses and specific credit problems when they arise. We write off balances against the reserves when collectibility is deemed remote. We perform formal, documented reviews of the allowance at least quarterly and perform monthly credit loss reviews in connection with our largest businesses and our higher risk customer accounts. There were no significant changes to this process during fiscal 2025, 2024, and 2023, and bad debt expense was computed in a consistent manner during these periods. The bad debt expense for any period presented is equal to the changes in the period end allowance for credit losses, net of write-offs, recoveries, and other adjustments.\nBad debt expense for fiscal 2025, 2024, and 2023 was $63.3 million, $40.8 million, and $54.4 million respectively. An increase or decrease of 0.1% in the 2025 allowance as a percentage of trade receivables would result in an increase or decrease in the provision on accounts receiv",
  "item2_clean": null
}