{
  "source_file": "cor-20250630.htm",
  "form_type": "10-Q",
  "item1_clean": null,
  "item7_clean": null,
  "item2_clean": "Multi-currency revolving credit facility due in 2030\nReceivables securitization facility due in 2028\nTerm loan due in 2027\nMoney market facility due in 2027\nAlliance Healthcare debt\nTotal variable-rate debt\nWe had a $2.4 billion multi-currency senior unsecured revolving credit facility (\"Multi-Currency Revolving Credit Facility\") with a syndicate of lenders, which was scheduled to expire in October 2029. In June 2025, we amended and restated the Multi-Currency Revolving Credit Facility to extend the expiration to June 2030 and increase the aggregate amount of the commitments thereunder to $4.5 billion. Interest on borrowings under the Multi-Currency Revolving Credit Facility accrues at specified rates based upon our debt ratings. We pay facility fees to maintain the availability under the Multi-Currency Revolving Credit Facility at specified rates based on our debt rating. We may choose to repay or reduce our commitments under the Multi-Currency Revolving Credit Facility at any time. The Multi-Currency Revolving Credit Facility contains covenants, including compliance with a financial leverage ratio test, as well as others that impose limitations on, among other things, indebtedness of subsidiaries and asset sales, with which we were compliant as of June 30, 2025. There were no borrowings outstanding under the Multi-Currency Revolving Credit Facility as of June 30, 2025 and September 30, 2024.\nWe have a commercial paper program, which does not increase our borrowing capacity, that is fully backed by our Multi-Currency Revolving Credit Facility. We may, from time to time, issue short-term promissory notes in an aggregate amount of up to $3.4 billion at any one time. Amounts available under the program may be borrowed, repaid, and re-borrowed from time to time. The maturities on the notes will vary but may not exceed 365 days from the date of issuance. The notes will bear interest, if interest bearing, or will be sold at a discount from their face amounts. There were no borrowings outstanding under the commercial paper program as of June 30, 2025 and September 30, 2024.\nIn November 2024, we entered into an agreement pursuant to which we obtained a $1.0 billion senior unsecured revolving credit facility (the \"364-Day Revolving Credit Facility\") with a syndicate of lenders, which was scheduled to expire 364 days after the January 2, 2025 closing of the RCA acquisition, the date on which borrowings under this facility became available to us. In June 2025, in conjunction with the amendment to the Multi-Currency Revolving Credit Facility, we terminated the 364-Day Revolving Credit Facility.\nWe had a $1.45 billion receivables securitization facility (\"Receivables Securitization Facility\"), which was scheduled to expire in October 2027. In June 2025, we amended the Receivables Securitization Facility to extend the expiration to June 2028, increase the size of the facility to $1.5 billion, and increase its accordion feature to $500 million from $250 million. The accordion feature allows us to increase the commitment on the Receivables Securitization Facility up to $500 million, subject to lender approval. Interest rates are based on prevailing market rates for short-term commercial paper or 30-day Term SOFR, plus a program fee. We pay a customary unused fee at prevailing market rates, monthly, to maintain the availability under the Receivables Securitization Facility. The Receivables Securitization Facility contains similar covenants to the Multi-Currency Revolving Credit Facility, with which we were compliant as of June 30, 2025. There were no borrowings outstanding under the Receivables Securitization Facility as of June 30, 2025 and September 30, 2024.\nWe have an uncommitted, unsecured line of credit available to us pursuant to a money market credit agreement (the \"Money Market Facility\"). The Money Market Facility provides us with the ability to request short-term, unsecured revolving credit loans from time to time in a principal amount not to exceed $100 million. The Money Market Facility may be decreased or terminated by the bank or us at any time without prior notice. There were no borrowings outstanding under the Money Market Facility as of June 30, 2025 and September 30, 2024.\nIn July 2025, we entered into an uncommitted, unsecured line of credit to support our working capital needs (\"Working Capital Credit Facility\"). The Working Capital Credit Facility provides us with the ability to request short-term, unsecured revolving credit loans from time to time in a principal amount not to exceed $500 million. The Working Capital Credit Facility expires in July 2026 and may be decreased or terminated by the bank or us at any time without prior notice.\nIn January 2025, we borrowed $1.5 billion on a variable-rate term loan (\"Term Loan\") that matures in December 2027. The Term Loan was used to finance a portion of the acquisition of RCA. The Term Loan bears interest at a rate equal to either an adjusted SOFR plus an applicable margin or an alternate base rate plus an applicable margin. The margins are based on our public debt ratings. The Term Loan contains similar covenants to the Multi-Currency Revolving Credit Facility. We have the right to prepay the borrowings under the Term Loan at any time, in whole or in part and without premium or penalty. Through June 30, 2025, we elected to make early principal payments of $200 million on the Term Loan.\nIn December 2024, we issued $500 million of 4.625% senior notes due in December 2027 (the \"2027 Notes\"), $600 million of 4.850% senior notes due in December 2029 (the \"2029 Notes\"), and $700 million of 5.150% senior notes due in February 2035 (the \"2035 Notes\"). The 2027 Notes were sold at 99.815% of the principal amount with an effective yield of 4.634%. The 2029 Notes were sold at 99.968% of the principal amount with an effective yield of 4.852%. The 2035 Notes were sold at 99.945% of the principal amount with an effective yield of 5.153%. Interest on the 2027 Notes and the 2029 Notes is payable semi-annually in arrears on June 15 and December 15, which began on June 15, 2025. Interest on the 2035 Notes is payable semi-annually in arrears on February 15 and August 15, which began on February 15, 2025. We used the proceeds from the 2027 Notes, the 2029 Notes, and the 2035 Notes to finance a portion of the acquisition of RCA.\nIn May 2025, we issued €500 million of 2.875% senior notes due in May 2028 (the \"2028 Notes\") and €500 million of 3.625% senior notes due in May 2032 (the \"2032 Notes\"). The 2028 Notes were sold at 99.960% of the principal amount with an effective yield of 2.876%. The 2032 Notes were sold at 99.757% of the principal amount with an effective yield of 3.634%. Interest on the 2028 Notes and the 2032 Notes is payable annually in arrears beginning on May 22, 2026. We used the proceeds from the 2028 Notes and the 2032 Notes for general corporate purposes.\nIn March 2025, our $500 million of 3.250% senior notes matured and was repaid.\nAlliance Healthcare debt is comprised of uncommitted revolving credit facilities in various currencies with various rates. These facilities are used to fund its working capital needs.\nNonrecourse debt is comprised of short-term and long-term debt belonging to the Brazil subsidiaries and is repaid solely from the Brazil subsidiaries' cash flows and such debt agreements provide that the repayment of the loans (and interest thereon) is secured solely by the capital stock, physical assets, contracts, and cash flows of the Brazil subsidiaries.\nShare Purchase Programs and Dividends\nIn March 2024, our Board of Directors authorized a share repurchase program allowing us to purchase up to $2.0 billion of our outstanding shares of common stock, subject to market conditions. In the nine months ended June 30, 2025, we purchased $435.4 million of our common stock. As of June 30, 2025, we had $882.2 million of availability under this program.\nIn November 2024, our Board of Directors increased the quarterly dividend paid on common stock by 8% from $0.51 per share to $0.55 per share. We anticipate that we will continue to pay quarterly cash dividends in the future. However, the payment and amount of future dividends remains within the discretion of our Board of Directors and will depend upon future earnings, financial condition, capital requirements, and other factors.\nCommitments and Obligations\nAs discussed and defined in Note 9 of the Notes to Consolidated Financial Statements, on July 21, 2021, it was announced that we and the two other national pharmaceutical distributors had negotiated a Distributor Settlement Agreement. The Distributor Settlement Agreement became effective on April 2, 2022, and as of June 30, 2025, it included 48 of 49 eligible states (the \"Settling States\") as well as 99% by population of the eligible political subdivisions in the Settling States. Our accrued litigation liability related to the Distributor Settlement Agreement and an estimate for non-participating government subsidiaries (with whom we have not reached a settlement agreement), as well as other opioid-related litigation for which we have reached settlement agreements on our Consolidated Balance Sheet as of June 30, 2025 is $4.7 billion and is expected to be paid over the next 14 years. We currently estimate that $416.8 million will be paid prior to June 30, 2026. The payment of the aforementioned litigation liability has not and is not expected to have an impact on our ability to pay dividends.\nThe following is a summary of our contractual obligations for future principal and interest payments on our debt, minimum rental payments on our noncancellable operating leases, and minimum payments on our other commitments as of June 30, 2025:\nPayments Due by Period (in thousands)\nDebt, Including Interest Payments\nThe 2017 Tax Act requires a one-time transition tax to be recognized on historical foreign earnings and profits. As of June 30, 2025, we expect to pay the "
}