{
  "source_file": "flt-20241231.htm",
  "form_type": "10-K",
  "item1_clean": "We actively market and sell our solutions to current and prospective customers using a multi-channel approach. This go-to-\nmarket strategy includes comprehensive digital channels, direct sales forces and strategic partner relationships. We continue to\nexpand online, end-to-end capability where the customers can buy, onboard and manage their accounts on their own. In\naddition, we leverage an omni-channel approach that enables our sales people to be more efficient by improving their\nprospecting efforts through digitally sourced leads. In our direct sales force channel, we acquire and manage the customer\nrelationship, which has historically been either in-person or via telesales. Our capabilities are also offered through indirect sales\nchannels (e.g., major oil companies and fuel marketers for fuel, retail establishments for tolls and vehicle OEMs for consumer\nEV solutions) and on a branded or “white label” basis, indirectly through a broad range of resellers and partners across most of\nour solutions. In doing so, we leverage their sales networks to expand our reach into new customer segments, new industry\nverticals and new geographies faster and at a significantly lower cost.\nWith respect to our tolls solution, we also place proprietary manned kiosks and unmanned vending machines in areas with high\nconsumer foot traffic, such as shopping malls, to reach consumers. With respect to our gift solutions, third-party distribution is\ngenerally provided by other companies, who are reliant on access to our systems to meet their distribution obligations. With\nrespect to our parking solutions, we sign deals with municipalities, local authorities and other parking operators to offer a\ndigital parking app to drivers who need to pay for parking in their locations. Typically, signage is prominently displayed in the\nparking location to direct drivers to download our parking app to facilitate booking and payment. This same app is then used as\na tool to sell other products & services to these users.\ncapitalize on our products’ specialization by deploying product-dedicated sales forces to target specific customer segments.\nAs our solution set has expanded, we are also facilitating cross-selling and bundled product offerings to fully leverage our\ndistribution capabilities, capture more spend and revenue from our existing customer base and deliver more value to customers\nwhich should improve customer loyalty and retention.\nCredit Underwriting and Collections\nWe perform a detailed application review of all new applications for credit, evaluating the applications for fraud as well as\ncredit risk. With both the fraud and credit review, we leverage third-party data sources, including device data, fraud scores and\ncredit bureau data to name a few. The credit review includes a combination of machine learning models, as well as judgmental\nunderwriting based on customer financials. We employ a variety of tools to manage risk in our portfolio, including billing\nfrequency, payment terms, spending limits, payment methods, delinquency suspension and security. Further, we use fraud\ndetection programs, including proprietary and third-party solutions, to monitor transactions and prevent misuse. We monitor the\ncredit quality of our portfolio periodically utilizing external credit scores and internal behavior data to identify high risk or\ndeteriorating credit quality accounts and control our risk through various strategies. We conduct targeted strategies to minimize\nexposure to high-risk accounts, including reducing spending limits and payment terms or requiring additional security deposits.\nOur primary competition is from financial institutions providing a full suite of financial products, including general purpose\ncards, AP payments (i.e. check and ACH) and cross-border solutions. We also compete with specialized competitive offerings\nfrom other companies that vary by product solution.\nVehicle Payments: Our fuel solutions compete with similar offerings such as, WEX, U.S. Bank Voyager Fleet\nSystems, Edenred, Sodexo, Alelo, Radius Payment Solutions and DKV. Our toll solutions compete with similar\nofferings such as, ConectCar, Veloe (Alelo) and Repom (Edenred). Our parking solutions compete with similar\nofferings such as ParkMobile, ParkHub, Parking BOXX and FLASH.\nCorporate Payments: Our corporate payments solutions compete with similar offerings from financial institutions,\nincluding American Express, Coupa, AvidXchange, Bill.com and Convera.\nLodging Payments: Our lodging solutions compete with similar offerings from traditional travel management\ncompanies such as, American Express Global Business Travel, as well as in-house travel solutions at large\ncorporations and airlines.\nOther; Our gift and payroll card solutions compete with similar offerings from Fiserv, other special-purpose card\nissuers and payroll companies.\nCompetitive Advantage\nIn executing our strategy, we are advantaged by our competitive strengths:\n– We have strong market positions across four continents. This enables us to provide new offerings with\nbetter cost economics, sell complementary products, acquire attractive assets that can leverage existing infrastructure\nand cost synergies and introduce successful products and practices from other markets.\nCompounding Growth Model\n– Our growth model historically benefits from strong revenue retention, organic growth\nfrom new customer acquisitions and selling more value-added products to current customers, via developed and\nacquired payment solutions.\nProprietary Networks\n– Our specialized proprietary networks allow for unique data capture at the point of sale,\nproviding an incremental value proposition to our customers. These proprietary networks also provide us with\nadvantageous economics by providing attractive, captive spend to the merchant base.\n– Our easy-to-use platforms provide control and functionality for our customers, and we can on-\nboard incremental customer volume with very limited need for additional infrastructure. We own and control all the\ncritical components to our offering, creating improved speed to market and proprietary feature functionality in the\n– Our solutions and geographic diversification are designed to provide stability through the “portfolio\neffect” when one geography or business is underperforming relative to the others. This allows Corpay to deliver more\nconsistent financial performance relative to competitors, continue to invest throughout business cycles and reallocate\nresources to higher performing businesses.\nOur technology provides continuous authorization of transactions, processing of critical account and customer information and\nsettlement between merchants, issuing companies and individual commercial entities. We recognize the importance of state-of-\necure, efficient and reliable technology in our business and have made significant investments in our applications and\n, we spent approximately $380 million in capital and operating expenses to operate, protect and enhance\nWe operate several proprietary processing systems that provide features and functionality to run our card programs and\nsolutions, including our card issuing, processing and information services. Our processing systems also integrate with our\nproprietary networks, which provide brand awareness and connectivity to our acceptance locations that enables the “end-to-\nend” card acceptance, da\nta capture and transaction authorization capabilities of our card programs. Our proprietary processing\nsystems and aggregation software are tailored to meet the unique needs of the individual markets they serve and enable us to\ncreate and deliver solutions that serve each of our industry verticals and geographies. Our technology platforms are comprised\nof four key components, which were primarily developed and are maintained in-house: (1) a core processing platform; (2)\nspecialized software; (3) integrated network capabilities; and (4) a cloud-based architecture with proprietary APIs.\nOur technology function is based in the U.S., Europe and Brazil and has expertise in the management of applications,\ntransaction networks and infrastructure. We operate application development centers in the U.S., U.K., Netherlands, Czech\nRepublic, Brazil and New Zealand. Our distributed application architecture allows us to maintain, administer and innovate our\nsolutions in a cost-effective and flexible manner. Our solutions contain significant intellectual property that differentiates us\nfrom our competition.\nW\ne continually seek to modernize and evolve our technology solutions through our core information technology (IT)\ntransformation initiatives. Our IT transformation initiatives are focused on three main pillars: (1) digital strategy; (2) core\nsystems modernization; and (3) data. Our digital strategy is focused on streamlining a digital customer experience across all of\nour solutions, providing a seamless experience. Additionally, we are investing in modernizing our core transactional systems to\nmake them more resilient, secure and scalable. Our technology infrastructure is supported by highly-secure data centers, with\nredundant locations. We operate our primary data centers, located in Atlanta, Georgia; Studley, United Kingdom; Prague,\nCzech Republic; Las Vegas, Nevada; Lexington and Louisville, Kentucky; São Paulo, Brazil; and Toronto, Canada.\nAdditionally, as we develop new solutions and modernize legacy assets, we increasingly use cloud services. Through the use of\ncloud technology and microservices, we are able to modernize our platforms with no disruption to our customers. Finally, data\nis becoming an ever-increasing part of how we and our customers do business. We are focused on investing in our data assets to\ndeliver value for our customers through improved insights to help them to better control expenses and mitigate fraud. The use\nof cloud services provides us with increased flexibility and agility. We use only proven technology and expect no foreseeable\ncapacity limitations.\nWe maintain disaster recovery and business continuity plans. Our telecommunications and internet systems have multiple levels\nof redundancy to ensure the reliability of network\n, we achieved over 99.9% up-time for authorizations globally.\nSafeguarding Our Business\nTo provide our services, we may collect, use and store sensitive business information and personal information. Some of this\ninformation is also processed and stored by financial institutions, merchants and other entities, as well as third-party service\nproviders to whom we outsource certain functions and other agents, which we refer to collectively as, our associated third\nparties. We may have responsibility to the card networks, financial institutions and in some instances, our customers, and/or\nindividuals, for our failure or the failure of our associated third parties (as applicable) to protect this information.\nOur systems align with industry standards for security, with multiple industry certifications. Our network is configured with\nmultiple layers of security to isolate our core systems from unauthorized access. We use secure communication among\napplications, and our employees access critical components strictly on a \"need-to-know\" basis. We may not be able to\nadequately protect our systems or the data we collect from continually evolving cybersecurity risks or other technological risks,\nwhich could subject us to liability and damage our reputation. See also, \"Risks related to information technology and security\"\nunder Item 1A for further discussion of the risks we face in connection with our technology systems and potential data breach\nand cybersecurity risks. Also, see Item 1C Cybersecurity for further discussion of our risk management strategy and\nA substantial number of laws and regulations, both in the U.S. and in other jurisdictions, apply to businesses offering payment\nproducts to customers, processing payments and servicing related accounts, or operating payment n",
  "item7_clean": "due to the impact of acquisitions and continued investments in technology.\nFinancing activities.\nNet cash provided by financing activities was\ncompared to net cash used in\nfinancing activities of\n. Net cash provided by financing activities in 2024 was primarily due to (i) net\nborrowings on our Credit Facility and Securitization Facility of\nas compared to net repayments of\nand (ii) an increase in proceeds of\nfrom common stock resulting from stock option\nexercises, partially offset by increased outflows for repurchases of common stock of\nCorpay Technologies Operating Company, LLC, and certain of our domestic and foreign owned subsidiaries, as designated co-\nborrowers (the “Borrowers”), are parties to a\nCredit Agreement (the “Credit Agreement”), with Bank of America,\nN.A., as administrative agent, swing line lender and letter of credit issuer and a syndicate of financial institutions (the\n“Lenders”), which has been amended multiple times.\nThe Credit Agreement provides for senior secured credit f\n(collectively, the \"Credit Facility\") consisting of a revolving credit facility in the amount of\n, a Term Loan A facility\n(\"Term Loan A\") and a Term Loan B facility in the amount of\n(\"Term Loan B\") as of\n. The revolving credit facility consists of (a) a revolving A credit facility in the amount of\nsublimits for letters of credit and swing line loans and (b) a revolving B facility in the amount of\n. dollars, euros, British pounds, Japanese yen or other currency as agreed in advance and a sublimit for swing line loans.\nThe Credit Agreement also includes an accordion feature for borrowing an additional\nin Term Loan A, Term Loan\nB, revolving A or revolving B facility debt and an unlimited amount when the leverage ratio on a pro-forma basis is less than\nds from the credit facilities may be used for working capital purposes, acquisitions and other general\ncorporate purposes. The maturity date for the Term Loan A and revolving credit facilities A and B is\nLoan B has a maturity date of April 30, 2028.\nOn May 3, 2023, the Company entered into the thirteenth amendment to the Credit Facility. The amendment replaced LIBOR\non the Term Loan B with the Secured Overnight Financing Rate (SOFR), plus a SOFR adjustment of\nOn January 31, 2024, we entered into the fourteenth amendment to the Credit Agreement. The amendment a) increased the\ncapacity on the revolving credit facility by $275.0 million and b) increased the Term Loan A commitments by $325.0 million.\nWe used the Term Loan A proceeds to pay down existing borrowings under the revolving credit facility. As a result, the\ntransaction was leverage neutral and results in a $600 million increase in our availability under the revolving credit facility. The\ninterest rates and maturity terms remain consistent with the existing credit facilities.\nOn September 26, 2024, we entered into the fifteenth amendment to the Credit Agreement. The amendment a) increased the\nTerm Loan B commitments by $500 million and b) removed the SOFR adjustment margin of 0.10% from the calculation of\ninterest on Term Loan B borrowings. We used the Term Loan B proceeds to pay down existing borrowings under the revolving\ncredit facility. The maturity dates and the interest rates for\nrevolving credit facility and Term Loan A commitments were\nunchanged by this amendment.\n5, we entered into the sixteenth amendment to the Credit Agreement. The amendment increased the Term\nLoan B commitments by an incremental\nTerm Loan B proceeds to pay down existing borrowings\nunder the revolving credit facility and other general corporate purposes. The maturity dates and the interest rates for the Credit\nAgreement were unchanged by this amendment.\nInterest on amounts outstanding under the Credit Agreement accrues\nas follows: for all loans denominated in U.S. dollars with\nthe exception of Term Loan B borrowings, based on SOFR plus a SOFR adjustment of 0.10%; for Term Loan B borrowings,\nbased on SOFR; for all loans denominated\nin British pounds, based on the SONIA plus a SONIA adjustment of\nall loans denominated in euros, based on the\nEuro Interbank Offered Rate (EURIBOR)\n; or for all loans denominated in\nJapanese yen, at the Toyko Interbank Offer Rate (TIBOR) plus a margin based on a leverage ratio (as defined in the\nagreement); or our option (for U.S. dollar borrowings only), the Base Rate (defined as the rate equal to the highest of (a) the\nFederal Funds Rate plus\n, (b) the prime rate announced by Bank of America, N.A., or (c) SOFR plus\nbased on a leverage ratio). In addition, we pay a quarterly commitment fee at a rate per annum ranging from\nthe daily unused portion of the credit facility.\n, the interest rate on the Term Loan A was\n, the interest rate on the Term Loan B was\ninterest rate on the revolving A and B facilities (USD borrowings) was\n, and the interest rate on the revolving B facility\n(GBP borrowings) was\n. The unused credit facility fee was\nfor all revolving facilities at\nThe term loans are payable in quarterly installments due on the last business day of each March, June, September and\nDecember with the final principal payment due on the respective maturity date. Borrowings on the revolving line of credit are\nrepayable at the maturity of the facility. Borrowings on the domestic swing line of credit are due on demand, and borrowings on\nthe foreign swing lines of credit are due no later than\nbusiness days after such loan is made.\nThe obligations of the Borrowers under the Credit Agreement are secured by substantially all of the assets of Corpay and its\ndomestic subsidiaries, pursuant to a security agreement and includes a pledge of (i) 100% of the issued and outstanding equity\ninterests owned by us of each Domestic Subsidiary and (2) 66% of the voting shares of the first-tier foreign subsidiaries, but\nexcluding real property, personal property located outside of the U.S., accounts receivables and related assets subject to the\nSecuritization Facility and certain investments required under money transmitter laws to be held free and clear of liens.\nin borrowings outstanding on Term Loan A, net of discounts,\nborrowings outstanding on Term Loan B, net of discounts and\nin borrowings outstan\nding on the revolving credit\nfacility. We have unamortized debt issuance costs of\nrelated to the revolving credit facility as of\nrecorded in other assets within the Consolidated Balance Sheets. We have unamortized debt discounts and debt issuance\nrelated to the term loans as of\nrecorded in notes payable and other obligations, net of\ncurrent portion within the Consolidated Balance Sheets. As a result of the amortization of debt discounts and debt issuance\ncosts, the effective interest rate incurred on the term loan\nDuring the year ended\n, we made borrowings of\non the term loans, principal payments of\non the term loans and net borrowings of\non the revolving facilities.\n, we were in compliance with each of the covenants under the Credit Agre\nSecuritization Facility\nreceivables purchase agreement among Corpay Funding LLC, as seller, PNC Bank, National\nAssociation as administrator, and various purchaser agents, conduit\nand related committed purchasers parties thereto\n(the \"Securitization Facility\") as of December 31, 2024. At\n, the interest rate on the Securitization Facility\nOn January 24, 2025, we entered into an omnibus amendment to our Securitization Facility. The amendment increased the\nSecuritization Facility commitment from\nand extended the maturity of the Securitization Facility\nfrom August 18, 2025 to January 24, 2028.\nThe omnibus amendment also reduced the program fee by 5 bps to SOFR plus\n0.10% adjustment plus 0.90% or the Commercial Paper Rate plus 0.80% and decreased the unused facility fee by 5 bps for two\nThe Securitization Facility provides for certain termination events, which includes nonpayment, upon the occurrence of which\nthe administrator may declare the facility termination date to have occurred, may exercise certain enforcement rights with\nrespect to the receivables and may appoint a successor servicer, among other things.\nWe were in compliance with all financial and non-financial covenant requirements related to our Securitization Facility as of\nWe carefully monitor and manage initial\nvariation margin requirements for our cross-border solutions, which can result in\ntransitory periods of elevated liquidity needs in cases where the currency market experiences disruption. In order to help\nmitigate that liquidity risk, we have entered into facilities intended to provide additional means to manage working capital\nneeds for our cross-border solutions.\nWe have three unsecured overdraft facilities with a combined capacity of $155.0 million, which may be accessible via written\nrequest and corresponding authorization from the applicable lenders. There is no guarantee the uncommitted capacity will be\navailable to us on a future date. Interest on drawn balances accrues under the agreements at either (a) a fixed rate equal to the\nlender's reference rate or the Federal Funds Effective Rate (as defined in the respective agreements) plus 1% or (b) SOFR plus\n, we had no borrowings outstanding under the uncommitted credit facilities.\nWe also have a 364-day committed revolving credit facility with a total commitment of $70.0 million and maturity date of\nFebruary 20, 2026. Borrowings under this facility will bear interest at the borrower's option at a rate equal to (a) Term SOFR\n(as defined in the agreement) plus 1.25% or (b) the Base Rate (determined by reference to the greatest of (i) the Federal Funds\nEffective Rate, at that time, plus 0.50%, (ii) the Prime Rate, at that time, and (iii) Term SOFR (as defined in the agreement) at\nsuch time plus 1.00%). As of\n, we had no borrowings outstanding under the committed credit facility.\n, we had the following outstanding interest rate swap derivatives that qualify as hedging instruments\nwithin designated cash flow hedges of variable interest rate risk (in millions):\nThe purpose of these contracts is to reduce the variability of cash flows in interest payments associated with $4.5 billion of\nunspecified variable rate debt, the sole source of which is due to changes in the SOFR benchmark interest rate. For each of\nthese swap contracts, we pay a fixed monthly rate and receive one month SOFR.\nOur cash flow hedges resulted in a reduction to interest expense, net of\nNet Investment Hedges\nWe enter into cross-currency interest rate swaps that are designated as net investment hedges of our investments in foreign-\ndenominated operations. Such contracts effectively convert the U.S. dollar equivalent notional amounts to obligations\ndenominated in the respective foreign currency and partially offset the impact of changes in currency rates on such foreign-\ndenominated net investments. These contracts also create a positive interest differential on the U.S. dollar-denominated portion\nof the swaps, resulting in interest rate savings on the USD notional.\n, we had the following cross-currency interest rate swaps designated as net investment hedges of our\ninvestments in foreign-denominated operations:\nU.S. dollar equivalent\nnotional (in millions)\nCanadian Dollar (CAD)\nHedge effectiveness is tested based on changes in the fair value of the cross-currency swaps due to changes in the USD/foreign\ncurrency spot rates. We anticipate perfect effectiveness of the designated hedging relationships and record changes in the fair\nvalue of the cross-currency interest rate swaps associated with changes in the spot rate through accumulated other\ncomprehensive loss. Excluded components associated with the forward differential are recognized directly in earnings as\ninterest expense, net. We recognized a benefit of\nexpense, net for the years ended\n, respectively, related to these excluded components.\n2025, we terminated our existing CAD cross-currency interest rate swaps designated as net investment hedges and\nsubsequently entered into four new cross-currency interest rate swaps designated as net investment hedges of our investments in\nCAD-denominated operations. These contracts effectively convert an aggregate $800 million of U.S. dollar equivalent to an\nobligation denominated in CAD and partially offset the impact of changes in currency rates on our CAD-denominated net\ninvestments. These contracts also create a positive interest differential on the U.S. dollar-denominated portion of the swap,\nresulting in a weighted average interest rate savings of 1.35% on the USD notional.\nI\nn February 2025, we signed a definitive agreement to acquire\nof Gringo, a leading Brazil-based vehicle registration and\ncompliance payment company, for approximately\n, net of cash of approximately\n. Gringo's digital app\nand national network help drivers in Brazil pay for vehicle taxes, registration and fines. The transaction is expected to close in\nthe first quarter of 2025, subject to regulatory approval and standard closing conditions and will be reflected in our Vehicle\nStock Repurchase Program\nGiven our returns on our capital investments and significant cash provided by operations, management believes it is prudent to\nreinvest in the business to drive profitable growth and use excess cash flow to return cash to shareholders over time through\nOur Board of Directors (the \"Board\") has approved a stock repurchase program (as updated from time to\ntime, the \"Program\") authorizing us to repurchase our common stock from time to time until February 4, 2026. On January 25,\n2024, the Board authorized an increase to the aggregate size of the Program by $1.0 billion to $8.1 billion, and on November 4,\n2024, the Board authorized an increase to the aggregate size of the Program by $1.0 billion to $9.1 billion.\nof the Program through\n, we have repurchased\nshares for an aggregate purchase price of\nof remaining authorization available under the Program for future repurchases in shares of\nour common stock. We repurchased\ncommon shares totaling\ncommon shares totaling\ncommon shares totaling\nAny stock repurchases may be made at times and in such amounts as deemed appropriate. The timing and amount of stock\nrepurchases, if any, will depend on a variety of factors including the stock price, market conditions, corporate and regulatory\nrequirements, and any additional constraints related to material inside information we may possess. Any repurchases have been\nand are expected to be funded by a combination of available cash flow from the business, working capital and debt.\nMaterial Cash Requirements and Uses of Cash\nMaterial cash requirements primarily consist of debt obligations and related interest payments, along with lease obligations.\nDeferred income tax liabilities as of\nSee Note 13 to the Consolidated\ntemporary differences between the tax bases of assets and liabilities and their respective book bases, which will result in taxable\namounts in future years when the liabilities are settled at their reported financial statement amounts. The results of these\ncalculations do not have a direct connection with the amount of cash taxes to be paid in any future periods. As a result,\nscheduling deferred income tax liabilities as payments du\ne by period could be misleading, as this scheduling would not relate to\n, we had approximately\ngnized income tax benefits related to\nuncertain tax positions. We cannot reasonably estimate when all of these unrecognized income tax benefits may be settled. We\ndo not expect reductions to unrecognized income tax benefits within the next 12 months as a result of projected resolutions of\nincome tax uncertainties.\nCritical Accounting Estimates\nIn applying the accounting policies that we use to prepare our consolidated financial statements, we necessarily make\naccounting estimates that affect our reported amounts of assets, liabilities, revenue and expenses. Some of these estimates\nrequire us to make assumptions about matters that are highly uncertain at the time we make the accounting estimates. We base\nthese assumptions and the resulting esti",
  "item2_clean": null
}