{
  "source_file": "cpb-20250427.htm",
  "form_type": "10-Q",
  "item1_clean": null,
  "item7_clean": null,
  "item2_clean": "Management's Discussion and Analysis of Financial Condition and Results of Operations\nOVERVIEW\nUnless otherwise stated, the terms \"we,\" \"us,\" \"our\" and the \"company\" refer to The Campbell's Company and its consolidated subsidiaries.\nWe are a manufacturer and marketer of high-quality, branded food and beverage products. We operate in a highly competitive industry and experience competition in all of our categories.\nOn March 12, 2024, we completed the acquisition of Sovos Brands, Inc. (Sovos Brands) for total purchase consideration of $2.899 billion. For additional information on the Sovos Brands acquisition, see Note 3 to the Consolidated Financial Statements. All references to the acquisition below refer to the Sovos Brands acquisition.\nOn August 26, 2024, we completed the sale of our Pop Secret popcorn business. On February 24, 2025, we completed the sale of our noosa yoghurt business. For additional information on the divestitures, see Note 4 to the Consolidated Financial Statements.\nOur industry continues to navigate global macroeconomic challenges, including tariffs and shifting global trade policies; changes in consumer purchasing and spending patterns; supply chain pressures; commodity cost volatility; labor market issues; and economic uncertainties amplified by increased regulatory activity. Tariffs on China, Canada, Mexico, the European Union and other countries have and are expected to result in retaliatory measures on U.S. goods, such as the 25% tariffs imposed by Canada on imports of certain U.S. goods, and increase costs. We are continuing to monitor the rapidly evolving tariff and global trade policies and are working with our suppliers to mitigate potential impacts on our business. The extent and duration of the tariffs and the resulting impact on general economic conditions and on our business are uncertain and depend on various factors, such as recent legal challenges to the U.S.'s imposition of tariffs, negotiations between the U.S. and affected countries, the responses of other countries or regions, exemptions that may be granted, availability and cost of alternative sources of supply and demand for our products in affected markets.\nIn addition, in light of recent actions by the United States Department of Health and Human Services, Food and Drug Administration (FDA) and states, we anticipate continued legislative and regulatory developments with respect to food ingredients, labeling and packaging at the state and federal levels, along with related changes in consumer expectations and behavior. In April 2025, the FDA announced a series of actions aimed at phasing out all “petroleum-based synthetic dyes” from the nation’s food supply, and in May 2025, the Make America Healthy Again (MAHA) Commission published a report discussing factors contributing to chronic childhood disease including diet, environmental exposure, lack of physical activity and healthcare. While the effects of all of these proposals remain uncertain at this time, we are continuing to monitor changes to laws and regulations that affect the food industry and evaluate their impact on our business and financial condition.\nThrough the third quarter, we experienced a moderate level of input cost inflation and other supply chain costs. We anticipate continued supply chain productivity and benefits from cost savings initiatives to mitigate inflationary pressures and expect such benefits to offset incremental costs in 2025, excluding potential impacts of tariffs. We expect consumer trends to continue to evolve and our volumes to improve over time; however, economic pressures, including the challenges of persistent inflation and impacts of tariffs, may continue to negatively impact our volumes throughout 2025. We will continue to evaluate the evolving macroeconomic environment to take action to mitigate the impact on our business, consolidated results of operations and financial condition.\nThis Summary of Results provides significant highlights from the discussion and analysis that follows.\nNet sales increased 4% in the quarter to $2.475 billion primarily due to the benefit from the acquisition of Sovos Brands and favorable volume/mix, partially offset by the impact of divestitures and lower net price realization. The increase in volume/mix was partially related to the favorable timing of shipments this quarter.\nGross profit, as a percent of sales, was 29.4% in 2025 compared to 30.9% in the prior-year quarter. The decrease was primarily due to the impact of cost inflation and other supply chain costs, mark-to-market adjustments on outstanding undesignated commodity hedges and unfavorable net price realization, partially offset by benefits from supply chain productivity improvements, the prior-year impact from a Sovos Brands acquisition date fair value adjustment for inventory and favorable volume/mix.\nEarnings per share were $.22 in 2025, compared to $.44 in the prior-year quarter. The current quarter included expenses of $.51 per share and the prior-year quarter included expenses of $.30 per share from items impacting comparability as discussed below.\nNet Earnings attributable to The Campbell's Company\nThe following items impacted the comparability of net earnings and net earnings per share:\nWe implemented several cost savings initiatives in recent years. In the third quarter of 2025, we recorded Restructuring charges of $6 million and implementation costs and other related costs of $7 million in Cost of products sold, $7 million in Administrative expenses and $1 million in Research and development expenses related to these initiatives. In the third quarter of 2024, we recorded implementation costs and other related costs of $13 million in Administrative expenses, $3 million in Cost of products sold, $1 million in Marketing and selling expenses, $1 million in Research and development expenses and a reduction to Restructuring charges of $3 million related to these initiatives. Year-to-date in 2025, we recorded Restructuring charges of $17 million and implementation costs and other related costs of $26 million in Administrative expenses, $25 million in Cost of products sold, $3 million in Research and development expenses and $2 million in Marketing and selling expenses related to these initiatives. Year-to-date in 2024, we recorded Restructuring charges of $1 million and implementation costs and other related costs of $47 million in Administrative expenses, $9 million in Cost of products sold, $4 million in Marketing and selling expenses and $3 million in Research and development expenses related to these initiatives.\nIn the second quarter of 2024, we began implementation of an optimization initiative to improve the effectiveness of our Snacks direct-store-delivery route-to-market network. In the third quarter of 2025, we recognized $9 million in Marketing and selling expenses and $1 million in Administrative expenses related to this initiative. In the third quarter of 2024, we recognized $5 million in Marketing and selling expenses related to this initiative. Year-to-date in 2025, we recognized $17 million in Marketing and selling expenses and $1 million in Administrative expenses related to this initiative.\nIn the third quarter of 2025, the total aggregate impact related to the cost savings and optimization initiatives was $31 million ($24 million after tax, or $.08 per share). In the third quarter of 2024, the total aggregate impact related to the cost savings and optimization initiatives was $20 million ($15 million after tax, or $.05 per share). Year-to-date in 2025, the total aggregate impact related to the cost savings and optimization initiatives was $91 million ($70 million after tax, or $.23 per share). Year-to-date in 2024, the total aggregate impact related to the cost savings and optimization initiatives was $69 million ($52 million after tax, or $.17 per share). See Note 8 to the Consolidated Financial Statements and \"Restructuring Charges, Cost Savings Initiatives and Other Optimization Initiatives\" for additional information;\nIn the third quarter of 2025, we recognized losses in Cost of products sold of $10 million ($7 million after tax, or $.02 per share) associated with unrealized mark-to-market adjustments on outstanding undesignated commodity hedges. In the third quarter of 2024, we recognized gains in Cost of products sold of $13 million ($10 million after tax, or $.03 per share) associated with unrealized mark-to-market adjustments on outstanding undesignated commodity hedges. Year-to-date in 2025, we recognized gains in Cost of products sold of $8 million ($6 million after tax, or $.02 per share) associated with unrealized mark-to-market adjustments on outstanding undesignated commodity hedges. Year-to-date in 2024, we recognized gains in Cost of products sold of $5 million ($4 million after tax, or $.01 per share) associated with unrealized mark-to-market adjustments on outstanding undesignated commodity hedges;\nIn the third quarter of 2025 and 2024, we recorded accelerated amortization expense in Other expenses / (income) of $6 million ($5 million after tax, or $.02 per share) related to customer relationship intangible assets due to the loss of certain contract manufacturing customers, which began in the fourth quarter of 2023. Year-to-date in 2025 and 2024, we recorded accelerated amortization expense in Other expenses / (income) of $20 million ($15 million after tax, or $.05 per share);\nIn the third quarter of 2025, the company performed an interim impairment assessment on the\ntrademark within the Snacks segment and recognized an impairment charge of $150 million ($112 million after tax, or $.37 per share) on the trademark.\nIn the second quarter of 2025, we performed an interim impairment assessment on certain salty snacks and cookie trademarks within our Snacks segment, including\n, collectively referred to as our \"Allied brands,\" and recognized an impairment charge of $15 million on the trademarks.\nIn the"
}