{
  "source_file": "cpb-20250803.htm",
  "form_type": "10-K",
  "item1_clean": "broth, soups and non-dairy beverages;\ngravies, beans and dinner sauces;\nV8\njuices and beverages;\ntomato juice; and as of March 12, 2024,\npasta sauces, dry pasta, frozen entrées, frozen pizza and soups;\nfrozen entrées and pasta sauces; and\nyogurts. The noosa yoghurt business was sold on February 24, 2025. The segment also includes snacking products in foodservice and Canada; and\nSnacks, which consists of Pepperidge Farm cookies, crackers, fresh bakery and frozen products, including\npretzel crisps, and other snacking products in retail in the U.S. The segment also includes the snacking and meals and beverages retail business in Latin America. The segment also included the results of our Pop Secret popcorn business, which was sold on August 26, 2024 and our Emerald nuts business, which was sold on May 30, 2023.\nBeginning in 2026, the snacking and meals and beverages retail business in Latin America is managed under our Meals & Beverages segment.\nWe refer to the following products as our \"leadership brands\":\ncondensed and ready-to-serve soups;\nbroth, stocks and canned poultry;\nbroth, soups and non-dairy beverages;\nV8\njuices and beverages;\npasta sauces, dry pasta, frozen entrées, frozen pizza and soups; Pepperidge Farm cookies, crackers and fresh bakery;\nSee Note 7 to the Consolidated Financial Statements and \"Management's Discussion and Analysis of Financial Condition and Results of Operations\" for additional information regarding our reportable segments.\nIngredients, Packaging and Finished Products\nThe ingredients and packaging materials required for the manufacture of our food and beverage products are purchased from various suppliers, substantially all of which are located in North America. We also purchase finished products from domestic and international suppliers. Many of these items are subject to price fluctuations from a number of factors, including but not limited to geopolitical conflicts, shifting global trade policies (including tariffs and retaliatory measures), import and export requirements, product scarcity, demand for raw materials, commodity market speculation, energy costs, currency fluctuations, supplier capacities, government-sponsored agricultural programs and other government policy, climate change, changes in crop size, cattle cycles, herd and flock disease, crop disease, crop pests, drought and excessive rain, temperature extremes and other adverse weather events, water scarcity, scarcity of suitable agricultural land, scarcity of organic ingredients, pandemics or other local or global health issues, environmental and other sustainability regulations and other factors that may be beyond our control. To help reduce some of this price volatility, we use a combination of purchase orders, short- and long-term contracts, inventory management practices, alternative sourcing opportunities, supplier collaboration, various commodity risk management tools for most of our ingredients and packaging and other cost mitigation efforts, as applicable. Ingredient inventories are generally at a peak during the late fall and decline during the winter and spring. Since many ingredients of suitable quality are available in sufficient quantities only during certain seasons, we make commitments for the purchase of such ingredients in their respective seasons.\nDuring 2025, we experienced some volatility in commodity and supply chain costs, including the costs of labor, raw materials, energy, fuel, packaging materials and finished products, with a moderate impact from tariffs in the fourth quarter. We are unable to predict the extent to which tariffs may impact our ability to source ingredients, packaging materials and finished products in the future, and certain supply pressures may continue throughout 2026. In 2026, we expect more significant cost pressures primarily driven by tariff impacts. We plan to reduce some of these costs and impacts over time through cost savings initiatives, inventory management practices, supplier collaboration, alternative sourcing opportunities, continued supply chain productivity initiatives, surgical pricing actions where necessary and other mitigation efforts.\nIn most of our markets, sales and merchandising activities are conducted through our own sales force and/or third-party brokers and distribution partners. Our products are generally resold to consumers through retail food chains, mass discounters, mass merchandisers, club stores, convenience stores, dollar stores, e-commerce and other retail, commercial and non-commercial establishments. Our Snacks segment has a direct-store-delivery distribution model that uses independent contractor distributors.\nOur five largest customers accounted for approximately\n% of our consolidated net sales in 2025, 2024, and 2023. Our largest customer, Wal-Mart Stores, Inc. and its affiliates, accounted for approximately\n% of our consolidated net sales in 2025 and\n% in 2024 and 2023. Both of our reportable segments sold products to Wal-Mart Stores, Inc. or its affiliates. No other customer accounted for 10% or more of our consolidated net sales.\nTrademarks and Technology\nAs of September 10, 2025, we owned over 3,000 trademark registrations and applications in over 150 countries. We believe our trademarks are of material importance to our business. Although the laws vary by jurisdiction, trademarks generally remain valid and can be renewed indefinitely as long as they are in use and/or their registrations are properly maintained, and they have not become generic. We believe that our principal brands, including\n\nare protected by trademark law in the major markets where they are used.\nAlthough we own a number of valuable patents, we do not regard any segment of our business as being dependent upon any single patent or group of related patents. In addition, we own copyrights, both registered and unregistered, proprietary trade secrets, technology, know-how, processes and other intellectual property rights that are not registered.\nWe operate in a highly competitive industry and experience competition in all of our categories. This competition arises from numerous competitors of varying sizes across multiple food and beverage categories, and includes producers of private label products, as well as other branded food and beverage manufacturers. Private label products are generally sold at lower prices than branded products. Competitors market and sell their products through traditional retailers and e-commerce. All of these competitors vie for trade merchandising support and consumer dollars. The number of competitors cannot be reliably estimated. Our principal areas of competition are brand recognition, taste, nutritional value, price, promotion, innovation, shelf space and customer service.\nCapital Expenditures\nDuring 2025, our aggregate capital expenditures were $426 million. We expect to spend approximately $420 million for capital projects in 2026. Major capital projects based on planned spend in 2026 include network optimization for both our Meals & Beverages and Snacks businesses, information technology projects and wastewater initiatives. We estimate that approximately $35 million of the capital expenditures anticipated during 2026 will be for upgrades to our Napoleon, Ohio wastewater treatment facility, with another approximately $20 million for other network wastewater initiatives.\nGovernment Regulation\nThe manufacture and sale of consumer food products is highly regulated. In the U.S., our activities are subject to regulation by various federal government agencies, including the Food and Drug Administration (FDA), the Department of Agriculture, the Federal Trade Commission, the Department of Labor, the Department of Commerce, the Occupational Safety and Health Administration and the Environmental Protection Agency, as well as various state and local agencies. Our business is also regulated by similar agencies outside of the U.S. Additionally, we are subject to food ingredients regulations (including but not limited to Food, Drug, and Cosmetic Act (FD&C) colors), labeling and packaging regulations (including but not limited to extended producer responsibility (EPR) regulations), data privacy and security regulations, tax and securities regulations, import regulations, accounting and reporting standards, and other financial laws and regulations. We believe that we are in compliance with current laws and regulations in all material respects and do not expect that continued compliance with such laws and regulations will have a material effect on capital expenditures, earnings or our competitive position.\nEnvironmental Matters\nOf our $426 million in capital expenditures made during 2025, approximately $26 million were for compliance with environmental laws and regulations in the U.S. We further estimate that approximately $35 million of the capital expenditures anticipated during 2026 will be for upgrades to our Napoleon, Ohio wastewater treatment facility, with another approximately $20 million for other network wastewater initiatives. Additionally, we anticipate spending approximately $6 million for compliance with U.S. environmental laws and regulations during 2026. We believe that the continued compliance with existing environmental laws and regulations (both within the U.S. and elsewhere) will not have a material effect on capital expenditures, earnings or our competitive position. In addition, we continue to monitor existing and pending environmental laws and regulations within the U.S. and elsewhere relating to climate change, greenhouse gas emissions, energy and sustainability, including EPR laws and regulations. While the impact of these laws and regulations cannot be predicted with certainty, we do not believe that compliance with these laws and regulations will have a material effect on capital expenditures, earnings or our competitive position. See Note 18 to the Consolidated Financial Statements for additional information regarding certain environmental matters.\nDemand for soup products is seasonal, with the fall and winter months usually accounting for the highest sales volume.\n\nUnless otherwise stated, the terms \"we,\" \"us,\" \"our\" and the \"company\" refer to The Campbell's Company and its consolidated subsidiaries.\nWe are a manufacturer and marketer of high-quality, branded food and beverage products. We organized as a business corporation under the laws of New Jersey on November 23, 1922; however, through predecessor organizations, we trace our heritage in the food business back to 1869. Our principal executive offices are in Camden, New Jersey 08103-1799.\nOn March 12, 2024, we completed the acquisition of Sovos Brands, Inc. (Sovos Brands) for total purchase consideration of $2.899 billion. For additional information on this acquisition, see Note 3 to the Consolidated Financial Statements.\nOn May 30, 2023, we completed the sale of our Emerald nuts business. On August 26, 2024, we completed the sale of our Pop Secret popcorn business. On February 24, 2025, we completed the sale of our noosa yoghurt business. For additional information on the divestitures, see Note 4 to the Consolidated Financial Statements.\nOur operations, including reportable segments, are described below. Our locations, including manufacturing facilities, within each reporting segment are described in Item 2. Properties.\nOur reportable segments are:\nMeals & Beverages, which consists of soup, simple meals and beverages products in retail and foodservice in the U.S. and Canada. The segment includes the following products:\ncondensed and ready-to-serve soups;\n\nDemand for our other products is generally evenly distributed throughout the year.\nHuman Capital Management\nOne of the four pillars of our strategic framework is to build a Top Team. To do this, we are committed to building a company where everyone is valued and supported to do their best work. We believe that our employees are the driving force behind our success. Priorit",
  "item7_clean": "Management's Discussion and Analysis of Financial Condition and Results of Operations\nOVERVIEW\nThis Management’s Discussion and Analysis of Financial Condition and Results of Operations is provided as a supplement to, and should be read in conjunction with, our consolidated financial statements and the accompanying notes to the consolidated financial statements presented in \"Financial Statements and Supplementary Data,\" as well as the information contained in \"Risk Factors.\"\nUnless otherwise stated, the terms \"we,\" \"us,\" \"our\" and the \"company\" refer to The Campbell's Company and its consolidated subsidiaries.\nWe are a manufacturer and marketer of high-quality, branded food and beverage products. We operate in a highly competitive industry and experience competition in all of our categories.\nIn 2025, we continued to advance our key strategic initiatives in a dynamic operating environment marked by shifting global trade policies, increased regulatory activity, consumer behavior shifts, commodity cost fluctuations and other global macroeconomic challenges. During 2025, we experienced elevated cost inflation and other supply chain costs, which were mostly offset by improvements in our supply chain productivity and benefits from our cost savings initiatives. In 2026, we expect more significant cost pressures primarily driven by tariff impacts. We plan to reduce some of these costs and impacts over time through cost savings initiatives, inventory management practices, supplier collaboration, alternative sourcing opportunities, continued supply chain productivity initiatives, surgical pricing actions where necessary and other mitigation efforts. We will continue to evaluate the dynamic macroeconomic environment to take action to mitigate the impact on our business, financial condition and results of operations.\nOur strategy is built around four pillars that position us to achieve Top-Tier Performance for our shareholders, as further discussed below.\n: We plan to deliver for our people by continuing to cultivate a highly engaged culture to attract, grow and retain top talent. This includes investing in leadership and development programs and elevating commercial capabilities that will help us grow. We are driving organizational engagement, belonging and effectiveness through our\nEmployee Value Proposition,\nMake history with Campbell’s\n, and modernizing our facilities. We have completed the consolidation of our Snacks offices into Camden, New Jersey. Our single headquarters has helped to foster closer collaboration and enhance decision-making, thereby improving our ability to execute on our business strategy.\n: We believe in delivering for our consumers through consumer-focused marketing efforts and increased leadership brand support. We have created a Growth Office to support our two divisions and to expand our consumer-led innovations. We believe that we are well-positioned as a transformative category leader with an advantaged portfolio of brands across our Meals & Beverages and Snacks segments. We will support our Best Portfolio priority and accelerate our profitable growth model by growing market share and driving integrated business planning programming throughout the company.\n: We will focus on delivering for our customers by advancing strategic retailer relationships and continuing to optimize our manufacturing and distribution network, with a focus on digitization, logistics and distribution expertise. In September 2024, we announced plans to implement new cost savings initiatives with targeted annual savings of approximately $250 million by the end of 2028. On September 3, 2025, we increased the estimate of annual ongoing savings, once all phases are implemented, to approximately $375 million by the end of 2028. See \"Restructuring Charges, Cost Savings Initiatives and Other Optimization Initiatives\" for additional information on these initiatives.\n: Finally, we plan to continue to deliver for our communities with continued progress on our sustainability and community goals and strengthening our connection to the communities in which we operate.\nOur industry continues to navigate a dynamic operating and regulatory environment driven by commodity cost volatility, supply chain pressures, tariffs and shifting global trade policies and other economic uncertainties, as well as evolving consumer purchasing and spending patterns.\nOur strategy is designed, in part, to capture growing consumer preferences for value and convenience. We expect consumers to continue to seek at-home cooking solutions and stretchable meals. We also believe that consumers are making more intentional decisions in snacking, in terms of health and wellness and seeking indulgences.\nRetailers continue to use their buying power and negotiating strength to seek increased promotional programs funded by their suppliers and more favorable terms, including supplier-funded customized products. Any consolidations among retailers would continue to create large and sophisticated customers that may further this trend. Retailers also continue to grow and promote private label brands that compete with branded products, especially on price.\nTariffs on certain ingredients, inputs and imports from many countries, including Canada, Mexico, members of the European Union and the United Kingdom have resulted in increased costs, including on ingredients, packaging, such as tinplate steel used to make cans and other materials used to produce and distribute our products and on finished products that we import. We are continuing to monitor the rapidly evolving tariff and global trade policies and are working with our suppliers to mitigate potential impacts on our business. The extent and duration of the tariffs and the resulting impact on general economic conditions and on our business are uncertain and depend on various factors, such as recent legal challenges to the U.S.'s imposition of tariffs, negotiations between the U.S. and affected countries, the responses of other countries or regions, relief that may be granted, availability and cost of alternative sources of supply and demand for our products in affected markets.\nIn addition, in light of recent actions by the United States Department of Health and Human Services, Food and Drug Administration (FDA) and states, we anticipate continued legislative and regulatory developments with respect to food ingredients, labeling and packaging at the state and federal levels, along with related changes in consumer expectations and behavior. In April 2025, the FDA called on industry to phase out all “petroleum-based synthetic dyes” from the nation’s food supply, and in May 2025, the MAHA Commission published an assessment report discussing factors contributing to chronic childhood disease including diet, environmental exposure, lack of physical activity and healthcare. The MAHA Commission transmitted its strategy report, setting forth certain recommendations for addressing chronic childhood disease, to the President in August 2025 and publicly released it in September 2025. While the effects of all of these proposals remain uncertain at this time, we are continuing to monitor changes to laws and regulations that affect the food industry and evaluate their impact on our business, financial condition and results of operations.\nIn 2026, we expect significant cost pressures primarily driven by tariff impacts that could negatively impact our business, financial condition and results of operations. We will continue to evaluate the dynamic macroeconomic environment to take action to mitigate such impacts.\nBusiness Acquisition & Divestitures\nOn March 12, 2024, we completed the acquisition of Sovos Brands, Inc. (Sovos Brands) for total purchase consideration of $2.899 billion. For additional information on the Sovos Brands acquisition, see Note 3 to the Consolidated Financial Statements. All references to the acquisition below refer to the Sovos Brands acquisition.\nOn May 30, 2023, we completed the sale of our Emerald nuts business. On August 26, 2024, we completed the sale of our Pop Secret popcorn business. On February 24, 2025, we completed the sale of our noosa yoghurt business. For additional information on the divestitures, see Note 4 to the Consolidated Financial Statements.\nThis Summary of Results provides significant highlights from the discussion and analysis that follows.\nThere were 53 weeks in 2025 and 52 weeks in 2024 and 2023.\nNet sales increased 6% in 2025 to $10.253 billion primarily due to an 8-point benefit from the acquisition of Sovos Brands and a 2-point benefit from the 53\nweek, partially offset by the impact of divestitures, unfavorable volume/mix and lower net price realization.\nGross profit, as a percent of sales, decreased to 30.4% in 2025 from 30.8% a year ago. The decrease was primarily due to higher cost inflation and other supply chain costs and unfavorable net price realization, partially offset by the benefits from supply chain productivity improvements.\nEarnings per share were $2.01 in 2025, compared to $1.89 a year ago. The current year included expenses of $.97 per share and the prior year included expenses of $1.19 per share from items impacting comparability as discussed below.\nNet Earnings attributable to The Campbell's Company - 2025 Compared with 2024\nThe following items impacted the comparability of net earnings and net earnings per share:\nWe implemented several cost savings initiatives in recent years. In 2025, we recorded Restructuring charges of $24 million and implementation costs and other related costs of $41 million in Administrative expenses, $32 million in Cost of products sold, $4 million in Marketing and selling expenses and $3 million in Research and development expenses related to these initiatives. In 2024, we recorded Restructuring charges of $17 million and implementation costs and other related costs of $54 million in Administrative expenses, $26 million in Cost of products sold, $4 million in Marketing and selling expenses and $3 million in Research and development expenses related to these initiatives.\nIn the second quarter of 2024, we began implementation of an optimization initiative to improve the effectiveness of our Snacks direct-store-delivery route-to-market network. In 2025, we recognized $20 million in Marketing and selling expenses and $1 million in Administrative expenses related to this initiative. In 2024, we recognized $5 million in Marketing and selling expenses related to this initiative.\nIn 2025, the total aggregate impact related to the cost savings and optimization initiatives was $125 million ($96 million after tax, or $.32 per share). In 2024, the total aggregate impact related to the cost savings and optimization initiatives was $109 million ($83 million after tax, or $.28 per share). See Note 8 to the Consolidated Financial Statements and \"Restructuring Charges, Cost Savings Initiatives and Other Optimization Initiatives\" for additional information;\nIn 2025, we recognized actuarial losses on our pension and postretirement plans in Other expenses / (income) of $24 million ($18 million after tax, or $.06 per share). In 2024, we recognized actuarial losses in Other expenses / (income) of $33 million ($25 million after tax, or $.08 per share);\nIn 2025, we recognized gains in Cost of products sold of $11 million ($8 million after tax, or $.03 per share) associated with unrealized mark-to-market adjustments on outstanding undesignated commodity hedges. In 2024, we recognized losses in Cost of products sold of $22 million ($16 million after tax, or $.05 per share) associated with unrealized mark-to-market adjustments on outstanding undesignated commodity hedges;\nIn 2025, we recorded accelerated amortization expense in Other expenses / (income) of $20 million ($15 million after tax, or $.05 per share) related to customer relationship intangible assets due to the loss of certain contract manufacturing customers, which began in the fourth quarter of 2023. In 2024, we recorded accelerated amortization expense in Other expenses / (income) of $27 million ($20 million after tax, or $.07 per share);\nIn the third quarter of 2025, we performed an interim impairment assessment on the\ntrademark within the Snacks segment and recognized an impairment charge of $150 million ($112 million after tax, or $.37 per share) on the trademark.\nIn the second quarter of 2025, we performed an interim impairment assessment on certain salty snacks and cookie trademarks within our Snacks segment, including\n, collectively referred to as our \"Allied brands,\" and recognized an impairment charge of $15 million on the trademarks.\nIn the second quarter of 2025, we performed an interim impairment assessment on the\ntrademark within our Snacks segment and recognized an impairment charge of $11 million on the trademark.\nIn 2025, the total aggregate impact of the impairment charges was $176 million ($131 million after tax, or $.44 per share).\nIn the fourth quarter of 2024, we recognized an impairment charge of $53 million on our Allied brands trademarks.\nIn the fourth quarter of 2024, we performed an impairment assessment on the assets in our Pop Secret popcorn business within our Snacks segment as sales and operating performance were below expectations due in part to competitive pressure and reduced margins, and as we pursued divesting the business. As a result of these factors, in the fourth quarter of 2024, we lowered our long-term outlook for the business and recognized an impairment charge of $76 million on the trademark. The sale of the business was completed on August 26, 2024.\nIn 2024, the total aggregate impact of the impairment charges was $129 million ($98 million after tax, or $.33 per share).\nThe charges were included in Other expenses / (income). See \"Critical Accounting Estimates\" for additional information;\nIn 2025 and 2024, we recorded litigation expenses in Administrative expenses of $5 million ($5 million after tax, or $.02 per share) related to the Plum baby food and snacks business (Plum), which was divested on May 3, 2021, and certain other litigation matters;\nIn 2025, we recorded insurance recoveries in Administrative expenses of $1 million ($1 million after tax) related to a cybersecurity incident that was identified in the fourth quarter of 2023. In 2024, we recorded costs of $2 million in Cost of products sold and $1 million in Administrative expenses (aggregate impact of $2 million after tax, or $.01 per share) related to the cybersecurity incident;\nIn the third quarter of 2025, we completed the sale of our noosa yoghurt business. In the second quarter of 2025, we recorded $15 million ($.05 per share) of tax expense related to the sale. In 2025, we recorded an after-tax loss of $15 million ($.05 per share) on the sale of the business. In the first quarter of 2025, we recorded a loss in Other expenses / (income) of $25 million ($19 million after tax, or $.06 per share) on the sale of our Pop Secret popcorn business. In 2025, the total aggregate impact of charges associated with divestitures was $25 million ($34 million after tax, or $.11 per share); and\nIn the first quarter of 2024, we announced our intent to acquire Sovos Brands and on March 12, 2024 the acquisition closed. In 2024, we incurred $126 million of costs associated with the acquisition, of which $21 million was recorded in Restructuring charges, $47 million in Administrative expenses, $35 million in Other expenses / (income), $3 million in Marketing and selling expenses, $2 million in Research and development expenses and $18 million in Cost of products sold, of which $17 million was associated with the acquisition date fair value adjustment for inventory. We also recorded costs of $2 million in Interest expense related to costs associated with the Delayed Draw Term Loan Credit Agreement (the 2024 DDTL Credit Agreement) used to fund the acquisition. The aggregate impact was $128 million, $109",
  "item2_clean": null
}