{
  "source_file": "cprt-20250731.htm",
  "form_type": "10-K",
  "item1_clean": "14 — Segments and Other Geographic Reporting\nOur Service Offerings\nWe offer vehicle sellers a full range of vehicle services, which expedite each stage of the vehicle sales process, helping to maximize proceeds and minimize costs. Not all service offerings are available in all markets. Additionally, in some cases a service offering may be applicable only to a particular subsidiary or operating segment. Our service offerings include the following:\nOnline Seller Access\nCopart Access, our proprietary internet-based service for vehicle sellers, provides a comprehensive suite of tools designed to maximize efficiency and transparency throughout the sales process. This platform empowers sellers to seamlessly manage their inventory by assigning vehicles for sale, monitoring sales calendars, and accessing detailed vehicle information, including high-resolution images and historical data. Furthermore, Copart Access streamlines critical administrative functions such as viewing and reprinting body shop invoices and towing receipts, proactively managing the title procurement process, and optimizing total loss determination and management and the handling of unrelated/undisclosed damage. The platform also provides sellers with valuable insights into the historical performance of vehicles sold through our auctions, enabling data-driven decision-making and improved returns.\nSalvage Estimation Services\nWe offer Co.ai, a proprietary suite of total loss determination and valuation tools that leverage machine learning and computer vision to assist sellers in the vehicle claims evaluation process by providing online salvage value estimates, which helps sellers determine whether to repair a vehicle or deem it a total loss.\nWe offer IntelliSeller, an automated tool leveraging our vast and detailed vehicle and sales data to assist our sellers in making vital auction decisions. Using machine learning, IntelliSeller optimizes the utilization of our vehicle and sales data to determine when to establish minimum bid values and suggest when to re-auction a unit to ensure optimal returns while minimizing cycle time.\nWe offer vehicle sellers in the U.K. estimating services for vehicles taken to our facilities. Estimating services provide our insurance company sellers repair estimates, which allow the insurance company to determine if the vehicle is a total loss vehicle. If the vehicle is determined to be a total loss, it is generally assigned to us to sell.\nEnd-of-Life Vehicle Processing\nIn the U.K., we are an authorized treatment facility for the disposal of end-of-life vehicles.\nTransportation Services\nIn the U.S. segment, we perform transportation services through a combination of third-party vehicle transport companies and our fleet. We maintain contracts with third-party vehicle transport companies, which enable us to pick up most of our sellers’ vehicles within 24 hours. Our national network and transportation capabilities provide cost and time savings to our vehicle sellers and offer timely vehicle pick up and prompt response to catastrophes and natural disasters in the U.S. In the International segment, we perform transportation services through a combination of our fleet and third-party vehicle transport companies. Our international network and transportation capabilities provide cost and time savings to our vehicle sellers throughout the U.K., Europe, Canada, Brazil and Middle East market.\nVehicle Inspection Stations\nWe offer some of our major insurance company sellers office and facility space to house vehicle inspection stations on-site at our facilities. We have over 100 vehicle inspection stations at our facilities. An on-site vehicle inspection station provides our insurance company sellers with a central location to inspect potential total loss vehicles, which reduces storage charges that otherwise may be incurred at the initial storage or repair facility.\nWe provide vehicle sellers with real time data for vehicles that we process for the seller. This includes vehicle sellers’ gross and net returns on each vehicle, service charges, and other data that enable our vehicle sellers to more easily administer and monitor the vehicle disposition process. In addition, we have developed a database containing over 300 fields of real-time and historical information accessible by our sellers allowing for their generation of custom ad hoc reports and customer specific analysis.\nWe have extensive expertise in DMV document and title processing. We have developed a computer system which provides a direct link to the DMV computer systems of multiple states, allowing us to expedite the processing of vehicle title paperwork.\nWe also facilitate the title transfer from the original owner or financial institutions on behalf of some of our sellers to streamline the documentation and vehicle auction process.\nWe can obtain up-to-date loan payoff information electronically from hundreds of automotive lenders, including the remaining balance due and per diem on a vehicle loan, to expedite the loan payoff and title transfer process.\nFlexible Vehicle Processing Programs\nAt the election of the seller, we sell vehicles pursuant to our Percentage Incentive Program (“PIP”), Consignment Program, or Purchase Program. Under each program we may provide merchandising services such as covering or taping openings to protect vehicle interiors from weather, washing vehicle exteriors, vacuuming vehicle interiors, cleaning and polishing dashboards and tires, making keys for drivable vehicles, and identifying drivable vehicles. We believe our merchandising efforts increase the sales prices of the vehicles, thereby increasing the return on vehicles to both vehicle sellers and us.\nPercentage Incentive Program.\nUnder PIP, we agree to sell all of the vehicles of a seller in a specified market, usually for a predetermined percentage of the vehicle sales price. Because our revenues under PIP are directly linked to the vehicle’s sale\nprice, we have an incentive to actively merchandise those vehicles to maximize the net return. We provide the vehicle seller, at our expense, with transportation of the vehicle to our nearest facility.\nConsignment Program.\nUnder our Consignment Program, we sell vehicles for a fixed consignment fee. Although sometimes included in the consignment fee, we may also charge additional fees for the cost of transporting the vehicle to our nearest facility, storage of the vehicle, and other incidental costs.\nUnder the Purchase Program, we purchase vehicles from a vehicle seller at a formula price, based on a percentage of the vehicles’ estimated PAV, and sell the vehicles for our own account. Currently, the purchase program is offered primarily in the U.K.\nBuy It Now, Make An Offer\nWe offer an option to our members to purchase specific pre-qualified vehicles immediately at a set price before the live auction process. This enables us to provide a fast, easy, transparent and comprehensive buying option on these pre-qualified vehicles. Additionally, members have the option of submitting an offer amount on certain selected vehicles. If an offer is accepted, the member can purchase the vehicle before the live auction process.\nWe offer a flexible and unique sales process designed to maximize the sale prices of the vehicles utilizing VB3. VB3 opens our sales process to members and the general public to view auctions via our website and our mobile application anywhere in the world where internet access is available. The VB3 technology and model employs a two-step bidding process. The first step is an open preliminary bidding feature that allows a member to enter bids over the internet during the preview days. To improve the effectiveness of bidding, the VB3 system lets a member see the current high bid on the vehicle they want to purchase. The preliminary bidding step is an open bid format similar to eBay\n. Members enter the maximum price they are willing to pay for a vehicle and VB3’s BID4U feature will incrementally bid the vehicle on their behalf during all steps of the auction. Preliminary bidding ends at a specified time prior to the start of a second bidding step, an internet-only virtual auction. This second step allows bidders the opportunity to bid against each other and the highest preliminary bidder. The bidders enter bids via the internet in real time, and then BID4U submits bids for the highest preliminary bidder, up to their maximum bid. When bidding stops, a countdown is initiated. If no bids are received during the countdown or any extensions, the vehicle sells to the highest bidder.\nWe provide financial institutions, fleet and rental car companies with an efficient method to sell their vehicles. We have a dedicated team of employees that support the processing of BluCar vehicles which includes market specific services such as asset recovery, comprehensive condition reports and arbitration.\nCopart Dealer Services\nWe provide franchise and independent dealers with a convenient method to sell their trade-ins through any of our facilities. We have a dedicated team of employees in the U.S. that target these dealers and work with them throughout the sales process.\nWe provide the general public with a fast and convenient method to sell their vehicles. Anyone can go to CashForCars.com; CashForCars.ca; CashForCars.de, CashForCars.co.uk, or Cash-for-cars.ie and arrange to obtain a valid offer to purchase their vehicle. Upon acceptance of our offer to purchase their vehicle, we provide them payment for their vehicle and then sell the vehicle on our own behalf.\nNational Powersport Auctions\nIn the U.S., we provide wholesale powersport vehicle remarketing services through live and online auction platforms to dealers, financial institutions and Original Equipment Manufacturers through our subsidiary National Powersport Auctions (“NPA”). Powersports include for example motorcycles, recreational vehicles, boats and RVs. NPA also offers comprehensive data services including the NPA Value Guide\nTM\n, which we believe is the industry’s most accurate wholesale valuation tool. NPA corporate offices are located in San Diego, California; and they operate from locations throughout the United States.\nIn the U.S., through our majority ownership of Purple Wave Inc. (“Purple Wave”) we provide wholesale construction, agriculture, and fleet remarketing services through no-reserve online auctions at www.purplewave.com, selling such items directly from the sellers location. Purple Wave Inc. offers a range of services including appraisals, listings, marketing, and post auction shipping. The Purple Wave corporate office is located in Manhattan, Kansas.\nIn the U.K., we have two facilities for U-Pull It from which the public can purchase parts from salvaged and end-of-life vehicles. In general, the buyer is responsible for detaching the parts from the vehicle and any associated hauling or transportation of the parts after detachment. After the valuable parts have been removed by the buyer, the remaining parts and car body are sold for their scrap value. We also operate GPS which dismantles vehicles and sells used parts.\nWe pioneered posting vehicle images online for buyers in 2001, and we have been improving the technology to provide top quality photos since then. In July 2020, we enhanced online images and videos by launching Copart 360 (“C360”), our proprietary technology that captures clear 360-degree views of interiors and exteriors of cars, trucks, and vans across U.S. Copart locations. This capability was expanded to the U.K. in fiscal 2021. Interested buyers can view everything from the backseat to the dashboard to the tires by clicking the 360° icon under vehicle images on select lot details pages on Copart.com. Buyers can also zoom in and out or expand to full screen on computers or mobile devices.\nWe now offer three tiers of membership Guest, Basic, and Premier, except for Copart U.K. where we offer only Guest, and Basic.\nGuest Member ",
  "item7_clean": "Management’s Discussion and Analysis of Financial Condition and Results of Operations\nWe are a leading global provider of online auctions and vehicle remarketing services with operations in the United States (“U.S.”), the United Kingdom (“U.K.”), Germany, Brazil, Canada, the United Arab Emirates (“U.A.E.”), Spain, Finland, Oman, the Republic of Ireland, and Bahrain.\nOur goals are to generate sustainable profits for our stockholders, while also providing environmental and social benefits for the world around us. With respect to our environmental stewardship, we believe our business is a critical enabler for the global re-use and recycling of vehicles, parts, and raw materials. We are not responsible for the carbon emissions resulting from new vehicle manufacturing, governmental fuel emissions standards or vehicle use by consumers. Each vehicle that enters our business operations already exists, with whatever fuel technology and efficiency it was designed and built to have, and the substantial carbon emissions associated with the vehicle’s manufacture have already occurred. However, upon our receipt of an existing vehicle, we help facilitate the decrease of its total environmental impact by extending its useful life and thereby avoiding the carbon emissions associated with the alternative of new vehicle and auto parts manufacturing. For example, many of the cars we process and remarket are subsequently restored to drivable condition, reducing the new vehicle manufacturing burden the world would otherwise face. Many of our cars are purchased by dismantlers, who recycle and refurbish parts for vehicle repairs, again reducing new and aftermarket parts manufacturing. Finally, some of our vehicles are returned to their raw material inputs through scrapping, thereby reducing the need for further new resource extraction. In each of these cases, our business facilitates the reduction of the carbon and other environmental footprint of the global transportation industry.\nBeyond our environmental stewardship, we also support the world’s communities in two important ways. First, we believe that we contribute to economic development and well-being by enabling more affordable access to mobility around the world. For example, many of the automobiles sold through our auction platform are purchased for use in developing countries where affordable transportation is a critical enabler of education, health care, and well-being. Secondly, we believe we play an important role in the communities we serve through our response to and management of catastrophic weather events. This includes our investments in equipment and infrastructure which support our overall disaster recovery efforts. For example, we mobilized our people, and engaged with a multitude of service providers to timely retrieve, store, and remarket tens of thousands of flood-damaged vehicles in South Florida in the wake of Hurricanes Helene and Milton in the fall of 2024.\nWe provide vehicle sellers with a full range of services to process and sell vehicles primarily over the internet through our Virtual Bidding Third Generation internet auction-style sales technology, which we refer to as VB3. Vehicle sellers consist primarily of insurance companies, but also include dealers, individuals, charities, rental car companies, banks, finance companies, and fleet operators. We obtained 81%, 81%, and 83% of the total number of vehicles processed during fiscal 2025, 2024, and 2023, respectively, from insurance company sellers. We sell the vehicles principally to licensed vehicle dismantlers, rebuilders, repair licensees, used vehicle dealers, exporters, and to the general public. The majority of the vehicles sold on behalf of insurance companies are either damaged vehicles deemed a total loss; not economically repairable by the insurance companies; or are recovered stolen vehicles for which an insurance settlement with the vehicle owner has already been made. We offer vehicle sellers a full range of services that help expedite each stage of the vehicle sales process, minimize administrative and processing costs, and maximize the ultimate sales price through the online auction process.\nIn the U.S., Canada, Brazil, the Republic of Ireland, Finland, the U.A.E., Oman, and Bahrain, we sell vehicles primarily as an agent and derive revenue primarily from auction and auction-related sales transaction fees charged for vehicle remarketing services as well as fees for services subsequent to the auction, such as delivery and storage. In the U.K., Germany, and Spain,\nwe operate both as an agent and on a principal basis, in some cases purchasing salvage vehicles outright and reselling the vehicles for our own account. In the U.K., we recognize revenue on a principal basis from selling dismantled parts through GPS. In Germany and Spain, we also derive revenue from listing vehicles on behalf of insurance companies and insurance experts to determine the vehicle’s residual value and/or to facilitate a sale for the insured.\nKey Financial Performance Measures\nWe monitor and analyze a number of key financial performance indicators in order to manage our business and evaluate our financial and operating performance. Such indicators include:\nService and Vehicle Sales Revenue:\nOur service revenues consist of auction and auction-related sales transaction fees charged for vehicle remarketing services. These auction and auction-related services may include a combination of the following: vehicle purchasing fees: vehicle listing fees; vehicle selling fees that can be based on a predetermined percentage of the vehicle sales price, tiered vehicle sales price fees, or at a fixed fee based on the sale of each vehicle regardless of the selling price of the vehicle; transportation fees for the cost of transporting the vehicle to or from our facility; title processing and preparation fees; vehicle storage fees; bidding fees; and vehicle loading fees. These fees are recognized as net revenue (not gross vehicle selling price) at the time of auction in the amount of such fees charged. Purchased vehicle revenue includes the gross sales price of the vehicles which we have purchased or are otherwise considered to own. We have certain contracts with insurance companies, primarily in the U.K., in which we act as a principal, purchasing vehicles and reselling them for our own account. We also purchase vehicles in the open market, primarily from individuals, and resell them for our own account.\nOur revenue is impacted by several factors, including total loss frequency and the average vehicle auction selling price, as a significant amount of our service revenue is associated in some manner with the ultimate selling price of the vehicle. Vehicle auction selling prices are driven primarily by: (i) market demand for rebuildable, drivable vehicles; (ii) used car pricing, which we also believe has an impact on total loss frequency; (iii) end market demand for recycled and refurbished parts as reflected in demand from dismantlers; (iv) the mix of cars sold; (v) changes in the U.S. dollar exchange rate to foreign currencies, which we believe has an impact on auction participation by international buyers; and (vi) changes in commodity prices, particularly the per ton price for crushed car bodies, as we believe this has an impact on the ultimate selling price of vehicles sold for scrap and vehicles sold for dismantling. We cannot specifically quantify the financial impact that commodity pricing, used car pricing, and product sales mix has on the selling price of vehicles, our service revenues, or financial results. Total loss frequency is the percentage of cars involved in accidents that insurance companies salvage rather than repair and is driven by the relationship between repair costs, used car values, and auction returns. Over the past 30 years, we believe there has been an increase in overall growth in the salvage market driven by an increase in total loss frequency. This increase in total loss frequency may have been driven by changes in used car values and repair costs over the same long-term horizon, which we believe are generally trending upward. We believe the long-term trend of increases in total loss frequency will continue. In the near term changes in used car prices and repair cost are inversely related, but may impact total loss frequency and thereby affect our growth rate. Used car values are determined by many factors, including used car supply, which is tied directly to new car sales, and the average age of cars on the road. The average age of cars on the road has continued to increase, growing from 11.1 years in 2012 to 12.8 years in 2025. Repair costs are generally based on damage severity, vehicle complexity, repair parts availability, repair parts costs, labor costs, and repair shop lead times. The factors that can influence repair costs, used car pricing, and auction returns are many and varied, and we cannot predict their movements with precision.\nOperating Costs and Expenses:\nFacility operations expenses consist primarily of: (i) labor (operating personnel at facilities); (ii) transportation (miles traveled and fuel rates); (iii) facilities (maintenance, property-related taxes, rent, and insurance); (iv) other (marketing and auction-related costs); and (v) costs of vehicles sold.\n\nOther Income (Expenses).\nThe increase in total other income for fiscal 2025 of $56.3 million, or 39.5% as compared to fiscal 2024 was primarily due to higher interest income earned from U.S. Treasury Bills, gain on sale of fixed assets, and realized and unrealized foreign currency gains.\nOur effective income tax rates were 18.3% and 20.5%, for fiscal 2025 and 2024, respectively. The current and prior year’s effective tax rate was computed based on the U.S. federal statutory tax rate of 21.0%. The effective tax rate for the fiscal year ended July 31, 2025 was favorably impacted by a $55.0 million tax benefit related to the Foreign Derived Intangible Income “FDII” deduction and $36.7 million in excess tax benefits from the exercise of employee stock options and negatively impacted by $38.6 million related to state income taxes. The effective tax rate for the fiscal year ending July 31, 2024 was favorably impacted by a $47.7 million tax benefit related to the FDII deduction and $14.8 million in excess tax benefits from the exercise of employee stock options and negatively impacted by $40.6 million related to state income taxes.\nDiscussion of Fiscal Year ended July 31, 2024 compared to Fiscal Year ended July 31, 2023\nFor a discussion of fiscal 2024 as compared to fiscal 2023, please refer to Part II, Item 7, Management’s Discussion and Analysis of Financial Condition and Results of Operations in our\nfor the fiscal year ended July 31, 2024, filed with the SEC on\nLiquidity and Capital Resources\nThe following table presents a comparison of key components of our liquidity and capital resources for fiscal 2025, 2024 and 2023, excluding additional funds available to us through our Revolving Loan Facility:\nCash, cash equivalents, and restricted cash\nOperating cash flows\nInvesting cash flows\nFinancing cash flows\nCapital expenditures and acquisitions\nCash, cash equivalents, and restricted cash increased $1,266.4 million and working capital increased $1,281.7 million at July 31, 2025, as compared to July 31, 2024. Cash, cash equivalents, and restricted cash increased primarily due to cash generated from operations, proceeds from held to maturity securities, and proceeds from stock option exercises. Working capital increased primarily from cash generated from operations and timing of cash receipts and payments, partially offset by capital expenditures, investment in held to maturity securities and certain income tax benefits related to stock option exercises and timing of cash payments. Cash equivalents consisted of bank deposits, certificates of deposit, U.S. Treasury Bills, and funds invested in money market accounts, which bear interest at variable rates.\nHistorically, we have financed our growth through cash generated from operations, public offerings of common stock, equity issued in conjunction with certain acquisitions, and debt financing. Our primary source of cash generated by operations is from the collection of service fees and reimbursable advances from the proceeds of vehicle sales. We expect to continue to use cash flows from operations to finance our working capital needs and to develop and grow our business. In addition to our stock repurchase program, we are considering a variety of alternative potential uses for our remaining cash balances and our cash flows from operations. For further detail, see Notes to Consolidated Financial Statements,\nNote 9 – Long-Term Debt\nNote 12 — Stockholders’ Equity\nand under the subheading “\nOur business is seasonal as inclement weather during the winter months increases the frequency of accidents and consequently, the number of cars involved in accidents which the insurance companies salvage rather than repair. During the winter months, most of our facilities process 5% to 20% more vehicles than at other times of the year. Severe weather events, including but not limited to tornadoes, floods, hurricanes, and hailstorms, can also impact our volumes. These increased volumes require the increased use of our cash to pay out advances and handling costs of the additional business.\nWe believe that our currently available cash and cash equivalents and cash generated from operations will be sufficient to satisfy our operating and working capital requirements in the foreseeable future. We expect to acquire or develop additional locations and expand some of our current facilities in the foreseeable future. We may raise additional cash through drawdowns on our Revolving Loan Facility or issuance of additional equity to fund this expansion. Although the timing and magnitude of growth through expansion and acquisitions are not predictable, the opening of new greenfield facilities is contingent upon our ability to locate property that (i) is in an area in which we have a need for more capacity; (ii) has adequate size given the capacity needs; (iii) has the appropriate shape and topography for our operations; (iv) is reasonably close to a major road or highway; and (v) most importantly, has the appropriate zoning for our business.\nAs of July 31, 2025, $314.9 million of the $2.8 billion of cash, cash equivalents, and restricted cash was held by our foreign subsidiaries. If these funds are needed for our operations in the U.S., the repatriation of these funds could still be subject to the foreign withholding tax following the U.S. Tax Reform. However, our intent is to permanently reinvest these funds outside of the U.S. and our current plans do not require repatriation to fund our U.S. operations.\nNet cash provided by operating activities increased for fiscal 2025 as compared to fiscal 2024 due to improved cash operating results primarily from an increase in service and vehicle sales revenues, partially offset by an increase in facility operations and general and administrative expenses, and changes in operating assets and liabilities. The change in operating assets and liabilities was primarily the result of a decrease in accounts receivable of $111.4 million, vehicle pooling costs of $26.4 million, prepaid expenses and other current and non-current assets of $78.8 million, partially offset by an increase in income tax receivable of $7.1 million and decrease in income tax payable of $90.8 million.\nNet cash used in investing activities decreased for fiscal 2025 as compared to fiscal 2024 due primarily to an increase in proceeds from the sale of held to maturity securities, a reduction in the purchase of held to maturity securities and an increase in capital expenditures. Our capital expenditures are primarily related to acquiring land, opening and improving facilities, capitalized software develo",
  "item2_clean": null
}