{
  "source_file": "cpt-20241231.htm",
  "form_type": "10-K",
  "item1_clean": "Formed on May 25, 1993, Camden Property Trust, a Texas real estate investment trust (\"REIT\"), and all consolidated subsidiaries are primarily engaged in the ownership, management, development, reposition, redevelopment, acquisition, and construction of multifamily apartment communities. Unless the context requires otherwise, \"we,\" \"our,\" \"us,\" and the \"Company\" refer to Camden Property Trust and its consolidated subsidiaries. Our multifamily apartment communities are referred to as \"communities,\" \"multifamily communities,\" \"properties,\" or \"multifamily properties\" in the following discussion.\nOur annual, quarterly and current reports, proxy statements, and other information are electronically filed with the SEC. The SEC maintains a website (http://www.sec.gov) that contains reports, proxy, and information statements and other information regarding issuers that file electronically with the SEC.\nNarrative Description of Business\nAs of December 31, 2024, we owned interests in, operated, or were developing 177 multifamily properties comprised of 59,996 apartment homes across the United States. Of the 177 properties, three properties were under construction and will consist of a total of 1,138 apartment homes when completed. We also own land holdings which we may develop into communities in the future.\nOperating and Business Strategy\nWe believe producing consistent earnings growth through property operations, development and acquisitions, achieving market balance, and recycling capital are crucial factors to our success. We rely heavily on our sophisticated property management capabilities and innovative operating strategies to maximize the earnings potential of our communities.\nReal Estate Investments and Market Balance.\nWe believe we are well-positioned in our current markets and have the expertise to take advantage of new opportunities as they arise. These capabilities, combined with what we believe is a conservative financial structure, should allow us to concentrate our growth efforts toward selective opportunities to enhance our strategy of having a geographically diverse portfolio of assets which meet the requirements of our residents.\nWe continue to operate in our core markets which we believe provides an advantage due to economies of scale. We believe, where possible, it is best to operate with a strong base of properties in order to benefit from the personnel allocation and the market strength associated with managing multiple properties in the same market. However, consistent with our goal of generating sustained earnings growth, we intend to selectively dispose of properties and redeploy capital for various strategic reasons, including if we determine a property cannot meet our long-term earnings growth expectations.\nWe try to maximize capital appreciation of our properties by investing in markets characterized by conditions favorable to multifamily property appreciation. These markets generally feature the following:\nstrong economic growth leading to household formation and job growth, which in turn should support higher demand for our apartments; and\nan attractive quality of life, which may lead to higher demand and retention for our apartments and allow us to more readily grow revenue.\nSubject to market conditions, we intend to continue to seek opportunities to acquire operating communities, develop new communities, and to redevelop and reposition existing communities. We also intend to evaluate our operating property and land development portfolio and plan to continue our practice of selective dispositions as market conditions warrant and opportunities arise.\nWe expect to maintain a strong balance sheet and preserve our financial flexibility by continuing to focus on our core fundamentals which currently are generating positive cash flows from operations, maintaining appropriate debt levels and\nleverage ratios, and controlling overhead costs. We intend to meet our short-term and long-term liquidity requirements through a combination of one or more of the following: cash flows generated from operations, draws on our unsecured revolving credit facility, the use of debt and equity offerings under our automatic shelf registration statement, proceeds from property dispositions, equity issued from our at-the-market (\"ATM\") share offering programs, other unsecured borrowings, or secured mortgages.\nSophisticated Property Management\n. We believe the depth of our organization enables us to deliver quality services, promote resident satisfaction, and retain residents, thereby increasing our operating revenues and reducing our operating expenses. We manage our properties utilizing a staff of professionals and support personnel, including certified property managers, experienced apartment managers and leasing staff, and trained apartment maintenance technicians. Our on-site personnel are trained to deliver high-quality services to our residents and we strive to motivate our on-site employees through incentive compensation arrangements based upon property operational results.\nWe believe an intense focus on operations is necessary to realize consistent, sustained earnings growth. Ensuring customer satisfaction, increasing rents as market conditions allow, maximizing rent collections (subject to restrictions of applicable law), maintaining property occupancy at optimal levels, and controlling operating costs comprise our principal strategies to maximize property financial results. Lease terms are generally staggered based on vacancy exposure by apartment type such that lease expirations are matched to each property's seasonal rental patterns. Our average lease terms are approximately fourteen months, and our individual property marketing plans are structured to respond to local market conditions. In addition, we conduct ongoing customer service surveys to help ensure timely responses to customers' changing needs and a high-level of satisfaction.\nThere are numerous housing alternatives which compete with our communities in attracting residents. Our properties compete directly with other multifamily properties as well as condominiums, single-family homes, and third-party providers of short-term rentals, which are available for rent or purchase in the markets in which our communities are located. This competitive environment could have a material adverse effect on our ability to lease apartment homes or on the rents realized at our present properties or any newly-developed or acquired property.\nHuman Capital Management\nPurpose and Culture.\nWe strive to differentiate ourselves by our culture and talent. How we manage our human capital is critical to how we deliver on our strategy and create sustained growth and value for our shareholders. We strive to improve the lives of our team members, customers, and shareholders one experience at a time. We recognize a great culture is foundational to the success of this vision. Key components in managing our human capital are listed below.\nWe care deeply about our team members, our residents, and the local communities in which we live, work, and play. We are committed to maintaining a high-trust work environment which attracts, retains, and rewards the best and brightest people. We believe our workplace reflects Camden’s nine core values: Customer Focused; People Driven; Team Players; Lead by Example; Results Oriented; Work Smart; Always Do the Right Thing; Act with Integrity; and Have Fun. We believe these values cultivate an environment of respect, fairness, diversity, and fun for all.\nA Great Place to Work.\nIn addition to our core values, we are committed to creating a great working environment that fosters all team members' well-being, health, and happiness. We believe our team members are given meaningful opportunities to provide feedback and effect change. We are proud of our culture and the recognition we have received as a great place to work, including being recognized nationally as one of the 100 Best Companies to Work For® by FORTUNE magazine for 17 consecutive years, most recently ranking #24.\nCompensation and Benefits.\nWe provide high-quality health benefits and compensation to competitively compensate all team members for their contributions to Camden. We have formal programs intended to positively impact team members such as healthcare, rent discounts, education allowances, and scholarships for children of our employees.\nTraining and Development.\nOur mission, vision, and values are also incorporated into our employee training and development programs.\n\nOne of our most cherished mantras is \"Never Stop Learning.\" We encourage team members to discover their individual strengths and cultivate new interests. We offer tuition assistance to team members working to earn industry designations from various organizations. We also support team members who want to continue their education at an accredited educational institution through our Education Assistance Program. In addition to these programs, we also help employees improve their personal and professional lives through training, coaching, and mentoring. CamdenU, our in-house learning center, is available to all employees and offers courses in subjects related to leadership, management, and operations. In addition to formal training, Camden’s mentoring program supports its newest employees by pairing them with experienced employees to facilitate their on-boarding process and immerse them in Camden’s culture.\nAt December 31, 2024, we had approximately 1,660 employees including executive, community, and administrative personnel. Camden embraces all team members as full and valued members of the organization.\nQualification as a Real Estate Investment Trust\nAs of December 31, 2024, we met the qualification of a REIT under Sections 856-860 of the Internal Revenue Code of 1986, as amended (the \"Code\"). As a result, with the exception of our taxable REIT subsidiaries, we will not be subject to federal income tax to the extent we continue to meet certain requirements of the Code.",
  "item7_clean": "Item 7. Management’s Discussion and Analysis of Financial Condition and Results of Operations\nThe following discussion should be read in conjunction with the consolidated financial statements and notes appearing elsewhere in this report. Historical results and trends which might appear in the consolidated financial statements should not be interpreted as being indicative of future operations.\nWe consider portions of this report to be \"forward-looking\" within the meaning of Section 27A of the Securities Act of 1933 and Section 21E of the Exchange Act, both as amended, with respect to our expectations for future periods. Forward-looking statements do not discuss historical fact, but instead include statements related to expectations, projections, intentions, or other items relating to the future; forward-looking statements are not guarantees of future performance, results, or events. Although we believe the expectations reflected in our forward-looking statements are based upon reasonable assumptions, we can give no assurance our expectations will be achieved. Any statements contained herein which are not statements of historical fact should be deemed forward-looking statements. Reliance should not be placed on these forward-looking statements as these statements are subject to known and unknown risks, uncertainties, and other factors beyond our control and could differ materially from our actual results and performance.\nFactors which may cause our actual results or performance to differ materially from those contemplated by forward-looking statements include, but are not limited to, the following:\nVolatility in capital and credit markets, or other unfavorable changes in economic conditions, either nationally or regionally in one or more of the markets in which we operate, could adversely impact us;\nShort-term leases could expose us to the effects of declining market rents;\nWe could be negatively impacted by the risks associated with land holdings and related activities;\nDevelopment, repositions, redevelopment and construction risks could impact our profitability;\nOur acquisition strategy may not produce the cash flows expected;\nChanges in rent control or rent stabilization laws and regulations could adversely affect our operations and property values;\nFailure to qualify as a REIT could have adverse consequences;\nTax laws may continue to change at any time and any such legislative or other actions could have a negative effect on us;\nA cybersecurity incident and other technology disruptions could negatively impact our business;\nWe have significant debt, which could have adverse consequences;\nInsufficient cash flows could limit our ability to make required payments for debt obligations or pay distributions to shareholders;\nIssuances of additional debt may adversely impact our financial condition;\nWe may be unable to renew, repay, or refinance our outstanding debt;\nRising interest rates could increase our borrowing costs, lower the value of our real estate, and decrease our share price, leading investors to seek higher yields through other investments;\nFailure to maintain our current credit ratings could adversely affect our cost of funds, related margins, liquidity, and access to capital markets;\nShare ownership limits and our ability to issue additional equity securities may prevent takeovers beneficial to shareholders;\nThe form, timing, and amount of dividend distributions in future periods may vary and be impacted by economic and other considerations;\nLitigation risks could affect our business;\nDamage from catastrophic weather and other natural events could result in losses;\nCompetition could adversely affect our ability to acquire properties; and\nWe could be adversely impacted due to our share price fluctuations.\nThese forward-looking statements represent our estimates and assumptions as of the date of this report, and we assume no obligation to update or supplement forward-looking statements because of subsequent events.\nWe are primarily engaged in the ownership, management, development, reposition, redevelopment, acquisition, and construction of multifamily apartment communities. Overall, we focus on investing in markets characterized by high-growth economic conditions, strong employment, and attractive quality of life which we believe leads to higher demand and retention of our apartments. As of December 31, 2024, we owned interests in, operated, or were developing 177 multifamily properties comprised of 59,996 apartment homes across the United States as detailed in the Property Portfolio table below. In addition, we own other land holdings which we may develop into multifamily apartment communities in the future.\nBusiness Environment and Current Outlook\nOur results for the year ended December 31, 2024, reflect an increase in same store revenues of approximately 1.3% as compared to the same period in 2023. The increase was due to higher rental income as a result of higher average rental rates and lower uncollectible revenue, which we believe was primarily attributable to job growth, favorable demographics with a higher propensity to rent versus buy, and continued demand for multifamily housing in our markets.\nWe believe the levels of new multifamily supply in the submarkets and asset classes in which we operate will continue to be elevated into 2025 but should be met with continued demand to absorb these new deliveries. However, if this were to change or other economic conditions were to worsen, our operating results could be adversely affected.\nConsolidated Results\nNet income attributable to common shareholders was $163.3 million and $403.3 million for the years ended December 31, 2024 and December 31, 2023, respectively. The decrease during the year ended December 31, 2024 as compared to the same period in 2023 was primarily due to recognizing a higher gain on sale of two operating properties in 2023 of $225.4 million as compared to recognizing a gain on sale of one operating property in 2024 of $43.8 million. The decrease was also due to recognizing a $41.0 million impairment associated with land development activities in 2024 and no impairments recognized in 2023. See further discussion of our 2024 operations as compared to 2023 in\n\"Results of Operations,\"\nConstruction and Development Activity\nAt December 31, 2024, we had a total of three projects under construction to be comprised of 1,138 apartment homes. Initial occupancies of these three projects are currently scheduled to occur within the next two years. As of December 31, 2024, we estimated the total additional cost to complete the construction of these three properties is approximately $243.6 million.\nIn the third quarter of 2024, we stopped development activities for the foreseeable future on four of our developments and recorded approximately $41.0 million of impairment charges on three of these land parcels. We review our long-lived assets on an annual basis or whenever events or circumstances indicated the carrying amount of an asset may not be recoverable and our impairment evaluations take into consideration the current and anticipated economic climate. We currently have three other land parcels held for future development we plan to develop, and the commencement of future developments may be impacted by macroeconomic issues, multifamily market conditions, and other factors. We will continue to evaluate future development starts based on market, economic, and capital market conditions. There can be no assurance we will not have impairments charges in the future.\nIn February 2024, we sold one operating property comprised of 592 apartment homes located in Atlanta, Georgia, for approximately $115.0 million and recognized a gain of approximately $43.8 million.\nCapital Market Highlights\nIn January 2024, we issued $400.0 million of 4.90% senior unsecured notes due January 15, 2034. We utilized a portion of the net proceeds from these notes to repay the outstanding balance on our $300.0 million, 6.21% unsecured term loan due in August 2024. As a result of this early repayment of the $300.0 million unsecured term loan, we expensed approximately $0.9 million of unamortized loan costs, which are reflected in the loss on early retirement of debt in our consolidated statements of income and comprehensive income.\nIn September 2024, we extended the maturity date of our $40.0 million unsecured floating rate term loan with an unrelated third party from September 2024 to September 2026.\nDuring the year ended December 31, 2024, we utilized cash on hand and our unsecured revolving credit facility to repay unsecured notes payable totaling $500.0 million, plus accrued interest.\nDuring the year ended December 31, 2024, we repurchased 515,974 common shares for approximately $50.0 million at an average price of $96.88 per share under our $500.0 million share repurchase plan. As of the date of this filing, the remaining dollar value of our common equity securities authorized to be repurchased under this plan was approximately $450.0 million.\nIn January 2025, we purchased one operating property comprised of 352 homes located in the Austin, Texas metropolitan area for approximately $67.7 million.\nSubject to market conditions, we intend to continue to seek opportunities to acquire operating communities, develop new communities, and to redevelop and reposition existing communities. We also intend to evaluate our operating property and land development portfolios and plan to continue our practice of selective dispositions as market conditions warrant and opportunities arise. We expect to maintain a strong balance sheet and preserve our financial flexibility by continuing to focus on our core fundamentals which currently are generating positive cash flows from operations, maintaining appropriate debt levels and leverage ratios, and controlling overhead costs. We intend to meet our short-term and long-term liquidity requirements through a combination of one or more of the following: cash flows generated from operations, draws on our unsecured revolving credit facility, the use of debt and equity offerings under our automatic shelf registration statement, proceeds from property dispositions, equity issued from our ATM programs, other unsecured borrowings, or secured mortgages.\nAs of December 31, 2024, we had approximately $1.0 billion available under our $1.2 billion unsecured revolving credit facility and do not have any debt maturing until April 2026. As of December 31, 2024, and through the date of this filing, we also had common shares having an aggregate offering price of up to $500.0 million remaining available for sale under our 2023 ATM program. We believe we are well-positioned with a strong balance sheet and sufficient liquidity to fund new development, redevelopment, and other capital funding requirements. We will, however, continue to assess and take further actions we believe are prudent to meet our objectives and capital requirements.\nOur multifamily property portfolio is summarized as follows:\n\nextending and sequencing the maturity dates of our debt where practicable;\nmanaging interest rate exposure using what management believes to be prudent levels of fixed and floating rate debt;\nmaintaining what management believes to be conservative coverage ratios; and\nusing what management believes to be a prudent combination of debt and equity.\nOur interest expense coverage ratio, net of capitalized interest, was approximately 6.9 and 6.8 times for the years ended December 31, 2024 and 2023, respectively. This ratio is a method for calculating the amount of operating cash flows available to cover interest expense and is calculated by dividing interest expense for the period into the sum of property revenues and expenses, non-property income, and other expenses after adding back depreciation, amortization, and interest expense. Approximately 89.9% and 89.8% of our properties were unencumbered at December 31, 2024 and 2023, respectively. Our weighted average maturity of debt was approximately 6.2 years at December 31, 2024.\nWe also intend to strengthen our capital and liquidity positions by continuing to focus on our core fundamentals, which currently are generating positive cash flows from operations, maintaining appropriate debt levels and leverage ratios, and controlling overhead costs.\nOur primary source of liquidity is cash flows generated from operations. Other sources may include one or more of the following: availability under our unsecured revolving credit facility, the use of debt and equity offerings under our automatic shelf registration statement, proceeds from property dispositions, equity issued from our 2023 ATM program, and other\nunsecured borrowings or secured mortgages. We believe our liquidity and financial condition are sufficient to meet all of our reasonably anticipated cash needs over the next 12 months including:\nnormal recurring operating expenses;\ncurrent debt service requirements, including scheduled debt maturities;\nrecurring and non-recurring capital expenditures;\nfunding of property developments, repositions, redevelopments, and acquisitions; and\nthe minimum dividend payments required to maintain our REIT qualification under the Code.\nFactors which could increase or decrease our future liquidity include but are not limited to volatility in capital and credit markets, changes in rent control or rent stabilization laws, sources of financing, the minimum REIT dividend requirements, our ability to complete asset purchases, sales, or developments, the effect our debt level and changes in credit ratings could have on our cost of funds, and our ability to access capital markets.\nThe following is a discussion of our cash flows for the years ended December 31, 2024 and 2023.\nNet cash from operating activities was approximately $774.9 million during the year ended December 31, 2024 as compared to approximately $795.0 million during the year ended December 31, 2023. The decrease was primarily due to a decrease in cash from property operations due to the sale of two operating properties in 2023 and one operating property in 2024, and higher real estate tax payments in 2024 as compared to 2023. The decrease was partially offset by the growth attributable to our same store and non-same store communities. See further discussions of our 2024 operations as compared to 2023 in\n\"Results of Operations.\"\n\nNet cash used in investing activities during the year ended December 31, 2024 totaled approximately $285.2 million as compared to $127.1 million during the year ended December 31, 2023. Cash outflows during 2024 primarily related to amounts paid for property development and capital improvements of approximately $393.7 million, partially offset by net proceeds from the sale of one operating property of approximately $114.5 million. Cash outflows during 2023 primarily related to the amounts paid for property development and capital improvements of approximately $410.9 million, partially offset by net proceeds from the sale of two operating properties of approximately $290.7 million. The decrease in property development and capital improvements for 2024, as compared to the same period in 2023, was primarily due to lower property development expenditures in 2024 as compared to 2023. The property development and capital improvements during 2024 and 2023, included the following:\nExpenditures for new development, including land\nCapital expenditures\nReposition expenditures\nDirect real estate taxes and capitalized interest and other indirect costs\nNet cash used in financing activities totaled approximately $725.5 million during the year ended December 31, 2024 as compared to approximately $417.2 million during the year ended December 31, 2023. Cash outflows during 2024 primarily related to the repayment of our $250 million senior unsecured notes in September 2024 and the repayment of our $300 million unsecured term loan and the $250 million senior ",
  "item2_clean": null
}