{
  "source_file": "cpt-20250930.htm",
  "form_type": "10-Q",
  "item1_clean": null,
  "item7_clean": null,
  "item2_clean": "Item 2. Management's Discussion and Analysis of Financial Condition and Results of Operations\nWe consider portions of this report to be \"forward-looking\" within the meaning of Section 27A of the Securities Act of 1933 (the \"Securities Act\") and Section 21E of the Securities Exchange Act of 1934 (the \"Exchange Act\"), both as amended, with respect to our expectations for future periods. Forward-looking statements do not discuss historical facts, but instead include statements related to expectations, projections, intentions, or other items relating to the future; forward-looking statements are not guarantees of future performance, results, or events. Although we believe the expectations reflected in our forward-looking statements are based upon reasonable assumptions, we can give no assurance our expectations will be achieved. Any statements contained herein which are not statements of historical fact should be deemed forward-looking statements. Reliance should not be placed on these forward-looking statements as these statements are subject to known and unknown risks, uncertainties, and other factors beyond our control and could differ materially from our actual results and performance.\nFactors which may cause our actual results or performance to differ materially from those contemplated by forward-looking statements include, but are not limited to, the following:\nVolatility in capital and credit markets, or other unfavorable changes in economic conditions, either nationally or regionally in one or more of the markets in which we operate, could adversely impact us;\nShort-term leases could expose us to the effects of declining market rents;\nWe could be negatively impacted by the risks associated with land holdings and related activities;\nDevelopment, repositions, redevelopment, and construction risks could impact our profitability;\nOur acquisition strategy may not produce the cash flows expected;\nChanges in rent control or rent stabilization laws and regulations could adversely affect our operations and property values;\nFailure to qualify as a REIT could have adverse consequences;\nTax laws could continue to change at any time and any such legislative or other actions could have a negative effect on us;\nA cybersecurity incident and other technology disruptions could negatively impact our business;\nWe have significant debt, which could have adverse consequences;\nInsufficient cash flows could limit our ability to make required payments for debt obligations or pay distributions to shareholders;\nIssuances of additional debt may adversely impact our financial condition;\nWe may be unable to renew, repay, or refinance our outstanding debt;\nRising interest rates could increase our borrowing costs, lower the value of our real estate, and decrease our share price, leading investors to seek higher yields through other investments;\nFailure to maintain our current credit ratings could adversely affect our cost of funds, related margins, liquidity, and access to capital markets;\nShare ownership limits and our ability to issue additional equity securities may prevent takeovers beneficial to shareholders;\nThe form, timing, and amount of dividend distributions in future periods may vary and be impacted by economic and other considerations;\nLitigation risks could affect our business;\nDamage from catastrophic weather and other natural events could result in losses;\nCompetition could adversely affect our ability to acquire properties; and\nWe could be adversely impacted due to our share price fluctuations.\nThese forward-looking statements represent our estimates and assumptions as of the date of this report, and we assume no obligation to update or supplement forward-looking statements because of subsequent events.\nCamden Property Trust and all consolidated subsidiaries are primarily engaged in the ownership, management, development, reposition, redevelopment, acquisition, and construction of multifamily apartment communities. We focus on investing in markets characterized by high-growth economic conditions, strong employment, and attractive quality of life which we believe leads to higher demand for our apartments and retention of our residents. As of September 30, 2025, we owned\ninterests in, operated, or were developing 177 multifamily properties comprised of 60,578 apartment homes across the United States. In addition, we own other land holdings which we may develop into multifamily apartment communities in the future.\nBusiness Environment and Current Outlook\nOur results for the three and nine months ended September 30, 2025 reflect an increase in same store revenues of approximately 0.8% and 0.9%, respectively, as compared to the same periods in 2024. The increases were primarily due to higher occupancy, which we believe was primarily attributable to favorable demographics with a higher propensity to rent versus buy and continued demand for multifamily housing in our markets.\nWe believe the levels of new multifamily supply in the submarkets and asset classes in which we operate are manageable and these moderating levels of supply should be met with continued demand to absorb these new deliveries. However, if this were to change or other economic conditions were to worsen, our operating results could be adversely affected.\nConsolidated Results\nNet income (loss) attributable to common shareholders was $108.9 million and $(4.2) million for the three months ended September 30, 2025 and 2024, respectively, and was $228.4 million and $122.6 million for the nine months ended September 30, 2025 and 2024, respectively. The $113.1 million and $105.8 million increases during the three and nine months ended September 30, 2025, as compared to the same periods in 2024 were primarily due to increases in gains on sales of operating properties, as well as the recognition of a $41.0 million impairment charge in 2024 associated with land development activities. These increases were partially offset by higher depreciation expense and the amortization of in-place leases relating to the acquisition of three operating properties completed during the nine months ended September 30, 2025. See further discussion of our 2025 operations as compared to 2024 in\n\"Results of Operations,\"\nConstruction and Development Activity\nAt September 30, 2025, we had a total of three properties under construction comprising 1,162 apartment homes. As of September 30, 2025, we estimated the total additional cost to complete the construction of these three properties was approximately $269.1 million.\nDuring the nine months ended September 30, 2025, we purchased the following operating properties:\nCamden West Nashville\nNashville, Tennessee\nDuring the nine months ended September 30, 2025, we sold the following operating properties:\nCamden Royal Oaks I & II\nIn February 2025, we established a commercial paper program under which we may issue the commercial paper notes (the \"Notes\") under the exemption from registration contained in Section (4)(a) of the Securities Act. Amounts available under the commercial paper program may be borrowed, repaid, and reborrowed from time to time, with the aggregate face or principal amount of the Notes outstanding under the Program at any time not to exceed $600.0 million. At September 30, 2025, we had an aggregate of $429.6 million principal amount of Notes outstanding under the commercial paper program which had a weighted average interest rate of 4.21%.\n\nImpairment associated with land development activities\nLoss on early retirement of debt\nGain on sale of operating properties\nThe impairment associated with land development activities for the three and nine months ended September 30, 2024, of approximately $41.0 million, related to three projects which were put on hold. These impairment charges represent the difference between each parcel's estimated fair value and its carrying value, which included the original purchase price and other capitalized development costs.\nThe $0.9 million loss on early retirement of debt for the nine months ended September 30, 2024 was due to the write-off of unamortized loan costs related to the early retirement of our $300 million unsecured term loan in January 2024, which was scheduled to mature in August 2024.\nDuring the three months ended September 30, 2025, we recognized an aggregate $85.6 million gain related to the disposition of one dual-phased operating property located in Houston, Texas and one operating property located in Irving, Texas. During the nine months ended September 30, 2025 we also recognized a $47.3 million gain related to the disposition of one operating property located in Houston, Texas in June 2025. The $43.8 million gain on sale for the nine months ended September 30, 2024 was due to the disposition of one operating property located in Atlanta, Georgia in February 2024.\nIncome tax expense increased approximately $0.4 million and $0.2 million for the three and nine months ended September 30, 2025, respectively, as compared to the same periods in 2024. The increases were primarily due to higher taxable income resulting from increased third-party construction activities within a taxable REIT subsidiary. Additionally, for the three months ended September 30, 2025, state and franchise income tax expenses were higher as compared to the same period in 2024 primarily due to tax legislation changes enacted in certain state jurisdictions in 2024.\nFunds from Operations (\"FFO\"), Core FFO, and Core Adjusted FFO (\"Core AFFO\")\nManagement considers FFO, Core FFO, and Core AFFO to be appropriate supplementary measures of the financial performance of an equity REIT. The National Association of Real Estate Investment Trusts (\"NAREIT\") currently defines FFO as net income (calculated in accordance with GAAP), excluding depreciation and amortization related to real estate, gains and\nlosses from the sale of certain real estate assets, gains and losses from change in control, impairment write-downs of certain "
}