{
  "source_file": "crm-20250731.htm",
  "form_type": "10-Q",
  "item1_clean": null,
  "item7_clean": null,
  "item2_clean": "Six Months Ended July 31,\nProvision for income taxes\nWe recorded a tax provision of $519 million and $408 million for the three months ended July 31, 2025 and 2024, respectively, and a tax provision of $952 million and $742 million for the six months ended July 31, 2025 and 2024, respectively. Our year-to-date effective tax rate increased from a year ago primarily due to lower excess tax benefits from stock-based compensation. The effective tax rate may fluctuate due to changes in our domestic and foreign earnings, or material discrete tax items, or a combination of these factors resulting from transactions or events, including, for example, acquisitions, changes to our operating structure, and other macroeconomic factors.\nOn July 4, 2025, the One Big Beautiful Bill Act (“OBBBA”) was enacted into law. The OBBBA includes significant changes to US corporate tax provisions of the Tax Cuts and Jobs Act. Notably, it allows an immediate deduction for domestic research and development expenditures, reinstates 100% bonus depreciation, and modifies the international tax framework. The legislation has multiple effective dates, with certain provisions effective in fiscal 2026 and others in the subsequent years. The changes had an immaterial impact to the Company’s tax provision for the period ended July 31, 2025.\nThe Company may record additional impacts to its tax provision in the subsequent quarters as it continues to analyze the new law, other factors such as changes from its business operations, financial results and forecasts, and interrelated items including changes to our valuation allowance assessment related to Corporate Alternative Minimum Tax (“CAMT”) credits.\nLiquidity and Capital Resources\nAt July 31, 2025, our principal sources of liquidity were cash, cash equivalents and marketable securities totaling $15.4 billion and accounts receivable of $5.6 billion. Our cash equivalents and marketable securities are comprised primarily of corporate notes and obligations, U.S. treasury securities, U.S. agency obligations, asset-backed securities, foreign government obligations, mortgage-backed obligations, covered bonds, time deposits, money market mutual funds and municipal securities. Our Revolving Loan Credit Agreement (as defined below), which provides the ability to borrow up to $5.0 billion in unsecured financing (the “Credit Facility”) as of July 31, 2025, also serves as a source of liquidity.\nNet cash provided by operating activities could continue to be affected by various risks and uncertainties, including, but not limited to, the risks detailed in Part II, Item 1A, “Risk Factors.” We believe our existing cash, cash equivalents, marketable securities, cash provided by operating activities, unbilled amounts related to contracted noncancellable subscription agreements, which are not reflected on the balance sheet, and, if necessary, our borrowing capacity under our Credit Facility will be sufficient to meet our working capital, capital expenditure and debt maintenance needs over the next 12 months and thereafter.\nIn the future, we may enter into arrangements to acquire or invest in complementary businesses, services, technologies and intellectual property rights. To facilitate these acquisitions or investments, we may seek additional equity or debt financing, which may not be available on terms favorable to us or at all, impacting our ability to complete subsequent acquisitions or investments. For example, we entered into certain credit agreements in connection with our pending acquisition of Informatica. See discussion in “Debt” below.\nWe expect lower cash taxes primarily due to the immediate deduction of domestic research and development expenditures allowed by the OBBBA.\n\nRemaining Performance Obligation:\nTotal remaining performance obligation, which represents all future revenue under contract yet to be recognized, as of July 31, 2025 was approximately\n$59.9 billion, an increase of 12 percent year-over-year\n. Current remaining performance obligation as of July 31, 2025 was approximately\nShare Repurchase Program:\nDuring the six months ended July 31, 2025, we repurchased approximately 18 million shares of our common stock for approximately $4.9 billion.\n: During the six months ended July 31, 2025, we paid approximately $801 million in dividends and dividend equivalents.\nPending Informatica Acquisition:\nDuring the six months ended July 31, 2025, we announced our pending acquisition of Informatica, an AI-powered enterprise cloud data management platform, which is expected to close in the fourth quarter of fiscal 2026 or early fiscal 2027, subject to the satisfaction of customary closing conditions, including regulatory approvals, for an estimated $8.0 billion, net of the Company’s current investment in Informatica.\nOver the first half of fiscal 2026, we continued to see strong momentum in Data Cloud, Agentforce and our broader AI service offerings. As we have a diversified portfolio of products and a customer base across various geographies, segments and industries, demand for our offerings has remained relatively resilient in a changing economic environment.\nIn addition, the expanding global scope of our business and the heightened volatility of global markets expose us to the risk of fluctuations in foreign currency markets. Total revenues in the six months ended July 31, 2025 were minimally impacted by foreign currency fluctuations compared to the six months ended July 31, 2024. Our current remaining performance obligation growth as of July 31, 2025 compared to July 31, 2024 was positively impacted by one percent compared to what would have been reported using constant currency rates. The impact of foreign currency fluctuations could impact our near-term results and ability to accurately predict our future results and earnings. The impact of these fluctuations can also be compounded by the seasonality of our business in which our fourth quarter has historically been our strongest quarter for new business and renewals.\nOur fiscal year ends on January 31. References to fiscal 2026, for example, refer to the fiscal year ending January 31, 2026.\nWe operate as one segment. See Note 1 “Summary of Business and Significant Accounting Policies” to the condensed consolidated financial statements for further discussion.\nWe derive our revenues from two sources: (1) subscription and support revenues and (2) professional services and other revenues. Subscription and support revenues accounted for approximately\nof our total revenues for the six months ended July 31, 2025.\nSubscription and support revenues primarily include subscription fees from customers accessing our enterprise cloud computing services (collectively, “Cloud Services”), software license revenues from the sales of term software licenses, and support revenues from the sale of support and updates beyond the basic subscription fees or related to the sales of software licenses. Our Cloud Services allow customers to use our multi-tenant software without taking possession of the software. Revenue is generally recognized ratably over the contract term. Subscription and support revenues also include revenues associated with term software licenses that provide the customer with a right to use the software as it exists when made available. Revenues from term software licenses are generally recognized at the point in time when the software is made available to the customer. Revenue from support and updates is recognized as such support and updates are provided, which is generally ratably over the contract term. Changes in contract duration for multi-year term software licenses can impact the amount of revenues recognized upfront. Revenues from term software licenses represent less than\nof total subscription and support revenue for the three and six months ended July 31, 2025.\nThe revenue growth rates of each of our service offerings, as described below in “Results of Operations,” fluctuate from quarter to quarter and over time. Additionally, we manage the total balanced product portfolio to deliver solutions to our\ncustomers and, as a result, the revenue result for each offering is not necessarily indicative of the results to be expected for any subsequent quarter. In addition, some of our Cloud Service offerings have similar features and functions. For example, customers may use our Sales, Service or Platform service offerings to record account and contact information, which are similar features across these service offerings. Depending on a customer’s actual and projected business requirements, more than one service offering may satisfy the customer’s current and future needs. We record revenue based on the individual products ordered by a customer, not according to the customer’s business requirements and usage.\nOur growth in revenues is also impacted by attrition. Attrition represents the reduction or loss of the annualized value of our contracts with customers. We calculate our attrition rate at a point in time on a trailing twelve-month basis as of the end of each month. In general, we exclude service offerings from acquisitions from our attrition calculation until they are fully integrated into our customer success organization. As of July 31, 2025, our attrition rate, excluding Slack self-service, was approximately eight percent.\nWe continue to maintain a variety of customer programs and initiatives, which, along with increasing enterprise adoption, have helped keep our attrition rate consistent as compared to the prior year. Consistent attrition rates play a role in our ability to maintain growth in our subscription and support revenues.\nSeasonal Nature of Unearned Revenue, Accounts Receivable and Operating Cash Flow\nUnearned revenue primarily consists of billings to customers for our subscription service. Over 90 percent of the value of our billings to customers is for our subscription and support service. We generally invoice our customers in advance, in"
}