{
  "source_file": "csco-20250726.htm",
  "form_type": "10-K",
  "item1_clean": "Cisco designs and sells a broad range of technologies that help to power, secure, and draw insights from the Internet. We are incorporating artificial intelligence (AI) into our product portfolios across networking, security, collaboration and observability as well as integrating our products more tightly together. We are simplifying how our technology is delivered, managed and optimized and helping customers maximize the business value of their technology investments.\nWe conduct our business globally and manage our business by geography. Our business is organized into the following three geographic segments: Americas; Europe, Middle East, and Africa (EMEA); and Asia Pacific, Japan, and China (APJC).\nOur products and technologies are grouped into the following categories: Networking, Security, Collaboration and Observability. In addition to our product offerings, we provide a broad range of services over the lifecycle of our products, including technical support services and advanced services. Our customers include businesses of all sizes, public institutions, governments, and service providers, including large webscale providers. These customers often look to us as a strategic partner to help them use information technology (IT) to differentiate themselves and drive positive business outcomes.\nStrategy and Priorities\nIn today's digital-first world, businesses and organizations globally are deploying technology to pursue their strategic objectives, from accelerating growth to enhancing operational efficiency and fostering innovation. Our strategy is to securely connect everything to make those desired outcomes possible.\nOur customers have three key priorities in this dynamic environment: i) to build modern infrastructure; ii) to protect against the cyber threats of today and tomorrow; and iii) to harness the power of AI and data. Cisco is at the forefront of this evolution, developing innovative solutions that leverage advanced AI to deliver more valuable outcomes for our customers.\nModern Infrastructure\nIn an increasingly digital and connected world, where each new connection to the Internet puts more demand on the network, our customers are investing in resilient, adaptable infrastructure to quickly respond to market changes and the demands of their own customers. Now more than ever it is crucial for businesses to remain competitive while managing resource constraints. Our customers continue to focus on modernizing their infrastructure with a focus on speed, agility, productivity, innovation and energy efficien\nWith the rapid growth in AI, modern applications, hyper-distributed architecture and increasingly sophisticated cyberattacks, customers see cybersecurity as a top priority. Our differentiated security strategy is based on three pillars: moving from point solutions to a platform comprehensively integrated with the infrastructure; infusing security into the fabric of the network; and harnessing the depth and breadth of telemetry data from Cisco and with our acquisition of Splunk Inc. (“Splunk”) to prevent, detect, and respond to sophisticated attacks.\nAI represents a generational shift in technology and the advent of AI agents is driving an order of magnitude higher requirement for network connectivity. We provide network infrastructure to power AI training and inference workloads for both webscale providers and enterprises. We help to scale our customers’ network infrastructure with high-density routers and switches, improved network management, and high-performance optics. We are reinventing data center operations for our customers by simplifying the configuration, monitoring, and maintenance of fabrics, compute, networking and storage.\nWe can help give customers visibility across the network, security solutions, applications and their own business data. With this breadth and scale of data, we can help deliver differentiated insights and context to customers, leading them to more informed proactive decisions and better business results.\nThese three customer priorities drive our innovation and technology, making them our priorities as well. To help deliver on them, we are bringing together the power of our portfolio, which we refer to as One Cisco, which provides three key outcomes to our customers: i) AI-ready data centers, ii) future-proofed workplaces, and iii) digital resilience.\nAI-Ready Data Centers\nWe are transforming data centers to power AI workloads anywhere. Whether customers need to modernize parts of their existing infrastructure or power new, massive AI workloads, Cisco brings together a wide array of infrastructure (across networking, compute, storage, and silicon) with unified management across traditional and AI workloads, and security from on-premise to cloud to power AI-ready data centers.\nFuture-Proofed Workplaces\nCisco helps deliver \"future-proofed\" workplaces, modernizing how people and technology work and serve their customers. This includes environments ranging from factory floors with plant workers and robots to hospitals with healthcare workers, as well as to social workers and salespeople on the move. For secure campus and branch networking, we offer a flexible range of solutions that help ensure secure, reliable connections for users and devices. Our smart building technology turns network devices into sensors for enhanced intelligence and control of physical spaces. To support productivity, we provide collaboration devices and software to enable collaboration no matter where people work.\nWe help to keep the data center, workplace, and entire IT environment securely up and running in the face of any disruption. Our network assurance capabilities, powered by ThousandEyes, are integrated throughout our portfolio. This technology helps ensure seamless connectivity and optimal digital experiences across cloud, Internet, and enterprise networks, for the delivery of applications and services. Our observability solution monitors the entire enterprise to help prevent downtime and improve experiences across networks, infrastructures, and applications. Additionally, Cisco provides robust security measures for threat prevention, detection, investigation, and response for organizations of any size and security maturity.\nCisco enables enterprises and service providers to deliver highly secure connectivity from workplaces to data centers worldwide. Our strength lies in our ability to deliver unified architecture with integrated, end-to-end solutions to help simplify complex challenges. These capabilities are accelerated with Cisco AI, enhancing outcomes for customers globally.\nFor a discussion of the risks associated with our Strategy and Priorities, see “Item 1A. Risk Factors,” including the risk factor entitled “We depend upon the development of new products and services, and enhancements to existing products and services, and if we fail to predict and respond to emerging technological trends and customers’ changing needs, our operating results and market share may suffer.” For information regarding sales of our major products and services, see Note 19 to the Consolidated Financial Statements.\nProducts and Services\nOur products and services are grouped into the following categories:\nOur networking business is built on a foundation of industry-leading technologies, including switching, routing, wireless, and servers, offered through a comprehensive suite of both hardware and software solutions. This portfolio, which features software licenses and software-as-a-service (SaaS) offerings, empowers customers to build, automate, modernize, and transform their network infrastructure to meet the demands of a rapidly evolving digital landscape. A central pillar of our networking strategy is the seamless convergence of our on-premise solutions with our cloud-managed offerings. By integrating these capabilities across our networking portfolio, we aim to deliver continuous value to our customers through enhanced flexibility, scalability, and operational efficiency. This unified approach positions us to address the diverse needs of businesses as they transition to hybrid and cloud-first environments.\nOur switching portfolio encompasses campus switching as well as data center switching offerings. Our campus switching offerings provide the foundation for converged data, voice, video, and Internet of Things (IoT) services. These switches offer enhanced security and reliability and are designed to scale efficiently as our customers grow. Within campus switching, our Catalyst 9000 family of switches includes hardware with embedded software, along with a software subscription referred to as Cisco DNA. Cisco DNA provides automation, analytics and security features which can be centrally monitored, managed, and configured. Also, within campus switching we have a range of Meraki cloud-managed switches for customers who prefer ease of management in lean-IT environments. Our switching portfolio now also includes the newly launched Cisco Smart Switches — Cisco 9350 and Cisco 9610— which represent the next generation of enterprise networking. These switches are AI-ready with advanced telemetry and assurance capabilities. They are built on Cisco Silicon One (which is our single, unified, and scalable networking silicon architecture) and are equipped with quantum-resistant security and post-quantum cryptography to protect against future threats. They also offer flexibility for one hardware to be managed via either the Cisco Catalyst Center or Meraki Dashboard user interface.\nOur data center switching offerings, led by the Nexus 9000 series, provide the foundation for mission critical data centers with high availability, scalability, and security across traditional data centers and private and public cloud data centers. We continue to add greater visibility and analytics across our networks and applications, enabling us to deliver better experiences for our customers. During fiscal 2025, we introduced the Cisco N9300 Series Smart Switches with a new class of intelligent networking silicon alongside embedded Data Processing Units (DPUs), representing our new vision for AI data center designs. Complex data processing tasks can be offloaded to the DPUs on the switch to improve both network architecture and the security posture. Cisco Hypershield, our cloud-native and AI-powered approach to highly distributed security for AI-scale data centers that is built into the fabric of the network, is the first service offering available embedded on these new switches. This helps to narrow the gap between security and networking layers by converging them into a single solution.\nThe Internet Infrastructure portion of this portfolio includes AI Infrastructure solutions for service provider customers, including our webscale customers. We are focused on transforming connectivity to the Internet and the cloud environment by efficiently meeting the growing demand for low-latency and higher speeds. Our routed optical networking systems and our pluggable optic solutions allow us to transform the economics of building and operating networks for our service provider customers. Our Cisco 8000 series routers, which are based on Cisco Silicon One, provide broad capacity in high-density designs, allowing our customers to reduce operational footprints, lower carbon emissions, and transition to more efficient network architectures.\nWe also have enterprise routing solutions which interconnect public and private wireline and mobile networks, delivering highly secure and reliable connectivity to campus, data center and branch networks. These offerings are designed to meet the scale, reliability, and security needs of customers of any size.\nOur wireless solutions deliver robust indoor and outdoor coverage, supporting seamless roaming for voice, video, and data applications. With a product portfolio that includes both on-premises and cloud-managed wireless access points and controllers, we provide customers w",
  "item7_clean": "Percentages may not recalculate due to rounding.\nCISCO SYSTEMS, INC.\nMANAGEMENT’S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS (Continued)\nFiscal 2025 Compared with Fiscal 2024\nIn fiscal 2025, we delivered strong revenue growth across all geographies and solid margins as we saw a positive demand environment. Total revenue increased by 5% compared with fiscal 2024. Our results for fiscal 2025 include a full year of Splunk's results compared to approximately four months for fiscal 2024. Within total revenue, product revenue increased by 6% and services revenue increased by 3%. In fiscal 2025, total software revenue was $22.3 billion, an increase of 21%, driven by the contribution of Splunk. Total subscription revenue increased 15%, driven by the contribution of Splunk.\nTotal gross margin increased by 0.2 percentage points. Product gross margin increased by 0.2 percentage points, driven by benefits from Splunk and productivity improvements, partially offset by negative impacts from pricing, a charge as a result of a legal dispute with a supplier, and the amortization of purchased intangible assets primarily related to Splunk. As a percentage of revenue, research and development, sales and marketing, and general and administrative expenses, collectively, increased by 1.8 percentage points. Operating income as a percentage of revenue decreased by 1.8 percentage points primarily due to increases in amortization of purchased intangible assets and share-based compensation expense in fiscal 2025, and a charge in the fourth quarter of fiscal 2025 as a result of a legal dispute with a supplier. Diluted earnings per share was flat compared with fiscal 2024.\nIn terms of our geographic segments, revenue from the Americas increased by $1.7 billion, EMEA revenue increased by $0.7 billion and revenue in our APJC segment increased by $0.5 billion. From a customer market perspective, product revenue growth was led by the enterprise market and the service provider and cloud market. The revenue increase in our service provider and cloud market was driven by AI infrastructure revenue from webscale customers. From a product category perspective, the product revenue increased 6% year over year, driven by a growth in revenue in Security of 59%, Observability of 26%, and Collaboration of 1%, partially offset by a decline in Networking of 3%. The product revenue growth in Security and Observability were each driven in large part by the contribution of Splunk.\nWe continue to operate in a highly competitive environment, and one that is complex especially with respect to tariffs and trade policy. We plan to continue to invest in key priority areas with the objective of driving profitable growth over the long term. We remain focused on delivering innovation across our technologies to assist our customers in executing on their digital transformations and on accelerating innovation across our portfolio. We believe that we are making progress on our strategic priorities.\nCISCO SYSTEMS, INC.\nMANAGEMENT’S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS (Continued)\nFourth Quarter Snapshot\nFor the fourth quarter of fiscal 2025, as compared with the fourth quarter of fiscal 2024, total revenue increased by 8%. Within total revenue, product revenue increased by 10% and services revenue was flat. With regard to our geographic segment performance, on a year-over-year basis, revenue in Americas increased by 9%, EMEA increased by 4% and APJC increased by 7%. From a product category perspective, we experienced product revenue growth in Networking, Security, Observability, and Collaboration\nTotal gross margin decreased by 1.2 percentage point\ns, driven primarily by a charge as a result of a legal dispute with a supplier. As\na percentage of revenue, research and development, sales and marketing, and general and administrative expenses, collectively, decreased by 2.2 percentage points. Operating income as a percentage of revenue increased by 1.8 percentage points primarily driven by lower amortization of purchased intangible assets, lower restructuring and other charges, and a decrease in cash compensation expenses from acquisitions, partially offset by a charge as a result of a legal dispute with a supplier. Diluted earnings per share increased by 19%, primarily driven by the revenue increase and the increase in our operating margin percentage.\nStrategy and Priorities\nIn today's digital-first world, businesses and organizations globally are deploying technology to pursue their strategic objectives, from accelerating growth to enhancing operational efficiency and fostering innovation. Our strategy is to securely connect everything to make those desired outcomes possible.\nFor a full discussion of our strategy and priorities, see “Item 1. Business.”\nOther Key Financial Measures\nThe following is a summary of our other key financial measures for fiscal 2025 compared with fiscal 2024 (in millions):\nCash and cash equivalents and investments\nCash provided by operating activities\nRemaining performance obligations\nRepurchases of common stock—stock repurchase program\nCISCO SYSTEMS, INC.\nMANAGEMENT’S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS (Continued)\nCRITICAL ACCOUNTING ESTIMATES\nThe preparation of financial statements and related disclosures in conformity with accounting principles generally accepted in the United States requires us to make judgments, assumptions, and estimates that affect the amounts reported in the Consolidated Financial Statements and accompanying notes. Note 2 to the Consolidated Financial Statements describes the significant accounting policies and methods used in the preparation of the Consolidated Financial Statements. The accounting policies described below are significantly affected by critical accounting estimates. Such accounting policies require significant judgments, assumptions, and estimates used in the preparation of the Consolidated Financial Statements, and actual results could differ materially from the amounts reported based on these policies.\nWe enter into contracts with customers that can include various combinations of products and services which are generally distinct and accounted for as separate performance obligations, resulting in contracts that may contain multiple performance obligations. We determine whether arrangements are distinct based on whether the customer can benefit from the product or service on its own or together with other resources that are readily available and whether our commitment to transfer the product or service to the customer is separately identifiable from other obligations in the contract. We classify our hardware, perpetual software licenses, and SaaS as distinct performance obligations. Term software licenses represent multiple obligations, which include software licenses and software maintenance. In transactions where we deliver hardware or software, we are typically the principal and we record revenue and costs of goods sold on a gross basis.\nWe recognize revenue upon transfer of control of promised goods or services in a contract with a customer in an amount that reflects the consideration we expect to receive in exchange for those products or services. Transfer of control occurs once the customer has the contractual right to use the product, generally upon shipment, electronic delivery (or when the software is available for download by the customer), or once title and risk of loss has transferred to the customer. Transfer of control can also occur over time for software maintenance and services as the customer receives the benefit over the contract term. Our hardware and perpetual software licenses are distinct performance obligations where revenue is recognized upfront upon transfer of control. Term software licenses include multiple performance obligations where the term licenses are recognized upfront upon transfer of control, with the associated software maintenance revenue recognized ratably over the contract term as services and software updates are provided. SaaS arrangements do not include the right for the customer to take possession of the software during the term, and therefore have one distinct performance obligation which is satisfied over time with revenue recognized ratably over the contract term as the customer consumes the services. On our product sales, we record consideration from shipping and handling on a gross basis within net product sales. We record our revenue net of any associated sales taxes.\nRevenue is allocated among these performance obligations in a manner that reflects the consideration that we expect to be entitled to for the promised goods or services based on standalone selling prices (SSP). SSP is estimated for each distinct performance obligation and judgment may be required in their determination. The best evidence of SSP is the observable price of a product or service when we sell the goods separately in similar circumstances and to similar customers. In instances where SSP is not directly observable, we determine SSP using information that may include market conditions and other observable inputs.\nWe assess relevant contractual terms in our customer contracts to determine the transaction price. We apply judgment in identifying contractual terms and determining the transaction price as we may be required to estimate variable consideration when determining the amount of revenue to recognize. Variable consideration includes potential contractual penalties and various rebate, cooperative marketing and other incentive programs that we offer to our distributors, channel partners and customers that we sell to directly. When determining the amount of revenue to recognize, we estimate the expected usage of these programs, applying the expected value or most likely estimate and update the estimate at each reporting period as actual utilization becomes available. We also consider the customers’ right of return in determining the transaction price, where applicable. If actual credits received by customers under these programs were to deviate significantly from our estimates, which are based on historical experience, our revenue could be adversely affected.\nSee Note 3 to the Consolidated Financial Statements for more details.\nInventory Valuation and Liability for Purchase Commitments with Contract Manufacturers and Suppliers\nInventory is written down based on excess and obsolete inventories, determined primarily by future demand forecasts. Inventory write-downs are measured as the difference between the cost of the inventory and net realizable value, based upon assumptions about future demand, and are charged to the provision for inventory. At the point of the loss recognition, a new, lower cost basis for that inventory is established, and subsequent changes in facts and circumstances do not result in the restoration or increase in that newly established cost basis.\nCISCO SYSTEMS, INC.\nMANAGEMENT’S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS (Continued)\nWe record a provision for firm, noncancelable, and unconditional purchase commitments with contract manufacturers and suppliers for quantities in excess of our future demand forecasts consistent with the valuation of our excess and obsolete inventory. Both provisions are a component of cost of sales.\nOur total provisions for inventory and the liability related to purchase commitments with contract manufacturers and suppliers were $493 million, $819 million, and $730 million\n\nin fiscal 2025, 2024, and 2023, respectively. If there were to be a sudden and significant decrease in demand for our products, or a higher incidence of inventory obsolescence because of rapidly changing technology or customer requirements, then we could be required to increase our inventory write-downs and our liability for purchase commitments with contract manufacturers and suppliers, and accordingly our profitability, could be adversely affected. We regularly evaluate our exposure for inventory write-downs, and the adequacy of our liability for purchase commitments. For further discussion around the supply chain impacts and risks, see “—Results of Operations—Gross Margin—Supply Chain Impacts and Risks” and “—Liquidity and Capital Resources—Inventory Supply Chain” under Item 7 of this report.\nWe are subject to the possibility of various losses arising in the ordinary course of business. We consider the likelihood of the incurrence of a liability, as well as our ability to reasonably estimate the amount of loss, in determining loss contingencies. An estimated loss contingency is accrued when it is probable that a liability has been incurred and the amount of loss can be reasonably estimated. We regularly evaluate information available to us to determine whether such accruals should be made or adjusted and whether new accruals are required.\nThird parties, including customers, have in the past and may in the future assert claims or initiate litigation related to exclusive patent, copyright, trademark, and other intellectual property rights to technologies and related standards that are relevant to us. These assertions have increased over time as a result of our growth and the general increase in the pace of patent claims assertions, particularly in the United States. If any infringement or other intellectual property claim made against us by any third party is successful, or if we fail to develop non-infringing technology or license the proprietary rights on commercially reasonable terms and conditions, our business, operating results, and financial condition could be materially and adversely affected.\nValuation of Goodwill and Purchased Intangible Assets\nOur methodology for allocating the purchase price relating to purchase acquisitions is determined through established valuation techniques. Goodwill represents a residual value as of the acquisition date, which in most cases results in measuring goodwill as an excess of the purchase consideration transferred plus the fair value of any noncontrolling interest in the acquired company over the fair value of net assets acquired, including contingent consideration. We perform goodwill impairment tests on an annual basis in the fourth fiscal quarter and between annual tests in certain circumstances for each reporting unit. The assessment of fair value for goodwill and purchased intangible assets is based on factors that market participants would use in an orderly transaction in accordance with the guidance for the fair value measurement of nonfinancial assets.\nIn response to changes in industry and market conditions, we could be required to strategically realign our resources and consider restructuring, disposing of, or otherwise exiting businesses, which could result in an impairment of goodwill. There was no impairment of goodwill in fiscal 2025, 2024, and 2023. For the annual impairment testing in fiscal 2025, the excess of the fair value over the carrying value for each of our reporting units was $56.5 billion for the Americas, $80.1 billion for EMEA, and $32.9 billion for APJC.\nDuring the fourth quarter of fiscal 2025, we performed a sensitivity analysis for goodwill impairment with respect to each of our respective reporting units and determined that a hypothetical 10% decline in the fair value of each reporting unit would not result in an impairment of goodwill for any reporting unit.\nPurchased Intangible Assets\nThe accounting for acquisitions requires significant estimates and judgments in the valuation of purchased intangible assets. Critical estimates used in the valuation of purchased intangible assets include, but are not limited to, the amount and timing of expected future cash flows, useful lives and discount rates. While our estimates of fair value are based on assumptions that are believed to be reasonable, these assumptions are inherently uncertain ",
  "item2_clean": null
}