{
  "source_file": "csgp-20250930.htm",
  "form_type": "10-Q",
  "item1_clean": null,
  "item7_clean": null,
  "item2_clean": "Our services are accessible via the internet and through our mobile applications. Our services are primarily derived from a databas\ne of building-specific information and offer customers specialized tools for accessing, analyzing, and using our information. Over time, we have enhanced and expanded, and we expect to continue to enhance and expand, our existing information, analytics, and online marketplaces. We have developed and we expect to continue to develop additional services leveraging our centralized database and 3D digital twin technology to meet the needs of our existing customers as well as potential new categories of customers.\nOur principal services are described in the following paragraphs:\nCoStar is our subscription-based integrated platform for commercial real estate intelligence, which includes information about commercial real estate properties, properties for sale, comparable sales, tenants, space available for lease, industry professionals and their business\nrelationships, industry news and market status and provides benchmarking for the hospitality industry, lease analytical capabilities, and risk management capabilities for lenders. CoStar's revenue growth rate for the nine months ended September 30, 2025 decreased compared to the revenue growth rate for the nine months ended September 30, 2024, due to a lack of benefit from converting legacy STR customers to our new CoStar-based benchmarking product realized in 2024. We expect CoStar's revenue growth rate for the year ending December 31, 2025 to decrease compared to the revenue growth rate for the year ended December 31, 2024, primarily due to a lack of benefit from convertin\ng legacy STR customers to our new CoStar-based benchmarking product realized in 2024.\nInformation Services\nWe provide real estate and lease management technology solutions, including lease administration, lease accounting, and transaction management through our CoStar Real Estate Manager and Visual Lease service offerings. Information Services' revenue growth rate for the nine months ended September 30, 2025 increased compared to the revenue growth rate for the nine months ended September 30, 2024, primarily as a result of the Visual Lease Acquisition. We expect the Information Services revenue growth rate for the year ending December 31, 2025 to increase compared to the revenue growth rate for the year ended December 31, 2024 as a result of the Visual Lease Acquisition.\nApartments.com is the flagship brand of our apartment marketing network of subscription-based advertising services and provides property management companies and landlords with a comprehensive advertising destination for their available rental units. In addition, it offers renters a platform for searching for available rentals. Multifamily's revenue growth rate for the nine months ended September 30, 2025 moderated compared to the revenue growth rate for the nine months ended September 30, 2024, primarily due to the impact in 2025 of pivoting the Apartments.com sales force to support the Homes.com product launch in 2024. We expect the Multifamily revenue growth rate for the year ending December 31, 2025 to moderate compared to the revenue growth rate for the year ended December 31, 2024 primarily due to the impact in 2025 of pivoting the Apartments.com sales force to support the Homes.com product launch in 2024.\nOur LoopNet Network of commercial real estate websites offers subscription-based, online marketplace services that enable commercial property owners, landlords, and real estate agents working on their behalf to advertise properties for sale or for lease. Commercial real estate agents, buyers, and tenants use the LoopNet Network of online marketplace services to search for available property listings that meet their criteria. LoopNet's revenue growth rate for the nine months ended September 30, 2025 increased compared to the revenue growth rate for the nine months ended September 30, 2024. We expect LoopNet's revenue growth rate for the year ending December 31, 2025 to increase compared to the revenue growth rate for the year ended December 31, 2024 due to an increase in the average revenue per listing, as well as an increase in the number of listings on our sites.\nHomes.com offers real estate agents subscription memberships promoting the agent's home listings and profile on our websites. Homebuyers and real estate agents use Homes.com to find their dream homes using our proprietary research and neighborhood content combined with listing information. Domain is an Australian property listings platform that generates revenue by promoting listings of for sale and rental properties on its portals. OnTheMarket is a property portal in the U.K., which primarily hosts agents' listings on a subscription basis. Residential's revenues for the nine months ended September 30, 2025 increased compared to the nine months ended September 30, 2024, primarily due to the Domain Acquisition and an increase in the number of Homes.com memberships, partially offset by the discontinuation of certain products that were inconsistent with our long-term business strategy. We expect Residential's revenues for the year ending December 31, 2025 to increase compared to the year ended December 31, 2024 due to the Domain Acquisition and additional sales of our Homes.com memberships.\nOur other revenues include revenues from the Matterport Acquisition, our Land.com Network, BizBuySell Network, and Ten-X, an online auction platform for commercial real estate. Matterport primarily provides hosting services for its 3D digital twins on a subscription basis. Matterport also provides capture services of spatial data and other add-on services to existing subscription customers and sells 3D capture cameras and third-party capture devices to customers. The Land.com Network provides online marketplaces for rural lands for sale. Our BizBuySell Network provides online marketplaces for businesses and franchises for sale. Other revenues for the nine months ended September 30, 2025 increased compared to the nine months ended September 30, 2024, primarily due to the Matterport Acquisition. We expect other revenues for the year ending December 31, 2025 to increase compared to the year ended December 31, 2024 primarily due to the Matterport Acquisition.\nSubscription-based Services\nThe majority of our revenue is generated from service offerings that are distributed to our customers under subscription-based agreements that typically renew automatically and have a term of at least one year. We recognize subscription revenues on a straight-line basis over the life of the contract.\nFor the three months ended September 30, 2025 and 2024, our annualized net new bookings of subscription-based services on all contracts were\n$84 million and $44 million,\nrespectively. Net new bookings is calculated based on the annualized amount of change in our sales bookings resulting from new subscription-based contracts, changes to existing subscription-based contracts, and cancellations of subscription-based contracts for the period reported. Net new bookings is calculated on all subscription-based contracts without regard to contract term. Net new bookings is considered an operating metric that is an indicator of future subscription revenue growth and is also used as a metric of sales force productivity by us and investors. However, information regarding net new bookings is not comparable to, nor should it be substituted for, an analysis of our revenues over time. Revenues from our subscription-based contracts were approximately 92% and 96% of total revenues for the three months ended September 30, 2025 and 2024, respectively. The decrease in our percentage of subscription-based revenues is primarily due to Domain, which sells listings on its platforms on a transactional basis, as well as the transactional products and services sold by Matterport.\nFor the trailing 12 months ended September 30, 2025 and 2024, our contract renewal rates for existing company-wide CoStar Group subscription-based services for contracts with a term of at least one year were approximately 89% for each year, and, therefore, our cancellation rates for those services during the same periods were approximately 11%. Contract renewal rates are calculated on all subscription-based contracts with a term of at least one year. Our contract renewal rate is a quantitative measurement that is typically closely correlated with our revenue results. As a result, we believe that the rate may be a reliable indicator of short-term and long-term performance absent extraordinary circumstances. Our trailing 12-month contract renewal rate may decline as a result of negative economic conditions, consolidations among our customers, reductions in customer spending or decreases in our customer base. Revenues from our subscription-based contracts with a term of at least one year were approximately 75% and 80% of total revenues for three months ended September 30, 2025 and 2024, respectively. The decrease in the percentage of revenues from our subscription-based contracts with a term of at least one year is primarily due to Domain, which sells listings on its platforms on a transactional basis, as well as the transactional products and services sold by Matterport.\nDevelopment, Investments, and Expansion\nWe plan to continue to invest in our business and our services, evaluate strategic growth opportunities, and pursue our key priorities as described below. We are committed to supporting, improving, and enhancing our information, analytics, and online marketplace solutions, including expanding and improving our offerings for our client base and site users, including property owners, property managers, buyers, commercial tenants, and residential renters and buyers. We expect to continue our software development efforts to improve existing services, introduce new services, integrate and cross-sell services, integrate recent"
}