{
  "source_file": "ctas-20250531.htm",
  "form_type": "10-K",
  "item1_clean": "Cintas was founded in 1968 by Richard T. Farmer when he left his family's industrial laundry business in order to develop uniform programs using an exclusive new fabric. In the early 1970's, Cintas acquired the family industrial laundry business. Over the years, Cintas developed additional products and services that complemented its core uniform business and broadened the scope of products and services available to its customers.\nCintas’ reportable operating segments are the Uniform Rental and Facility Services operating segment and the First Aid and Safety Services operating segment. The Uniform Rental and Facility Services reportable operating segment consists of the rental and servicing of uniforms and other garments, including flame resistant clothing, mats, mops and shop towels and other ancillary items. In addition to these rental items, restroom cleaning services and supplies and the sale of items from our catalogs to our customers on route are included within this reportable operating segment. The First Aid and Safety Services reportable operating segment consists of first aid and safety products and services, as well as workplace water services. The remainder of Cintas’ business, which consists of the Fire Protection Services operating segment and the Uniform Direct Sale operating segment, is included in All Other.\nThe following table sets forth Cintas' total revenue and the revenue derived from each reportable operating segment and the remaining operating segments included in All Other for the fiscal years ended May 31:\nUniform Rental and Facility Services\nFirst Aid and Safety Services\nAdditional information regarding each reportable operating segment and All Other is also included in \"Item 8. Financial Statements and Supplementary Data,\" in\nentitled Operating Segment Information of \"Notes to Consolidated Financial Statements.\"\nWe provide our products and services to over one million businesses of all types, from small service and manufacturing companies to major corporations that employ thousands of people. This diversity in customer base results in no individual customer accounting for greater than one percent of Cintas' total revenue. As a result, the loss of one account would not have a material financial impact on Cintas.\nThe primary markets served by each of the Cintas operating segments are local in nature and highly fragmented. Cintas competes with national, regional and local providers, large national retailers and small local retailers as well as companies with a significant online presence and the level of competition varies at each of Cintas' local operations. In addition, businesses may decide to perform certain services in-house instead of outsourcing these services. Product, design, price, quality, service and convenience to the customer are the competitive elements in each of our operating segments.\nOperations and Distribution\nWithin the Uniform Rental and Facility Services reportable operating segment, Cintas provides its products and services to customers via local delivery routes originating from rental processing plants and branches. Within the First Aid and Safety Services reportable operating segment and All Other, Cintas provides its products and services via its distribution network and local delivery routes or local representatives. At May 31, 2025, Cintas, in total, had approximately 12,100 local delivery routes, 478 operational facilities and 12 distribution centers.\nCintas is committed to sourcing responsibly. Cintas sources finished products from many outside suppliers. As mentioned on our website, www.cintas.com, each and every supplier must comply with a vendor code of conduct as a condition of doing business with Cintas. Cintas also conducts internal training to ensure that employee-partners who have direct responsibility for supply chain management are knowledgeable and aware of issues and concerns surrounding our supply chain. In addition to sourcing from third-party suppliers, Cintas operates five manufacturing facilities that provide for standard uniform needs. Cintas purchases fabric, used in the manufacturing of its products, from several suppliers. Cintas' ability to find qualified suppliers who meet its standards and to access products in a timely and efficient manner, is subject to ongoing market risks. For a discussion of the risks associated with sourcing that may materially impact Cintas, please see \"\n\nCintas Corporation (Cintas, Company, we, us or our), a Washington corporation, helps more than one million businesses of all types and sizes, primarily in the United States (U.S.), as well as Canada and Latin America, get\nREADY™\nto open their doors with confidence every day by providing a wide range of products and services that enhance our customers’ image and help keep their facilities and employees clean, safe and looking their best. With products and services including uniforms, mats, mops, shop towels, restroom supplies, workplace water services, first aid and safety products, eye-wash stations, safety training, fire extinguishers, sprinkler systems and alarm testing, Cintas helps customers get\nReady for the Workday",
  "item7_clean": "To monitor our credit rating and our capacity for long-term financing, we consider various qualitative and quantitative factors. One such factor is the ratio of our total debt to EBITDA. For the purpose of this calculation, debt is defined as the sum of short-term borrowings, long-term debt due within one year, long-term debt and standby letters of credit.\nFinancial and Nonfinancial Disclosure About Issuers and Guarantors of Cintas’ Senior Notes\nCintas Corporation No. 2 (Corp. 2) is the indirectly, wholly owned principal operating subsidiary of Cintas. Corp. 2 is the issuer of the $2,436.6 million aggregate principal amount of senior notes outstanding as of May 31, 2025, which are unconditionally guaranteed, jointly and severally, by Cintas Corporation and its wholly owned, direct and indirect domestic subsidiaries. See\nentitled Debt, Derivatives and Hedging Activities of \"Notes to Consolidated Financial Statements\" for more information on Cintas' outstanding debt.\nBasis of Preparation of the Summarized Financial Information\nThe following tables include summarized financial information of Cintas Corporation, Corp. 2 (issuer) and subsidiary guarantors (together, the Obligor Group). Investments in and equity in the earnings of non-guarantors, which are not members of the Obligor Group, have been excluded. Non-guarantor subsidiaries are located outside the U.S., and therefore, excluded from the Obligor Group.\nThe summarized financial information of the Obligor Group is presented on a combined basis with intercompany balances and transactions between entities in the Obligor Group eliminated. The Obligor Group’s amounts due from, amounts due to and transactions with non-guarantors have been presented in separate line items, if they are material.\nSummarized financial information of the Obligor Group is as follows as of and for the fiscal years ended May 31:\nSummarized Consolidated Statements of Income\nNet sales to unrelated parties\nNet sales to non-guarantors\nSummarized Consolidated Balance Sheets\nReceivables due from non-obligor subsidiaries\nTotal other current assets\nTotal other noncurrent assets\nAmounts due to non-obligor subsidiaries\nNoncurrent liabilities\nContractual and Other Material Cash Obligations\nPayments Due by Period\nTotal contractual and other material\nentitled Debt, Derivatives and Hedging Activities of \"Notes to Consolidated Financial Statements\" for a detailed presentation of Cintas' debt.\nentitled Leases of \"Notes to Consolidated financial Statements\" for a detailed presentation of Cintas' operating leases.\nCintas also makes payments to defined contribution plans and may make payments to defined benefit plans to satisfy minimum funding requirements. The amount of contributions made to the defined contribution plans are at the discretion of the Board. Future contributions to the defined contribution plans are expected to be $141.2 million in the next fiscal year, $304.0 million in the next two to three fiscal years and $335.1 million in the next four to five fiscal years. Future contributions to the defined benefit plans are expected to be $2.5 million in the next fiscal year, $10.0 million in the next two to three fiscal years and $8.4 million in the next four to five fiscal years.\nAmount of Commitment Expiration per Period\nStandby letters of credit and surety bonds\nTotal other commitments\nBack-up facility for the commercial paper program (reference\nentitled Debt, Derivatives and Hedging Activities of \"Notes to Consolidated Financial Statements\" for further discussion).\nThese standby letters of credit and surety bonds support certain outstanding debt (reference\nentitled Debt, Derivatives and Hedging Activities of \"Notes to Consolidated Financial Statements\"), self-insured workers' compensation and general liability insurance programs.\nInflation and Changing Prices\nChanges in wages, benefits and energy costs have the potential to materially impact Cintas' consolidated results of operations. In fiscal 2025, 2024 and 2023, we experienced impacts from inflation, including, but not limited to, higher labor, fuel and transportation costs. Management has been able to mitigate these inflationary pressures through pricing and various efficiency initiatives. Management has mitigated these impacts such that net of the mitigation strategy and initiatives, inflation and changing prices have not had a material impact on Cintas' consolidated financial condition or a negative impact on the consolidated results of operations.\nLitigation and Other Contingencies\nCintas is subject to legal proceedings, insurance receipts, legal settlements and claims arising from the ordinary course of its business, including personal injury, customer contract, environmental and employment claims. In the opinion of management, the aggregate liability, if any, with respect to such ordinary course of business actions will not have a material adverse effect on the consolidated financial position, consolidated results of operations or consolidated cash flows of Cintas. Cintas is also party to additional litigation not considered in the ordinary course of business. See\nentitled Litigation and Other Contingencies of \"Notes to Consolidated Financial Statements\" for a detailed discussion of such additional litigation.\nNew Accounting Standards\nIn November 2023, the Financial Accounting Standards Board (FASB) issued Accounting Standards Update (ASU) 2023-07, Segment Reporting (Topic 280),\nImprovements to Reportable Segment Disclosures\n(ASU 2023-07). ASU 2023-07 requires additional disclosures pertaining to significant expenses that are regularly provided to the CODM and other items of an entity’s reportable operating segments. This standard was adopted by Cintas on May 31, 2025 and did not have a material impact on the Company's consolidated financial statements.\nIn December 2023, the FASB issued ASU 2023-09, Income Taxes (Topic 740),\nImprovements to Income Tax Disclosures\n(ASU 2023-09), which expands disclosures in an entity’s income tax rate reconciliation table and regarding cash taxes paid both in the U.S. and foreign jurisdictions. ASU 2023-09 will be effective for annual periods beginning after December 15, 2024 (fiscal 2026). The Company is currently evaluating the impact of ASU 2023-09 on the consolidated financial statements.\nIn November 2024, the FASB issued ASU 2024-03, Income Statement - Reporting Comprehensive Income - Expense Disaggregation Disclosures (Subtopic 220-40):\nDisaggregation of Income Statement Expenses\n(ASU 2024-03), which requires, among other items, additional disaggregated disclosures in the notes to financial statements for certain categories of expenses that are included on the face of the statement of income. ASU 2024-03 is effective for fiscal years beginning after December 15, 2026 (fiscal 2028), and for interim periods within fiscal years beginning after December 15, 2027 (fiscal 2029), with early adoption permitted. The Company is currently evaluating the impact of ASU 2024-03 on the consolidated financial statements.\nThere are no other accounting pronouncements recently issued or newly effective that had, or are expected to have, a material impact on Cintas' consolidated financial statements.\nCritical Accounting Policies and Estimates\nThese critical accounting policies should be read in conjunction with\nentitled Significant Accounting Policies of \"Notes to Consolidated Financial Statements.\" The preparation of Cintas' consolidated financial statements in conformity with U.S. GAAP requires management to make estimates and judgments, specifically the insurance reserve, which have an effect on the amounts reported in the consolidated financial statements and accompanying notes. Significant changes in critical accounting policies or significant changes in estimates or assumptions, specifically related to the insurance reserve, could possibly have a material impact on the consolidated financial statements.\nRevenue recognition.\nApproximately 95% of the Company's revenue is derived from fees for route servicing of Uniform Rental and Facility Services, First Aid and Safety Services and Fire Protection Services customers, performed by a Cintas employee-partner, at the customer's location of business. Revenue from our route servicing customer contracts represent a single-performance obligation. The Company recognizes revenue over time as services are performed, based on the nature of services provided and contractual rates (output method) or at a point in time when the performance obligation under the terms of the contract with a customer are satisfied, at the customer's location of business. The Company's remaining revenue, primarily within the Uniform Direct Sales operating segment, and representing approximately 5% of the Company's total revenue, is recognized when the obligations under the terms of a contract with a customer are satisfied. This generally occurs when the goods are transferred to the customer.\nRevenue recorded is presented net of sales and other taxes we collect on behalf of governmental authorities. Shipping and handling costs charged to customers are treated as fulfillment activities and are recorded in both revenue and cost of sales at the time control is transferred to the customer. Certain of our customer contracts include pricing terms and conditions that include components of variable consideration. The variable consideration is typically in the form of consideration paid to a customer based on performance metrics specified within the contract and is not material in any period presented. When determining if variable consideration should be constrained, the Company considers whether factors outside its control could result in a significant reversal of revenue. In making these assessments, the Company considers the likelihood and magnitude of a potential reversal. The Company's performance period generally corresponds with the monthly invoice period. No constraints on our revenue recognition were applied during the fiscal years ended May 31, 2025, 2024 or 2023. See\nentitled Revenue Recognition of \"Notes to Consolidated Financial Statements\".\nUniforms and other rental items in service.\nUniforms and other rental items in service are valued at cost less amortization, calculated using the straight-line method. Uniforms in service (other than cleanroom garments) are amortized over their useful lives, which range from 18 to 30 months. Other rental items, including shop towels, mats, mops, cleanroom garments, linens and restroom dispensers, are amortized over their useful lives, which range from 8 to 60 months. The amortization rates used are based on industry experience, Cintas' specific experience and wear tests performed by Cintas. These factors are critical to determining the amount of in service inventory and related cost of uniforms and facility services that are presented in the consolidated financial statements.\nThe insurance reserve represents the estimated ultimate cost of all asserted and unasserted claims (incurred but not reported), primarily related to workers' compensation, auto liability and other general liability exposure through the consolidated balance sheet dates. Our incurred but not reported reserves are estimated through actuarial procedures, with the assistance of third-party actuarial specialists, of the insurance industry and by using industry assumptions, adjusted for specific expectations based on our claims history. Cintas records an increase or decrease in selling and administrative expenses related to development of prior claims, higher claims activity and other industry factors in the period in which it becomes known. These changes in estimates may be material to the consolidated financial statements.\n\nUniform Rental and Facility Services\nFirst Aid and Safety Services\nSelling and administrative expenses:\nUniform Rental and Facility Services\nFirst Aid and Safety Services\nTotal selling and administrative expenses\nUniform Rental and Facility Services\nFirst Aid and Safety Services\nTotal operating income\nInterest expense, net\nIncome before income taxes\nFiscal 2025 Compared to Fiscal 2024\nFiscal 2025 total revenue was $10.3 billion, an increase of 7.7% over the prior fiscal year. Revenue increased organically by 8.0% primarily as a result of increased sales volume. Organic revenue growth adjusts for the impact of acquisitions, workday differences and foreign currency exchange rate fluctuations. Total revenue was positively impacted by 0.8% due to acquisitions, negatively impacted by 0.9% due to two less workdays in fiscal 2025 compared to fiscal 2024 and negatively impacted by 0.2% due to foreign currency exchange rate fluctuations.\nOrganic revenue growth by quarter for fiscal 2025 is as follows:\nFirst quarter ended August 31, 2024\nSecond quarter ended November 30, 2024\nThird quarter ended February 28, 2025\nFourth quarter ended May 31, 2025\nFor the fiscal year ended May 31, 2025\nUniform Rental and Facility Services reportable operating segment revenue consists predominantly of revenue derived from the rental of corporate identity uniforms and other garments, including flame resistant clothing and the rental and/or sale of mats, mops, shop towels, restroom supplies and other rental services. Revenue from the Uniform Rental and Facility Services reportable operating segment increased 6.8%, to $7,976.1 million compared to $7,465.2 million in fiscal 2024. Organic revenue growth for this reportable operating segment was 7.0%. Revenue growth was positively impacted by 0.8% due to acquisitions, negatively impacted by 0.9% due to two less workdays in fiscal 2025 compared to fiscal 2024 and negatively impacted by 0.1% due to foreign currency exchange rate fluctuations. Revenue growth was a result of new business, the penetration of additional products and services into existing customers and price increases, partially offset by lost business. New business growth resulted from an increase in the number and productivity of sales representatives. Generally, sales productivity improvements are due to increased tenure and improved training, which produce a higher number of products and services sold.\nOther revenue, consisting of revenue from the First Aid and Safety Services reportable operating segment and All Other, increased 10.9%, to $2,364.1 million compared to $2,131.4 million in fiscal 2024. Revenue improved from increases in sales representative productivity and price increases. Revenue increased organically by 11.3%. Revenue growth was positively impacted by 0.6% due to acquisitions, negatively impacted by 0.9% due to two less workdays in fiscal 2025 compared to fiscal 2024 and negatively impacted by 0.1% due to foreign currency exchange rate fluctuations.\nCost of uniform rental and facility services increased 4.5% compared to fiscal 2024. Cost of uniform rental and facility services consists primarily of production expenses, delivery expenses and the amortization of in-service inventory, including uniforms, mats, shop towels and other ancillary items. The change from the prior year was primarily due to higher Uniform Rental and Facility Services reportable operating segment sales volume, as well as an increase in material cost to support increased revenue growth. The cost of uniform rental and facility services as a percent of revenue improved compared to fiscal 2024 from 51.8% to 50.7% primarily due to efficiency gains in energy usage, more efficient use of in-service inventory and production efficiency gains.\nCost of other consists primarily of cost of goods sold (predominantly first aid and safety products, personal protective equipment, uniforms and fire protection products), delivery expenses and distribution expenses in the First Aid and Safety Services reportable operating segment and All Other. Cost of other increased 7.7% in fiscal 2025 compared to fiscal 2024, as a result of higher other revenue, but decreased as a percent of revenue to 47.6%, compar",
  "item2_clean": null
}