{
  "source_file": "ctas-20250831.htm",
  "form_type": "10-Q",
  "item1_clean": null,
  "item7_clean": null,
  "item2_clean": "Results of Operations\nCintas classifies its business into two reportable operating segments and places the remainder of its operating segments in an All Other category. Cintas’ two reportable operating segments are Uniform Rental and Facility Services and First Aid and Safety Services. The Uniform Rental and Facility Services reportable operating segment consists of the rental and servicing of uniforms and other garments including flame resistant clothing, mats, mops and shop towels and other ancillary items. In addition to these rental items, restroom cleaning services and supplies and the sale of items from our catalogs to our customers on route are included within this reportable operating segment. The First Aid and Safety Services reportable operating segment consists of first aid and safety products and services, as well as workplace water services. The remainder of Cintas’ business, which consists of the Fire Protection Services operating segment and the Uniform Direct Sales operating segment, is included in All Other. These operating segments consist of fire protection products and services and the direct sale of uniforms and related items. Cintas evaluates operating segment performance based on revenue and operating income. Revenue and operating income for the three months ended August 31, 2025 and 2024, for the two reportable operating segments and All Other are presented in\nentitled Segment Information of “Notes to Consolidated Condensed Financial Statements.” The Company regularly reviews its operating segments for reporting purposes based on the information its chief operating decision maker (CODM) regularly reviews for purposes of allocating resources and assessing performance and makes changes when appropriate.\nConsolidated Results\nThree Months Ended August 31, 2025 Compared to Three Months Ended August 31, 2024\n\nTotal revenue increased 8.7% to $2,718.1 million for the three months ended August 31, 2025, compared to $2,501.6 million for the three months ended August 31, 2024. The organic revenue growth rate, which adjusts for\nthe impact of acquisitions and foreign currency exchange rate fluctuations, was 7.8%. Revenue growth was positively impacted by 0.9% due to acquisitions.\nUniform Rental and Facility Services reportable operating segment revenue was $2,091.1 million for the three months ended August 31, 2025, compared to $1,933.8 million for the three months ended August 31, 2024, which was an increase of 8.1%. The organic revenue growth rate for this reportable operating segment was 7.3%. Revenue growth in the Uniform Rental and Facility Services reportable operating segment was positively impacted by 0.8% due to acquisitions. Revenue growth was a result of new business, the penetration of additional products and services into existing customers and price increases, partially offset by lost business.\nOther revenue, consisting of revenue from the First Aid and Safety Services reportable operating segment and All Other, increased 10.4% for the three months ended August 31, 2025, compared to the three months ended August 31, 2024, from $567.7 million to $627.1 million. The organic revenue growth rate for other revenue was 9.6%. Revenue growth was positively impacted by 0.8% due to acquisitions.\nCost of uniform rental and facility services consists primarily of production expenses, delivery expenses and the amortization of in-service inventory, including uniforms, mats, shop towels and other ancillary items. Cost of uniform rental and facility services increased $71.4 million, or 7.3%, for the three months ended August 31, 2025, compared to the three months ended August 31, 2024. Cost of uniform rental and facility services improved as a percent of revenue, decreasing from 50.7% for the three months ended August 31, 2024, to 50.3% for the three months ended August 31, 2025. This improvement as a percent of revenue was primarily due to more efficient usage of in-service inventory and strategic sourcing initiatives.\nCost of other consists primarily of cost of goods sold (predominantly first aid and safety products, personal protective equipment, uniforms and fire protection products), delivery expenses and distribution expenses in the First Aid and Safety Services reportable operating segment and All Other. Cost of other increased $30.7 million, or 11.4%, for the three months ended August 31, 2025, compared to the three months ended August 31, 2024. Cost of other increased as a percent of revenue, increasing from 47.3% for three months ended August 31, 2024, to 47.7% for the three months ended August 31, 2025. The increase in cost of sales as a percent of revenue was primarily due to adding route capacity.\nSelling and administrative expenses increased $57.6 million, or 8.3%, in the three months ended August 31, 2025, compared to the three months ended August 31, 2024. Selling and administrative expenses as a percent of revenue were 27.5% for the three months ended August 31, 2025, compared to 27.6% for the three months ended August 31, 2024. The change as a percent of revenue is primarily due to operating leverage from revenue growth.\nOperating income was $617.9 million, or 22.7% of revenue, for the three months ended August 31, 2025, compared to $561.0 million, or 22.4% of revenue, for the three months ended August 31, 2024. The resulting increase in operating income as a percent of revenue was primarily due to more efficient in-service inventory usage and operating leverage from revenue growth.\nNet interest expense (interest expense less interest income) was $22.0 million for the three months ended August 31, 2025, compared to $24.4 million for the three months ended August 31, 2024. The change was primarily due to a decrease in the average amount of outstanding debt during the three months ended August 31, 2025.\nCintas’ effective tax rate was 17.6% and 15.8% for the three months ended August 31, 2025 and 2024, respectively. The effective tax rate in both periods was impacted by certain discrete items, primarily the tax accounting impact for stock-based compensation.\nNet income was $491.1 million for the three months ended August 31, 2025, an increase of 8.7% compared to the three months ended August 31, 2024. Diluted earnings per share were $1.20 for the three months ended August 31, 2025, which was an increase of 9.1% compared to the three months ended August 31, 2024. Diluted earnings per share increased primarily due to the increase in net income.\nUniform Rental and Facility Services Reportable Operating Segment\nThree Months Ended August 31, 2025 Compared to Three Months Ended August 31, 2024\n\nUniform Rental and Facility Services reportable operating segment revenue increased to $2,091.1 million from $1,933.8 million, or 8.1%, for the three months ended August 31, 2025, over the three months ended August 31, 2024. The organic revenue growth rate for the reportable operating segment was 7.3%. The cost of uniform rental and facility services increased $71.4 million, or 7.3%. The reportable operating segment’s gross margin was $1,038.5 million. Gross margin as a percent of revenue was 49.7% for the three months ended August 31, 2025, compared to 49.3% for the three months ended August 31, 2024. The resulting increase as a percent of revenue was primarily due to more efficient usage of in-service inventory and strategic sourcing initiatives.\nSelling and administrative expenses for the Uniform Rental and Facility Services reportable operating segment increased $32.3 million in the three months ended August 31, 2025, compared to the three months ended August 31, 2024. Selling and administrative expenses as a percent of revenue for the three months ended August 31, 2025 were 25.8%, compared to 26.2% in the three months ended August 31, 2024. The improvement was primarily due to operating leverage from revenue growth and a decrease in employee-partner related expenses as a percent of revenue.\nIncome before income taxes increased $53.5 million, or 12.0%, for the Uniform Rental and Facility Services reportable operating segment for the three months ended August 31, 2025, compared to the three months ended August 31, 2024. Income before income taxes was 23.9% of the reportable operating segment's revenue compared to the three months ended August 31, 2024 of 23.1% of revenue. The improvement in income before income taxes was a result of the expansion in gross margin in addition to the improvement in selling and administrative expenses as a percent of revenue noted above.\nFirst Aid and Safety Services Reportable Operating Segment\nThree Months Ended August 31, 2025 Compared to Three Months Ended August 31, 2024\nFirst Aid and Safety Services reportable operating segment revenue increased from $292.6 million to $334.7 million, or 14.4%, for the three months ended August 31, 2025, over the three months ended August 31, 2024. The organic revenue growth rate for the reportable operating segment was 14.1%. First Aid and Safety Services reportable operating segment revenue was positively impacted by 0.3% due to acquisitions. The increase in revenue was driven by many factors including increases in new business sold by sales representatives, penetration of additional products and services into existing customers, price increases and strong customer retention.\nCost of first aid and safety services for the three months ended August 31, 2025, increased $20.7 million, or 16.7%, compared to the three months ended August 31, 2024. The gross margin as a percent of revenue was 56.8% for the three months ended August 31, 2025, compared to the gross margin as a percent of revenue of 57.7% in the three months ended August 31, 2024. The reduction in gross margin as a percent of revenue was primarily due to adding route capacity.\n\nSelling and administrative expenses increased $12.3 million in the three months ended August 31, 2025, compared to the three months ended August 31, 2024. Selling and administrative expenses as a p"
}