{
  "source_file": "cog-20241231.htm",
  "form_type": "10-K",
  "item1_clean": null,
  "item7_clean": "Year Ended December 31,\nCash flows provided by operating activities\nCash flows used in investing activities\nCash flows provided by (used in) financing activities\n2024 and 2023 Compared\nOperating Activities.\nOperating cash flow fluctuations are substantially driven by changes in commodity prices, production volumes and operating expenses. As discussed above, commodity prices have historically been volatile. Fluctuations in cash flow may result in an increase or decrease in our planned capital expenditures.\nNet cash provided by operating activities decreased by $863 million in 2024 compared to 2023. This decrease was primarily due to a decrease in natural gas revenue, caused by lower natural gas prices and production, an increase in operating costs, a decrease in cash received on derivative settlements and a net reduction in working capital during 2024. These decreases were partially offset by higher oil and NGL revenues primarily driven by higher production.\nRefer to “Results of Operations” for additional information relative to commodity price, production and operating expense fluctuations. We are unable to predict future commodity prices and, as a result, cannot provide any assurance about future levels of net cash provided by operating activities.\nInvesting Activities.\nCash flows used in investing activities decreased by $297 million in 2024 compared to 2023. This decrease was primarily due to $335 million of lower cash paid for capital expenditures, partially offset by $31 million lower proceeds from asset sales.\nFinancing Activities.\nCash flows provided by financing activities increased by $1.6 billion in 2024 compared to 2023. The increase was due to the issuance of the $500 million of 5.60% senior notes in March 2024, $750 million of 5.40% senior notes and $750 million of 5.90% senior notes in December 2024, and $265 million of lower dividend payments. These increases were partially offset by the repayment of $575 million of 3.65% weighted-average senior notes at their maturity in September 2024 and $50 million of higher common stock repurchases during 2024. The lower dividend payments were a result of a decrease in our dividend from $1.17 per common share for 2023 to $0.84 per common share for 2024 due to a special variable-rate dividend of $0.37 that was paid in 2023, and a decrease in outstanding shares of stock due to our active share repurchase program during 2023 and 2024.\n2023 and 2022 Compared.\nRevolving Credit Agreement\nIn September 2024, we entered into Amendment No. 1 (the “Amendment”) relating to our revolving credit agreement with JPMorgan Chase Bank, N.A., as administrative agent (the “Administrative Agent”), and certain lenders and issuing banks party thereto (as amended by the Amendment, and further amended, supplemented or otherwise modified from time-to-time, the “Credit Agreement”). The Amendment increased the aggregate revolving commitments under the Credit Agreement from $1.5 billion to $2.0 billion, extended the Credit Agreement maturity date from March 10, 2028 to September 12, 2029, made certain amendments to the representations and warranties, affirmative and negative covenants and events of default, and made certain other modifications.\nBorrowings under the Credit Agreement bear interest at a rate per annum equal to, at our option, (i) either a term secured overnight financing rate (“SOFR”) plus a 0.10 percent credit spread adjustment for all tenors or (ii) a base rate, plus, in each case, an interest rate margin which ranges from 0 to 75 basis points for base rate loans and 100 to 175 basis points for term SOFR loans, based on our credit rating. The maturity date of the Credit Agreement can be extended for additional one-year periods on up to two occasions upon the agreement of lenders holding at least 50 percent of the commitments under the Credit Agreement and us.\nThe Credit Agreement includes certain customary covenants, including the maintenance of a maximum leverage ratio of no more than 3.0 to 1.0 as of the last day of any fiscal quarter. At such time as we have no other debt in a principal amount in excess of $75 million outstanding that has a financial maintenance covenant based on a substantially similar leverage ratio, in lieu of such maximum leverage ratio covenant, the Credit Agreement will instead require us to maintain a ratio of total net debt to total capitalization of no more than 65 percent (with all calculations based on definitions contained in the Credit Agreement).\nAt December 31, 2024, we were in compliance with all financial covenants and had $2.0 billion of borrowing capacity under our Credit Agreement.\nIn December 2024, we entered into a $1.0 billion delayed draw term loan credit agreement with Toronto Dominion (Texas) LLC, as administrative agent, and certain other lenders and issuing banks (the “Term Loan”), which consists of a $500 million Tranche A Term Loan and a $500 million Tranche B Term Loan. The Tranche A Term Loan matures two years after funding, and the Tranche B Term Loan matures three years after funding. Borrowings under the Term Loan can be prepaid without penalty. As of December 31, 2024, we had no borrowings outstanding under the Term Loan and $1.0 billion of available commitments.\nIn January 2025, we borrowed $500 million under the Tranche A Term Loan to partially fund the closing of the FME acquisition and $500 million under the Tranche B Term Loan to partially fund the closing of the Avant acquisition.\nBorrowings under the Term Loan bear interest at a rate per annum equal to, at our option, either (i) a term SOFR plus a 0.10 percent credit spread adjustment for all tenors or (ii) a base rate, plus an interest rate margin which ranges from 0 to 75 basis points for base rate loans, 100 to 175 basis points for Tranche A SOFR Term Loans and 112.5 to 187.5 basis points for Tranche B SOFR Term Loans based on our credit rating. The ticking fee on the average daily amount of the Tranche A commitments and Tranche B commitments is calculated at annual rates ranging from 10 basis points to 25 basis points based on our credit rating.\nThe Term Loan includes certain customary covenants, including the maintenance of a maximum leverage ratio of no more than 3.0 to 1.0 as of the last day of any fiscal quarter until such time as we have no other debt (other than our Credit Agreement) in a principal amount in excess of $75 million outstanding that has a financial maintenance covenant based on a leverage ratio, at which time the Term Loan requires maintenance of a ratio of total net debt to capitalization of no more than 65 percent (with all calculations based on definitions contained in the Term Loan).\nCertain Restrictive Covenants\nOur ability to incur debt, incur liens, enter into mergers, sell assets, enter into transactions with affiliates, and engage in certain other activities are subject to certain restrictive covenants in our various debt instruments. In addition, the senior note agreement governing various series of senior notes that were issued in a private placement (the “private placement senior notes”) requires us to maintain a minimum annual coverage ratio of consolidated cash flow to interest expense for the trailing four quarters of not less than 2.8 to 1.0 and requires us to maintain, as of the last day of any fiscal quarter, a maximum ratio of total debt to consolidated EBITDAX for the trailing four quarters of not more than 3.0 to 1.0. At December 31, 2024, we were in compliance with all financial covenants in our private placement senior notes.\nRefer to Note 4 of the Notes to the Consolidated Financial Statements, “Long-Term Debt and Credit Agreements,” for further details regarding the interest rate on future borrowings under our Credit Agreement and Term Loan, as well as information regarding our restrictive covenants, including our leverage ratio.\nInformation about our capitalization is as follows:\n\nYear Ended December 31,\nDeferred tax (benefit) expense\nCombined federal and state effective income tax rate\nIncome tax expense decreased $279 million primarily due to lower pre-tax income and a lower effective tax rate. The effective tax rate decreased due to differences in the non-recurring discrete items recorded during 2024 compared to 2023.\n2023 and 2022 Compared\nCritical Accounting Policies and Estimates\nThe preparation of financial statements in conformity with GAAP requires management to make estimates and assumptions that affect the reported amounts of assets and liabilities, the disclosure of contingent assets and liabilities as of the date of the balance sheet, and the reported amounts of revenues and expenses during the reporting period. Actual results could differ from those estimates, and changes in our estimates are recorded when known. We consider the following to be our most critical estimates that involve judgement of management.\nSuccessful Efforts Method of Accounting\nWe follow the successful efforts method of accounting for our oil and gas producing activities. Acquisition costs for proved and unproved properties are capitalized when incurred. Judgment is required to determine the proper classification of wells designated as developmental or exploratory, which ultimately will determine the proper accounting treatment of costs incurred. Exploration costs, including geological and geophysical costs, the costs of carrying and retaining unproved properties and exploratory dry-hole costs are expensed. Development costs, including costs to drill and equip development wells and successful exploratory drilling costs to locate proved reserves, are capitalized.\nOil and Gas Reserves\nThe process of estimating quantities of proved reserves is inherently imprecise, and the reserves data included in this document are only an estimate. The process relies on interpretations and judgment of available geological, geophysical, engineering and production data. The extent, quality and reliability of this technical data can vary. The process also requires certain economic assumptions, some of which are mandated by the SEC, such as commodity prices. Additional assumptions include drilling and operating expenses, capital expenditures, taxes and availability of funds. Any significant variance in the interpretations or assumptions could materially affect the estimated quantity and value of our reserves and can change substantially over time. Periodic revisions to the estimated reserves and future cash flows may be necessary as a result of reservoir performance, drilling activity, commodity prices, fluctuations in operating expenses, technological advances, new geological or geophysical data or other economic factors. Accordingly, reserves estimates are generally different from the quantities ultimately recovered.\nThe reserves estimates of our oil and gas properties have been prepared by our reservoir engineering staff and certain of our reserves are subject to an evaluation performed by an independent third-party petroleum consulting firm. In 2024, greater than 90 percent of the total future net revenue discounted at 10 percent attributable to our proved reserves were subject to this evaluation. For more information regarding reserves estimation, including historical reserves revisions, refer to the Supplemental Oil and Gas Information included in Item 8.\nOur rate of recording DD&A expense is dependent upon our estimate of proved reserves, which are utilized in our unit-of-production calculation. If the estimates of proved and proved developed reserves were to be reduced, the rate at which we record DD&A expense would increase, reducing net income. Such a reduction in reserves may result from lower market prices, which may make it uneconomic to drill and produce higher cost fields. A five percent positive or negative revision to proved reserves would result in a decrease of $0.33 per Boe and an increase of $0.37 per Boe, respectively, on our DD&A rate. This estimated impact is based on current data, and actual events could require different adjustments to our DD&A rate.\nIn addition, a decline in proved reserves estimates may impact the outcome of our impairment test under applicable accounting standards. Due to the inherent imprecision of the reserves estimation process, risks associated with the operations of proved producing properties and market sensitive commodity prices utilized in our impairment analysis, we cannot determine if an impairment is reasonably likely to occur in the future.\nOil and Gas Properties\nWe evaluate our proved oil and gas properties for impairment on a field-by-field basis whenever events or changes in circumstances indicate an asset’s carrying amount may not be recoverable. We compare expected undiscounted future cash flows to the net book value of the asset. If the future undiscounted expected cash flows, based on our estimate of future commodity prices, operating costs and anticipated production from proved reserves and risk-adjusted probable and possible reserves, are lower than the net book value of the asset, then the capitalized cost is reduced to fair value. Commodity pricing is\nestimated by using a combination of assumptions management uses in its budgeting and forecasting process, historical and current prices adjusted for geographical location and quality differentials, as well as other factors that we believe will impact realizable prices. Given the significant volatility in oil, natural gas and NGLs prices, estimates of such future prices are inherently imprecise. In the event that commodity prices significantly decline, we would assess whether the decline constitutes a triggering event that would require us to test the recoverability of the carrying value of our oil and gas properties and, if necessary, record an impairment charge. Fair value is calculated by discounting the future cash flows. The discount factor used is based on rates utilized by market participants that are commensurate with the risks inherent in the development and production of the underlying oil and natural gas.\nUnproved oil and gas properties are assessed periodically for impairment on an aggregate basis through periodic updates to our unproved acreage amortization based on past drilling and exploration experience, our expectation of converting leases to held by production and average property lives. Average property lives are determined on a geographical basis and based on the estimated life of unproved property leasehold rights. Historically, the average property life in each of the geographical areas has not significantly changed and generally ranges from three to five years. The commodity price environment may impact the capital available for our drilling activities. We have considered these impacts when determining the amortization of our unproved acreage. If the average unproved property life decreases or increases by one year, the amortization would increase by approximately $12 million or decrease by $8 million, respectively, per year.\nAs these properties are developed and reserves are proved, the remaining capitalized costs are subject to depreciation and depletion. If the development of these properties is deemed unsuccessful and the properties are abandoned or surrendered, the capitalized costs related to the unsuccessful activity are expensed in the year the determination is made. The rate at which the unproved properties are written off depends on the timing and success of our future exploration and development program.\nDerivative Instruments\nUnder applicable accounting standards, the fair value of each derivative instrument is recorded as either an asset or liability on the balance sheet. At the end of each quarterly period, these instruments are marked-to-market. The change in fair value of derivatives not designated as hedges is recorded as a component of operating revenues in gain (loss) on derivative instruments in the Consolidated Statement of Operations.\nOur derivative contracts are measure",
  "item2_clean": null
}