{
  "source_file": "ctva-20250930.htm",
  "form_type": "10-Q",
  "item1_clean": null,
  "item7_clean": null,
  "item2_clean": "MANAGEMENT’S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS\nCautionary Statements About Forward-Looking Statements\nThis report contains certain estimates and forward-looking statements within the meaning of Section 21E of the Securities Exchange Act of 1934, as amended, and Section 27A of the Securities Act of 1933, as amended, which are intended to be covered by the safe harbor provisions for forward-looking statements contained in the Private Securities Litigation Reform Act of 1995, and may be identified by their use of words like “plans,” “expects,” “will,” “anticipates,” “believes,” “intends,” “projects,” “estimates,” “outlook,” or other words of similar meaning. All statements that address expectations or projections about the future, including statements about Corteva’s financial results or outlook; strategy for growth; product development; regulatory approvals; market position; capital allocation strategy; liquidity; sustainability targets and initiatives; the anticipated benefits of acquisitions, restructuring actions, or cost savings initiatives; and the outcome of contingencies, such as litigation and environmental matters, are forward-looking statements.\nForward-looking statements and other estimates are based on certain assumptions and expectations of future events which may not be accurate or realized. Forward-looking statements and other estimates also involve risks and uncertainties, many of which are beyond the company's control. While the list of factors presented below is considered representative, no such list should be considered to be a complete statement of all potential risks and uncertainties. Unlisted factors may present significant additional obstacles to the realization of forward-looking statements. Consequences of material differences in results as compared with those anticipated in the forward-looking statements could include, among other things, business disruption, operational problems, financial loss, legal liability to third parties and similar risks, any of which could have a material adverse effect on the company's business, results of operations and financial condition. Some of the important factors that could cause the company's actual results to differ materially from those projected in any such forward-looking statements include: (i) failure to obtain or maintain the necessary regulatory approvals for some of the company's products; (ii) failure to successfully develop and commercialize the company's pipeline; (iii) effect of the degree of public understanding and acceptance or perceived public acceptance of the company's biotechnology and other agricultural products; (iv) effect of changes in agricultural and related policies of governments and international organizations; (v) costs of complying with evolving regulatory requirements and the effect of actual or alleged violations of environmental laws or permit requirements; (vi) effect of climate change and unpredictable seasonal and weather factors; (vii) failure to comply with competition and antitrust laws; (viii) effect of competition in the company's industry; (ix) competitor’s establishment of an intermediary platform for distribution of the company's products; (x) risks related to recent funding and staff reductions at U.S. government agencies; (xi) risk related to geopolitical and military conflict; (xii) effect of volatility in the company's input costs; (xiii) risks related to the company's global operations; (xiv) effect of industrial espionage and other disruptions to the company's supply chain, information technology or network systems; (xv) risks related to environmental litigation and the indemnification obligations of legacy EIDP liabilities in connection with the Corteva Separation; (xvi) impact of the company's dependence on third parties with respect to certain of its raw materials or licenses and commercialization; (xvii) failure of the company's customers to pay their debts to the company, including customer financing programs; (xviii) failure to effectively manage acquisitions, divestitures, alliances, restructurings, cost savings initiatives, and other portfolio actions; (xix) failure to raise capital through the capital markets or short-term borrowings on terms acceptable to the company; (xx) increases in pension and other post-employment benefit plan funding obligations; (xxi) risks related to pandemics or epidemics; (xxii) capital markets sentiment towards sustainability matters; (xxiii) the company's intellectual property rights or defense against intellectual property claims asserted by others; (xxiv) effect of counterfeit products; (xxv) the company's dependence on intellectual property cross-license agreements; (xxvi) risks related to Corteva's Separation from DowDuPont; and (xxvii) risks related to Corteva’s proposed separation, including, but not limited to, whether the objectives of the proposed separation will be achieved; the terms, structure, benefits and costs of any action or transaction resulting from the proposed separation; the timing of any such separation or related action and whether any such separation will be consummated at all; the risk the proposed separation could divert the attention and time of the company’s management; the risk of any unexpected costs or expenses resulting from the proposed separation process or separation itself; and the risk of any litigation as a result of, or relating to, the proposed separation.\nOn October 1, 2025, the company announced its intent to separate its seed and crop protection businesses into two standalone, publicly traded companies, in a transaction that is intended to be a tax-free spin-off for U.S. federal income tax purposes.\nThe following is a summary of results from continuing operations for the three months ended September 30, 2025:\nThe company reported net sales of $2,618 million, up\n13 percent versus the same quarter last year, reflecting\nincrease in volume and a\n2 percent favorable impact from\ncurrency, partially offset by a\nCost of goods sold totaled $1,644 million in the third quarter of 2025, up from $1,565 million in the third quarter of 2024, which was\ndriven by higher volumes, with a partial offset from ongoing cost and productivity actions and lower commodity prices.\nRestructuring and asset related charges - net were $30 million in the third quarter of 2025, a decrease from $32 million in the third quarter of 2024. The charges for the three months ended September 30, 2025 primarily relate to contract termination charges and decommissioning and demolition costs associated with the Crop Protection Operations Strategy Restructuring Program.\nIncome (loss) from continuing operations after income taxes was $(308) million, as compared to $(519) million in the same quarter last year.\nOperating EBITDA was $49 million for the three months ended September 30, 2025, up from $(100) million for the three months ended September 30, 2024,\nprimarily driven by Seed and Crop Protection volume growth, favorable Seed product mix, ongoing cost and productivity benefits and net royalty improvement, partially offset by continued investment in Seed research and development, additional Seed commissions and compensation expense, competitive Crop Protection pricing and unfavorable currency effects\n. Refer to page 52 for further discussion of the company's non-GAAP financial measures.\nThe following is a summary of results from continuing operations for the nine months ended September 30, 2025:\nThe company reported net sales of\n4 percent versus the same period last year, reflecting\nincrease in volume and a\nincrease in price, partially offset by a\n2 percent unfavorable impact from\nCost of goods sold totaled\nnine months ended September 30, 2025\nnine months ended September 30, 2024\ndriven by ongoing cost and productivity actions, lower commodity prices and Crop Protection raw material deflation, with a partial offset from higher volumes.\nRestructuring and asset related charges - net were $131 million for the nine months ended September 30, 2025, a decrease from $199 million for the nine months ended September 30, 2024. The charges for the nine months ended September 30, 2025 primarily relate to\nseverance and related benefit costs, asset related charges, decommissioning and demolition costs and contract termination charges associated with the Crop Protection Operations Strategy Restructuring Program.\nIncome (loss) from continuing operations after income taxes was $1,741 million, as compared to $913 million in the same period last year.\nOperating EBITDA was $3,402 million for the nine months ended September 30, 2025, up from $2,851 million for the nine months ended September 30, 2024, primarily driven by improvements in\nSeed pricing, market share gains and product mix, Crop Protection volume growth and raw material deflation, ongoing cost and productivity benefits and net royalty improvement, partially offset by higher compensation, continued investment in Seed research and development, competitive pricing and higher bad debt expense in Crop Protection and unfavorable currency effects\n. Refer to page 52 for further discussion of the company's non-GAAP financial measures.\nIn addition to the financial highlights above, the following events occurred during the nine months ended September 30, 2025:\nThe company returned approximately $1.1 billion to shareholders during the nine months ended September 30, 2025 under its previously announced share repurchase programs and through common stock dividends.\nResults of Operations\nNet sales were $2,618 million and $2,326 million for the three months ended September 30, 2025 and 2024, respectively. The increase was primarily driven\nincrease in volume and a\n2 percent favorable impact from\ncurrency, partially offset by a\ndecline in price. Crop Protection volume increases were driven primarily by demand for new products, herbicides and biologicals. Seed experienced volume growth due primarily "
}