{
  "source_file": "ctva-20241231.htm",
  "form_type": "10-K",
  "item1_clean": "In connection with the validation of breeding plans and large-scale product development timelines focused on rapidly ramping up differentiated technology solutions, in 2019 the company began accelerating the ramp up of the Enlist E3\nTM\ntrait platform in the company’s soybean portfolio mix across all brands, including Pioneer\nbrands. Due to the five-year ramp-up of Enlist E3\nTM\n, the company significantly reduced the volume of products with the Roundup Ready 2 Yield\nand Roundup Ready 2 Xtend\nherbicide tolerance traits beginning in 2021, with expected minimal use of the Roundup Ready 2 Yield\nand Roundup Ready 2 Xtend\ntraits thereafter for the remaining term of the non-exclusive license with the Monsanto Company. Refer to Prepaid Royalties within the Critical Accounting Estimates section on page 55 for additional information.\nThe Seed segment has a diverse worldwide network which markets and distributes the company’s brands to customers, primarily through the company’s multi-channel, multi-brand strategy, which includes four differentiated channels: Pioneer agency model, regional brands, retail brands, as well as third parties through licensing and distribution channels.\nThe Pioneer agency model is unique to Corteva and represents sales made directly to farmers via independent sales representatives. Through this agency model, the company interacts directly with farmers at multiple points in the growing season, from prior to planting all the way through harvest. These regular interactions enable the company to provide the advice and service farmers need while giving the company real-time insights into the customers’ future ordering decisions. The company’s regional brands connect to customers through regional brand employees and farmer-dealer networks. Retail brands provide a one-stop shop for seed and chemistry solutions and may include sales to distributors, agricultural cooperatives, and dealers. Finally, Corteva out-licenses traits and germplasm to third parties.\nThe key raw materials for the Seed segment include corn and soybean seeds. To produce high-quality seeds, the company contracts with third-party growers globally. Corteva focuses on production close to the customer to provide the seed product, which is suitable for that region and its weed, insect and disease challenges, weather, soil and other conditions. The company conditions and packages the seeds using its own plants and third-party contract manufacturers. By striking a balance between owning production facility assets directly and contracting with third-party growers, the company believes it is best able to maintain flexibility to react to demand changes unique to each geography while minimizing costs. The company seeks to collaborate with strategic seed growers and share its digital agronomy and product management knowledge with them. The company’s third-party growers are an important part of its supply chain. Corteva provides them with rigorous training, planning tools and access to a system that tests and advances products matched to specific geographic needs.\nThe Seed segment's research and development (\"R&D\") and supply chain groups work seamlessly to select and maintain product characteristics that enhance the quality of its seed products and solutions. Corteva focuses on customer-driven innovation to deliver superior germplasm and trait technologies. With its large sets of digitized data and its seed field management solution, the company can manage its field operations efficiently and draw insights from data quickly and effectively. This allows the company’s supply chain to react quickly to changing customer needs and provides R&D with tremendous amounts of data to analyze and incorporate into resource allocation decisions. The company continues to invest in and build capabilities that drive value via data digitization and analytics that enable it to create an even more responsive and efficient answer to customer needs.\nITEM 1. BUSINESS,\n\nThe key raw materials and supplies for the Crop Protection segment include chlorinated pyridines derivatives, specialty intermediates and technical grade active ingredients, chlorine, and seed treatments. Typically, the company purchases major raw materials through long-term contracts with multiple suppliers, which sometimes require minimum purchase commitments. Certain important raw materials are supplied by a few major suppliers. The company expects the markets for its raw materials to remain balanced. The company relies on contract manufacturers, both domestically and internationally, to produce certain inputs or key components for its product formulations. These inputs are sourced globally and the company generally formulates its products close to its end customers. Shifts in customer demand, reduced local availability of raw materials, and/or production capacity constraints may, at times, necessitate sourcing from an alternative geography. The company strives to maintain multiple high-quality supply sources for each input.\nCorteva’s supply chain strategy involves managing global supplies of active and intermediate ingredients sourced regionally with global best practices and oversight. Corteva’s supply strategy includes a robust and flexible global footprint to meet future portfolio growth. The company’s supply chain also provides competitive advantages including reducing time to meet customer requirements in regions while minimizing costs through the value chain.\nCorteva’s sales are generally strongest in the first half of the calendar year, which aligns with the planting and growing season in the northern hemisphere. The company typically generates about 65 percent of its sales in the first half of the calendar year, driven by northern hemisphere Seed and Crop Protection sales. The company generates about 35 percent of its sales in the second half of the calendar year, led by Seed sales in the southern hemisphere. The seasonality in sales impacts both the Seed and Crop Protection segments. The company’s direct distribution channel, where products are shipped to farmers, is more affected by planting delays than its competitors. Generally speaking, unfavorable weather slows the planting season and can affect the company’s quarterly results and sales mix. Severe unfavorable weather, however, can impact overall sales. Accounts receivable tends to be higher during the first half of the year, consistent with the peak sales period in the northern hemisphere, with cash collection focused in the fourth quarter.\nHuman Capital Management\nCorteva aims to attract the best employees, to retain those employees through offering career development and training opportunities while also prioritizing their safety and wellness in an inclusive and productive work environment. The company’s strong employee base of approximately 22,000 employees, along with its commitment to Corteva’s core values, is a key element to the success of its business.\nWorkforce Composition.\nAs of December 31, 2024, the company globally employs approximately 22,000 employees. In order to address regional specific customer needs within its global business, the company has a geographically diverse employee base with 47 percent, 21 percent, 20 percent, and 12 percent located in North America, Latin America, EMEA, and Asia-Pacific regions, respectively.\nApproximately 2 percent of the United States workforce is unionized and another 13 percent of our global workforce participate in works councils and collective bargaining arrangements outside the United States. In 2024, the company did not experience any work stoppages due to strike or lockouts.\nLiving safely is one of the company’s core values by which the company manages its business. The company has implemented safety programs and management practices to promote a culture of safety to protect its employees, as well as the environment. This includes required trainings for employees, as well as specific qualifications and certifications for certain operational employees.\nThe company has a robust inclusion and belonging vision and strategy, based upon the belief that embracing individual differences benefits the company by creating a workforce with a greater variety of skills and perspectives as a result of their differentiated backgrounds and experiences. Specific inclusion and belonging initiatives are identified and tracked to create a culture of belonging that is designed to create an inclusive environment where the best talent is attracted, retained, and engaged. Critical to creating this environment are company-sponsored employee business resource groups (“BRGs”) that support and promote certain mutual objectives of both the employee and the company, including community engagement and the professional development of employees. The BRGs are open to all employees and provide a voluntary space where employees can foster connections within a supportive environment. The company maintains nine global BRGs, each led by a member of the company’s senior leadership: Disability Awareness Network; Global African Heritage Alliance; Global\nITEM 1. BUSINESS,\n\nIndigenous Peoples Alliance; Growing Asian Impact Network; Latin Network; Pride; Professional Learning Acceleration Network; Veteran’s Network; and Women’s Inclusion Network.\nThe company monitors its recruitment and talent development processes, in order to prevent and detect inequities and potentially discriminatory practices that could negatively impact the creation of an inclusive culture and the retention of key talent for our leadership pipeline. The company reviews its inclusion and belonging efforts through periodic engagement surveys and other measures. The results of the company’s efforts, along with its inclusion and belonging strategy, are reviewed periodically with the company’s management, and through annual reviews of the company’s leadership pipelines and inclusion and belonging programs with the People and Compensation Committee of the Board of Directors.\nExperienced Management.\nThe company believes its management team has the experience necessary to effectively execute its strategy and advance its product pipelines and technology. The company's chief executive officer and business presidents have an average of approximately 20 years of agriculture experience and are supported by an experienced and talented management team who is dedicated to maintaining and expanding its position as a global force in the agriculture industry.\nIntellectual Property\nCorteva considers its intellectual property estate, which includes patents, trade secrets, trademarks and copyrights, in the aggregate, to constitute a valuable asset of Corteva and actively seeks to secure intellectual property rights as part of an overall strategy to protect its investment in innovations and maximize the results of its research and development program. While the company believes that its intellectual property estate, taken as a whole, provides a competitive advantage in many of its businesses, no single patent, trademark, license or group of related patents or licenses is in itself essential to the company as a whole or to any of the company’s segments.\nTrade secrets are also an important element of the company's intellectual property. Many of the processes used to make Corteva products are kept as trade secrets which, from time to time, may be licensed to third parties. Corteva vigilantly protects its intellectual property. When the company discovers that its intellectual property has been unlawfully taken, it will take measures to mitigate any potential impact, which may include civil actions seeking redress, restitution and/or damages based on loss to the company and/or unjust enrichment, as well as reporting the matter to governmental authorities for investigation and potential criminal action, as appropriate.\nPatents & Trademarks.\nCorteva continually applies for and obtains U.S. and foreign patents and has access to a large pate",
  "item7_clean": "For the Year Ended December 31,\nRestructuring and asset related charges - net\nRestructuring and asset related charges - net were $288 million for the year ended December 31, 2024, which was primarily comprised of a $232 million charge associated with the Crop Protection Operations Strategy Restructuring Program and a $55 million net charge from non-cash accelerated prepaid royalty amortization expense related to the Roundup Ready 2 Yield® and Roundup Ready 2 Xtend® herbicide tolerance traits. The $232 million charge associated with the Crop Protection Operations Strategy Restructuring Program was primarily comprised of $91 million of severance and related benefit costs, $101 million of asset related charges, $10 million in decommissioning and demolition costs and $30 million of contract termination charges.\nRestructuring and asset related charges - net were $336 million for the year ended December 31, 2023, which was primarily comprised of a $217 million charge related to the Crop Protection Operations Strategy Restructuring Program, a $72 million net charge related to non-cash accelerated prepaid royalty amortization expense related to the Roundup Ready 2 Yield® and Roundup Ready 2 Xtend® herbicide tolerance traits and $42 million related to severance and related benefit costs, asset related charges and contract termination charges (including early lease terminations) associated with the 2022 Restructuring Actions. The $217 million net charge associated with the Crop Protection Operations Strategy Restructuring Program was primarily comprised of $214 million of asset related charges, which includes non-cash impairment charges of $152 million consisting of $92 million and $60 million related to operating lease assets and property, plant and equipment, respectively, associated with the exit of the company’s production activities at its site in Pittsburg, California.\nRestructuring and asset related charges - net were $336 million for the year ended December 31, 2022, which was primarily comprised of a $272 million net charge related to the 2022 Restructuring Actions and $109 million of restructuring and asset related charges - net from non-cash accelerated prepaid royalty amortization expense related to the Roundup Ready 2 Yield® and Roundup Ready 2 Xtend® herbicide tolerance traits. The $272 million net charge associated with the 2022 Restructuring Actions was comprised of $111 million of severance and related benefit costs, $104 million of asset related charges and $57 million of costs related to contract terminations (including early lease terminations). These charges were partially offset by a benefit associated with previous restructuring programs.\nSee Note 6 - Restructuring and Asset Related Charges - Net, to the Consolidated Financial Statements, for additional information.\nOther Income (Expense) - Net\nFor the Year Ended December 31,\nOther income (expense) - net\nOther income (expense) - net was $(300) million and $(448) million for the years ended December 31, 2024 and 2023, respectively. Lower other expense was primarily driven by decreases in net exchange losses and charges related to estimated settlement reserves, as well as the receipt of insurance proceeds and an indemnification payment negotiated with the former Stoller owners, partially offset by a decrease in interest income.\nOther income (expense) - net was $(448) million for the year ended December 31, 2023 and $(60) million for the year ended December 31, 2022. Higher other expense was primarily driven by an increase in net exchange losses and estimated settlement reserves and an increase in non-operating pension and other post-employment costs in the current period versus a benefit in the\nITEM 7. MANAGEMENT'S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS,\nprior period. Higher other expense was partially offset by an increase in interest income and the absence of charges incurred in 2022 relating to certain legal matters and losses associated with a previously held equity investment.\nSee Note 7 - Supplementary Information, to the Consolidated Financial Statements, for additional information.\nFor the Year Ended December 31,\nInterest expense was $233 million and $233 million for the years ended December 31, 2024 and 2023, respectively. The impact of lower short-term borrowings and lower interest rates was offset by higher interest related to the senior notes issued in 2023 and higher foreign currency borrowings.\nInterest expense was $233 million and $79 million for the years ended December 31, 2023 and 2022, respectively. The change was primarily driven by higher interest rates, the issuance of Senior Notes in connection with the May 2023 Debt Offering, and an increase in short term borrowings.\nProvision for (Benefit from) Income Taxes on Continuing Operations\nFor the Year Ended December 31,\nProvision for (benefit from) income taxes on continuing operations\nFor the year ended December 31, 2024, the company’s effective tax rate of 32.3 percent on pre-tax income from continuing operations of $1,275 million was unfavorably impacted by a $120 million charge on the establishment of a valuation allowance recorded against the net deferred tax asset position of a legal entity in Brazil, unfavorable geographic mix of earnings, a $22 million charge associated with repatriation of cash held outside of the U.S. primarily from current year earnings, and the unfavorable tax impact of certain net exchange losses recognized on the re-measurement of the net monetary asset positions. These items were partially offset by a $(59) million benefit related to U.S. tax credits for increasing research activities and $(32) million in net tax benefits associated with changes to deferred taxes and accruals for certain prior year tax positions.\nFor the year ended December 31, 2023, the company’s effective tax rate of 13.9 percent on pre-tax income from continuing operations of $1,093 million was favorably impacted by a $(65) million benefit related to U.S. tax credits for increasing research activities, changes to deferred taxes and a tax currency change for legal entities within Switzerland in the amount of $(62) million and $(24) million, respectively, as well as favorable geographic mix of earnings. These items were partially offset by the unfavorable tax impact of certain net exchange losses recognized on the re-measurement of the net monetary asset positions, which were not deductible in their local jurisdictions, a $46 million charge associated with intellectual property realignment, and a $32 million charge associated with repatriation of cash held outside of the U.S. primarily from current year earnings.\nFor the year ended December 31, 2022, the company’s effective tax rate of 14.7 percent on pre-tax income from continuing operations of $1,426 million was favorably impacted by tax benefits relating to the establishment of deferred taxes in connection with the impact of a change in a U.S. legal entity's tax characterization, a worthless stock deduction in the U.S., and the release of a valuation allowance recorded against the net deferred tax asset position of a legal entity in Brazil in the amount of $(55) million, $(42) million and $(36) million, respectively. These items were partially offset by the unfavorable tax impact of certain net exchange losses recognized on the re-measurement of the net monetary asset positions which were not deductible in their local jurisdictions, and a $24 million charge associated with repatriation of cash held outside of the U.S. primarily from current year earnings.\nITEM 7. MANAGEMENT'S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS,\nIncome (Loss) from Discontinued Operations After Income Taxes\nFor the Year Ended December 31,\nIncome (loss) from discontinued operations after income taxes\nIncome (loss) from discontinued operations after income taxes was $56 million for the year ended December 31, 2024. The after-tax benefit was driven by charges pursuant to the MOU with Chemours and DuPont relating to PFAS remediation activities primarily at Chemours' Fayetteville Works facility and litigation activity, which were more than offset by a favorable adjustment of certain prior year tax positions for previously divested businesses, the derecognition of an indemnification liability associated with the Water District Settlement Fund contribution, and insurance proceeds related to legacy matters.\nIncome (loss) from discontinued operations after income taxes was $(194) million for the year ended December 31, 2023, which was primarily comprised of charges associated with the settlement of certain PFAS related legal matters that are subject to the MOU with Chemours and DuPont, including the Nationwide Water District Settlement and the State of Ohio for natural resources damage claims, and charges associated with PFAS environmental remediation activities primarily at Chemours' Fayetteville Works facility.\nIncome (loss) from discontinued operations after income taxes was $(58) million for the year ended December 31, 2022, which was primarily comprised of charges pursuant to the MOU with Chemours and DuPont relating to PFAS environmental remediation activities primarily at Chemours' Fayetteville Works facility and adjustments of certain prior year tax positions for previously divested businesses.\nSee Note 16 - Commitments and Contingent Liabilities, to the Consolidated Financial Statements, for further discussion.\nEIDP Analysis of Operations\nAs discussed in Note 1 - Basis of Presentation, to the EIDP Consolidated Financial Statements, EIDP is a subsidiary of Corteva, Inc. and continues to be a reporting company, subject to the requirements of the Exchange Act. The below relates to EIDP only and is presented to provide an Analysis of Operations, only for the differences between EIDP and Corteva, Inc.\nOther Income (Expense) - Net\nFor the Year Ended December 31,\nOther income (expense) - net\nOther income (expense) - net was $(261) million and $(448) million for the years ended December 31, 2024 and 2023, respectively. Lower other expense was primarily driven by the items noted on page 36, under the header “Other Income (Expense) – Net – 2024 versus 2023.\" In addition, EIDP earned interest income from Corteva, Inc. of $38 million under the Master In-House Banking Agreement for the year ended December 31, 2024. See EIDP Note 2 - Related Party Transactions, to the EIDP Consolidated Financial Statements, for further information.\nOther income (expense) - net was $(448) million for the year ended December 31, 2023 and $(60) million for the year ended December 31, 2022. Higher other expense was primarily driven by the items noted on page 36, under the header “Other Income (Expense) – Net – 2023 versus 2022.\" See EIDP Note 2 - Related Party Transactions, to the EIDP Consolidated Financial Statements, for further information.\nITEM 7. MANAGEMENT'S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS,\nEIDP’s interest expense was $233 million and $253 million for the years ended December 31, 2024 and 2023, respectively. The change was primarily driven by the items noted on page 37, under the header “Interest Expense – 2024 versus 2023,” and lower average borrowings on the related party loan between EIDP and Corteva, Inc., as the loan was repaid in the fourth quarter of 2023. See Note 2 - Related Party Transactions, to the EIDP Consolidated Financial Statements, for further information.\nEIDP’s interest expense was $253 million and $124 million for the years ended December 31, 2023 and 2022, respectively. The change was primarily driven by the items noted on page 37, under the header “Interest Expense – 2023 versus 2022,” and lower average borrowings on the related party loan between EIDP and Corteva, Inc. See Note 2 - Related Party Transactions, to the EIDP Consolidated Financial Statements for further information.\nProvision for (Benefit from) Income Taxes on Continuing Operations\nFor the year ended December 31, 2024, EIDP had an effective tax rate of 32.0 percent on pre-tax income from continuing operations of $1,314 million, driven by the items noted on page 37, under the header “Provision for (Benefit from) Income Taxes on Continuing Operations - 2024\". See Note 3 - Income Taxes, to the EIDP Consolidated Financial Statements for further information.\nFor the year ended December 31, 2023, EIDP had an effective tax rate of 13.7 percent on pre-tax income from continuing operations of $1,073 million, driven by the items noted on page 37, under the header “Provision for (Benefit from) Income Taxes on Continuing Operations - 2023\" and a tax benefit related to the interest expense incurred on the related party loan between EIDP and Corteva, Inc. See Note 3 - Income Taxes, to the EIDP Consolidated Financial Statements for further information.\nFor the year ended December 31, 2022, EIDP had an effective tax rate of 14.4 percent on pre-tax income from continuing operations of $1,381 million, driven by the items noted on page 37, under the header “Provision for (Benefit from) Income Taxes on Continuing Operations - 2022\" and a tax benefit related to the interest expense incurred on the related party loan between EIDP and Corteva, Inc. See Note 3 - Income Taxes, to the EIDP Consolidated Financial Statements for further information.\nRecent Accounting Pronouncements\nSee Note 3 - Recent Accounting Guidance, to the Consolidated Financial Statements, for a description of recent accounting pronouncements.\nThe company operates in two reportable segments: Seed and Crop Protection. The company’s Seed segment is a global leader in developing and supplying advanced germplasm and traits that produce optimum yield for farms around the world. The segment offers trait technologies that improve resistance to weather, disease, insects and enhance food and nutritional characteristics, herbicides used to control weeds, and digital solutions that assist farmer decision-making with a view to optimize product selection and, ultimately, help maximize yield and profitability. The segment competes in a wide variety of agricultural markets. The Crop Protection segment serves the global agricultural input industry with products that protect against weeds, insects and other pests, and disease, and that improve overall crop health both above and below ground via nitrogen management and seed-applied technologies. The segment offers crop protection solutions and digital solutions that provide farmers the tools they need to improve productivity and profitability, and help keep fields free of weeds, insects and diseases. The segment is a leader in global herbicides, insecticides, nitrogen stabilizers, pasture and range management herbicides and biologicals.\nITEM 7. MANAGEMENT'S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS,\nSummarized below are comments on individual segment net sales and segment operating EBITDA for the years ended December 31, 2024, 2023 and 2022. The company defines segment operating EBITDA as earnings (loss) (i.e., income (loss) from continuing operations before income taxes) before interest, depreciation, amortization, corporate expenses, non-operating benefits (costs), foreign exchange gains (losses), and net unrealized gain or loss from mark-to-market activity for certain foreign currency derivative instruments that do not qualify for hedge accounting, excluding the impact of significant items. Non-operating benefits (costs) consists of non-operating pension and OPEB credits (costs), tax indemnification adjustments and environmental remediation and legal costs associated with legacy businesses and sites. Tax indemnification adjustments relate to changes in indemnification balances, as a result of the application of the terms of the Tax Matters Agreement, between Corteva and Dow and/or DuPont that are recorded by the company as pre-tax income or expense. See Note 23 - S",
  "item2_clean": null
}