{
  "source_file": "cvs-20241231.htm",
  "form_type": "10-K",
  "item1_clean": "CVS Health Corporation, together with its subsidiaries (collectively, “CVS Health,” the “Company,” “we,” “our” or “us”), is a leading health solutions company building a world of health around every consumer it serves and connecting care so that it works for people wherever they are. As of December 31, 2024, we had more than 9,000 retail locations, more than 1,000 walk-in and primary care medical clinics, a leading pharmacy benefits manager with approximately 90 million plan members and expanding specialty pharmacy solutions, and a dedicated senior pharmacy care business serving more than 800,000 patients per year. We serve an estimated more than 36 million people through traditional, voluntary and consumer-directed health insurance products and related services, including expanding Medicare Advantage offerings and a leading standalone Medicare Part D prescription drug plan (“PDP”). We are creating new sources of value through our integrated model allowing us to expand into personalized, technology driven care delivery and health services, increasing access to quality care, delivering better health outcomes and lowering overall health care costs.\nThe Company has four reportable segments: Health Care Benefits, Health Services, Pharmacy & Consumer Wellness and Corporate/Other.\nWe are building a world of health around every consumer we serve, seeking to make it easier and more affordable to live a healthier life. This means delivering solutions that are more personalized, simpler to use and increasingly digital so consumers can receive care when, where and how they desire. We address holistic health – physical, emotional, social and economic – and we are creating new sources of value through our integrated care model which allows us to expand into personalized, technology driven care delivery and health services, increasing access to quality care, delivering better health outcomes and lowering overall health care costs. We believe our consumer-centric strategy will drive sustainable long-term growth and deliver value for all stakeholders.\nHealth Care Benefits Segment\nThe Health Care Benefits segment operates as one of the nation’s leading diversified health care benefits providers, serving an estimated more than 36 million people as of December 31, 2024. The Health Care Benefits segment has the information and resources to help members, in consultation with their health care professionals, make more informed decisions about their health care. The Health Care Benefits segment offers a broad range of traditional, voluntary and consumer-directed health insurance products and related services, including medical, pharmacy, dental and behavioral health plans, medical management capabilities, Medicare Advantage and Medicare Supplement plans, PDPs and Medicaid health care management services. The Health Care Benefits segment’s primary customers, its members, primarily access the segment’s products and services through employer groups, government-sponsored plans or individually. The Health Care Benefits segment also serves customers who purchase products and services that are ancillary to its health insurance products.\nHealth Care Benefits Products and Services\nThe Company refers to insurance products (where it assumes all or a majority of the risk for medical and dental care costs) as “Insured” and administrative services contract products (where the plan sponsor assumes all or a majority of the risk of medical and dental care costs) as “ASC.” Health Care Benefits segment products and services consist of the following:\n: The Health Care Benefits segment offers point-of-service (“POS”), preferred provider organization (“PPO”), health maintenance organization (“HMO”) and indemnity benefit (“Indemnity”) plans. Commercial medical products also include health savings accounts (“HSAs”) and consumer-directed health plans that combine traditional POS or PPO and/or dental coverage, subject to a deductible, with an accumulating benefit account (which may be funded by the plan sponsor and/or the member in the case of HSAs). Principal products and services are targeted specifically to large multi-site national, mid-sized and small employers, individual insureds and expatriates. The Company offers medical stop loss insurance coverage for certain employers who elect to self-insure their health benefits. Under medical stop loss insurance products, the Company assumes risk for costs associated with large individual claims and/or aggregate loss experience within an employer’s plan above a pre-set annual threshold. The segment also has a portfolio of additional health products and services that complement its medical products such as dental plans, behavioral health and employee\nassistance products, provider network access and vision products. The Company sold Insured plans directly to individual consumers through the individual public health insurance exchanges (“Public Exchanges”) in 17 states as of December 31, 2024.\n: In select geographies, the Health Care Benefits segment offers Medicare Advantage plans, Medicare Supplement plans and prescription drug coverage for Medicare beneficiaries; participates in Medicaid and subsidized Children’s Health Insurance Programs (“CHIP”); and participates in demonstration projects for members who are eligible for both Medicare and Medicaid (“Duals”). These Government Medical products are further described below:\nThrough annual contracts with the U.S. Centers for Medicare & Medicaid Services (“CMS”), the Company offers HMO and PPO products for eligible individuals in certain geographic areas through the Medicare Advantage program. Members typically receive enhanced benefits over traditional fee-for-service Medicare coverage (“Original Medicare”), including reduced cost-sharing for preventive care, vision and other services. The Company offered network-based HMO and/or PPO plans in 46 states and Washington, D.C. in 2024. For certain qualifying employer groups, the Company offers Medicare PPO products nationally. When combined with the Company’s PDP product, these national PPO plans form an integrated national Insured Medicare product for employers that provides medical and pharmacy benefits.\nThe Company is a national provider of drug benefits under the Medicare Part D prescription drug program. All Medicare eligible individuals are eligible to participate in this voluntary prescription drug plan. Members typically receive coverage for certain prescription drugs, usually subject to a deductible, co-insurance and/or co-payment. The Company offered PDP plans in all 50 states and Washington, D.C. in 2024.\nMedicare Supplement:\nFor certain Medicare eligible members, the Company offers supplemental coverage for certain health care costs not covered by Original Medicare. The products included in the Medicare Supplement portfolio help to cover some of the gaps in Original Medicare, and include coverage for Medicare deductibles and coinsurance amounts. The Company offered a wide selection of Medicare Supplement products in 49 states and Washington, D.C. in 2024.\nThe Company offers health care management services to individuals eligible for Medicaid and CHIP under multi-year contracts with government agencies in various states that are subject to annual appropriations. CHIP are state-subsidized insurance programs that provide benefits for families with uninsured children. The Company offered these services on an Insured or ASC basis in 16 states in 2024.\nThe Company provides health coverage to beneficiaries who are dually eligible for both Medicare and Medicaid coverage. These members must meet certain income and resource requirements in order to qualify for this coverage. The Company coordinates 100% of the care for these members and may provide them with additional services in order to manage their health care costs.\nThe Company also has a portfolio of transformative products and services aimed at creating a holistic and integrated approach to individual health and wellness. These products and services complement the Commercial Medical and Government Medical products and aim to provide innovative solutions, create integrated experience offerings and enable enhanced care delivery to customers.\nHealth Care Benefits Provider Networks\nThe Company contracts with physicians, hospitals and other providers for services they provide to the Company’s members. The Company uses a variety of techniques designed to help encourage appropriate utilization of medical services (“utilization”) and maintain affordability of quality coverage. In addition to contracts with providers for negotiated rates of reimbursement, these techniques include creating risk sharing arrangements that align economic incentives with providers, the development and implementation of guidelines for the appropriate utilization and the provision of data to providers to enable them to improve health care quality. At December 31, 2024, the Company’s underlying nationwide provider network had approximately 1.9 million participating providers. Other providers in the Company’s provider networks also include laboratory, imaging, urgent care and other freestanding health facilities.\nHealth Care Benefits Quality Assessment\nCMS uses a 5-star rating system to monitor Medicare health care and drug plans and ensure that they meet CMS’s quality standards. CMS uses this rating system to provide Medicare beneficiaries with a tool that they can use to compare the overall quality of care and level of customer service of companies that provide Medicare health care and drug plans. The rating system considers a variety of measures adopted by CMS, including quality of preventative services, chronic illness management and overall customer satisfaction. See “Health Care Benefits Pricing” below in this Item 1 for further discussion of star ratings. The\nCompany seeks Health Plan accreditation for Aetna Inc. (“Aetna”) HMO plans from the National Committee for Quality Assurance (“NCQA”), a private, not-for-profit organization that evaluates, accredits and certifies a wide range of health care organizations. Health care plans seeking accreditation must pass a rigorous, comprehensive review and must annually report on their performance.\nAetna Life Insurance Company (“ALIC”), a wholly-owned subsidiary of the Company, has received nationwide NCQA PPO Health Plan accreditation. As of December 31, 2024, all of the Company’s Commercial HMO and all of ALIC’s PPO members who were eligible participated in HMOs or PPOs that are accredited by the NCQA.\nThe Company’s provider selection and credentialing/re-credentialing policies and procedures are consistent with NCQA and URAC, a health care accrediting organization that establishes quality standards for the health care industry, as well as state and federal, requirements. In addition, the Company is certified under the NCQA Credentials Verification Organization (“CVO”) certification program for all certification options and has URAC CVO accreditation.\nQuality assessment programs for contracted providers who participate in the Company’s networks begin with the initial review of health care practitioners. Practitioners’ licenses and education are verified, and their work history is collected by the Company or in some cases by the practitioner’s affiliated group or organization. The Company generally requires participating hospitals to be certified by CMS or accredited by The Joint Commission, the American Osteopathic Association, or Det Norske Veritas Healthcare.\nThe Company also offers quality and outcome measurement programs, quality improvement programs and health care data analysis systems to providers and purchasers of health care services.\nHealth Care Benefits Information Systems\nThe Health Care Benefits segment currently operates and supports an end-to-end suite of information technology platforms to support member engagement, enrollment, health benefit administration, care management, service oper",
  "item7_clean": "Item 7. Management’s Discussion and Analysis of Financial Condition and Results of Operations. (“MD&A”)\nOverview of Business\nCVS Health Corporation, together with its subsidiaries (collectively, “CVS Health,” the “Company,” “we,” “our” or “us”), is a leading health solutions company building a world of health around every consumer it serves and connecting care so that it works for people wherever they are. As of December 31, 2024, the Company had more than 9,000 retail locations, more than 1,000 walk-in and primary care medical clinics, a leading pharmacy benefits manager with approximately 90 million plan members and expanding specialty pharmacy solutions, and a dedicated senior pharmacy care business serving more than 800,000 patients per year. The Company also serves an estimated more than 36 million people through traditional, voluntary and consumer-directed health insurance products and related services, including expanding Medicare Advantage offerings and a leading standalone Medicare Part D prescription drug plan (“PDP”). The Company is creating new sources of value through its integrated model allowing it to expand into personalized, technology driven care delivery and health services, increasing access to quality care, delivering better health outcomes and lowering overall health care costs.\nThe Company has four reportable segments: Health Care Benefits, Health Services, Pharmacy & Consumer Wellness and Corporate/Other, which are described below.\nOverview of the Health Care Benefits Segment\nThe Health Care Benefits segment operates as one of the nation’s leading diversified health care benefits providers. The Health Care Benefits segment has the information and resources to help members, in consultation with their health care professionals, make more informed decisions about their health care. The Health Care Benefits segment offers a broad range of traditional, voluntary and consumer-directed health insurance products and related services, including medical, pharmacy, dental and behavioral health plans, medical management capabilities, Medicare Advantage and Medicare Supplement plans, PDPs and Medicaid health care management services. The Health Care Benefits segment’s primary customers, its members, primarily access the segment’s products and services through employer groups, government-sponsored plans or individually. The Health Care Benefits segment also serves customers who purchase products and services that are ancillary to its health insurance products. The Company refers to insurance products (where it assumes all or a majority of the risk for medical and dental care costs) as “Insured” and administrative services contract products (where the plan sponsor assumes all or a majority of the risk for medical and dental care costs) as “ASC.” The Company sold Insured plans directly to individual consumers through the individual public health insurance exchanges (“Public Exchanges”) in 17 states as of December 31, 2024.\nOverview of the Health Services Segment\nThe Health Services segment provides a full range of PBM solutions, delivers health care services in its medical clinics, virtually, and in the home, and offers provider enablement solutions. PBM solutions include plan design offerings and administration, formulary management, retail pharmacy network management services, and specialty and mail order pharmacy services. In addition, the Company provides clinical services, disease management services, medical spend management and pharmacy and/or other administrative services for providers and federal 340B drug pricing program covered entities (“Covered Entities”). The Company operates a group purchasing organization that negotiates pricing for the purchase of pharmaceuticals and rebates with pharmaceutical manufacturers on behalf of its participants and provides various administrative, management and reporting services to pharmaceutical manufacturers. During 2023, the Company completed the acquisition of two key health care delivery assets – Signify Health, Inc. (“Signify Health”), a leader in health risk assessments, value-based care and provider enablement services, and Oak Street Health, Inc. (“Oak Street Health”), a leading multi-payor operator of value-based primary care centers serving Medicare eligible patients. The Company also launched Cordavis\nTM\n, a wholly owned subsidiary that works directly with pharmaceutical manufacturers to commercialize and/or co-produce high quality biosimilar products. The Health Services segment’s clients and customers are primarily employers, insurance companies, unions, government employee groups, health plans, PDPs, Medicaid managed care plans, CMS, plans offered on public and private health insurance exchanges and other sponsors of health benefit plans throughout the U.S., patients who receive care in the Health Services segment’s medical clinics, virtually or in the home, as well as Covered Entities.\nOverview of the Pharmacy & Consumer Wellness Segment\nThe Pharmacy & Consumer Wellness segment dispenses prescriptions in its retail pharmacies and through its infusion operations, provides ancillary pharmacy services including pharmacy patient care programs, diagnostic testing and vaccination administration, and sells a wide assortment of health and wellness products and general merchandise. The segment also conducts long-term care pharmacy (“LTC”) operations, which distribute prescription drugs and provide related pharmacy consulting and ancillary services to long-term care facilities and other care settings, and provides pharmacy fulfillment services to support the Health Services segment’s specialty and mail order pharmacy offerings. As of December 31, 2024, the Pharmacy & Consumer Wellness segment operated more than 9,000 retail locations, as well as online retail pharmacy websites, LTC pharmacies and on-site pharmacies, retail specialty pharmacy stores, compounding pharmacies and branches for infusion and enteral nutrition services.\nOverview of the Corporate/Other Segment\nThe Company presents the remainder of its financial results in the Corporate/Other segment, which primarily consists of:\nManagement and administrative expenses to support the Company’s overall operations, which include certain aspects of executive management and the corporate relations, legal, compliance, human resources and finance departments, information technology, digital, data and analytics, as well as acquisition-related transaction and integration costs; and\nProducts for which the Company no longer solicits or accepts new customers such as its large case pensions and long-term care insurance products.\nResults of Operations\nThe following information summarizes the Company’s results of operations for 2024 compared to 2023.\nSummary of Consolidated Financial Results\nYear Ended December 31,\nNet investment income\nCost of products sold\nRestructuring charges\nOpioid litigation charges\nLoss on assets held for sale\nTotal operating costs\nGain on early extinguishment of debt\nIncome before income tax provision\nIncome tax provision\nNet (income) loss attributable to noncontrolling interests\nNet income attributable to CVS Health\nCommentary - 2024 compared to 2023\nTotal revenues increased $15.0 billion, or 4.2%, in 2024 compared to 2023. The increase in total revenues was driven by growth in the Health Care Benefits and Pharmacy & Consumer Wellness segments, partially offset by a decline in the Health Services segment.\nPlease see “Segment Analysis” later in this MD&A for additional information about the revenues of the Company’s segments.\nOperating expenses increased $1.8 billion, or 4.5%, in 2024 compared to 2023. The increase in operating expenses was primarily due to increased operating expenses to support growth in the business.\nPlease see “Segment Analysis” later in this MD&A for additional information about the operating expenses of the Company’s segments.\nOperating income decreased $5.2 billion, or 38.0%, in 2024 compared to 2023. The decrease in operating income was primarily driven by a decrease in adjusted operating income, which is primarily the result of elevated Medicare utilization in the Health Care Benefits segment, and an increase in restructuring charges compared to 2023. These decreases in operating income were partially offset by an increase in net realized capital gains, the absence of a $349 million loss on assets held for sale related to the write-down of the Company’s Omnicare\nlong-term care business recorded in the prior year, as well as lower acquisition-related transaction and integration costs.\nPlease see “Segment Analysis” later in this MD&A for additional information about the operating results of the Company’s segments.\nInterest expense increased $300 million, or 11.3%, in 2024 compared to 2023, due to higher debt in the year ended December 31, 2024 primarily as a result of long-term debt issuances in 2024. See “Liquidity and Capital Resources” later in this report for additional information.\nGain on early extinguishment of debt\nDuring 2024, the gain on early extinguishment of debt relates to the Company’s repayment of $2.6 billion of its outstanding senior notes pursuant to its tender offers for such senior notes in December 2024, which resulted in a gain on early extinguishment of debt of $491 million. See Note 10 ‘‘Borrowings and Credit Agreements’’ included in Item 8 of this 10-K for additional information.\nIncome tax provision\nThe Company’s effective income tax rate increased to 25.4% in 2024 compared to 25.1% in the prior year. The increase was primarily due to the mix of pre-tax income and certain non-deductible expenses, partially offset by basis differences on the disposition of certain investments and utilization of tax credits in the year ended December 31, 2024 compared to the prior year.\nThe Company believes you should consider the following key business and regulatory trends and uncertainties:\nKey Business Trends and Uncertainties\nThe Company expects medical membership declines in its Medicare and individual exchange products. Medical membership disruptions may result in volatility in the Company’s financial results.\nUtilization persisted at elevated levels through the fourth quarter of 2024. Although the level of utilization is difficult to accurately predict, at this time, the Company expects that continued elevated utilization will pressure its Health Care Benefits segment and its health care delivery assets in its Health Services segment into 2025.\nIncreases in utilization beyond the Company’s projections may also result in the Company having to record premium deficiency reserves within in the Health Care Benefits segment during 2025.\nThe Company’s Medicaid business is experiencing medical cost pressures, largely driven by higher than expected acuity following the resumption of member redeterminations. While the Company continues to work closely with its state partners to ensure the underlying trends are reflected in its premium rates going forward, it is uncertain when these pressures will be fully offset by state rate updates.\nThe Company’s individual exchange business is subject to a risk adjustment program whereby the Company estimates its ultimate risk adjustment receivable or payable based on the risk of its qualified plan members relative to the average risk of members of other qualified plans in comparable markets. Changes in the Company’s risk relative to the markets’ risk, including changes resulting from volatility in membership, could adversely impact the Company’s estimate of its risk adjustment receivable or payable.\nThe Company continues to share with clients a larger portion of rebates, fees and/or discounts received from pharmaceutical manufacturers. In addition, marketplace dynamics and regulatory changes have limited the Company’s ability to offer plan sponsors pricing that includes retail network “differential” or “spread.” The Company expects these trends to continue.\nGlucagon-like peptide 1 (“GLP-1”) supply disruptions, and the associated impact on product mix, could pressure the Company’s ability to deliver savings to clients and could impact the Company’s results.\nRegulatory changes or consumer sentiment shift for immunizations may negatively impact national demand impacting financial results.\nImplementation of new tariffs create exposure for increased costs and supply chain disruptions that can adversely impact consumer demand or financial results.\nConsumer spend management and a decline in consumer discretionary spending, as well as a shift to value, grocery and digital retailers, could drive lower front store sales.\nFuture financial performance will be influenced by a number of factors including competitive demand for products and services, legislative and regulatory considerations, and labor and other market dynamics, including inflation. The Company evaluates and adjusts its approach in each of the markets it serves, considering all relevant factors.\nThe Company expects benefits from ongoing enterprise-wide cost savings initiatives and investments in efficiencies, which aim to reduce the Company’s operating cost structure in a way that improves the consumer experience and is sustainable. During the third quarter of 2024, the Company finalized an enterprise-wide restructuring plan intended to streamline and simplify the organization, improve efficiency and generate expected cost savings of over $500 million in 2025. Refer to Note 3 ‘‘Restructuring’’ for actions implemented under the plan.\nChanges in conditions in the U.S. and global capital markets can significantly and adversely affect interest rates and capital market conditions which could result in increased financing costs.\nActions taken by ratings agencies, including changes in the Company’s debt ratings, could impact the Company’s future borrowing costs, access to capital markets and new store operating lease costs.\nKey Regulatory Trends and Uncertainties\nThe Company is exposed to funding and regulation of, and changes in government policy with respect to and/or funding or regulation of, the various Medicare programs in which the Company participates, including changes in the amounts payable to us under those programs and/or new reforms or surcharges on existing programs, including changes to applicable risk adjustment mechanisms.\nLegislation and/or regulations seeking to regulate PBM activities in a comprehensive manner have been proposed or enacted in a majority of states and on the federal level. This legislative and regulatory activity could adversely affect\nthe Company’s ability to conduct business on commercially reasonable terms and the Company’s ability to standardize its PBM products and services across state lines.\nFor additional information regarding these and other trends and uncertainties, see Item 1A, “Risk Factors” and Part I, Item 1 “Business - Government Regulation.”\nThe following discussion of segment operating results is presented based on the Company’s reportable segments in accordance with the accounting guidance for segment reporting and is consistent with the segment disclosure in Note 19 ‘‘Segment Reporting’’ included in Item 8 of this 10-K.\nThe Company has four reportable segments: Health Care Benefits, Health Services, Pharmacy & Consumer Wellness and Corporate/Other. The Company’s segments maintain separate financial information, and the Chief Operating Decision Maker (“the CODM”) evaluates the segments’ operating results on a regular basis in deciding how to allocate resources among the segments and in assessing segment performance. The Company’s CODM is the Chief Executive Officer. The CODM evaluates the performance of the Company’s segments based on adjusted operating income (loss). Adjusted operating income is defined as operating income as measured by accounting principles generally accepted in the United States of America (“GAAP”) excluding the impact of amortization of intangible assets, net realized capital gain",
  "item2_clean": null
}