{
  "source_file": "cvs-20250930.htm",
  "form_type": "10-Q",
  "item1_clean": null,
  "item7_clean": null,
  "item2_clean": "Item 2. Management’s Discussion and Analysis of Financial Condition and Results of Operations (“MD&A”)\nOverview of Business\nCVS Health Corporation, together with its subsidiaries (collectively, “CVS Health,” the “Company,” “we,” “our” or “us”), is a leading health solutions company building a world of health around every consumer it serves and connecting care so that it works for people wherever they are. As of September 30, 2025, the Company had approximately 9,000 retail locations, more than 1,000 walk-in and primary care medical clinics and a leading pharmacy benefits manager with approximately 87 million plan members and expanding specialty pharmacy solutions. The Company also serves an estimated more than 37 million people through traditional, voluntary and consumer-directed health insurance products and related services, including expanding Medicare Advantage offerings and a leading standalone Medicare Part D prescription drug plan (“PDP”). The Company is creating new sources of value through its integrated model allowing it to expand into personalized, technology driven care delivery and health services, increasing access to quality care, delivering better health outcomes and lowering overall health care costs.\nThe Company has four reportable segments: Health Care Benefits, Health Services, Pharmacy & Consumer Wellness and Corporate/Other, which are described below.\nOverview of the Health Care Benefits Segment\nThe Health Care Benefits segment operates as one of the nation’s leading diversified health care benefits providers through its Aetna\noperations. The Health Care Benefits segment has the information and resources to help members, in consultation with their health care professionals, make more informed decisions about their health care. The Health Care Benefits segment offers a broad range of traditional, voluntary and consumer-directed health insurance products and related services, including medical, pharmacy, dental and behavioral health plans, medical management capabilities, Medicare Advantage and Medicare Supplement plans, PDPs and Medicaid health care management services. The Health Care Benefits segment’s primary customers, its members, primarily access the segment’s products and services through employer groups, government-sponsored plans or individually. The Health Care Benefits segment also serves customers who purchase products and services that are ancillary to its health insurance products. The Company refers to insurance products (where it assumes all or a majority of the risk for medical and dental care costs) as “Insured” and administrative services contract products (where the plan sponsor assumes all or a majority of the risk for medical and dental care costs) as “ASC.” The Company also sells Insured plans directly to individual consumers through the individual public health insurance exchanges. The Company plans to exit the states in which Aetna operates on the individual public health insurance exchanges effective January 2026.\nOverview of the Health Services Segment\nThe Health Services segment provides a full range of pharmacy benefit management (“PBM”) solutions through its CVS Caremark\noperations and delivers health care services in its medical clinics, virtually, and in the home. PBM solutions include plan design offerings and administration, formulary management, retail pharmacy network management services, and specialty and mail order pharmacy services. In addition, the Company provides clinical services, disease management services, medical spend management and pharmacy and/or other administrative services for providers and federal 340B drug pricing program covered entities (“Covered Entities”). The Company operates a group purchasing organization that negotiates pricing for the purchase of pharmaceuticals and rebates with pharmaceutical manufacturers on behalf of its participants and provides various administrative, management and reporting services to pharmaceutical manufacturers. The segment also works directly with pharmaceutical manufacturers to commercialize and/or co-produce high quality biosimilar products through its Cordavis\nTM\nsubsidiary. The Health Services segment’s health care delivery assets include Signify Health, Inc. (“Signify Health”), a leader in health risk assessments and value-based care, and Oak Street Health, Inc. (“Oak Street Health”), a leading multi-payor operator of value-based primary care centers serving Medicare eligible patients. The Health Services segment’s clients and customers are primarily employers, insurance companies, unions, government employee groups, health plans, PDPs, Medicaid managed care plans, the U.S. Centers for Medicare & Medicaid Services (“\nCMS”),\nplans offered on public and private health insurance exchanges and other sponsors of health benefit plans throughout the U.S., patients who receive care in the Health Services segment’s medical clinics, virtually or in the home, as well as Covered Entities.\nOverview of the Pharmacy & Consumer Wellness Segment\nThe Pharmacy & Consumer Wellness segment dispenses prescriptions in its CVS Pharmacy\nretail locations and through its infusion operations, provides ancillary pharmacy services including pharmacy patient care programs, diagnostic testing and vaccination administration, and sells a wide assortment of health and wellness products and general merchandise. The segment\nalso provides pharmacy fulfillment services to support the Health Services segment’s specialty and mail order pharmacy offerings. As of September 30, 2025, the Pharmacy & Consumer Wellness segment operated approximately 9,000 retail locations, as well as online retail pharmacy websites, retail specialty pharmacy stores, compounding pharmacies and branches for infusion and enteral nutrition services.\nOverview of the Corporate/Other Segment\nThe Company presents the remainder of its financial results in the Corporate/Other segment, which primarily consists of:\nManagement and administrative expenses to support the Company’s overall operations, which include certain aspects of executive management and the corporate relations, legal, compliance, human resources and finance departments, information technology, digital, data and analytics, as well as acquisition-related integration costs; and\nProducts for which the Company no longer solicits or accepts new customers, such as its large case pensions and long-term care insurance products.\nSummary of Consolidated Financial Results\nNet investment income\nCost of products sold\nRestructuring charges\nTotal operating costs\nOperating income (loss)\nGain on deconsolidation of subsidiary\nIncome (loss) before income tax provision\nIncome tax provision\nNet loss attributable to noncontrolling interests\nNet income (loss) attributable to CVS Health\nCommentary - Three Months Ended September 30, 2025 vs. 2024\nTotal revenues increased $7.4 billion, or 7.8%, in the three months ended September 30, 2025 compared to the prior year driven by revenue growth across all operating segments.\nPlease see “Segment Analysis” later in this report for additional information about the revenues of the Company’s segments.\nOperating expenses increased $731 million, or 6.9%, in the three months ended September 30, 2025 compared to the prior year. The increase in operating expenses was primarily due to a $320 million opioid litigation charge related to a change in the Company’s accrual for ongoing opioid litigation matters recorded during the three months ended September 30, 2025, as well as increased investments in colleagues and capabilities.\nPlease see “Segment Analysis” later in this report for additional information about the operating expenses of the Company’s segments.\nOperating income (loss)\nDuring the three months ended September 30, 2025, the Company incurred an operating loss of $3.2 billion compared to operating income of $832 million in the prior year. The difference was primarily driven by a $5.7 billion goodwill impairment charge related to the Health Care Delivery reporting unit, partially offset by improved operating performance in the Health Care Benefits segment and the absence of approximately $1.2 billion of restructuring charges recorded in the prior year.\nPlease see “Segment Analysis” later in this report for additional information about the operating results of the Company’s segments.\nGain on deconsolidation of subsidiary\nDuring the three months ended September 30, 2025, the gain on deconsolidation of subsidiary relates to Omnicare, LLC (“Omnicare”), a wholly-owned indirect subsidiary of CVS Health Corporation, and certain of its subsidiary entities (collectively, the “Omnicare Entities”). See Note 1 ‘‘Significant Accounting Policies’’ to the unaudited condensed consolidated financial statements for further information on the deconsolidation of the Omnicare Entities.\nInterest expense increased $32 million, or 4.3%, due to higher debt in the three months ended September 30, 2025, primarily as a result of long-term debt issued in December of 2024 and August of 2025.\nIncome tax provision\nThe effective income tax rate was (14.6)% for the three months ended September 30, 2025 compared to 32.4% for the three months ended September 30, 2024. The change in the effective income tax rate was primarily due to the $5.7 billion goodwill impairment charge recorded in the three months ended September 30, 2025, which was not deductible for income tax purposes.\nCommentary - Nine Months Ended September 30, 2025 vs. 2024\nTotal revenues increased $21.3 billion, or 7.7%, in the nine months ended September 30, 2025 compared to the prior year driven by revenue growth across all operating segments.\nPlease see “Segment Analysis” later in this report for additional information about the revenues of the Company’s segments.\nOperating expenses increased $2.3 billion, or 7.5%, in the nine months ended September 30, 2025 compared to the prior year. The increase in operating expenses was primarily due to $1.2 billion "
}