{
  "source_file": "cvx-20241231.htm",
  "form_type": "10-K",
  "item1_clean": "General Development of Business\nSummary Description of Chevron\n, a Delaware corporation, manages its investments in subsidiaries and affiliates and provides administrative, financial, management and technology support to U.S. and international subsidiaries that engage in integrated energy and chemicals operations. Upstream operations consist primarily of exploring for, developing, producing and transporting crude oil and natural gas; processing, liquefaction, transportation and regasification associated with liquefied natural gas; transporting crude oil by major international oil export pipelines; transporting, storage and marketing of natural gas; carbon capture and storage; and a gas-to-liquids plant. Downstream operations consist primarily of refining crude oil into petroleum products; marketing of crude oil, refined products and lubricants; manufacturing and marketing of renewable fuels; transporting crude oil and refined products by pipeline, marine vessel, motor equipment and rail car; and manufacturing and marketing of commodity petrochemicals, plastics for industrial uses and fuel and lubricant additives.\nA list of the company’s significant subsidiaries is presented in\nOverview of Petroleum Industry\nPetroleum industry operations and profitability are influenced by many factors. Prices for crude oil, natural gas, liquefied natural gas (LNG), petroleum products and petrochemicals are generally determined by supply and demand. Production levels from the members of Organization of Petroleum Exporting Countries (OPEC), Russia and the United States are the major factors in determining worldwide supply. Demand for crude oil and its products and for natural gas is largely driven by the conditions of local, national and global economies, although weather patterns, the pace of energy transition and taxation relative to other energy sources also play a significant part. Laws and governmental policies, particularly in the areas of taxation, energy and the environment, affect where and how companies invest, conduct their operations, select feedstocks, and formulate their products and, in some cases, limit their profits directly.\nStrong competition exists in all sectors of the petroleum and petrochemical industries in supplying the energy, fuel and chemical needs of industry and individual consumers. In the upstream business, Chevron competes with fully integrated, major global petroleum companies, as well as independent and national petroleum companies, for the acquisition of crude oil and natural gas leases and other properties and for the equipment and labor required to develop and operate those properties. In its downstream business, Chevron competes with fully integrated, major petroleum companies, as well as independent refining and marketing, transportation and chemicals entities and national petroleum companies in the refining, manufacturing, sale and marketing of fuels, lubricants, additives and petrochemicals.\nOperating Environment\nBusiness Environment and Outlook\nChevron’s Strategic Direction\nChevron’s strategy is to leverage our strengths to safely deliver lower carbon energy to a growing world. Our objective is to safely deliver higher returns, lower carbon and superior shareholder value in any business environment. We are leveraging our capabilities, assets and customer relationships as we aim to lead in lower carbon intensity oil, products and natural gas, as well as advance new products and solutions that reduce the carbon emissions of major industries. We aim to grow our oil and gas business, lower the carbon intensity of our operations and grow new businesses in renewable fuels, carbon capture and offsets, hydrogen, power generation for data centers, and emerging technologies.\nInformation about the company is available on the company’s website at\n\n* Includes employees where data was not collected or employee chose not to disclose.\nHiring, Development and Retention\nThe company’s approach to attracting, developing and retaining a global, diverse workforce of high-performing talent is anchored by an environment of personal growth and engagement. The company’s philosophy is to offer compelling career opportunities and a competitive total compensation and benefits package linked to individual and enterprise performance. The company recruits new employees in a variety of ways, including through partnerships with universities and diversity associations. In addition, the company recruits experienced hires to provide specialized skills.\nChevron’s learning and development programs are designed to help employees build technical, operating and leadership capabilities. The company’s leadership reviews metrics on employee training and development programs, which are refined on an ongoing basis to meet the needs of the business. The company invests in developing leadership at every level, including coaching programs for frontline supervisors, managers and individual contributors. Chevron invests in developing and upskilling employees, including things such as tailored generative AI training for leaders, practitioners and the broader workforce. In addition, the company offers the Digital Scholar Program, preparing employees with advanced technology skills through one-year Master of Science degrees in Engineering and Management.\nIn addition, leadership reviews the talent pipeline, identifies and develops succession candidates, and builds succession plans for key positions. The Board of Directors provides oversight of CEO and executive succession planning.\nManagement routinely reviews the retention of its professional population, executives, all levels of management, and the majority of its regular employee population. The voluntary attrition for this population in 2024 was 3.1 percent, in line with historical rates. The voluntary attrition rate generally excludes employee departures under restructuring programs. Chevron believes its low voluntary attrition rate is in part a result of the company’s commitment to employee development, competitive pay and benefits, and culture.\nDiversity and Inclusion\nChevron believes human ingenuity is best able to solve difficult problems when people with different ideas, experiences and backgrounds work together in an inclusive environment.\nThe company has 11 employee networks (voluntary groups open to all employees with shared interests). The Chairman’s Inclusion Council provides employee network presidents with a direct line of communication to the Chairman and Chief Executive Officer, the Chief Human Resources Officer, the Chief Diversity and Inclusion Officer, and the executive leadership team to discuss how employee networks can help reinforce the company’s values and achieve its business objectives.\nDiversity and inclusion at Chevron means zero tolerance for discrimination based on race, sex or other protected characteristics, and a deep respect for the cultures in which we operate. Chevron rejects the use of quotas and focuses on removing barriers to equal opportunity, fostering diversity, and ensuring that selection decisions are based on merit.\nEmployee engagement is an indicator of employee well-being and commitment to the company’s values, purpose and strategies. The company regularly conducts employee surveys to assess the health of the company’s culture. Our surveys indicate high levels of employee engagement compared to our industry.\nChevron prioritizes the health, safety and well-being of its employees. The company’s safety culture empowers every member of its workforce to exercise stop-work authority without repercussion to address any potential unsafe work conditions. The company has set clear expectations for leaders to deliver operational excellence by prioritizing the safety and health of its workforce, and the protection of communities, the environment and the company’s assets.\nAdditionally, the company offers long-standing employee support programs such as Ombuds, an independent resource designed to equip employees with options to address and resolve workplace issues; a company hotline, where employees can report concerns to the Corporate Compliance department; and an Employee Assistance Program, a confidential consulting service that can help employees resolve a broad range of personal, family and work-related concerns.\nDescription of Business and Properties\nThe upstream and downstream activities of the company and its equity affiliates are widely dispersed geographically, with operations and projects\nin North America, South America, Europe, Africa, Asia and Australia. These activities are managed by the Oil, Products and Gas organization. Tabulations of segment income statements for the three years ended December 31, 2024, and assets as of the end of 2024 and 2023 — for the United States and the company’s international geographic areas — are in\nNote 14 Operating Segments and Geographic Data\nto the Consolidated Financial Statements. Similar comparative data for the company’s investments in and income from equity affiliates and property, plant and equipment are in\nNote 15 Investments and Advances\nNote 18 Property, Plant and Equipment\n. Refer to Management’s Discussion and Analysis of Financial Condition and Results of Operations for a discussion of the company’s\nCapital Expenditures\nfor a tabulation of the company’s proved reserves by geographic area for each year-end from 2022 through 2024. Reserves governance, technologies used in establishing proved reserves additions, and major changes to proved reserves by geographic area for the three-year period ended December 31, 2024, are summarized in the discussion for Table V. Discussion is also provided regarding the nature of, status of, and planned future activities associated with the development of proved undeveloped reserves. The company recognizes reserves for projects with various development periods, sometimes exceeding five years. The external factors that impact the duration of a project include scope and complexity, remoteness or adverse operating conditions, infrastructure constraints, and contractual limitations.\nThe company’s proved reserves at year-end 2024 were approximately 9.8 billion barrels of oil-equivalent (BOE). The largest reductions from year-end 2023 were from record production and the sale of assets in Canada, and the largest additions were from extensions and discoveries in the Permian and DJ Basins. At December 31, 2024, 41 percent of the company’s net proved oil-equivalent reserves were located in the United States, 16 percent were located in Australia and 13 percent were located in Kazakhstan.\nThe net proved reserve balances at the end of each of the three years 2022 through 2024 are shown in the following table:\nCrude Oil, Condensate and Synthetic Oil — Millions of barrels\nConsolidated Companies\n\nChevron has a 15 percent interest in the CPC. Through 2024, CPC transporte\nd an average of 1.4 million barrels of crude oil per day, composed of 1.2 million barrels per day from Kazakhstan and 0.2 mi\nllion barrels per day from Russia.\nKurdistan Region of Iraq\nAfter relinquishment of company interests in Sarta and Qara Dagh PSCs in 2023, Chevron continues to work with the government and joint venture partner on final exit agreements, expected to be completed in early 2025.\nChevron withdrew from Myanmar, effective April 2024\nChevron holds a concession to operate the Kingdom of Saudi Arabia’s 50 percent interest in the hydrocarbon resources in the onshore area of the Partitioned Zone between Saudi Arabia and Kuwait. The concession expires in 2046. In 2024, the NWWB-1 exploration well reached total depth and was placed on production. Current activities focus on optimizing base business, further exploration and development drilling and delivering new technology that enables production growth.\nChevron holds operated interests in the Pattani Basin, located in the Gulf of Thailand, with ownership ranging from 35 percent to 71.2 percent. Concessions for produ",
  "item7_clean": null,
  "item2_clean": null
}