{
  "source_file": "cvx-20250930.htm",
  "form_type": "10-Q",
  "item1_clean": null,
  "item7_clean": null,
  "item2_clean": "Earnings for the upstream segment are closely aligned with industry prices for crude oil, natural gas and natural gas liquids (NGLs). These prices are subject to external factors over which the company has no control, including product demand connected with global economic conditions, industry production and inventory levels, technology advancements, production quotas or other actions imposed by OPEC+ countries, actions of regulators, weather-related damage and disruptions, competing fuel prices, natural and human causes beyond the company’s control, and regional supply interruptions or fears thereof that may be caused by military conflicts, civil unrest or political uncertainty. Any of these factors could also inhibit the company’s production capacity in an affected region. The company closely monitors developments in the countries in which it operates and holds investments and seeks to manage risks in operating its facilities and businesses.\nThe longer-term trend in earnings for the upstream segment is also a function of other factors, including the company’s ability to efficiently find, acquire and produce crude oil, natural gas and NGLs, changes in fiscal terms of contracts, the pace of energy transition, and changes in tax, environmental and other applicable laws and regulations.\nChevron has interests in Venezuelan assets operated by independent affiliates. Chevron has been conducting limited activities in Venezuela consistent with the authorization issued by the United States government. The financial results for Chevron’s business in Venezuela have been recorded as non-equity investments since 2020, where income is only recognized when cash is received, and production and reserves are not included\nin the company’s results. Crude oil liftings in Venezuela started in first quarter 2023, which positively impacted the company’s results. Between March 4, 2025, and July 21, 2025, Chevron activities were restricted under applicable general licenses. During this time and since July 21, 2025, Chevron has maintained its presence in Venezuela consistent with the U.S. government sanctions policy, and pursuant to this policy, expects to continue delivering a limited amount of crude oil to the U.S. from these affiliates during 2025. Further, current geopolitical tensions relating to Venezuela could have an impact on the company’s operations in Venezuela and, as a result, impact the company’s future results of operations.\nChevron maintains an equity interest in the Caspian Pipeline Consortium (CPC) that provides a primary export route for Tengiz field production in Kazakhstan. An adverse event or incident affecting CPC operations, which CPC has experienced from time to time, could have a negative impact on the Tengiz field and the company’s results of operations and financial position. The financial impacts of such risks remain uncertain.\nGovernments (including Russia) have imposed and may impose additional sanctions and other trade laws, restrictions and regulations that could lead to disruption in our ability to produce, transport, and/or export crude in the region around Russia.\nChevron holds a 39.7 percent interest in the Leviathan field and a 25 percent interest in the Tamar field in Israel. The conflict between Israel and various regional adversaries has not significantly impacted the company’s operations, with the company continuing to maintain safe and reliable operations while meeting its contractual commitments. The company continues to monitor the potential for further conflict in the region, and any future impacts on the company’s results of operations and financial condition remain uncertain.\nSources: Platts (crude) & Energy Intelligence (natural gas)\nThe chart above shows the trend in benchmark prices for Brent crude oil, West Texas Intermediate (WTI) crude oil, and U.S. Henry Hub natural gas. The Brent price averaged $71 per barrel for the first nine months of 2025, compared with $83 per barrel during the first nine months of 2024, and ended October at about $65 per barrel. For every dollar change in Brent crude oil prices, the company’s annual after-tax earnings and cash flow sensitivity is approximately $450 million. The WTI price averaged $67 per barrel for the first nine months of 2025, compared to $78 per barrel in the first nine months of 2024, and ended October at about $61 per barrel. Crude oil prices weakened slightly in the third quarter as OPEC+ countries increased production, while production from non-OPEC+ countries also continued to grow.\nThe U.S. Henry Hub natural gas price averaged $3.49 per thousand cubic feet (MCF) for the first nine months of 2025, compared with $2.20 per MCF during the first nine months of 2024, and ended October at about $3.44 per MCF. In the U.S., mild summer weather and strong production resulted in natural gas storage levels remaining at the upper end of the five-year range during third quarter 2025, leading to lower U.S. Henry Hub prices relative to second quarter 2025.\nOutside the United States, prices for natural gas also depend on regional supply and demand, regulatory circumstances and infrastructure conditions in local markets. The company’s long-term contract prices for liquified natural gas (LNG) are typically linked to crude oil prices. Most of the equity LNG offtake from the operated Australian LNG assets is committed under binding long-term contracts, with some sold in the Asian spot LNG market.\nSee page 41 for the company’s U.S. and international average realizations for the first nine months of 2025 and the same period last year.\nThe company’s worldwide net oil-equivalent production in the first nine months of 2025 averaged 3.61 million barrels per day, up 8 percent from a year ago as growth in TCO, the Permian Basin, and the Gulf of America, as well as the acquisition of Hess, was partly offset by the impacts of asset sales. About 22 percent of the company’s net oil-equivalent production in the first nine months of 2025 occurred in the OPEC+ member countries of Equatorial Guinea, Kazakhstan, Nigeria, and the Partitioned Zone between Saudi Arabia and Kuwait.\nRefer to the “Results of Operations” section on page 35 for additional discussion of the company’s upstream business.\nEarnings for the downstream segment are closely tied to margins on the refining, manufacturing and marketing of products that include gasoline, diesel, jet fuel, lubricants, fuel oil, fuel and lubricant additives, petrochemicals and renewable fuels. Industry margins are sometimes volatile and can be affected by the global and regional supply-and-demand balance for refined products and petrochemicals, and by changes in the price of crude oil, other refinery and petrochemical feedstocks, and natural gas. Industry margins can also be influenced by inventory levels, geopolitical events, costs of materials and services, refinery or chemical plant capacity utilization, maintenance programs, and disruptions at refineries or chemical plants resulting from unplanned outages due to severe weather, fires or other operational events.\nOther factors affecting profitability for downstream operations include the reliability and efficiency of the company’s refining, marketing and petrochemical assets, the effectiveness of its crude oil and product supply functions, and the volatility of tanker-charter rates for the company’s shipping operations, which are driven by the industry’s demand for crude oil and product tankers. Other factors beyond the company’s control include the general level of inflation and energy costs to operate the company’s refining, marketing and petrochemical assets, and changes in tax, environmental, and other applicable laws and regulations.\nThe company’s most significant marketing areas are the West Coast and Gulf Coast of the United States and Asia Pacific. Chevron operates or has significant ownership interests in refineries in each of these areas.\nRefer to the “Results of Operations” section beginning on page 36 for additional discussion of the company’s downstream operations.\n\nIncome (loss) net of tax; also referred to as “earnings” in the discussions that follow.\nNet income attributable to Chevron Corporation\nfor third quarter 2025 was $3.5 billion ($1.82 per share — diluted), compared with $4.5 billion ($2.48 per share — diluted) in third quarter 2024. The net income attributable to Chevron Corporation for the first nine months of 2025 was $9.5 billion ($5.27 per share —diluted), compared with $14.4 billion ($7.88 per share — diluted) in the first nine months of 2024.\nearnings in third quarter 2025 were $3.3 billion compared with $4.6 billion in the corresponding 2024 period. The decrease was mainly due to lower liquids realizations and lower affiliate earnings. Earnings for the first nine months of 2025 were $9.8 billion compared with $14.3 billion a year earlier. The decrease was mainly due to lower liquids realizations and lower affiliate earnings.\nearnings in third quarter 2025 were $1.1 billion compared with $595 million in the corresponding 2024 period. The increase was mainly due to higher margins on refined product sales and lower operating expenses, partly offset by lower earnings from the 50 percent-owned Chevron Phillips Chemical Company. Earnings for the first nine months of 2025 were $2.2 billion compared with $2.0 billion a year earlier. The increase was mainly due to higher margins on refined product sales and lower operating expenses, partly offset by lower earnings from the 50 percent-owned Chevron Phillips Chemical Company.\n“Results of Operations”\nfor additional discussion of results by business segment and “All Other” activities for the third quarter and first nine months of 2025 versus the same period in 2024.\nBusiness Environment and Outlook\nis a global energy company with direct and indirect subsidiaries and affiliates that conduct substantial business activities in the following countries: Angola, Argentina, Australia, Bangladesh, Brazil, Canad"
}