{
  "source_file": "d-20250930.htm",
  "form_type": "10-Q",
  "item1_clean": "The following sensitivity analysis estimates the potential loss of future earnings or fair value from market risk sensitive instruments over a selected time period due to a 10% change in commodity prices, interest rates or foreign currency exchange rates.\nCommodity Price Risk\nTo manage price risk, the Companies hold commodity-based derivative instruments held for non-trading purposes associated with purchases and sales of electricity, natural gas and other energy-related products.\nThe derivatives used to manage commodity price risk are executed within established policies and procedures and may include instruments such as futures, forwards, swaps, options and FTRs that are sensitive to changes in the related commodity prices. For sensitivity analysis purposes, the hypothetical change in market prices of commodity-based derivative instruments is determined based on models that consider the market prices of commodities in future periods, the volatility of the market prices in each period, as well as the time value factors of the derivative instruments. Prices and volatility are principally determined based on observable market prices.\nA hypothetical 10% decrease in commodity prices would have resulted in a decrease of $18 million and a hypothetical 10% increase in commodity prices would have resulted in a decrease of $18 million in the fair value of Dominion Energy’s commodity-based derivative instruments as of September 30, 2025 and December 31, 2024, respectively.\nA hypothetical 10% decrease in commodity prices would have resulted in a decrease of $72 million and $15 million in the fair value of Virginia Power’s commodity-based derivative instruments as of September 30, 2025 and December 31, 2024, respectively.\nThe impact of a change in energy commodity prices on the Companies’ commodity-based derivative instruments at a point in time is not necessarily representative of the results that will be realized when the contracts are ultimately settled. Net losses from commodity-based financial derivative instruments used for hedging purposes, to the extent realized, will generally be offset by recognition of the hedged transaction, such as revenue from physical sales of the commodity.\nThe Companies manage their interest rate risk exposure predominantly by maintaining a balance of fixed and variable rate debt. For variable rate debt outstanding for Dominion Energy, a hypothetical 10% increase in market interest rates would result in an $11 million and $12 million decrease in earnings at September 30, 2025 and December 31, 2024, respectively. For variable rate debt outstanding for Virginia Power, a hypothetical 10% increase in market interest rates would result in a less than $1 million and $7 million decrease in earnings at September 30, 2025 and December 31, 2024, respectively.\n\nITEM\n3. QUANTITATIVE AND QUALITATIVE\nDISCLOSURES ABOUT MARKET RISK\nThe matters discussed in this Item may contain “forward-looking statements” as described in the introductory paragraphs under Part I., Item 2. MD&A in this report. The reader’s attention is directed to those paragraphs for discussion of various risks and uncertainties that may impact the Companies.\nMarket Risk Sensitive Instruments and Risk Management\nThe Companies’ financial instruments, commodity contracts and related financial derivative instruments are exposed to potential losses due to adverse changes in commodity prices, interest rates, foreign currency exchange rates and equity securities prices as described below. Commodity price risk is present in the Companies’ electric operations and Dominion Energy’s natural gas procurement and marketing operations due to the exposure to market shifts in prices received and paid for electricity, natural gas and other commodities. The Companies use commodity derivative contracts to manage price risk exposures for these operations. Interest rate risk is generally related to their outstanding debt and future issuances of debt. In addition, the Companies are exposed to investment price risk through various portfolios of equity and debt securities. The Companies’ exposure to foreign currency exchange rate risk is related to certain fixed price contracts associated with the CVOW Commercial Project which it manages through foreign currency exchange rate derivatives. The contracts include services denominated in currencies other than the U.S. dollar for approximately €2.6 billion and 5.1 billion kr. In addition, certain of the fixed price contracts, approximately €0.7 billion, contain commodity indexing provisions linked to steel.\n\nCVOW Commercial Project\nIn September 2019, Virginia Power filed applications with PJM for the CVOW Commercial Project and for certain approvals and rider recovery from the Virginia Commission in November 2021. The 2.6 GW project is expected to be placed in service by the end of 2026 with an estimated total project cost of approximately $11.2 billion, excluding financing costs, that reflects an estimated impact of certain tariffs which became effective during 2025. The Companies’ projected impact of tariffs on expected total project cost is subject to change due to the inherent uncertainty associated with which tariffs, if any, may be in effect and the associated requirements and rates of such tariffs. Virginia Power’s estimate for the project’s projected levelized cost of energy, including renewable energy credits, is approximately $84/MWh, compared to the initial filing submission of $80-90/MWh.\nThe expected total project cost increase of $0.3 billion relative to Virginia Power’s August 2025 construction update filing with the Virginia Commission reflects current projections of tariffs on equipment expected to be delivered from March 2025 through the end of 2025 that originates from Mexico, Canada, a European Union member or other applicable countries and on equipment expected to be delivered from March 2025 through the end of 2026 that contains steel. The actual tariffs to be incurred are dependent upon the tariff requirements and rates, if any, at the time of delivery of the specific component. If the current tariffs were to remain in effect through the end of 2026, the expected project costs for offshore wind and onshore electrical\n\nVirginia Power commenced major onshore construction activities for the CVOW Commercial Project in November 2023 following the receipt of a record of decision from BOEM in October 2023 for construction. Onshore construction activities are anticipated to be completed in early 2026. Virginia Power commenced major offshore construction activities in May 2024 following the receipt of final approval from BOEM authorizing offshore construction and necessary permits from the U.S. Army Corps of Engineers for offshore construction in January 2024. Virginia Power completed the installation of all 176 monopiles in October 2025. Transition pieces began to be installed on monopiles near the end of 2024 with 63 transition pieces installed through October 2025 and the remaining 113 expected to be installed by early 2026. The first of three offshore substations was installed in March 2025. Deepwater export cables commenced being laid in late 2024 with the last of nine completed in July 2025. Of the 176 segments of interarray cable, expected to total 260 miles, 48 have been installed through October 2025 with the remaining to be laid throughout 2025 and 2026. Turbines are expected to commence installment in the fourth quarter of 2025 and be completed by the end of 2026.\n\nThe Companies also use interest rate derivatives, including forward-starting swaps, interest rate swaps and interest rate lock agreements to manage interest rate risk. As of September 30, 2025, Dominion Energy and Virginia Power had $13.9 billion and $9.3 billion, respectively, in aggregate notional amounts of these interest rate derivatives outstanding in combined absolute value of their long and short positions, except in the case of offsetting transactions, for which they represent the absolute value of the net volume of their long and short positions. A hypothetical 10% decrease in market interest rates would have resulted in a decrease of $456 million and $376 million, respectively, in the fair value of Dominion Energy and Virginia Power’s interest rate derivatives at September 30, 2025. As of December 31, 2024, Dominion Energy and Virginia Power had $10.8 billion and $3.8 billion, respectively, of these interest rate derivatives outstanding in combined absolute value of their long and short positions, except in the case of offsetting transactions, for which they represent the absolute value of the net volume of their long and short positions. A hypothetical 10% decrease in market interest rates would have resulted in a decrease of $157 million and $155 million, respectively, in the fair value of Dominion Energy and Virginia Power’s interest rate derivatives at December 31, 2024.\n\nThe impact of a change in interest rates on the Companies’ interest rate-based financial derivative instruments at a point in time is not necessarily representative of the results that will be realized when the contracts are ultimately settled. Net gains and/or losses from interest rate derivative instruments used for hedging purposes, to the extent realized, will generally be offset by recognition of the hedged transaction.\nForeign Currency Exchange Rate Risk\nThe Companies utilize foreign currency exchange rate swaps to economically hedge the foreign currency exchange risk associated with fixed price contracts related to the CVOW Commercial Project denominated in foreign currencies. As of September 30, 2025 and December 31, 2024, Dominion Energy had €894 million and €1.1 billion, respectively, in aggregate notional amounts of these foreign currency forward purchase agreements outstanding. A hypothetical 10% increase in the U.S. dollar to Euro exchange rate would have resulted in a decrease of $72 million and $106 million in the fair value of Dominion Energy’s foreign currency swaps at September 30, 2025 and December 31, 2024, respectively.\nThe impact of a change in exchange rates on the Companies’ foreign currency-based financial derivative instruments at a point in time is not necessarily representative of the results that will be realized when the contracts are ultimately settled. Net gains and/or losses from foreign exchange derivative instruments used for hedging purposes, to the extent realized, will generally be offset by recognition of the hedged transaction.\nInvestment Price Risk\nThe Companies are subject to investment price risk due to securities held as investments in nuclear decommissioning and rabbi trust funds that are managed by third-party investment managers. These trust funds primarily hold marketable securities that are reported in the Companies’ Consolidated Balance Sheets at fair value.\nDominion Energy recognized net investment gains (losses) (including investment income) on nuclear decommissioning and rabbi trust investments of $854 million, $1.0 billion and $1.1 billion for the nine months ended September 30, 2025 and 2024 and the year ended December 31, 2024, respectively. Net realized gains and losses include gains and losses from the sale of investments as well as any other-than-temporary declines in fair value. Dominion Energy recorded in AOCI and regulatory liabilities, a net increase in unrealized (losses) gains on debt investments of $52 million, $41 million and $(28) million for the nine months ended September 30, 2025 and 2024 and the year ended December 31, 2024, respectively.\n\nPART II.\nOTHER\nINFORMATION\nITEM 1. LEGAL PROCEEDINGS\nFrom time to time, the Companies are parties to various legal, environmental or other regulatory proceedings, including in the ordinary course of business. SEC regulations require disclosure of certain environmental matters when a governmental authority is a party to the proceedings and such proceedings involve potential monetary sanctions that the C",
  "item7_clean": null,
  "item2_clean": "Unusual weather conditions and their effect on energy sales to customers and energy commodity prices;\nExtreme weather events and other natural disasters, including, but not limited to, hurricanes, high winds, severe storms, earthquakes, flooding, wildfires, climate changes and changes in water temperatures and availability that can cause outages and property damage to facilities;\nThe impact of extraordinary external events, such as the pandemic health event resulting from COVID-19, and their collateral consequences, including extended disruption of economic activity in the Companies\nmarkets and global supply chains;\nFederal, state and local legislative and regulatory developments;\nChanges in or interpretations of federal and state tax laws and regulations, including those related to tax credits or other incentives;\nRisks of operating businesses in regulated industries that are subject to changing regulatory structures;\nChanges to regulated electric rates collected by the Companies and regulated gas distribution rates collected by Dominion Energy;\nChanges in rules for RTOs and ISOs in which the Companies join and/or participate, including changes in rate designs, changes in FERC’s interpretation of market rules and new and evolving capacity models;\nRisks associated with Virginia Power’s membership and participation in PJM, including risks related to obligations created by the default of other participants;\nRisks associated with entities in which the Companies share ownership with third parties, such as Stonepeak’s noncontrolling interest in the CVOW Commercial Project, including risks that result from lack of sole decision-making authority, disputes that may arise between the Companies and third party participants and difficulties in exiting these arrangements;\nTiming and receipt of regulatory approvals necessary for planned construction or growth projects and compliance with conditions associated with such regulatory approvals;\nThe inability to complete planned construction, conversion or growth projects at all, or with the outcomes or within the terms and time frames initially anticipated, including as a result of increased public involvement, intervention or litigation in such projects;\nRisks and uncertainties that may impact the Companies’ ability to construct the CVOW Commercial Project within the currently proposed timeline, or at all, and consistent with current cost estimates along with the ability to recover such costs from customers;\nRisks and uncertainties associated with the timely receipt of future capital contributions, including optional capital contributions, if any, from Stonepeak associated with the construction of the CVOW Commercial Project;\nChanges to federal, state and local environmental laws and regulations, including those related to climate change, the tightening of emission or discharge limits for GHGs and other substances, more extensive permitting requirements and the regulation of additional substances;\nCost of environmental strategy and compliance, including those costs related to climate change;\nChanges in implementation and enforcement practices of regulators relating to environmental standards and litigation exposure for remedial activities;\nDifficulty in anticipating mitigation requirements associated with environmental and other regulatory approvals or related appeals;\nUnplanned outages at facilities in which the Companies have an ownership interest;\nThe impact of operational hazards, including adverse developments with respect to plant safety or integrity,\n\nRisks associated with the operation of nuclear facilities, including costs associated with the disposal of spent nuclear fuel, decommissioning, plant maintenance and changes in existing regulations governing such facilities;\nChanges in operating, maintenance and construction costs;\nThe availability of nuclear fuel, natural gas, purchased power or other materials utilized by the Companies to provide electric generation, transmission and distribution and/or gas distribution services to their customers;\nDomestic terrorism and other threats to the Companies’ physical and intangible assets, as well as threats to cybersecurity;\nAdditional competition in industries in which the Companies operate, including in electric markets in which Dominion Energy’s nonregulated generation facilities operate and potential competition from the development and deployment of alternative energy sources, such as self-generation and distributed generation technologies, and availability of market alternatives to large commercial and industrial customers;\nCompetition in the development, construction and ownership of certain electric transmission facilities in the Companies’ service territory in connection with Order 1000;\nChanges in technology, particularly with respect to new, developing or alternative sources of generation and smart grid technologies;\nChanges in demand for the Companies’ services, including industrial, commercial and residential growth or decline in the Companies’ service areas, failure to maintain or replace customer contracts on favorable terms, changes in customer growth or usage patterns, including as a result of energy conservation programs, the availability of energy efficient devices and the use of distributed generation methods;\nRisks and uncertainties associated with increased energy demand or significant accelerated growth in demand due to new data centers, including the concentration of data centers primarily in Loudoun County, Virginia and the ability to obtain regulatory approvals, environmental and other permits to construct new facilities in a timely manner;\nThe technological and economic feasibility of large-scale battery storage, carbon capture and storage, small modular reactors, hydrogen and/or other clean energy technologies;\nReceipt of approvals for, and timing of, closing dates for acquisitions and divestitures;\nImpacts of acquisitions, divestitures, transfers of assets to joint ventures and retirements of assets based on asset portfolio reviews;\nAdverse outcomes in litigation matters or regulatory proceedings;\nCounterparty credit and performance risk;\nFluctuations in the value of investments held in nuclear decommissioning trusts by the Companies and in benefit plan trusts by Dominion Energy;\nFluctuations in energy-related commodity prices and the effect these could have on Dominion Energy’s earnings and the Companies’ liquidity position and the underlying value of their assets;\nFluctuations in interest rates;\nChanges in rating agency requirements or credit ratings and their effect on availability and cost of capital;\nGlobal capital market conditions, including the availability of credit and the ability to obtain financing on reasonable terms;\nPolitical and economic conditions, including tariffs, inflation and deflation;\nEmployee workforce factors including collective bargaining agreements and labor negotiations with union employees; and\nChanges in financial or regulatory accounting principles or policies imposed by governing bodies.\nThe Companies’ forward-looking statements are based on beliefs and assumptions using information available at the time the statements are made. The Companies caution the reader not to place undue reliance on their forward-looking statements because the assumptions, beliefs, expectations and projections about future events may, and often do, differ materially from actual results. The Companies undertake no obligation to update any forward-looking statement to reflect developments occurring after the statement is made.\n\nThird Quarter 2025 vs. 2024\nNet income attributable to Dominion Energy increased 8%, primarily due to higher rider equity returns reflecting capital investments at Virginia Power and an increase in net investment earnings on nuclear decommissioning trust funds, partially offset by decreased unrealized gains on economic hedging activities and a 50% noncontrolling interest in the CVOW Commercial Project sold to Stonepeak in October 2024, including impacts of a charge for costs not expected to be recovered from customers.\nYear-To-Date 2025 vs. 2024\nNet income attributable to Dominion Energy increased 28%, primarily due to the absence of lower market-related impacts on pension and other postretirement plans, higher rider equity returns reflecting capital investments at Virginia Power, an increase in non-fuel base rates associated with the settlement of the 2024 electric base rate case in South Carolina, the absence of an impairment associated with the Questar Gas Transaction, an increase in sales to electric utility retail customers associated with economic and other usage factors and an increase in renewable energy tax credits. These increases were partially offset by a 50% noncontrolling interest in the CVOW Commercial Project sold to Stonepeak in October 2024, including impacts of charges for costs not expected to be recovered from customers, a decrease in net investment earnings on nuclear decommissioning trust funds, an increase in charges associated with severe weather events, including storm damage and restoration costs, affecting Virginia Power and the closings of the East Ohio, Questar Gas and PSNC Transactions.\n\nCorporate and Other includes specific items attributable to Dominion Energy’s primary operating segments that are not included in profit measures evaluated by executive management in assessing the segments’ performance or in allocating resources. See Note 21 to the Consolidated Financial Statements in this report for discussion of these items in more detail. Corporate and Other also includes items attributable to the Corporate and Other segment. For the three months ended September 30, 2025, Dominion Energy reported an insignificant amount of specific items in the Corporate and Other segment. For the nine months ended September 30, 2025, this primarily included $23 million after-tax loss for derivative mark-to-market changes.\nFor the three months ende"
}