{
  "source_file": "d-20241231.htm",
  "form_type": "10-K",
  "item1_clean": null,
  "item7_clean": "The CEA, as amended by Title VII of the Dodd-Frank Act, requires certain over-the counter derivatives, or swaps, to be cleared through a derivatives clearing organization and, if the swap is subject to a clearing requirement, to be executed on a designated contract market or swap execution facility. Non-financial entities that use swaps to hedge or mitigate commercial risk may elect the end-user exception to the CEA’s clearing requirements. Dominion Energy utilizes the end-user exception with respect to its swaps. If, as a result of changes to the rulemaking process, Dominion Energy can no longer utilize the end-user exception or otherwise becomes subject to mandatory clearing, exchange trading or margin requirements, it could be subject to higher costs due to decreased market liquidity or increased margin payments. In addition, Dominion Energy’s swap dealer counterparties may attempt to pass-through additional trading costs in connection with changes to the rulemaking process. Due to the evolving rulemaking process, Dominion Energy is currently unable to assess the potential impact of the Dodd-Frank Act’s derivative-related provisions on its financial condition, results of operations or cash flows.\n\nexpenses. In addition, there was an increase in net investment earnings on nuclear decommissioning trust funds, a gain on the sale of Dominion Energy’s remaining noncontrolling interest in Cove Point, increased unrealized gains on economic hedging activities, a net decrease in dismantling costs associated with the early retirement of certain electric generation facilities at Virginia Power and higher market related impacts on pension and other postretirement plans. These increases were partially offset by a charge to reflect the recognition of deferred taxes on the outside basis of stock associated with East Ohio, PSNC, Questar Gas and Wexpro meeting the classification as held for sale, an impairment associated with the East Ohio and Questar Gas Transactions, a decrease in sales to electric utility customers attributable to weather and a decrease from the impact of 2023 Virginia legislation.\n\nNet income attributable to Virginia Power increased 31%, primarily due to the absences of a charge for RGGI compliance costs deemed recovered through base rates and a charge in connection with a comprehensive settlement agreement for Virginia fuel expenses as well as an increase in net investment earnings on nuclear decommissioning trust funds, a decrease in storm damage and service restoration costs and a net decrease in dismantling costs associated with the early retirement of certain electric generation facilities, partially offset by a decrease in sales to electric utility customers attributable to weather and the impact of 2023 Virginia legislation.\n\nImpairment testing for an individual or group of long-lived assets, including intangible assets with definite lives, is required when circumstances indicate those assets may be impaired. When a long-lived asset’s carrying amount exceeds the undiscounted estimated future cash flows associated with the asset, the asset is considered impaired to the extent that the asset’s fair value is less than its carrying amount. Performing an impairment test on long-lived assets involves judgment in areas such as identifying if circumstances indicate an impairment may exist, identifying and grouping affected assets in the case of long-lived assets and developing the undiscounted and discounted estimated future cash flows (used to estimate fair value in the absence of a market-based value) associated with the asset, including probability weighting such cash flows to reflect expectations about possible variations in their amounts or timing, expectations about the operations of the long-lived assets and the selection of an appropriate discount rate. When determining whether a long-lived asset or asset group has been impaired, management groups assets at the lowest level that has identifiable cash flows. Although cash flow estimates are based on relevant information available at the time the estimates are made, estimates of future cash flows are, by nature, highly uncertain and may vary significantly from actual results. For example, estimates of future cash flows would contemplate factors which may change over time, such as the expected use of the asset or underlying assets of equity method investees, including future production and sales levels, expected fluctuations of prices of commodities sold and consumed and expected proceeds from dispositions. In 2022, Dominion Energy determined that its nonregulated solar generation assets within Contracted Energy were impaired. The estimates of future cash flows and selection of a discount rate are considered to be critical assumptions. A 10% decrease in projected future pre-tax cash flows would have resulted in a $52 million increase to the impairment charge recorded. A 0.25% increase in the discount rate would have resulted in a $9 million increase to the impairment charge recorded. See Note 10 to the Consolidated Financial Statements for further information concerning the impairment related to certain of Dominion Energy’s nonregulated solar generation assets. There were no tests performed in 2024 or 2023 of long-lived assets which could have resulted in material impairments.\n\nNet income attributable to Dominion Energy increased 5%, primarily due to the absence of a charge to reflect the recognition of deferred taxes on the outside basis of stock associated with East Ohio, PSNC, Questar Gas and Wexpro meeting the classification as held for sale, a decrease in impairments associated with the East Ohio and Questar Gas Transactions, an increase in net investment earnings on nuclear decommissioning trust funds, the absence of depreciation expense associated with the East Ohio, PSNC and Questar Gas Transactions upon meeting the classification as held for sale, higher rider equity returns reflecting increased capital investments at Virginia Power, an increase in sales to electric utility customers attributable to weather and the absence of amortization associated with the 2021 Triennial Review. These increases were partially offset by the closings of the East Ohio, PSNC and Questar Gas Transactions, a charge for costs not expected to be recovered from customers on the CVOW Commercial Project, the absence of a gain and equity method earnings from the sale of Dominion Energy’s remaining noncontrolling interest in Cove Point, increased unrealized losses on economic hedging activities, lower market related impacts on pension and other postretirement plans and the impact of 2023 Virginia legislation.\n\nThe estimated total project cost reflects the Companies’ best estimate of the remaining construction costs, including contingency of approximately 5% on such remaining amounts. Such estimate could potentially change for items, certain of which are beyond the Companies’ control, including but not limited to actual network upgrade costs allocated by PJM, fuel for transportation and installation, the impact of applicable tariffs, if any, costs to maintain necessary permits, approvals and authorizations, ability of key suppliers and contractors to timely satisfy their obligations under existing contracts, marine wildlife and/or any severe weather events. Any additional increase in such costs in excess of the contingency included in the estimated total project cost would be subject to the cost sharing mechanisms described above and could have a material impact on the Companies’ future financial condition, results of operations and/or cash flows. See Note 10 to the Consolidated Financial Statements for additional information.\n\nDominion Energy obtains from third-party specialists periodic site-specific base year cost studies in order to estimate the nature, cost and timing of planned decommissioning activities for its nuclear plants. These cost studies are based on relevant information available at the time they are performed; however, estimates of future cash flows for extended periods of time are by nature highly uncertain and may vary significantly from actual results. These cash flows include estimates on timing of decommissioning, which for regulated nuclear units factors in the probability of NRC approval for license extensions. In addition, Dominion Energy’s cost estimates include cost escalation rates that are applied to the base year costs. Dominion Energy determines cost escalation rates, which represent projected cost increases over time due to both general inflation and increases in the cost of specific decommissioning activities, for each nuclear facility. The selection of these cost escalation rates is dependent on subjective factors which are considered to be critical assumptions. At December 31, 2024, a 0.25% increase in cost escalation rates would have resulted in an approximate $440 million increase in Dominion Energy’s nuclear decommissioning AROs.\n\nDominion Energy sponsors noncontributory defined benefit pension plans and other postretirement benefit plans for eligible active employees, retirees and qualifying dependents. The projected costs of providing benefits under these plans are dependent, in part, on historical information such as employee demographics, the level of contributions made to the plans and earnings on plan assets. Assumptions about the future, including the expected long-term rate of return on plan assets, discount rates applied to benefit obligations, mortality rates and the anticipated rate of increase in healthcare costs and participant compensation, also have a significant impact on employee benefit costs. The impact of changes in these factors, as well as differences between Dominion Energy’s assumptions and actual experience, is immediately recognized in earnings annually in the fourth quarter of each fiscal year as well as whenever a triggering event occurs that is determined to require remeasurement. Actuarial losses attributable to Dominion Energy’s rate regulated operations are deferred to regulatory assets when it is probable that regulators will permit them to be recovered from customers in future rates. Likewise, actuarial gains attributable to Dominion Energy’s rate regulated operations are deferred to regulatory liabilities when it is probable that regulators will require customer refunds or other benefits through future rates.\n\nNet income from discontinued operations including noncontrolling interests\ndecreased $1.0 billion, primarily due to charges reflecting the recognition of deferred taxes on the outside basis of stock associated with East Ohio, PSNC, Questar Gas and Wexpro meeting the classification as held for sale that will reverse when the sale is completed ($835 million), an impairment associated with the East Ohio and Questar Gas Transactions ($275 million), lower unrealized gains in 2023 compared to 2022 on interest rate derivatives for economic hedging of debt secured by Dominion Energy’s interest in Cove Point ($169 million), a decrease in equity method earnings from the sale of Dominion Energy’s noncontrolling interest in Cove Point ($44 million), a charge associated with the impairment of Birdseye ($34 million), an increase in interest expense primarily associated with debt issuances in 2022 ($31 million), the absence of a gain associated with the Q-Pipe Group for the finalization of the working capital adjustment in the first quarter of 2022 ($20 million) and an impairment charge of certain nonregulated solar assets ($11 million), partially offset by the gain on the sale of Dominion Energy’s remaining noncontrolling interest in Cove Point ($348 million), a net decrease in charges associated with the impairment of the Madison solar project ($57 million) and an increase following the approved base rate case for Questar Gas ($42 million).\n\nCorporate and Other includes specific items attributable to Dominion Energy’s primary operating segments that are not included in profit measures evaluated by executive management in assessing the segments’ performance or in allocating resources. See Note 26 to the Consolidated Financial Statements for discussion of these items in more detail. Corporate and Other also includes specific items attributable to the Corporate and Other segment. In 2024, this primarily included a $278 million after-tax loss associated with lower market related impacts on pension and other postretirement plans, $197 million net income from discontinued operations, primarily associated with operations included in the East Ohio, PSNC and Questar Gas Transactions, including the loss on sale associated with the East Ohio and PSNC Transactions, as well as an impairment charge associated with the Questar Gas Transaction, $69 million in after-tax costs associated with the business review completed in March 2024 and a $27 million after-tax benefit for derivative mark-to-market changes. In 2023, this primarily included an $835 million charge to reflect the recognition of deferred taxes on the outside basis of stock associated with East Ohio, PSNC, Questar Gas and Wexpro meeting the classification as held for sale that reversed when the sales were completed, $710 million net income from discontinued operations, primarily associated with operations included in the East Ohio, PSNC and Questar Gas Transactions and Dominion Energy’s noncontrolling interest in Cove Point, including the gain on sale, as well as an impairment charge associated with the East Ohio and Questar Gas Transactions, a $127 million after-tax benefit for derivative mark-to-market changes, a $69 million after-tax charge associated with the impairment of a corporate office building and a $27 million after-tax benefit for higher market related impacts on pension and other postretirement plans. In 2022, this primarily included $922 million net income from discontinued operations, primarily associated with operations included in the East Ohio, PSNC and Questar Gas Transactions and Dominion Energy’s noncontrolling interest in Cove Point, a $254 million after-tax benefit for derivative mark-to-market changes, a $251 million after-tax loss for lower market related impacts on pension and other postretirement plans and a $67 million loss associated with the sale of Hope.\n\nNet income from discontinued operations including noncontrolling interests\nincreased $322 million, primarily due to the absence of charges reflecting the recognition of deferred taxes on the outside basis of stock associated with East Ohio, PSNC, Questar Gas and Wexpro meeting the classification as held for sale ($835 million), a decrease in impairments associated with the East Ohio and Questar Gas Transactions ($197 million), the absence of depreciation expense associated with the East Ohio, PSNC and Questar Gas Transactions upon meeting the classification as held for sale ($211 million), the absence of interest expense on variable rate debt secured by Dominion Energy’s interest in Cove Point ($72 million), a gain upon the closing of the Questar Gas Transaction ($42 million), the absence of an impairment charge associated with the impairment of Birdseye ($34 million), the absence of charges associated with the impairment of the Madison solar project ($19 million) and the absence of an impairment charge of certain nonregulated solar assets ($11 million), partially offset by the absence of a gain on the sale of Dominion Energy’s remaining\n\nCollateral requirements are impacted by commodity prices, hedging levels, Dominion Energy’s credit ratings and the credit quality of its counterparties. In connection with commodity hedging activities, Dominion Energy is required to provide collateral to counterparties under some circumstances. Under certain collateral arrangements, Dominion Energy may satisfy these requirements by electing to either deposit cash, post letters of credit or, in some cases, utilize other forms of security. From time to time, Dominion Energy ",
  "item2_clean": null
}