{
  "source_file": "dal-20250930.htm",
  "form_type": "10-Q",
  "item1_clean": null,
  "item7_clean": null,
  "item2_clean": "for the nine months ended September 30, 2025 and 2024, respectively. We have committed to future aircraft purchases and have obtained, but are under no obligation to use, long-term financing commitments for a substantial portion of the purchase price of the aircraft. Our expected 2025 capital spend of approximately $5.0 billion will be primarily for aircraft, including deliveries and advance deposit payments, as well as fleet modifications and technology enhancements.\nFinancing Activities\nDebt and Finance Leases.\nIn the nine months ended September 30, 2025, we had cash outflows of $3.9 billion related to repayments of our debt and finance lease obligations. We continue to seek opportunities to pre-pay our debt, in addition to periodic amortization and scheduled maturities, and refinance higher cost debt.\nIn June 2025, we issued $2.0 billion in aggregate principal amounts of unsecured notes, consisting of $1.0 billion of 4.95% Notes due 2028 and $1.0 billion of 5.25% Notes due 2030 (collectively, the \"Notes\"). The net proceeds from the offering of the Notes were used to repay the PSP1 Loan and for general corporate purposes.\nIn September 2025, we and our indirect wholly-owned subsidiary SkyMiles IP Ltd. entered into an amendment to the SkyMiles term loan credit and guaranty agreement (the \"SkyMiles Credit Facility\"). This amendment, among other things, (i) refinanced the existing term loans with the proceeds of replacement term loans bearing interest at a variable rate equal to an adjusted term SOFR, plus a reduced margin of 1.50% per annum, payable quarterly; (ii) extended the scheduled maturity from October 2027 to October 2028; (iii) reduced the principal amortization payments from 20% to 1% per year, payable quarterly; and (iv) added a prepayment premium of 1.00% payable in connection with a Repricing Event (as defined in the amended SkyMiles Credit Facility) occurring within six months following September 30, 2025.\nIn February 2025, Moody's credit rating agency upgraded its rating for Delta to Baa2, an investment grade rating. In the September 2025 quarter, Fitch Ratings upgraded its outlook for Delta to Positive from Stable.\nSee Note 5 of the Notes to the Condensed Consolidated Financial Statements for further information on our debt agreements.\nCapital Return to Shareholders.\nOn August 21, 2025 we paid the dividend previously declared in the June 2025 quarter for total cash dividends of $122 million. Total cash dividends for the nine months ended September 30, 2025 were $318 million.\nOn September 25, 2025, the Board of Directors approved and we will pay a quarterly dividend of $0.1875 per share on November 6, 2025 to shareholders of record as of October 16, 2025.\nIn the June 2025 quarter, the Board of Directors authorized a $1.0 billion opportunistic share repurchase program open through June 30, 2028. No shares were repurchased under this program through September 30, 2025.\nWe were in compliance with the covenants in our debt agreements at September 30, 2025.\nCritical Accounting Estimates\nItem 2. MD&A - Supplemental Information\nSupplemental Information\nThird-party refinery sales.\nRefinery sales to third parties, and related expenses, are not related to our airline segment. Excluding these sales therefore provides a more meaningful comparison of our airline operations to the rest of the airline industry.\nMTM adjustments and settlements on hedges.\nMark-to-market (\"MTM\") adjustments are defined as fair value changes recorded in periods other than the settlement period. Such fair value changes are not necessarily indicative of the actual settlement value of the underlying hedge in the contract settlement period, and therefore we remove this impact to allow investors to better understand and analyze our core performance. Settlements represent cash received or paid on hedge contracts settled during the applicable period.\nAircraft fuel and related taxes.\nThe volatility in fuel prices impacts the comparability of year-over-year financial performance. The adjustment for aircraft fuel and related taxes allows investors to better understand and analyze our non-fuel costs and year-over-year financial performance.\nWe adjust for profit sharing because this adjustment allows investors to better understand and analyze our recurring cost performance and provides a more meaningful comparison of our core operating costs to the airline industry.\nTotal revenue, adjusted reconciliation\nThree Months Ended September 30,\nThird-party refinery sales\nTotal revenue, adjusted\nOperating expense, adjusted reconciliation\nThree Months Ended September 30,\nThird-party refinery sales\nMTM adjustments and settlements on hedges\nOperating expense, adjusted\nItem 2. MD&A - Supplemental Information\nFuel expense, adjusted reconciliation\nAverage Price Per Gallon\nThree Months Ended September 30,\nThree Months Ended September 30,\n(in millions, except per gallon data)\nMTM adjustments and settlements on hedges\nTotal fuel expense, adjusted\nAverage Price Per Gallon\nNine Months Ended September 30,\nNine Months Ended September 30,\n(in millions, except per gallon data)\nMTM adjustments and settlements on hedges\nTotal fuel expense, adjusted\nTRASM, adjusted reconciliation\nThree Months Ended September 30,\nNine Months Ended September 30,\nThird-party refinery sales\nCASM-Ex reconciliation\nThree Months Ended September 30,\nNine Months Ended September 30,\nAircraft fuel and related taxes\nThird-party refinery sales\nItem 2. MD&A - Supplemental Information\nThe following table shows a reconciliation of net cash provided by operating and used in investing activities (GAAP measures) to free cash flow (a non-GAAP financial measure). We present free cash flow because management believes this metric is helpful to investors to evaluate the company's ability to generate cash that is available for use for debt service or general corporate initiatives. Adjustments include:\nPension plan contributions.\nCash flows related to pension funding are included in our GAAP operating activities. We adjust to exclude these contributions to allow investors to understand the cash flows related to our core operations.\nNet cash flows related to certain airport construction projects and other.\nCash flows related to certain airport construction projects are included in our GAAP operating activities and capital expenditures. We have adjusted for these items because management believes investors should be informed that a portion of these capital expenditures from airport construction projects are either reimbursed by a third party or funded with restricted cash specific to these projects.\nFree cash flow reconciliation\nThree Months Ended September 30, 2025\nNet cash provided by operating activities\nNet cash used in investing activities\nPension plan contributions\nNet cash flows related to certain airport construction projects and other\n\n$1.7 billion, an increase of $287 million compared to the September 2024 quarter.\nCompared to the September 2024 quarter, our total revenue increased $1.0 billion. Passenger revenue increased $399 million compared to the September 2024 quarter on an increase in revenue for premium products, particularly from corporate customers, and loyalty travel awards, taking into account the impact of the CrowdStrike-caused outage on the September 2024 quarter. In July 2024, our operations were significantly disrupted by the CrowdStrike-caused outage. We estimate that this disruption led to a direct revenue impact of approximately $380 million related to approximately 7,000 flight cancellations over five days. Total revenue, adjusted (a non-GAAP financial measure, which excludes revenue related to refinery sales to third parties) increased in the September 2025 quarter by $603 million, or 4.1%, compared to the September 2024 quarter.\nTotal operating expense in the September 2025 quarter increased $709 million, or 5%, compared to the September 2024 quarter, primarily due to costs associated with a 4% increase in capacity, higher expenses related to refinery sales to third parties and higher employee costs from increased wages, largely offset by lower aircraft fuel costs and higher costs in the September 2024 quarter associated with the CrowdStrike-caused outage. The 2024 CrowdStrike-caused outage and operational recovery resulted in approximately $170 million of additional operating expenses primarily due to customer expense reimbursements and crew-related costs. September 2024 quarter fuel expense was also approximately $50 million lower than it would have been as a result of the flight cancellations. Total operating expense, adjusted (a non-GAAP financial measure, which primarily excludes expenses related to refinery sales to third parties) in the September 2025 quarter increased $281 million, or 2%, compared to the September 2024 quarter, primarily for the reasons discussed above.\nOur total operating cost per available seat mile (\"CASM\") increased 1% compared to the September 2024 quarter, while non-fuel unit cost (\"CASM-Ex\", a non-GAAP financial measure) increased 0.3%.\n. Our cash, cash equivalents, short-term investments and aggregate undrawn principal amount available under our revolving credit facilities (\"liquidity\") as of September 30, 2025 was $6.9 billion.\nDuring the September 2025 quarter, operating activities generated $1.8 billion, primarily from ticket sales and the sale of SkyMiles to our partners. Total cash sales to American Express were approximately $2.0 billion in the September 2025 quarter.\nCash flows used in investing activities during the quarter totaled $1.0 billion primarily from capital expenditures. These operating and investing activities yielded free cash flow (a non-GAAP financial measure) of $833 million in the September 2025 quarter. Additionally we had cash outflows of $459 million related to repayments of our debt and finance leases.\nThe non-GAAP financial measures referenced above for total revenue, adjusted, operating expense, adjusted, CASM-Ex and f"
}