{
  "source_file": "dal-20241231.htm",
  "form_type": "10-K",
  "item1_clean": "ITEM 1. BUSINESS\nAs a global airline based in the United States, we connect customers across our expansive global network with a commitment to ensuring that the future of travel is connected, personalized and enjoyable. In 2024, we served over 200 million customers safely, reliably and with industry-leading customer service innovation.\nCompetitive Advantages and Brand Strength\nIn 2024, we continued to differentiate Delta from the industry and to invest in the durability of our competitive advantages. These enduring competitive advantages that support our trusted consumer brand include our people and culture, operational reliability, global network, customer loyalty and financial foundation.\nThe Delta people and culture are our strongest competitive advantage. Our more than 100,000 employees provide world-class travel experiences for our customers and best-in-class service. We believe that Delta's brand transcends the industry, powered by our people's outstanding work and passion for serving our customers. In 2024, Delta was recognized as the world's No. 11 Most Admired Company as ranked by\nFORTUNE\n, and was ranked No. 13 in the U.S. on Glassdoor's Best Places to Work list.\nOur industry-leading profit sharing program directly aligns our employees' interests with the company's long-term success and for 2024, we are rewarding them with $1.4 billion in profit sharing payments. The company also maintains a Shared Rewards program to incentivize operational performance, and our employees earned $86 million under this program in 2024.\nOperational Reliability\nWe remain committed to industry-leading reliability as the foundation for our brand promise and efficiency. We are consistently among the industry's best performers, delivering the best on-time arrival and completion factor among our network carrier peers in 2024. In recognition of our unwavering commitment to operational performance, we were honored for the fourth consecutive year with the Cirium Platinum Award for global operational excellence in January 2025 and named the most on-time airline in North America. The\nnamed us the top airline of 2024 among the nine major U.S. airlines in its annual airline scorecard for the fourth consecutive year, leading the industry in on-time arrivals and fewest involuntary denied boardings.\nWe and our alliance partners collectively serve over 120 countries and territories and over 800 destinations around the world. At the end of 2024, we offered up to 5,000 peak-day flights to more than 290 destinations on six continents.\nOur domestic network is centered around core hubs in Atlanta, Detroit, Minneapolis-St. Paul and Salt Lake City. Core hubs have strong local passenger share, a high penetration of customers loyal to Delta, a competitive cost position and strong margins. Core hub positions complement coastal hub positions in Boston, Los Angeles, New York-LaGuardia, New York-JFK and Seattle. Coastal hubs provide a strong presence in large revenue markets and enable growth in premium products and international service.\nIn 2024, we focused on increasing flights at our core hubs while improving the efficiency of our operations in our coastal hubs. We continue to leverage our coastal gateways and strategic relationships with international airline partners to further expand our international service.\nInternationally, we seek to bring more choice to customers through innovative alliances with Aeroméxico, Air France-KLM, China Eastern, LATAM Airlines Group S.A. (\"LATAM\"), Korean Air and Virgin Atlantic. We operate significant hubs in, or have market presence in the key cities of, Amsterdam, Bogota, Lima, London-Heathrow, Mexico City, Paris-Charles de Gaulle, Santiago (Chile), Sao Paulo, Seoul-Incheon and Tokyo. Our strategic relationships with international airlines are an important part of our business as they improve our access to markets around the world and enable us to provide customers a more seamless global travel experience across our alliance network. The most significant of these arrangements are commercial joint ventures or cooperation agreements that include joint sales and marketing coordination, co-location of airport facilities and other commercial cooperation arrangements. In some cases, we have reinforced strategic alliances through equity investments where we have the opportunity to create deep relationships and maximize commercial cooperation.\nOur global network is supported by a fleet of 1,292 aircraft as of December 31, 2024 that are varied in size and capabilities, giving us flexibility to adjust aircraft to the network. We are continuing to refresh our fleet by acquiring new and more fuel-efficient aircraft with increased premium seating and cargo capacity to replace retiring aircraft, while modifying our existing aircraft cabins to increase premium offerings and harmonize interiors. Simultaneously, we continue on our multi-year journey of fleet simplification by replacing retiring aircraft with deliveries of next-generation aircraft. In 2024, we took delivery of 38 aircraft, including A321neos, A220-300s, A330-900s and A350-900 aircraft.\nWith operational excellence, best-in-class service and commitment to our customers, we have continued to earn our customers' trust and preference by delivering the \"Delta Difference.\" We continue to invest in elevated customer experiences through generational airport investments, including new Delta One Lounges and Delta Sky Clubs in key markets, and innovative technology initiatives such as Delta Sync to deliver seamless, personalized experiences at scale. We believe our continued investment in customer service and experience, operations, product, airports and technology has shaped customer perception of our brand leading to improvements in our domestic net promoter scores and increased customer loyalty. In 2024, various outlets recognized Delta as a trusted consumer brand, including:\nRecognized as the 2024 Airline of the Year by aviation publication\nNamed Best U.S. Airline and topped five categories in the\nForbes Travel Guide’s\nLuxury Air Travel Awards.\nNamed the number one airline by corporate travel customers in the annual Business Travel News Airline Survey for the 14\nyear in a row and the number one U.S. airline by\nEarned the number one spot on The Points Guy's list of best U.S. Airlines for the sixth year in a row.\nOur award-winning SkyMiles program, discussed in further detail below, is designed to attract lifetime members and to grow customer loyalty by offering our customers a wide variety of benefits when traveling with us and our partners, and personalizing our engagement with them. We aim to increase the value of our program and to deepen customer engagement with Delta through a growing ecosystem of partnerships with premier brands and travel-adjacent experiences, extending the value of our SkyMiles currency beyond flight. We expect the increased value we provide customers to deliver high-margin revenue and resilient cash flows.\nFinancial Foundation\nOver the past 15 years of consistent strategy, investment and execution, we have fundamentally transformed our business by investing in our people, our product and our reliability to alter the commodity-like nature of air travel and improve our financial foundation. We strive to continue achieving differentiated performance by delivering sustained value creation through margin expansion, durable earnings and free cash flow, and balance sheet strength.\nRestoring the strength of our balance sheet and reducing debt remains a key financial priority. During 2024, we made approximately $4.0 billion in payments on debt and finance lease obligations. Recognizing our continued progression on debt reduction and improving financial results, we regained our investment grade rating from all three major rating agencies, marking a key financial milestone for Delta.\nWe have diversified our business by growing high-margin revenue streams that leverage our competitive advantages, including:\nOur continued focus on our premium products (including Delta One\n, First Class, Delta Premium Select and Delta Comfort+\n) and customer segmentation, which has reduced our reliance on the most price sensitive customer segment.\nOur partnership with American Express, which provides us a co-brand revenue stream tied to broader consumer spending.\nOur Maintenance, Repair and Overhaul (\"MRO\") operation, where we are well-positioned for growth through contractual agreements with jet engine manufacturers, including three next-generation engine platforms.\nOur other complementary portfolio businesses, such as our cargo operations and Delta Vacations.\nOur premium yield growth has significantly outpaced main cabin, with record paid load factors in premium cabin in 2024, as demand for premium products continues to grow. In 2024, we introduced aircraft with more premium seating and completed cabin modification programs to increase premium offerings.\nOur SkyMiles program provides members with the ability to earn mileage credits (\"miles\") when traveling on Delta, Delta Connection and our partner airlines. Miles may also be earned by using certain services offered by program partners, such as credit card, retail, ridesharing, car rental and hotel companies. To facilitate transactions with participating companies, we sell miles to non-airline businesses and other airlines.\nMiles may be used toward award redemptions such as flights and upgrades on Delta, our regional carriers and other participating airlines as well as donations to specific charities and more. In 2024, 10% of revenue miles flown on Delta were from award travel, as program members redeemed miles in the loyalty program for approximately 30 million award tickets. Our most significant and valuable contract to sell miles relates to our co-brand credit card relationship with American Express. In 2024, remuneration from American Express totaled $7.4 billion, which we expect to grow to $10 billion over the long-term.\nInnovative Investments in Technology\nOur objective is to make technology a strategic differentiator. We continue to invest in technological improvements that enhance the customer experience, support our operations and empower our people. These investments include innovations to customer facing applications and improvements to infrastructure and technology architecture to unify and improve access to data sources. We believe this digital transformation enhances interactions with our customers and allows our people to deliver more personalized service, further enhancing the customer experience, strengthening our brand and driving revenue and efficiency.\nThrough the development of innovative new technologies, we provide our employees with greater tools to allow them to have more meaningful interactions with our customers and to serve them better. For our customers, we are making investments in the digital platforms on the ground and in the air. We continue to evolve the Fly Delta app into a digital travel concierge for our customers to offer convenient services on the day of travel and deliver thoughtful notifications to make their travel journeys more seamless. On the ground, we are investing to create a smoother and less stressful travel experience. Onboard the aircraft, we continue to invest in our in-flight entertainment and are expanding fast and free Wi-Fi for all customers through a free SkyMiles account, which is now on most domestic mainline flights with plans for full availability on international and regional aircraft. We also continue to innovate and enhance Delta Sync, which will enable the creation of more personalized experiences over the next several years. We continue to elevate the consumer experience across the travel journey and beyond, including through partnerships with leading brands, to broaden the Delta SkyMiles ecosystem and the range of benefits we provide to our members.\nCommercial Arrangements with Other Airlines\nJoint Venture/Cooperat",
  "item7_clean": "Passenger Mile Yield\nPRASM\nTotal passenger revenue\nDomestic passenger unit revenue (\"PRASM\") for 2024 decreased 1% compared to 2023 due to a 4% increase in revenue on a 5% increase in capacity.\nDomestic revenue in 2024 was above 2023 levels as we experienced strong demand across the domestic network. We generated higher growth in premium products revenue compared to main cabin with the delivery of new aircraft that include more premium seat capacity and an increase in yield in premium products compared to main cabin, as we see more consumers choosing these premium offerings.\nItem 7. MD&A - Results of Operations\nInternational passenger revenue for 2024 increased 5% with capacity up 8% compared to 2023. Revenue in each international region increased in 2024, with the Pacific growing at the greatest rate as we continue to restore capacity in the region.\nDemand for transatlantic travel remained at high levels throughout 2024 with revenue increasing slightly on flat capacity compared to 2023. Revenue growth in the Atlantic was led by demand for travel to European leisure destinations and our premium product offerings.\nLatin America region revenue increased during 2024 compared to 2023, due to strong demand for leisure destinations in South America and the Caribbean on a 15% increase in capacity. We continued to build on the strength of our joint venture with LATAM in South America through additional routes, greater network connectivity, and a more streamlined airport experience.\nThe Pacific region benefited from improved demand for travel to the region, particularly to South Korea and Japan, on 32% increased capacity. Our performance in South Korea benefited from the strength of our joint venture partnership with Korean Air, which enables passengers to more seamlessly connect to over 80 destinations in Asia. Revenue from flights to Japan increased due to higher demand for travel from the United States due in part to weakness in the Japanese Yen compared to the U.S. dollar.\nYear Ended December 31,\n% Increase (Decrease)\nAncillary businesses\nThis represents refinery sales of non-jet fuel products to third parties. These sales increased $1.3 billion compared to 2023. See \"Refinery Segment\" below for additional details on the refinery's operations, including third party refinery sales recorded in other revenue, during each period.\nThis relates to revenues from brand usage by third parties and other performance obligations embedded in miles sold, as well as redemption of miles for non-air travel and other awards. These revenues are mainly driven by customer spend on American Express cards and new cardholder acquisitions. Revenues from our relationship with American Express increased compared to 2023 driven by co-brand card spend growth and card account acquisitions.\nAncillary Businesses.\nThis includes revenues from aircraft maintenance services we provide to third parties and our vacation package operations.\nThis is primarily composed of revenues related to lounge access, including access provided to certain American Express cardholders, codeshare agreements and certain other commercial relationships. The increase in revenues was primarily driven by codeshare agreements and other commercial relationships.\nItem 7. MD&A - Results of Operations\nYear Ended December 31,\n% Increase (Decrease)\nSalaries and related costs\nAircraft fuel and related taxes\nAncillary businesses and refinery\nLanding fees and other rents\nAircraft maintenance materials and outside repairs\nDepreciation and amortization\nPassenger commissions and other selling expenses\nRegional carrier expense\nPilot agreement and related expenses\nNM\nTotal operating expense\nCertain variances are labeled as not meaningful (\"NM\") throughout management's discussion and analysis.\nSalaries and Related Costs.\nThe increase in salaries and related costs primarily resulted from the implementation of base pay increases for eligible employees of 5% effective June 1, 2024 and for Delta pilots on January 1, 2024. In June 2024 we also increased our minimum starting wage for domestic mainline employees to $19 per hour. Salaries and related costs also increased due to additional crew-related costs resulting from the CrowdStrike-caused outage and costs to support increased traffic. Employee benefits increased on higher healthcare expenses and from travel passes awarded to employees in recognition of their hard work through the summer. See Note 9 of the Notes to the Consolidated Financial Statements for additional information on our employee benefit plans.\nAircraft Fuel and Related Taxes.\nFuel expense decreased $503 million compared to 2023 primarily due to a 12% decrease in the market price of jet fuel partially offset by a 5% increase in consumption on a 6% increase in capacity, resulting in a 1% improvement in fuel efficiency. Fuel expense was also approximately $50 million lower than it would have been as a result of the 7,000 flight cancellations over the five-day period following the CrowdStrike-caused outage.\nFuel expense and average price per gallon\nAverage Price Per Gallon\nYear Ended December 31,\nYear Ended December 31,\n(in millions, except per gallon data)\nRefinery segment impact\nMarket price for jet fuel at airport locations, including related taxes and transportation costs.\nAncillary Businesses and Refinery.\nAncillary businesses and refinery includes expenses associated with refinery sales to third parties, aircraft maintenance services we provide to third parties and our vacation package operations. The increase in these expenses was primarily related to higher refinery sales to third parties, which increased $1.3 billion compared to 2023. See \"Refinery Segment\" below for additional details on the refinery's operations, including third party refinery sales.\nLanding Fees and Other Rents.\nThe increase in landing fees and other rents resulted from higher rates charged by airports following extensive redevelopment projects at numerous facilities and more flights compared to 2023.\nItem 7. MD&A - Results of Operations\nPilot agreement and related expenses.\nIn the March 2023 quarter, Delta pilots ratified a new four-year Pilot Working Agreement effective January 1, 2023. The agreement includes numerous work rule changes and pay rate increases during the four-year term, including an initial pay rate increase of 18%. The agreement also includes a provision for a one-time payment made upon ratification in the March 2023 quarter of $735 million. Additionally, we recorded adjustments to other benefit-related items of approximately $130 million.\nThe increase in other is primarily due to higher volume-related expenses associated with increased capacity, such as flight crew and other employee travel and incidental costs and the impact of service recovery costs including customer expense reimbursements from the CrowdStrike-caused outage.\nNon-Operating Results\nYear Ended December 31,\nFavorable (Unfavorable)\nInterest expense, net\nGain/(loss) on investments, net\nLoss on extinguishment of debt\nTotal non-operating (expense)/income, net\nInterest expense, net.\nInterest expense, net includes interest expense and interest income. This decreased compared to 2023 primarily on reduced interest expense resulting from our debt reduction initiatives, which was partially offset by lower interest income. We are reducing the total amount of interest expense by pre-paying our debt in addition to periodic amortization payments and scheduled maturities. During 2024, we made\n\nOperating income, adjusted in 2023 excluded one-time pilot agreement expenses and other items. The changes in operating income and operating income, adjusted are primarily resulting from increases in both revenue and operating expenses as described below. As a result of our strong performance in 2023 and 2024, we paid profit sharing of $1.4 billion in February 2024 to our employees and will pay another $1.4 billion in February 2025 in recognition of these achievements.\nCompared to 2023, our 2024 operating revenue increased $3.6 billion, or 6%, primarily due to a 6% increase in capacity driven by continued strength in demand for domestic and international travel and premium products, as well as an increase in revenue related to refinery sales to third parties. Total revenue, adjusted (a non-GAAP financial measure) increased in 2024 by $2.3 billion, or 4.3%, compared to 2023. Adjustments were to exclude revenue related to refinery sales to third parties. In July 2024, our operations were significantly disrupted by the CrowdStrike-caused outage. We estimate that this disruption led to a direct revenue impact of approximately $380 million related to approximately 7,000 flight cancellations over five days, which reduced our expected year-over-year capacity growth by approximately 0.4 percentage points during 2024.\nTotal operating expense increased $3.1 billion, or 6%, compared to 2023, primarily resulting from higher employee-related costs from increased wages and related expenses, higher volume-related expenses associated with the 6% increase in capacity and an increase in expenses related to refinery sales to third parties. The CrowdStrike-caused outage and operational recovery resulted in approximately $170 million of additional operating expenses primarily due to customer expense reimbursements and crew-related costs. Fuel expense was approximately $50 million lower than it would have been as a result of the flight cancellations. Total operating expense, adjusted (a non-GAAP financial measure) increased $2.7 billion, or 5%, compared to 2023. Current year adjustments were primarily to exclude expenses related to refinery sales to third parties, while prior year adjustments also excluded the pilot agreement and related expenses.\nOur total operating cost per available seat mile (\"CASM\") of 19.30 cents was comparable to 2023, primarily due to lower fuel expense and a 6% increase in capacity offset by higher expenses associated with the increase in capacity and related to refinery sales to third parties. Non-fuel unit costs (\"CASM-Ex\", a non-GAAP financial measure), which excludes fuel, expenses related to refinery sales to third parties and other items, increased 2.8% to 13.54 cents compared to 2023.\nNon-Operating Results.\nTotal non-operating expense was $1.3 billion in 2024, compared to total non-operating income of $87 million in 2023, primarily due to mark-to-market gains on certain of our equity investments in 2023 partially offset by lower expenses in 2024 associated with our debt reduction initiatives.\nDuring 2024, operating activities generated $8.0 billion, primarily from ticket sales and the sale of SkyMiles to our partners. Total cash sales of SkyMiles to American Express were $7.4 billion during 2024, an increase of approximately 8% compared to 2023. Investing activities resulted in net cash outflows of approximately $3.7 billion, primarily for $5.1 billion of capital expenditures, partially offset by $1.1 billion of net redemptions of short-term investments. After adjusting for certain activities, these results generated $3.4 billion of free cash flow (a non-GAAP financial measure) in 2024.\nAlso, during 2024 we had cash outflows of approximately $4.0 billion primarily related to repayment of our debt and finance leases, including approximately $1.1 billion for early repayments and the remainder from scheduled maturities. Our cash, cash equivalents, short-term investments and aggregate principal amount committed and available to be drawn under our revolving credit facilities (\"liquidity\") at December 31, 2024 was $6.1 billion.\nThe non-GAAP financial measures of operating income, adjusted, total revenue, adjusted, total operating expense, adjusted, CASM-Ex and free cash flow used above are defined and reconciled in \"Supplemental Information\" below.\nItem 7. MD&A - Results of Operations\nResults of Operations\nYear Ended December 31,\n% Increase (Decrease)\nTicket - Premium products\nLoyalty travel awards\nTravel-related services\nTotal passenger revenue\nTotal operating revenue\nThird-party refinery sales\nTRASM, adjusted (cents)\nTotal amounts in the table above may not calculate exactly due to rounding.\nFor additional information on adjustments to TRASM, see \"Supplemental Information\" below.\nOur operating revenue increased $3.6 billion, or 6%, compared to 2023 related to a 6% increase in capacity resulting from continued strength in demand for domestic and international travel, particularly for our premium products (including Delta One, First Class, Delta Premium Select and Delta Comfort+), as well as increased revenue related to refinery sales to third parties and loyalty travel awards. Total revenue per available seat mile (\"TRASM\") remained flat as revenues increased at the same rate as capacity.\nSee \"Refinery Segment\" below for additional details on the refinery's operations, including third party refinery sales recorded in other revenue, during each period.\nPassenger Revenue by Geographic Region\nIncrease (Decrease) vs. Year Ended December 31, 2023\nYear Ended December 31, 2024\n\non an annual basis over the next five years.\nCapital Returns to Shareholders.\nDuring 2024, we continued our quarterly dividend program with $0.10 per share payments in the March 2024 and June 2024 quarters and $0.15 per share payments in the September 2024 and December 2024 quarters. Total dividend payments during the year ended December 31, 2024 were $321 million.\nOn February 6, 2025, the Board of Directors approved and we will pay a quarterly dividend of $0.15 per share on March 20, 2025 to shareholders of record as of February 27, 2025.\nUndrawn Lines of Credit.\nAs of December 31, 2024 we had approximately $3.1 billion undrawn and available under our revolving credit facilities.\nWe were in compliance with the covenants in our debt agreements at December 31, 2024. See Note 6 of the Notes to the Consolidated Financial Statements for more information on the covenants in our debt agreements.\nItem 7. MD&A - Critical Accounting Estimates\nCritical Accounting Estimates\nOur critical accounting estimates are those estimates made in accordance with generally accepted accounting principles in the U.S. (\"GAAP\") that involve a significant level of estimation uncertainty and have had or are reasonably likely to have a material impact on our consolidated results of operations or financial condition. Accordingly, the actual results may differ materially from these estimates. For a discussion of our significant accounting policies, see Note 1 of the Notes to the Consolidated Financial Statements, unless otherwise noted below.\nOur SkyMiles loyalty program generates customer loyalty by rewarding customers with incentives to travel on Delta. This program allows customers to earn miles by flying on Delta, Delta Connection carriers and other airlines that participate in the loyalty program. When traveling, customers earn miles primarily based on the passenger's loyalty program status, fare class and ticket price. Customers can also earn miles through participating companies. Miles are redeemable by customers for air travel on Delta and other participating airlines, access to Delta Sky Club and other program awards. To facilitate transactions with participating companies, we sell miles to non-airline businesses and other airlines.\nThe loyalty program includes two types of transactions that are considered revenue arrangements with multiple performance obligations (1) passenger ticket sales earning miles and (2) sale of miles to participating companies.\nPassenger Ticket Sales Earning Miles.\nPassenger ticket sales earning miles provide customers with (1) miles earned and (2) air transportation, which are each considered performance obligations. We value each performance obligation on a standalone basis. To value the miles earned, we consider the quantitative value a passenger receives by redeeming miles for a ticket rather than paying cash, which is referred to as equivalent tic",
  "item2_clean": null
}