{
  "source_file": "dash-20241231.htm",
  "form_type": "10-K",
  "item1_clean": "OUR BUSINESS\nOur mission is to grow and empower local economies. We aim to do this by providing services that reduce friction in local commerce and help merchants better connect with consumers in their communities. Our primary offerings include the DoorDash Marketplace and the Wolt Marketplace (our \"Marketplaces\"), and our Commerce Platform.\nOur Marketplaces operate in over 30 countries, including the United States, and account for the vast majority of our revenue today. Our Marketplaces serve three primary constituents: merchants, consumers, and the independent contractors who use our platform to generate earnings, or \"Dashers\nOur Marketplaces provide an integrated suite of services that help merchants establish an online presence, connect with consumers in their communities, and solve mission-critical challenges, such as customer acquisition, demand generation, order fulfillment, merchandising, payment processing, and customer support. We typically earn a fee from merchants for the services we provide based on the size of each transaction. We also offer advertising as a value-added service through our Marketplaces to help merchants and consumer packaged goods companies increase consumer engagement and drive incremental revenue.\nConsumers access our Marketplaces through our apps and websites to discover, engage with, and purchase goods from merchants in their communities. We seek to attract and retain consumers based primarily on the selection, convenience, quality, affordability, and service we provide. We typically charge consumers fees for each transaction, inclusive of a fixed delivery fee and a service fee that varies based on the size of the transaction. Our Marketplaces also offer our consumer membership programs, DashPass and Wolt+, which aim to lower transactional friction by reducing the delivery and service fees we charge, while providing additional membership benefits. In December 2024, our Marketplaces served over 42 million monthly active users\nand, as of December 31, 2024, we had over 22 million DashPass and Wolt+ members.\nIn addition to our Marketplaces, we offer our Commerce Platform, which is a suite of services that help merchants grow, run, and operate their businesses on their own channels. DoorDash Drive On-Demand and Wolt Drive (together, \"Drive\") are white-label delivery fulfillment services that generate the majority of revenue within our Commerce Platform. In addition to Drive, we also provide services within our Commerce Platform that help merchants establish online ordering, build branded mobile apps, enable tableside order and pay, and improve customer support.\nFor Dashers, our Marketplaces and Drive provide opportunities to generate income that helps them achieve their goals. Dashers choose if, when, and where to dash, which tasks to accept, as well as how frequently and for how long to dash each time they choose to do so. We typically pay Dashers based on the amount of time they are active on our platform or the number of tasks they complete and the time, distance, and desirability associated with each task. We seek to attract Dashers primarily based on the accessibility, flexibility, and earnings opportunities we provide.\nWe believe our business achieves its greatest benefits when we provide attractive services for each of our key constituents. Consequently, to grow our business, we intend to provide merchants with an expanding suite of services that help them build and grow successful omnichannel businesses; consumers with a broad selection of merchants and products to choose from, consistent and high-quality experiences, and affordability that drives increased adoption; and Dashers with unique opportunities that compete effectively for their time and effort with every task.\nCOMPETITION\nThe markets in which we operate are intensely competitive and characterized by shifting user preferences, fragmentation, and frequent introductions of new services and offerings. We compete for our constituencies on the following criteria:\nWe compete for merchants based on our ability to generate consumer demand and the quality of our business enablement and demand fulfillment services.\nBased on the number of individual consumer accounts that have completed an order on our Marketplaces in the past month, measured as of December 31, 2024.\nWe compete for consumers based on a number of factors, including the selection of merchants and products available, the quality of the ordering, fulfillment and service experience, and affordability.\nWe compete to attract and retain Dashers based on a number of factors, including accessibility of our platform, flexibility in when, where, how much and how frequently to work, overall quality of the dashing experience, and earnings potential.\nIn particular, local food delivery logistics, the largest category of our business today, is fragmented and intensely competitive. Globally, we compete with other local on-demand delivery companies, including Uber Eats, Just Eat Takeaway, Delivery Hero, and other local incumbents. We also compete with merchants that have their own online ordering platforms, online ordering systems, merchants that own and operate their own delivery fleets, grocers and grocery delivery services, convenience stores and convenience store delivery services, and companies that provide merchant delivery services. In addition, we compete with traditional offline ordering channels, such as take-out offerings, telephone, and paper menus that merchants distribute to consumers. As we continue to expand into additional verticals, we may compete or come in closer competition with additional businesses with substantial resources, users, and brand power.\nFor additional information about the risks to our business related to competition, see the section titled “\nRisk Factors—Risks Related to Our Business and Operations—We face intense competition and if we are unable to compete effectively, our business, financial condition, and results of operations could be adversely affected.\nHUMAN CAPITAL\nAs of December 31, 2024, we had over 23,700 employees worldwide. We also engage contractors and consultants. Certain international employees are subject to statutory collective bargaining agreements. We have not experienced any work stoppages, and we believe that our employee relations are strong.\nWe believe that people are at the core of every business. This drives our focus on improving the experiences of merchants, consumers, and Dashers, and it also drives how we think about our employees and the culture and values that we cultivate. Our employees are critical to our success.\nAt DoorDash, we grow and empower local economies. We give our team the freedom and opportunity to build the future—for our company, our constituencies, and our communities. Together, with grit, courage, and rapid innovation, we create the dynamic energy that drives our business forward.\nWe are committed to make dashing an earnings opportunity that is accessible, flexible, and supportive of social progress. In 2024, 8 million people dashed\n, earning a total of over $18 billion.\nWe believe access and choice are empowering. Our goal with dashing is to provide as many people as we can with an opportunity to earn incrementally in a way that fits their lives. Since Dashers are independent contractors, we must compete for their time and effort with every task. We compete against other earnings opportunities, other sources of capital like loans or credit cards, as well as alternative uses of time like doing errands or leisure. Because of this competition, we must make dashing attractive, worthwhile, and incremental to other choices available. Specifically, we strive to make dashing positive based on:\n: We believe the barriers to entry in dashing are very low. Where permitted by applicable law, prospective Dashers must pass a background check and, in most geographies, have access to a bike, scooter, or car. People who qualify to become Dashers are often eligible to begin generating income within a day of signing up. We know of no other earnings opportunity that provides superior accessibility to dashing.\n: Once Dashers qualify, they choose whether to dash, where to dash, when to dash, how long to dash for, and how frequently to dash. This allows Dashers to scale their effort to their earnings needs. It also allows Dashers to generate earnings around other commitments in their lives, which often include full or part-time jobs, school, parenting, or commitments to care for family or friends.\nBased on the number of Dasher accounts that have delivered an order through our platform in 2024.\n: We must provide Dashers with opportunities to earn that are competitive with alternative opportunities and commensurate with Dashers' expectations. In addition to the absolute level of earnings, we provide tools that improve immediacy and accessibility of earnings, as this is often valued by Dashers.\n: We aim to provide Dashers with high levels of service. This includes a dedicated service team that is accessible through our app, website, email, chat, and phone. We also provide visibility into our policies and practices for determining ratings and deactivations.\nOur Commitment to Diversity and Inclusion\nAt DoorDash, we are committed to growing and empowering inclusive communities in our company, our industry, and the geographies we serve. We believe that a diverse and inclusive workforce is critical to helping us attract and retain the talent necessary to grow our business. We also believe we will be a more successful company if we amplify the voices of those who have not always been heard, and when everyone has “room at the table” and the tools, resources, and opportunities to succeed.\nINTELLECTUAL PROPERTY\nWe believe that our intellectual property rights are valuable and important to our business. We rely on trademarks, patents, copyrights, trade secrets, license agreements, intellectual property assignment agreements, confidentiality procedures, non-disclosure agreements, and employee non-disclosure and invention assignment agreements to establish and protect our proprietary rights. Though we rely in part upon these legal and contractual protections, we believe that factors such as the skills and ingenuity of our employees and the functionality and frequent enhancements to our platform are larger contributors to our success in the marketplace.\nWe have invested in a patent program to identify and protect a substantial portion of our strategic intellectual property in logistics, selection optimization, and other technologies relevant to our business. As of December 31, 2024, we had 244 issued U.S. patents, 25 patents issued in non-U.S. jurisdictions, 54 U.S. patent applications pending, and 21 patent applications pending in non-U.S. jurisdictions. We continually review our development efforts to assess the existence and patentability of new intellectual property.\nWe have an ongoing trademark and service mark registration program pursuant to which we register our brand names and product names, taglines, and logos in the United States and other countries to the extent we determine appropriate and cost-effective. As of December 31, 2024, we held 56 registered trademarks in the United States and 194 registered trademarks in non-U.S. jurisdictions. We also have common law rights in some trademarks and numerous pending trademark applications in the United States and non-U.S. jurisdictions. In addition, we have registered domain names for websites that we use in our business, such as www.doordash.com and other variations.\nWe intend to pursue additional intellectual property protection to the extent we believe it would be beneficial and cost-effective. Despite our efforts to protect our intellectual property rights, they may not be respected in the future or may be invalidated, circumvented, or challenged. For additional information, see the sections titled “\nRisk Factors—Risks Related to",
  "item7_clean": "Item 7. Management's Discussion and Analysis of Financial Condition and Results of Operations\nDoorDash, Inc. is incorporated in Delaware with headquarters in San Francisco, California. Our mission is to grow and empower local economies. We aim to do this by providing services that reduce friction in local commerce and help merchants better connect with consumers in their communities.\nOur primary offerings include the DoorDash Marketplace and the Wolt Marketplace (our \"Marketplaces\"), and our Commerce Platform. Our Marketplaces operate in over 30 countries across the globe and provide an integrated suite of services that help merchants establish an online presence, connect with consumers in their communities, and solve mission-critical challenges, such as customer acquisition, demand generation, order fulfillment, merchandising, payment processing, and customer support. We also offer advertising as a value-added service through our Marketplaces to help merchants and consumer packaged goods companies increase consumer engagement and drive incremental revenue.\nOur Marketplaces compete for consumers based primarily on the selection, convenience, quality, affordability, and service we provide. Our Marketplaces also offer our consumer membership programs, DashPass and Wolt+, which aim to lower transactional friction by reducing the delivery and service fees we charge, while providing additional membership benefits.\nIn addition to our Marketplaces, we offer our Commerce Platform, which is a suite of services that help merchants grow, run, and operate their businesses on their own channels. DoorDash Drive On-Demand and Wolt Drive (together, \"Drive\") are white-label delivery fulfillment services that generate the majority of revenue within our Commerce Platform. In addition to Drive, we also provide services that help merchants establish online ordering, build branded mobile apps, enable tableside order and pay, and improve customer support.\nFinancial and Operational Highlights\nWe use the following financial and operational metrics to help us evaluate our business, identify trends affecting our business, formulate business plans, and make strategic decisions:\nYear Ended December 31,\n(in millions, except percentages)\nTotal Orders Y/Y growth\nMarketplace GOV Y/Y growth\nGAAP gross profit as a % of Marketplace GOV\nContribution Profit as a % of Marketplace GOV\nGAAP net income (loss) attributable to DoorDash, Inc. common stockholders\nGAAP net income (loss) attributable to DoorDash, Inc. common stockholders as a % of Marketplace GOV\nAdjusted EBITDA as a % of Marketplace GOV\nWeighted-average diluted shares outstanding\nContribution Profit and Adjusted EBITDA are non-GAAP financial measures. For more information regarding our use of these measures and reconciliations to the most directly comparable financial measures calculated in accordance with GAAP, see the section titled “Non-GAAP Financial Measures.\"\nWe define Total Orders as all orders completed through our Marketplaces and Commerce Platform over the period of measurement.\new to 2.6 billion in 2024, a 20% increase compared to 2023. The increase in Total Orders was driven primarily by growth in consumers and growth in average consumer engagement.\n. We define Marketplace GOV as the total dollar value of orders completed on our Marketplaces, including taxes, tips\n, and any applicable consumer fees, including membership fees related to DashPass and Wolt+. Marketplace GOV does not include the dollar value of orders, taxes and tips, or fees charged to merchants for orders fulfilled through our Commerce Platform.\nMarketplace GOV grew to $80.2 billion in 2024, a 20% increase compared to 2023, driven primarily by growth in Total Orders.\nWe define Net Revenue Margin as revenue expressed as a percentage of Marketplace GOV.\nNet Revenue Margin increased to 13.4% in 2024 from 12.9% in 2023, primarily due to an increased contribution from advertising revenue.\nContribution Profit.\nWe define Contribution Profit as our gross profit less sales and marketing expense plus (i) depreciation and amortization expense related to cost of revenue, (ii) stock-based compensation expense and certain payroll tax expense included in cost of revenue and sales and marketing expenses, (iii) allocated overhead included in cost of revenue and sales and marketing expenses, and (iv) inventory write-off related to restructuring. Gross profit is defined as revenue less (i) cost of revenue, exclusive of depreciation and amortization and (ii) depreciation and amortization related to cost of revenue.\nWe use Contribution Profit to evaluate our operating performance and trends. We believe that Contribution Profit is a useful indicator of the economic impact of orders fulfilled through DoorDash as it takes into account the direct expenses associated with generating and fulfilling orders.\nContribution Profit increase\nd to $3.5 billion in 2024 from $2.5 billion in 2023, driven primarily by growth in revenue, partially offset by increases in cost of revenue and sales and marketing expenses.\nWe define Adjusted EBITDA as net income (loss) attributable to DoorDash, Inc. common stockholders, adjusted to include net income (loss) attributable to redeemable non-controlling interests, and exclude (i) certain legal, tax, and regulatory settlements, reserves, and expenses, (ii) loss on disposal of property and equipment, (iii) transaction-related costs (primarily consists of acquisition, integration, and investment related costs), (iv) impairment expenses, (v) restructuring charges, (vi) inventory write-off related to restructuring, (vii) provision for (benefit from) income taxes, (viii) interest income, net, (ix) other expense, net, (x) stock-based compensation expense and certain payroll tax expense, and (xi) depreciation and amortization expense.\nAdjusted EBITDA is a performance measure that we use to assess our operating performance and the operating leverage in our business.\nAdjusted EBITDA increased to $1.9 billion in 2024 from $1.2 billion in 2023, driven primarily by growth in Contribution Profit, partially offset by increases in adjusted research and development expense and adjusted general and administrative expense.\nWe define Free Cash Flow as cash flows from operating activities less purchases of property and equipment and capitalized software and website development costs.\nFree Cash Flow increased to $1.8 billion in 2024 from $1.3 billion in 2023, driven primarily by an increase in net cash provided by operating activities.\nDashers receive 100% of tips.\nResults of Operations\nThe following table summarizes our historical consolidated statements of operations data:\nYear Ended December 31,\nCost of revenue, exclusive of depreciation and amortization shown separately below\nResearch and development\nGeneral and administrative\nDepreciation and amortization\nRestructuring charges\nTotal costs and expenses\nLoss from operations\nInterest income, net\nIncome (loss) before income taxes\nProvision for (benefit from) income taxes\nNet income (loss) including redeemable non-controlling interests\nLess: net loss attributable to redeemable non-controlling interests\nNet income (loss) attributable to DoorDash, Inc. common stockholders\nCosts and expenses include stock-based compensation expense as follows:\nYear Ended December 31,\nCost of revenue, exclusive of depreciation and amortization\nResearch and development\nGeneral and administrative\nRestructuring charges\nTotal stock-based compensation expense\nDepreciation and amortization related to the following:\nYear Ended December 31,\nResearch and development\nGeneral and administrative\nTotal depreciation and amortization\nThe following table sets forth the components of our consolidated statements of operations data as a percentage of revenue:\nYear Ended December 31,\nCost of revenue, exclusive of depreciation and amortization shown separately below\nResearch and development\nGeneral and administrative\nDepreciation and amortization\nRestructuring charges\nTotal costs and expenses\nLoss from operations\nInterest income, net\nIncome (loss) before income taxes\nProvision for (benefit from) income taxes\nNet income (loss) including redeemable non-controlling interests\nLess: net loss attributable to redeemable non-controlling interests\nNet income (loss) attributable to DoorDash, Inc. common stockholders\nComparison of the Years Ended 2024 and 2023\nWe generate a substantial majority of our revenue from orders completed through our Marketplaces and the related commissions charged to partner merchants and fees charged to consumers. Commissions from partner merchants are based on an agreed-upon rate applied to the total dollar value of goods ordered in exchange for using our Marketplaces to sell the partner merchants’ products. Fees from consumers are for the use of our Marketplaces and to arrange for delivery services.\nOur revenue reflects comm\nissions charged to partner merchants and fees charged to consumers less (i) Dasher payout and (ii) refunds, credits, and promotions, which includes certain discounts and incentives provided to consumers.\nWe also generate revenue from membership fees paid by consumers for DashPass and Wolt+, and our advertising products, which are recognized as part of our Marketplaces revenue.\nIn addition, we generate revenue from other sources, including our Commerce Platform. Drive generates the majority of revenue within our Commerce Platform. We generate revenue from Drive by collecting per-order fees from merchants to arrange for delivery services that fulfill demand generated through their own channels.\nYear Ended December 31,\n(in millions, except percentages)\nby $2.1 billion, or 24%, in 2024, compared to 2023. The increase was primarily driven by a 20% increase in Marketplace GOV to $80.2 billion. In 2024, revenue grew at a faster rate than Marketplace GOV primarily due to\nan increased contribution from advertising revenue.\nCost of Revenue, Exclusive of Depreciation and Amortization\nCost of revenue primarily consists of (i) order management costs, which include payment processing charges, net of rebates issued from payment processors, costs associated with cancelled orders, insurance expenses, costs related to placing orders with non-partner merchants, and costs related to first party product sales, for which we take control of inventory, (ii) platform costs, which include costs for onboarding merchants and Dashers, costs for providing support for consumers, merchants, and Dashers, and technology platform infrastructure costs, and (iii) personnel costs, which include\npersonnel-related compensation expenses related to our local operations, support, and other teams, and allocated overhead. Personnel-related compensation expenses primarily include salary, bonus, benefits, and stock-based compensation expense. Allocated overhead is determined based on an allocation of shared costs, such as facilities (including rent and utilities) and information technology costs, among all departments based on employee headcount.\nYear Ended December 31,\n(in millions, except percentages)\nCost of revenue, exclusive of depreciation and amortization\nsive of depreciation and amortization, increased by $953 million, or 21%, in 2024, compared to 2023. The increase was primarily attributable to an increase of $782 million in order management costs and an increase of $94 million in platform costs, driven primarily by growth in Total Orders.\nSales and marketing expenses primarily consist of advertising and other ancillary expenses related to merchant, consumer, and Dasher acquisition, including certain consumer referral credits and Dasher referral fees paid to the referrers to the extent they represent fair value of acquiring a new consumer or a new Dasher, brand marketing expenses, personnel-related compensation expenses for sales and marketing employees, and commissions expense including amortization of deferred contract costs, as well as allocated overhead.\nYear Ended December 31,\n(in millions, except percentages)\nSales and marketing expenses i\nsed by $161 million, or 9%, in 2024, compared to 2023. The increase was primarily driven by an increase of $74 million in advertising expenses and an increase of $66 million in personnel-related compensation expenses\nand allocated overhead.\nResearch and Development\nResearch and development expenses primarily consist of personnel-related compensation expenses related to data analytics and the design of, product development of, and improvements to our platform, as well as expenses associated with the licensing of third-party software and allocated overhead.\nYear Ended December 31,\n(in millions, except percentages)\nResearch and development\nResearch and development expenses in\neased by $165 million, or 16%, in 2024, compared to 2023. The increase was primarily driven by an increase of $163 million in personnel-related compensation expenses and allocated overhead.\nGeneral and Administrative\nGeneral and administrative expenses primarily consist of legal, tax, and regulatory expenses, which include litigation settlement expenses and sales and indirect taxes; personnel-related compensation expenses related to administrative employees, which include finance and accounting, human resources and legal; chargebacks associated with fraudulent credit card transactions; professional services fees; transaction-related costs; impairment expenses; bad debt expense; and allocated overhead.\nYear Ended December 31,\n(in millions, except percentages)\nGeneral and administrative\nGeneral and administrative expenses inc\nd by $217 million, or 18%, in 2024, compared to 2023. The increase was primarily driven by\nin office lease impairment expenses,\nan increase of $58 million in legal, tax,\nand regulatory expenses, and an increase\nin personnel-related compensation expenses and allocated overhead, exclusive of stock-based compensation expense related to the CEO performance award, of\nprimarily driven by increased headcount.\nDepreciation and Amortization\nDepreciation and amortization expenses primarily consist of depreciation and amortization expenses associated with our property and equipment and intangible assets. Depreciation primarily includes expenses associated with equipment for merchants, computer equipment and software, office equipment, and leasehold improvements. Amortization includes expenses associated with our capitalized software and website development costs, as well as acquired intangible assets.\nYear Ended December 31,\n(in millions, except percentages)\nDepreciation and amortization\nDepreciation and amortization ex\nes increased by $52 million, or 10%, in 2024, compared to 2023. The increase was primarily driven by an increase of $62 million in amortization expenses related to capitalized software and website development costs.\nRestructuring Charges\nRestructuring charges primarily consist of separation-related payments and other termination benefit costs associated with restructuring activities.\nYear Ended December 31,\n(in millions, except percentages)\nRestructuring charges\n*Percentage not meaningful\nRestructuring charges were not material in 2024 and\nInterest Income, Net\nInterest income, net primarily consists of interest earned on our cash, cash equivalents, and marketable securities, net of interest costs.\nYear Ended December 31,\n(in millions, except percentages)\nInterest income, net\nInterest income, net increased by $47 million, or 31%, in 2024, compared to 2023. The increase was\nprimarily driven by an increase in average interest rates and a larger investment portfolio.\nOther expense, net primarily consists of adjustments to non-marketable equity securities, including impairment, as well as gains and losses from transactions denominated in a currency other than the functional currency.\nYear Ended December 31,\n(in millions, except percentages)\nOther expense, net, decreased by $102 million, or 95%, in 2024, compared to 2023. The decrease was primarily driven by a decrease of $",
  "item2_clean": null
}