{
  "source_file": "dash-20250930.htm",
  "form_type": "10-Q",
  "item1_clean": null,
  "item7_clean": null,
  "item2_clean": "Item 2. Management's Discussion and Analysis of Financial Condition and Results of Operations\nDoorDash, Inc. is incorporated in Delaware with headquarters in San Francisco, California. Our mission is to grow and empower local economies. We aim to do this by providing services that reduce friction in local commerce and help merchants better connect with consumers in their communities.\nAs of September 30, 2025, our primary offerings included the DoorDash Marketplace and the Wolt Marketplace (together with all other marketplaces that we operate from time to time, our \"Marketplaces\"), and our Commerce Platform. On October 2, 2025, we completed our acquisition of Deliveroo plc (\"Deliveroo\") in order to strengthen our position as a leading global platform in local commerce and enable us to better serve businesses, consumers and Dashers. Following the completion of the Deliveroo acquisition, our Marketplaces now operate in over 40 countries across the globe and provide an integrated suite of services that help merchants establish an online presence, connect with consumers in their communities, and solve mission-critical challenges, such as customer acquisition, demand generation, order fulfillment, merchandising, payment processing, and customer support. We also offer advertising as a value-added service through our Marketplaces to help merchants and consumer packaged goods companies increase consumer engagement and drive incremental revenue.\nOur Marketplaces compete for consumers based primarily on the selection, convenience, quality, affordability, and service we provide. Our Marketplaces also offer our consumer membership programs, DashPass and Wolt+, which aim to lower transactional friction by reducing the delivery and service fees we charge, while providing additional membership benefits.\nIn addition to our Marketplaces, we offer our Commerce Platform, which is a suite of services that help merchants grow, run, and operate their businesses on their own channels. DoorDash Drive On-Demand and Wolt Drive (together, \"Drive\") are white-label delivery fulfillment services that generate the majority of revenue within our Commerce Platform. In addition to Drive, we also provide software and services that help merchants establish online ordering, build branded mobile apps, manage reservations and tables, better connect with consumers through customer relationship management and marketing tools, enable tableside order and pay, and manage customer support.\nFinancial and Operational Highlights\nWe use the following financial and operational metrics to help us evaluate our business, identify trends affecting our business, formulate business plans, and make strategic decisions:\nThree Months Ended September 30,\n(in millions, except percentages)\nTotal Orders Y/Y growth\nMarketplace GOV Y/Y growth\nGAAP gross profit as a % of Marketplace GOV\nContribution Profit as a % of Marketplace GOV\nGAAP net income attributable to DoorDash, Inc. common stockholders\nGAAP net income attributable to DoorDash, Inc. common stockholders as a % of Marketplace GOV\nAdjusted EBITDA as a % of Marketplace GOV\nWeighted-average diluted shares outstanding\nContribution Profit and Adjusted EBITDA are non-GAAP financial measures. For more information regarding our use of these measures and reconciliations to the most directly comparable financial measures calculated in accordance with GAAP, see the section titled “Non-GAAP Financial Measures.\"\nWe define Total Orders as all orders completed through our Marketplaces and Commerce Platform over the period of measurement.\nIn the third quarter of 2025, Total Orders increased to 776 million, or 21% growth compared to the same quarter of 2024. The increase in Total Orders was driven primarily by growth in the number of consumers and growth in average consumer engagement.\nWe define Marketplace GOV as the total dollar value of orders completed on our Marketplaces, including taxes, tips\n, and any applicable consumer fees, including membership fees related to DashPass and Wolt+. Marketplace GOV does not include the dollar value of orders, taxes and tips, or fees charged to merchants, for orders fulfilled through our Commerce Platform.\nIn the third quarter of 2025, Marketplace GOV increased to $25.0 billion, or 25% growth compared to the same quarter of 2024, driven primarily by growth in Total Orders.\n. We define Net Revenue Margin as revenue expressed as a percentage of Marketplace GOV.\nIn the third quarter of 2025, Net Revenue Margin increased to 13.8% from 13.5% in the same quarter of 2024, primarily due to increasing contribution from advertising revenue, a reduction in credits and refunds as a percentage of Marketplace GOV, and a reduction in Dasher costs as a percentage of Marketplace GOV.\nContribution Profit.\nWe define Contribution Profit as our gross profit less sales and marketing expense plus (i) depreciation and amortization expense related to cost of revenue, (ii) stock-based compensation expense and certain payroll tax expense included in cost of revenue and sales and marketing expenses, (iii) allocated overhead included in cost of revenue and sales and marketing expenses, and (iv) inventory write-off related to restructuring. Gross profit is defined as revenue less (i) cost of revenue, exclusive of depreciation and amortization and (ii) depreciation and amortization related to cost of revenue.\n\nDashers receive 100% of tips\nWe use Contribution Profit to evaluate our operating performance and trends. We believe that Contribution Profit is a useful indicator of the economic impact of orders fulfilled through DoorDash as it takes into account the direct expenses associated with generating and fulfilling orders.\nIn the third quarter of 2025, Contribution Profit increased to $1.3 billion, compared to $930 million in the same quarter of 2024, driven primarily by growth in revenue, partially offset by increases in cost of revenue and sales and marketing expenses.\nWe define Adjusted EBITDA as net income (loss) attributable to DoorDash, Inc. common stockholders, adjusted to include net income (loss) attributable to redeemable non-controlling interests and exclude (i) certain legal, tax, and regulatory settlements, reserves, and expenses, (ii) loss on disposal of property and equipment, (iii) transaction-related costs (primarily consists of acquisition, integration, and investment related costs), (iv) impairment expenses, (v) restructuring charges, (vi) inventory write-off related to restructuring, (vii) provision for (benefit from) income taxes, (viii) interest income, net, (ix) other (income) expense, net, (x) stock-based compensation expense and certain payroll tax expense, and (xi) depreciation and amortization expense.\nAdjusted EBITDA is a performance measure that we use to assess our operating performance and the operating leverage in our business.\nIn the third quarter of 2025, Adjusted EBITDA increased to $754 million from $533 million in the same quarter of 2024, driven primarily by growth in Contribution Profit, partially offset by increases in adjusted research and development expense and adjusted general and administrative expense.\nWe define Free Cash Flow as cash flows from operating activities less purchases of property and equipment and capitalized software and website development costs.\nthe third quarter of 2025, we generated net cash provided by operating activities of $871 million and Free Cash Flow of $723 million, up from $531 million and $444 million, respectively, in the same quarter of 2024. The increase in Free Cash Flow was driven primarily by an increase in net cash provided by operating activities.\nResults of Operations\nThe following table summarizes our historical condensed consolidated statements of operations data:\nThree Months Ended September 30,\nNine Months Ended September 30,\nCost of revenue, exclusive of depreciation and amortization shown separately below\nResearch and development\nGeneral and administrative\nDepreciation and amortization\nRestructuring charges\nTotal costs and expenses\nIncome (loss) from operations\nInterest income, net\nIncome (loss) before income taxes\nProvision for (benefit from) income taxes\nNet income (loss) including redeemable non-controlling interests\nLess: net loss attributable to redeemable non-controlling interests\nNet income (loss) attributable to DoorDash, Inc. common stockholders\nCosts and expenses included stock-based compensation expense as follows:\nThree Months Ended September 30,\nNine Months Ended September 30,\nCost of revenue, exclusive of depreciation and amortization\nResearch and development\nGeneral and administrative\nTotal stock-based compensation expense\nDepreciation and amortization related to the following:\nThree Months Ended September 30,\nNine Months Ended September 30,\nResearch and development\nGeneral and administrative\nTotal depreciation and amortization\nThe following table sets forth the components of our condensed consolidated statements of operations data as a percentage of revenue:\nThree Months Ended September 30,\nNine Months Ended September 30,\nCost of revenue, exclusive of depreciation and amortization shown separately below\nResearch and development\nGeneral and administrative\nDepreciation and amortization\nRestructuring charges\nTotal costs and expenses\nIncome (loss) from operations\nInterest income, net\nIncome (loss) before income taxes\nProvision for (benefit from) income taxes\nNet income (loss) including redeemable non-controlling interests\nLess: net loss attributable to redeemable non-controlling interests\nNet income (loss) attributable to DoorDash, Inc. common stockholders\nComparison of the Three and Nine Months Ended September 30, 2024 and 2025\nWe generate a substantial majority of our revenue from orders completed through our Marketplaces and the related commissions charged to partner merchants and fees charged to consumers. Commissions from partner merchants are based on an agreed-upon rate applied to the total dollar value of goods orde"
}