{
  "source_file": "day-20241231.htm",
  "form_type": "10-K",
  "item1_clean": null,
  "item7_clean": "Operating profit (loss).\nOperating profit for the year ended December 31, 2024, was $104.1 million, compared to $133.1 million for the year ended December 31, 2023. Operating profit decreased due to increases in amortization expense, personnel-related costs and selling and marketing expenses, partially offset by gross margin expansion.\n\nOur discussion and analysis of our financial condition and results of operations is based upon our consolidated financial statements and related notes, which have been prepared in accordance with GAAP. The preparation of these financial statements and related notes requires us to make estimates and judgments that affect the reported amounts of assets, liabilities, revenue, and expenses. Certain of our accounting policies require the application of significant judgment by management in selecting the appropriate assumptions for calculating financial estimates. By their nature, these judgments are subject to an inherent degree of uncertainty. These judgments are based on our historical experience, terms of existing contracts, our evaluation of trends in the industry, information provided by our customers, and information available from other outside sources, as appropriate. We evaluate our estimates and judgments on an on-going basis. Our actual results may differ from these estimates. We believe the following is our critical accounting estimate:\n\nDayforce provides global HR, payroll and tax, workforce management, benefits, and talent intelligence functionality. Our platform is used by organizations of all sizes, from small businesses to global organizations, regardless of industry, to optimize management of the entire employee lifecycle, including attracting, hiring, engaging, paying, and developing their people. Dayforce was built as a single application from the ground up that combines a modern, consumer-grade user experience with proprietary application architecture, including a single employee record and a rules engine spanning all areas of HCM. Dayforce provides continuous real-time calculations across all modules to enable, for example, payroll administrators access to data through the entire pay period, and managers access to real-time data to optimize work schedules. Our platform is designed to drive efficiencies for our customers and their employees by improving HCM decision-making processes, streamlining workflows, revealing strategic organizational insights, and simplifying legislative compliance. The platform is designed to ease administrative work for both employees and managers, creating opportunities for companies to increase employee engagement. We sell Dayforce through our direct sales force and partner ecosystem on a subscription PEPM basis. Our subscriptions are typically structured with an initial fixed term of between three and five years, with evergreen renewal thereafter.\n\nWe believe that these non-GAAP financial measures are useful to management and investors as supplemental measures to evaluate our overall operating performance including comparison across periods and with competitors. Our management team uses these non-GAAP financial measures to assess operating performance because these financial measures exclude the results of decisions that are outside the normal course of our business operations, and are used for internal budgeting and forecasting purposes both for short- and long-term operating plans. Additionally, Adjusted EBITDA is a component of our management incentive plan and Adjusted operating profit and Adjusted Cloud recurring gross margin are components of certain performance based equity awards for our named executive officers. Additionally, we believe that the non-GAAP financial measure free cash flow is meaningful to investors because it is a measure of liquidity that provides useful information in understanding and evaluating the strength of our liquidity and future ability to generate cash that can be used for strategic opportunities or investing in our business. The exclusion of capital expenditures facilitates comparisons of our liquidity on a period-to-period basis and excludes items that management does not consider to be indicative of our liquidity.\n\nTotal gross margin is defined as total gross profit as a percentage of total revenue, which is inclusive of product development and management costs, as well as depreciation and amortization associated with cost of revenue. Gross margin for each solution in the table above is defined as total revenue less cost of revenue for the applicable solution as a percentage of total revenue for that related solution, which is exclusive of any product development and management or depreciation and amortization cost allocations.\n\nProduct development and management expense increased $13.9 million, or 6.6%, for the year ended December 31, 2024, compared to the year ended December 31, 2023. The increase reflects increased costs of $7.7 million in hosting our development applications, and an additional $5.1 million of additional labor-related costs.\n\nWe believe that Adjusted operating profit, Adjusted EBITDA, Adjusted EBITDA margin, and Adjusted Cloud recurring gross margin, non-GAAP financial measures, are useful to management and investors as supplemental measures to evaluate our overall operating performance. Adjusted EBITDA is a component of our management incentive plan and Adjusted operating profit and Adjusted Cloud recurring gross margin are components of certain performance based equity awards for our named executive officers, and these metrics are used by management to assess performance and to compare our operating performance to our competitors. Management believes that these non-GAAP financial measures are helpful in highlighting management performance trends because these metrics exclude the results of decisions that are outside the normal course of our business operations.\n\nThe as adjusted column is a non-GAAP financial measure, adjusted to exclude share-based compensation expense and related employer taxes, amortization of acquisition-related intangible assets, and certain other items. The adjustments to operating profit consist of $19.8 million of restructuring expenses, $9.0 million related to the impact of the fair value adjustment for the DataFuzion contingent consideration, and $1.0 million of fees associated with initiating the receivables securitization program. The adjustments to net income also include $14.2 million of foreign exchange loss, $12.9 million of costs associated with the planned termination of our frozen U.S. pension plan, and a $35.8 million net adjustment for the effect of income taxes related to these items.\n\nFor the years ended December 31, 2024 and 2023, income tax expense was $19.5 million and $41.2 million, respectively. The $21.7 million decrease in tax expense was primarily due to decreases of $18.3 million of valuation allowances and $12.3 million of current operations, partially offset by an increase of $10.8 million related to the U.S. Global Intangible Low Tax Income regime. We record a valuation allowance to reduce our deferred tax assets to reflect the net deferred tax assets that we believe will be realized. As of December 31, 2024, we will continue to record a valuation allowance against certain deferred tax assets including state net operating loss carryovers and tax basis intangibles.\n\nSelling and marketing expense.\nSelling and marketing expense increased $91.8 million, or 36.7%, for the year ended December 31, 2024, compared to the year ended December 31, 2023. The increase in selling and marketing expense was mainly attributable to a $60.9 million increase in labor and benefit expenses, including shared-based compensation, commissions, severance, bonus and consulting and contract labor as well as an increase of $20.1 million in advertising expenses, travel, and meetings. The increase in advertising expenses was primarily related to the transition of the Company's name change to Dayforce, Inc. and the related branding campaign.\n\nNet cash provided by financing activities was $59.6 million during the year ended December 31, 2024. This cash inflow was primarily attributable to the increase in proceeds from our debt issuance of $650.0 million, proceeds from the issuance of common stock under our share-based compensation plans of $56.6 million, and the net increase in our customer funds obligations of $51.8 million, partially offset by payments on our long-term debt obligations of $648.3 million, repurchases of common stock of $36.1 million, payment of debt refinancing costs of $11.4 million, and payment of contingent consideration of $3.0 million.\n\nWe believe that our cash flow from operations, available cash and equivalents, and availability under our 2024 Revolving Credit Facility and the Receivables Securitization Program will be sufficient to meet our liquidity needs for the next twelve months and for the foreseeable future. Dayforce Wallet on-demand pay requests are currently funded from our operating cash balances and as needed, through our Receivables Securitization Program, until they are reimbursed by our customers through their normal payroll funding cycles. We evaluate the creditworthiness of each customer for the Dayforce Wallet feature. We anticipate that to the extent that we require additional liquidity, it will be funded through the issuance of equity, the incurrence of additional indebtedness, or a combination thereof. We cannot provide assurance that we will be able to obtain this additional liquidity on reasonable terms, or at all. Additionally, our liquidity and our ability to meet our obligations and to fund our capital requirements, Dayforce Wallet on-demand pay requests, and share repurchases are also dependent on our future financial performance, which is subject to general economic, financial, and other factors that are beyond our control. Accordingly, we cannot provide assurance that our business will generate sufficient cash flow from operations or that future borrowings will be available from additional indebtedness or otherwise to meet our liquidity needs. If we decide to pursue one or more significant acquisitions, we may incur additional debt or sell additional equity to finance such acquisitions, which would result in additional expenses and/or dilution.\n\nRecurring cost of revenue increased by $27.8 million, or 8.6%, for the year ended December 31, 2024, compared to the year ended December 31, 2023. The increase was primarily due to $16.9 million of certain additional labor-related costs, including increases in consulting, contract labor, employee labor, and employee benefits, and $11.4 million of increased costs related to software fees and the cost of hosting our applications to support the growing Dayforce customer base globally. These increases were partially offset by a reduction of $3.4 million in share-based compensation expense.\n\nCash outflows from operating activities for both periods are primarily comprised of personnel-related expenditures, including the payout of year-end employee compensation, and the renewals of prepaid annual contracts that are integral to our business operations. The net positive cash inflow in both periods is primarily due to our growing revenue, partially offset by our operating costs, mainly, investment in our sales force to support our growth initiatives and our product development and management costs which are not eligible for capitalization.\n\nIn March 2021, we issued $575.0 million in aggregate principal amount of 0.25% Convertible Senior Notes due in March 2026. The total net proceeds from the offering, after deducting initial purchase discounts and issuance costs, were $561.8 million. In connection with the Convertible Senior Notes, we entered into capped call transactions which are expected to reduce the potential dilution of our common stock upon any conversion of the Convertible Senior Notes and/or offset any cash payments we could be required to make in excess of the principal amount of converted Notes. We used an aggregate amount of $45.0 million of the net proceeds of the Convertible Senior Notes to purchase the Capped Calls. We used the remainder of the net proceeds from the offering (i) to repay $295.0 million principal amount under the 2018 Revolving Credit Facility and pay related accrued interest and (ii) for general corporate purposes. We expect to retire the Convertible Senior Notes upon maturity in March 2026 with cash and liquidity on hand.\n\nCloud recurring gross margin was 78.9% for the year ended December 31, 2024, compared to 77.0% for the year ended December 31, 2023. The increase in Cloud recurring gross margin was primarily due to the increase in revenue, including float revenue, and due to the growth of the proportion of Dayforce customers live for more than two years, which increased from 85% as of December 31, 2023 to 87% as of December 31, 2024.\n\nTotal gross margin for the year ended December 31, 2024 increased 340 basis points compared to December 31, 2023, and gross profit increased by $165.6 million, or 25.6%, for the year ended December 31, 2024 compared to the year ended December 31, 2023. The increase in gross margin and gross profit was primarily due to the increase in revenue, including float revenue, which outpaced the increase in cost of revenue.\n\nProfessional services and other cost of revenue increased $25.4 million, or 9.6%, for the year ended December 31, 2024, compared to the year ended December 31, 2023, primarily due to $24.0 million of additional labor-related costs, including increases in consulting, contract labor, employee labor, and employee benefits, incurred to implement new customers and additional modules.\n\nDepreciation and amortization expense associated with cost of revenue increased by $13.6 million, or 20.4%, for the year ended December 31, 2024, compared to the year ended December 31, 2023, as we continue to capitalize and subsequently amortize Dayforce-related and other development costs.\n\nNet income was $18.1 million for the year ended December 31, 2024, compared to $54.8 million for the year ended December 31, 2023. Net income declined primarily due to a decrease in operating profit and an increase in other expense, net, partially offset by lower income tax expense.\n\nWe use annual Dayforce revenue retention rate, a non-GAAP financial measure, to measure the percentage of revenues that we retain from our existing Dayforce customers, which we believe is useful to management and investors as an indicator of customer satisfaction and future revenues. Our annual Dayforce revenue retention rate was 98% for the year ended December 31, 2024, and above 97% for the years ended December 31, 2023, and 2022. We set annual targets for Dayforce revenue retention rate and monitor progress toward those targets on a quarterly basis by reviewing known and anticipated customer losses. Our Dayforce revenue retention rate may fluctuate as a result of a number of factors, including the mix of Dayforce solutions used by customers, the level of customer satisfaction, and changes in the number of employees live on our Dayforce solutions.\n\nThe following is a discussion and analysis of our financial condition and results of operations together with our consolidated financial statements and the related notes thereto included elsewhere in this report. This discussion and analysis contains forward-looking statements, including statements regarding industry outlook, our expectations for the future of our business, and our liquidity and capital resources as well as other non-historical statements. These statements are based on current expectations and are subject to numerous risks and uncertainties, including but not limited to the risks and uncertainties described in “Risk Factors” and “Cautionary Note Regarding Forward-Looking Statements.” Our actual results may differ materially from those contained in or implied by these forwa",
  "item2_clean": null
}