{
  "source_file": "day-20250930.htm",
  "form_type": "10-Q",
  "item1_clean": null,
  "item7_clean": null,
  "item2_clean": "Dayforce Recurring Revenue Per Customer\nWe use Dayforce recurring revenue per customer, a non-GAAP financial measure, as an indicator of the average size of our Dayforce customer, which we believe is also useful to management and investors. We calculate and monitor Dayforce recurring revenue per customer on a quarterly basis. Our Dayforce recurring revenue per customer may fluctuate as a result of a number of factors, including the number of live Dayforce customers and the number of modules purchased by each customer.\nConstant Currency Revenue\nWe present percentage change in revenue on a constant currency basis, a non-GAAP financial measure, to assess how our underlying business performed, excluding the effect of foreign currency rate fluctuations, which we believe is useful to management and investors. The average U.S. dollar to Canadian dollar, Australian dollar, and Great British pound foreign exchange rates were $1.38, $1.53, and $0.74 for the three months ended September 30, 2025, respectively, compared to $1.36, $1.49, and $0.77 for the three months ended September 30, 2024, respectively. The average U.S. dollar to Canadian dollar, Australian dollar, and Great British pound foreign exchange rates were $1.40, $1.56, and $0.76 for the nine months ended September 30, 2025, respectively, compared to $1.36, $1.51, and $0.78 for the nine months ended September 30, 2024, respectively.\nAdjusted Operating Profit, Adjusted EBITDA, Adjusted EBITDA Margin, Free Cash Flow, and Free Cash Flow Margin\nWe believe that Adjusted operating profit, Adjusted EBITDA, Adjusted EBITDA margin, free cash flow, and free cash flow margin, non-GAAP financial measures, are useful to management and investors as supplemental measures to evaluate our overall operating performance. Adjusted operating profit, free cash flow, and free cash flow margin are components of certain management compensation plans, and these metrics are used by management to assess performance and to compare our operating performance to our competitors. Management believes that these non-GAAP financial measures are helpful in highlighting management performance trends because these metrics exclude the results of decisions that are outside the normal course of our business operations. Additionally, we believe that the non-GAAP financial measure free cash flow and free cash flow margin are meaningful to investors because they are measures of liquidity that provide useful information in understanding and evaluating the strength of our liquidity and future ability to generate cash that can be used for strategic opportunities or investing in our business. The reduction of capital expenditures facilitates comparisons of our liquidity on a period-to-period basis and excludes items that management does not consider to be indicative of our liquidity.\n\nThe following is a discussion and analysis of our financial condition and results of operations as of, and for, the periods presented and should be read in conjunction with our unaudited condensed consolidated financial statements and notes thereto included elsewhere in this report and with our audited consolidated financial statements and notes thereto in our\n. This discussion and analysis contains forward-looking statements, including statements about the Thoma Bravo Transaction, statements regarding industry outlook, our expectations for the future of our business, and our liquidity and capital resources as well as other non-historical statements. These statements are based on current expectations and are subject to numerous risks and uncertainties, including but not limited to the risks and uncertainties described in\nPart II, Item 1A, “Risk Factors”\n“Cautionary Note Regarding Forward-Looking Statements.”\nOur actual results may differ materially from those contained in or implied by these forward-looking statements. Any reference to a “Note” in this discussion relates to the accompanying notes to the unaudited condensed consolidated financial statements included elsewhere in this report unless otherwise indicated.\n\nIn connection with the Thoma Bravo Transaction, we incurred non-recurring acquisition and transaction fees of $22.2 million for the three and nine months ended September 30, 2025, which are included in general and administrative expense in the condensed consolidated statements of operations. These costs primarily include legal and advisory fees, and other acquisition-related costs. The completion of the Thoma Bravo Transaction is subject to the satisfaction or waiver or certain customary mutual closing conditions. For more information on these conditions, refer to Part II, Item 1A, “\nIf the Thoma Bravo Transaction is consummated, our common stock will no longer be publicly listed and traded on the New York Stock Exchange, the common stock will be deregistered under the Exchange Act, we will no longer file periodic reports with the SEC, and Dayforce will become a privately-held company.\nU.S. Defined Benefit Plans Termination\nThe U.S. defined benefit plans were terminated with an effective date of September 30, 2024. In the third quarter of 2025, we settled the majority of future obligations under our U.S. pension plan through a combination of lump sum payments to eligible, electing participants and the transfer of any remaining benefits to a third-party insurance company through a group annuity contract. The partial plan termination was funded with plan assets of approximately $299 million. In connection with the plan termination, a non-cash loss of $172.1 million was recorded to other expense (income), net in the condensed consolidated statements of operations for the three and nine months ended September 30, 2025. During the fourth quarter of 2025, we expect to finalize the group annuity purchase in connection with the termination of our U.S. pension plan. The transaction is expected to be funded with approximately $14 million of plan assets and $5 million of cash, and we anticipate incurring an additional settlement loss of approximately $11 million.\nWe are also in the process of finalizing the wind down of the nonqualified defined benefit plan, which we expect will be completed in 2025.\n\nWe are closely monitoring changes in international trade relations, economic policies, and legislation and regulations, which could adversely impact the global economy and our operating results. Currently, we are not experiencing any material impact to our operating results as a result of the direct impact of tariffs on goods to certain countries from which we export hardware for our time clocks. However, prolonged changes and uncertainty in interest rates and foreign exchange rates, and shifts in the overall macroeconomic demand for our services could adversely impact our operating results.\nAdditionally, in July 2025, U.S. Congress enacted the OBBBA, which includes significant provisions, including tax cut extensions and modifications to the international tax framework. While we continue to evaluate the impact of these legislative changes as additional guidance becomes available, uncertainty remains regarding the timing and interpretation by tax authorities in affected jurisdictions. These legislative changes are expected to impact our future cash tax remittances, resulting from changes to tax deductibility rules for domestic research and development costs.\nAdditional discussion of the ways in which adverse economic and market conditions could affect our business, operating results, or financial condition is referenced below and contained in\nPart II, Item 1A, “Risk Factors”\nH\now We Assess Our Performance\n\n\"How We Assess Our Performance\"\n“Non-GAAP Financial Measures”\nsection for discussion of and the definition of Dayforce recurring revenue per customer.\nThe increase in total revenue was partially offset by a decrease in float revenue, which was driven by a decrease in average yield of 36 basis points compared to the three months ended September 30, 2024. This was partially offset by a 1.3% increase in average float balance for our customer funds for the three months ended September 30, 2025, which increased to $4.54 billion, compared to $4.48 billion for the three months ended September 30, 2024.\nCosts of recurring services.\nThe increase of $8.2 million, or 9.4%, for the three months ended September 30, 2025, compared to the three months ended September 30, 2024, was primarily due to a $3.8 million increase in consulting and contract labor and a $5.1 million increase in costs of hosting our applications and software fees to support the continued global growth of the Dayforce customer base. These increases were partially offset by a $0.7 million decrease in employee labor and benefits.\nCosts of professional services.\nThe increase of $8.8 million, or 11.7%, for the three months ended September 30, 2025, compared to the three months ended September 30, 2024, was primarily due to a $8.0 million increase in consulting and contract labor as well as employee labor and benefits incurred to implement new customers and additional modules.\nProduct development and management expense.\nThe increase of $3.9 million, or 7.0%, for the three months ended September 30, 2025, compared to the three months ended September 30, 2024, was primarily due to a $3.2 million increase in labor and benefit related expenses, including share-based compensation, consulting and contract labor, and severance, as well as a $0.8 million increase in costs associated with hosting development applications.\nFor the three months ended September 30, 2025, and 2024, our investment in software development was $58.1 million and $52.4 million, respectively, consisting of $33.8 million and $29.5 million of research and development expense, and $24.3 million and $22.9 million in capitalized software development costs, respectively.\nSelling and marketing expense.\nThe increase of $1.0 million, or 1.2%, for the three months ended September 30, 2025, compared to the three months"
}