{
  "source_file": "dd-20250930.htm",
  "form_type": "10-Q",
  "item1_clean": null,
  "item7_clean": null,
  "item2_clean": "ITEM 2. MANAGEMENT'S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS\nManagement’s discussion and analysis of financial condition and results of operations is provided as a supplement to, and should be read in conjunction with, the interim Consolidated Financial Statements and related notes to enhance the understanding of the Company’s operations and present business environment. Components of management’s discussion and analysis of financial condition and results of operations include:\nResult of Operations\nChanges in Financial Condition\nOVERVIEW\nDuPont is a global innovation leader, providing advanced solutions that help transform industries and improve everyday life across our key markets including healthcare, water, construction, transportation, and electronics.\nAs of September 30, 2025, the Company has $3.5 billion of working capital and approximately $2.0 billion in cash and cash equivalents. The Company expects its cash and cash equivalents, cash generated from operations, and ability to access the debt capital markets to provide sufficient liquidity and financial flexibility to meet the liquidity requirements associated with its continuing operations.\nSubsequent to quarter end, on November 1, 2024, DuPont completed the previously announced separation of its Electronics business, (the \"Electronics Separation\") by way of a pro rata distribution to holders of DuPont common stock as of the close of business on October 22, 2025, of all the issued and outstanding common stock of Qnity Electronics, Inc. (“Qnity” and the pro rata distribution, the \"Distribution\").\nOn August 29, 2025, DuPont announced a definitive agreement to sell the Aramids business (Kevlar® and Nomex®), (the \"Aramids Business\") to TJC LP, (“TJC”), in a transaction valuing the Aramids Business at approximately $1.8 billion (the “Aramids Divestiture”), pursuant to which, subject to the satisfaction of customary closing conditions.\nNew Jersey Settlement Agreement\nIn August 2025, DuPont together with Chemours and Corteva agreed to a proposed Judicial Consent Order with the State of New Jersey (the “NJ Settlement”) to resolve all outstanding claims by the State of New Jersey pending against the companies related to legacy use of a wide variety of substances of concern, including, but not limited to DNAPL (dense non-aqueous phase liquids), chemical solvents, and PFAS. The NJ Settlement is subject to approval from the Federal District Court of New Jersey (Camden), (the “NJ Court”). See Note 14 to the interim Consolidated Financial Statement for additional information.\nMacroeconomic Conditions\nIn recent months, the U.S. government has announced various actions related to trade, such as the imposition of new or increased tariffs on product imports from certain countries, including Canada, Mexico and China. There is significant uncertainty about the ultimate extent and duration of the tariffs, responsive actions from other countries and the resulting impacts, including on general economic conditions and on the Company’s financial condition, liquidity, or results of operations. Ultimately, these trade disputes and policy changes, including actions taken in response, have the potential to reduce the competitiveness of DuPont products and cause sales to decline, which could adversely affect the Company’s business, financial condition and results of operations.\nSee Part II, Item 1A. Risk Factors for additional information.\nQ1 2025 Segment Realignment\nEffective in the first quarter of 2025, in light of the Electronics Separation, the Company realigned its management and reporting structure. This realignment resulted in a change in reportable segments in the first quarter of 2025 which changed the manner in which the Company reports financial results by segment, (the \"Q1 2025 Segment Realignment\"). As a result, the businesses separated as part of the Electronics Separation are reported separately from the Industrials businesses of DuPont. The Consolidated Financial Statements have been recast for all periods presented to reflect the new two segment reporting structure as described below:\nElectronicsCo includes the businesses within the Semiconductor Technologies and Interconnect Solutions lines of business, as well as the electronics-related product lines previously within Industrial Solutions, including electronics polymers and perfluoroeasltomer materials and parts (Kalrez®).\nIndustrialsCo includes the businesses within the former Water & Protection segment, the healthcare and non-electronics businesses, including Vespel® parts and shapes, previously in Industrial Solutions and the Auto Adhesives & Fluids, Multibase\nTM\nand Tedlar® businesses, previously within Corporate & Other.\nBeginning in the fourth quarter of 2025, the financial results of the Electronics business will be reflected in the Consolidated Financial Statements as discontinued operations, along with comparative periods.\nOn November 6, 2025, the Board of Directors declared a fourth quarter 2025 dividend for New DuPont of $0.20 per share, payable on December 15, 2025, to shareholders of record on November 28, 2025.\nOn June 25, 2025, the Company announced that its Board of Directors declared a third quarter 2025 dividend of $0.41 per share which was paid on September 15, 2025, to shareholders of record on August 29, 2025.\nRESULTS OF OPERATIONS\nSummary of Sales Results\nThe following table summarizes sales variances by segment and geographic region from the prior year:\nSales Variances by Segment and Geographic Region\nPercentage change from prior year\nThree Months Ended September 30, 2025\nNine Months Ended September 30, 2025\nEMEA\nEurope, Middle East and Africa.\nThe Company reported net sales for the three months ended September 30, 2025 of $3.1 billion, up 7 percent from $2.9 billion for the three months ended September 30, 2024, due to a 7 percent increase in volume and a 1 percent favorable currency impact partially offset by a 1 percent decrease in local price and product mix. The volume increase was driven by ElectronicsCo (up 11 percent) and IndustrialsCo (up 5 percent). Local price and product mix decreased in ElectronicsCo and IndustrialsCo (both down 1 percent). The Company had an approximately $70 million benefit from order timing related to system cut-over activities in advance of the Electronics Separation.\nNet sales for the nine months ended September 30, 2025 were 8.7 billion, up 6 percent from $8.3 billion for the nine months ended September 30, 2024, due to\n\nInterest rate swap impacts includes a loss of $3 million and a gain of $191 million for the three months ended September 30, 2025 and 2024, respectively, and included mark-to-market adjustments. Interest income was $27 million and $14 million for the three months ended September 30, 2025 and 2024, respectively, which includes $9 million for the three and nine months ended September 30, 2025 related to interest income earned from cash received associated with the Qnity Notes. The three months ended September 30, 2025 and 2024 included $11 million and $17 million, respectively, net foreign exchange loss.\nIn the first nine months of 2025, sundry income (expense) - net was income of $112 million compared $147 million in the first nine months of 2024. The first nine months of 2025 included $48 million gain related to interest rate swap activity including mark-to-market adjustments and interest income of $68 million, partially offset by foreign exchange losses of $33 million. The first nine months of 2024 included a $152 million net gain related to interest rate swap activity including mark-to-market adjustments and $55 million of interest income partially offset by a $74 million loss on debt extinguishment and a $17 million loss on foreign exchange.\nSee Notes 7 and 19 to the interim Consolidated Financial Statements for additional information.\nInterest expense was $99 million and $87 million for the three months ended September 30, 2025 and 2024, respectively, and $266 million and $282 million for the nine months ended September 30, 2025 and 2024, respectively. The increase in interest expense during the three months ended September 30, 2025 compared to the same period the prior year is primarily due to $14 million of interest expense associated with the Qnity Notes partially offset by a reduction in capitalized interest.\nThe decrease in interest expense during the nine months ended September 30, 2025 compared to the same period the prior year is primarily due to the absence of interest expense on the partial redemption of $650 million aggregate principal amount of the 2038 notes and the dedesignation of 2022 Swaps partially offset by interest expense associated with the Qnity Notes.\nSee Note 19 to the interim Consolidated Financial Statements for further detail on the 2022 Swaps.\nProvision for Income Taxes on Continuing Operations\nThe Company's effective tax rate fluctuates based, among other factors, on where income is earned and the level of income relative to tax attributes. The effective tax rate on continuing operations for the third quarter of 2025 was 5.8 percent, compared with an effective tax rate of 17.9 percent for the third quarter of 2024. The lower effective tax rate for the third quarter of 2025 in comparison to the third quarter of 2024 was principally the result of the release of a valuation allowance on certain tax attributes in connection with the anticipated Aramids Divestiture. For the first nine months of 2025, the effective tax rate on continuing operations was 20.4 percent, compared with 27.7 percent for the first nine months of 2024. The decrease of the effective tax rate in 2025 included the previously mentioned valuation allowance release in comparison to 2024 which included certain discrete tax expenses, including an international statutory tax settlement for which the Company is partially indemnified.\nSEGMENT RESULTS\nThe Company's measure of profit/loss for segment reporting pur"
}