{
  "source_file": "ddog-20241231.htm",
  "form_type": "10-K",
  "item1_clean": "Datadog is the observability and security platform for cloud applications.\nOur SaaS platform integrates and automates infrastructure monitoring, application performance monitoring, log management, user experience monitoring, cloud security, and many other capabilities to provide unified, real-time observability and security for our customers’ entire technology stack. Datadog is used by organizations of all sizes and across a wide range of industries to enable digital transformation and cloud migration, drive collaboration among development, operations, security and business teams, accelerate time to market for applications, reduce time to problem resolution, secure applications and infrastructure, understand user behavior, and track key business metrics.\nSoftware applications are transforming how organizations engage with customers and operate their businesses. Companies across all industries are re-platforming their businesses to cloud native or hybrid on-premise and cloud infrastructures to enable this digital transformation. Historically, engineering teams have been siloed, making the development of next generation applications in dynamic cloud environments challenging. We started Datadog to break this model and facilitate collaboration among development and operations teams, enabling the adoption of DevOps practices. Since then, we have continuously pushed to unify separate tools into an integrated monitoring and analytics platform, readily available to everyone who cares about applications and their impact on business. And while we continue to broaden our capabilities in observability, we have expanded our platform into use cases beyond observability, including cloud security, software delivery, and cloud service management.\nWith our founding goal of breaking down silos between Dev and Ops, we set out in 2010 to build a real-time data integration platform to turn chaos of having uncorrelated data from disparate sources into digestible and actionable insights. Since launching our first use case with Infrastructure Monitoring in 2012, we have expanded our platform rapidly, and today, we offer end-to-end monitoring and analytics, powered by a common data model that is extensible for use cases across observability, security, software delivery, and service management. In 2024, we launched Event Management to aggregate and consolidate alerts to accelerate remediation, and LLM Observability to help customers investigate how they can safely deploy and manage their models in production.\nOur proprietary platform combines the power of metrics, traces, logs, user sessions, security signals, and other data from a single agent and over 850 integrations to provide a unified view of infrastructure, application performance and the real-time events impacting performance. Datadog is designed to be cloud agnostic and easy to deploy, with hundreds of out-of-the-box integrations, a built-in understanding of modern technology stacks, and extensive customizations. Customers can deploy our platform across their entire infrastructure, making it ubiquitous and a daily part of the lives of developers, operations engineers, security professionals, and business leaders.\nWe believe that our platform currently addresses a significant portion of the IT Operations Management market. According to Gartner, the IT Operations Management market represents a $81 billion opportunity in 2028. We believe a large portion of this spend is for legacy on-premise and private cloud environments but does not fully include the opportunity in modern multi-cloud and hybrid cloud environments. Our platform is designed to address both legacy and modern environments.\nWe employ a land-and-expand business model centered around offering products that are easy to adopt and have a very short time to value. Our customers can expand their footprint with us on a self-service basis. Our customers often significantly increase their usage of the products they initially buy from us and expand their usage to other products we offer on our platform. We grow with our customers as they expand their workloads in the public and private cloud.\nOur Solution and Key Strengths\nDatadog was founded on the premise that the old model of siloed developers and IT operations engineers is broken, and that legacy tools used for monitoring static on-premise architectures do not work in modern cloud or hybrid environments. Datadog’s cloud-native platform enables development and operations teams to collaborate, quickly build and improve applications, and drive business performance. Empowered by our out-of-the box functionality and simple, self-service installation, our customers are able to rapidly deploy our platform to provide application- and infrastructure-wide visibility, often within minutes.\nBuilt for dynamic cloud and hybrid infrastructures\n. Our innovative platform was born in the cloud and was built to work with ephemeral cloud technologies such as microservices, containers and serverless computing. Our data model was built to work at cloud scale with highly dynamic data sets and processes trillions of events per hour.\nSimple but not simplistic\n. Our platform is easy-to-use with out-of-the-box integrations, customizable drag-and-drop dashboards, real-time visualization and prioritized alerting. The platform is deployed in a self-service installation process within minutes, allowing new users to quickly derive value without any specialized training or heavy implementation or customization. It is highly extensible across a wide array of use cases to a broad set of developers, operations engineers, security professionals, product managers, product designers, platform engineers, customer support staff, and business users. As a result, our platform is integral to business operations and used every day, and our users find increasing value in the solution over time.\nIntegrated data platform\n. We were the first to combine the “three pillars of observability” - metrics, traces, and logs - into a single end-to-end platform with the introduction of our log management solution in 2018. Today, our platform combines infrastructure monitoring, application performance monitoring, log management, user experience monitoring, security monitoring, cloud service management, and developer-focused monitoring in one integrated data platform. This approach increases efficiency by reducing both the expense and friction of attempting to glean insights from disparate systems. We are able to provide a unified view across the IT stack, including infrastructure and application performance, as well as the real-time events impacting performance. Each of our products is integrated and, taken together, they provide the ability to view metrics, traces, logs, sessions, security signals, and other data side-by-side and to perform correlation analysis.\nBuilt for collaboration\n. Our platform was built to break down the silos between developers and operations teams in order to help organizations adopt DevOps practices and improve overall business performance. We provide development and operations teams with a common set of tools to develop a joint understanding of application performance and shared insights into the infrastructure supporting the applications. Additionally, our customizable and interactive dashboards can be shared with business teams to provide them with real-time actionable insights. Over time, as the use cases for our platform have expanded, the types of users that we can serve and help to collaborate have expanded as well, to include security professionals, product managers, product designers, platform engineers, customer support staff, and business users.\n. Our platform is designed to be deployable across all environments, including public cloud, private cloud, on-premise, multi-cloud, and hybrid environments, allowing organizations to diversify their infrastructure and reduce single vendor dependence.\n. Datadog is frequently deployed across a customer’s entire infrastructure, making it ubiquitous. Compared to legacy systems that are often used only by a few users in an organization’s IT operations team, Datadog is a daily part of the lives of developers, operations engineers and business leaders.\nIntegrates with our customers’ complex environments\n. We enable development and operations teams to harness the full spectrum of SaaS and open source tools. We have over 850 out-of-the-box integrations with technologies to provide significant value to our customers without the need for professional services. Our integrations provide for comprehensive data point aggregation and consistent, up-to-date, high-quality customer experiences across heterogeneous IT environments as they are fully maintained by Datadog.\nPowered by robust machine-learning and artificial intelligence\n. Our platform ingests massive amounts of data into our unified data warehouse. We develop actionable insights using our advanced analytics capabilities. Our platform's Watchdog capabilities feature artificial intelligence and machine learning that can cross-correlate metrics, traces, logs, sessions, security signals, and other data to identify outliers and notify users of potential anomalies; discover and help resolve issues quickly with automated root cause analysis; augment the troubleshooting workflow with contextual insights; and minimize impact on customers.\n. Our SaaS platform is delivered through the cloud. Our platform is massively scalable, currently monitoring trillions of events per hour and millions of servers and containers at any point in time. We offer secure, easily accessible data retention at full granularity for extensive periods of time, which can provide customers with a complete view of their historical data.\nKey Benefits to Our Customers\nOrganizations of all sizes, in all industries, both private and public, purchase our products for a variety of use cases. As of December 31, 2024, we had approximately 30,000 customers in over 150 countries. Our platform provides the following key benefits to our customers:\nAccelerate digital transformation\n. We enable customers to take full advantage of the cloud to develop and maintain mission-critical applications with agility and with confidence in the face of increasing business and time pressure and complexity of underlying infrastructure. As a result, our platform helps accelerate innovation cycles, deliver exceptional digital experiences and optimize business performance.\nReduce time to problem detection and resolution\n. Using infrastructure, APM, log data, and data from integrations in our unified platform, our customers are able to quickly isolate the root cause of application issues in one place where they otherwise would be required to spend hours trying to investigate using multiple tools. The reduction in mean time to detection and mean time to resolution helps our customers avoid lost revenues and enhance customer experience.\nImprove agility of development, operations, security and business teams\n. We eliminate the historical silos of development and operations teams and provide a platform that enables efficient and agile development through the adoption of DevOps and DevSecOps. Our platform enables development, operations and security teams to collaborate closely with a shared understanding of data and analytics. This helps them develop a joint understanding of application performance and shared insights into the infrastructure supporting the applications.\nEnable operational efficiency\n. Our solution is easy to install, which eliminates the need for heavy implementation costs and professional services. We have hundreds of integrations with key technologies, from which our customers can derive significant value, avoiding internal development costs and professional services required to create those integrations. Our customer-centric pricing model is tailored to customers’ desired usage needs. Our platform empowers customers to bette",
  "item7_clean": "Item 7. Management’s Discussion and Analysis of Financial Condition and Results of Operations\nDatadog is the observability and security platform for cloud applications.\nOur SaaS platform integrates and automates infrastructure monitoring, application performance monitoring, log management, user experience monitoring, cloud security, and many other capabilities to provide unified, real-time observability\nand security for our customers’ entire technology stack. Datadog is used by organizations of all sizes and across a wide range of industries to enable digital transformation and cloud migration, drive collaboration among development, operations, security and business teams, accelerate time to market for applications, reduce time to problem resolution, secure applications and infrastructure, understand user behavior and track key business metrics.\nWe generate revenue from the sale of subscriptions to customers using our cloud-based platform. The terms of our subscription agreements are primarily monthly or annual. Customers also have the option to purchase additional products, such as additional containers to monitor, custom metrics packages, anomaly detection and app analytics. Professional services are generally not required for the implementation of our products and revenue from such services has been immaterial to date.\nWe employ a land-and-expand business model centered around offering products that are easy to adopt and have a very short time to value. Our customers can expand their footprint with us on a self-service basis. Our customers often significantly increase their usage of the products they initially buy from us and expand their usage to other products we offer on our platform. We grow with our customers as they expand their workloads in the public and private cloud.\nAs of December 31, 2024, we had $1,247.0 million in cash and cash equivalents and $2,942.1 million in marketable securities. We have grown rapidly in recent periods, with revenues for the fiscal years ended December 31, 2024, 2023 and 2022 of $2,684.3 million, $2,128.4 million, and $1,675.1 million, respectively, representing year-over-year growth of 26% from the fiscal year ended December 31, 2023 to the fiscal year ended December 31, 2024 and 27% from the fiscal year ended December 31, 2022 to the fiscal year ended December 31, 2023. Substantially all of our revenue is from subscription software sales. We have continued to make significant expenditures and investments, including in personnel-related costs, sales and marketing, infrastructure and operations, and have incurred net income (losses) of $183.7 million, $48.6 million and $(50.2) million for the fiscal years ended December 31, 2024, 2023 and 2022, respectively. Our operating cash flow was $870.6 million, $660.0 million and $418.4 million for the years ended December 31, 2024, 2023 and 2022, respectively. Our free cash flow was $775.1 million, $597.5 million and $353.5 million for the years ended December 31, 2024, 2023 and 2022, respectively. See the section titled “—Liquidity and Capital Resources—Non-GAAP Free Cash Flow” below.\nUnfavorable conditions in the economy both in the United States and abroad may negatively affect the growth of our business and our results of operations. For example, macroeconomic events including fluctuating inflation and interest rates, the Russian invasion of Ukraine, and the conflicts in the Middle East have led to economic uncertainty. Historically, during periods of economic uncertainty and downturns, businesses may slow spending on information technology, which may impact our business and our customers’ businesses.\nDue to our subscription model, the effect of macroeconomic conditions may not be fully reflected in our results of operations until future periods. However, if economic uncertainty increases or the global economy worsens, our business, financial condition and results of operations may be harmed. For further discussion of the potential impacts of macroeconomic events on our business, financial condition, and operating results, see “Risk Factors” included in Part I, Item 1A of this report.\nConvertible Senior Notes\nIn December 2024, we completed a private offering of $1.0 billion aggregate principal amount of the 2029 Notes. The total proceeds from the 2029 Notes offering were approximately $979.1 million, net of $20.9 million of debt issuance costs.\nWe used a portion of the net proceeds from the offering (i) to pay the $100.9 million cost of the privately negotiated capped call transactions relating to the 2029 Notes, or the Capped Calls and (ii) to repurchase for $196.8 million in privately negotiated transactions approximately $112.0 million in aggregate principal amount of the 2025 Notes, including accrued and unpaid interest.\nConvertible Senior Notes\nFactors Affecting Our Performance\nAcquiring New Customers\nWe believe there is substantial opportunity to continue to grow our customer base. We intend to drive new customer acquisition by continuing to invest significantly in sales and marketing to engage our prospective customers, increase brand awareness and drive adoption of our platform and products. We also plan to continue to invest in building brand\nawareness within the development and operations communities. As of December 31, 2024, we had approximately 30,000 customers spanning organizations of a broad range of sizes and industries, compared to approximately 27,300 as of December 31, 2023. Our ability to attract new customers will depend on a number of factors, including the effectiveness and pricing of our products, offerings of our competitors, and the effectiveness of our marketing efforts.\nWe define the number of customers as the number of accounts with a unique account identifier for which we have an active subscription in the period indicated. Users of our free trials or tier are not included in our customer count. A single organization with multiple divisions, segments or subsidiaries is generally counted as a single customer. However, in some cases where they have separate billing terms, we may count separate divisions, segments or subsidiaries as multiple customers.\nExpanding Within Our Existing Customer Base\nOur base of customers represents a significant opportunity for further sales expansion. As of December 31, 2024, we had approximately 3,610 customers with annual run-rate revenue, or ARR, of $100,000 or more, representing 88% of our ARR, up from 3,190 as of December 31, 2023, representing 86% of our ARR. As of December 31, 2024, we had approximately 462 customers with annual run-rate revenue, or ARR, of $1.0 million or more, up from 396 as of December 31, 2023. We monitor our number of customers with ARR of $100,000 or more, and believe it is useful to investors, as an indicator of our ability to grow the number of customers that are exceeding this ARR threshold. We define ARR as the annual run-rate revenue of subscription agreements from all customers at a point in time. We calculate ARR by taking the monthly run-rate revenue, or MRR, and multiplying it by 12. MRR for each month is calculated by aggregating, for all customers during that month, monthly revenue from committed contractual amounts, additional usage, usage from subscriptions for a committed contractual amount of usage that is delivered as u\nand monthly subscriptions. ARR and MRR should be viewed independently of revenue, and do not represent our revenue under GAAP on a monthly or annualized basis, as they are operating metrics that can be impacted by contract start and end dates and renewal rates. ARR and MRR are not intended to be replacements or forecasts of revenue.\nA further indication of the propensity of our customer relationships to expand over time is our dollar-based net retention rate, which compares our ARR from the same set of customers in one period, relative to the year-ago period. As of December 31, 2024, our trailing 12-month dollar-based net retention rate was high-110%'s. As of December 31, 2023, our trailing 12-month dollar-based net retention rate was mid-110%'s. The increase in our trailing 12-month dollar-based net retention rate was attributable to increased usage growth from existing customers. We calculate dollar-based net retention rate as of a period end by starting with the ARR from the cohort of all customers as of 12 months prior to such period-end, or the Prior Period ARR. We then calculate the ARR from these same customers as of the current period-end, or the Current Period ARR. Current Period ARR includes any expansion and is net of contraction or attrition over the last 12 months, but excludes ARR from new customers in the current period. We then divide the total Current Period ARR by the total Prior Period ARR to arrive at the point-in-time dollar-based net retention rate. We then calculate the weighted average of the trailing 12-month point-in-time dollar-based net retention rates, to arrive at the trailing 12-month dollar-based net retention rate.\nWe believe that our land-and-expand business model allows us to efficiently increase revenue from our existing customer base. Our customers often expand the deployment of our platform across large teams and more broadly within the enterprise as they migrate more workloads to the cloud, find new use cases for our platform, and generally realize the benefits of our platform. We intend to continue to invest in enhancing awareness of our brand and developing more products, features and functionality, which we believe are important factors to achieve widespread adoption of our platform. Our ability to increase sales to existing customers will depend on a number of factors, including our customers’ satisfaction with our solution, competition, pricing and overall changes in our customers’ spending levels.\nSustaining Innovation and Technology Leadership\nOur success is dependent on our ability to sustain innovation and technology leadership in order to maintain our competitive advantage. We believe that we have built a highly differentiated platform that will position us to further extend the adoption of our platform and products. Datadog is frequently deployed across a customer’s entire infrastructure, making it ubiquitous. Datadog is a daily part of the lives of developers, operations engineers and business leaders. We employ a land-and-expand business model centered around offering products that are easy to adopt and have a very short time to value. Our efficient go-to-market model enables us to prioritize significant investment in innovation. We have demonstrated the success of our platform approach, through expansion beyond our initial infrastructure monitoring solution to include over 20 products. As of each of the years ended December 31, 2024 and 2023, approximately 83% of our customers were using more than one product. Additionally, as of December 31, 2024, approximately 50% of our customers were using more than four products, up from approximately 47% a year earlier, and approximately 26% of our customers were using more than six products, up from approximately 22% a year earlier. We believe these metrics indicate strong expansion of product adoption across our platform.\nWe intend to continue to invest in building additional products, features and functionality that expand our capabilities and facilitate the extension of our platform to new use cases. We also intend to continue to evaluate strategic acquisitions and investments in businesses and technologies to drive product and market expansion. Our future success is dependent on our ability to successfully develop, market and sell existing and new products to both new and existing customers.\nExpanding Internationally\nWe believe there is a significant opportunity to expand usage of our platform outside of North America. Revenue, as determined based on the billing address of our customers, from regions outside of North America was approximately 30% of our total revenue for each of the years ended December 31, 2024 and 2023. In addition, we have made and plan to continue to make significant investments to expand geographically, particularly in EMEA and APAC. Although these investments may adversely affect our operating results in the near term, we believe that they will contribute to our long-term growth. Beyond North America, we now have sales presence internationally, primarily in Amsterdam, Dublin, London, Paris, Seoul, Singapore, Sydney, and Tokyo.\nComponents of Results of Operations\nWe generate revenue from the sale of subscriptions to customers using our cloud-based platform. The terms of our subscription agreements are primarily monthly, annual or multi-year, with the majority of our revenue coming from annual subscriptions. Our customers can enter into a subscription for a committed contractual amount of usage that is apportioned ratably on a monthly basis over the term of the subscription period, a subscription for a committed contractual amount of usage that is delivered as used, or a monthly subscription based on usage. To the extent that our customers’ usage exceeds the committed contracted amounts under their subscriptions, either on a monthly basis in the case of a ratable subscription or once the entire commitment is used in the case of a delivered-as-used subscription, they are charged for their incremental usage.\nUsage is measured primarily by the number of hosts or by the volume of data indexed. A host is generally defined as a server, either in the cloud or on-premise. Our infrastructure monitoring, APM and network performance monitoring products are priced per host, our logs product is priced primarily per log events indexed and secondarily by events ingested. Customers also have the option to purchase additional products, such as additional container or serverless monitoring, custom metrics packages, anomaly detection, synthetic monitoring and app analytics.\nIn the case of subscriptions for committed contractual amounts of usage, revenue is recognized ratably over the term of the subscription agreement, generally beginning on the date that our platform is made available to a customer. As a result, much of our revenue is generated from subscriptions entered into during previous periods. Consequently, any decreases in new subscriptions or renewals in any one period may not be immediately reflected as a decrease in revenue for that period, but could negatively affect our revenue in future quarters. This also makes it difficult for us to rapidly increase our revenue through the sale of additional subscriptions in any period, as revenue is recognized over the term of the subscription agreement. In the case of a subscription for a committed contractual amount of usage that is delivered as used, a monthly subscription based on usage, or usage in excess of a ratable subscription, we recognize revenue as the product is used, which may lead to fluctuations in our revenue and results of operations. In addition, historically, we have experienced seasonality in new customer bookings, as we typically enter into a higher percentage of subscription agreements with new customers in the fourth quarter of the year.\nDue to ease of implementation of our products, professional services generally are not required and revenue from such services has been immaterial to date.\nCost of revenue primarily consists of expenses related to providing our products to customers, including payments to our third-party cloud infrastructure providers for hosting our software, personnel-related expenses for operations and global support, including salaries, benefits, bonuses and stock-based compensation, payment processing fees, information technology, depreciation and amortization related to the amortization of acquired intangibles and internal-use software and other overhead costs such as allocated facilities.\nWe intend to continue to invest additional resources in our platform infrastructure and our customer suppo",
  "item2_clean": null
}