{
  "source_file": "de-20241027x10k.htm",
  "form_type": "10-K",
  "item1_clean": "Smart Industrial Operating Model and Leap Ambitions\nOur Smart Industrial Operating Model is based on the following three focus areas:\n. A strategic alignment of products and solutions around our customers’ production systems. Production systems refer to the series of steps our customers take to execute different tasks, operations, and projects to grow an agricultural product or execute a project.\n. Investments in technology, as well as research and development, that deliver intelligent solutions to our customers through hardware and devices, embedded software, connectivity, data platforms, and applications. The technology stack leverages these core technologies across the enterprise, including digital capabilities, automation and machine learning, autonomy, and alternative power technologies. The stack has the potential to unlock economic and sustainable value for customers by optimizing jobs, strengthening decision-making, and better connecting the steps of a production system.\n. The enterprise integration of our aftermarket and support capabilities to more effectively manage customer equipment, service, and technology needs across the full lifetime of a John Deere product, and with a specific lifecycle solution focus on the ownership experience. This integrated support seeks to enhance customer value through proactive and reactive support, easy access to parts, value-add services, and precision upgrades, regardless of when a customer purchases our equipment.\nOur Leap Ambitions are a framework designed to boost economic value and sustainability for our customers. The Leap Ambitions set goals to measure the results of our Smart Industrial Operating Model. The ambitions align across our customers’ production systems, seeking to optimize their operations to deliver better outcomes with fewer resources.\nThe Leap Ambitions framework has three components: (i) size the incremental market opportunity, quantifying the value that can be created; (ii) identify the key actions required to guide investment in digitalization, autonomy, automation, and alternative power technologies; and (iii) define the desired financial and sustainable outcomes we hope to achieve to help investors and stakeholders understand the opportunities that can be unlocked in the future through present investments. Current financial and sustainability goals for the Leap Ambitions relate to workforce safety, agriculture customer outcomes, product circularity, environmental footprint, Solutions as a Service, and equipment operations operating return on sales (OROS).\nWe aim to deliver ongoing value across our product lines by digitally connecting certain equipment we produce, enabling our customers to leverage technology for better economic and more sustainable outcomes in their businesses. We are measuring our customers’ utilization of our technology, in part, by the number of engaged acres, which is a measure of our PPA and SAT customers’ use of the John Deere Operations Center (our online farm management system). Engaged acres generally reflects the number of unique acres with at least one operation pass recorded in the Operations Center in the past 12 months. We are also introducing viable alternative power technologies for various product families. Furthermore, we plan to enhance how we deliver value by investing in a Solutions as a Service business model.\nWe also aim to enable our customers to be more sustainable in their production steps. For example, we provide our agricultural customers with technology solutions that help to improve their crops’ nitrogen use efficiency and increase their crops’ protection efficiency. Across all segments we believe we will deliver ongoing value by continuing to focus on reducing the CO\ne emissions from our equipment, including offering hybrid-electric and electric options where feasible in our product families. We also continue to work toward production of a fully autonomous, battery-powered agricultural tractor and have launched several models of electric turf and compact construction products. We also expect to support sustainable outcomes and deliver value through increasing the use of grade management control for earthmoving customers, intelligent boom control for forestry customers, and precision solutions for roadbuilding customers.\nEquipment Operations\nOur equipment operations consist of three of our business segments: PPA, SAT, and CF. In fiscal year 2024, PPA generated $20,834 net sales, or 47 percent of equipment operations net sales; SAT generated $10,969 net sales, or 24 percent of equipment operations net sales; and CF generated $12,956 net sales, or 29 percent of equipment operations net sales.\nProduction and Precision Agriculture\nThe PPA segment is committed to meeting the fundamental needs of our customers through a combination of equipment and technology designed to enable our customers to overcome some of their biggest challenges: doing more with less, labor shortages, volatile input costs, and executing jobs in tighter timeframes. This segment defines, develops, and delivers global equipment and technology solutions for production-scale growers of crops like large grains (such as corn and soy), small grains (such as wheat, oats, and barley), cotton, and sugarcane. Equipment manufactured and distributed by the segment includes large and certain mid-size tractors, combines, cotton pickers, cotton strippers, sugarcane harvesters, and related harvesting front-end equipment. In addition, the segment includes tillage, seeding, and application equipment, including sprayers and nutrient management and soil preparation machinery.\n\nOur forestry and roadbuilding businesses operate globally. The construction business operates in competitive markets in North and South America, as well as other global markets. Global competitors of the CF segment include Caterpillar Inc., CNH Industrial N.V., Doosan Infracore Co., Ltd. and its subsidiary Doosan Bobcat Inc., Fayat Group, GOMACO Corporation, Hitachi Construction Machinery, Komatsu Ltd., Kubota Tractor Corporation, Ponsse Plc, SANY Group Co., Ltd., Terex, Tigercat Industries Inc., Volvo Construction Equipment (part of Volvo Group AB), and XCMG.\nManufacturing and Assembly\nCommon manufacturing processes and techniques are used in producing components for PPA, SAT, and CF equipment sold by us and our dealers. The equipment operations also pursue external sales of selected parts that can be manufactured and supplied to third parties on a competitive basis, including engines, power train components, and electronic components.\nConsiderable effort is being directed to manufacturing cost reductions through improvements in process, optimization of factories, including product line relocation, product design, advanced manufacturing technology, and supply management and logistics, as well as compensation incentives related to productivity and organizational structure. Our flexible assembly lines, which can accommodate a wide product mix and deliver products in line with changes in dealer and customer demand, support our process improvements.\nResearch and Development; Patents, Trademarks, Copyrights, and Trade Secrets\nWe make substantial investments in research and development to improve the quality and performance of our products, to develop new products and technologies to meet our customers’ needs, to integrate sustainable solutions into our products, and to comply with government, safety, and engine emissions regulations.\nOur research and development activities are a vital component in our Smart Industrial Operating Model as customers seek to improve profitability, productivity, and sustainability through technology. Integration of technology into equipment is a persistent market trend, and we continue to capitalize on this market trend.\nWe own a significant number of patents, trademarks, copyrights, trade secrets, and intellectual property licenses related to our products and services and expect the number to grow as we continue to pursue technological innovations. We further our competitive position by filing patent and trademark applications in the U.S. and internationally to protect technology, improvements considered important to the business, and our brand. We believe that, taken together, our rights under these patents and licenses are important to our operations and competitive position but do not regard any of our businesses as being dependent upon any single patent or family of patents.\nSee “Risk Factors - Our business could be adversely affected by the infringement or loss of intellectual property rights” for more information.\nSales and Distribution\nThrough the U.S. and Canada, we market products to approximately 2,050 independent dealer locations. Of these, approximately 1,600 sell agricultural equipment, while approximately 450 sell construction, earthmoving, material handling, roadbuilding, compact construction, and/or forestry equipment. In addition, roadbuilding equipment is sold at approximately 100 roadbuilding-only locations that may carry products that compete with our construction, earthmoving, material handling, and/or forestry equipment. Turf equipment is sold at most John Deere agricultural equipment locations, a few construction, earthmoving, material handling, roadbuilding, and/or forestry equipment locations, and about 280 turf-only locations. In addition, certain lawn and garden and compact construction products are sold through The Home Depot and Lowe’s.\nOutside the U.S. and Canada, our agriculture and turf equipment is sold to distributors and dealers for resale in over 100 countries. Sales and administrative offices are located in Argentina, Australia, Brazil, China, France, Germany, India, Italy, Mexico, Poland, Singapore, Sweden, South Africa, Spain, Ukraine, and the United Kingdom. Turf equipment sales outside the U.S. and Canada occur primarily in Western Europe and Australia. Construction, earthmoving, material handling, and forestry equipment is sold to distributors and dealers primarily by sales offices located in Australia, Brazil, Finland, New Zealand, Singapore, and the United Kingdom. Some of these dealers are independently owned while we own others. Roadbuilding equipment is sold directly to retail customers and independent distributors and dealers for resale. The Wirtgen Group operates company-owned sales and service subsidiaries in Australia, Austria, Belgium, Bulgaria, China, Denmark, Estonia, Finland, France, Georgia, Germany, Hungary, India, Ireland, Italy, Japan, Latvia, Lithuania, Malaysia, the Netherlands, Norway, Poland, Romania, South Africa, Sweden, Taiwan, Thailand, Turkey, Ukraine, and the United Kingdom. The equipment operations operate centralized parts distribution warehouses in the U.S., Brazil, and Germany in coordination with regional parts depots and distribution centers in Argentina, Australia, China, India, Mexico, South Africa, Sweden, and the United Kingdom.\nWe market engines, power trains, and electronic components worldwide through select sales branches or directly to regional\nand global original equipment manufacturers and independently owned engine distributors.\n\nWe source raw materials, manufactured components, and replacement parts for our equipment, engines, and other products from leading suppliers both domestically and internationally. These materials and components include a variety of steel products, metal castings, forgings, plastics, hydraulics, electronics, and ready-to-assemble components made to certain specifications. We also source various goods and services used for production, logistics, offices, and research and development. We develop and maintain sourcing strategies for our purchased materials and emphasize long-term supplier relationships at the core of these strategies. We use a variety of agreements with suppliers intended to drive innovation, ensure availability and delivery of raw materials and components, manage costs on a globally",
  "item7_clean": null,
  "item2_clean": null
}