{
  "source_file": "de-20250727x10q.htm",
  "form_type": "10-Q",
  "item1_clean": null,
  "item7_clean": null,
  "item2_clean": "FORWARD-LOOKING STATEMENTS\nCertain statements contained herein, including in the section entitled “Overview,” “Trends and Economic Conditions,” and “Condensed Notes to Interim Consolidated Financial Statements” relating to future events, expectations, and trends constitute “forward-looking statements” as defined in the Private Securities Litigation Reform Act of 1995 and involve factors that are subject to change, assumptions, risks, and uncertainties that could cause actual results to differ materially. Some of these risks and uncertainties could affect all lines of our operations generally while others could more heavily affect a particular line of business.\nForward-looking statements are based on currently available information and current assumptions, expectations, and projections about future events and should not be relied upon. Except as required by law, we expressly disclaim any obligation to update or revise our forward-looking statements. Many factors, risks, and uncertainties could cause actual results to differ materially from these forward-looking statements. Among these factors are risks related to:\ngovernment policies and actions with respect to the global trade environment including increased and proposed tariffs announced by the U.S. government and retaliatory trade regulations;\nthe uncertainty of our ability to sell products domestically or internationally, continue production at certain international facilities, procure raw materials and components, accurately forecast demand and inventory, manage increased costs of production, absorb or pass on increased pricing, accurately predict financial results and industry trends, and remain competitive based on trade actions, policies, and general economic uncertainty;\nthe agricultural business cycle, which can be unpredictable and is affected by factors such as world grain stocks, harvest yields, available farm acres, acreage planted, soil conditions, prices for commodities and livestock, input costs, availability of transport for crops as well as adverse macroeconomic conditions, including unemployment, inflation, interest rate volatility, changes in consumer practices due to slower economic growth or a recession, and regional or global liquidity constraints;\nhigher interest rates and currency fluctuations which could adversely affect the U.S. dollar, customer confidence, access to capital, and demand for our products and solutions;\nour ability to adapt in highly competitive markets, including understanding and meeting customers’ changing expectations for products and solutions, including delivery and utilization of precision technology;\nhousing starts and supply, real estate and housing prices, levels of public and non-residential construction, and infrastructure investment;\n\nOther items that could impact our results are:\nglobal and regional political conditions, including the ongoing war between Russia and Ukraine and the conflicts in the Middle East\nshifts in energy, economic, tax and trade policies, and positions on government subsidies of farming\ncapital market disruptions\nforeign currency and capital control policies\nright to repair regulations and legislation\nmarketplace adoption and monetization of technologies we have invested in\nour ability to strengthen our digital capabilities, automation, autonomy, and alternative power technologies\nchanges in demand and pricing for new and used equipment\ndelays or disruptions in our supply chain\nsignificant fluctuations in foreign currency exchange rates\nvolatility in the prices of many commodities\nslower economic growth\nConsolidated Results – 2025 Compared with 2024\n(In millions of dollars, except per share amounts)\nNet sales and revenues\nNet income attributable to Deere & Company\nDiluted earnings per share\nNet sales and revenues decreased for both the quarter and year-to-date periods primarily due to lower sales volumes. Net income and diluted EPS decreased in the third quarter primarily due to lower sales volumes, higher tariffs, and unfavorable price realization. Results for the first nine months were also affected by lower production costs, driven by reduced material costs, and favorable discrete tax items (see Note 21). The discussion of net sales and operating profit is included in the Business Segment Results below.\nAn explanation of the cost of sales to net sales ratio and other significant statements of consolidated income changes follows:\nCost of sales to net sales\nIncreased due to higher tariffs and higher overhead costs from production inefficiencies associated with lower volumes, partially offset by reduced material costs and lower employee profit-sharing incentives.\nLower for both periods primarily due to a decrease in revenues from certain licenses and credit enhancement recoveries in the prior period. Additionally, the first nine months were impacted by reduced investment income.\nResearch and development expenses\nLargely unchanged due to continued focus on developing and incorporating technology solutions.\nSelling, administrative and general expenses\nDecreased for both periods due to lower employee profit-sharing incentives and the favorable impact from Banco John Deere S.A. (BJD) deconsolidation (see Note 21). Additionally, the quarter had lower provision for credit losses.\nDecreased for both periods primarily due to lower average borrowings and lower average borrowing rates.\nOther operating expenses\nIncreased for the three months ended due to higher depreciation of equipment on operating leases. Decreased for the first nine months due to lower foreign currency exchange losses and higher pension benefits (see Note 6).\nProvision for income taxes\nDecreased for both periods as a result of lower pretax income. Additionally, the nine months ended was impacted by the favorable impact of discrete tax adjustments (see Note 21).\n\nIn the first nine months of 2025, the financial services operations issued $2,618 and retired $3,441 of retail note securitization borrowings, which are presented in “Net proceeds (payments) in short-term borrowings (original maturities three months or less).”\nWe have access to bank lines of credit with various banks throughout the world.\nWorldwide lines of credit totaled $12.2 billion at July 27, 2025, consisting primarily of:\na 364-day credit facility agreement of $5.0 billion expiring in the second quarter of 2026\na credit facility agreement of $3.25 billion expiring in the second quarter of 2028\na credit facility agreement of $3.25 billion expiring in the second quarter of 2030\nAt July 27, 2025, $6,150 of these worldwide lines of credit were unused. For the purpose of computing unused credit lines, commercial paper and short-term bank borrowings were considered to constitute utilization. These credit agreements require Capital Corporation and other parts of our business to maintain certain performance metrics and liquidity targets. All requirements in the credit agreements have been met during the periods included in the financial statements.\nTo access public debt capital markets, we rely on credit rating agencies to assign short-term and long-term credit ratings to our debt securities as an indicator of credit quality for fixed income investors. A security rating is not a recommendation by the rating agency to buy, sell, or hold our securities. A credit rating agency may change or withdraw ratings based on its assessment of our current and future ability to meet interest and principal repayment obligations. Each agency’s rating should be evaluated independently of any other rating. Lower credit ratings generally result in higher borrowing costs, including costs of derivative transactions, reduced access to debt capital markets, and may adversely impact our liquidity. The senior long-term and short-term debt ratings and outlook currently assigned to unsecured company securities by the rating agencies engaged by us are as follows:\n\nSmall Agriculture and Turf\nCurrency translation impact on Net sales\nSmall agriculture and turf sales decreased for the quarter as a result of lower shipment volumes (primarily in the U.S., offset by Europe and India) driven mainly by economic uncertainties and higher interest rates, partially offset by favorable currency translation and price realization in the U.S. and Canada. Operating profit decreased due to higher tariffs, partially offset by favorable factors including reductions in warranty expenses and lower production costs from lower material costs.\nSmall Agriculture & Turf Operating Profit\nThird Quarter 2025 Compared to Third Quarter 2024\nSales for the first nine months decreased as a result of lower shipment volumes (primarily in the U.S.) driven mainly by economic uncertainties and higher interest rates. Operating profit for the first nine months decreased primarily as a result of lower shipment volumes / sales mix, partially offset by decreased production costs driven by lower material costs and price realization.\nSmall Agriculture & Turf Operating Profit\nFirst Nine Months 2025 Compared to First Nine Months 2024\n\nCustomers seek to improve profitability, productivity, and sustainability through integrating technology into their operations. Deeper integration of technology into equipment is a persistent market trend. These technologies are incorporated into products within each of our operating segments. We expect this trend to persist for the foreseeable future. Our Smart Industrial Operating Model and Leap Ambitions are intended to capitalize on this market trend. Engaged acres are an indicator we use to understand customer utilization of our technology. We remain focused on a Solutions as a Service business model to increase technology adoption and utilization by our customers. Solutions as a Service products did not represent a significant percentage of our revenues in the periods presented.\nCompany Outlook for 2025\nAgriculture and turf and construction equipment sales volumes for fiscal 2025 are expected to be lower tha"
}