{
  "source_file": "dell-20250131.htm",
  "form_type": "10-K",
  "item1_clean": "for both Fiscal 2024 and Fiscal 2023. These investments reflect our commitment to innovation that aim to create the right solutions to help our customers build their digital future and transform their businesses.\nStrategic Investments and Acquisitions\nAs part of our strategy, we will continue to evaluate opportunities for strategic investments through our venture capital investment arm, Dell Technologies Capital, with a focus on emerging technology areas that are relevant to our business and that will complement our existing portfolio of solutions. We target investments in areas such as storage, software-defined networking, management and orchestration, security, machine learning and AI, Big Data and analytics, cloud, edge computing, and software development operations. The technologies or products these companies have under development are typically in the early stages and may never have commercial value, which could result in a loss of a substantial part of our investment in the companies.\nWe held strategic investments in non-marketable securities of $1.5 billion and $1.3 billion as of January 31, 2025 and February 2, 2024, respectively. See Note 4 of the Notes to the Consolidated Financial Statements included in this report for additional information.\nIn addition to these investments, we may also make disciplined acquisitions of businesses that advance our strategic objectives and accelerate our innovation agenda.\nManufacturing and Materials\nWe own manufacturing facilities located in the United States, Malaysia, China, Brazil, India, Poland, and Ireland. See “Item 2 — Properties” for information about our manufacturing and distribution facilities.\nWe also utilize contract manufacturers throughout the world to manufacture or assemble our products under the Dell Technologies brand to provide operational flexibility, achieve cost efficiencies, deliver products faster, better serve our customers, and enhance our supply chain. When using contract manufacturers, we purchase components from suppliers and subsequently sell those components to the manufacturer. Our manufacturing process consists of assembly, software installation, functional testing, and quality control. We conduct operations utilizing a formal, documented quality management system to ensure that our products and services satisfy customer needs and expectations. Testing and quality control are also applied to components, parts, sub-assemblies, and systems obtained from third-party suppliers.\nOur quality management system is maintained through the testing of components, sub-assemblies, software, and systems at various stages in the manufacturing process. Quality control procedures also include a burn-in period for completed units after assembly, ongoing production reliability audits, failure tracking for early identification of production and component problems, and processing of information from customers obtained through services and support programs. This system is certified to the ISO 9001 International Standard that includes our global sites and organizations that design, manufacture, and service our products.\nOur order fulfillment, manufacturing, and test facilities are also certified to the ISO 9001 International Standard for quality management systems, the ISO 14001 International Standard for environmental management systems, the ISO 45001 International Standard for health and safety management systems, and the ISO 50001 International Standard for energy management systems. These internationally-recognized endorsements of ongoing quality, environmental, health and safety, and energy management are among the highest levels of certifications available. We also have implemented programs and methodologies to ensure that the quality of our designs, manufacturing, test processes, and supplier relationships are continually improved.\nWe maintain a Supplier Code of Conduct, actively manage recycling processes for our returned products, and are certified by the Environmental Protection Agency as a Smartway Transport Partner.\nWe purchase materials, supplies, product components, and products from a large number of qualified suppliers. In some cases, where multiple sources of supply are not available, we rely on a single source or a limited number of sources of supply if we believe it is advantageous to do so because of performance, quality, support, delivery, capacity, or price considerations. We believe that any disruption that may occur because of our dependence on single- or limited-source vendors would not disproportionately disadvantage us relative to our competitors. See “Item 1A — Risk Factors — Risks Relating to Our Business and Our Industry — Our use of single-source or limited-source suppliers may adversely affect the availability or timely delivery of some critical products or components.” for information about the risks associated with Dell Technologies’ use of single- or limited-source suppliers.\nProduct backlog represents the value of unfulfilled manufacturing orders and is included as a component of remaining performance obligations to the extent we determine that the manufacturing orders are non-cancelable. Our business model generally gives us the flexibility to optimize product backlog including by expediting shipping or prioritizing customer orders for products that have shorter lead times. During Fiscal 2024, while our supply chain operated efficiently at standard lead times, demand for AI-optimized servers outpaced the supply of graphics processing units (“GPUs”), resulting in elevated backlog levels for such offerings as we exited the fiscal year. During Fiscal 2025, backlog levels for our AI-optimized servers remained elevated as we exited the fiscal year due to continued strong demand for these offerings.\nGeographic Operations\nOur corporate headquarters is located in Round Rock, Texas. We have operations and conduct business in many countries located in the Americas, Europe, the Middle East, Asia, and other geographic regions. We continue to view emerging markets outside of the United States, Western Europe, Canada, and Japan, which include the vast majority of the world’s population, as a long-term growth opportunity. Accordingly, we pursue the development of technology solutions that meet the needs of these markets. For information about the amount of net revenue we generated from our operations outside of the United States during the last three fiscal years, see Note 18 of the Notes to the Consolidated Financial Statements included in this report.\nOur sales can be affected by seasonal trends. Within ISG, our storage sales are typically stronger in our fourth fiscal quarter. Our sales within the Americas are typically stronger in the second and fourth fiscal quarters, while our sales in EMEA are typically stronger during the fourth fiscal quarter. Historical seasonal patterns have been impacted by the changing macroeconomic environment and our mix of business, and may not continue in the future.\nWe operate in an industry in which there are rapid technological advances in hardware, software, and services offerings, including AI, cloud, and security-related offerings. We face ongoing product and price competition in all areas of our business from both branded and generic competitors, including companies that specialize in one or more of our product or service lines. We compete based on our ability to offer customers competitive, scalable, and integrated solutions that provide the most current and desired product and services features at a competitive price. We closely monitor market pricing, including the effect of foreign exchange rate movements, in an effort to provide the best value for our customers. We also closely monitor changing demand to keep pace with the demands of current and prospective customers. We believe that our strong relationships with our customers and channel partners allow us to respond quickly to changing customer needs and other macroeconomic factors.\nWe also face competition from non-traditional IT companies, including large Infrastructure-as-a-Service providers, that often buy their infrastructure directly from original design manufacturers. Competitive pressures could increase if customers choose to move existing workloads to these Infrastructure-as-a-Service providers.\nThe markets in which we compete span countries around the world with customers that range from the world’s largest corporations to small and medium-sized businesses to consumers and also include government and not-for-profit organizations. We believe that new businesses will continue to enter these markets and develop technologies that, if successfully commercialized, may compete with our products and services. Moreover, current competitors may enter into new strategic relationships with new or existing competitors, which may further increase competitive pressures. See “Item 1A — Risk Factors — Risks Relating to Our Business and Our Industry” for information about our competitive risks.\nOur sales and marketing efforts are organized around our customers. Our global sales and marketing team has created a go-to-market model that is collaborative and customer-focused. We generally organize our go-to-market operations with a focus on geographic and customer segments which encompass large g\nlobal and national enterprises, governmental agencies and other public institutions, educational institutions, healthc\nare organizations, small and medium-sized businesses, and consumers.\nGo-to-market strategy\n— We sell products and services directly to customers and through other sales channels, which include value-added resellers, system integrators, distributors, and retailers. We manage our direct sales team and channel partners to offer a unified customer experience.\nWe believe our direct sales channel is a significant competitive advantage and emphasizes direct communication with customers, allowing us to refine our products and marketing programs while providing insight to better navigate through supply chain challenges and complexity.\nIn addition to our direct sales channel, we use our network of channel partners to sell our products and services, enabling us to efficiently reach and serve a greater number of customers. The Dell Technologies partner program provides partners with appropriate incentives to encourage sales generation. We also facilitate access to third-party financing to help our channel partners manage their working capital. We believe that building long-term relationships with our channel partners enhances our ability to deliver a high-quality customer experience. During Fiscal 2025, our other sales channels generated approximately 50% of our net revenue.\nLarge enterprises and public institutions\n— We maintain a field sales force across the world to serve our largest customers, including large enterprises and public institutions. Dedicated account teams, which include technical sales specialists, form long-term relationships with and support our largest customers, develop tailored solutions to meet their needs, position the capabilities of Dell Technologies, and provide us with customer feedback. For these customers, we offer several programs designed to provide single points of contact and accountability with dedicated account managers, special pricing, and consistent service and support programs. We also maintain specific sales and marketing programs customized to the needs of each specific segment we serve.\nSmall and medium-sized business and consumers\n— We have a direct sales force of dedicated account teams for small and medium-sized businesses focused on delivering outcomes tailored to customers’ specific needs. For consumers, we offer robust online and channel engagement. We market our products and services to customers in these segments through various campaigns and advertising media, aligning with customer preferences. To react quickly to our customers’ needs, we track our Net Promot",
  "item7_clean": "ITEM 7\nMANAGEMENT’S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS\nIn addition to historical financial information, the following discussion contains forward-looking statements that reflect our plans, estimates, and beliefs, and that are subject to numerous risks and uncertainties. Our actual results may differ materially from those expressed or implied in any forward-looking statements.\nUnless otherwise indicated, all results presented are prepared in a manner that complies, in all material respects, with generally accepted accounting principles in the United States of America (“GAAP”). Unless otherwise indicated, all changes identified for the current-period results represent comparisons to results for the prior corresponding fiscal period.\nUnless the context indicates otherwise, references in this report to “we,” “us,” “our,” the “Company,” and “Dell Technologies” mean Dell Technologies Inc. and its consolidated subsidiaries, references to “Dell” mean Dell Inc. and Dell Inc.’s consolidated subsidiaries, and references to “EMC” mean EMC Corporation and EMC Corporation’s consolidated subsidiaries.\nOur fiscal year is the 52- or 53-week period ending on the Friday nearest January 31. We refer to our fiscal years ended January 31, 2025, February 2, 2024, and February 3, 2023 as “Fiscal 2025,” “Fiscal 2024,” and “Fiscal 2023,” respectively. Both Fiscal 2025 and Fiscal 2024 included 52 weeks, while Fiscal 2023 included 53 weeks.\nINTRODUCTION\nDell Technologies is a leader in the global technology industry focused on providing broad and innovative technology solutions for the data and artificial intelligence (“AI”) era. We build and offer solutions ranging from client devices and peripherals to infrastructure solutions across servers, networking, and storage to meet the evolving needs of our customers and drive better business outcomes. With our extensive portfolio and our commitment to innovation, we offer secure, integrated solutions that extend from the edge to the core to the cloud, and we are at the forefront of AI, software-defined, and cloud native infrastructure solutions. Our vision is to become the most essential technology partner. We intend to realize our vision by executing our strategy of leveraging our strengths to extend our leadership positions and capture new growth.\nWe are organized into two business units which are also our reportable segments: Infrastructure Solutions Group and Client Solutions Group.\nInfrastructure Solutions Group (“ISG”)\n— ISG includes our servers and networking offerings and our storage offerings. Our server portfolio includes high-performance general-purpose and AI-optimized servers. Our networking portfolio includes wide area network infrastructure, data center and edge networking switches, and cables and optics. Our comprehensive storage portfolio includes modern and traditional storage solutions, including all-flash arrays, scale-out file, object platforms, hyper-converged infrastructure, and software-defined storage. ISG also offers software, peripherals, and services, including consulting and support and deployment.\nClient Solutions Group (“CSG”)\n— CSG includes offerings designed for commercial and consumer customers. Our CSG portfolio includes branded PCs, including notebooks, desktops, and workstations, branded peripherals, and third-party software and peripherals. CSG also includes services offerings, such as configuration, support and deployment, and extended warranties.\nOur other businesses primarily consist of our resale of standalone offerings of VMware LLC (formerly VMware, Inc. and individually and together with its subsidiaries, “VMware”), referred to as “VMware Resale,” and offerings of SecureWorks Corp. (“Secureworks”). These businesses are divested businesses or their offerings are no longer actively sold, and are not classified as reportable segments, either individually or collectively. Their operating results are reported within Corporate and other. On October 21, 2024, Secureworks announced that it had entered into a definitive agreement providing for its sale to Sophos Inc., an affiliate of Thoma Bravo, L.P., a private equity and growth capital firm. The transaction was completed on February 3, 2025, subsequent to the close of the Company’s fiscal year ended January 31, 2025, in an all-cash transaction for a purchase price of approximately $0.9 billion.\nFor further discussion regarding our current reportable segments, see “Results of Operations — Business Unit Results” and Note 18 of the Notes to the Consolidated Financial Statements included in this report.\nWe offer customers choice in how they acquire our solutions, including traditional purchasing and offerings under the Dell Payment Solutions portfolio. These offerings provide both payment and consumption solutions, including as-a-Service, subscription, utility, leases, and loans, which allow our customers to pay over time and provide them with operational and financial flexibility. Dell Financial Services and its affiliates (“DFS”) support financing solutions and services as part of the portfolio. For additional information about our financing arrangements, see Note 5 of the Notes to the Consolidated Financial Statements included in this report.\nBusiness Trends and Challenges\nFiscal 2025 Significant Developments\n— During Fiscal 2025, we executed our strategy with strong operating results, generating net revenue and operating income growth. The following trends and conditions affected the environment in which we operated:\nMacroeconomic environment:\nThe demand environment was strong for our servers and networking offerings, which contributed to overall net revenue growth. Additionally, we saw modest demand improvement in our commercial offerings within CSG. Given the demand dynamics for the year, we experienced a shift in the mix of the business towards our ISG offerings.\nDemand for AI-optimized solutions:\nOur ISG business continued to benefit from increased demand for AI-optimized solutions as customers continue to adopt and further integrate AI into their operations. As a result of the continued strong demand for our AI-optimized servers, backlog levels for such offerings remained elevated as we exited the fiscal year.\nNotwithstanding the increased demand for AI-optimized solutions, our supply chain continued to operate efficiently. We experienced a modest increase in input costs, primarily driven by both component and logistics costs.\nBroadcom’s acquisition of VMware:\nOn November 22, 2023, Broadcom Inc. (“Broadcom”) completed its acquisition of VMware, leading to changes to our relationship with VMware as described below.\nWe expect demand growth across our servers and networking offerings and, to a lesser extent, our storage offerings, which we expect will result in ISG net revenue growth in Fiscal 2026. We expect modest CSG net revenue growth for the full fiscal year, driven in part by the anticipated PC refresh cycle in the latter part of Fiscal 2026. Additionally, we expect a continued reduction of our Corporate and other net revenue as we no longer act as a distributor of VMware’s standalone products and services.\nWe expect a modest decline in input costs during the first half of Fiscal 2026. Input cost trends are dependent on the strength or weakness of actual end-user demand and supply dynamics, which will continue to fluctuate and ultimately impact our costs, pricing, and operating results.\nWe remain focused on executing our key strategic priorities, building long-term value creation for our stakeholders, and addressing our customers’ needs while continuing to make prudent decisions in response to the environment. We expect margin rate pressure resulting from a continuing shift in mix towards our AI-optimized servers and a competitive environment. We look to balance profitability and growth while maintaining disciplined pricing as we navigate through competitive pricing pressures.\nWe continue to advance our own capabilities to change the way we work and make decisions, improve business outcomes and the customer experience, and reduce costs by leveraging new technology and optimizing business processes. We remain committed to disciplined cost management in coordination with our ongoing business modernization initiatives and expect continued reductions in operating expenses as we take certain measures to reduce costs, including limitation of external hiring, employee reorganizations, and other actions to align our investments with our strategic priorities and customer needs. We anticipate these actions will result in additional reductions in our overall headcount. We believe our unique operating advantages provide a foundation to foster growth, drive efficiencies, and continue to position us for long-term success.\nRelationship with VMware\n\n— During Fiscal 2024, services net revenue increased 4%, driven primarily by growth within services net revenue attributable to CSG and Corporate and other. The increase in services net revenue attributable to CSG was driven primarily by third-party software support and maintenance and hardware support and maintenance. The increase in services net revenue attributable to Corporate and other was driven primarily by VMware software maintenance arrangements. See “Introduction” for additional information about the impact of Broadcom’s acquisition of VMware on our relationship with VMware.\nFrom a geographical perspective, net revenue decreased in the Americas, EMEA, and APJ during Fiscal 2024, most notably within APJ.\nFiscal 2025 compared to Fiscal 2024\nDuring Fiscal 2025, both gross margin and non-GAAP gross margin increased 1%, to $21.3 billion and $21.8 billion, respectively, driven by an increase in ISG gross margin that was largely offset by a decrease in CSG gross margin. The increase in ISG gross margin was primarily attributable to growth in our AI-optimized server offerings and, to a lesser extent, our storage offerings. The decrease in CSG gross margin was primarily attributable to a competitive pricing environment.\nDuring Fiscal 2025, gross margin and non-GAAP gross margin percentage decreased 160 basis points to 22.2% and 170 basis points to 22.8%, respectively. The decreases in gross margin percentage and non-GAAP gross margin percentage were primarily driven by a shift in mix towards AI-optimized server offerings and a competitive CSG pricing environment.\nProduct Gross Margin\n— During Fiscal 2025, product gross margin and non-GAAP product gross margin remained flat at $11.3 billion and decreased 1% to $11.6 billion, respectively, as the decrease in CSG product gross margin was largely offset by an increase in ISG product gross margin. The decline in CSG product gross margin was primarily attributable to a competitive pricing environment. The increase in ISG product gross margin was primarily due to growth in our AI-optimized server offerings and, to a lesser extent, our storage offerings.\nDuring Fiscal 2025, product gross margin percentage and non-GAAP product gross margin percentage decreased 170 basis points to 15.8% and 190 basis points to 16.2%, respectively. The declines were primarily attributable to a shift in mix towards our AI-optimized server offerings and a competitive CSG pricing environment.\nServices Gross Margin\n— During Fiscal 2025, both services gross margin and non-GAAP services gross margin increased 2%, to $10.0 billion and $10.2 billion, respectively. Services gross margin and non-GAAP services gross margin benefited from an increase in support and maintenance associated with products sold in prior periods within both ISG and CSG and, to a lesser extent, an increase in CSG third-party software support and maintenance.\nDuring Fiscal 2025, services gross margin percentage and non-GAAP services gross margin percentage increased 60 basis points to 41.4% and 80 basis points to 42.4%, respectively. The increases in services gross margin percentage and non-GAAP services gross margin percentage were primarily driven by a shift in mix as we no longer act as a distributor of standalone VMware offerings.\nFiscal 2024 compared to Fiscal 2023\nDuring Fiscal 2024, gross margin and non-GAAP gross margin decreased 7% to $21.1 billion and 8% to $21.6 billion, respectively. The declines were driven by decreases in both ISG and CSG gross margin that were primarily attributable to a decrease in net revenue, the effect of which was partially offset by lower input costs.\nBoth gross margin and non-GAAP gross margin percentage increased 160 basis points, to 23.8% and 24.5%, respectively, during Fiscal 2024. The increases were primarily attributable to the impacts of an overall decline in input costs coupled with an increase in average selling prices across many of our offerings as we continued to exercise disciplined pricing in an increasingly competitive environment.\nProduct Gross Margin\n— During Fiscal 2024, product gross margin and non-GAAP product gross margin both decreased 15%, to $11.2 billion and $11.6 billion, respectively. The decreases were primarily driven by declines in both ISG and CSG product gross margin, which were largely attributable to declines in product net revenue, partially offset by lower input costs.\nDuring Fiscal 2024, product gross margin percentage and non-GAAP product gross margin percentage both increased 80 basis points, to 17.5% and 18.1%, respectively, primarily due to an increase in CSG product gross margin percentage. CSG product gross margin percentage increased primarily as a result of the impacts of an overall decline in input costs coupled with an increase in average selling prices across many of our product offerings.\nServices Gross Margin\n— During Fiscal 2024, services gross margin and non-GAAP services gross margin increased 4% to $9.8 billion and 3% to $10.0 billion, respectively. The increases were primarily attributable to growth within ISG services gross margin and, to a lesser extent, CSG services gross margin that were driven by support and maintenance associated with products sold in prior periods.\nDuring Fiscal 2024, services gross margin percentage decreased 30 basis points to 40.8% and non-GAAP services gross margin percentage decreased 50 basis points to 41.6%. The decreases were driven primarily by a shift in mix of services delivered.\nOur gross margin is affected by our ability to achieve competitive pricing with our vendors and contract manufacturers, including through our negotiation of a variety of vendor rebate programs to achieve lower net costs for the various components we include in our products. Under these programs, vendors provide us with rebates or other discounts from the list prices for the components, which are generally elements of their pricing strategy. We account for vendor rebates and other discounts as a reduction in cost of net revenue. We manage our costs on a total net cost basis, which includes supplier list prices reduced by vendor rebates and other discounts.\nThe terms and conditions of our vendor rebate programs are largely based on product volumes and are generally negotiated either at the beginning of the annual or quarterly period, depending on the program. The timing and amount of vendor rebates and other discounts we receive under the programs may vary from period to period, reflecting changes in the competitive environment. We monitor our component costs and seek to address the effects of any changes to terms that might arise under our vendor rebate programs. Our gross margins for Fiscal 2025 and Fiscal 2024 were not materially affected by any changes to the terms of our vendor rebate programs, as the amounts we received under these programs were generally stable relative to our total net cost. We are not aware of any significant changes to our vendor rebate programs that will materially impact our results in the near term.\nThe following table presents information regarding our operating expenses for the periods indicate",
  "item2_clean": null
}