{
  "source_file": "dell-20250801.htm",
  "form_type": "10-Q",
  "item1_clean": null,
  "item7_clean": null,
  "item2_clean": "— As part of our strategy, we will continue to evaluate opportunities for strategic investments through our venture capital investment arm, Dell Technologies Capital, with a focus on emerging technology areas that are relevant to our business and that will complement our existing portfolio of solutions. The technologies or products these companies have under development are typically in the early stages and may never have commercial value, which could result in a loss of a substantial part of our investment in the companies. In addition to these investments, we may also make targeted acquisitions of businesses that advance our strategic objectives and accelerate our innovation agenda.\nForeign Currency Exposure\n— We manage our business on a U.S. Dollar basis. However, we have a large global presence, generating approximately 40% and 45% of our net revenue from sales to customers outside of the United States during the second quarter and first six months of Fiscal 2026, respectively, and 50% during both the second quarter and first six months of Fiscal 2025. As a result, our operating results can be, and particularly in recent periods have been, impacted by fluctuations in foreign currency exchange rates. We utilize a comprehensive hedging strategy intended to mitigate the impact of foreign currency volatility over time, and we adjust pricing when possible to further minimize foreign currency impacts.\nOther Macroeconomic Risks and Uncertainties\n— During the first six months of Fiscal 2026, a number of countries, including the United States, imposed or proposed tariffs on imports, and may continue to do so. The impacts of trade protection measures, including increases or changes in tariffs and trade barriers, changes in government policies and international trade arrangements, geopolitical volatility, and global macroeconomic conditions, or uncertainty regarding the impact of proposed or future trade protection measures, may affect our results of operations in some markets. We continue to leverage the agility and scale of our world-class supply chain to mitigate impacts of tariffs and will continue to respond to changing market conditions as needed.\nNON-GAAP FINANCIAL MEASURES\nIn this management’s discussion and analysis, we use supplemental measures of our performance which are derived from our consolidated financial information but which are not presented in our consolidated financial statements prepared in accordance with GAAP. These non-GAAP financial measures include non-GAAP product gross margin; non-GAAP services gross margin; non-GAAP gross margin; non-GAAP operating expenses; non-GAAP operating income; non-GAAP net income; non-GAAP earnings per share attributable to Dell Technologies Inc. - diluted; free cash flow; and adjusted free cash flow. These non-GAAP financial measures are not meant to be considered as indicators of performance or liquidity in isolation from or as a substitute for gross margin, operating expenses, operating income, net income, diluted earnings per share, or cash flows from operating activities prepared in accordance with GAAP, and should be read only in conjunction with financial information presented on a GAAP basis.\nWe use non-GAAP financial measures to supplement financial information presented on a GAAP basis. Management uses these non-GAAP measures in financial planning and forecasting and when evaluating our financial results and operating trends and performance. We believe, when used supplementally with GAAP financial measures, these non-GAAP financial measures provide our investors with useful and transparent information to help them evaluate our results by facilitating an enhanced understanding of our results of operations and enabling them to make period to period comparisons. There are limitations to the use of the non-GAAP financial measures presented in this report. Our non-GAAP financial measures may not be comparable to similarly titled measures of other companies. Other companies, including companies in our industry, may calculate non-GAAP financial measures differently than we do, limiting the usefulness of those measures for comparative purposes.\nNon-GAAP product gross margin, non-GAAP services gross margin, non-GAAP gross margin, non-GAAP operating expenses, non-GAAP operating income, non-GAAP net income, and non-GAAP earnings per share attributable to Dell Technologies Inc. - diluted, as defined by us, exclude amortization of intangible assets, stock-based compensation expense, other corporate expenses and, for non-GAAP net income and non-GAAP earnings per share attributable to Dell Technologies Inc. - diluted, fair value adjustments on equity investments and an aggregate adjustment for income taxes. As the excluded items may have a material impact on our financial results, our management compensates for this limitation by relying primarily on our GAAP results and using non-GAAP financial measures supplementally or for projections when comparable GAAP financial measures are not available.\nReconciliations of each non-GAAP financial measure to its most directly comparable GAAP financial measure are presented below. We encourage you to review the reconciliations in conjunction with the presentation of the non-GAAP financial measures for each of the periods presented. The discussion below includes information on each of the excluded items as well as our reasons for excluding them from our non-GAAP results. In future fiscal periods, we may exclude such items and may incur income and expenses similar to these excluded items. Accordingly, the exclusion of these items and other similar items in our non-GAAP presentation should not be interpreted as implying that these items are non-recurring, infrequent, or unusual.\nThe following is a summary of the items excluded from the most comparable GAAP financial measures to calculate our non-GAAP financial measures.\nAmortization of Intangible Assets\n\nDuring the second quarter and first six months of Fiscal 2026, CSG operating income as a percentage of net revenue decreased 20 basis points to 6.4% and 70 basis points to 5.8%, respectively. The decline in operating income rate during the second quarter of Fiscal 2026 was primarily attributable to an increase in operating expense as a percentage of net revenue driven by an increase in R&D expenses. The decline in operating income rate during the first six months of Fiscal 2026 was primarily due to a decline in gross margin rate driven by a competitive pricing environment and change in mix within our offerings.\nOTHER BALANCE SHEET ITEMS\nWe sell products and services directly to customers and through a variety of sales channels, including retail distribution. Our accounts receivable, net was $15.0 billion and $10.3 billion as of August 1, 2025 and January 31, 2025, respectively. The increase in accounts receivable, net was primarily driven by an increase in net revenue largely attributable to our AI-optimized offerings. We maintain an allowance for expected credit losses to cover receivables that may be deemed uncollectible. The allowance for expected credit losses is an estimate based on an analysis of historical loss experience, current receivables aging, and management’s assessment of current conditions and its reasonable and supportable expectation of future conditions, as well as specific identifiable customer accounts that are deemed at risk. As of August 1, 2025 and January 31, 2025, the allowance for expected credit losses was $83 million and $63 million, respectively. Based on our assessment, we believe that we are adequately reserved for expected credit losses.\nDell Financial Services and Financing Receivables\nWe offer or arrange a portfolio of payment and consumption solutions and services for our customers globally, including as-a-Service, subscription, utility, leases, and loans designed to match customers' consumption and financing preferences. We believe these options provide operational and financial flexibility and strengthen our customer relationships. To support financing solutions and services as part of the portfolio, DFS originates, collects, and services customer receivables primarily related to the purchase of our product and services solutions. New financing originations were $2.4 billion for both the second quarter of Fiscal 2026 and Fiscal 2025, and $4.0 billion and $4.3 billion for the first six months of Fiscal 2026 and Fiscal 2025, respectively.\nOur leases are generally classified as sales-type leases or operating leases. On commencement of sales-type leases, we recognize profit up-front and recognize amounts due from the customer under the lease contract as financing receivables. Interest income is recognized as net product revenue over the term of the lease. Upon origination of operating leases, we record equipment under operating leases, classified as property, plant, and equipment, net. We recognize product revenue and depreciation expense, classified as cost of net revenue, over the contract term.\nAs of August 1, 2025 and January 31, 2025, our financing receivables, net were $12.0 billion and $11.2 billion, respectively\nWe maintain an allowance to cover expected financing receivables credit losses and evaluate credit loss expectations based on our total portfolio. The principal charge-off rate for our financing receivables portfolio was 0.1% and 0.7% for the second quarter of Fiscal 2026 and Fiscal 2025, respectively, and 0.2% and 0.5% for the first six months of Fiscal 2026 and Fiscal 2025, respectively. The credit quality of our financing receivables remains strong due to the mix of high-quality commercial accounts in our portfolio. We continue to monitor broader economic indicators and their potential impact on future credit loss performance. We have an extensive process to manage our exposure to customer credit risk that includes active management of credit lines and collection activities. We also sell select fixed-term financing receivables "
}