{
  "source_file": "dg-20250131x10k.htm",
  "form_type": "10-K",
  "item1_clean": "11% and 8%, respectively, of our purchases in 2024. Our private brands come from a wide variety of suppliers. We directly imported approximately 4% of our purchases at cost in 2024.\nDistribution and Transportation\nOur stores are currently supported by distribution centers for frozen, refrigerated and non-refrigerated merchandise located strategically throughout our geographic footprint. In addition to our traditional distribution centers, we operate multiple temperature-controlled distribution facilities in support of our self-distribution of frozen and refrigerated goods, such as dairy, deli and frozen products. We lease additional temporary warehouse space as necessary to support our distribution needs. We regularly analyze and rebalance the distribution network with a goal of ensuring that it remains efficient and provides the service levels our stores require. See “—Properties” below for additional information pertaining to our distribution centers.\nMost of our merchandise flows through our distribution centers and is delivered to our stores by our private fleet and by third-party trucking firms, utilizing our trailers. In addition, vendors or third-party distributors deliver or ship certain food items and other merchandise directly to our stores.\nThe nature of our business is somewhat seasonal. Generally, our operating profit is greater in the fourth quarter, which includes the Christmas selling season, as compared with operating profit in each of the first three quarters of our fiscal year. In addition, our quarterly results can be affected by the timing of certain holidays, new store openings, remodels, relocations, store closings, and weather patterns. See “Item 7. Management’s Discussion & Analysis of Financial Condition and Results of Operation” for further discussion of seasonality.\nWe operate in the basic discount consumer goods market, which is highly competitive with respect to price, customers, store location, merchandise quality, assortment and presentation, service offerings, in-stock consistency, customer service, promotional activity, employees, and market share. We compete with discount stores and many other retailers, including mass merchandise, warehouse club, grocery, drug, convenience, variety, online, and certain specialty stores. These other retail companies operate stores in many of the areas where we operate, and many of them engage in extensive advertising and marketing efforts. Our direct competitors include Family Dollar, Dollar Tree, and various local, independent operators, as well as Walmart, Target, Kroger, Aldi, Costco, Sams Club, BJ’s Wholesale Club, Walgreens, CVS, and Rite Aid, among others. Certain of our competitors have greater financial, distribution, marketing and other resources than we do and may be able to secure better arrangements from suppliers than we can. Competition is intense and we believe it will continue to be so, with certain competitors reducing their store locations while others move into or increase their presence in our geographic and product markets and increase the availability of mobile, web-based and other digital technology to facilitate a more convenient and competitive online and in-store customer shopping experience.\nWe believe that we differentiate ourselves from other forms of retailing by offering competitive prices in a convenient, small-store format. We are able to maintain competitive prices due in part to our low-cost operating approach and the relatively limited assortment of products offered. Purchasing large volumes of merchandise within our focused assortment in each merchandise category allows us to keep our average product costs low, contributing to our ability to offer competitive everyday prices to our customers. See “Item 1A. Risk Factors” for further discussion of our competitive situation.\nOur Intellectual Property\nWe own marks that are registered with the United States Patent and Trademark Office and are protected under applicable intellectual property laws, including, without limitation, Dollar General®, DG®, Clover Valley®, trueliving®, pOpshelf®, and Mi Super Dollar General® along with variations and formatives of these trademarks. We attempt to obtain registration of our trademarks whenever practicable and to pursue vigorously any infringement of those marks. Our trademark registrations have various expiration dates; however, assuming that the trademark\n\nITEM 1. BUSINESS\nWe are the largest discount retailer in the United States by number of stores, with 20,662 stores located in 48 U.S. states and Mexico as of February 28, 2025, with the greatest concentration of stores in the southern, southwestern, midwestern and eastern United States. Our first stores in Mexico opened in 2023. We offer a broad selection of merchandise, including consumable items, seasonal items, home products and apparel. Our merchandise includes national brands from leading manufacturers, as well as our own private brand selections with prices at substantial discounts to national brands. We offer our customers these national brand and private brand products at everyday low prices (typically $10 or less) in our convenient small-box locations.\nJ.L. Turner founded our Company in 1939 as J.L. Turner and Son, Wholesale. We were incorporated as a Kentucky corporation under the name J.L. Turner & Son, Inc. in 1955, when we opened our first Dollar General store. We changed our name to Dollar General Corporation in 1968 and reincorporated in 1998 as a Tennessee corporation. Our common stock was publicly traded from 1968 until July 2007, when we merged with an entity controlled by investment funds affiliated with Kohlberg Kravis Roberts & Co. L.P., or KKR. In November 2009 our common stock again became publicly traded on the New York Stock Exchange under the symbol “DG”, and in December 2013 the entity controlled by investment funds affiliated with KKR sold its remaining shares of our common stock.\nOur long history of profitable growth is founded on a commitment to a relatively simple business model: providing a broad base of customers with their basic everyday and household needs, supplemented with a variety of general merchandise items, at everyday low prices in conveniently located, small-box stores. We continually evaluate the needs and demands of our customers and modify our merchandise selections and pricing accordingly, while remaining focused on increasing profitability, cash generation and returns for our shareholders.\nOur long-term operating priorities are: 1) driving profitable sales growth, 2) capturing growth opportunities, 3) enhancing our position as a low-cost operator, and 4) investing in the growth and development of our teams. For more information on these operating priorities, see the “Executive Overview” section of Management’s Discussion and Analysis of Financial Condition and Results of Operations, included in Part II, Item 7 of this report.\nWe have achieved positive same-store sales growth each year since 1990, with the exception of 2021 which followed unusually high sales results in 2020 during the height of the COVID pandemic. We believe that this consistent growth over many years, which has taken place in a variety of economic conditions, is a result of our compelling value and convenience proposition, although no assurances can be given that we will achieve positive same-store sales growth in any given year.\nCompelling Value and Convenience Proposition.\nOur ability to deliver highly competitive prices in convenient locations and our easy “in and out” shopping format create a compelling shopping experience that we believe distinguishes us from other discount retailers as well as convenience, drug, grocery, online and mass merchant retailers. Our slogan “Save time. Save money. Every day!”\n® summarizes our appeal to customers. We believe our ability to effectively deliver both value and convenience allows us to succeed in small markets with limited shopping alternatives, as well as in larger and more competitive markets. Our value and convenience proposition is evidenced by the following attributes of our business model:\nEveryday Low Prices on Quality Merchandise.\nOur research indicates that we offer a price advantage over most food and drug retailers and that our prices are competitive with even the\n\nregistrations are properly renewed, they have a perpetual duration. We also hold an exclusive license to the Rexall brand through at least March 5, 2032.\nHuman Capital Resources\nAt Dollar General, a foundational element in how we operate is exemplified in our fourth operating priority – Investing in the growth and development of our teams. Building on our core value of respecting the dignity and differences of others, our goal is to create a work environment where each employee is encouraged and empowered to bring their unique perspective and voice to work each day. Based on a talent philosophy of “Attract, Develop, and Retain”, whether an individual works in a store, a distribution center, our store support center or our international offices, over the last 85+ years, we have helped millions of individuals start and progress in their careers, providing employees with numerous opportunities to gain new skills and develop their talents, supported by our award-winning training and development programs.\nWe seek to provide market competitive compensation and benefits packages that attract talent to the organization and then retain and incent employees for performance. Although eligibility for and the level of benefits vary depending on the employee’s full-time or part-time status, compensation level, date of hire, and/or length of service, the broad range of benefits we provide or make available may include: medical, prescription, telemedicine, dental and vision plans; flexible spending accounts; disability insurance; 401(k) plan; paid vacation; employee assistance programs with access to legal assistance and counseling; healthy lifestyle and disease management programs; education assistance benefits; parental leave; adoption assistance; service award recognition; and a broad range of discounts for other products and services. To help measure the success of our overall employee compensation and benefits programs, we monitor employee applicant flow and staffing levels across the organization, as well as employee turnover, particularly at the store manager level. In addition, we conduct regular employee surveys to assess engagement and identify opportunities for improvement.\nAs a testament to our employee development efforts, we were inducted into Training magazine’s Hall of Fame, following two consecutive years as the magazine’s top training and development program and rounding out 10 consecutive years among its Top 100 list. In 2024, we estimate we invested over four million training hours in our employees to promote their education and development.\nWe enhance our development programs each year based on the current needs of our employees and the business. We offer a variety of differentiated programs, including mentorship, cohorts, and leader-led and experiential opportunities to ensure there is a path of development for all employees.\nOur internal placement rate helps us measure the success of our development programs. As of February 28, 2025, we employed approximately 194,200 full-time and part-time employees, including divisional and regional managers, district managers, store managers, other store employees, and distribution center, fleet and administrative employees. As of the end of 2024, more than 70% of store managers and thousands of additional employees, including the majority of our senior leadership, have been placed from within our organization.\nWe strive to create an environment where our employees feel respected, safe, empowered, and valued. We regularly monitor retention and engagement levels across the organization through a variety of means, working to understand what is important to",
  "item7_clean": "ITEM 7. MANAGEMENT’S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND\nRESULTS OF OPERATIONS\nThis discussion and analysis should be read with, and is qualified in its entirety by, the Consolidated Financial Statements and the notes thereto. It also should be read in conjunction with the Cautionary Disclosure Regarding Forward-Looking Statements and the Risk Factors disclosures set forth in the Introduction and in Item 1A of this report, respectively.\nWe are the largest discount retailer in the United States by number of stores, with 20,662 stores located in 48 U.S. states and Mexico as of February 28, 2025, with the greatest concentration of stores in the southern, southwestern, midwestern and eastern United States. Our first stores in Mexico opened in 2023. We offer a broad selection of merchandise, including consumable products such as food, paper and cleaning products, health and beauty products and pet supplies, and non-consumable products such as seasonal merchandise, home decor and domestics, and basic apparel. Our merchandise includes national brands from leading manufacturers, as well as our own private brand selections with prices often at substantial discounts to national brands. We offer our customers these national brand and private brand products at everyday low prices (typically $10 or less) in our convenient small-box locations.\nWe believe our convenient store formats, locations, and broad selection of high-quality products at compelling values have driven our substantial growth and financial success over the years and through a variety of economic cycles. We are mindful that the majority of our customers are value-conscious, and many have low and/or fixed incomes. As a result, we are intensely focused on helping our customers make the most of their spending dollars. The primary macroeconomic factors that affect our core customers include unemployment and underemployment rates, inflation, wage growth, changes in U.S. and global trade policy, and changes in U.S. government policy and assistance programs (including cost of living adjustments), such as SNAP, unemployment benefits, and economic stimulus programs. Finally, significant unseasonable or unusual weather patterns or extreme weather can impact customer shopping behaviors.\nOur core customers are often among the first to be affected by negative or uncertain economic conditions and among the last to feel the effects of improving economic conditions, particularly when trends are inconsistent and of an uncertain duration. Our customers continue to feel constrained in the current macroeconomic environment and to experience elevated expenses that generally comprise a large portion of their household budgets, such as rent, healthcare, energy and fuel prices, as well as cost inflation in frequently purchased household products (including food), which we expect will continue to pressure our customers’ spending overall and particularly in our non-consumables categories. This pressure contributed to a heavier promotional environment in the second half of 2024 compared to the prior year, and we expect a promotional environment in 2025 similar to that in 2024.\nWe remain committed to our long-term operating priorities as we consistently strive to improve our performance while retaining our customer-centric focus. These priorities include: 1) driving profitable sales growth, 2) capturing growth opportunities, 3) enhancing our position as a low-cost operator, and 4) investing in the growth and development of our teams.\nWe seek to drive profitable sales growth through initiatives aimed at increasing customer traffic and average transaction amount. Historically, sales in our consumables category, which tend to have lower gross margins, have been the key drivers of net sales and customer traffic, while sales in our non-consumables categories, which tend to have higher gross margins, have been the key drivers of more profitable sales growth and average transaction amount. Our sales mix has continued to shift toward consumables, which currently constitutes a historically high proportion of our sales mix. Certain of our initiatives are intended to address this sales mix trend; however, there can be no assurances that these efforts will be successful.\nAs we work to provide everyday low prices and meet our customers’ affordability needs, we remain focused on enhancing our margins through inventory shrink and damage reduction initiatives, as well as pricing and markdown optimization, effective category management and inventory reduction efforts, distribution and\n\nA continued focus on our four operating priorities as discussed above, and other impacts as discussed below, resulted in the following overall operating and financial performance in 2024 as compared to 2023. Basis points, as referred to below, are equal to 0.01% as a percentage of net sales.\nNet sales in 2024 increased 5.0%. Sales in same-stores increased 1.4%, primarily due to an increase in customer traffic. Average sales per square foot in 2024 and 2023 were $263 and $264, respectively\nThe gross profit rate decreased by 70 basis points due primarily to increased inventory markdowns, a greater proportion of sales coming from the consumables category and increased inventory damages.\nSG&A as a percentage of sales increased by 140 basis points primarily\ndue to impairment charges totaling $214.2 million related to the store portfolio optimization review and increases in retail labor, depreciation and amortization and store occupancy costs.\nOperating profit decreased 29.9% to $1.71 billion in 2024 compared to $2.45 billion in 2023.\nInterest expense, net decreased by $52.5 million in 2024 primarily due to higher average cash balances and the repayment of long-term debt.\nThe change in the effective income tax rate to 21.8% in 2024 from 21.6% in 2023 was primarily due to a higher state effective tax rate and a decreased benefit from stock-based compensation partially offset by the effect of certain rate-impacting items on lower earnings before taxes compared to 2023.\nWe reported net income of $1.13 billion, or $5.11 per diluted share, for 2024 compared to net income of $1.66 billion, or $7.55 per diluted share, for 2023.\nWe generated approximately $2.996 billion of cash flows from operating activities in 2024, an increase of 25.3% compared to 2023.\nInventory turnover was 4.1 times, and inventories decreased 6.9% on a per store basis compared to 2023.\nReaders should refer to the detailed discussion of our operating results below for additional comments on financial performance in the current year as compared with the prior years presented.\nResults of Operations\nThe following text contains references to years 2024, 2023, and 2022, which represent fiscal years ended January 31, 2025, February 2, 2024, and February 3, 2023, respectively. Our fiscal year ends on the Friday closest to January 31. Fiscal years 2024 and 2023 were 52-week accounting periods and fiscal year 2022 was a 53-week accounting period.\n. The nature of our business is somewhat seasonal. Primarily because of sales of Christmas-related merchandise, operating profit in our fourth quarter (November, December and January) has historically been higher than operating profit achieved in each of the first three quarters of the fiscal year. However, more recently, and in particular fiscal years 2023 and 2024, this has not been the case. Expenses, and to a greater extent operating profit, vary by quarter. Results of a period shorter than a full year may not be indicative of results expected for the entire year. Furthermore, the seasonal nature of our business may affect comparisons between periods.\n\n30.3% compared to 2022, primarily driven by increased shrink and inventory markdowns, lower inventory markups, a higher proportion of lower margin consumables sales, and increased damages. Partially offsetting the factors which decreased our overall gross profit rate were a lower LIFO provision and decreased transportation costs.\nSG&A.\nSG&A as a percentage of net sales was 25.4% in 2024 compared to 24.0% in 2023, an increase of 140 basis points. The increase reflects fourth quarter impairment charges totaling $214.2 million related to the store portfolio optimization review as discussed above in the Executive Summary and Note 12 to the consolidated financial statements. Other expenses that were higher as a percentage of net sales in 2024 were retail labor, depreciation and amortization, store occupancy costs and incentive compensation.\nSG&A as a percentage of net sales was 24.0% in 2023 compared to 22.4% in 2022, an increase of 153 basis points. The primary expenses that were higher as a percentage of net sales in 2023 were retail labor, store occupancy costs, depreciation and amortization, repairs and maintenance, and other services purchased, including debt and credit card transaction fees, which were partially offset by a decrease in incentive compensation.\nInterest Expense, net\n. Interest expense, net decreased $52.5 million to $274.3 million in 2024 compared to 2023 due to higher average cash balances and the repayment of long-term debt. Interest expense, net increased $115.5 million to $326.8 million in 2023 compared to 2022, primarily due to higher outstanding borrowings and higher interest rates. See the detailed discussion under “Liquidity and Capital Resources” regarding the financing of various long-term obligations.\n. The effective income tax rate for 2024 was 21.8% compared to a rate of 21.6% for 2023 which represents a net increase of 0.2 percentage points. The effective tax rate was higher in 2024 primarily due to a higher state effective tax rate and a decreased benefit from stock-based compensation partially offset by the effect of certain rate-impacting items on lower earnings before taxes.\nThe effective income tax rate for 2023 was 21.6% compared to a rate of 22.5% for 2022 which represents a net decrease of 0.9 percentage points. The effective tax rate was lower in 2023 primarily due to the effect of certain rate-impacting items (such as federal tax credits) on lower earnings before taxes and a lower state effective rate resulting from increased recognition of state tax credits.\nEffects of Inflation\nIn 2024 and 2023, we experienced moderate increases in product costs due to lower rates of inflation. In addition, we continued to experience elevated but relatively stable costs of building materials and certain of our other capital costs. In 2022, we experienced higher rates of inflation affecting product costs, the costs of building materials and certain of our other capital costs.\nLiquidity and Capital Resources\nCurrent Financial Condition and Recent Developments\nDuring the past three years, we have generated an aggregate of approximately $7.4 billion in cash flows from operating activities and incurred approximately $4.6 billion in capital expenditures. During that period, we expanded the number of stores we operate by 2,464, representing store growth of approximately 14%, and we remodeled or relocated 5,764 stores, or approximately 32% of the stores we operated as of the beginning of the three-year period. In 2025, we intend to pursue accelerated growth in remodels, including Project Elevate, with slower growth for new stores and fewer relocations.\nAt January 31, 2025, we had a $2.375 billion unsecured revolving credit agreement (the “Revolving Facility”), $6.2 billion aggregate principal amount of senior notes, and a commercial paper program that may provide borrowing availability of up to $2.0 billion. At January 31, 2025, we had total consolidated outstanding debt (including the current portion of long-term obligations) of $6.2 billion, most of which was in the form of senior notes. All of our material borrowing arrangements are described in greater detail below. Our borrowing availability under the Revolving Facility may be effectively limited by our commercial paper notes (“CP Notes”) as further\n\nShare Repurchase Program\nOur common stock repurchase program had a total remaining authorization of approximately $1.38 billion at January 31, 2025. The authorization allows repurchases from time to time in open market transactions, including pursuant to trading plans adopted in accordance with Rule 10b5-1 of the Securities Exchange Act of 1934, as amended, or in privately negotiated transactions. The repurchase authorization has no expiration date, and future repurchases will depend on a variety of factors, including price, market conditions, compliance with the covenants and restrictions under our debt agreements, cash requirements, excess debt capacity, results of operations, financial condition and other factors. The repurchase program may be modified or terminated from time to time at the discretion of our Board of Directors. To preserve our investment grade credit rating and maintain financial flexibility, we did not repurchase any shares under this program in 2024 and do not plan to repurchase shares during fiscal 2025. For more detail, see Note 11 to the consolidated financial statements.\nOther Considerations\nIn March 2025, the Board of Directors declared a quarterly cash dividend of $0.59 per share which is payable on or before April 22, 2025 to shareholders of record of our common stock on April 8, 2025. We paid quarterly cash dividends of $0.59 per share in 2024. Although the Board currently expects to continue regular quarterly cash dividends, the declaration and amount of future cash dividends are subject to the Board’s sole discretion and will depend upon, among other factors, our results of operations, cash requirements, financial condition, contractual restrictions, excess debt capacity and other factors that our Board may deem relevant in its sole discretion.\nOur inventory balance represented approximately 47% of our total assets exclusive of operating lease assets, goodwill, and other intangible assets as of January 31, 2025. Our ability to effectively manage our inventory balances can have a significant impact on our cash flows from operations during a given fiscal year as discussed further below. Inventory purchases are often somewhat seasonal in nature, such as the purchase of warm-weather or Christmas-related merchandise. Efficient management of our inventory has been and continues to be an area of focus for us.\nAs described in Note 7 to the consolidated financial statements, we are involved in a number of legal actions and claims, some of which could potentially result in material cash payments. Adverse developments in those actions could materially and adversely affect our liquidity.\nCash flows from operating activities.\nCash flows from operating activities were $2.996 billion in 2024, which represents a $604.3 million increase compared to 2023. Changes in merchandise inventories resulted in a $230.2 million increase in our working capital in 2024 compared to the decrease of $299.1 million in 2023 as described in greater detail below. Changes in accounts payable resulted in a $302.9 million increase in our working capital in 2024 compared to a $36.9 million increase in 2023, due primarily to the timing of inventory receipts and related payments. Changes in accrued expenses resulted in a $91.8 million increase in 2024 compared to a $39.2 million decrease in 2023. Net income decreased to $1.1 billion in 2024 as compared to $1.7 billion in 2023. Changes in other noncash losses resulted in a $296.2 million increase as compared to a $89.0 million increase in 2023 primarily due to impairment charges in 2024. Changes in income taxes paid in 2024 compared to 2023 are primarily due to the decrease in pre-tax earnings in 2024 and the timing of payments for income taxes.\nCash flows from operating activities were $2.4 billion in 2023, which represents a $407.2 million increase compared to 2022. Changes in merchandise inventories resulted in a $299.1 million decrease in our working capital in 2023 compared to the d",
  "item2_clean": null
}