{
  "source_file": "dgx-20241231.htm",
  "form_type": "10-K",
  "item1_clean": "We provide information and insights based on an industry-leading menu of routine, non-routine and advanced clinical testing and anatomic pathology testing, and other diagnostic information services. We have strong testing capabilities, including services for the predisposition, diagnosis, treatment and monitoring of cancers and other diseases, and offer advanced tests in many fields, including endocrinology, immunology, neurology and oncology. Increasingly, we are focused on providing solutions and insights to our customers, based on the testing that we perform, the data that we gather and our extensive medical, information and connectivity assets. We believe that offering services, solutions and insights based on a full range of tests, information assets and other capabilities strengthens our market offering, market position and reputation.\nWe offer broad access to clinical testing through a network of laboratories, including advanced laboratories as well as rapid response laboratories (smaller facilities where we can quickly perform an abbreviated menu of routine tests for customers that require rapid turnaround times). We operate 24 hours a day, 365 days a year. Our network also includes patient service centers, phlebotomists in physician offices, and our connectivity resources, including call centers and mobile phlebotomists, nurses and other health and wellness professionals. Our large in-house staff of medical and scientific experts, including medical directors, scientific directors, genetic counselors and board-certified geneticists, provide medical and scientific consultation to healthcare providers and patients regarding our tests and test results, and help them best utilize our services to improve outcomes and enhance satisfaction. We also provide testing (including anatomic pathology) services and medical director services at hospital laboratories.\nWe are a leading provider of diagnostic information services, developing and delivering comprehensive offerings to help physicians manage patients across disease stages, from screening for early risk to treatment selection and monitoring to post-treatment evaluation. We have comprehensive test offerings in cardiometabolic and endocrine; cancer; clinical drug monitoring and toxicology; infectious disease, including autoimmune; neurology diagnostics, including Alzheimer’s disease;\nand women’s health, including prenatal genetics. We strive to provide diagnostic solutions for emerging infectious diseases, and were the first commercial laboratory to introduce a test for the H5 avian flu virus based on a preparedness contract from the Centers for Disease Controls and Prevention (“CDC”). We also provide workplace drug testing services, testing urine, hair, and oral fluid specimens, and are certified by the U.S. Department of Health and Human Services (“HHS”) to perform drug testing using electronic custody and control forms for federally-mandated, safety-sensitive workers.\nWe offer a wide range of employer population health services, including biometric screenings, flu shots and related preventative services that leverage clinical data to improve population health outcomes and reduce healthcare spend. Our solutions enable employers to leverage screening insights to identify chronic disease risks, guide employees to needed in-network care, and improve employee health with intervention services. Our offerings include connecting participants to the right care at the right time, such as (i) a program designed to prevent diabetes and other chronic conditions, (ii) a program that enables participants to engage with a board-certified physician about their results and be guided to the right next action based on those results, (iii) a health coaching program to help individuals adopt healthier behaviors to improve health outcomes and (iv) a program to facilitate virtual telehealth access to clinical services for participants and adult dependents, with emphasis on reducing risks related to preventable chronic diseases. These services are sold directly to employers, through resellers and health plan partners.\nWe offer health IT solutions, including our products and national healthcare provider network, to help healthcare organizations and clinicians empower better health by leveraging the power of our significant information assets, including one of the world's largest databases of de-identifiable clinical lab results, and our technology prowess, including our history of providing leading IT for diagnostic information services. Our portfolio of offerings is designed to address analytic, clinical and financial needs. The solutions help healthcare organizations and clinicians analyze and put in context data, and enable them to connect across the healthcare system and engage with their stakeholders. They can enter, share and access clinical information without costly IT implementation or significant workflow disruption.\nWe offer population health solutions to clinicians, health plans, and hospitals. Our services build on the power of our information assets and data capabilities and help our customers deliver better care to their patient populations by identifying gaps in care in a population, providing clinical solutions to close the gaps and fostering consumer engagement with a solution. For example, Quest\nTM\nemploys machine learning to help clinicians optimize medically-appropriate laboratory test utilization. Our extended care services (\n., home collection kits for lab testing) help deliver better care to patient populations by identifying and filling gaps in care for patient populations and by enabling delivery of the most effective healthcare to the right populations and individuals. These services leverage the power of our assets (\n, our extensive clinical data and data analytics services) and capabilities (\n., call centers, patient service centers, mobile workforce) and focus on extending the reach of clinician offices beyond their traditional four walls to assess the health of their populations, and doing so when it is convenient for consumers. Once gaps are identified, we engage patients in our retail sites, in home or by telephone, including through our call centers and our mobile capabilities, including highly trained healthcare professionals.\nWe offer services to pharmaceutical companies, including clinical trials laboratory testing, population analytics and patient engagement services. We also develop laboratory tests for U.S. Food and Drug Administration (“FDA”) submissions as companion diagnostics and laboratory developed tests (“LDTs”) for complementary diagnostics, and offer an array of assets and services to support the development of companion diagnostics, including our robust data set and patient services network. In addition, we offer Quest Clinical Trials Connect™ to help accelerate clinical trials (and thus the speed of drugs to market) through better patient recruitment, involvement and management, and improved physician outreach.\nDiagnostic Solutions\nOur risk assessment service, ExamOne\nis the largest provider of risk assessment services to the life insurance industry in North America and comprises underwriting support services, including data gathering, paramedical examinations and clinical laboratory testing and analytics, designed to assist life insurance companies objectively to evaluate the mortality risks of applicants. Most specimen collections and paramedical examinations are performed by our network of paramedical examiners at the applicant's home or workplace, but they also are offered at hundreds of our patient service centers and many additional locations. ExamOne\nalso offers other national specimen collection and health data solutions that provide fast and accurate insights for clinical research and diagnostics programs, as well as academic studies.\nWe also offer our award-winning Quanum\nEnterprise Content Solutions™ for hospitals, to connect data to decision-making and help clinicians advance clinical and operational strategies. Healthcare organizations use Quanum\nEnterprise Content Solutions™ at approximately 1,400 sites in North America.\nTHE CLINICAL TESTING INDUSTRY\nThe healthcare system in the United States continues to evolve and industry change is likely to be extensive. Because diagnostic information services is an essential healthcare service, we believe that the industry will continue to grow over the long term. There are a number of key trends that we expect will continue to have a significant impact on the growth and the nature of the diagnostic information services business in the United States and on our business. These trends, discussed in the table below, present both opportunities and risks. We believe that several of the trends, including consolidation, price transparency and consumerization, are favorable to our business.\nReimbursement pressure driven by The Protecting Access to Medicare Act of 2014 (“PAMA”)\nPursuant to PAMA, reimbursement rates for many clinical laboratory tests provided under Medicare were reduced during 2018 - 2020. Unfortunately, as a result of a flawed implementation of PAMA, the data collected did not accurately represent the laboratory market as required under PAMA. Independent laboratories were overrepresented, and hospitals and physician office laboratories were underrepresented, making the first round of PAMA cuts too extreme. The three years of cuts exceeded the original 10-year savings projections. PAMA calls for further revision of the Medicare Clinical Laboratory Fee Schedule (“CLFS”) for years after 2020, based on future surveys of market rates.\nCongress has delayed cuts five times (2021 - 2025) and delayed 2019 data reporting six times (2020 - 2025). Reimbursement rate reduction from 2026-28 is capped by PAMA at 15% annually.\nCongress reintroduced federal legislation in 2023 (the Saving Access to Laboratory Services Act), which would reform PAMA and create a true market-based CLFS.\nHealth plans driving value in lab spending\nSome hospitals provide outreach testing and may encourage clinicians to send their outreach testing volume to the hospital's laboratory. Historically, hospitals were able to negotiate higher reimbursement rates with health plans than commercial clinical laboratories for comparable services. In addition, health plans generally reimburse laboratory services provided by non-participating laboratories at higher out-of-network rates. We are finding increased interest among health plans in driving better value in spending for laboratory testing. Health plans increasingly are taking steps to encourage the movement of testing volume to high value, lower cost providers like our Company, including by identifying preferred provider partners, plan design changes (\n, zero-dollar out-of-pocket costs for members using preferred providers) and better aligning reimbursement rates for hospital-based providers and independent commercial laboratories. The UnitedHealthcare Preferred Lab Network, which chose us to participate, is an example of a health plan taking these steps.\nHealth plans also are increasingly adopting policies, practices and procedures and incorporating requirements imposed by government payers such as Medicare and Medicaid that influence the utilization and reimbursement of testing services. These policies, practices procedures and requirements are often subject to change without notice.\nConsumers are our customers. Increasingly, consumers are engaged and interested in, and empowered to manage and take direct responsibility for, their own healthcare. As a result, they are becoming more sophisticated in their understanding of their healthcare needs and their expectations of healthcare providers. In addition, consumers often are bearing increased financial responsibility for their healthcare (\n, high deductible health plans; rising deductibles). In our experience, consumers are more focused on transparency, ease of doing business a",
  "item7_clean": null,
  "item2_clean": null
}