{
  "source_file": "dhi-20250630.htm",
  "form_type": "10-Q",
  "item1_clean": null,
  "item7_clean": null,
  "item2_clean": "ITEM 2. MANAGEMENT’S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS\nBUSINESS\nD.R. Horton, Inc. is the largest homebuilding company in the United States as measured by number of homes closed. We construct and sell homes through our operating divisions in 126 markets across 36 states. Our common stock is included in the S&P 500 Index and listed on the New York Stock Exchange and NYSE Texas under the ticker symbol “DHI.” Our listing on NYSE Texas became effective in June 2025. Unless the context otherwise requires, the terms “D.R. Horton,” the “Company,” “we” and “our” used herein refer to D.R. Horton, Inc., a Delaware corporation, and its predecessors and subsidiaries.\nOur business operations consist of homebuilding, rental, a majority-owned residential lot development company, financial services and other activities. Our homebuilding operations are our core business and primarily include the construction and sale of single-family homes with sales prices generally ranging from $250,000 to more than $1,000,000, with an average closing price of $372,200 during the nine months ended June 30, 2025. Approximately 84% of our home sales revenue in the nine months ended June 30, 2025 was generated from the sale of single-family detached homes, with the remainder from the sale of attached homes, such as townhomes and duplexes.\nWe have closed more than 1.2 million homes during our 46-year history, and we have been the largest volume homebuilder in the United States every year since 2002. Our product offerings include a broad range of homes for entry-level, move-up, active adult and luxury buyers.\nOur rental segment consists of single-family and multi-family rental operations. The single-family rental operations construct and lease single-family homes within a community and then generally market each community for a bulk sale of rental homes. The multi-family rental operations develop, construct, lease and sell residential rental properties, the majority of which are apartment communities.\nAt June 30, 2025, we owned 62% of the outstanding shares of Forestar Group Inc. (Forestar), a publicly traded residential lot development company listed on the New York Stock Exchange and NYSE Texas under the ticker symbol “FOR.” Forestar operates across many of our homebuilding operating markets and is a key part of our homebuilding strategy to maintain relationships with land developers and to control a large portion of our land and lot position through land purchase contracts.\nOur financial services operations provide mortgage financing and title agency services to homebuyers in many of our homebuilding markets. DHI Mortgage, our wholly owned subsidiary, provides mortgage financing services primarily to our homebuyers and sells substantially all of the mortgages it originates and the related servicing rights to third-party purchasers after origination. Our wholly owned subsidiary title companies serve as title insurance agents by providing title insurance policies, examination, underwriting and closing services primarily to our homebuilding customers.\nIn addition to our homebuilding, rental, Forestar and financial services operations, we engage in other business activities through our subsidiaries. We conduct insurance-related operations, own water rights and other water-related assets and own non-residential real estate including ranch land and improvements. The results of these operations are immaterial for separate reporting and therefore are grouped together and presented as other.\nOVERVIEW\nDuring the nine months ended June 30, 2025, our number of homes closed and our home sales revenues decreased 7% and 8%, respectively, compared to the prior year period, and our consolidated revenues decreased 8% to $24.6 billion compared to $26.8 billion. Our pre-tax income was $3.5 billion in the nine months ended June 30, 2025 compared to $4.6 billion in the prior year period, and our pre-tax operating margin was 14.4% compared to 17.1%. Net income was $2.7 billion in the nine months ended June 30, 2025 compared to $3.5 billion in the prior year period, and our diluted earnings per share were $8.53 compared to $10.43.\nIn the trailing twelve months ended June 30, 2025, our return on equity (ROE) was 16.1% compared to 21.5% in the prior year period, and our return on assets (ROA) was 11.1% compared to 14.8%. ROE is calculated as net income attributable to D.R. Horton for the trailing twelve months divided by average stockholders’ equity, where average stockholders’ equity is the sum of ending stockholders’ equity balances for the trailing five quarters divided by five. ROA is calculated as net income attributable to D.R. Horton for the trailing twelve months divided by average consolidated assets, where average consolidated assets is the sum of total asset balances for the trailing five quarters divided by five.\nDuring the third quarter, new home demand continued to be impacted by uncertainty among potential homebuyers due to ongoing affordability constraints and cautious consumer sentiment. As a result, the value of our net sales orders and homebuilding revenues in the third quarter decreased 3% and 7%, respectively, from the prior year quarter, and our home sales gross margin decreased to 21.8% as we increased sales incentives such as buydowns of mortgage rates for our homebuyers. We strive to remain well-positioned with affordable product offerings and a flexible lot supply and will continue to manage our home pricing, sales incentives and number of homes in inventory based on the level of new home demand in each of our local markets. We expect to maintain an elevated level of incentives to support demand and may increase them further, depending on market conditions and changes in mortgage interest rates.\nWe remain focused on our relationships with land developers across the country in order to maximize returns and capital efficiency\nWithin our homebuilding land and lot portfolio, lots controlled through purchase contracts represented 76% of the lots owned and controlled at June 30, 2025, September 30, 2024 and June 30, 2024. We continue to prioritize the purchase of finished lots from Forestar and other land developers when possible. During the nine months ended June 30, 2025, 65% of the homes we closed were on lots developed by either Forestar or a third party.\nWe believe our strong balance sheet and liquidity provide us with the flexibility to operate effectively through changing economic conditions. We plan to generate strong cash flows from our operations and manage our product offerings, incentives, home pricing, sales pace and inventory levels to optimize the return on our inventory investments in each of our communities based on local housing market conditions.\nSTRATEGY\nOur operating strategy focuses on consistently enhancing long-term value to our shareholders by leveraging our financial and competitive positions to maximize the returns on our inventory investments and generate strong profits and cash flows from operations, while managing risk and maintaining financial flexibility to navigate changing economic conditions. Our strategy includes the following initiatives:\nDeveloping and retaining highly experienced and productive teams of personnel throughout our company that are aligned and focused on continuous improvement in our operational execution and financial performance.\nMaintaining a significant cash balance and strong overall liquidity position while controlling our level of debt.\nAllocating and actively managing our inventory investments across our operating markets to diversify our geographic risk.\nOffering new home communities that appeal to a broad range of entry-level, move-up, active adult and luxury homebuyers based on consumer demand in each market.\nModifying product offerings, sales pace, home prices and incentives as necessary in each of our markets to meet consumer demand and maintain affordability.\nDelivering high quality homes and a positive experience to our customers both during and after the sale.\nManaging our inventory of homes under construction relative to demand in each of our markets, including starting construction on unsold homes to capture new home demand and actively controlling the number of unsold, completed homes in inventory.\nInvesting in lots, land and land development in desirable markets, while controlling the level of land and lots we own in each market relative to the local new home demand.\nControlling a significant portion of our land and finished lot position through purchase contracts and prioritizing the purchase of finished lots from Forestar and other land developers when possible.\nControlling the cost of labor and goods provided by subcontractors and vendors.\nImproving the efficiency of our land development, construction, sales and other key operational activities.\nControlling our selling, general and administrative (SG&A) expense infrastructure to match production levels.\nEnsuring that our financial services business provides high quality mortgage and title services to homebuyers efficiently and effectively.\nInvesting in our rental operations to meet rental demand in high growth suburban markets and selling these properties profitably.\nOpportunistically evaluating potential acquisitions to enhance our operating platform.\nWe believe our operating strategy, which has produced positive results in recent years, will allow us to successfully operate through changing economic conditions and maintain our strong financial performance and competitive position. However, we cannot provide any assurances that the initiatives listed above will continue to be successful, and we may need to adjust parts of our strategy to meet future market conditions.\nKEY RESULTS\nKey financial results as of and for the three months ended June 30, 2025, as compared to the same period of 2024 unless otherwise indicated, were as follows:\nConsolidated Results:\nConsolidated revenues decrease"
}