{
  "source_file": "dis-20250628.htm",
  "form_type": "10-Q",
  "item1_clean": null,
  "item7_clean": null,
  "item2_clean": "Repurchases of common stock\nAcquisition of redeemable noncontrolling interest\nOther financing activities, net\nCash used in financing activities\nPrimarily consists of dividends to noncontrolling interest holders and equity award activity.\nSee Note 5 to the Condensed Consolidated Financial Statements for a summary of the Company’s borrowing activities during the nine months ended June 28, 2025 and information regarding the Company’s bank facilities. The Company may use cash balances, operating cash flows, commercial paper borrowings up to the amount of its unused $12.25 billion bank facilities and incremental term debt issuances to retire or refinance other borrowings before or as they come due.\nSee Note 11 to the Condensed Consolidated Financial Statements for a summary of dividends and share repurchases. The Company is targeting approximately $3 billion in share repurchases in fiscal 2025.\nThe redeemable noncontrolling interest activity in the current and prior-year period was attributable to the acquisition of NBCU’s interest in Hulu. In June 2025, the Company paid an incremental amount for Hulu based on a final appraisal of Hulu’s fair value (see Note 4 to the Condensed Consolidated Financial Statements).\nThe Company’s operating cash flow and access to the capital markets can be impacted by factors outside of its control. We believe that the Company’s financial condition is strong and that its cash balances, other liquid assets, operating cash flows, access to debt and equity capital markets and borrowing capacity under current bank facilities, taken together, provide adequate resources to fund ongoing operating requirements, contractual obligations, upcoming debt maturities, as well as future capital expenditures related to the expansion of existing businesses and development of new projects. In addition, the Company could undertake other measures to ensure sufficient liquidity, such as raising additional financing, reducing or not declaring future dividends; reducing or stopping share repurchases; reducing capital spending; reducing film and episodic content investments; or implementing further cost-saving initiatives.\nThe Company’s borrowing costs can also be impacted by short- and long-term debt ratings assigned by nationally recognized rating agencies, which are based, in significant part, on the Company’s performance as measured by certain credit metrics such as leverage and interest coverage ratios. As of June 28, 2025, Moody’s Ratings’ long- and short-term debt ratings for the Company were A2 and P-1 (Stable), respectively, S&P Global Ratings’ long- and short-term debt ratings for the Company were A and A-1 (Stable), respectively, and Fitch Rating’s long- and short-term debt ratings for the Company were A- and F2 (Stable), respectively. The Company’s bank facilities contain only one financial covenant, relating to interest coverage of three times earnings before interest, taxes, depreciation and amortization, including both intangible amortization and amortization of our film and television production and programming costs. On June 28, 2025, the Company met this covenant by a significant margin. The Company’s bank facilities also specifically exclude certain entities, including the Asia Theme Parks, from any representations, covenants or events of default.\nMANAGEMENT’S DISCUSSION AND ANALYSIS OF\nFINANCIAL CONDITION AND RESULTS OF OPERATIONS — (continued)\nMARKET RISK\nThe Company is exposed to the impact of interest rate changes, foreign currency fluctuations, commodity fluctuations and changes in the market values of its investments.\nPolicies and Procedures\nIn the normal course of business, we employ established policies and procedures to manage the Company’s exposure to changes in interest rates, foreign currencies and commodities using a variety of financial instruments.\nOur objectives in managing exposure to interest rate changes are to limit the impact of interest rate volatility on earnings and cash flows and to lower overall borrowing costs. To achieve these objectives, we primarily use interest rate swaps to manage net exposure to interest rate changes related to the Company’s portfolio of borrowings. By policy, the Company targets fixed-rate debt as a percentage of its net debt between minimum and maximum percentages.\nOur objective in managing exposure to foreign currency fluctuations is to reduce volatility of earnings and cash flows in order to allow management to focus on core business issues and challenges. Accordingly, the Company enters into various contracts that change in value as foreign exchange rates change to protect the U.S. dollar equivalent value of its existing foreign currency assets, liabilities, commitments and forecasted foreign currency revenues and expenses. The Company utilizes option strategies and forward contracts that provide for the purchase or sale of foreign currencies to hedge probable, but not firmly committed, transactions. The Company also uses forward and option contracts to hedge foreign currency assets and liabilities. The principal foreign currencies hedged are the euro, British pound, Japanese yen, Chinese yuan and Canadian dollar. Cross-currency swaps are used to effectively convert foreign currency denominated borrowings to U.S. dollar denominated borrowings. By policy, the Company maintains hedge coverage between minimum and maximum percentages of its forecasted foreign exchange exposures generally for periods not to exceed four years. The gains and losses on these contracts are intended to offset changes in the U.S. dollar equivalent value of the related exposures. The economic or political conditions in a country have reduced and in the future could reduce our ability to hedge exposure to currency fluctuations in the country or our ability to repatriate revenue from the country.\nOur objectives in managing exposure to commodity fluctuations are to use commodity derivatives to reduce volatility of earnings and cash flows arising from commodity price changes. The amounts hedged using commodity swap contracts are based on forecasted levels of consumption of certain commodities, such as fuel oil and gasoline.\nOur objectives in managing exposures to market-based fluctuations in certain retirement liabilities are to use total return swap contracts to reduce the volatility of earnings arising from changes in these retirement liabilities. The amounts hedged using total return swap contracts are based on estimated liability balances.\nIt is the Company’s policy to enter into foreign currency and interest rate derivative transactions and other financial instruments only to the extent considered necessary to meet its objectives as stated above. The Company does not enter into these transactions or any other hedging transactions for speculative purposes.\nCOMMITMENTS AND CONTINGENCIES\nAs disclosed in Note 13 to the Condensed Consolidated Financial Statements, the Company has exposure for certain legal matters.\nSee Note 5 to the Condensed Consolidated Financial Statements.\nContractual Commitments\nUNCERTAINTIES\nMANAGEMENT’S DISCUSSION AND ANALYSIS OF\nFINANCIAL CONDITION AND RESULTS OF OPERATIONS — (continued)\nOTHER MATTERS\nAccounting Policies and Estimates\nProduced and Acquired/Licensed Content Costs\nWe amortize and test for impairment of capitalized film and television production costs based on whether the content is predominantly monetized individually or as a group. See Note 7 to the Condensed Consolidated Financial Statements for further discussion.\nProduction costs that are classified as individual are amortized based upon the ratio of the current period’s revenues to the estimated remaining total revenues (Ultimate Revenues).\nWith respect to produced films intended for theatrical release, the most sensitive factor affecting our estimate of Ultimate Revenues is theatrical performance. Revenues derived from other markets subsequent to the theatrical release are generally highly correlated with theatrical performance. Theatrical performance varies primarily based upon the public interest and demand for a particular film, the popularity of competing films at the time of release and the level of marketing effort. Upon a film’s release and determination of the theatrical performance, the Company’s estimates of revenues from succeeding windows and markets, which may include imputed license fees for content that is used on our DTC streaming services, are revised based on historical relationships and an analysis of current market trends.\nWith respect to capitalized television production costs that are classified as individual, the most sensitive factor affecting estimates of Ultimate Revenues is program ratings of the content on our licensees’ platforms. Program ratings, which are an indication of market acceptance, directly affect the program’s ability to generate advertising and subscriber revenues and are correlated with the license fees we can charge for the content in subsequent windows and for subsequent seasons.\nUltimate Revenues are reassessed each reporting period and the impact of any changes on amortization of production cost is accounted for as if the change occurred at the beginning of the current fiscal year. If our estimate of Ultimate Revenues decreases, amortization of costs may be accelerated or result in an impairment. Conversely, if our estimate of Ultimate Revenues increases, cost amortization may be slowed.\nProduction costs classified as individual are tested for impairment at the individual title level by comparing that title’s unamortized costs to the present value of discounted cash flows directly attributable to the title. To the extent the title’s unamortized costs exceed the present value of discounted cash flows, an impairment charge is recorded for the excess.\nProduced content costs that are part of a group and acquired/licensed content costs are amortized based on projected usage, typically resulting in an accelerated or straight-line amo"
}