{
  "source_file": "dlr-20250930x10q.htm",
  "form_type": "10-Q",
  "item1_clean": null,
  "item7_clean": null,
  "item2_clean": "While forward-looking statements reflect our good faith beliefs, they are not guarantees of future performance. We disclaim any obligation to publicly update or revise any forward-looking statement to reflect changes in underlying assumptions or factors, new information, data or methods, future events or other changes.\nOccupancy percentages included in the following discussion, for some of our properties, are calculated based on factors in addition to contractually leased square feet, including available power, required support space and common area.\nAs used in this report: “Ascenty entity” refers to the entity which owns and operates Ascenty, formed with Brookfield Infrastructure.\nBusiness Overview and Strategy\nDigital Realty Trust, Inc., through its controlling interest in Digital Realty Trust, L.P. and its subsidiaries, delivers comprehensive space, power, and interconnection solutions that enable its customers and partners to connect with each other and service their own customers on a global technology and real estate platform. We are a leading global provider of data center, colocation and interconnection solutions for customers across a variety of industry verticals. Digital Realty Trust, Inc. operates as a REIT for U.S. federal income tax purposes, and our Operating Partnership is the entity through which we conduct our business and own our assets.\nOur primary business objectives are to maximize:\nsustainable long-term growth in earnings and funds from operations per share and unit;\ncash flow and returns to our stockholders and Digital Realty Trust, L.P.’s unitholders through the payment of distributions; and\nreturn on invested capital.\nWe expect to accomplish our objectives by achieving superior risk-adjusted returns, prudently allocating capital, diversifying our product offerings, accelerating our global reach and scale, and driving revenue growth and operating efficiencies. A significant component of our current and future internal growth is anticipated through the development of our existing space held for development, acquisition of land for future development, and acquisition of new properties.\n\nTotal Rental Property Operating and Maintenance (Excluding Utilities)\nTotal stabilized rental property operating and maintenance expenses (excluding utilities) increased by approximately $24.3 million and $46.5 million in the three and nine months ended September 30, 2025, respectively, compared to the same periods in 2024 primarily due to increases in building operations expense, common area maintenance expense and data center labor.\nTotal non-stabilized rental property operating and maintenance expenses (excluding utilities) increased by approximately $4.2 million and $26.3 million in the three and nine months ended September 30, 2025, respectively, compared to the same periods in 2024 primarily due to increases in data center labor expense throughout the portfolio.\nTotal Property Taxes and Insurance\nTotal stabilized property taxes and insurance increased by approximately $6.2 million and $4.6 million in the three and nine months ended September 30, 2025, respectively, compared to the same periods in 2024, primarily due to timing of property tax assessments throughout our North American portfolio.\nTotal non-stabilized property taxes and insurance decreased by approximately $0.4 million and increased by approximately $10.9 million in the three and nine months ended September 30, 2025, respectively, compared to the same periods in 2024, primarily related to property tax reassessments for certain properties located in Chicago, Northern Virginia and Portland in the non-stabilized portfolio.\nOther Operating Expenses\nOther operating expenses include costs which are either non-cash in nature (such as depreciation and amortization) or which do not directly pertain to operation of data center properties. A comparison of other operating expenses for the respective periods is shown below (in thousands).\nThree Months Ended September 30,\nNine Months Ended September 30,\n\nGain on Disposition of Properties, Net\nGain on disposition of properties increased $20.3 million and $501.8 million in the three and nine months ended September 30, 2025, respectively, compared to the same periods in 2024.\nDuring the quarter, we sold three non-core data centers in the Atlanta, Miami and Boston metro areas for gross proceeds of approximately $90 million and recognized a gain on disposition of approximately $20 million.\nIn May 2025, we received approximately $937 million of gross proceeds from the contribution of operating data centers and development projects to the Fund, recognized a gain on disposition of approximately $873 million, and recognized an investment in the assets of $661 million.\nIn April 2025, we contributed an additional three development projects at the Digital Dulles campus to the joint venture with Blackstone. We received approximately $77 million of gross proceeds from the contribution and as a result of transferring control, we derecognized the data centers and recognized a gain on disposition of approximately $58 million.\nIn January 2024, we closed on the sale of our interest in four data centers to Brookfield Infrastructure Partners L.P., or Brookfield, for approximately $271 million. As a result of the sale, we recognized a total gain on disposition of approximately $194.2 million.\nIn March 2024, we recognized a total gain of $74.4 million from the sale of an easement to a local power provider in Northern Virginia.\nInterest expense decreased $10.2 million and $26.7 million in the three and nine months ended September 30, 2025, respectively, compared to the same periods in 2024 driven primarily by lower average balances on our Global Revolving Credit Facilities and term loan facilities offset by issuances of unsecured senior notes (€850 million of 3.875% Guaranteed Notes due 2033 (issued in September 2024), $1.15 billion of 1.875% Exchangeable Senior Notes due 2029 (issued in November 2024), €850 million of 3.875% Guaranteed Notes due 2035 (issued in January 2025) and €850 million of 3.875% Guaranteed Notes due 2034 (issued in June 2025).\nLoss on Debt Extinguishment and Modifications\nWe incurred no losses on debt extinguishment and debt modifications in the three and nine months ended September 30, 2025.\nIn January 2024, we paid down $240 million on the U.S. term loan facility, leaving $500 million outstanding. The paydown resulted in an early extinguishment charge of approximately $1.1 million.\nIn September 2024, we paid down €375 million on the Euro Term Loan Facilities, leaving €375 million outstanding. The paydown resulted in an early extinguishment charge of approximately $1.6 million. We also refinanced our Global Revolving Credit Facilities and wrote off deferred loan costs of approximately $1.2 million.\n\nThe sales of common stock made under the 2024 Sales Agreement Amendment will be made in “at the market” offerings as defined in Rule 415 of the Securities Act. Our Parent has used and intends to use the net proceeds from the program to temporarily repay borrowings under our Operating Partnership’s Global Revolving Credit Facilities, to acquire additional properties or businesses, to fund development opportunities and for working capital and other general corporate purposes, including potentially for the repayment of other debt or the repurchase, redemption or retirement of outstanding debt securities. Since June 30, 2025, Digital Realty Trust, Inc. generated net proceeds of approximately $501 million from the issuance of approximately 2.9 million common shares under the 2024 Sales Agreement at an average price of $172.46 per share after payment of approximately $2.9 million of commissions to the agents. As of October 29, 2025, approximately $2.0 billion remains available for future sales under the 2024 Sales Agreement Amendment.\nWe believe our Operating Partnership’s sources of working capital, specifically its cash flow from operations, and funds available under its Global Revolving Credit Facility are adequate for it to make its distribution payments to our Parent and, in turn, for our Parent to make its dividend payments to its stockholders. However, we cannot assure you that our Operating Partnership’s sources of capital will continue to be available at all or in amounts sufficient to meet its needs, including making distribution payments to our Parent. The lack of availability of capital could adversely affect our Operating Partnership’s ability to pay its distributions to our Parent, which would, in turn, adversely affect our Parent’s ability to pay cash dividends to its stockholders.\nFuture Uses of Cash — Parent\nOur Parent may from time to time seek to retire, redeem or repurchase its equity or the debt securities of our Operating Partnership or its subsidiaries through cash purchases and/or exchanges for equity securities in open market purchases, privately negotiated transactions or otherwise. Such repurchases, redemptions or exchanges, if any, will depend on prevailing market conditions, our liquidity requirements, contractual restrictions or other factors. The amounts involved may be material.\nDividends and Distributions — Parent\nOur Parent is required to distribute 90% of its taxable income (excluding capital gains) on an annual basis to continue to qualify as a REIT for U.S. federal income tax purposes. Our Parent intends to make, but is not contractually bound to make, regular quarterly distributions to its common stockholders from cash flow from our Operating Partnership’s operating activities. While historically our Parent has satisfied this distribution requirement by making cash distributions to its stockholders, it may choose to satisfy this requirement by making distributions of cash or other property. All such distributions are at the discretion of our Parent’s Board of Directors. Our Parent considers market factors and our Operating Partnership’s performance in addition to REIT req"
}