{
  "source_file": "dltr-20250201.htm",
  "form_type": "10-K",
  "item1_clean": "We are a leading operator of retail discount stores operating under the brand names of Dollar Tree and Dollar Tree Canada. At February 1, 2025, we operated 8,628 stores across 48 states and the District of Columbia and operated 253 stores across five Canadian provinces.\nWe believe the convenience and value we offer, as well as the “thrill-of-the-hunt” shopping experience where customers discover new celebratory and seasonal items every week, are key factors in serving and growing our base of loyal customers. We are committed to growing our business through new store openings, expanded geographies, improved product offerings, store renovations and remodeling, investments in our workforce and other initiatives to modernize and optimize our stores, our supply chain and distribution network and our technology. These initiatives are discussed further below and in “\nItem 7. Management’s Discussion and Analysis of Financial Condition and Results of Operations\nDiscontinued Operations\nFamily Dollar stores provide customers with a selection of competitively-priced merchandise in convenient neighborhood stores, primarily serving a lower-than-average income customer in urban and rural locations. At February 1, 2025, the Family Dollar business included the operations of 7,622 general merchandise retail discount stores and ten distribution centers.\nAs previously reported, in fiscal 2024 we initiated a formal review of strategic alternatives for the Family Dollar business. This strategic alternatives review concluded in the fourth quarter of fiscal 2024 and resulted in the decision to sell the Family Dollar business. Accordingly, the Family Dollar business met the held for sale and discontinued operations accounting criteria. On March 25, 2025, the Company entered into a definitive agreement to sell the Family Dollar business to Brigade Capital Management, LP and Macellum Capital Management, LLC, for a purchase consideration of $1,007.0 million, subject to a number of adjustments, including with respect to working capital and net indebtedness. The closing of the transaction is subject to satisfaction of customary closing conditions, including receipt of U.S. antitrust approval. Net proceeds are estimated to total approximately $804.0 million.\nto our consolidated financial statements under the caption “Assets Held for Sale and Discontinued Operations” and\nOur core values drive how we treat our customers and each other to support a welcoming shopping experience and an engaging work environment. At every level of our organization, we build our culture by serving with accountability, inspiring belonging, championing empowerment, operating with excellence, and acting with integrity. We focus our ways of working on open, frequent communication and approach our roles with a continuous improvement mindset. Our communication vehicles foster two-way dialogue and offer continuous touchpoints for associates to hear about our strategy, values and ways of working, to learn from senior leaders about our business progress and connect with one another. Additionally, our people programs, as well as our meaningful focus on culture and belonging, reinforce our shared values and behaviors. For more information, see the “Our People” section below.\nOur stores serve customers with a broad range of income levels principally in suburban locations, striving continuously to “Wow” the customer with a compelling, fun and fresh merchandise assortment comprised of a variety of things the customer wants and needs, all at incredible values in bright, clean and friendly stores.\nIn our Dollar Tree stores, we continue to expand our brand assortment at the $1.25 price point to provide greater value to our customers and increase customer traffic and store productivity. We are continuing to expand our multi-price product assortment, which began with the introduction of $3 and $5 products in select discretionary categories, expanded into $3, $4 and $5 frozen and refrigerated product, and now comprises a wide assortment of other consumable and discretionary product at varying price points. Through a partnership with Instacart, our customers can shop online and receive same-day delivery from more than 7,400 Dollar Tree stores, as of February 1, 2025, without having to visit a store.\nIn our Dollar Tree Canada stores, we generally sell items for $1.75(CAD) or less. Our revenue and assets in Canada are not material.\nWe strive to exceed our customers’ expectations for product variety and quality by offering items we believe typically sell for higher prices elsewhere, and we believe our mix of imported and domestic merchandise is critical to this end. In addition, direct\nrelationships with manufacturers permit us to select from a broad range of products and customize packaging, product sizes and package quantities that best meet our customers’ needs. Merchandise imported directly typically accounts for approximately 40% of our total retail value purchases, with the remaining merchandise purchased domestically. Among our foreign suppliers, China is the source of a vast majority of our direct imports and we believe that a significant portion of our goods purchased from domestic vendors is imported. Our domestic purchases include basic, home, closeouts and promotional merchandise.\nOur stores predominantly range from 8,000 - 10,000 selling square feet. We carry approximately 8,600 items in our stores, and as of the end of fiscal 2024 approximately 33% of our items were automatically replenished. The remaining items are either allocated to the stores or managed by direct store delivery (“DSD”) vendors. Through automatic replenishment, store-specific allocations and DSD vendors, each store is able to satisfy the demands of their particular customer base.\nWe maintain a balanced selection of products within traditional variety store categories. We offer a wide selection of everyday basic products and we supplement these with seasonal, closeout and promotional merchandise. We attempt to keep certain basic consumable merchandise in our stores continuously to establish our stores as a destination and increase traffic in our stores. Closeout and promotional merchandise is purchased opportunistically and represents less than 10% of our purchases.\nThe merchandise mix in our stores consists of:\nConsumable merchandise, which includes everyday consumables such as household paper and chemicals, food, candy, health and personal care products, and in most stores, frozen and refrigerated food;\nDiscretionary merchandise includes the following:\nVariety merchandise, which includes toys, durable housewares, gifts, stationery, party goods, greeting cards, softlines, arts and crafts supplies and other items; and\nSeasonal goods, which include, among others, Christmas, Easter, Halloween and Valentine’s Day merchandise.\nFor information regarding the amounts and percentages of our net sales contributed by the above merchandise categories for the last three fiscal years, please refer to\nto our consolidated financial statements.\nMarketing & Retail Media\nOur marketing mission is to surprise and delight our customer with great value, assortment, and treasure hunt excitement. We believe the customer experience is extremely important to our marketing plan success and our ability to drive incremental business. Our marketing efforts are primarily focused on driving store traffic by providing value to our customers through our new advanced digital targeting capabilities, genuine and authentic brand building via social influencers and posts, showcasing amazing assortment in our digital ads, creating a robust web and app customer experience, and utilizing in-store signage to help educate customers and drive conversion.\nWe believe our substantial buying power and our flexibility in making sourcing decisions contributes to our successful purchasing strategy, which includes targeted merchandise margin goals by category. We also believe our ability to negotiate with our vendor partners enables us to manage the margin impact of economic pressures. We primarily buy products on an order-by-order basis and have no material long-term purchase contracts or other assurances of continued product supply or guaranteed product cost. Historically, no merchandise vendor has accounted for more than 10% of total merchandise purchased by the company.\nA strong and efficient distribution network is critical to our ability to grow and to maintain a low-cost operating structure. We currently operate 15 distribution centers in the United States. New distribution sites are strategically located to reduce the distance between the distribution centers and stores, maintain flexibility and improve efficiency in our store service areas. As part of our efforts to scale our distribution network to support future store growth, we plan to convert the Odessa, Texas Family Dollar distribution center to a Dollar Tree distribution center in the second quarter of fiscal 2025. We continue to make investments in our truck fleet, transportation management systems and a new RotaCart delivery process to streamline the truck unloading and store delivery process. A RotaCart is a wheeled container that allows quick, easy store deliveries loaded by merchandise category. The RotaCarts are nestable, allowing for easy return to the distribution centers.\nOur stores receive approximately 90% of their inventory from our distribution centers. The remaining store inventory, primarily perishable consumable items and other vendor-maintained display items, are delivered directly to our stores from vendors or third party distributors. For more information on our distribution center network, see “",
  "item7_clean": "Item 7. Management’s Discussion and Analysis of Financial Condition and Results of Operations\nWe cannot assure you that the results, events and circumstances reflected in the forward-looking statements will be achieved or occur, and actual results, events or circumstances could differ materially from those described in the forward-looking statements. Moreover, new risks and uncertainties emerge from time to time and it is not possible for us to predict all risks and uncertainties that could have an impact on our forward-looking statements.\nInvestors should also be aware that while we do, from time to time, communicate with securities analysts and others, it is against our policy to disclose to them any material, nonpublic information or other confidential commercial information. Accordingly, shareholders should not assume that we agree with any statement or report issued by any securities analyst regardless of the content of the statement or report. Furthermore, we have a policy against confirming projections, forecasts or opinions issued by others. Thus, to the extent that reports issued by securities analysts contain any projections, forecasts or opinions, such reports are not our responsibility.\nUnless otherwise stated, references to “the Company,” “we,” “our” and “us” generally refer to Dollar Tree, Inc. and its direct and indirect subsidiaries on a consolidated basis. Unless specifically indicated otherwise, any references to “fiscal 2025,” “fiscal 2024,” “fiscal 2023,” and “fiscal 2022,” relate to as of or for the years ended January 31, 2026, February 1, 2025, February 3, 2024 and January 28, 2023, respectively.\nPART I\nWe are a leading operator of retail discount stores operating under the brand names of Dollar Tree and Dollar Tree Canada. At February 1, 2025, we operated 8,628 stores across 48 states and the District of Columbia and operated 253 stores across five Canadian provinces.\nWe believe the convenience and value we offer, as well as the “thrill-of-the-hunt” shopping experience where customers discover new celebratory and seasonal items every week, are key factors in serving and growing our base of loyal customers. We are committed to growing our business through new store openings, expanded geographies, improved product offerings, store renovations and remodeling, investments in our workforce and other initiatives to modernize and optimize our stores, our supply chain and distribution network and our technology. These initiatives are discussed further below and in “\nItem 7. Management’s Discussion and Analysis of Financial Condition and Results of Operations\nDiscontinued Operations\nFamily Dollar stores provide customers with a selection of competitively-priced merchandise in convenient neighborhood stores, primarily serving a lower-than-average income customer in urban and rural locations. At February 1, 2025, the Family Dollar business included the operations of 7,622 general merchandise retail discount stores and ten distribution centers.\nAs previously reported, in fiscal 2024 we initiated a formal review of strategic alternatives for the Family Dollar business. This strategic alternatives review concluded in the fourth quarter of fiscal 2024 and resulted in the decision to sell the Family Dollar business. Accordingly, the Family Dollar business met the held for sale and discontinued operations accounting criteria. On March 25, 2025, the Company entered into a definitive agreement to sell the Family Dollar business to Brigade Capital Management, LP and Macellum Capital Management, LLC, for a purchase consideration of $1,007.0 million, subject to a number of adjustments, including with respect to working capital and net indebtedness. The closing of the transaction is subject to satisfaction of customary closing conditions, including receipt of U.S. antitrust approval. Net proceeds are estimated to total approximately $804.0 million.\nto our consolidated financial statements under the caption “Assets Held for Sale and Discontinued Operations” and\nOur core values drive how we treat our customers and each other to support a welcoming shopping experience and an engaging work environment. At every level of our organization, we build our culture by serving with accountability, inspiring belonging, championing empowerment, operating with excellence, and acting with integrity. We focus our ways of working on open, frequent communication and approach our roles with a continuous improvement mindset. Our communication vehicles foster two-way dialogue and offer continuous touchpoints for associates to hear about our strategy, values and ways of working, to learn from senior leaders about our business progress and connect with one another. Additionally, our people programs, as well as our meaningful focus on culture and belonging, reinforce our shared values and behaviors. For more information, see the “Our People” section below.\nOur stores serve customers with a broad range of income levels principally in suburban locations, striving continuously to “Wow” the customer with a compelling, fun and fresh merchandise assortment comprised of a variety of things the customer wants and needs, all at incredible values in bright, clean and friendly stores.\nIn our Dollar Tree stores, we continue to expand our brand assortment at the $1.25 price point to provide greater value to our customers and increase customer traffic and store productivity. We are continuing to expand our multi-price product assortment, which began with the introduction of $3 and $5 products in select discretionary categories, expanded into $3, $4 and $5 frozen and refrigerated product, and now comprises a wide assortment of other consumable and discretionary product at varying price points. Through a partnership with Instacart, our customers can shop online and receive same-day delivery from more than 7,400 Dollar Tree stores, as of February 1, 2025, without having to visit a store.\nIn our Dollar Tree Canada stores, we generally sell items for $1.75(CAD) or less. Our revenue and assets in Canada are not material.\nWe strive to exceed our customers’ expectations for product variety and quality by offering items we believe typically sell for higher prices elsewhere, and we believe our mix of imported and domestic merchandise is critical to this end. In addition, direct\nrelationships with manufacturers permit us to select from a broad range of products and customize packaging, product sizes and package quantities that best meet our customers’ needs. Merchandise imported directly typically accounts for approximately 40% of our total retail value purchases, with the remaining merchandise purchased domestically. Among our foreign suppliers, China is the source of a vast majority of our direct imports and we believe that a significant portion of our goods purchased from domestic vendors is imported. Our domestic purchases include basic, home, closeouts and promotional merchandise.\nOur stores predominantly range from 8,000 - 10,000 selling square feet. We carry approximately 8,600 items in our stores, and as of the end of fiscal 2024 approximately 33% of our items were automatically replenished. The remaining items are either allocated to the stores or managed by direct store delivery (“DSD”) vendors. Through automatic replenishment, store-specific allocations and DSD vendors, each store is able to satisfy the demands of their particular customer base.\nWe maintain a balanced selection of products within traditional variety store categories. We offer a wide selection of everyday basic products and we supplement these with seasonal, closeout and promotional merchandise. We attempt to keep certain basic consumable merchandise in our stores continuously to establish our stores as a destination and increase traffic in our stores. Closeout and promotional merchandise is purchased opportunistically and represents less than 10% of our purchases.\nThe merchandise mix in our stores consists of:\nConsumable merchandise, which includes everyday consumables such as household paper and chemicals, food, candy, health and personal care products, and in most stores, frozen and refrigerated food;\nDiscretionary merchandise includes the following:\nVariety merchandise, which includes toys, durable housewares, gifts, stationery, party goods, greeting cards, softlines, arts and crafts supplies and other items; and\nSeasonal goods, which include, among others, Christmas, Easter, Halloween and Valentine’s Day merchandise.\nFor information regarding the amounts and percentages of our net sales contributed by the above merchandise categories for the last three fiscal years, please refer to\nto our consolidated financial statements.\nMarketing & Retail Media\nOur marketing mission is to surprise and delight our customer with great value, assortment, and treasure hunt excitement. We believe the customer experience is extremely important to our marketing plan success and our ability to drive incremental business. Our marketing efforts are primarily focused on driving store traffic by providing value to our customers through our new advanced digital targeting capabilities, genuine and authentic brand building via social influencers and posts, showcasing amazing assortment in our digital ads, creating a robust web and app customer experience, and utilizing in-store signage to help educate customers and drive conversion.\nWe believe our substantial buying power and our flexibility in making sourcing decisions contributes to our successful purchasing strategy, which includes targeted merchandise margin goals by category. We also believe our ability to negotiate with our vendor partners enables us to manage the margin impact of economic pressures. We primarily buy products on an order-by-order basis and have no material long-term purchase contracts or other assurances of continued product supply or guaranteed product cost. Historically, no merchandise vendor has accounted for more than 10% of total merchandise purchased by the company.\nA strong and efficient distribution network is critical to our ability to grow and to maintain a low-cost operating structure. We currently operate 15 distribution centers in the United States. New distribution sites are strategically located to reduce the distance between the distribution centers and stores, maintain flexibility and improve efficiency in our store service areas. As part of our efforts to scale our distribution network to support future store growth, we plan to convert the Odessa, Texas Family Dollar distribution center to a Dollar Tree distribution center in the second quarter of fiscal 2025. We continue to make investments in our truck fleet, transportation management systems and a new RotaCart delivery process to streamline the truck unloading and store delivery process. A RotaCart is a wheeled container that allows quick, easy store deliveries loaded by merchandise category. The RotaCarts are nestable, allowing for easy return to the distribution centers.\nOur stores receive approximately 90% of their inventory from our distribution centers. The remaining store inventory, primarily perishable consumable items and other vendor-maintained display items, are delivered directly to our stores from vendors or third party distributors. For more information on our distribution center network, see “\nDistribution services in Canada are provided by a third party from two facilities, one in British Columbia and one in Ontario.\nFor information on the impact of seasonality, see “\nItem 1A. Risk Factors\nItem 7. Management’s Discussion and Analysis of Financial Condition and Results of Operations\nWe operate in the value retail sector, which is currently and in the future expected to continue to be highly competitive with respect to price, store location, merchandise quality, assortment and presentation, and customer service, including merchandise delivery and checkout options. Our competitors include dollar stores, mass merchandisers, online retailers, discount retailers, drug stores, convenience stores, independently-operated discount stores, grocery stores and a wide variety of other retailers. These other retail companies operate stores in many of the areas where we operate, and many of them engage in extensive advertising and marketing efforts. We believe we differentiate ourselves from other retailers by providing high-value, high-quality, low-cost merchandise in attractively-designed stores that are conveniently located.\nGovernment Regulation\nWe are subject to a wide variety of local, state and federal laws and regulations within the United States and Canada. These laws and regulations relate to, among other things, the operation of our facilities and the sale of products, including without limitation product and food safety, marketing and labeling; labor and employment, including wage and hour, benefits, healthcare and workplace safety; pricing; antitrust and fair competition; privacy and information security; tariff and trade; energy and environmental protection; financial reporting and disclosure; licensing; intellectual property; and taxes. We routinely incur significant compliance-related costs, both direct and indirect, with respect to these laws and regulations which may have a material effect on our capital expenditures, earnings or competitive position. For more information, see “\nItem 1A. Risk Factors\nIntellectual Property\nWe are the owners of several trademarks including “Dollar Tree,” the “Dollar Tree” logo, and other names and designs of certain merchandise sold in our stores. Our trademarks are generally valid and may be renewed indefinitely as long as they are in use and/or their registrations are properly maintained.\nOur business success, customer satisfaction and employee engagement are built upon our dedicated associates who work and live in the communities we serve. Our goal is to provide a work environment that is welcoming and inclusive, offers competitive pay and benefits, supports growth and development, and affirms our corporate values. We recruit and hire in the communities we serve using associate referrals, local job fairs and social media as well as local community service partners to provide part-time and full-time jobs that can become lasting careers. Our Human Resources team, with oversight from our Board of Directors and its committees, develops and executes programs for compensation and benefits, onboarding and training, professional and leadership development, performance management, recognition and succession planning.\nWe show care for our people by investing in their personal well-being and professional growth through a variety of people programs and initiatives, including:\nCompensation, benefits and well-being.\nWe are committed to providing market-competitive pay for all positions, and we are a pay-for-performance organization, offering performance-based compensation opportunities at nearly all levels of the organization, including certain hourly-paid positions. We strive to ensure gender and racial pay equity for associates performing equal or substantially similar work. Eligible associates can participate in our Retirement Savings Plan, which provides a dollar-for-dollar match on the first 5% of associate contributions, and all associates can participate in our Employee Stock Purchase Plan. All full-time and part-time associates are eligible for health and welfare benefits, including medical, dental and vision. Associates may be eligible for other benefits including educational assistance, disability and life insurance as well as paid maternity and parental leave. Financial support to associates recovering from natural disasters and personal hardships as well as a scholarship program for associates with children pursuing higher education are also available. Associates are offered the flexibility to advance their payday earnings to meet their personal bills and expenses.\nTalent development and retent",
  "item2_clean": null
}