{
  "source_file": "dltr-20251101.htm",
  "form_type": "10-Q",
  "item1_clean": null,
  "item7_clean": null,
  "item2_clean": "Item 2. Management’s Discussion and Analysis of Financial Condition and Results of Operations.\nCautionary Note Regarding Forward-Looking Statements\nThis document contains “forward-looking statements” as that term is used in the Private Securities Litigation Reform Act of 1995. Forward-looking statements can be identified by the fact that they address future events, developments and results and do not relate strictly to historical facts. Any statements contained herein that are not statements of historical facts may be deemed to be forward-looking statements. Forward-looking statements include, without limitation, statements preceded by, followed by or including words such as “believe,” “anticipate,” “expect,” “intend,” “plan,” “view,” “target” or “estimate,” “may,” “will,” “should,” “predict,” “possible,” “potential,” “continue,” “strategy,” and similar expressions. For example, our forward-looking statements include, without limitation, statements regarding:\nOur plans and expectations regarding our current and future strategic initiatives, including our operational strategy for Dollar Tree as a standalone business following the sale of Family Dollar;\nOur merchandising plans and initiatives and related impacts, including those regarding our multi-price offerings and product assortment;\nOur cost management initiatives, including our mitigation strategies to offset the impact of cost pressures and inflation, and the financial and business impacts of those strategies;\nOur long-term approach to managing selling, general and administrative expenses;\nOur plans to add, refresh and renovate stores, improve store standards and operations, and optimize and modernize stores and shelf space;\nOur customer connection and customer’s response to our product offerings, value and shopping experience;\nOur expectations regarding the implementation and impact of investments in supply chain, distribution facilities, warehouse, inventory, transportation and human capital management systems, including new distribution centers, the expansion or conversion of existing distribution centers, and the capabilities of our distribution center network;\nOur expectations regarding the implementation and impact of investments in our technology infrastructure;\nThe design and implementation of key control activities around updated systems and various investments and initiatives;\nOur plans and expectations regarding the sale of the Family Dollar business, including those regarding the estimated proceeds and tax benefits therefrom and the transition services agreement;\nThe potential effect of general business or economic conditions on our business and our customers, including the direct and indirect effects of inflation and interest rates on our business;\nThe direct and indirect impacts of and challenges associated with the current and potential tariff environment;\nOur plans to mitigate the impact of current and potential tariffs and related implementation costs;\nThe expected and possible outcome, costs, and impact of pending or potential litigation, arbitrations, other legal proceedings or governmental investigations, our plans regarding these matters, and the availability of indemnification or insurance with respect to such matters;\nThe impacts of recent legislation, including those affecting various tax regulations, and accounting principles; and\nOur capital allocation priorities, liquidity and cash needs, including our ability to fund our future capital expenditures and working capital requirements.\nOur profitability is vulnerable to cost pressures from increases in merchandise, shipping, freight and fuel costs, wage and benefit and other operating costs.\nRisks associated with merchandise supply, including tariffs and other trade-related measures, restrictions and policies and any retaliatory counter measures, could adversely affect our financial performance.\nOur tariff mitigation strategies could subject us to increased costs and other risks.\nHigher costs and disruptions in our distribution network could have an adverse impact on our sales and profitability.\nWe may stop selling or recall certain products for safety-related or other issues.\nWe could experience a decline in consumer confidence and spending because of concerns about the quality and safety of our products or our brand standards.\nInflation, other changes in economic conditions or consumer spending habits could impact our sales or profitability.\nOur growth is dependent on our ability to increase sales in existing stores and to expand our square footage profitably.\nOur profitability is affected by the mix of products we sell.\nOur business is seasonal, and adverse events during the fourth quarter could materially affect our full-year financial results.\nFailure to protect our inventory or other assets from loss and theft may impact our financial results.\nWe have risks related to the security of our facilities including risks of personal injury to customers or associates.\nWe face significant pressure from competitors which may reduce our sales and profits.\nOur business could be adversely affected if we fail to manage our organizational talent and capacity, including attracting and retaining qualified associates and key personnel.\nWe rely on third parties in many aspects of our business, which creates additional risk.\nWe may not be successful in anticipating the impacts of implementing, achieving or realizing the benefits of our strategies, initiatives and long-term goals, which may have an adverse impact on our business and financial results.\nOur growth and profitability is dependent on our customer’s response to our initiatives, including multi-price assortments, pricing initiatives, and store standards.\nThe completion of the sale of the Family Dollar business is subject to various risks and uncertainties, including those related to the estimated proceeds therefrom and transition services agreement income, and may be disruptive to our business operations and adversely affect our profitability.\nWe may not achieve the anticipated benefits of the sale of the Family Dollar business, and the transaction may expose us to new risks.\nWe have incurred and may in the future incur losses due to impairment of goodwill and other long-lived assets.\nWe make estimates and assumptions in connection with the preparation of our consolidated financial statements, and any changes to those estimates and assumptions could adversely affect our results of operations.\nWe rely on computer and technology systems in our operations, and any material failure, inadequacy, interruption or security failure of those systems, including because of a cyberattack, could harm our ability to effectively operate and grow our business and could adversely affect our financial results.\nThe potential unauthorized access to our systems could disrupt operations or lead to the theft of data which may violate privacy laws and could damage our business reputation, subject us to negative publicity, litigation and costs, and adversely affect our results of operations or financial condition.\nLegal proceedings may adversely affect our reputation, business, results of operations or financial condition.\nOur failure to comply with applicable law, or to adequately respond to changes to such laws, could increase our expenses, expose us to legal risks or otherwise adversely affect us.\nOur business is subject to evolving disclosure requirements and expectations with respect to environmental, social and governance matters that could expose us to numerous risks.\nOur inability to access credit or capital markets, a downgrade of our credit ratings and/or increases in interest rates could negatively affect our financing costs, results of operations and financial condition.\nOur business or the value of our common stock could be negatively affected as a result of actions by shareholders.\nThe price of our common stock is subject to market and other conditions and may be volatile.\nCertain provisions in our Articles of Incorporation and By-Laws could delay or discourage a change of control transaction that may be in a shareholder’s best interest.\nWe cannot assure you that the results, events and circumstances reflected in the forward-looking statements will be achieved or occur, and actual results, events or circumstances could differ materially from those described in the forward-looking statements. Moreover, new risks and uncertainties emerge from time to time and it is not possible for us to predict all risks and uncertainties that could have an impact on our forward-looking statements.\nInvestors should also be aware that while we do, from time to time, communicate with securities analysts and others, it is against our policy to disclose to them any material, nonpublic information or other confidential commercial information. Accordingly, shareholders should not assume that we agree with any statement or report issued by any securities analyst regardless of the content of the statement or report. Furthermore, we have a policy against confirming projections, forecasts or opinions issued by others. Thus, to the extent that reports issued by securities analysts contain any projections, forecasts or opinions, such reports are not our responsibility.\nWe are a leading operator of more than 9,200 retail discount stores, as of November 1, 2025, offering merchandise predominantly at the opening price point of $1.25, with additional offerings at higher price points.\nOur net sales are derived from the sale of merchandise. Two major factors tend to affect our net sales trends. First is our success at opening new stores. Second is the performance of stores once they are open which can be impacted by a number of factors including operational performance, competition, inflation, consumer buying preference and changes in the product assortment, pricing, or quality. Sales vary at our existing stores from one year to the next. We refer to this as a change in comparable s"
}