{
  "source_file": "peak-20241231.htm",
  "form_type": "10-K",
  "item1_clean": "88% of our lab properties were triple-net leased (based on leased square feet).\nDuring the year ended December 31, 2024, we had various lab tenants that each represented 1% or less of total revenues.\nContinuing care retirement community, or CCRC\nCCRCs are retirement communities that include independent living, assisted living, memory care, and skilled nursing units to provide a continuum of care in an integrated campus. Our CCRCs are owned through RIDEA structures, which is permitted by the Housing and Economic Recovery Act of 2008, and includes most of the provisions previously proposed in the REIT Investment Diversification and Empowerment Act of 2007. The services provided by our third-party manager-operators under a RIDEA structure at our properties are primarily paid for by the residents directly or through private insurance and are less reliant on government reimbursement programs such as Medicare and Medicaid.\nA RIDEA structure allows us, through a taxable REIT subsidiary (“TRS”), to receive cash flow from the operations of a healthcare facility in compliance with REIT tax requirements. The criteria for operating a healthcare facility through a RIDEA structure require us to lease the facility to an affiliate TRS and for such affiliate TRS to engage an independent qualifying management company (also known as an eligible independent contractor or third-party operator) to manage and operate the day-to-day business of the facility in exchange for a management fee. As a result, under a RIDEA structure, we are required to rely on a third-party operator to hire and train all facility employees, enter into third-party contracts for the benefit of the facility, including resident/patient agreements, comply with laws, including healthcare laws, and provide resident care. We are substantially limited in our ability to control or influence day-to-day operations under a RIDEA structure, and thus rely on the third-party operator to manage and operate the business.\nThrough our TRS entities, we bear all operational risks and liabilities associated with the operation of these properties, with limited exceptions, such as a third-party operator’s gross negligence or willful misconduct. These operational risks and liabilities include those relating to any employment matters of our operator, compliance with healthcare and other laws, liabilities relating to personal injury-tort matters, resident-patient quality of care claims, and any governmental reimbursement matters, even though we have limited ability to control or influence our third-party operators’ management of these risks.\nThe management agreements we have in RIDEA structures related to CCRCs have original terms ranging from 10 to 15 years, with mutual renewal options. There are base management fees and incentive management fees payable to our third-party operators if operating results of the RIDEA properties exceed pre-established thresholds. Conversely, there are also provisions in the management agreements that reduce management fees payable to our third-party operators if operating results do not meet certain pre-established thresholds.\nCCRCs are different from other housing and care options for seniors because they typically provide written agreements or long-term contracts between residents and the communities (frequently lasting the term of the resident’s lifetime), which offer a continuum of housing, services, and healthcare on one campus or site. CCRCs are appealing as they allow residents to “age in place” and typically the individual is independent and in relatively good health upon entry.\nAs third-party operators manage our RIDEA properties in exchange for the receipt of a management fee, we are not directly exposed to the credit risk of these operators in the same manner or to the same extent as a triple-net tenant.\nOther non-reportable segment\nAt December 31, 2024, we had the following investments in our other non-reportable segments: (i) our unconsolidated joint venture with a sovereign wealth fund that owns 19 senior housing assets (which we refer to as our SWF SH JV) and (ii) loans receivable.\nThe properties in our SWF SH JV are owned through RIDEA structures and include independent living facilities and assisted living facilities, which cater to different segments of the elderly population based upon their personal needs. These facilities are often in apartment-like buildings with private residences ranging from single rooms to large apartments.\nInvesting in real estate serving the healthcare industry is highly competitive. We face competition from other REITs, investment companies, pension funds, private equity investors, sovereign funds, healthcare operators, lenders, developers, and other institutional investors, some of whom may have greater flexibility (e.g., non-REIT competitors), greater resources, and lower costs of capital than we do. Increased competition and resulting capitalization rate compression, as well as the impacts of inflation and higher interest rates, make it more challenging for us to identify and successfully capitalize on opportunities that meet our objectives. Our ability to compete may also be impacted by global, national, and local economic trends, availability of investment alternatives, availability and cost of capital, construction and renovation costs, existing laws and regulations, new legislation, and population trends.\nIncome from our investments depends on our tenants’ and operators’ ability to compete with other companies on multiple levels, including: (i) the quality of care provided, (ii) reputation, (iii) success of product or drug development, (iv) price, (v) the range of services offered, (vi) the physical appearance of a property, (vii) alternatives for healthcare delivery, (viii) the supply of competing properties, (ix) physicians, (x) staff, (xi) referral sources, (xii) location, (xiii) the size and demographics of the population in surrounding areas, and (xiv) the financial condition of our tenants and operators. For a discussion of the risks associated with competitive conditions affecting our business, see “Item 1A, Risk Factors” in this report.\nGovernment Regulation, Licensing, and Enforcement\nOur healthcare facility operators (which include our TRS entities when we use a RIDEA structure) and tenants are subject to extensive and complex federal, state, and local healthcare laws and regulations relating to quality of care, licensure and certificate of need, resident rights (including abuse and neglect), consumer protection, government reimbursement, fraud and abuse practices, and similar laws governing the operation of healthcare facilities. We expect the healthcare industry, in general, will continue to face increased regulation and pressure in the areas of fraud, waste and abuse, cost control, healthcare management, and provision of services, among others. Federal, state, and local officials are increasingly focusing their efforts on enforcement of these laws and regulations. In addition, our operators are subject to a variety of laws, regulations, and executive orders, including those relating to operators’ response to Covid and other infectious diseases, which can vary based on the provider type and jurisdiction, complicating compliance efforts. These regulations are wide ranging and can subject our tenants and operators to civil, criminal, and administrative sanctions, including enhanced or additional penalties, sanctions, and other adverse actions that may arise under new regulations adopted in response to Covid. Affected tenants and operators may find it increasingly difficult to comply with this complex and evolving regulatory environment because of a relative lack of guidance in many areas as certain of our healthcare properties are subject to oversight from several government agencies, and the laws may vary from one jurisdiction to another. Changes in laws, regulations, reimbursement enforcement activity, and regulatory non-compliance by our tenants and operators can all have a significant effect on their operations and financial condition, which in turn may adversely impact us, as detailed below and set forth under “Item 1A, Risk Factors” in this report.\nThe following is a discussion of certain laws and regulations generally applicable to our operators, and in certain cases, to us.\nFraud and Abuse Enforcement\nThere are various extremely complex U.S. federal and state laws and regulations governing healthcare providers’ referrals, relationships and arrangements and prohibiting fraudulent and abusive practices by such providers. These laws include: (i) U.S. federal and state false claims acts, which, among other things, prohibit providers from filing false claims or making false statements to receive payment from Medicare, Medicaid, or other U.S. federal or state\n\nthe licensed operators of our U.S. long-term care facilities that participate in government reimbursement programs are required to have compliance and ethics programs that meet the requirements of federal laws and regulations relating to the Social Security Act. Where we have used a RIDEA structure, we are dependent on management companies to fulfill our compliance obligations, and we have developed a program to periodically monitor compliance with such obligations. Investigation by a federal or state governmental body for violation of fraud and abuse laws or imposition of any of these penalties upon one of our operators could jeopardize that operator’s business, reputation, and ability to operate.\nLaws and Regulations Governing Privacy and Security\nThere are various U.S. federal and state privacy laws and regulations, including the privacy and security rules contained in the Health Insurance Portability and Accountability Act of 1996 (commonly referred to as “HIPAA”), that provide for the privacy and security of personal health information. An increasing focus of the U. S. Federal Trade Commission’s (“FTC’s”) consumer protection regulation is the impact of technological change on protection of consumer privacy. The FTC, as well as state attorneys general, have taken enforcement action against companies that do not abide by their representations to consumers regarding electronic security and privacy. To the extent we or our affiliated operating entities are a covered entity or business associate under HIPAA and the Health Information Technology for Economic and Clinical Health Act (the “HITECH Act”), compliance with those requirements require us to, among other things, conduct a risk analysis, implement a risk management plan, implement policies and procedures, and conduct employee training. In most cases, we are dependent on our tenants and management companies to fulfill our compliance obligations, and we have developed a program to periodically monitor compliance with such obligations. Because of the far reaching nature of these laws, there can be no assurance we would not be required to alter one or more of our systems and data security procedures to be in compliance with these laws. Our failure to protect health information could subject us to civil or criminal liability and adverse publicity, and could harm our business and impair our ability to attract new customers and residents. We may be required to notify individuals, as well as government agencies and the media, if we experience a data breach.\nFurther, as reliance on technology has increased, so have the risks posed to those systems. Parties that provide us with services essential to our operations must continuously monitor and develop their networks and information technology to prevent, detect, address, and mitigate the risk of unauthorized access, misuse, computer viruses, and social engineering, such as phishing. Our tenants and management companies are continuously working, including with the aid of third-party service providers, to install new, and to upgrade existing, network and information technology systems, to create p",
  "item7_clean": "ended December 31, 2024, the following projects were placed in service: (i) a portion of two lab development projects with total project costs of $83 million, (ii) two outpatient medical development projects with total project costs of $62 million, (iii) one outpatient medical development project held in a consolidated joint venture of which our share of total project costs was $22 million, (iv) one lab redevelopment building held in one of our unconsolidated South San Francisco JVs of which our share of total project costs was $15 million, (v) one lab redevelopment project with total project costs of $14 million, (vi) a portion of one lab redevelopment project with total project costs of $13 million, and (vii) a portion of one lab redevelopment building held in one of our unconsolidated South San Francisco JVs of which our share of total project costs was $9 million.\nFinancing Activities\nIn March 2024, we executed a $750 million five year unsecured term loan (the “2029 Term Loan”) as an incremental facility under the term loan agreement. In January 2024, we entered into forward-starting interest rate swap instruments on the 2029 Term Loan which are designated as cash flow hedges and establish a blended fixed effective interest rate of 4.66%.\nDuring the year ended December 31, 2024, we repurchased 10.5 million shares of our common stock under our 2022 Share Repurchase Program (as defined below) at a weighted average price of $17.98 per share for a total of $188 million.\nIn February 2025, we repaid $348 million aggregate principal amount of 3.40% senior unsecured notes at maturity.\nDuring the year ended December 31, 2024, we refinanced one of our existing seller financing loans receivable, extended the maturity date to August 2027, and received aggregate partial principal repayments of $74 million.\nDuring the year ended December 31, 2024, we executed an early lease renewal for approximately 2 million square feet leased by CommonSpirit Health, which is subject to a master agreement, which extended the weighted average lease term of existing leases from July 2027 to December 2035, amended the contractual rents to current market rates, and increased the annual contractual lease escalations from 2.5% to 3.0%.\nIn January 2025, we received full repayment of: (i) the $48 million outstanding balance of one of our seller financing loans receivable and (ii) the $15 million outstanding balance of one secured loan with an original maturity of July 2027.\nQuarterly common stock cash dividends paid during 2024 aggregated to $1.20 per share. On February 3, 2025, our Board of Directors declared a quarterly common stock cash dividend of $0.305 per share, reflecting an increase from $0.30 to $0.305 per share. The dividend will be paid on February 26, 2025 to stockholders of record as of the close of business on February 14, 2025.\nResults of Operations\nWe evaluate our business and allocate resources among our operating segments: (i) outpatient medical, (ii) lab, (iii) CCRC, (iv) an interest in our unconsolidated SWF SH JV, and (v) loans receivable. Our operating segments are aggregated into the following reportable segments: (i) outpatient medical, (ii) lab, and (iii) CCRC. Under the outpatient medical and lab segments, we own, operate, and develop outpatient medical buildings, hospitals, and lab buildings. Our CCRCs are operated through RIDEA structures. The SWF SH JV and loans receivable are non-reportable segments that have been presented on a combined basis herein. We evaluate performance based upon property adjusted net operating income (“Adjusted NOI” or “Cash NOI”) in each segment. The accounting policies of the segments are the same as those described in the summary of significant accounting policies in Note 2 to the Consolidated Financial Statements.\nNon-GAAP Financial Measures\nAdjusted NOI is a non-U.S. generally accepted accounting principles (“GAAP”) supplemental financial measure used to evaluate the operating performance of real estate. Adjusted NOI represents real estate revenues (inclusive of rental and related revenues, resident fees and services, and government grant income and exclusive of interest income), less property level operating expenses; Adjusted NOI excludes all other financial statement amounts included in net income (loss) as presented in Note 16 to the Consolidated Financial Statements. Adjusted NOI eliminates the effects of straight-line rents, amortization of market lease intangibles, termination fees, actuarial reserves for insurance claims that have been incurred but not reported, and the impact of deferred community fee income and expense. Adjusted NOI is calculated as Adjusted NOI from consolidated properties, plus our share of Adjusted NOI from unconsolidated joint ventures (calculated by applying our actual ownership percentage for the period), less noncontrolling interests’ share of Adjusted NOI from consolidated joint ventures (calculated by applying our actual ownership percentage for the period). We utilize our share of Adjusted NOI in assessing our performance as we have various joint ventures that contribute to our performance. Our share of Adjusted NOI should not be considered a substitute for, and should only be considered together with and as a supplement to, our financial information presented in accordance with GAAP.\nAdjusted NOI is oftentimes referred to as “Cash NOI.” Management believes Adjusted NOI is an important supplemental measure because it provides relevant and useful information by reflecting only income and operating expense items that are incurred at the property level and presents them on an unlevered basis. We use Adjusted NOI to make decisions about resource allocations, to assess and compare property level performance, and to evaluate our Merger-Combined Same-Store (“Merger-Combined SS”) performance, as described below. We believe that net income (loss) is the most directly comparable GAAP measure to Adjusted NOI. Adjusted NOI should not be viewed as an alternative measure of operating performance to net income (loss) as defined by GAAP since it does not reflect various excluded items. Further, our definition of Adjusted NOI may not be comparable to the definitions used by other REITs or real estate companies, as they may use different methodologies for calculating Adjusted NOI.\nAs described in Note 16 to the Consolidated Financial Statements, our chief operating decision maker (“CODM”) evaluates the performance of our operating segments based on Adjusted NOI. Our operating segments are aggregated into reportable segments for which we disclose Total Portfolio Adjusted NOI for our reportable segments. For further information, including information reconciling our Adjusted NOI for reportable segments to our income (loss) before income taxes and equity income (loss) from unconsolidated joint ventures, refer to Note 16 to the Consolidated Financial Statements.\nOperating expenses generally relate to leased outpatient medical and lab buildings, as well as CCRC facilities. We generally recover all or a portion of our leased outpatient medical and lab property expenses through tenant recoveries, which are recognized within rental and related revenues.\nMerger-Combined Same-Store Adjusted NOI\nMerger-Combined Same-Store Adjusted NOI includes legacy Physicians Realty Trust properties that met the same-store criteria as if they were owned by the Company for the full analysis period. This information allows our investors, analysts, and us to evaluate the performance of our property portfolio under a consistent population by eliminating changes in the composition of our portfolio of properties, excluding properties within the other non-reportable segments. We include properties from our consolidated portfolio, as well as properties owned by our unconsolidated joint ventures in Adjusted NOI (see Adjusted NOI definition above for further discussion regarding our use of pro-rata share information and its limitations). Merger-Combined Same-Store Adjusted NOI excludes government grant income under the CARES Act, amortization of deferred revenue from tenant-funded improvements, and certain non-property specific operating expenses that are allocated to each operating segment on a consolidated basis.\nProperties are included in Merger-Combined Same-Store once they are fully operating for the entirety of the comparative periods presented. A property is removed from Merger-Combined Same-Store when it is classified as held for sale, sold, placed into redevelopment, experiences a casualty event that significantly impacts operations, or a significant tenant relocates from a Merger-Combined Same-Store property to a Merger-Combined non Same-Store property and that change results in a corresponding increase in revenue. We do not report Merger-Combined Same-Store metrics for our other non-reportable segments.\nManagement believes that continued reporting of the same-store portfolio for only pre-merger Healthpeak Properties, Inc. offers minimal value to investors who are seeking to understand the operating performance and growth potential of the Combined Company. The Company was provided access to the underlying financial statements of legacy Physicians Realty Trust (which financial statements have been audited or, in the case of interim periods, reviewed) and other detailed information about each property, such as the acquisition date. Based on this available information, the Company was able to consistently apply its same-store definition across the combined portfolio. As a result of the Merger, approximately 97% of the combined portfolio is represented in the Merger-Combined Same-Store presentation for the outpatient medical segment for the year ended December 31, 2024.\nFor a reconciliation of Merger-Combined Same-Store to total portfolio Adjusted NOI and other relevant disclosures by segment, refer to our Segment Analysis below.\n. Funds from Operations (“FFO”), as defined by the National Association of Real Estate Investment Trusts (“Nareit”), is net income (loss) applicable to common shares (computed in accordance with GAAP), excluding gains or losses from sales of depreciable property, including any current and deferred taxes directly associated with sales of depreciable property, impairments of, or related to, depreciable real estate, plus real estate-related depreciation and amortization, and adjustments to compute our share of Nareit FFO from joint ventures. Adjustments for joint ventures are calculated to reflect our pro rata share of both our consolidated and unconsolidated joint ventures. We reflect our share of Nareit FFO for unconsolidated joint ventures by applying our actual ownership percentage for the period to the applicable reconciling items on an entity by entity basis. For consolidated joint ventures in which we do not own 100%, we reflect our share of the equity by adjusting our Nareit FFO to remove the third-party ownership share of the applicable reconciling items based on actual ownership percentage for the applicable periods. Our pro rata share information is prepared on a basis consistent with the comparable consolidated amounts, is intended to reflect our proportionate economic interest in the operating results of properties in our portfolio and is calculated by applying our actual ownership percentage for the period. We do not control the unconsolidated joint ventures, and the pro rata presentations of reconciling items included in Nareit FFO do not represent our legal claim to such items. The joint venture members or partners are entitled to profit or loss allocations and distributions of cash flows according to the joint venture agreements, which provide for such allocations generally according to their invested capital.\nThe presentation of pro rata information has limitations, which include, but are not limited to, the following: (i) the amounts shown on the individual line items were derived by applying our overall economic ownership interest percentage determined when applying the equity method of accounting and do not necessarily represent our legal claim to the assets and liabilities, or the revenues and expenses and (ii) other companies in our industry may calculate their pro rata interest differently, limiting the usefulness as a comparative measure. Because of these limitations, the pro rata financial information should not be considered independently or as a substitute for our financial statements as reported under GAAP. We compensate for these limitations by relying primarily on our GAAP financial statements, using the pro rata financial information as a supplement.\nWe believe Nareit FFO applicable to common shares and diluted Nareit FFO applicable to common shares are important supplemental non-GAAP measures of operating performance for a REIT. Because the historical cost accounting convention used for real estate assets utilizes straight-line depreciation (except on land), such accounting presentation implies that the value of real estate assets diminishes predictably over time. Since real estate values instead have historically risen and fallen with market conditions, presentations of operating results for a REIT that use historical cost accounting for depreciation could be less informative. The term Nareit FFO was designed by the REIT industry to address this issue.\nNareit FFO does not represent cash generated from operating activities in accordance with GAAP, is not necessarily indicative of cash available to fund cash needs and should not be considered an alternative to net income (loss). We compute Nareit FFO in accordance with the current Nareit definition; however, other REITs may report Nareit FFO differently or have a different interpretation of the current Nareit definition from ours. For a reconciliation of net income (loss) to Nareit FFO and other relevant disclosures, refer to “Non-GAAP Financial Measures Reconciliations” below.\nIn addition, we present Nareit FFO on an adjusted basis before the impact of non-comparable items including, but not limited to, transaction and merger-related items, other impairments (recoveries) and other losses (gains), restructuring and severance-related charges, prepayment costs (benefits) associated with early retirement or payment of debt, litigation costs (recoveries), casualty-related charges (recoveries), deferred tax asset valuation allowances, and changes in tax legislation (“FFO as Adjusted”). These adjustments are net of tax, when applicable, and are reflective of our share of our joint\nventures. Adjustments for joint ventures are calculated to reflect our pro rata share of both our consolidated and unconsolidated joint ventures. We reflect our share of FFO as Adjusted for unconsolidated joint ventures by applying our actual ownership percentage for the period to the applicable reconciling items on an entity by entity basis. We reflect our share for consolidated joint ventures in which we do not own 100% of the equity by adjusting our FFO as Adjusted to remove the third-party ownership share of the applicable reconciling items based on actual ownership percentage for the applicable periods. See “Nareit FFO” above for further disclosures regarding our use of pro rata share information and its limitations. Transaction and merger-related items include transaction expenses and gains/charges incurred as a result of mergers and acquisitions and lease amendment or termination activities. Prepayment costs (benefits) associated with early retirement of debt include the write-off of unamortized deferred financing fees, or additional costs, expenses, discounts, make-whole payments, penalties or premiums incurred as a result of early retirement or payment of debt. Other impairments (recoveries) and other losses (gains) include interest income associated with early and partial repayments of loans receivable and other losses or gains associated with non-depreciable assets including goodwill, undeve",
  "item2_clean": null
}