{
  "source_file": "dov-20241231.htm",
  "form_type": "10-K",
  "item1_clean": "We are committed to driving superior shareholder returns through three key tenets of our corporate strategy.\n, we are committed to achieving organic sales growth above that of gross domestic product (4% to 6% annually on average) over a long-term business cycle, absent prolonged adverse economic conditions, complemented by growth through strategic acquisitions.\n, we continue to focus on improving returns on capital, as well as earnings margin, by enhancing our operational capabilities and making investments across the organization in growth capacity expansion, digital capabilities, automation, operations management, information technology (\"IT\"), shared services (including Dover Business Services and our India Innovation Center), and talent. We also focus on continuous, effective cost management and productivity initiatives, such as supply chain optimization, automation and productivity capital expenditures, e-commerce and digital go-to-market, restructuring, product complexity reduction, improved footprint utilization, strategic pricing and portfolio management.\n, we aim to generate growth in free cash flow and earnings per share through strong earnings performance, productivity improvements and active working capital management, which is enhanced by opportunistic divestitures allowing for concentration on growing our core platforms. Dover prioritizes deploying free cash flow toward high-return and high-confidence organic reinvestments aimed at growing, improving and strengthening our businesses, as well as through inorganic investments that synergistically enhance the quality of our portfolio. Dover's value creation strategy is supported by a financial policy that includes a prudent approach to financial leverage, and a disciplined approach to capital allocation that allows for a balance between reinvestment and return of capital to shareholders through growing dividends and opportunistic share repurchases.\nWe support achievement of these goals by (1) aligning management compensation with strategic and financial objectives, (2) actively managing our portfolio to increase enterprise scale, improving business mix over time to markets with secular growth characteristics, and pursuing acquisitions that fit the characteristics of an ideal Dover business and (3) investing in talent development programs.\nCharacteristics of a Dover Business\nFor over 70 years, Dover has successfully and profitably operated a diversified portfolio of high-quality businesses serving a wide variety of industrial and business-to-business end markets with different business models. We believe this diversity is a strength of our portfolio, providing Dover with multiple avenues for organic and inorganic growth, lower cyclicality, and the ability to extract synergies of common ownership. While we expect our portfolio to remain diversified, we also strive to shape the portfolio over time to increase common attractive attributes across our businesses.\nDover is adept at operating businesses within two core operating models:\nComponent Businesses\n: Many of our businesses produce critical components that represent a small portion of a larger system by cost. For example, our industrial and biopharma pumps, biopharma connectors, engineered bearings and compression components, clean energy components, and heat exchangers are all part of larger systems built or employed by our customers. Such components typically serve demanding applications where value-in-use and costs and risks of switching far exceed the cost of the component itself.\nEquipment with Aftermarket Opportunity\n: Many of our businesses produce complex and highly engineered equipment and systems that require a significant and predictable volume of parts, consumables, software and services over their life cycle. For example, our marking and coding equipment, plastics and polymer processing equipment and aluminum can-making equipment all derive a significant share of revenue and profits from sale of consumables, parts and services into their large installed base. Recurring demand, which includes parts, consumables, services and software, represents approximately 36% of our revenue.\nWe see the following commonalities characterizing the majority of Dover businesses:\n: Our businesses generally operate in strategically attractive niche industrial markets with proven and well-understood long-term growth trends, favorable customer and supplier landscapes, mature and incrementally improving technologies with opportunities for technological differentiation, and highly loyal customers, suppliers or channel partners.\n: Our businesses are long-time leaders in their respective markets and have consistently enjoyed customer bases that choose products primarily based on their performance, track record, safety and compliance.\n: Our equipment and components are often complemented by value-added digital applications, including connected products, sensors, digital controls and industry-specific software that create new sources of value for our customers.\nAttractive Financial Profile\n: Our businesses exhibit attractive financial profiles, characterized by predictable, stable revenue, low capital intensity, strong cash-flow and sustainable returns on invested capital well in excess of our cost of capital.\nDover seeks to create value for shareholders by combining the global scale and capabilities, as well as access to capital, of a diversified industrial enterprise with the agility and entrepreneurial dynamism of niche manufacturing businesses. We believe the centralized scale of the corporation provides a distinct competitive advantage to our individual operating businesses through (i) driving efficiency gains and economies of scale of shared global resources across the corporation, (ii) freeing management time and effort to focus on the most important aspects of their businesses, including servicing and addressing the critical needs of their customers, aligning their business to capitalize on key market trends and focusing on product excellence, and (iii) access to centralized talent and expertise that our individual operating businesses otherwise may not have on their own. To achieve our stated goals, we are focused on executing the following pillars of Dover's business strategy:\nCapturing growth potential in our end-markets and adjacent market segments\nDover’s business segments are focused on building enduring competitive advantages and leadership positions in markets we believe are positioned for sustained future growth. We believe our businesses are among the top suppliers in most markets and niches we serve (as defined by customer applications, geographies or products), which positions us well to capture future growth. We capitalize on our engineering, intellectual property, technology and design expertise, and maintain an intense focus on meeting the needs of our customers and on adding significant, and often new, value to their operations through\nsuperior product performance, safety, reliability, and a commitment to aftermarket support. We cultivate and maintain an entrepreneurial culture to enable business agility, and continuously innovate to address our customers' needs, to help them win in the markets they serve.\nIn particular, our businesses are well-positioned to capitalize on: growing industrial manufacturing and trade volumes; an increased global focus on digitization and automation in industrial processes; increasing requirements for sustainability, safety, energy efficiency and consumer product safety; and growth of the middle class and consumption in emerging economies.\nOur Engineered Products segment is capitalizing on global infrastructure investment, an increasing number of vehicles in operation, average car age and annual miles driven, increasing digitization and sensorization of modern vehicles, as well as growing defense spending related to signal intelligence and electronic warfare.\n\nFrom time to time, we have sold or divested some of our businesses based on changes in specific market outlook, structural changes in financial performance, value-creation potential, or for other strategic considerations, which include an effort to reduce our exposure to cyclical and capital intensive markets and, therefore, focus on our higher margin and higher growth spaces.\nGoing forward, we recognize that some businesses in Dover's portfolio may have a greater value-creation potential if owned by another parent with a larger presence and focus on a given niche. We pragmatically consider such opportunities as part of our ongoing portfolio management and review processes, and execute divestitures if the value created by the divestiture is\ndetermined to be at an appropriate premium to the value of such business to Dover and the divestitures allow Dover shareholders to participate in the future value-creation potential from a change in ownership, including through the redeployment of divestiture proceeds into attractive add-on businesses in higher priority end-markets or through opportunistic return of capital to shareholders.\nDuring 2022 and 2023, there were no material dispositions.\nOn March 31, 2024, the Company completed the sale of the De-Sta-Co business, an operating company within the Engineered Products segment, for total consideration, net of cash transferred, of $675.9 million. The sale did not meet the criteria to be classified as a discontinued operation, as it did not represent a strategic shift that would have a major effect on operations and financial results.\nOur Engineered Products segment provides a wide range of equipment, components, software, solutions and services that have broad customer applications across a number of markets, including: aftermarket vehicle service, aerospace and defense, industrial winch and hoist, and fluid dispensing. Our vehicle service business provides equipment, software solutions and services used primarily in vehicle repair and maintenance, including light and heavy-duty vehicle lifts, wheel service equipment, vehicle diagnostics and vehicle collision repair solutions. Our industrial winch and hoist business provides a range of winches, hoists, bearings, drives, and electric monitoring systems for infrastructure and other industrial markets. Our aerospace and defense business supplies radio frequency and microwave filters and switches, as well as signals intelligence and other integrated solutions, to enable secure communications in aerospace and defense applications. The segment also includes bench top soldering and fluid dispensing solutions in electronics and industrial product assembly markets.\nOur Engineered Products segment's products are manufactured primarily in North America, Europe and Asia and are sold throughout the world directly and through a network of distributors.\nClean Energy & Fueling\nOur Clean Energy & Fueling segment provides components, equipment and software, and service solutions enabling safe storage, transport, handling and dispensing of clean and traditional fuels, cryogenic gases and other hazardous fluids, as well as safe and efficient operation of retail fueling and vehicle wash establishments across the globe. Among solutions supplied by the segment are dispensing equipment and components for gasoline, compressed natural gas (CNG), liquefied natural gas (LNG) and hydrogen (H2) fueling sites, electric vehicle charging stations, payment systems, hardware and underground containment systems, vehicle wash systems, as well as asset tracking, monitoring and operational optimization software.\nOur Clean Energy & Fueling segment's products are manufactured primarily in North America, Europe, Asia, and South America and are sold throughout the world directly and through a network of distributors.\nImaging & Identification\nThe companies in our Imaging & Identification segment are global suppliers of precision marking and coding, product traceability, brand protection, and digital textile printing ",
  "item7_clean": "Revenue for the year ended December 31, 2024 increased $61.4 million, or 0.8% to $7.7 billion compared with 2023. Organic revenue remained flat as pricing actions and broad-based demand across most of the portfolio were offset by lower shipments of beverage can-making equipment, polymer processing equipment, and European heat exchangers. The increase in revenue was driven by acquisition-related growth of 3.0% primarily in our Clean Energy & Fueling and Pumps & Process Solutions segments, partially offset by a disposition-related decline of 2.0% in our Engineered Products segment and an unfavorable impact from foreign currency translation of 0.2%. Customer pricing favorably impacted revenue in 2024 by approximately 1.6% and by 3.8% in the prior year.\nRevenue for the year ended December 31, 2023 decreased $159.7 million, or 2.0% to $7.7 billion compared with 2022. Organic revenue decline of 2.8% was primarily due to general reduction in our customers' and distribution channels' inventory levels that resulted from lead time normalization and higher inventory carrying costs driven by interest rate increases. Acquisition-related growth increased by 1.0% primarily driven by our Pumps & Process Solutions segment, offset by an unfavorable impact from foreign currency translation of 0.2%. Customer pricing favorably impacted revenue in 2023 by approximately 3.8% and by 6.7% in the prior year.\nGross profit for the year ended December 31, 2024, increased $91.1 million, or 3.2%, to $3.0 billion compared with 2023, primarily driven by positive product mix, pricing and productivity actions. Gross profit margin increased 90 basis points to 38.2% as compared to the prior year driven by benefits from mix, pricing, price versus cost dynamics and productivity initiatives, partially offset by inflationary headwinds, acquisition integration costs and lower volumes across some of the Company's businesses.\nGross profit for the year ended December 31, 2023, decreased $37.4 million, or 1.3%, to $2.9 billion compared with 2022, primarily due to lower volumes across some end markets, partially offset by positive market conditions in certain secular growth-exposed businesses, as well as pricing, productivity initiatives and restructuring actions. Gross profit margin increased 30 basis points to 37.3% as compared to the prior year driven by benefits from pricing, productivity and restructuring actions, partially offset by lower volumes across some of the Company's businesses.\nSelling, General and Administrative Expenses\nSelling, general and administrative expenses for the year ended December 31, 2024 increased $104.1 million, or 6.3% to $1.8 billion compared with 2023, primarily driven by increased employee compensation and benefits and acquisition-related amortization. As a percentage of revenue, selling, general and administrative expenses increased 120 basis points to 22.6%, reflecting an increase in expense which exceeded the increase in the revenue base.\nSelling, general and administrative expenses for the year ended December 31, 2023 increased $22.9 million, or 1.4% to $1.6 billion compared with 2022, primarily driven by increased restructuring, employee compensation and benefits and acquisition-related transaction and integration costs, partially offset by lower contract labor costs. As a percentage of revenue, selling, general and administrative expenses increased 70 basis points to 21.4%, reflecting a decrease in the revenue base.\nResearch and development costs, including qualifying engineering costs, are expensed when incurred and amounted to $149.6 million, $139.1 million and $151.4 million for the years ended December 31, 2024, 2023 and 2022, respectively. These costs as a percent of revenue were 1.9%, 1.8% and 1.9% for the years December 31, 2024, 2023 and 2022, respectively.\nInterest Expense, net\nFor the year ended December 31, 2024, interest expense, net of interest income, decreased $23.8 million, or 20.2%, to $94.0 million compared with 2023 primarily due to interest income generated by the proceeds from the sale of ESG held in highly liquid short-term investments.\n\nITEM 7. MANAGEMENT'S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS\nThroughout this MD&A, we refer to measures used by management to evaluate performance, including a number of financial measures that are not defined under accounting principles generally accepted in the United States of America (\"GAAP\"). Please see \"Non-GAAP Disclosures\" at the end of this Item 7 for further detail on these financial measures. We believe these measures provide investors with important information that is useful in understanding our business results and trends. Reconciliations within this MD&A provide more details on the use and derivation of these measures.\nOVERVIEW\nDover Corporation is a diversified global manufacturer and solutions provider delivering innovative equipment and components, consumable supplies, aftermarket parts, software and digital solutions and support services.\nFor the year ended December 31, 2024, consolidated revenue was $7.7 billion, an increase of $61.4 million or 0.8%, as compared to the prior year. The increase is driven by acquisition-related growth of 3.0%, partially offset by a disposition-related decline of 2.0% and an unfavorable impact from foreign currency translation of 0.2%. The results were driven by acquisitions, solid demand across most end markets and strategic pricing initiatives.\nOrganic revenue remained flat due to increases of 8.2%, 2.6%, 2.4%, and 1.4% in our Engineered Products, Clean Energy & Fueling, Imaging & Identification, and Pumps & Process Solutions segments, respectively, offset by the Climate & Sustainability Technologies segment which declined 11.2%. For further information, see \"Segment Results of Operations\" within this Item 7.\nFrom a geographic perspective, organic revenue for the U.S., our largest market, grew 3.8% as compared to the prior year, driven by broad-based growth primarily in our Engineered Products and Clean Energy & Fueling segments. Revenue in Asia and Europe declined 7.1% and 3.1%, respectively, while revenue in Other Americas grew 5.6%. All other geographic markets declined 17.4% organically year over year.\nBookings increased 7.3% over the prior year to $7.7 billion for the year ended December 31, 2024. This included organic bookings growth of 6.5% and acquisition-related growth of 3.2%, partially offset by a disposition-related decline of 2.1% and an unfavorable impact from foreign currency translation of 0.3%.\nRestructuring and other costs of $85.0 million included restructuring charges of $69.8 million and other costs of $15.2 million. Restructuring and other costs were primarily related to headcount reductions and product line and other exit costs in the Clean Energy & Fueling and Climate & Sustainability Technologies segments. Other costs (benefits) were primarily due to non-cash asset impairment charges and reorganization costs in the Climate & Sustainability Technologies and Imaging & Identification segments, respectively. For further discussion related to our restructuring and other costs, see \"Restructuring and Other Costs (Benefits),\" within this Item 7.\nDuring the year ended December 31, 2024, the Company completed eight business acquisitions for approx\n\nClean Energy & Fueling revenue for the year ended December 31, 2023 decreased $90.2 million, or 4.8%, compared to the prior year, attributable to an organic decline of 4.0% and an unfavorable impact from foreign currency translation of 0.8%. Customer pricing favorably impacted revenue in 2023 by approximately 4.3%.\nThe organic revenue decline was primarily due to reduced year-over-year demand in above ground retail fueling equipment, due to the expected roll-off of EMV-related demand in the first half of the year, as well as general reduction in our customers' inventory across our distribution channels, as higher interest rates increased its carrying costs. This was partially offset by pricing actions aimed at mitigating material cost inflation and strong demand in our fluid transfer solutions and hydrogen and liquefied natural gas clean energy businesses.\nClean Energy & Fueling segment earnings for the year ended December 31, 2023 decreased $24.4 million, or 6.9%, compared to the prior year. The decrease was primarily due to reduced organic volumes, unfavorable foreign currency translation, and increased material, logistics and labor costs, partially offset by pricing, productivity initiatives, and the benefits from restructuring actions. Segment margin decreased to 18.4% from 18.8% in the prior year.\nImaging & Identification\nOur Imaging & Identification segment supplies precision marking and coding, product traceability, brand protection and digital textile printing equipment, as well as related consumables, software and services to the global packaged and consumer goods, pharmaceutical, industrial manufacturing, textile and other end-markets.\n\npartially offset by an unfavorable impact from foreign currency translation. Segment margin increased to 26.5% from 24.4% in the prior year.\nOverall bookings for the year ended December 31, 2024\nincreased 2.0%, comprised of an organic growth of 2.6% and acquisition-related growth of 0.8%, partially offset by an unfavorable impact from foreign currency translation of 1.4%. The organic bookings growth was primarily driven by favorable demand trends in our marking and coding businesses. Segment book-to-bill was 1.01.\nImaging & Identification revenue for the year ended December 31, 2023 decreased $7.1 million, or 0.6% compared to the prior year, comprised of an unfavorable impact from foreign currency translation of 0.8%, partially offset by organic growth of 0.2%. Customer pricing favorably impacted revenue in 2023 by approximately 5.0%.\nThe organic revenue growth was primarily driven by customer pricing and growth in serialization software, partially offset by reduced customer investments in new marking and coding equipment, along with lower textile printer shipments caused by high energy prices and macro uncertainty in textile producing regions.\nImaging & Identification segment earnings for the year ended December 31, 2023 increased $4.4 million, or 1.7%, compared to the prior year. This increase was primarily driven by pricing initiatives and productivity actions, partially offset by an unfavorable impact from foreign currency translation, organic volume reductions, and material and labor cost inflation. Segment margin increased to 24.4% from 23.9% in the prior year.\nPumps & Process Solutions\nOur Pumps & Process Solutions segment manufactures specialty pumps and flow meters, fluid transfer connectors, highly engineered precision components, instruments and digital controls for rotating and reciprocating machines, and polymer processing equipment, serving single-use biopharmaceutical production, diversified industrial manufacturing applications, chemical production, plastics and polymer processing, midstream and downstream oil and gas, clean energy markets, thermal management, food and beverage, semiconductor production and medical applications and other end-markets.\n\nClimate & Sustainability Technologies\nrevenue for the year ended December 31, 2023 increased $40.9 million, or 2.4%, compared to the prior year, reflecting an organic revenue growth of 2.4% and acquisition-related growth of 0.2%, partially offset by an unfavorable impact from foreign currency translation of 0.2%. Customer pricing favorably impacted revenue in 2023 by approximately 3.7%.\nThe organic revenue growth\nwas principally driven by strong demand and pricing initiatives in most markets. Our heat exchanger business grew in U.S. commercial HVAC and industrial markets, and growth in European shipments for heat pumps. Retail refrigeration revenue also increased from the prior year, driven by customer pricing actions, large system refurbishment programs and growing demand for low-GWP CO\nrefrigerant systems, partially offset by lower shipments in the interest rate sensitive convenience store market. Beverage can-making business revenues modestly decreased from the prior year due to expected year over year revenue reductions beginning in the fourth quarter driven by reduced orders for new beverage can-making equipment as large can-maker customers focused on scaling production and growing utilization of recent capacity additions.\nClimate & Sustainability Technologies segment earnings for the year ended\nDecember 31, 2023 increased $50.9 million, or 20.0%, compared to the prior y\near. The segment earnings increase was driven by customer pricing actions, product mix and significant benefits from productivity initiatives, partially offset by higher labor costs. Segment\nmargin increased to 17.2% from 14.6%\nReconciliation of Segment Earnings to Earnings from Continuing Operations\n\nDuring the year ended December 31, 2022, restructuring charges of $30.5 million were primarily due to headcount reductions and facility consolidations resulting from restructuring programs initiated in 2021 and 2022, including non-cash foreign currency translation losses due to substantial liquidation of businesses. Other costs (benefits), net of $5.7 million, were primarily due to write-off of assets in connection with an exit from certain Latin America countries in our Climate & Sustainability Technologies segment. These restructuring and other charges were recorded in cost of goods and services and selling, general and administrative expenses in the consolidated statement of earnings.\nWe recorded the following restructuring and other costs for the year\nYear Ended December 31, 2022\n(dollars in thousands)\nClean Energy & Fueling\nImaging & Identification\nPumps & Process Solutions\nClimate & Sustainability Technologies\nOther costs (benefits), net\nRestructuring and other costs\nPurchase Accounting Expenses\nPurchase accounting expenses primarily relate to amortization of acquired assets and charges related to fair value step-ups for acquired inventory sold during the period. These expenses are not presented in our segment earnings because they are excluded from the segment operating performance measure reviewed by management. These expenses reconcile to segment earnings as follows:\nYears Ended December 31,\n(dollars in thousands)\nPurchase accounting expenses\nClean Energy & Fueling\nImaging & Identification\nPumps & Process Solutions\nClimate & Sustainability Technologies\nPurchase accounting expenses in our Clean Energy & Fueling segment decreased by $18,394 for the year ended December 31, 2023 from the prior year comparable period, which included $18,995 of charges related to fair value step-ups for inventory from the Q4 2021 acquisition of RegO and Acme Cryogenics.\n\nOur estimate of future interest payments on long-term debt is\nbased on the interest rates in effect as of December 31, 2024.\nOperating cash flow and access to capital markets are expected to satisfy our various cash flow requirements, including acquisitions, capital expenditures, purchase obligations, debt maturities and lease obligations. Acquisition spending and/or share repurchases could potentially increase our debt.\nWe believe that existing sources of liquidity are adequate to meet anticipated funding needs at current risk-based interest rates for the foreseeable future.\nFinancial Instruments and Risk Management\nThe diverse nature of our businesses' activities necessitates the management of various financial and market risks, including those related to changes in interest rates, foreign currency exchange rates and commodity prices. We periodically use derivative financial instruments to manage some of these risks. We do not hold or issue derivative instruments for trading or speculative purposes. We are exposed to credit loss in the event of nonperformance by counterparties to our financial instrument contracts; however, nonperformance by these counterparties is cons",
  "item2_clean": null
}