{
  "source_file": "dov-20250930.htm",
  "form_type": "10-Q",
  "item1_clean": null,
  "item7_clean": null,
  "item2_clean": "Refer to the section below entitled \"Special Note Regarding Forward-Looking Statements\" for a discussion of factors that could cause our actual results to differ from the forward-looking statements contained below and throughout this quarterly report.\nThroughout this Management’s Discussion and Analysis of Financial Condition and Results of Operations (\"MD&A\"), we refer to measures used by management to evaluate performance, including a number of financial measures that are not defined under accounting principles generally accepted in the United States of America (\"GAAP\"). Please see \"Non-GAAP Disclosures\" at the end of this Item 2 for further detail on these financial measures. We believe these measures provide investors with important information that is useful in understanding our business results and trends. Reconciliations within this MD&A provide more details on the use and derivation of these measures.\nOVERVIEW\nDover is a diversified global manufacturer and solutions provider delivering innovative equipment and components, consumable supplies, aftermarket parts, software and digital solutions, and support services through five operating segments: Engineered Products, Clean Energy & Fueling, Imaging & Identification, Pumps & Process Solutions, and Climate & Sustainability Technologies. The Company's entrepreneurial business model encourages, promotes and fosters deep customer engagement and collaboration, which has led to Dover's well-established and valued reputation for providing superior customer service and industry-leading product innovation. Unless the context indicates otherwise, references herein to \"Dover,\" \"the Company,\" and words such as \"we,\" \"us,\" or \"our\" include Dover Corporation and its consolidated subsidiaries.\nDover's five operating segments are as follows:\nOur Engineered Products segment provides a wide range of equipment, components, software, solutions and services to the vehicle aftermarket, aerospace and defense, industrial winch and hoist, and fluid dispensing end-markets.\nOur Clean Energy & Fueling segment provides components, equipment, software solutions and services enabling safe and reliable storage, transport, dispensing, and remote monitoring of traditional and clean fuels (including liquefied natural gas, hydrogen, and electric vehicle charging), cryogenic gases, and other hazardous substances along the supply chain, and safe and efficient operation of convenience retail, retail fueling and vehicle wash establishments.\nOur Imaging & Identification segment supplies precision marking and coding, product traceability, brand protection and digital textile printing equipment, as well as related consumables, software and services to the global packaged and consumer goods, pharmaceutical, industrial manufacturing, textile and other end-markets.\nOur Pumps & Process Solutions segment manufactures specialty pumps and flow meters, fluid transfer connectors, highly engineered precision components, instruments and digital controls for rotating and reciprocating machines, polymer processing equipment, and measurement, inspection, and control technologies, serving single-use biopharmaceutical production, diversified industrial manufacturing applications, chemical production, plastics and polymer processing, midstream and downstream oil and gas, clean energy markets, thermal management, wire and cable, food and beverage, semiconductor production and medical applications and other end-markets.\nOur Climate & Sustainability Technologies segment is a provider of innovative and energy-efficient equipment, components, solutions, services and parts for the commercial refrigeration, heating and cooling and beverage can-making equipment end-markets.\nIn the third quarter of 2025, revenue was $2.1 billion, which increased $94.3 million, or 4.8%, as compared to the third quarter of 2024. This increase was driven by acquisition-related revenue growth of 3.0%, a favorable impact from foreign currency translation of 1.3% and organic revenue growth of 0.5%. The acquisition-related growth was driven by our acquisitions in the Pumps & Process Solutions and Clean Energy & Fueling segments.\nThe 0.5% organic revenue growth for the third quarter of 2025 was driven by our Pumps & Process Solutions, Clean Energy & Fueling, and Imaging & Identification segments which grew 5.6%, 4.8%, and 3.0%, respectively. The growth was partially offset by the Engineered Products and Climate & Sustainability Technologies segments which declined 7.0% and 6.5%, respectively. For further information, see \"Segment Results of Operations\" within this Item 2.\nFrom a geographic perspective, organic revenue for the U.S., our largest market, increased 1.6% in the third quarter of 2025 compared to the prior year comparable quarter, driven by increased organic revenue in the Pumps & Process Solutions and Clean Energy & Fueling segments. Organic revenue increased for Europe by 1.1%, and decreased for Other Americas and Asia by 6.5%, and 1.5%, respectively.\nBookings were $2.0 billion for the three months ended September 30, 2025, an increase of $146.8 million or 7.9% compared to the prior year comparable quarter. The bookings growth was primarily driven by strong bookings in the Climate & Sustainability Technologies and Pumps & Process Solutions segments.\nRestructuring and other costs for the three months ended September 30, 2025 were $15.9 million, which included restructuring charges of $10.6 million and other costs of $5.3 million. Restructuring and other costs were primarily related to exit costs and headcount reductions in the Climate & Sustainability Technologies, Clean Energy & Fueling, and Pumps & Process Solutions segments. For further discussion related to our restructuring and other costs, see \"Restructuring and Other Costs (Benefits),\" within this Item 2.\nCONSOLIDATED RESULTS OF OPERATIONS\n\nThree Months Ended September 30,\nNine Months Ended September 30,\n(dollars in thousands)\nSegment earnings margin\nOperational metrics:\nComponents of revenue decline:\nForeign currency translation\nTotal revenue decline\nThird Quarter 2025 Compared to the Third Quarter 2024\nClimate & Sustainability Technologies revenue decreased $22.6 million, or 5.2%, as compared to the third quarter of 2024, due to an organic revenue decline of 6.5%, partially offset by a favorable impact from foreign currency translation of 1.3%. Customer pricing favorably impacted revenue in the third quarter of 2025 by approximately 0.5% and by approximately 1.0% in the prior year comparable quarter.\nThe organic revenue decline was primarily due to project timing in retail refrigeration equipment and services, partially offset by demand growth in low-GWP CO\nrefrigerant systems, beverage can-making equipment, and global heat exchanger applications. We expect organic growth in the fourth quarter as strong demand in CO\nrefrigerant systems continues, demand for heat exchangers in data center cooling applications accelerates and headwinds in both European residential heat pumps and refrigerated door cases recover.\nClimate & Sustainability Technologies segment earnings were flat compared to the third quarter of 2024. The flat segment earnings were primarily due to the unfavorable impact from lower volumes, offset by productivity initiatives and the favorable mix impact from CO\nrefrigerant systems growth in retail refrigeration. Segment earnings margin increased to 18.6% from 17.6% in the prior year comparable quarter.\nBookings in the third quarter of 2025 increased 24.8% from the prior year comparable quarter. The bookings increase was driven by sequential improvement in retail refrigeration demand, favorable heat exchanger demand trends and beverage can-making orders. Segment book-to-bill was 1.02.\nNine Months Ended September 30, 2025 Compared to the Nine Months Ended September 30, 2024\nClimate & Sustainability Technologies segment revenue decreased $59.6 million, or 4.8%, compared to the nine months ended September 30, 2024, reflecting an organic revenue decline of 5.4%, partially offset by a favorable foreign currency translation impact of 0.6%. The organic revenue decline for the nine months ended September 30, 2025 was due to project timing in retail refrigeration equipment and services, partially offset by continued strong demand for low-GWP CO\nrefrigerant systems, and improving demand across beverage can-making and heat exchanger applications. Customer pricing favorably impacted revenue in the third quarter of 2025 by approximately 0.3% and 0.2% in the prior year comparable period.\nClimate & Sustainability Technologies segment earnings decreased $0.5 million, or 0.3%, for the nine months ended September 30, 2025, as compared to the prior year comparable period. Segment earnings margin increased to 17.5% from 16.7% in the prior year comparable period. The earnings decrease was primarily due to lower volumes in retail refrigeration equipment and services, partially offset by increased heat exchanger and beverage can-making volumes, productivity initiatives and the favorable mix impact from CO\nrefrigerant systems growth.\nReconciliation of Segment Earnings to Earnings from Continuing Operations\n\nThree Months Ended September 30,\nNine Months Ended September 30,\nEarnings from Continuing Operations:\nClean Energy & Fueling\nImaging & Identification\nPumps & Process Solutions\nClimate & Sustainability Technologies\nTotal segment earnings\nPurchase accounting expenses\nRestructuring and other costs\nGain on dispositions\nCorporate expense / other\nEarnings before provision for income taxes\nProvision for income taxes\nEarnings from continuing operations\nPurchase accounting expenses are primarily comprised of amortization of acquired intangible assets.\nRestructuring and other costs relate to actions taken for headcount reductions, facility consolidations and site closures, product line exits, and other asset charges.\nCertain expenses are maintained at the corporate level and not allocated to the s"
}