{
  "source_file": "dow-20250930.htm",
  "form_type": "10-Q",
  "item1_clean": null,
  "item7_clean": null,
  "item2_clean": "of sold receivables were outstanding. See Note 12 to the Consolidated Financial Statements for additional information.\nThe Company maintains these facilities and also participates in certain customers’ supply chain financing and other early pay programs as a routine source of working capital.\nCompany-Owned Life Insurance\nThe Company has investments in company-owned life insurance (\"COLI\") policies, which are recorded at their cash surrender value as of each balance sheet date. The Company has the ability to monetize its investment in its COLI policies as an additional source of liquidity. At September 30, 2025, the Company had monetized $197 million of its existing COLI policies' surrender value (zero at December 31, 2024). See Note 6 to the Consolidated Financial Statements for additional information.\nShelf Registration - U.S.\nAs the Company continues to maintain its strong balance sheet and financial flexibility, management is focused on net debt (a non-GAAP financial measure), as the Company believes this is the best representation of its financial leverage at this point in time. As shown in the following table, net debt is equal to total gross debt minus \"Cash and cash equivalents\" and \"Marketable securities.\"\nTDCC\nLong-term debt due within one year\n- Cash and cash equivalents\n- Marketable securities\nGross debt as a percent of total capitalization\nNet debt as a percent of total capitalization\nIncluded in \"Other current assets\" in the consolidated balance sheets.\nThe Company may at any time repurchase certain debt securities in the open market or in privately negotiated transactions subject to: the applicable terms under which any such debt securities were issued, certain internal approvals of the Company, and applicable laws and regulations of the relevant jurisdiction in which any such potential transactions might take place. This in no way obligates the Company to make any such repurchases nor should it be considered an offer to do so.\nTDCC's public debt instruments and primary, private credit agreements contain, among other provisions, certain customary restrictive covenant and default provisions. TDCC's most significant debt covenant with regard to its financial position is the obligation to maintain the ratio of its consolidated indebtedness to consolidated capitalization at no greater than 0.70 to 1.00 at any time the aggregate outstanding amount of loans under the Five Year Competitive Advance and Revolving Credit Facility Agreement (\"Revolving Credit Agreement\") equals or exceeds $500 million. The ratio of TDCC's consolidated indebtedness to consolidated capitalization as defined in the Revolving Credit Agreement was 0.46 to 1.00 at September 30, 2025. Management believes TDCC was in compliance with all of its covenants and default provisions at September 30, 2025. For information on TDCC's debt covenants and default provisions, see Note 14 to the Consolidated Financial Statements included in the 2024 10-K. There were no material changes to the debt covenants and default provisions related to TDCC’s outstanding long-term debt and primary, private credit agreements in the first nine months of 2025.\nIn the first quarter of 2025, the Company completed debt neutral liability management activities. The Company issued $1 billion of senior unsecured notes. The offering included $400 million aggregate principal amount of 5.35 percent notes due 2035 and $600 million aggregate principal amount of 5.95 percent notes due 2055. The Company used the proceeds to complete cash tender offers for certain debt securities. In total, $943 million aggregate principal amount was tendered and retired. As a result, the Company recognized a pretax loss of\n$60 million on the early extinguishment of debt, included in \"Sundry income (expense) - net\" in the consolidated statements of income, related to Corporate.\nIn the third quarter of 2025, the Company issued $1.4 billion of senior unsecured notes. The offering included $750 million aggregate principal amount of 4.80 percent notes due 2031 and $650 million aggregate principal amount of 5.65 percent notes due 2036. Additionally, the Company redeemed $55 million aggregate principal amount of 9.40 percent notes due 2039. As a result of the redemption, the Company recognized a pretax loss of $18 million on the early extinguishment of debt, included in \"Sundry income (expense) - net\" in the consolidated statements of income, related to Corporate.\nIn the first nine months of 2025, the Company issued an aggregate principal amount of $252 million of InterNotes\n. Additionally, the Company repaid $125 million of long-term debt at maturity.\nWhile taking into consideration the current economic environment, management expects that the Company will continue to have sufficient liquidity and financial flexibility to meet all of its business obligations.\nAt September 30, 2025, TDCC's credit ratings were as follows:\nBBB\nF2\nP-2\nBBB\nA-2\nOn February 21, 2025, Standard & Poor's affirmed TDCC's BBB and A-2 rating, and revised its outlook to negative from stable. Standard & Poor's decision was made as part of their annual review process and reflects the Company's supportive financial policies, scale, liquidity and cost-advantaged footprint.\nOn July 7, 2025, Moody's Ratings announced a long-term credit rating change for TDCC from Baa1 to Baa2 and affirmed TDCC's P-2 rating and its outlook of negative. On July 31, 2025, Fitch Ratings announced a long-term credit rating change for TDCC from BBB+ to BBB and a short-term credit rating change from F1 to F2, with its outlook remaining stable. The credit rating agencies' decisions were made to reflect the impact of current market conditions on the Company's operating results and cash flow, including the impact of global trade policy uncertainty and capacity additions in the industry, while recognizing the Company's strong asset base, strategic cost actions and long-term commitment to maintaining investment-grade quality.\nDow Inc. has paid dividends on a quarterly basis since the separation from DowDuPont and expects to continue to do so, subject to approval by the Board. On July 24, 2025, the Company announced a 50 percent reduction to its quarterly dividend. The following table summarizes dividends declared and paid to common stockholders of record in 2025:\nDow Inc. Dividends Declared and Paid\nTDCC\nTDCC has committed to fund Dow Inc.'s dividends paid to common stockholders and share repurchases, as approved by the Board, as well as certain governance expenses. Funding is accomplished through intercompany loans. TDCC's Board reviews and determines a dividend distribution to Dow Inc. to settle the intercompany loans. For the three months ended September 30, 2025, TDCC declared a dividend of $240 million and paid a dividend of $252 million to Dow Inc. ($1,225 million of dividend declared and $1,237 million of dividend paid for the nine months\nended September 30, 2025). At September 30, 2025, TDCC's intercompany loan balance with Dow Inc. was insignificant.\nShare Repurchase Program\nOn April 13, 2022, the Board approved a share repurchase program authorizing up to $3 billion for the repurchase of the Company's common stock, with no expiration date. The Company did not repurchase any of its common stock in the third quarter of 2025 (zero in the first nine months of 2025). At September 30, 2025, approximately $931 million of the share repurchase program authorization remained available for repurchases. As previously announced, the Company intends to repurchase shares at a minimum to cover dilution over the economic cycle. The Company may from time to time expand its share repurchases beyond dilution, based on a number of factors including macroeconomic conditions, free cash flow generation, and the Dow share price. Any share repurchases, when coupled with the Company's dividends, are intended to implement the long-term strategy of targeting shareholder remuneration of approximately 65 percent of Operating Net Income over the economic cycle.\nThe Company has both funded and unfunded defined benefit pension plans that cover employees in the United States and a number of other countries. The Company's funding policy is to contribute to funded plans when pension laws and/or economics either require or encourage funding.\nAs part of its ongoing pension derisking initiatives, the Company initiated the termination of certain U.S. tax-qualified pension plans which include the tax-qualified benefit obligations for substantially all employees hired after January 1, 2008, who earned benefits based on a set percentage of annual pay, plus interest. As part of the plan termination process, the Company offered participants of these plans annuity or lump sum distribution options. Final asset distributions are expected to be paid from plan assets in the fourth quarter of 2025. The Company is also pursuing other pension derisking opportunities, including annuitization and risk transfer of certain other pension liabilities. These actions, if executed and inclusive of the termination of certain U.S. tax-qualified pension plans discussed above, are expected to result in non-operating and non-cash settlement charges in the range of $275 million to $350 million in the fourth quarter of 2025.\nSee Note 18 to the Consolidated Financial Statements and Note 19 to the Consolidated Financial Statements included in the 2024 10-K for additional information related to the Company's pension plans.\nThe 2025 Restructuring Program is expected to result in additional cash expenditures of approximately $650 million primarily over the next four years and consist primarily of severance and related benefits costs, implementation costs related to decommissioning and demolition and additional costs associated with exit and disposal activities. Restructuring implementation costs totaled $5 million and $10 million for the three and nine months ended September 30, 2025.\nRestructuring implementation and efficie"
}