{
  "source_file": "dow-20241231.htm",
  "form_type": "10-K",
  "item1_clean": "* Europe, Middle East, Africa and India (\"EMEAI\")\nMajor applications/market segments and products are listed below by business:\nApplications/Market Segments\nHydrocarbons & Energy\nPurchaser of feedstocks; production of cost competitive hydrocarbon monomers utilized by Dow's derivative businesses; and energy, principally for use in Dow’s global operations\nEthylene, propylene, benzene, butadiene, octene, aromatics co-products, power, steam, other utilities\nButane, condensate, ethane, naphtha, natural gas, propane\nChevron Phillips Chemical, ExxonMobil, INEOS, LyondellBasell, SABIC, Shell, Sinopec\nPackaging and Specialty Plastics\nAdhesives; automotive; caps, closures and pipe applications; construction; cosmetics; electrical transmission and distribution; food and supply chain packaging; footwear; health and hygiene; housewares; industrial specialty applications using polyolefin elastomers, ethylene copolymers, and EPDM; irrigation pipe; mobility; photovoltaic encapsulants; sporting goods; telecommunications infrastructure; toys and infant products\nAcrylics, bio-based plasticizers, copolymer, elastomers, ethylene copolymer resins, EPDM, ethylene vinyl acetate (\"EVA\"), methacrylic acid copolymer resins, polyethylene (\"PE\"), high-density polyethylene (\"HDPE\"), low-density polyethylene (\"LDPE\"), linear low-density polyethylene (\"LLDPE\"), polyolefin plastomers, resin additives and modifiers, semiconductive and jacketing compound solutions and wire and cable insulation\nAliphatic solvent, butene, ethylene, hexene, octene, propylene\nBorealis, ExxonMobil, INEOS, Lanxess, LyondellBasell, Nova, SABIC\nThis segment includes a portion of the Company's share of the results of the following joint ventures:\nEQUATE Petrochemical Company K.S.C.C. (“EQUATE”) - a Kuwait-based company that manufactures ethylene, polyethylene and ethylene glycol, and manufactures and markets monoethylene glycol, diethylene glycol and polyethylene terephthalate resins; owned 42.5 percent by the Company.\nThe Kuwait Olefins Company K.S.C.C. (“TKOC”) - a Kuwait-based company that manufactures ethylene and ethylene glycol; owned 42.5 percent by the Company.\nMap Ta Phut Olefins Company Limited (“Map Ta Phut”) - a Thailand-based company that manufactures propylene and ethylene; the Company has an effective ownership of 32.77 percent (of which 20.27 percent is owned directly by the Company and aligned with the Industrial Intermediates & Infrastructure segment and 12.5 percent is owned indirectly through the Company’s equity interest in Siam Polyethylene Company Limited, an entity that is part of The SCGC-Dow Group and aligned with the Packaging & Specialty Plastics segment).\nSadara Chemical Company (\"Sadara\") - a Saudi Arabian company that manufactures chlorine, ethylene, propylene and aromatics for internal consumption and manufactures and sells polyethylene, ethylene oxide and propylene oxide derivative products, and isocyanates; owned 35 percent by the Company. The Company continues to be responsible for marketing a significant portion of Sadara’s products through the Company’s established sales channels. In 2021, Dow and the Saudi Arabian Oil Company agreed to a marketing rights transition plan. Execution of the transition plan is ongoing and progressing towards aligning marketing rights and responsibilities to levels more consistent with each partner's equity ownership. This transition will not impact equity earnings, but is expected to reduce the Company's sales of Sadara products over the transition period.\nThis segment also includes the Company's share of the results of the following joint ventures:\nThe Kuwait Styrene Company K.S.C.C. - a Kuwait-based company that manufactures styrene monomer; owned 42.5 percent by the Company.\nThe SCGC-Dow Group - a group of Thailand-based companies (consisting of Siam Polyethylene Company Limited; Siam Polystyrene Company Limited; Siam Styrene Monomer Company Limited; and Siam Synthetic Latex Company Limited) that manufactures polyethylene, polystyrene, styrene, latex and specialty elastomers; owned 50 percent by the Company.\nCurrent and Future Investments\nThe Company has announced investments that are being progressed over the next several years and are expected to enhance competitiveness. These include:\nConstruction of the world's first net-zero Scope 1 and 2 carbon dioxide equivalent (\"CO\ne\") emissions integrated ethylene and derivatives complex in Alberta, Canada. This project is expected to deliver 2 million metric tons of organic growth in attractive, high-end markets while decarbonizing 20 percent of Dow's global ethylene capacity.\nConstruction of a world-scale polyethylene unit on the U.S. Gulf Coast, based on Dow’s proprietary process technologies, to meet consumer-driven demand in specialty packaging, health and hygiene, and industrial and consumer packaging applications.\nOngoing collaboration with Mura Technology (“Mura”) to help solve the global plastics waste challenge and advance circularity via circular feedstocks, which are converted into recycled plastics.\nThe Company's ambition includes becoming the most sustainable materials science company, with a strategy to advance the well-being of humanity by helping lead the transition to a sustainable planet and society. This includes lowering energy and greenhouse gas (\"GHG\") emissions and further enabling a shift to a circular economy for plastics by focusing on resource efficiency and integrating recycled content and renewable feedstocks into its production processes. Additionally, the Company's Transform the Waste target aims to transform plastic waste and other forms of alternative feedstock to commercialize 3 million metric tons of circular and renewable solutions annually by 2030. As part of that strategy, Dow completed or progressed the following investments in 2024:\nDow acquired Circulus Holdings, LLC, a U.S. mechanical recycling company that converts plastic waste into post-consumer resin. This acquisition includes two facilities in the United States with a total recycling capacity of 50,000 metric tons per year and supports Dow's efforts towards the Transform the Waste target.\nDow completed the sale of its flexible packaging laminating adhesives business in 2024 to Arkema, S.A. The completion of this sale exemplifies Dow's commitment to aligning the Company's portfolio with its growth strategy and circularity platforms.\nDow signed a Memorandum of Understanding (\"MOU\") with Ambipar, a Brazilian multinational and global leader in environmental solutions, to expand the strategic alliance between Dow and Ambipar and help drive transformation of the plastic recycling market in Brazil. By 2030, Dow and Ambipar target leading polyethylene recycling in Brazil, increasing operations from 2,000 metric tons per year to 60,000 metric tons per year.\nDow signed an additional MOU with SCG Chemicals in 2024 to expand its circularity partnership and transform 200,000 metric tons per year of plastic waste into circular products by 2030 in the Asia Pacific geographic region. The partnership supports Dow's efforts towards the Transform the Waste target.\nThe first Mura plant in the United Kingdom commenced commissioning of its 20,000 metric ton advanced recycling facility in the fourth quarter of 2024 and will begin feedstock production in 2025. Dow will be the main recipient of the product produced at this site.\nDow continued to collaborate with X-energy, a nuclear energy innovation company, to advance the design of the previously announced advanced small modular reactor nuclear project at the Seadrift Operations manufacturing site in Texas, which includes developing a construction permit application for submittal to the Nuclear Regulatory Commission. The project is expected to be funded 50 percent by the U.S. Department of Energy under the Advanced Reactor Demonstration Program and will be operated by a subsidiary of NextEra Energy, one of the nation’s major nuclear operators.\nDow continued its collaboration with Hanseatic Energy Hub GmbH (\"HEH\") as a minority stakeholder and is working with HEH's current members to advance Germany's capabilities to import supplies of liquified natural gas, bio-liquified natural gas and synthetic natural gas through the construction of an import terminal. HEH and its shareholders approved the final investment decision for this project on March 4, 2024. The HEH consortium plans to build, own, and operate an import terminal for liquified gases onsite at Dow's Stade, Germany industrial park. The zero-emission terminal will be co-located with Dow's facilities in Stade. Dow is making land available for the construction of the terminal as well as infrastructure services, off-gas heat, site services and mutual harbor use rights.\nDow and privately-held New Energy Blue reached a long-term supply agreement to produce bio-based ethylene from renewable agricultural residues. This is the first agreement in North America to generate plastic sourced materials from corn stover (stalks and leaves), and is the Company's first agreement in North America to utilize agriculture residues for plastic production. Under the terms of the supply agreement, Dow will support the\ndesign of New Energy Freedom, a new facility in the United States that is expected to process corn stover and produce commercial quantities of second-generation ethanol and clean lignin, with nearly half of the ethanol to be turned into bio-based ethylene feedstock reducing CO\ne emissions from plastic production, and using it in recyclable applications across transportation, footwear, and packaging.\nDow and Reciclar S.A. joined forces to build an efficient model for plastic recycling in Argentina that will produce more than 6,500 metric tons of post-consumer plastic resin. This collaboration agreement with Reciclar S.A. spans three years and aims to improve the capacity of Reciclar S.A. to process waste on a larger scale and produce high-quality post-consumer plastic materials under the REVOLOOP\nTM\nDow has several renewable power agreements in place globally that continue to support progress toward its goal to reduce net annual Scope 1 and 2 CO\ne emissions by 5 million metric tons by 2030.\nINDUSTRIAL INTERMEDIATES & INFRASTRUCTURE\nThe Industrial Intermediates & Infrastructure operating segment consists of two customer-centric global businesses - Industrial Solutions and Polyurethanes & Construction Chemicals - that develop important intermediate chemicals that are essential to manufacturing processes, as well as downstream, customized materials and formulations that use advanced development technologies. These businesses primarily produce and market ethylene oxide and propylene oxide derivatives that are aligned to market segments as diverse as appliances; coatings; furniture and bedding; building and construction; mobility; electronics; surfactants for cleaning and sanitization; infrastructure; and oil and gas. The businesses' global scale and reach, world-class technology, research and development capabilities and materials science expertise enable the Company to be a premier solutions provider offering customers value-added sustainable solutions to enhance comfort, energy efficiency, product effectiveness and durability.\nIndustrial Solutions\nIndustrial Solutions provides a broad portfolio of solutions that enable and improve the manufacture of consumer and industrial goods and services. The business’ solutions minimize friction and heat in mechanical processes; manage the oil and water interface; deliver ingredients for maximum effectiveness; facilitate dissolvability; enable product identification; decarbonize oil and gas products; reduce energy intensity, water use and increase efficacy in broad washing applications; and provide the foundational building blocks for the development of chemical technologies. The business supports manufacturers across a large variety of end-markets, notably coatings; detergents and cleaners; crop protection; con",
  "item7_clean": "ITEM 7. MANAGEMENT'S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS\nSTATEMENT ON CURRENCY EXCHANGE RATES\nThe Company's global business operations give rise to market risk exposure related to changes in foreign currency exchange rates and international capital flows that may be affected by extensive regulations and controls, especially in developing or highly inflationary countries such as Argentina. The Company continues to monitor these situations and take appropriate actions as necessary to manage the financial impact pursuant to established guidelines and policies. If the Company is unable to manage certain exposures in a cost-effective manner it could have a significant negative impact on its future results of operations and cash flows. A detailed discussion of these and other principal risks and uncertainties, which may negatively impact the future results of the Company, are included in Part I, Item 1A. Risk Factors.\nResults of Operations\nPackaging & Specialty Plastics\nIndustrial Intermediates & Infrastructure\nPerformance Materials & Coatings\nLiquidity and Capital Resources\nCritical Accounting Estimates\nEnvironmental Matters\nAsbestos-Related Matters of Union Carbide Corporation\nABOUT DOW\nDow is one of the world’s leading materials science companies, serving customers in high-growth markets such as packaging, infrastructure, mobility and consumer applications. The Company's global breadth, asset integration and scale, focused innovation, leading business positions and commitment to sustainability enables the Company to achieve profitable growth and help deliver a sustainable future. Dow operates manufacturing sites in 30 countries and employs approximately 36,000 people.\nIn 2024, the Company had net sales of $43 billion, of which 38 percent were to customers in the U.S. & Canada; 33 percent were in Europe, Middle East, Africa and India (\"EMEAI\"); while the remaining 29 percent were to customers in Asia Pacific and Latin America.\nIn 2024, the Company and its consolidated subsidiaries did not operate in countries subject to U.S. economic sanctions and export controls as imposed by the U.S. State Department or in countries designated by the U.S. State Department as state sponsors of terrorism, including Cuba, Iran, the Democratic People's Republic of Korea (North Korea) and Syria. The Company has policies and procedures in place designed to ensure that it and its consolidated subsidiaries remain in compliance with applicable U.S. laws and regulations.\nOVERVIEW\nThe following is a summary of the results for the Company for the year ended December 31, 2024:\nThe Company reported net sales in 2024 of $43 billion, down 4 percent from $45 billion in 2023, with decreases across all geographic regions, and driven by a decrease in local price of 4 percent. Net sales decreased in Packaging & Specialty Plastics (down 6 percent) and Industrial Intermediates & Infrastructure (down 5 percent), partially offset by an increase in Performance Materials & Coatings (up 1 percent).\nLocal price decreased 4 percent compared with 2023, with decreases in all operating segments and geographic regions. Local price decreased in Packaging & Specialty Plastics (down 4 percent), Industrial Intermediates & Infrastructure (down 6 percent) and Performance Materials & Coatings (down 3 percent).\nVolume was flat compared with 2023 and mixed by operating segment, with a decrease in Packaging & Specialty Plastics (down 2 percent) offset by increases in Industrial Intermediates & Infrastructure (up 1 percent) and Performance Materials & Coatings (up 5 percent). Volume increased in the U.S. & Canada (up 2 percent), decreased in Latin America (down 1 percent), and was flat in EMEAI and Asia Pacific.\nThe impact of currency on net sales was flat compared with 2023.\nRestructuring and asset related charges - net were $103 million in 2024 compared with $528 million in 2023, primarily reflecting restructuring actions approved by the Board in January 2023. The restructuring charges recognized in 2024 consisted of severance and related benefit costs of $41 million, asset write-downs and write-offs of $16 million and costs associated with exit and disposal activities of $9 million. In addition, the Company recognized pretax impairment charges of $37 million related to assets included in the divestiture of the Company's flexible packaging laminating adhesives business.\nEquity in losses of nonconsolidated affiliates was $6 million in 2024, compared with losses of $119 million in 2023, primarily driven by improved equity earnings at the Kuwait joint ventures driven from higher prices and volumes, improved results at the Sadara joint venture, partially offset by continued margin compression at the Thai joint ventures.\nSundry income (expense) - net for Dow Inc. and TDCC was income of $415 million and $404 million, respectively, in 2024, compared with expense of $280 million and $327 million, respectively, in 2023. Sundry income (expense) - net increased primarily due to lower foreign currency exchange losses and the absence of a one-time non-cash settlement charge related to the Company's pension de-risking activities in 2023.\nNet income available for Dow Inc. and TDCC common stockholder(s) was $1,116 million and $1,127 million, respectively, in 2024, compared with $589 million and $556 million, respectively, in 2023. Earnings per share for Dow Inc. was $1.57 per share in 2024, compared with $0.82 per share in 2023.\nIn 2024, Dow Inc. declared and paid dividends to common stockholders of $2.80 per share ($1,966 million).\nIn 2024, Dow Inc. repurchased $494 million of the Company's common stock.\nOther notable events and highlights from the year ended December 31, 2024 include:\nOn January 25, 2024, the Company published its Green Finance Framework and related Second Party Opinion on its website, to support the execution of its sustainability strategy.\nOn February 1, 2024, Andrea L. Dominowski became Controller and Vice President of Controllers.\nOn February 9, 2024, TDCC issued $1.25 billion of senior unsecured notes in connection with the Company's Green Finance Framework.\nOn April 2, 2024, the Company announced that Mauro Gregorio, President of Performance Materials & Coatings, elected to retire in the third quarter of 2024 after 40 years of service.\nOn April 2, 2024, the Company announced that Brendy Lange, business vice president of Dow Industrial Solutions, was named President of Performance Materials & Coatings.\nOn May 16, 2024, the Company announced it will expand its Protect the Climate targets by setting distinct milestones for climate change mitigation that focus on water and nature conservation. Additional information can be found on the Company's website.\nOn June 18, 2024, Dow Inc. released its INtersections Report, highlighting how the Company is advancing its ambition to be the most innovative, customer-centric, inclusive and sustainable materials science company in the world. Additional information can be found on the Company's website.\nOn July 1, 2024, Ronald C. Edmonds, former Controller and Vice President of Controllers and Tax, elected to retire after 31 years of service.\nOn July 1, 2024, Fitch Ratings affirmed TDCC's BBB+ and F1 rating, and its outlook of stable. Additionally, on July 1, 2024, Standard & Poor's affirmed TDCC's BBB and A-2 rating, and its outlook of stable.\nOn August 1, 2024, the Company acquired Circulus Holdings, LLC, a U.S. mechanical recycling company that converts plastic waste into post-consumer resin, for approximately $130 million.\nOn August 6, 2024, Moody's Ratings affirmed TDCC's Baa1 and P-2 rating, and its outlook of stable.\nOn October 24, 2024, the Company announced that it will complete a strategic review of select assets in Europe, primarily certain polyurethanes assets within the Industrial Intermediates & Infrastructure segment, as part of an effort to continue to optimize its global asset footprint.\nOn October 28, 2024, Moody's Ratings re-affirmed TDCC's Baa1 and P-2 rating and revised its outlook to negative from stable.\nOn December 2, 2024, the Company completed the sale of its flexible packaging laminating adhesives business, within the Packaging & Specialty Plastics segment, to Arkema S.A. for cash proceeds of $115 million, net of working capital adjustments, costs to sell and other transaction expenses and subject to customary post-closing adjustments.\nOn December 3, 2024, the Company announced that Karen Carter, President of Packaging & Specialty Plastics, had been named Chief Operating Officer.\nOn December 4, 2024, the Company announced that Keith Cleason had been named President of Packaging & Specialty Plastics.\nOn December 4, 2024, the Company announced that Jane Palmieri, President of Industrial Intermediates & Infrastructure, had elected to retire in March 2025 after 30 years of service with Dow.\nOn December 4, 2024, the Company announced that Marco ten Bruggencate had been named President of Industrial Intermediates & Infrastructure.\nOn December 8, 2024, the Company entered into a definitive agreement to sell a 40 percent equity stake in select U.S. Gulf Coast infrastructure assets to a fund managed by Macquarie Asset Management in exchange for cash proceeds of approximately $2.4 billion. Under the terms of the agreement, Macquarie Asset Management has the option to purchase up to an additional 9 percent equity stake in exchange for additional cash proceeds of up to $600 million.\nOn December 9, 2024, Standard & Poor's re-affirmed TDCC's BBB and A-2 rating, and its outlook of stable.\nDow was named on the Top 100 Global Innovators\nfor the 13th consecutive year.\nDow received a record-setting 12 2024 Edison Awards\n(three gold, five silver and four bronze), once again earning more awards than any other organization for the seventh consecutive year.\nDow was named to the JUST 100 list, placing 35th overall, a 20-place improvement from last year, and securing the top spot for Customers in the Chemicals sector.\nDow earned a spot in the S&P Global Sustainability Yearbook, recognizing the Company as a top industry performer.\nDow received six 2024 BIG Innovation Awards from the Business Intelligence Group\n, the most received in a single Business Intelligence Group\nAwards program by the Company.\nDow was recognized with a 2024 CIO 100 Award, for the third consecutive year, for the Company's Integrated Data Hub.\nDow advanced to third place on the 2024 Fair360, formerly DiversityInc, Top 50 Companies for Diversity list making it the seventh consecutive year on the list. Dow was also included on 12 of Fair360's Specialty Lists including: Top Companies for Executive Fairness Councils, Top Companies for Board of Directors, Top Companies for Environmental, Social & Governance, Top Companies for Philanthropy, Top Companies for Supplier Fairness, Top Companies for Employee Resource Groups, Top Companies for Mentoring, Top Companies for Sponsorship, Top Companies for People with Disabilities, Top Companies for Latino Executives, Top Companies for Asian American Executives and Top Companies for LGBTQ+ Employees.\nDow received six prestigious 2024 SEAL (Sustainability, Environmental Achievement and Leadership) Business Sustainability Awards. Dow's DOWSIL\nACP-3089 Antifoam Compound and Dow's SILASTIC\nSTT 2650 Self Sealing Silicone each received a SEAL Sustainable Innovation Award. Dow's DOWSIL\n2080, DOWSIL\nIE-9100, DOWSIL\nSTT 2650 each received a SEAL Sustainable Product Award.\nFor the eighth consecutive year, Dow received a top score on the Disability Equality Index\n, placing the Company among the Best Places to Work for Disability Inclusion\nDow was named one of the 2024 PEOPLE\nCompanies that Care by Great Place to Work\nfor the fifth consecutive year.\nDow was honored by Great Place to Work\nand Fortune as one of the World's Best Workplaces. Dow was also certified as a Great Place to Work\nin 15 countries and ranked on eight national Best Workplaces lists, including the Fortune 100 Best Companies to Work For\nlist in the United States for the fourth consecutive year.\nDow was named to the Dow Jones Sustainability World Index by S&P Dow Jones Indices, the world's leading index provider focused on providing essential sustainability intelligence. This is the 24th year Dow has achieved this prestigious ranking.\nDow received the first place spot on the Best Workplace in Manufacturing and Production list by Great Place to Work\nand Fortune. This is the fourth consecutive year Dow has been named to this prestigious list and the first time atop the ranking.\nIn addition to the highlights above, the following events occurred subsequent to December 31, 2024:\nOn January 27, 2025, the Dow Inc. Board approved targeted actions to further achieve the Company's cost reduction initiatives in response to ongoing macroeconomic uncertainty, including a workforce reduction of approximately 1,500 roles.\nRESULTS OF OPERATIONS\nThe following tables summarize net sales and sales variances by operating segment and geographic region from the prior year:\nSummary of Sales Results\n\nPackaging & Specialty Plastics\nIndustrial Intermediates & Infrastructure\nPerformance Materials & Coatings\nTotal, excluding the Hydrocarbons & Energy business\nEMEAI\nThe Company reported net sales of $43.0 billion in 2024, down 4 percent from $44.6 billion in 2023, with local price down 4 percent, and volume and currency both flat. Net sales decreased across all operating segments except Performance Materials & Coatings, and across all geographic regions. Local price decreased in all operating segments and across all geographic regions driven by industry supply and demand dynamics and lower global energy and feedstock costs. Local price decreased in Packaging & Specialty Plastics (down 4 percent), Industrial Intermediates & Infrastructure (down 6 percent) and Performance Materials & Coatings (down 3 percent). Volume increased 2 percent in the U.S. & Canada, decreased 1 percent in Latin America and was flat in EMEAI and Asia Pacific. Volume decreased in Packaging & Specialty Plastics (down 2 percent) and increased in Industrial Intermediates & Infrastructure (up 1 percent) and Performance Materials & Coatings (up 5 percent). Excluding the Hydrocarbons & Energy business, sales decreased 2 percent.\nCost of sales (\"COS\") was $38.4 billion in 2024, compared with $39.7 billion in 2023. COS decreased in 2024 primarily due to lower raw material costs, lower global energy and feedstock costs, and the impact of structural cost improvements, partially offset by increased planned maintenance turnaround spending. COS as a percentage of net sales was 89.3 percent in 2024, compared with 89.1 percent in 2023. The increase in COS as a percentage of net sales was driven by the impact of lower local price on flat net sales volume.\nResearch and Development Expenses\nResearch and development (\"R&D\") expenses were $810 million in 2024, compared with $829 million in 2023. R&D expenses decreased in 2024 primarily due to lower performance-based compensation costs.\nSelling, General and Administrative Expenses\nSelling, general and administrative (\"SG&A\") expenses were $1,581 million in 2024, compared with $1,627 million in 2023. SG&A expenses decreased in 2024 primarily due to lower performance-based compensation costs, as well as lower fringe benefit expenses resulting from the U.S. pension plan freeze, which more than offset an increase in bad debt expense, including expense incurred as a result of a resolution of a customer dispute.\nAmortization of Intangibles\nAmortization of intangibles was $310 million in 2024, compared with $324 million in 2023. Amortization of intangibles decreased primarily due to the reduction in the intangible asset base, resulting primarily from the write-off of an intangible asset, certain intangible asset write-offs related to the divestiture of the Company's flexible packaging laminating adhesives business and certain intangible assets becomi",
  "item2_clean": null
}