{
  "source_file": "dri-20250824.htm",
  "form_type": "10-Q",
  "item1_clean": null,
  "item7_clean": null,
  "item2_clean": "Food and beverage costs decreased as a percent of sales primarily due to a 0.7% impact from pricing leverage, partially offset by a 0.5% impact from inflation.\nRestaurant labor costs increased as a percent of sales primarily due to a 1.0% impact from inflation and a 0.3% impact from higher performance-based compensation expense including a higher 401k match for our restaurant teams, partially offset by a 0.7% impact from pricing leverage, a 0.2% impact from productivity and a 0.2% impact from brand mix.\nRestaurant expenses increased as a percent of sales primarily due to a 0.5% impact from inflation, a 0.3% impact from Uber direct fees and a 0.3% impact from brand mix, partially offset by a 0.7% impact from sales leverage and a 0.2% impact from other.\nPre-opening costs remained flat as a percent of sales.\nMarketing expenses remained flat as a percent of sales.\nGeneral and administrative expenses decreased as a percent of sales primarily due to a 0.5% impact from sales leverage including synergies realized from the Chuy’s transaction, partially offset by a 0.2% impact from Chuy’s transaction and integration costs, a 0.1% impact from mark to market adjustments and a 0.1% impact from inflation.\nDepreciation and amortization expenses remained flat as a percent of sales.\nImpairment and (gain) loss on disposal of assets, net increased as a percent of sales due to the gain on sale of the eight Olive Garden Canada locations.\nINTEREST EXPENSE\nNet interest expense increased as a percent of sales for the first three months of fiscal 2026 primarily due to financing related to the Chuy’s acquisition. See Liquidity and Capital Resources for a description of our senior notes issuance to finance the Chuy’s acquisition.\nIN\nC\nOME TAXES\nThe effective income tax rate for continuing operations for the three months ended August 24, 2025 was 12.2 percent compared to an effective income tax rate for the three months ended August 25, 2024 of 10.6 percent. The increase in the tax rate is primarily driven by higher net earnings from continuing operations, offset by the mark to market impacts on hedges related to our deferred compensation programs.\nH.R. 1., also known as the One Big Beautiful Bill Act (OBBBA), was enacted on July 4, 2025. The legislation included several provisions that impact the timing and magnitude of certain tax deductions, including restoring 100% bonus depreciation for qualifying property and the immediate expensing of domestic research and development costs. We have applied the key provisions impacting our financial position for the three months ended August 24, 2025, and will continue to assess the potential impacts on our financial position, results of operations and cash flows as additional guidance from the OBBBA is issued.\nLOSSES FROM DISCONTINUED OPERATIONS\nOn an after-tax basis, losses from discontinued operations for the first three months of fiscal 2026 were $0.1 million ($0.00 per diluted share) compared with losses from discontinued operations for the first three months of fiscal 2025 of $0.4 million ($0.00 per diluted share).\nSEGMENT RESULTS\nOur management uses segment profit as the measure for assessing performance of our segments. The following table presents segment profit margin\nfor the periods indicated.\nBPS\nBPS\nBPS\nBPS\nSegment profit margin is calculated as (sales less costs of food & beverage, restaurant labor, restaurant expenses and marketing expenses) / sales. During the fourth quarter of 2025, we changed our reporting of segment profit to exclude pre-opening costs in order to better align with our internal reporting and provide a better representation of restaurant-level operating costs. Fiscal 2025 figures were recast for comparability.\nThe decrease in Olive Garden’s segment profit margin for the first quarter of fiscal 2026 was driven primarily by increased restaurant labor costs and restaurant expenses, partially offset by decreased food and beverage costs. The decrease in Longhorn Steakhouse’s segment profit margin for the first quarter of fiscal 2026 was driven primarily by increased restaurant labor and food and beverage costs, primarily due to pricing approximately 100 bps below inflation, partially offset by decreased restaurant expenses and marketing costs. The decrease in Fine Dining’s segment profit margin for the first quarter of fiscal 2026 was driven primarily by increased restaurant labor costs and negative same-restaurant sales, partially offset by lower restaurant expenses and food and beverage costs. The increase in Other Business’ segment profit margin for the first quarter of fiscal 2026 was driven primarily by the addition of Chuy’s operating results and lower food and beverage and restaurant labor costs, partially offset by higher restaurant expenses and marketing costs.\nSEASONALITY\nOur sales volumes have historically fluctuated seasonally. Our average sales per restaurant are highest in the winter and spring, followed by the fall and summer. Holidays, changes in the economy, severe weather, and the effects of other conditions may impact sales volumes seasonally in some operating regions. Because of the historical seasonality of our business and these other factors, results for any fiscal quarter are not necessarily indicative of the results that may be achieved for the full fiscal year.\nLIQUIDITY AND CAPITAL RESOURCES\nTypically, cash flows generated from operating activities are our principal source of liquidity, which we use to finance capital expenditures for new restaurants and to remodel and maintain existing restaurants, to pay dividends to our shareholders and to repurchase shares of our common stock. Since substantially all of our sales are for cash and cash equivalents, and accounts payable are generally paid in 5 to 90 days, we are typically able to carry current liabilities in excess of current assets.\nWe currently manage our business and financial ratios to target an investment-grade bond rating, which has historically allowed flexible access to financing at reasonable costs. Our publicly issued long-term debt currently carries the following ratings:\nMoody’s Investors Service “Baa2”;\nStandard & Poor’s “BBB”; and\nOur commercial paper has ratings of:\nMoody’s Investors Service “P-2”;\nStandard & Poor’s “A-2”; and\nOn October 23, 2023, we entered into a $1.25 billion Revolving Credit Agreement (as amended, Revolving Credit Agreement) with Bank of America, N.A. (BOA), as administrative agent, and the lenders and other agents party thereto. The Revolving Credit Agreement is a senior unsecured credit commitment to the Company and contains customary representations and affirmative and negative covenants (including limitations on liens and subsidiary debt and, prior to the Amendment (as defined below), a maximum consolidated lease adjusted total debt to total capitalization ratio of 0.75 to 1.00) and events of default usual for credit facilities of this type. As of August 24, 2025, we had no outstanding balances and were in compliance with all covenants under the Revolving Credit Agreement. As of August 24, 2025, $142.0 million of commercial paper and $0.2 million of letters of credit were outstanding, and were both backed by this facility. After consideration of commercial paper and letters of credit backed by the Revolving Credit Agreement, as of August 24, 2025, we had $1.10 billion of credit available under the Revolving Credit Agreement.\nLoans under the Revolving Credit Agreement bear interest at a rate of (a) Term SOFR (which is defined, for the applicable interest period, as the Term SOFR Screen Rate two U.S. Government Securities Business Days prior to the commencement of such interest period with a term equivalent to such interest period) plus a Term SOFR adjustment of 0.10 percent plus the relevant margin determined by reference to a ratings-based pricing grid (Applicable Margin), or (b) the base rate (which is defined as the highest of the BOA prime rate, the Federal Funds rate plus 0.500 percent, and the Term SOFR plus 1.00 percent) plus the relevant Applicable Margin. Assuming a “BBB” equivalent credit rating level, the Applicable Margin under the Revolving Credit Agreement is 1.000 percent for Term SOFR loans and 0.000 percent for base rate loans.\nOn September 16, 2024, we entered into Amendment No. 1 (Amendment) to the Revolving Credit Agreement, which replaced the prior financial covenant (which provided for a maximum consolidated total debt to total capitalization ratio) with a new financial covenant requiring us to maintain, measured as of the end of each fiscal quarter, a maximum consolidated leverage ratio of 3.50 to 1.00 (which may be temporarily increased to 4.00 to 1.00 upon our the election as a result of a covered acquisition, subject to customary limitations set forth in the Revolving Credit Agreement). All other material terms and conditions of the Revolving Credit Agreement were unchanged.\nThe Revolving Credit Agreement matures on October 23, 2028, and the proceeds may be used for working capital and capital expenditures, the refinancing of certain indebtedness, certain acquisitions and general corporate purposes.\nAs of August 24, 2025, our outstanding long-term debt consisted principally of:\n$500.0 million of unsecured 3.850 percent senior notes due in May 2027;\n$400.0 million of unsecured 4.350 percent senior notes due in Oct 2027;\n$350.0 million of unsecured 4.550 percent senior notes due in Oct 2029;\n$500.0 million of unsecured 6.300 percent senior notes due in October 2033;\n$96.3 million of unsecured 6.000 percent senior notes due in August 2035;\n$42.8 million of unsecured 6.800 percent senior notes due in October 2037; and\n$300.0 million of unsecured 4.550 percent senior notes due in February 2048.\nThe interest rate on our $42.8 million senior notes due in October 2037 is subject to adjustment from time to time if the debt rating assigned to such series of notes is downgraded below a certain rating level (or subsequently upgraded). Th"
}