{
  "source_file": "dte-20241231.htm",
  "form_type": "10-K",
  "item1_clean": null,
  "item7_clean": "The increase in 2024 Net Income Attributable to DTE Energy Company was primarily due to higher earnings in the Electric segment, partially offset by lower earnings in the Energy Trading, Gas, and DTE Vantage segments and Corporate and Other. The increase in 2023 Net Income Attributable to DTE Energy Company was primarily due to higher earnings in the Energy Trading, DTE Vantage, and Gas segments, partially offset by lower earnings in the Electric segment and Corporate and Other.\nSTRATEGY\nDTE Energy's strategy is to achieve long-term earnings per share growth with a strong balance sheet and attractive dividend.\nDTE Energy's utilities are investing capital to support a modern, reliable grid and cleaner, affordable energy through investments in base infrastructure and new generation. Increasing intensity of windstorms and other weather events, coupled with increasing electric vehicle adoption and potential for data centers, will drive a continued need for substantial grid investment over the long-term.\nDTE Energy plans to reduce the carbon emissions of its electric utility operations by 65% in 2028, 85% in 2032, and 90% by 2040 from 2005 carbon emissions levels. DTE Energy plans to end its use of coal-fired power plants in 2032 and is committed to a net zero carbon emissions goal by 2050 for its electric and gas utility operations.\nAdditionally, as a result of legislation passed by the state of Michigan in the fourth quarter 2023, DTE Energy will be required to meet a 100% clean energy portfolio standard by 2040. Clean energy sources include renewables, nuclear, and natural gas-fired plants equipped with a carbon capture and storage system that is at least 90% effective in reducing carbon emissions to the atmosphere. The legislation also requires 50% of an electric utility's energy to be generated from renewable sources by 2030 and 60% by 2035. DTE Energy is currently assessing the impacts of this legislation and will include updates in its next Integrated Resource Plan, currently planned for 2026, to comply with the new requirements.\nTo achieve carbon reduction goals at the electric utility, DTE Energy will continue its transition away from coal-powered energy sources and is replacing or offsetting the generation from these facilities with renewable energy, natural gas, battery storage, and energy waste reduction initiatives. Refer to the \"Capital Investments\" section below for further discussion regarding DTE Energy's retirement of its aging coal-fired plants and transition to renewable energy and other sources. Over the long-term, DTE Energy is also monitoring and pursuing the advancement of emerging technologies such as long-duration storage, modular nuclear reactors, hydrogen, and carbon capture and sequestration, and how these technologies may support clean, reliable generation and customer affordability.\nFor the gas utility, DTE Energy aims to cut carbon emissions across the entire value chain. DTE Energy plans to reduce the carbon emissions from its gas utility operations by 65% by 2030 and 80% by 2040, and is committed to a goal of net zero emissions by 2050 from internal gas operations and gas suppliers. To achieve net zero, DTE Energy is working to source gas with lower methane intensity, reduce emissions through its gas main renewal and pipeline integrity programs, and if necessary, use carbon offsets to address any remaining emissions. DTE Energy also aims to help DTE Gas customers reduce their emissions by approximately 35% by 2040 by increasing energy efficiency, pursuing advanced technologies such as hydrogen and carbon capture and sequestration, and through the CleanVision Natural Gas Balance program which provides customers the option to use carbon offsets and renewable natural gas.\nDTE Energy expects that these initiatives at the electric and gas utilities will continue to provide significant opportunities for capital investments and result in earnings growth. DTE Energy is focused on executing its plans to achieve operational excellence and customer satisfaction with a focus on customer affordability. To support its goals for customer affordability, DTE Energy is working to implement operational efficiencies and optimize opportunities from the Inflation Reduction Act to generate tax credits relating to renewable energy, nuclear generation, energy storage, and carbon capture and sequestration. These tax credits may reduce the cost of owning related assets and reduce customer rate impacts from any future cost recoveries. DTE Energy's utilities operate in a constructive regulatory environment and have solid relationships with their regulators.\nDTE Energy also has significant investments in non-utility businesses and expects growth opportunities in its DTE Vantage segment. DTE Energy employs disciplined investment criteria when assessing growth opportunities that leverage its assets, skills, and expertise, and provides attractive returns and diversity in earnings and geography. Specifically, DTE Energy invests in targeted markets with attractive competitive dynamics where meaningful scale is in alignment with its risk profile.\nA key priority for DTE Energy is to maintain a strong balance sheet which facilitates access to capital markets and reasonably priced financing. Growth will be funded through internally generated cash flows and the issuance of debt and equity. DTE Energy has an enterprise risk management program that, among other things, is designed to monitor and manage exposure to earnings and cash flow volatility related to commodity price changes, interest rates, and counterparty credit risk.\nCAPITAL INVESTMENTS\nDTE Energy's utility businesses will require significant capital investments to maintain and improve the electric generation and electric and natural gas distribution infrastructure and to comply with environmental regulations and achieve goals for carbon emission reductions. Capital plans may be regularly updated as these requirements and goals evolve and may be subject to regulatory approval.\nDTE Electric's capital investments over the 2025-2029 period are estimated at $24 billion, comprised of $10 billion for distribution infrastructure, $4 billion for base infrastructure, and $10 billion for cleaner generation including renewables.\nDTE Electric has retired all eleven coal-fired generation units at the Trenton Channel, River Rouge, and St. Clair facilities, and plans to repurpose the Trenton Channel plant to a battery energy storage system in 2026. DTE Electric has also announced plans to retire its remaining six coal-fired generating units, including converting the two units at the Belle River facility from a base load coal plant to a natural gas peaking resource in 2025-2026. The four units at the Monroe facility are expected to be retired in two stages in 2028 and 2032. Generation from the retired facilities will continue to be replaced or offset with a combination of renewables, energy waste reduction, demand response, battery storage, and natural gas fueled generation.\nDTE Gas' capital investments over the 2025-2029 period are estimated at $4.0 billion, comprised of $2.5 billion for base infrastructure and $1.5 billion for the gas renewal program, which includes main and service renewals, meter move-out, and pipeline integrity projects.\nDTE Electric and DTE Gas plan to seek regulatory approval for capital expenditures consistent with ratemaking treatment.\nDTE Energy's non-utility businesses' capital investments are primarily for expansion, growth, and ongoing maintenance in the DTE Vantage segment, including approximately $1.5 billion to $2.0 billion from 2025-2029 for custom energy solutions and renewable energy, while expanding into carbon capture and sequestration.\nENVIRONMENTAL MATTERS\nThe Registrants are subject to extensive environmental regulations, including those addressing climate change. Additional costs may result as the effects of various substances on the environment are studied and governmental regulations are developed and implemented. Actual costs to comply could vary substantially. The Registrants expect to continue recovering environmental costs related to utility operations through rates charged to customers, as authorized by the MPSC.\nIncreased costs for energy produced from traditional coal-based sources due to recent, pending, and future regulatory initiatives could also increase the economic viability of energy produced from renewable, natural gas fueled generation, and/or nuclear sources, energy waste reduction initiatives, and the potential development of market-based trading of carbon instruments.\nRefer to the \"Environmental Matters\" section within Items 1. and 2. Business and Properties and Note 17 to the Consolidated Financial Statements, \"Commitments and Contingencies,\" for further discussion of Environmental Matters.\nOUTLOOK\nThe next few years will be a period of rapid change for DTE Energy and for the energy industry. DTE Energy's strong utility base, combined with its integrated non-utility operations, position it well for long-term growth.\nLooking forward, DTE Energy will focus on several areas that are expected to improve future performance:\nelectric and gas customer satisfaction;\nelectric distribution system reliability;\nnew electric generation and storage;\ngas distribution system renewal;\nreducing carbon emissions at the electric and gas utilities;\nrate competitiveness and affordability;\nregulatory stability and investment recovery for the electric and gas utilities;\nstrategic investments in growth projects at DTE Vantage;\nemployee engagement, health, safety and wellbeing, and diversity, equity, and inclusion;\ncost structure optimization across all business segments; and\ncash, capital, and liquidity to maintain or improve financial strength.\nDTE Energy will continue to pursue opportunities to grow its businesses in a disciplined manner if it can secure opportunities that meet its strategic, financial, and risk criteria.\nRESULTS OF OPERATIONS\nThe following sections provide a detailed discussion of the operating performance and future outlook of DTE Energy's segments. Segment information, described below, includes intercompany revenues, expenses, and other income and deductions that are eliminated in the Consolidated Financial Statements.\nNet Income (Loss) Attributable to DTE Energy\n\nCash from Operating Activities\nA majority of DTE Energy's operating cash flows are provided by the electric and natural gas utilities, which are significantly influenced by factors such as weather, electric retail access, regulatory deferrals, regulatory outcomes, economic conditions, changes in working capital, and operating costs.\nNet cash from operations increased $423 million in 2024. The increase was primarily due to higher cash from working capital items and an increase in Depreciation and amortization, partially offset by a decrease in cash related to Allowance for equity funds used during construction.\nThe change in working capital items in 2024 was primarily due to an increase in cash related to Accounts payable, Derivative assets and liabilities, and Other current and noncurrent assets and liabilities, partially offset by a decrease in cash related to Accounts receivable net, Inventories, Accrued pension liability, and Accrued postretirement liability.\nNet cash from operations increased $1.2 billion in 2023. The increase was primarily due to higher cash from working capital items and increases in Net income, Depreciation and amortization, and Deferred income taxes.\nThe change in working capital items in 2023 was primarily due to an increase in cash related to Accounts receivable, net and Regulatory assets and liabilities, partially offset by a decrease in cash related to Prepaid postretirement benefit costs, Accounts payable, Derivative assets and liabilities, and Other current and noncurrent assets and liabilities.\nCash used for Investing Activities\nCash inflows associated with investing activities are primarily generated from the sale of assets, while cash outflows are the result of plant and equipment expenditures and acquisitions. In any given year, DTE Energy looks to realize cash from under-performing or non-strategic assets or matured, fully valued assets.\nCapital spending within the utility businesses is primarily to maintain and improve electric generation and the electric and natural gas distribution infrastructure, and to comply with environmental regulations and renewable energy goals.\nCapital spending within the non-utility businesses is primarily for ongoing maintenance, expansion, and growth. DTE Energy looks to make growth investments that meet strict criteria in terms of strategy, management skills, risks, and returns. All new investments are analyzed for their rates of return and cash payback on a risk adjusted basis. DTE Energy has been disciplined in how it deploys capital and will not make investments unless they meet the criteria. For new business lines, DTE Energy initially invests based on research and analysis. DTE Energy starts with a limited investment, evaluates the results, and either expands or exits the business based on those results. In any given year, the amount of growth capital will be determined by the underlying cash flows of DTE Energy, with a clear understanding of any potential impact on its credit ratings.\nNet cash used for investing activities increased $856 million in 2024 and $664 million in 2023 due primarily to increases in utility plant and equipment expenditures and cash used related to Notes receivable.\nCash from Financing Activities\nDTE Energy relies on both short-term borrowing and long-term financing as a source of funding for capital requirements not satisfied by its operations.\nDTE Energy's strategy is to have a targeted debt portfolio blend of fixed and variable interest rates and maturity. DTE Energy targets balance sheet financial metrics to ensure it is consistent with the objective of a strong investment grade debt rating.\nNet cash from financing activities increased $462 million in 2024. The increase was primarily due to an increase in Issuance of long-term debt, net of issuance costs, partially offset by decreases in cash related to Redemption of long-term debt and Short-term borrowings, net.\nNet cash from financing activities decreased $579 million in 2023. The decrease was primarily due to the Issuance of common stock in 2022 and a decrease in Short-term borrowings, net, partially offset by an increase in Issuance of long-term debt, net of issuance costs.\nDTE Energy expects cash flows from operations to increase over the long-term, primarily as a result of growth from the utility and non-utility businesses. Growth in the utilities is expected to be driven primarily by capital spending which will increase the base from which rates are determined. Further, the Inflation Reduction Act allows for extended tax benefits for renewable technologies, increased rates for PTCs and an option to claim PTCs for solar projects, expanded qualified ITC facilities to include standalone energy storage, and allows for the transfer of tax credits generated from renewable projects. DTE Electric expects to continue to monetize these tax credits to generate cash flows in the near-term. DTE Energy expects long-term growth in sales related to vehicle electrification, but no significant impacts in the near-term. Non-utility growth is expected from additional investments in the DTE Vantage segment, primarily related to renewable energy and custom energy solutions, while expanding into carbon capture and sequestration. DTE Vantage also expects enhanced growth opportunities in decarbonization as a result of the Inflation Reduction Act, including tax credits for renewable natural gas and carbon capture projects.\nDTE Energy's utilities may be impacted by the timing of collection or refund of various recovery and tracking mechanisms as a result of timing of MPSC orders. Energy prices are likely to b",
  "item2_clean": null
}