{
  "source_file": "dte-20250930.htm",
  "form_type": "10-Q",
  "item1_clean": null,
  "item7_clean": null,
  "item2_clean": "Operation and maintenance\nexpense increased $2 million and $5 million in the three and nine months ended September 30, 2025, respectively. The increase in the nine-month period was primarily due to higher compensations costs.\nNatural gas structured transactions typically involve a physical purchase or sale of natural gas in the future and/or natural gas basis financial instruments which are derivatives and a related non-derivative pipeline transportation contract. These gas structured transactions can result in significant earnings volatility as the derivative components are marked-to-market without revaluing the related non-derivative contracts.\ndecreased $12 million for the three months ended September 30, 2025, which includes a $15 million favorable change in timing related gains primarily related to gas strategies that will reverse in future periods as the underlying contracts settle. The decrease also includes a $23 million unfavorable change in timing related gains and losses primarily related to gas strategies that were recognized in previous periods and reversed in the current period as the underlying contracts settled.\nincreased $5 million for the nine months ended September 30, 2025, which includes a $79 million unfavorable change in timing related gains and losses primarily related to gas strategies that will reverse in future periods as the underlying contracts settle. The increase also includes a $56 million favorable change in timing related gains and losses primarily related to gas strategies that were recognized in previous periods and reversed in the current period as the underlying contracts settled.\nIn the near-term, Energy Trading expects market conditions to remain challenging. The profitability of this segment may be impacted by the volatility in commodity prices and the uncertainty of impacts associated with regulatory changes, and changes in operating rules of Regional Transmission Organizations. Significant portions of the Energy Trading portfolio are economically hedged. Most financial instruments, physical power and natural gas contracts, and certain environmental contracts are deemed derivatives; whereas, natural gas and environmental inventory, contracts for pipeline transportation, storage assets, and some environmental contracts are not derivatives. As a result, Energy Trading will experience earnings volatility as derivatives are marked-to-market without revaluing the underlying non-derivative contracts and assets. Energy Trading's strategy is to economically manage the price risk of these underlying non-derivative contracts and assets with futures, forwards, swaps, and options. This results in gains and losses that are recognized in different interim and annual accounting periods.\nSee also the \"Fair Value\" section herein and Notes 9 and 10 to the Consolidated Financial Statements, \"Fair Value\" and \"Financial and Other Derivative Instruments,\" respectively.\nCORPORATE AND OTHER\nCorporate and Other includes various holding company activities, holds certain non-utility debt, and holds certain investments, including investments supporting regional development and economic growth. The net loss of $115 million and $215 million for the three and nine months ended September 30, 2025, respectively, represents an increase of $93 million and $132 million from the net loss of $22 million and $83 million in the comparable 2024 periods. The increase in the third quarter was primarily due to effective tax rate adjustments, higher net interest expense, and higher federal income taxes, including the $16 million impact from the One Big Beautiful Bill impact to the charitable contribution valuation allowance. The increase in the nine-month period was primarily due to effective tax rate adjustments, higher net interest expense, and higher federal and state income taxes, including the charitable contribution valuation allowance noted above, as well as the $14 million impact from the Illinois state tax law change in the second quarter.\nCorporate and Other will continue to support DTE Energy's goals to achieve long-term earnings growth by managing corporate costs such as interest and tax expense. Corporate and Other will also continue to support DTE Energy in achieving a strong balance sheet, access to capital markets, and implementation of a financing plan that includes interest rate management in order to manage interest costs.\nCAPITAL RESOURCES AND LIQUIDITY\nDTE Energy uses cash to maintain and invest in the electric and natural gas utilities, to grow the non-utility businesses, to retire and pay interest on long-term debt, and to pay dividends. DTE Energy believes it will have sufficient internal and external capital resources to fund anticipated capital and operating requirements. DTE Energy expects that cash from operations in 2025 will be approximately $3.3 billion. DTE Energy anticipates base level utility capital investments, including environmental, renewable, and energy waste reduction expenditures, and expenditures for non-utility businesses of approximately $4.9 billion in 2025. DTE Energy plans to seek regulatory approval to include utility capital expenditures in regulatory rate base consistent with prior treatment. Capital spending for growth of existing or new non-utility businesses will depend on the existence of opportunities that meet strict risk-return and value creation criteria.\nRefer below for analysis of cash flows relating to operating, investing, and financing activities, which reflect DTE Energy's change in financial condition. Any significant non-cash items are included in the Supplemental disclosure of non-cash investing and financing activities within the Consolidated Statements of Cash Flows, as applicable.\nNine Months Ended September 30,\nCash, Cash Equivalents, and Restricted Cash at Beginning of Period\n\nThe decrease in Net Income Attributable to DTE Energy Company for the three months ended September 30, 2025 was primarily due to greater losses at Corporate and Other and lower earnings in the Gas segment, partially offset by higher earnings in the Electric segment. The decrease for the nine-month period was primarily due to greater losses at Corporate and Other, partially offset by higher earnings in the Electric, DTE Vantage, and Gas segments.\nSTRATEGY\nDTE Energy's strategy is to achieve long-term earnings per share growth with a strong balance sheet and attractive dividend.\nDTE Energy's utilities are investing capital to support a modern, reliable grid and cleaner, affordable energy through investments in base infrastructure and new generation. Increasing intensity of windstorms and other weather events, coupled with increasing electric vehicle adoption and potential for data centers, will drive a continued need for substantial grid investment over the long-term.\nDTE Energy plans to reduce the carbon emissions of its electric utility operations by 65% in 2028, 85% in 2032, and 90% by 2040 from 2005 carbon emissions levels. DTE Energy plans to end its use of coal-fired power plants in 2032 and is committed to a net zero carbon emissions goal by 2050 for its electric and gas utility operations.\nAdditionally, as a result of legislation passed by the state of Michigan in 2023, DTE Energy will be required to meet a 100% clean energy portfolio standard by 2040. Clean energy sources include renewables, nuclear, and natural gas-fired plants equipped with a carbon capture and storage system that is at least 90% effective in reducing carbon emissions to the atmosphere. The legislation also requires 50% of an electric utility's energy to be generated from renewable sources by 2030 and 60% by 2035. DTE Energy is currently assessing the impacts of this legislation and will include updates in its next Integrated Resource Plan, currently planned for 2026, to comply with the new requirements.\nTo achieve carbon reduction goals at the electric utility, DTE Energy will continue its transition away from coal-powered energy sources and is replacing or offsetting the generation from these facilities with renewable energy, natural gas, battery storage, and energy waste reduction initiatives. Refer to the \"Capital Investments\" section below for further discussion regarding DTE Energy's retirement of its aging coal-fired plants and transition to renewable energy and other sources. Over the long-term, DTE Energy is also monitoring and pursuing the advancement of emerging technologies such as long-duration storage, modular nuclear reactors, and carbon capture and sequestration, and how these technologies may support clean, reliable generation and customer affordability.\nFor the gas utility, DTE Energy aims to cut carbon emissions across the entire value chain. DTE Energy plans to reduce the carbon emissions from its gas utility operations by 65% by 2030 and 80% by 2040, and is committed to a goal of net zero emissions by 2050 from internal gas operations and gas suppliers. To achieve net zero, DTE Energy is working to source gas with lower methane intensity, reduce emissions through its gas main renewal and pipeline integrity programs, and if necessary, use carbon offsets to address any remaining emissions. DTE Energy also aims to help DTE Gas customers reduce their emissions by approximately 35% by 2040 by increasing energy efficiency, pursuing advanced technologies such as hydrogen and carbon capture and sequestration, and through the CleanVision Natural Gas Balance program which provides customers the option to use carbon offsets and renewable natural gas.\nDTE Energy expects that these initiatives at the electric and gas utilities will continue to provide significant opportunities for capital investments and result in earnings growth. DTE Energy is focused on executing its plans to achieve operational excellence and customer satisfaction with a focus on customer affordability. To support its goals for customer affordability, DTE Energy is working to implement operational efficiencies and "
}