{
  "source_file": "duk-20241231.htm",
  "form_type": "10-K",
  "item1_clean": "N/A\n(a) Decommissioning costs for Duke Energy Carolinas reflects its ownership interest in jointly owned reactors. Other joint owners are responsible for decommissioning costs related to their interest in the reactors. Duke Energy Carolinas' site-specific nuclear decommissioning cost study and a funding study were filed with the NCUC and PSCSC in 2024.\n(b) Duke Energy Progress' site-specific nuclear decommissioning cost study was filed with the NCUC and PSCSC in February 2025. An updated funding study will be completed and filed with the NCUC and PSCSC in 2025.\n(c) During 2019, Duke Energy Florida reached an agreement to transfer decommissioning work for Crystal River Unit 3 to a third party and decommissioning costs are based on the agreement with this third party rather than a cost study. Regulatory approval was received from the NRC and the FPSC in April 2020 and August 2020, respectively. Duke Energy Florida provides the FPSC periodic reports on the status and progress of decommissioning activities.\nThe NCUC, PSCSC, FPSC and FERC have allowed EU&I to recover estimated decommissioning costs through retail and wholesale rates over the expected remaining service periods of their nuclear stations. EU&I believes the decommissioning costs being recovered through rates, when coupled with the existing fund balances and expected fund earnings, will be sufficient to provide for the cost of future decommissioning. For additional information, see Note 10 to the Consolidated Financial Statements, “Asset Retirement Obligations.”\nBUSINESS\nThe Nuclear Waste Policy Act of 1982 (as amended) provides the framework for development by the federal government of interim storage and permanent disposal facilities for high-level radioactive waste materials. The government has not yet developed a storage facility or disposal capacity, so EU&I will continue to store spent fuel on its reactor sites.\nUnder federal law, the DOE is responsible for the selection and construction of a facility for the permanent disposal of spent nuclear fuel and high-level radioactive waste. The DOE terminated the project to license and develop a geologic repository at Yucca Mountain, Nevada in 2010, and is currently taking no action to fulfill its responsibilities to dispose of spent fuel.\nUntil the DOE begins to accept the spent nuclear fuel, Duke Energy Carolinas, Duke Energy Progress and Duke Energy Florida will continue to safely manage their spent nuclear fuel. Under current regulatory guidelines, Harris has sufficient storage capacity in its spent fuel pools through the expiration of its renewed operating license. With certain modifications and approvals by the NRC to expand the on-site dry cask storage facilities, spent nuclear fuel dry storage facilities will be sufficient to provide storage space of spent fuel through the expiration of the operating licenses, including any license renewals, for Brunswick, Catawba, McGuire, Oconee and Robinson. Crystal River Unit 3 ceased operation in 2013 and was placed in a SAFSTOR condition in January 2018. As of January 2018, all spent fuel at Crystal River Unit 3 has been transferred from the spent fuel pool to dry storage at an on-site independent spent fuel storage installation.\nThe nuclear power industry faces uncertainties with respect to the cost and long-term availability of disposal sites for spent nuclear fuel and other radioactive waste, compliance with changing regulatory requirements, capital outlays for modifications and new plant construction.\nEU&I is subject to the jurisdiction of the NRC for the design, construction and operation of its nuclear generating facilities. The following table includes the current year of expiration of nuclear operating licenses for nuclear stations in operation. In June 2021, Duke Energy Carolinas filed a subsequent license renewal application for Oconee with the NRC to renew Oconee's operating license for an additional 20 years. Duke Energy has announced its intention to seek 20-year operating license renewals for each of the reactors it operates in Duke Energy Carolinas and Duke Energy Progress. See Note 4 to the Consolidated Financial Statements, \"Regulatory Matters,” for additional information.\nDuke Energy Carolinas\nCatawba Units 1 and 2\nOconee Units 1 and 2\nDuke Energy Progress\nThe NRC has acknowledged permanent cessation of operation and permanent removal of fuel from the reactor vessel at Crystal River Unit 3. Therefore, the license no longer authorizes operation of the reactor. For additional information on nuclear decommissioning activity, see Note 10 to the Consolidated Financial Statements, \"Asset Retirement Obligations.\"\nThe state utility commissions approve rates for Duke Energy's retail electric service within their respective states. The state utility commissions, to varying degrees, have authority over the construction and operation of EU&I’s generating facilities. CPCNs issued by the state utility commissions, as applicable, authorize EU&I to construct and operate its electric facilities and to sell electricity to retail and wholesale customers. Prior approval from the relevant state utility commission is required for the entities within EU&I to issue securities. The underlying concept of utility ratemaking is to set rates at a level that allows the utility to collect revenues equal to its cost of providing service plus earn a reasonable rate of return on its invested capital, including equity.\nIn addition to rates approved in base rate cases, each of the state utility commissions allow recovery of certain costs through various cost recovery clauses to the extent the respective commission determines in periodic hearings that such costs, including any past over or under-recovered costs, are prudent.\nFuel, fuel-related costs and certain purchased power costs are eligible for recovery by EU&I. EU&I uses coal, hydroelectric, natural gas, oil, renewable generation and nuclear fuel to generate electricity, thereby maintaining a diverse fuel mix that helps mitigate the impact of cost increases in any one fuel. Due to the associated regulatory treatment and the method allowed for recovery, changes in fuel costs from year to year have no material impact on operating results of EU&I, unless a commission finds a portion of such costs to have been imprudent. However, delays between the expenditure for fuel costs and recovery from customers can adversely impact the timing of cash flows of EU&I.\nBUSINESS\nThe table below reflects significant electric rate case applications approved and effective in the past three years and applications currently pending approval.\nApproved Rate Cases:\nDuke Energy Indiana 2024 Rate Case\nIURC\nDuke Energy Florida 2024 Rate Case\nFPSC\nDuke Energy Carolinas 2024 South Carolina Rate Case\nPSCSC\nDuke Energy Carolinas 2023 North Carolina Rate Case\nNCUC\nDuke Energy Kentucky 2022 Kentucky Electric Rate Case\nKPSC\nDuke Energy Progress 2022 North Carolina Rate Case\nNCUC\nDuke Energy Progress 2022 South Carolina Rate Case\nPSCSC\nDuke Energy Ohio 2021 Ohio Electric Rate Case\nPUCO\nDuke Energy Florida 2021 Settlement agreement\nFPSC\nDuke Energy Kentucky 2024 Kentucky Electric Rate Case\nKPSC\n(a) In Year 2, rates will increase by $59 million. Rate increases for new solar investments were also approved along with the 10.3% ROE midpoint. For more details, see Note 4 to the Consolidated Financial Statements, “Regulatory Matters.”\n(b) Of the total rate case increase, Year 1, 2 and 3 rates are approximately 57%, 22% and 21%, respectively.\n(c) An ROE of 9.65% for electric riders was approved.\n(d) Of the total rate increase, Year 1, 2 and 3 rates are approximately 49%, 24% and 27%, respectively.\n(e) Based on initial settlement. Year 1, 2 and 3 rates are approximately 34%, 25% and 41%, respectively, with 9.85% as the original ROE midpoint. For more details, see Note 4 to the Consolidated Financial Statements, “Regulatory Matters.”\nThe FERC approves EU&I’s cost-based rates for electric sales to certain power and transmission wholesale customers. Regulations of FERC and the state utility commissions govern access to regulated electric and other data by nonregulated entities and services provided between regulated and nonregulated energy affiliates. These regulations affect the activities of nonregulated affiliates with EU&I.\nPJM and MISO are the ISOs and FERC-approved RTOs for the regions in which Duke Energy Ohio and Duke Energy Indiana operate. PJM and MISO operate energy, capacity and other markets, and control the day-to-day operations of bulk power systems through central dispatch.\nDuke Energy Ohio is a member of PJM and Duke Energy Indiana is a member of MISO. Transmission owners in these RTOs have turned over control of their transmission facilities and their transmission systems are currently under the dispatch control of the RTOs. Transmission service is provided on a regionwide, open-access basis using the transmission facilities of the RTO members at rates based on the costs of transmission service.\nEU&I is subject to the jurisdiction of the EPA and state and local environmental agencies. For a discussion of environmental regulation, see “Environmental Matters” in this section. See the “Other Matters” section of Item 7 Management's Discussion and Analysis for a discussion about potential Global Climate Change legislation and other EPA regulations under development and the potential impacts such legislation and regulation could have on Duke Energy’s operations.\nGAS UTILITIES AND INFRASTRUCTURE\nGU&I conducts natural gas operations primarily through the regulated public utilities of Piedmont, Duke Energy Ohio and Duke Energy Kentucky. The natural gas operations are subject to the rules and regulations of the NCUC, PSCSC, PUCO, KPSC, TPUC, PHMSA and the FERC. GU&I serves residential, commercial, industrial and power generation natural gas customers, including customers served by municipalities who are wholesale customers. GU&I has over 1.7 million total customers, including approximately 1.2 million customers located in North Carolina, South Carolina and Tennessee, and an additional 560,000 customers located within southwestern Ohio and northern Kentucky. In the Carolinas, Ohio and Kentucky, the service areas are comprised of numerous cities, towns and communities. In Tennessee, the service area is the metropolitan area of Nashville. The following map shows the service territory for GU&I as of December 31, 2024.\nBUSINESS\nThe number of residential, commercial and industrial customers within the GU&I service territory is expected to increase over time. Average usage per residential customer is expected to remain flat or decline for the foreseeable future; however, decoupled rates in North Carolina and various rate design mechanisms in other jurisdictions partially mitigate the impact of the declining usage per customer on overall profitability.\nGU&I also has investments in various pipeline transmission projects, renewable natural gas projects and natural gas storage facilities.\nNatural Gas for Retail Distribution\nGU&I is responsible for the distribution of natural gas to retail customers in its North Carolina, South Carolina, Tennessee, Ohio and Kentucky service territories. GU&I’s natural gas procurement strategy is to contract primarily with major and independent producers and marketers for natural gas supply. It also purchases a diverse portfolio of transportation and storage service from interstate pipelines. This strategy allows GU&I to assure reliable natural gas supply and transportation for its firm customers during peak winter conditions. When firm pipeline services or contracted natural gas supplies are temporarily not needed due to market demand fluctuations, GU&I may release these services and supplies in the secondary market under FERC-approved capacity release provisions and/or make wholesale secondary market sales. In 2024, firm supply purchase commitment agreements provided for approximately 100% of the n",
  "item7_clean": "ITEM 7. MANAGEMENT’S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS\nManagement’s Discussion and Analysis includes financial information prepared in accordance with GAAP in the U.S., as well as certain non-GAAP financial measures such as adjusted earnings and adjusted EPS discussed below. Generally, a non-GAAP financial measure is a numerical measure of financial performance, financial position or cash flows that excludes (or includes) amounts that are included in (or excluded from) the most directly comparable measure calculated and presented in accordance with GAAP. The non-GAAP financial measures should be viewed as a supplement to, and not a substitute for, financial measures presented in accordance with GAAP. Non-GAAP measures as presented herein may not be comparable to similarly titled measures used by other companies.\nThe following combined Management’s Discussion and Analysis of Financial Condition and Results of Operations is separately filed by Duke Energy Corporation and its subsidiaries. Duke Energy Carolinas, LLC, Progress Energy, Inc., Duke Energy Progress, LLC, Duke Energy Florida, LLC, Duke Energy Ohio, Inc., Duke Energy Indiana, LLC and Piedmont Natural Gas Company, Inc. However, none of the registrants make any representation as to information related solely to Duke Energy or the subsidiary registrants of Duke Energy other than itself.\nManagement’s Discussion and Analysis should be read in conjunction with the Consolidated Financial Statements and Notes for the years ended December 31, 2024, 2023 and 2022.\nDUKE ENERGY\nDuke Energy, an energy company headquartered in Charlotte, North Carolina, operates in the U.S. primarily through its subsidiaries, Duke Energy Carolinas, Duke Energy Progress, Duke Energy Florida, Duke Energy Ohio, Duke Energy Indiana and Piedmont. When discussing Duke Energy’s consolidated financial information, it necessarily includes the results of the Subsidiary Registrants, which along with Duke Energy, are collectively referred to as the Duke Energy Registrants.\nThis is a dynamic and exciting time for our industry and our company in particular as we move further into the energy transition. While 2024 presented unprecedented challenges as it relates to a historic storm season, we are now in the early stages of the approval and planned construction of significant new generation investments and anticipate growing energy demands in the coming decades from continued migration into our attractive service territories, onshoring of domestic industries, electrification, and data centers and other investments from the expected artificial intelligence revolution. At Duke Energy, we remain focused on continuing to advance our energy transition, maintaining reliability and affordability for our customers while providing cleaner energy and delivering on our commitments to our communities, employees, investors, and other stakeholders. The fundamentals of our business remain strong, allowing us to deliver growth in earnings and dividends in a low-risk, predictable and transparent way.\nIn 2024, we responded to the most significant hurricane season in our company's history. While several historic, back-to-back hurricanes challenged our operations and required incremental financing costs, we met our near-term financial commitments and continued to make progress, generating positive regulatory and strategic outcomes, advancing key actions related to our energy transition and continuing to provide the safe and reliable service that our communities depend on. We continue to rebuild the most heavily damaged infrastructure impacted by storms in our service territories, engage with our customers and make critical investments to support our ongoing energy transition and a business portfolio that delivers a reliable and growing dividend, with 2024 representing the 98th consecutive year Duke Energy paid a cash dividend on its common stock.\nMD&A\nDUKE ENERGY\nSee Results of Operations below for Duke Energy’s definition of adjusted earnings and adjusted EPS as well as a reconciliation of this non-GAAP financial measure to net income available to Duke Energy and net income available to Duke Energy per basic share.\nDuke Energy's 2024 Net Income Available to Duke Energy Corporation (GAAP Reported Earnings) increased primarily due to higher impairments on the sale of the Commercial Renewables business in the prior year. Additional drivers primarily include growth from rate increases and riders, improved weather and higher sales volumes, partially offset by higher interest expense, depreciation on a growing asset base and storm costs, along with a higher effective tax rate. See “Results of Operations” below for a detailed discussion of the consolidated results of operations and a detailed discussion of financial results for each of Duke Energy’s reportable business segments, as well as Other.\n2024 Areas of Focus and Accomplishments\nHurricane Response and Operational Excellence\nThe reliable and safe operation of our power generating facilities, electric distribution system and natural gas infrastructure in our communities continues to be foundational to serving our customers, our financial results, and our credibility with stakeholders. Our workforce and contract partners work hard to prepare for storm season, through drills, material planning, call center readiness, contingency planning and customer communications. Additionally, operational excellence is especially critical to successfully navigate effective storm response and to efficiently provide the continuity of service our customers demand, regardless of weather or circumstance.\nIn 2024, with three consecutive major hurricanes Debby, Helene and Milton, this preparation was critical as we responded to several unprecedented and catastrophic weather events across our service territories. The historic nature of these storms required a new level of coordination and teamwork across every organization at our company. In August 2024, Hurricane Debby made landfall in Florida as a Category 1 storm, impacting the Duke Energy Florida territory as well as the Duke Energy Carolinas and Duke Energy Progress territories in North Carolina and South Carolina and causing approximately 700,000 customer outages. In late September 2024, Hurricane Helene made landfall in Florida as a Category 4 storm and subsequently impacted all of Duke Energy's service territories as the storm moved inland, with the most severe damage occurring in Florida and the Carolinas. Approximately 3.5 million customers were impacted by Hurricane Helene across Duke Energy's system, the largest number of companywide outages from a single event on our system ever reported. Then, in October 2024, Hurricane Milton made landfall in Florida as a Category 3 storm, causing severe damage across our Florida service territory as a result of high winds, rain and flooding and resulting in more than 1 million customer outages.\nIn such extreme circumstances, our immediate priority is, and always will be, executing the extensive storm preparation and response work to ensure the safe, timely, and efficient restoration of service to impacted customers as quickly as possible. Around-the-clock power restoration efforts continued following the historic damage inflicted by these storms with lineworkers, tree trimmers and removal experts, state department of transportation workers and countless others, working to repair and, in certain areas, completely rebuild, the critical electricity infrastructure that powers and supports the communities we serve. Our operations teams worked diligently, restoring power to approximately 5.5 million customers. We've also seen the benefits of ongoing grid hardening investments, leveraging self-healing technologies and remote restoration capabilities to automate the rerouting of power, more effectively deploy resources, and reduce the frequency or duration of outages for many of our customers during severe weather events.\nPreparation, sound execution, and a comprehensive communication strategy helped us respond quickly and build stakeholder loyalty and support as we continue the important work of rebuilding our communities, including power infrastructure in the hardest-hit areas of our service territories. While these historic storms created incremental financing needs, we are working with our state commissions to appropriately track and recover storm costs under approved regulatory frameworks on a timely basis. We also remain focused on balancing the bill impacts on our customers, including seeking insurance recovery and the securitization of related costs in certain jurisdictions, as appropriate. For more information, see \"Matters Impacting Future Results,\" \"Liquidity and Capital Resources,\" and Notes 4 and 7 to the Consolidated Financial Statements, \"Regulatory Matters\" and \"Debt and Credit Facilities.\"\nMD&A\nDUKE ENERGY\nDespite the extreme weather and operational challenges with storm response, our generation fleet and nuclear sites delivered strong performance throughout the year and our electric distribution system performed well. In addition to unprecedented storm response, most of our service territories experienced above-average temperatures this summer, including the warmest July on record in Florida, new energy peaks in the Carolinas and weather alerts from PJM and MISO in the Midwest. In January 2025, due to 65 hours of freezing or below freezing temperatures, Duke Energy Carolinas and Duke Energy Progress achieved a new record combined peak usage. We prepared for the arrival of extreme weather and delivered on our customer commitments, identifying potential risks, effectively maintaining adequate short-term planning reserves, leveraging outage scheduling optimization, and controlling planned and emergent equipment issues. Effective operations and flexibility by our generation and transmission teams managed these tight margins in an efficient manner and ensured the integrity of the grid our customers rely upon. We will continue to practice our forecasting, grid assessment, oversight, and governance processes as extreme weather challenges operations from time to time, evaluate lessons learned and enhance our strategy and communications to effectively serve our customers now and in the future. Our ability to effectively handle all facets of the 2024 storm response efforts while making ongoing investments to enhance the reliability and physical security of the grid is a testament to our team’s extensive preparation and coordination, applying lessons learned from previous storms, and on-the-ground management throughout the restoration efforts. Duke Energy has received 20 Emergency Response Awards since EEI began recognizing storm response in 1998 (including 11 for assisting other utilities).\nThe safety and health of our workforce is a core value and we remain an industry leader in personal safety as measured by the Occupational Safety and Health Administration's (OSHA) Total Incident Case Rate (TICR). We closely tracked 2023's record-setting safety results with our 2024 TICR coming in below target and anticipate ranking first among North American combined gas and electric companies in an annual industry safety survey for the 10th consecutive year. We expect our gas operations organization to finish in the top 10% according to a gas industry survey for the fourth year in a row. Following on our historic success from 2023, we finished 2024 with less than 100 OSHA recordable injuries. In addition, we achieved significant year-over-year improvement in environmental performance as measured by internal metrics and had no significant environmental events.\nConstructive Regulatory and Legislative Outcomes\n. Modernized regulatory constructs provide benefits, which include improved earnings and cash flows through more timely recovery of investments, as well as stable pricing for customers. One of our long-term strategic goals was to achieve modernized regulatory constructs across all of our jurisdictions. With PBR and MYRP in North Carolina, MYRP in Florida, and grid investment riders in the Midwest, 2024 marked a significant milestone for utilizing these structures across most of our service territories.\nOverall, 2024 was a very active year as it relates to regulatory filings, which reflects the important investments and ongoing energy transition across all of our service territories. We continued to move a variety of regulatory initiatives forward this year, including the following:\nIn January 2024, Duke Energy Carolinas filed a South Carolina rate case. In May 2024, we reached a constructive comprehensive settlement with certain parties and in July 2024, the PSCSC issued an order approving the settlement and revising recovery of certain environmental compliance costs. New rates were effective August 1, 2024.\nIn April 2024, we filed formal requests for new base rates across several jurisdictions including Duke Energy Florida, Duke Energy Indiana and Piedmont.\nDuke Energy Florida filed a three-year rate plan to begin in January 2025. In August 2024, the FPSC approved our constructive comprehensive settlement with certain parties and new rates were effective January 1, 2025.\nDuke Energy Indiana filed a general rate case with the IURC and received a constructive order in January 2025. New rates are expected to be effective by March 2025.\nPiedmont filed a general rate case with the NCUC and reached a constructive comprehensive settlement with certain parties in September 2025. Revised interim rates were effective November 1, 2024, subject to refund and pending NCUC approval of the settlement and a final order, which was received in January 2025.\nAlso, in April 2024, Duke Energy Progress issued $177 million of storm recovery bonds, our first issuance under South Carolina's 2022 securitization legislation, which provided the necessary framework for us to lower the bill impacts on our customers related to critical storm restoration activities. In December 2024, we initiated securitization filings in North Carolina related to the unprecedented back-to-back hurricanes of 2024 and are also pursuing timely recovery of storm costs under existing regulatory mechanisms in Florida.\nIn December 2024, Duke Energy Kentucky filed an electric base rate case and new rates are anticipated to go into effect in July 2025.\ne also began to sell nuclear PTCs as allowed under the Inflation Reduction Act. These proceeds are expected to have significant benefits to customers and lower the cost of the energy transition as the sales proceeds, net of associated costs, are flowed back to customers through lower rates under regulatory mechanisms in applicable jurisdictions.\n. Faced with anticipated long-term growth not seen for decades, our industry continues to experience an unprecedented level of change and 2024 was a dynamic year for our company as we navigated storm response and continued to execute on our strategic priorities.\nGenerating Reliable, Affordable and Cleaner Energy\nWe continue to balance reliability and affordability in light of expected increases in long-term demand for electricity in our service territories in the coming decades. While we continue to target a transition out of coal by 2035, subject to regulatory approvals, our focus remains on meeting the growing and evolving energy needs of our customers through a long-range, enterprise strategy that involves modernizing our assets with reliability and affordability top of mind. Although our path will not be linear as we retire coal and bring new generation resources online, we have made strong progress to date in reducing carbon emissions from electricity generation (a 44% reduction from 2005) and have established goals to do more (50% reduction by 2030, 80% by 2040, and net zero by 2050). We are also working to reduce Scope 2 and certain Scope 3 emissions, including emissions from upstream purchased power and ",
  "item2_clean": null
}