{
  "source_file": "dva-20250930.htm",
  "form_type": "10-Q",
  "item1_clean": null,
  "item7_clean": null,
  "item2_clean": "Management’s Discussion and Analysis of Financial Condition and Results of Operations.\nForward-looking statements\nincident experienced by the Company in 2025, the potential impact of the federal government shutdown and the One Big Beautiful Bill Act (OBBBA) on our business, including with respect to federal funding of Medicaid and other government programs, availability or cost of supplies, including without limitation the impact of evolving trade policies and tariffs and any reduction in clinical and other supplies due to any disruptions experienced by third party vendors, including with respect to our ability to provide home dialysis services, treatment volumes, mix expectation, such as the percentage or number of patients under commercial insurance, including potential impacts to such mix as a result of the federal government shutdown or U.S. administration policies, current macroeconomic, marketplace and labor market conditions, and overall impact on our patients and teammates, as well as other statements regarding our future operations, financial condition and prospects, capital allocation plans, expenses, cost saving initiatives, other strategic initiatives, use of contract labor, government and commercial payment rates, expectations related to value-based care (VBC), integrated kidney care (IKC), Medicare Advantage (MA) plan enrollment and our international operations, expectations regarding increased competition and marketplace changes, including those related to new or potential entrants in the dialysis and pre-dialysis marketplace and the potential impact of innovative technologies, drugs, or other treatments on the dialysis industry, and expectations regarding our share repurchase program. All statements in this report, other than statements of historical fact, are forward-looking statements. Without limiting the foregoing, statements including the words \"expect,\" \"intend,\" \"will,\" \"could,\" \"plan,\" \"anticipate,\" \"believe\" and similar expressions are intended to identify forward-looking statements. These forward-looking statements are based on DaVita's current expectations and are based solely on information available as of the date of this report. DaVita undertakes no obligation to publicly update or revise any forward-looking statements, whether as a result of changed circumstances, new information, future events or otherwise, except as may be required by law. Actual future events and results could differ materially from any forward-looking statements due to numerous factors that involve substantial known and unknown risks and uncertainties. These risks and uncertainties include, among other things:\nexternal conditions, including those related to general economic, marketplace and global health conditions, including without limitation, the impact of global events and political or governmental volatility; the impact of the domestic political environment and related developments on the current healthcare marketplace, our patients and on our business; the continuing impact of infectious diseases on our financial condition and the chronic kidney disease (CKD) population and our patient population; supply chain challenges and disruptions, including without limitation with respect to certain key services, critical clinical supplies and equipment we obtain from third parties, and including any impacts on our supply chain and cost of supplies as a result of natural disasters or evolving trade policies, including tariffs; the potential impact on our patients and industry of new or potential entrants in the dialysis and pre-dialysis marketplace and innovative technologies, drugs, or other treatments, including our ability to successfully implement new technologies or treatments in our business; elevated teammate turnover or labor costs; the impact of continued increased competition from dialysis providers and others; and our ability to respond to challenging U.S. and global economic and marketplace conditions, including, among other things, our ability to successfully identify cost saving opportunities;\nthe concentration of profits generated by higher-paying commercial payor plans for which there is continued downward pressure on average realized payment rates; a reduction in the number or percentage of our patients under commercial plans, including, without limitation, as a result of healthcare, immigration or other policies implemented by the U.S. administration, continuing legislative efforts to restrict or prohibit the use and/or availability of charitable premium assistance, or as a result of payors implementing restrictive plan designs;\nrisks arising from potential changes in or new laws, regulations or requirements applicable to us, including, without limitation, the federal government shutdown, OBBBA and those related to trade policy, healthcare, privacy, antitrust matters, and acquisition, merger, joint venture or similar transactions and/or labor matters, and potential impacts of changes in interpretation or enforcement thereof or related litigation impacting, among other things, coverage or reimbursement rates for our services or the number of patients enrolled in or that select higher-paying commercial plans, and the risk that we make incorrect assumptions about how our patients will respond to any such developments;\nour ability to successfully implement our strategies with respect to IKC and VBC initiatives and home based dialysis in the desired time frame and in a complex, dynamic and highly regulated environment;\na reduction in government payment rates under the Medicare End Stage Renal Disease program, state Medicaid or other government-based programs and the impact of the MA benchmark structure;\nour reliance on significant suppliers, service providers and other third party vendors to provide key support to our business operations and enable our provision of services to patients, including, among others, suppliers of certain pharmaceuticals, administrative or other services or critical clinical products; and risks resulting from a closure, reduction or other disruption in the services or products provided to us by such suppliers, service providers and third party vendors;\nnoncompliance by us or our business associates with any privacy or security laws or any security breach by us or a third party, such as the\nincident experienced by the Company in 2025, including, among other things, any such non-compliance or breach involving the misappropriation, loss or other unauthorized use or disclosure of confidential information;\nlegal and compliance risks, such as compliance with complex, and at times, evolving government regulations and requirements, and with additional laws that may apply to our operations as we expand geographically or enter into new lines of business;\nour ability to attract, retain and motivate teammates, including key leadership personnel, and our ability to manage potential disruptions to our business and operations, including potential work stoppages, operating cost increases or productivity decreases whether due to union organizing activities, legislative or other changes, demand for labor, volatility and uncertainty in the labor market, the current challenging and highly competitive labor market conditions, including due to the ongoing nationwide shortage of skilled clinical personnel, or other reasons;\nchanges in pharmaceutical practice patterns, reimbursement and payment policies and processes, or pharmaceutical pricing, including with respect to oral phosphate binders, among other things;\nour ability to develop and maintain relationships with physicians and hospitals, changing affiliation models for physicians, and the emergence of new models of care or other initiatives that, among other things, may erode our patient base and impact reimbursement rates;\nour ability to complete and successfully integrate and operate acquisitions, mergers, dispositions, joint ventures or other strategic transactions on terms favorable to us or at all; and our ability to continue to successfully expand our operations and services in markets outside the United States, or to businesses or products outside of dialysis services;\nthe variability of our cash flows, including, without limitation, any extended billing or collections cycles including, without limitation, due to defects or operational issues in our billing systems, the impact of the\nincident experienced by the Company in 2025 or defects or operational issues in the billing systems or services of third parties on which we rely; the risk that we may not be able to generate or access sufficient cash in the future to service our indebtedness or to fund our other liquidity needs;\nthe effects on us or others of natural or other disasters, public health crises or severe adverse weather events such as hurricanes, earthquakes, fires or flooding;\nfactors that may impact our ability to repurchase stock under our share repurchase program and the timing of any such stock repurchases, as well as any use by us of a considerable amount of available funds to repurchase stock;\nour goals and disclosures related to environmental, social and governance (ESG) matters, including, among other things, evolving regulatory requirements affecting ESG standards, measurements and reporting requirements\nThe following should be read in conjunction with our condensed consolidated financial statements.\nOur principal business is to provide dialysis and related lab services to patients in the United States, which we refer to as our U.S. dialysis business. We also operate our U.S. integrated kidney care (IKC) business, our U.S. other ancillary services, and our international operations, which we collectively refer to as our ancillary services, as well as our corporate administrative support functions. Our U.S. dialysis business is a leading provider of kidney dialysis services in the U.S. for patients suffering from chronic kidney failure, also known as end stage renal "
}