{
  "source_file": "dxcm-20250930.htm",
  "form_type": "10-Q",
  "item1_clean": null,
  "item7_clean": null,
  "item2_clean": "We are also exploring how to extend our offerings to other opportunities, including for people with pre-diabetes, people who are obese, people who are pregnant, and people in the hospital setting. Eventually, we may apply our technological expertise to products beyond glucose monitoring.\nCritical Accounting Estimates\nThe discussion and analysis of our financial condition and results of operations are based on our condensed consolidated financial statements, which we have prepared in accordance with GAAP. The preparation of these condensed consolidated financial statements requires us to make estimates and assumptions that affect the reported amounts of assets and liabilities and the disclosure of contingent assets and liabilities at the date of the condensed consolidated financial statements as well as the reported revenue and expenses during the reporting periods. On an ongoing basis, we evaluate our estimates and judgments. We base our estimates on historical experience and on various other factors that we believe are reasonable under the circumstances, the results of which form the basis for making judgments about the carrying value of assets and liabilities that are not readily apparent from other sources. Actual results may differ from these estimates under different assumptions or conditions.\nWe believe that the estimates, assumptions and judgments involved in the accounting policies described in “\nManagement’s Discussion and Analysis of Financial Condition and Results of Operations\nOverview of Financial Results\nThe most important financial indicators that we use to assess our business are revenue, gross profit, operating income, net income, and operating cash flow.\nKey Highlights for the Three Months Ended September 30, 2025 include the following:\nup 22% from the same period in 2024\nup 23% from the same period in 2024\nup 60% from the same period in 2024\nup 111% from the same period in 2024\nup 231% from the same period in 2024\nWe ended the third quarter of 2025 with cash, cash equivalents and short-term marketable securities totaling $3.32 billion.\nResults of Operations\nThree Months Ended September 30, 2025 Compared to Three Months Ended September 30, 2024\nThree Months Ended September 30,\n(In millions, except per share amounts)\nResearch and development\nSelling, general and administrative\nTotal operating expenses\nIncome before income taxes\nBasic net income per share\nDiluted net income per share\nThe sum of the individual percentages may not equal the total due to rounding.\nWe generate our revenue from the sale of disposable sensors and our reusable transmitter and receiver, collectively referred to as Reusable Hardware.\nWe expect that the revenue we generate from the sales of our products will fluctuate from quarter to quarter. We typically experience seasonality, with lower sales in the first quarter of each year compared to the immediately preceding fourth quarter. This seasonal sales pattern relates to U.S. annual insurance deductible resets and unfunded flexible spending accounts.\nCost of sales includes direct labor and materials costs related to each product sold or produced, including assembly, test labor and scrap, as well as factory overhead supporting our manufacturing operations. Factory overhead includes facilities, material procurement and control, manufacturing engineering, quality assurance, supervision and management. These costs are primarily salary, fringe benefits, share-based compensation, facility expense, supplies and purchased services. All of our manufacturing costs are included in cost of sales. In addition, amortization of certain licensing related intangibles are also included in cost of sales.\nResearch and development\nOur research and development expenses primarily consist of engineering and research expenses related to our sensing technology, clinical trials, regulatory expenses, quality assurance programs, employee compensation, and business process outsourcers.\nSelling, general and administrative\nOur selling, general and administrative expenses primarily consist of employee compensation for our executive, financial, sales, marketing, information technology and administrative functions. Other significant expenses include commissions, marketing and advertising, IT software license costs, insurance, professional fees for our outside legal counsel and independent auditors, litigation expenses, patent application expenses and consulting expenses.\nOther income, net consists primarily of interest and dividend income on our cash, cash equivalents and short-term marketable securities portfolio, foreign currency transaction gains and losses resulting from the effects of foreign currency fluctuations, realized and unrealized gains and losses on marketable and non-marketable equity investments, including changes in fair value, and interest expense related to our senior convertible notes.\nThree Months Ended September 30, 2025 Compared to Three Months Ended September 30, 2024\nThree Months Ended September 30,\n\nThree Months Ended September 30, 2025 Compared to\nThree Months Ended September 30, 2024\nThe revenue increase was primarily driven by increased sales volume of our disposable sensors due to the continued growth of our worldwide customer base. We added approximately 500,000 - 600,000 net customers, excluding Stelo customers, to our worldwide customer base in 2024. The increase in revenue was offset by pricing headwinds due to rebate eligibility and channel mix.\nDisposable sensor and other revenue comprised approximately 97% of total revenue and Reusable Hardware revenue comprised approximately 3% of total revenue for the three months ended September 30, 2025. Disposable sensor and other revenue comprised approximately 96% of total revenue and Reusable Hardware revenue comprised approximately 4% of total revenue for the three months ended September 30, 2024.\nCost of sales & Gross profit\nCost of sales and gross profit increased primarily due to an increase in sales volume driven by the addition of approximately 500,000 - 600,000 net customers, excluding Stelo customers, to our worldwide customer base in 2024.\nThe increase in gross profit margin percentage in the third quarter of 2025 compared to the third quarter of 2024 was primarily driven by higher manufacturing volumes which improved fixed cost absorption. This benefit was partially offset by inefficiencies associated with ensuring supply availability, build configurations that lowered production yield, and total replacement costs.\nThree Months Ended September 30, 2025 Compared to\nThree Months Ended September 30, 2024\nResearch and development expense\nResearch and development expense\n\nincome tax expense recorded for the three months ended September 30, 2024 was primarily attributable to income tax expense from normal, recurring operations and discrete impacts of certain foreign tax return filings.\nThe decrease in our effective tax rate for the three months ended September 30, 2025 compared to the same period in 2024 is primarily attributable to a lower annual effective tax rate applied to normal, recurring operations and the tax benefit related to the commencement of our Malaysia tax holiday.\nResults of Operations\nNine Months Ended September 30, 2025 Compared to Nine Months Ended September 30, 2024\nNine Months Ended September 30,\n(In millions, except per share amounts)\nResearch and development\nSelling, general and administrative\nTotal operating expenses\nIncome before income taxes\nBasic net income per share\nDiluted net income per share\nThe sum of the individual percentages may not equal the total due to rounding.\nNine Months Ended September 30, 2025 Compared to Nine Months Ended September 30, 2024\nNine Months Ended September 30,\nNine Months Ended September 30, 2025 Compared to\nNine Months Ended September 30, 2024\nThe revenue increase was primarily driven by increased sales volume of our disposable sensors due to the continued growth of our worldwide customer base. We added approximately 500,000 - 600,000 net customers, excluding Stelo customers, to our worldwide customer base in 2024. The increase in revenue was offset by pricing headwinds due to greater rebate eligibility and channel mix.\nDisposable sensor and other revenue comprised approximately 97% of total revenue and Reusable Hardware revenue comprised approximately 3% of total revenue for the nine months ended September 30, 2025. Disposable sensor and other revenue comprised approximately 94% of total revenue and Reusable Hardware revenue comprised approximately 6% of total revenue for the nine months ended September 30, 2024.\nCost of sales & Gross profit\nCost of sales and gross profit increased primarily due to an increase in sales volume driven by the addition of approximately 500,000 - 600,000 net customers, excluding Stelo customers, to our worldwide customer base in 2024.\nThe decrease in gross profit margin percentage in 2025 compared to 2024 was primarily driven by inefficiencies associated with ensuring supply availability, build configurations that lowered production yield, and total replacement costs.\nNine Months Ended September 30, 2025 Compared to\nNine Months Ended September 30, 2024\nResearch and development expense\nResearch and development expense increased primarily due to $37.1 million in higher\n\ncompensation and related costs, offset by $4.8 million in lower clinical trials, supplies, and other support costs.\nWe continue to believe that focused investments in research and development are critical to our future growth and competitive position in the marketplace, and to the development of new and updated products and services that are central to our core business strategy.\nSelling, general and administrative expense\nSelling, general and administrative expense increased primarily due to $77.7 million in higher compensation and related costs, partially driven by increased headcount, offset by $72.4 million in lower legal expense primarily related to a patent infringeme"
}