{
  "source_file": "dxcm-20241231.htm",
  "form_type": "10-K",
  "item1_clean": "Personalized alert schedule immediately warns the user of pending dangerous high and low blood sugar levels.\nThe G6 also has a number of new or improved features compared to our prior generation devices:\nFinger stick elimination.\nNo finger sticks are needed for calibration or diabetes treatment decisions, consistent with the instructions for use, unless symptoms do not match readings.\nEasy sensor application.\nComplete redesign of the sensor applicator allows for one-touch, simple self-insertion.\nDiscreet and low profile.\nA redesigned transmitter with a 28% lower profile than the previous generation Dexcom CGM system makes the device comfortable and easy to wear under clothing.\nMedication blocking.\nAllows for more accurate glucose readings without interference from common medications taken at typical indication doses, such as acetaminophen.\nPredictive low alert.\nAlert feature intended to predict hypoglycemia before it hits to help avoid dangerous low blood sugar events.\nExtended 10-day disposable sensor.\nUp to 10-day sensor use allows for 43% longer wear than previous generation Dexcom CGM systems.\nOther than the foregoing, the features of the G6 are generally consistent with our prior generation CGM systems in its technical capabilities and its indications. Since the G6 is classified by the FDA as a Class II device, it is subject to special controls and modifications of, or revisions to, the device may be made under the 510(k) process.\nIn July 2021, we obtained CE Mark approval for our Dexcom ONE CGM system, or Dexcom ONE, which we have launched in several countries in Europe. Dexcom ONE consists of three main components: a sensor, a transmitter, and a display device consisting of either the Dexcom ONE app for users with a compatible mobile device, or a Dexcom ONE receiver. Dexcom ONE carries many of the same features as the G6, and is indicated for persons, including pregnant women, ages 2 years and older. Like our other CGM systems, Dexcom ONE is designed to replace finger stick blood glucose testing for diabetes treatment decisions.\nIn November 2023, we obtained CE Mark approval for Dexcom ONE+. This updated version of our Dexcom ONE system builds upon the software experience of Dexcom ONE with certain additional features, while allowing customers to adopt the all-in-one wearable technology of our G7 CGM system.\nIn August 2024, we launched Stelo, our new biosensor designed for adults with prediabetes and Type 2 diabetes who do not use insulin, as the first over-the-counter glucose biosensor in the U.S.\nThe Dexcom Share remote monitoring system, offered for use with any current Dexcom system, uses an app on the patient’s compatible iPhone, iPod touch, iPad or Android mobile device to securely and wirelessly transmit glucose information to the cloud and then to apps on the mobile devices of up to ten designated recipients, or “followers,” who can remotely monitor a patient’s glucose information and receive alert notifications anywhere they have a wireless connection. A patient’s glucose data can also be displayed on a patient’s or follower’s wearable device, such as the Apple Watch and Wear OS by Google devices, when used in conjunction with the patient’s or follower’s compatible iPhone or Android mobile device.\nData and Insulin Delivery Collaborations\nWe have entered into multiple collaboration agreements that leverage our technology platform to integrate our CGM products with insulin delivery systems. The general purpose of these development and commercial relationships is to integrate our technology into the insulin pump or pen product offerings of the respective partner, enabling the partner’s insulin delivery device to receive and display glucose readings from our transmitter and, in some cases, use the glucose readings for semi-automated insulin delivery. We have existing insulin delivery partnerships, and we are also working with other companies that are pursuing varying strategies surrounding semi-automated insulin delivery and data analytics to improve outcomes and ease-of-use in diabetes management.\nWe have also entered into collaborations with several organizations that are currently using, or are developing, programs for the treatment of Type 2 diabetes that utilize our current CGM systems. These collaborations align with the strategy to seek broader access to our CGM systems for people with Type 2 diabetes, including those who are not treated with intensive insulin therapy.\nVerily Collaboration\nOur Restated Collaboration Agreement with Verily Life Science LLC (an Alphabet Company) and Verily Ireland Limited (collectively, Verily) provides us with an exclusive license to use intellectual property of Verily resulting from the collaboration, and certain Verily patents, in the development, manufacture and commercialization of blood-based or interstitial glucose monitoring products more generally (subject to certain exclusions, which are outside of the CGM field as it is commonly understood). It also provides us with non-exclusive license rights under Verily’s other intellectual property rights to develop, manufacture, and commercialize those kinds of glucose monitoring products and certain CGM product companion software functionalities. In connection with the Restated Collaboration Agreement, we developed, launched and commercialized a CGM product in connection with the collaboration.\nIn consideration of Verily’s performance of its obligations under the joint development plan of the Restated Collaboration Agreement, the licenses granted to us and the amendment of the original agreement, we made upfront, incentive, and the product regulatory approval payments, and payments for contingent sales-based milestones upon the achievement of certain revenue targets. See Note 2 “\nDevelopment and Other Agreements\nDiabetes is a chronic, life-threatening disease for which there is no known cure and which has other significant adverse consequences for human health throughout the world. The disease is caused by the body’s inability to produce or effectively utilize the hormone insulin. This inability prevents the body from adequately regulating blood glucose levels. Glucose, the primary source of energy for cells, must be maintained at certain concentrations in the blood in order to permit optimal cell function and health. Normally, the pancreas provides control of blood glucose levels by secreting the hormone insulin to decrease blood glucose levels when concentrations are too high. In people with diabetes, the body does not produce sufficient levels of insulin, or fails to utilize insulin effectively, causing blood glucose levels to rise above normal. This condition is called hyperglycemia and often results in acute complications as well as chronic long-term complications such as heart disease, limb amputations, loss of kidney function and blindness. When blood glucose levels are high, people with diabetes often administer insulin in an effort to decrease blood glucose levels. Unfortunately, insulin administration can drive blood glucose levels below the normal range, resulting in hypoglycemia. In cases of severe hypoglycemia, people with diabetes risk acute complications, such as loss of consciousness or death. Due to the drastic nature of acute complications associated with hypoglycemia, many people with diabetes are reluctant to reduce blood glucose levels. Consequently, these individuals often remain in a hyperglycemic state, increasing their odds of developing long-term chronic complications. Diabetes is typically classified into two major groups: Type 1 and Type 2.\nThe International Diabetes Federation, or IDF, estimates that in 2021, 537 million adults (aged 20-79) around the world had diabetes. IDF estimates that by 2045, the worldwide incidence of people suffering from diabetes will reach 783 million. According to the Centers for Disease Control and Prevention, or CDC, in its National Diabetes Statistics Report, 2024, or the 2024 CDC Report, crude estimates for the prevalence of diabetes in the United States as of 2021 include 38.4 million people with diabetes, of which 29.7 million people have diagnosed diabetes.\nThis growing diabetes prevalence and its associated health outcomes also result in sobering economic burdens for global health systems. According to the American Diabetes Association, or ADA, one in every four healthcare dollars was spent on treating people with diabetes in 2022, and the direct medical costs and indirect expenditures attributable to diabetes in the United States were an estimated $413 billion, an inflation-adjusted increase of approximately 35% since 2012. Of the $413 billion in overall expenses, the ADA estimated that approximately $307 billion were direct costs associated with diabetes care, chronic complications and excess general medical costs, and $106 billion were indirect costs. The ADA also found that in 2022, average medical expenditures among people with diagnosed diabetes were 2.6 times higher than for people without diabetes. According to the IDF, 2021 expenditures attributable to diabetes were estimated to be $966 billion globally, an increase of 27% from their previous estimate in 2019.\nAccording to the 2024 CDC Report, as of 2021 there were an estimated 2.0 million adults and youth with diagnosed Type 1 diabetes in the United States. Type 1 diabetes is an autoimmune disorder that usually develops during childhood and is characterized by an absence of insulin, resulting from destruction of the insulin producing cells of the pancreas. Individuals with Type 1 diabetes must rely on frequent insulin injections in order to regulate and maintain blood glucose levels.\nType 2 diabetes is a metabolic disorder which results when the body is unable to produce sufficient amounts of insulin or becomes insulin resistant. Depending on the severity of Type 2 diabetes, individuals may require diet and nutrition management, exercise, oral medications or insulin injections to regulate blood glucose levels. We estimate that between 5.0 and 6.0 million people with Type 2 diabetes in the United States must use insulin to manage their diabetes.\nType 2 diabetes is occurring with increasing frequency in young people, with the increase in prevalence related to an increase in obesity amongst children. According to the CDC, as of 2017-2020, approximately 19.7% of children and adolescents aged 2-19 years, or 14.7 million children, in the United States were obese. In the United States, the percentage of children and adolescents affected by obesity has more than tripled since the 1970s.\nImportance of Glucose Monitoring\nBlood glucose levels can be affected by many factors, including the carbohydrate and fat content of meals, exercise, stress, illness or impending illness, hormonal releases, variability in insulin absorption and changes in the effects of insulin in the body. Given the many factors that affect blood glucose levels, maintaining glucose within a normal range is difficult, resulting in frequent and unpredictable excursions above or below normal blood glucose levels. People with diabetes administer insulin or ingest carbohydrates throughout the day in order to maintain blood glucose levels within normal ranges. People with diabetes frequently overcorrect and fluctuate between hyperglycemic and hypoglycemic states, often multiple times during the same day. As a result, many people with diabetes are routinely outside the normal blood glucose range. Failure to maintain blood glucose levels within the normal range leads to numerous and significant health risks. These risks include eye disease, nerve disease, kidney disease, cardiovascular disease and potentially hypoglycemic events.\nLimitations of Existing Glucose Monitoring Products\nSingle-point finger stick devices are the most prevalent devices for glucose monitoring. These devices require taking a blood sample with a finger stick, placing a drop of blood on a test strip and inserting the strip ",
  "item7_clean": "We also continue to pursue and support development partnerships with insulin pump companies and companies or institutions developing insulin delivery systems, including automated insulin delivery systems. With the introduction of Stelo, we are also pursuing and supporting development partnerships with consumer technology product companies that seek to provide metabolic health insights to their customers.\nWe are also exploring how to extend our offerings to other opportunities, including for people with pre-diabetes, people who are obese, people who are pregnant, and people in the hospital setting. Eventually, we may apply our technological expertise to products beyond glucose monitoring.\nCritical Accounting Estimates\nThe discussion and analysis of our financial condition and results of operations are based on our consolidated financial statements, which we have prepared in accordance with GAAP. The preparation of these consolidated financial statements requires us to make estimates and assumptions that affect the reported amounts of assets and liabilities and the disclosure of contingent assets and liabilities at the date of the consolidated financial statements as well as the reported revenue and expenses during the reporting periods. On an ongoing basis, we evaluate our estimates and judgments. We base our estimates on historical experience and on various other factors that we believe are reasonable under the circumstances, the results of which form the basis for making judgments about the carrying value of assets and liabilities that are not readily apparent from other sources. Actual results may differ from these estimates under different assumptions or conditions.\nWhile our significant accounting policies are described in Note 1 “\nOrganization and Significant Accounting Policies\nWe estimate pharmacy rebates based on contractual arrangements, estimates of products sold subject to rebate, known events or trends, and channel inventory data. Estimates associated with pharmacy rebates are the most significant component of our variable consideration estimates and most at risk for material adjustment because of the time delay between the recording of the pharmacy rebate and its ultimate settlement, an interval that generally ranges from 30 to 90 days, but can last up to one year. Due to this time lag, in any given period, our adjustments to reflect actual amounts can incorporate changes of estimates related to prior periods.\nHistorically, adjustments to these estimates to reflect actual results or updated expectations, have not been material to our overall business and generally have been less than 1% of revenue. An increase or decrease of 1% in our estimate of products sold subject to rebate during 2024, holding all other assumptions constant, would increase or decrease revenue by approximately $38.7 million.\nFor more information, see Note 1 “\nOrganization and Significant Accounting Policies—Revenue Recognition\nExcess and Obsolete Inventory\nWe assess the value of our inventory on a quarterly basis and write down those inventories based on quality control testing data, obsolescence, or in excess of our forecasted demand to the lower of their cost or net realizable value. Our estimates of forecasted demand are based upon our analysis and assumptions including, but not limited to, expected product lifecycles, product development plans and historical usage by product. If actual market conditions are less favorable than our forecasts, or actual demand from our customers is lower than our estimates, we may be required to record additional inventory write-downs. If actual market conditions are more favorable than anticipated, inventory previously written down may be sold, resulting in lower cost of sales and higher income from operations than expected in that period.\nWe estimate our income taxes based on the various jurisdictions where we conduct business. Significant judgment is required in determining our worldwide income tax provision. The calculation of our tax liabilities involves dealing with uncertainties in the application of complex tax laws and regulations and the potential for future adjustment of our uncertain tax positions by the Internal Revenue Service or other taxing jurisdictions. While we believe we have appropriate support for the positions taken on our tax returns, we regularly assess the potential outcomes of examinations by tax authorities in determining the adequacy of our provision for income taxes. We continually assess the likelihood and amount of potential adjustments and adjust the income tax provision, income taxes payable, and deferred taxes in the period in which the facts that give rise to a revision become known.\nWe use the asset and liability approach to recognize deferred tax assets and liabilities for the expected future tax consequences of temporary differences between the carrying amounts and the tax basis of assets and liabilities as described in Note 1 “\nOrganization and Significant Accounting Policies—Income Taxes\n” to the consolidated financial statements in Part II, Item 8 of this Annual Report. Significant judgment is required to evaluate the need for a valuation allowance against deferred tax assets. A valuation allowance is established when it is more likely than not that some or all of the deferred tax assets will not be realized. Realization of deferred tax assets is dependent upon future earnings in applicable tax jurisdictions. We maintain a valuation allowance on our California research and development tax credits, foreign tax credits and certain foreign intangible assets, as it is more likely than not that those deferred tax assets will not be realized.\nWe recognize and measure benefits for uncertain tax positions using a two-step approach as described in Note 1 “\nOrganization and Significant Accounting Policies—Income Taxes\n” to the consolidated financial statements in Part II, Item 8 of this Annual Report. Significant judgment is required to evaluate uncertain tax positions and is based upon a number of factors, including changes in facts or circumstances, changes in tax law, correspondence with tax authorities during the course of audits and effective settlement of audit issues. Changes in the recognition or measurement of uncertain tax positions could result in material increases or decreases in our income tax expense in the period in which we make the change, which could have a material impact on our effective tax rate and operating results.\nWe are subject to certain legal proceedings, as well as demands, claims and threatened litigation that arise in the normal course of our business. We review the status of each significant matter quarterly and assess our potential financial exposure. Significant judgment is required in the determination of whether a potential loss is probable, reasonably possible, or remote as well as in the determination of whether a potential exposure is reasonably estimable. We base our judgments on the best information available at the time. As additional information becomes available, we reassess the potential liability related to our pending claims and litigation and may revise our estimates. Any revision of our estimates of potential liability could have a material impact on our financial position and operating results.\nOverview of Financial Results\nThe most important financial indicators that we use to assess our business are revenue, gross profit, operating income, net income, and operating cash flow.\nKey Highlights for fiscal 2024 include the following:\nWe ended fiscal 2024 with cash, cash equivalents and short-term marketable securities totaling $2.58 billion.\nResults of Operations\nTwelve Months Ended December 31, 2024 Compared to Twelve Months Ended December 31, 2023\nTwelve Months Ended December 31,\n(In millions, except per share amounts)\nResearch and development\nSelling, general and administrative\nTotal operating expenses\nOther income (expense), net\nIncome before income taxes\nIncome tax expense (benefit)\nBasic net income per share\nDiluted net income per share\nThe sum of the individual percentages may not equal the total due to rounding.\nWe generate our revenue from the sale of disposable sensors and our reusable transmitter and receiver, collectively referred to as Reusable Hardware.\nWe expect that the revenue we generate from the sales of our products will fluctuate from quarter to quarter. We typically experience seasonality, with lower sales in the first quarter of each year compared to the immediately preceding fourth quarter. This seasonal sales pattern relates to U.S. annual insurance deductible resets and unfunded flexible spending accounts.\nCost of sales includes direct labor and materials costs related to each product sold or produced, including assembly, test labor and scrap, as well as factory overhead supporting our manufacturing operations. Factory overhead includes facilities, material procurement and control, manufacturing engineering, quality assurance, supervision and management. These costs are primarily salary, fringe benefits, share-based compensation, facility expense, supplies and purchased services. All of our manufacturing costs are included in cost of sales. In addition, amortization of certain licensing related intangibles are also included in cost of sales.\nResearch and development\nOur research and development expenses primarily consist of engineering and research expenses related to our sensing technology, clinical trials, regulatory expenses, quality assurance programs, employee compensation, and business process outsourcers.\nSelling, general and administrative\nOur selling, general and administrative expenses primarily consist of employee compensation for our executive, financial, sales, marketing, information technology and administrative functions. Other significant expenses include commissions, marketing and advertising, IT software license costs, insurance, professional fees for our outside legal counsel and independent auditors, litigation expenses, patent application expenses and consulting expenses.\nOther income (expense), net\nOther income (expense), net consists primarily of interest and dividend income on our cash, cash equivalents and short-term marketable securities portfolio, foreign currency transaction gains and losses due to the effects of foreign currency fluctuations, realized and unrealized gains and losses on equity investments, and interest expense related to our senior convertible notes.\nTwelve Months Ended December 31, 2024 Compared to Twelve Months Ended December 31, 2023\nTwelve Months Ended December 31,\nTwelve Months Ended December 31, 2024 Compared to\nTwelve Months Ended December 31, 2023\nThe revenue increase was primarily driven by increased sales volume of our disposable sensors due to the continued growth of our worldwide customer base. We added approximately 500,000 - 600,000 net users, excluding Stelo customers, to our worldwide customer base in 2024. The increase in revenue was offset by pricing headwinds due to greater rebate eligibility and channel mix.\nDisposable sensor and other revenue comprised approximately 95% of total revenue and Reusable Hardware revenue comprised approximately 5% of total revenue for the twelve months ended December 31, 2024. Disposable sensor and other revenue comprised approximately 90% of total revenue and Reusable Hardware revenue comprised approximately 10% of total revenue for the twelve months ended December 31, 2023.\nCost of sales & Gross profit\nCost of sales and gross profit increased primarily due to an increase in sales volume driven by the addition of approximately 500,000 - 600,000 net users, excluding Stelo customers, to our worldwide customer base in 2024.\nThe decrease in gross profit margin percentage in 2024 compared to 2023 was primarily driven by product and channel mix changes, higher freight costs, and non-cash charges including a $22.7 million inventory build charge, and $20.6 million in inventory damaged in transit and certain build configurations that lowered production yield.\nTwelve Months Ended December 31, 2024 Compared to\nTwelve Months Ended December 31, 2023\nResearch and development expense\nResearch and development expense increased primarily due to $20.5 million in compensation and related costs due to higher headcount, $11.2 million in clinical trials, supplies and other support costs, and $5.9 million in software and data costs.\nWe continue to believe that focused investments in research and development are critical to our future growth and competitive position in the marketplace, and to the development of new and updated products and services that are central to our core business strategy.\nSelling, general and administrative expense\nSelling, general and administrative expense increased primarily due to $33.5 million in advertising and marketing costs, $30.7 million in compensation and related costs due to higher headcount, $18.0 million in software and data costs, and $10.1 million in travel related expenses.\nThe income tax expense recorded for the twelve months ended December 31, 2024 was primarily attributable to income tax expense from normal, recurring operations, partially offset by excess tax benefits recognized for share-based compensation for employees, net of nondeductible executive compensation, the Verily milestone payment, the impacts of certain foreign tax return filings and generation of research and development tax credits.\nThe income tax expense recorded for the twelve months ended December 31, 2023 was primarily attributable to income tax expense from normal, recurring operations, as well as income taxes related to an intra-entity transfer of certain intellectual property partially offset by excess tax benefits recognized for share-based compensation for employees (net of disallowed executive compensation) and the Verily milestone payment, and generation of research and development tax credits.\nThe decrease in our effective tax rate for the twelve months ended December 31, 2024 compared to the same period in 2023 is primarily attributable to impacts of the prior year tax restructuring and the Verily milestone payment.\nLiquidity and Capital Resources\nOverview, Capital Resources, and Capital Requirements\nOur principal sources of liquidity are our existing cash, cash equivalents and marketable securities, cash generated from operations, proceeds from our senior convertible notes issuances, and access to our Credit Facility. Our primary uses of cash have been for research and development programs, selling and marketing activities, capital expenditures, acquisitions of businesses, and debt service costs.\nWe expect that cash provided by our operations may fluctuate in future periods as a result of a number of factors, including fluctuations in our operating results, working capital requirements and capital deployment decisions. We have historically invested our cash primarily in U.S. dollar-denominated, investment grade, highly liquid obligations of U.S. government agencies, commercial paper, corporate debt, and money market funds. Certain of these investments are subject to general credit, liquidity and other market risks. The general condition of the financial markets and the economy may increase those risks and may affect the value and liquidity of investments and restrict our ability to access the capital markets.\nOur future capital requirements will depend on many factors, including but not limited to:\nThe evolution of the international expansion of our business and the revenue generated by sales of our approved products and any future products;\nOur ability to efficiently scale our operations to meet demand for our current and any future products;\nThe success of our research and development efforts;\nThe expenses we incur in manufacturing, developing, selling and marketing our products;\nThe costs, timing and risks of delays of additional regulatory approvals;\nThe costs of filin",
  "item2_clean": null
}