{
  "source_file": "ea-20250930.htm",
  "form_type": "10-Q",
  "item1_clean": null,
  "item7_clean": null,
  "item2_clean": "The transaction price is determined based on the consideration that we will be entitled to receive in exchange for transferring our goods and services to the customer. Determining the transaction price often requires judgment, based on an assessment of contractual terms and business practices. It further includes review of variable consideration such as discounts, sales returns, price protection, and rebates, which is estimated at the time of the transaction. In addition, the transaction price does not include an estimate of the variable consideration related to sales-based royalties. Sales-based royalties are recognized as the sales occur.\nAllocating the transaction price.\nAllocating the transaction price requires that we determine an estimate of the relative stand-alone selling price for each distinct performance obligation. Determining the relative stand-alone selling price is inherently subjective, especially in situations where we do not sell the performance obligation on a stand-alone basis (which occurs in the majority of our transactions). In those situations, we determine the relative stand-alone selling price based on various observable inputs using all information that is reasonably available. Examples of observable inputs and information include: historical internal pricing data, cost plus margin analysis, pre-release versus post-release costs, and pricing data from competitors to the extent the data is available. The results of our analysis resulted in a specific percentage of the transaction price being allocated to each performance obligation.\nDetermining the Estimated Offering Period.\nThe offering period is the period in which we offer to provide the future update rights and/or online hosting for the game and related extra content sold. Because the offering period is not an explicitly defined period, we must make an estimate of the offering period for the service-related performance obligations (i.e., future update rights and/or online hosting). Determining the Estimated Offering Period is inherently subjective and is subject to regular revision. Generally, we consider the average period of time customers are online when estimating the offering period. We also consider the estimated period of time between the date a game unit is sold to a reseller and the date the reseller sells the game\nunit to the customer (i.e., time in channel). Based on these two factors, we then consider the method of distribution. For example, games and extra content sold at retail would have a composite offering period equal to the online gameplay period plus time in channel as opposed to digitally-distributed games and extra content which are delivered immediately via digital download and therefore, the offering period is estimated to be only the online gameplay period.\nAdditionally, we consider results from prior analyses, known and expected online gameplay trends, as well as disclosed service periods for competitors’ games in determining the Estimated Offering Period for future sales. We believe this provides a reasonable depiction of the transfer of future update rights and online hosting to our customers, as it is the best representation of the time period during which our games and extra content are experienced. We recognize revenue for future update rights and online hosting performance obligations ratably on a straight-line basis over this period as there is a consistent pattern of delivery for these performance obligations. Revenue for service-related performance obligations for digitally-distributed games and extra content is recognized over an estimated eight-month period beginning in the month of sale, and revenue for service-related performance obligations for games and extra content sold through retail is recognized over an estimated ten-month period beginning in the month of sale. Prior to July 1, 2025, revenue for service-related performance obligations related to our mobile free-to-play and PC and console free-to-play games was recognized generally over eight and twelve-month periods, respectively, beginning in the month of sale.\nDuring the three months ended September 30, 2025, we completed our annual evaluation of the Estimated Offering Period, and as a result, for sales beginning July 1, 2025, the revenue that we recognize for service-related performance obligation related to our mobile free-to-play and PC and console free-to-play games is recognized generally over an eleven-month period beginning in the month of sale. This change in Estimated Offering Period did not impact the amount of net bookings or the operating cash flows that we report. We expect that this change will move the recognition of approximately $78 million in net revenue from fiscal year 2026 into fiscal year 2027. During the three and six months ended September 30, 2025, this change to our Estimated Offering Period resulted in an estimated decrease in net revenue of $8 million and net income of $6 million, and a decrease of $0.02 diluted earnings per share.\nPrincipal Agent Considerations\nWe evaluate sales to end customers of our full games and related content via third-party storefronts, including digital storefronts such as Microsoft’s Xbox Store, Sony’s PlayStation Store, Apple App Store, and Google Play Store, in order to determine whether or not we are acting as the principal in the sale to the end customer, which we consider in determining if revenue should be reported gross or net of fees retained by the third-party storefront. An entity is the principal if it controls a good or service before it is transferred to the end customer. Key indicators that we evaluate in determining gross versus net treatment include but are not limited to the following:\nthe underlying contract terms and conditions between the various parties to the transaction;\nwhich party is primarily responsible for fulfilling the promise to provide the specified good or service to the end customer;\nwhich party has discretion in establishing the price for the specified good or service; and\nwhich party has title risk before the specified good or service has been transferred to the end customer.\nBased on an evaluation of the above indicators, except as discussed below, we have determined that generally the third party is considered the principal to end customers for the sale of our full games and related content. We therefore report revenue related to these arrangements net of the fees retained by the storefront. However, for sales arrangements via Apple App Store and Google Play Store, EA is considered the principal to the end customer and thus, we report revenue on a gross basis and mobile platform fees are reported within cost of revenue.\nWe recognize deferred tax assets and liabilities for both (1) the expected impact of differences between the financial statement amount and the tax basis of assets and liabilities and (2) the expected future tax benefit to be derived from tax losses and tax credit carryforwards. We do not recognize any deferred taxes related to the U.S. taxes on foreign earnings as we recognize these taxes as a period cost.\nWe record a valuation allowance against deferred tax assets when it is considered more likely than not that all or a portion of our deferred tax assets will not be realized. In making this determination, we are required to give significant weight to evidence that can be objectively verified. It is generally difficult to conclude that a valuation allowance is not needed when there is significant negative evidence, such as cumulative losses in recent years. Forecasts of future taxable income are considered to be less objective than past results. Therefore, cumulative losses weigh heavily in the overall assessment.\nIn addition to considering forecasts of future taxable income, we are also required to evaluate and quantify other possible sources of taxable income in order to assess the realization of our deferred tax assets, namely the reversal of existing deferred tax liabilities, the carryback of losses and credits as allowed under current tax law, and the implementation of tax planning strategies. Evaluating and quantifying these amounts involves significant judgments. Each source of income must be evaluated based on all positive and negative evidence and this evaluation may involve assumptions about future activity. Certain taxable temporary differences that are not expected to reverse during the carry forward periods permitted by tax law cannot be considered as a source of future taxable income that may be available to realize the benefit of deferred tax assets.\nEvery quarter, we perform a realizability analysis to evaluate whether it is more likely than not that all or a portion of our deferred tax assets will not be realized. Our Swiss deferred tax asset realizability analysis relies upon future Swiss taxable income, and considers all available sources of Swiss income based on positive and negative evidence. We give more weight to evidence that can be objectively verified. However, estimating future Swiss taxable income requires judgment, specifically related to assumptions about expected growth rates of future Swiss taxable income, which are based primarily on third party market and industry growth data. Actual results that differ materially from those estimates could have a material impact on our valuation allowance assessment. Swiss interest rates have an impact on the valuation allowance and are based on published Swiss guidance, which generally occurs in the fourth quarter of our fiscal year. Any significant changes to such interest rates could result in a material impact to the valuation allowance and to our Condensed Consolidated Financial Statements. We have adjusted our valuation allowance for changes in the published interest rates in the past and we may do so again in the future. Switzerland has a seven-year carryforward period and does not permit the carry back of losses. Actions we take in connection with "
}