{
  "source_file": "ecl-20250930x10q.htm",
  "form_type": "10-Q",
  "item1_clean": null,
  "item7_clean": null,
  "item2_clean": "Public currency operating income change\nPercentages in the above table do not necessarily sum due to rounding.\nFixed currency and organic sales for Global Life Sciences increased 6% and 5% in the third quarter and first nine months of 2025, respectively, driven by new business wins and progressively improving industry trends. Continued growth in bioprocessing and pharmaceutical & personal care overcame ongoing capacity constraints within Life Sciences’ industrial water purification business.\nOrganic operating income and organic operating income margins increased in the third quarter and first nine months of 2025 for our Global Life Sciences segment.\nOrganic operating income margins increased 1.6 percentage points during the third quarter of 2025, as the 3.6 percentage point positive impact from value pricing and higher volumes were partially offset by the 2.5 percentage point impact of investments in the business. Organic operating income margins increased 4.8 percentage points during the first nine months of 2025, as the 5.6 percentage point positive impact from value pricing and lower delivered product cost were partially offset by the 0.8 percentage point impact of investments in the business.\nConsistent with our internal management reporting, Corporate amounts in the tables on pages 36 and 37 include intangible asset amortization specifically from the Nalco and Purolite transactions and special (gains) and charges that are not allocated to our reportable segments. Items included within special (gains) and charges are shown in the table on page 32.\n\nOur reportable segments do not include the impact of intangible asset amortization from the Nalco and Purolite transactions or the impact of special (gains) and charges as these are not allocated to our reportable segments.\nOur non-GAAP financial measures for organic sales, organic operating income and organic operating income margin are at fixed currency and exclude the impact of special (gains) and charges, the results of our acquired businesses from the first twelve months post acquisition and the results of divested businesses from the twelve months prior to divestiture. Further, due to the sale of the global surgical solutions business on August 1, 2024, we have excluded the results of the business for the nine-month period ended September 30, 2024 from these organic measures to remain comparable to the corresponding period in 2025. In addition, as part of the separation of ChampionX in 2020, we continue to provide certain products to ChampionX, which are recorded in product and equipment sales in the Global Water segment along with the related cost of sales. These transactions are removed from the consolidated results as part of the calculation of the impact of acquisitions and divestitures.\nThese non-GAAP measures are not in accordance with, or an alternative to U.S. GAAP, and may be different from non-GAAP measures used by other companies. Investors should not rely on any single financial measure when evaluating our business. We recommend that investors view these measures in conjunction with the U.S. GAAP measures included in this MD&A and we have provided reconciliations of reported U.S. GAAP amounts to the non-GAAP amounts.\nFORWARD-LOOKING STATEMENTS\nWithout limiting the foregoing, words or phrases such as “will likely result,” “are expected to,” “will continue,” “is anticipated,” “we believe,” “we expect,” “estimate,” “project” (including the negative or variations thereof) or similar terminology, generally identify forward-looking statements. Forward-looking statements may also represent challenging goals for us. These statements, which represent our expectations or beliefs concerning various future events, are based on current expectations that involve a number of risks and uncertainties that could cause actual results to differ materially from those of such forward-looking statements. In particular, the ultimate results of any restructuring or efficiency initiative, integration and business improvement actions, including cost synergies, depend on a number of factors, including the development of final plans, the impact of local regulatory requirements regarding employee terminations, the time necessary to develop and implement the restructuring or efficiency initiative and other business improvement initiatives and the level of success achieved through such actions in improving competitiveness, efficiency and effectiveness. We caution that undue reliance should not be placed on such forward-looking statements, which speak only as of the date made.\n\nItem 2. Management’s Discussion and Analysis of Financial Condition and Results of Operations\nThe following management discussion and analysis (“MD&A”) provides information we believe is useful in understanding our operating results, cash flows and financial condition. We provide quantitative or qualitative information about the material sales drivers including the impact of changes in volume and pricing and the effect of acquisitions and changes in foreign currency at the corporate and reportable segment level. We also provide quantitative information regarding special (gains) and charges, discrete tax items and other significant factors we believe are useful for understanding our results. Such quantitative drivers are supported by comments meant to be qualitative in nature. Qualitative factors are generally ordered based on estimated significance.\nComparability of Results\nImpact of Acquisitions and Divestitures\nOur non-GAAP financial measures for organic sales, organic operating income and organic operating income margin are at fixed currency and exclude the impact of special (gains) and charges, the results of our acquired businesses from the first twelve months post acquisition and the results of divested businesses from the twelve months prior to divestiture.\nIn addition, as part of the separation of ChampionX in 2020, we continue to provide certain products to ChampionX which are recorded in product and equipment sales in the Global Water segment along with the related cost of sales. These transactions are removed from the consolidated results as part of the calculation of the impact of acquisitions and divestitures.\nComparability of Reportable Segments\nEffective January 1, 2025, the Company’s former Global Industrial reportable segment was renamed Global Water and includes the Light & Heavy (previously named Water), Food & Beverage, and Paper operating segments. The Global Institutional & Specialty reportable segment continues to include the Institutional and Specialty operating segments. The Company’s former healthcare operating segment moved into the Institutional operating segment. Global Life Sciences was elevated to a standalone reportable segment. The Global Pest Elimination segment remains a standalone reportable segment. After these changes, the Company has seven operating segments.\nFixed Currency Foreign Exchange Rates\nManagement evaluates the sales and operating income performance of our non-U.S. dollar functional currency international operations based on fixed currency exchange rates, which eliminate the impact of exchange rate fluctuations on our international operations. Fixed currency amounts are updated annually at the beginning of each year based on translation into U.S. dollars at foreign currency exchange rates established by management, with all periods presented using such rates. Public currency rate data provided within the “Segment Performance” section of this MD&A reflect amounts translated at actual public average rates of exchange prevailing during the corresponding period and is provided for informational purposes only.\nOVERVIEW OF THE THIRD QUARTER ENDED SEPTEMBER 30, 2025\nWhen comparing third quarter 2025 against third quarter 2024, sales performance was as follows:\nReported net sales increased 4% to $4,165.0 million and organic sales increased 3%.\nOrganic sales for our Global Water segment increased 2% to $1,929.4 million driven by sales growth in Food & Beverage and Light & Heavy.\nOrganic sales for our Global Institutional & Specialty segment increased 4% to $1,544.4 million driven by growth in both Institutional and Specialty.\nOrganic sales for Global Pest Elimination increased 6% to $321.3 million.\nOrganic sales for our Global Life Sciences segment increased 6% to $171.0 million.\n\nFinancial Performance\nWhen comparing third quarter 2025 against third quarter 2024, our financial performance was as follows:\nReported operating income decreased 27% to $760.2 million, including an unfavorable impact from the prior year gain on the sale of our global surgical solutions business. Organic operating income increased 10%.\nNet income attributable to Ecolab decreased 21% to $585.0 million. Excluding the impact of special (gains) and charges and discrete tax items from both 2025 and 2024 reported results, our adjusted net income attributable to Ecolab increased 13%.\nReported diluted EPS decreased 21% to $2.05. Excluding the impact of special (gains) and charges and discrete tax items from both 2025 and 2024 reported results, adjusted diluted EPS increased 13% to $2.07 in the third quarter of 2025.\nOur reported tax rate was 17.8% during the third quarter of 2025, compared to 25.0% during the third quarter of 2024. Excluding the tax rate impact of special (gains) and charges and discrete tax items from both 2025 and 2024 results, our adjusted tax rate was 20.0% during the third quarter of 2025, compared to 19.7% during the third quarter of 2024.\nRESULTS OF OPERATIONS\nProduct and equipment sales\nService and lease sales\nReported GAAP net sales\nEffect of foreign currency translation\n\nTotal special (gains) and charges\nFor segment reporting purposes, special (gains) and charges are not allocated to reportable segments, which is consistent with our internal management reporting. Per share amounts do not necessarily sum due to rounding.\nOn July 30, 2024, we announced the One Ecolab ini"
}