{
  "source_file": "ecl-20241231x10k.htm",
  "form_type": "10-K",
  "item1_clean": "We directly operate in approximately 100 countries outside of the United States through wholly-owned subsidiaries or, in some cases, through a joint venture with a local partner. In certain countries, selected products are sold by our export operations to distributors, agents or licensees, although the volume of those sales is not significant in terms of our overall revenues. In general, our businesses conducted outside the United States are similar to those conducted in the United States.\nOur business operations outside the United States are subject to the usual risks of foreign operations, including possible changes in trade and foreign investment laws, international business laws and regulations, tax laws, currency exchange rates and economic and political conditions. The profitability of our international operations is generally lower than the profitability of our businesses in the United States, due to (i) the additional cost of operating in numerous and diverse foreign jurisdictions with varying laws and regulations, (ii) higher costs of importing certain raw materials and finished goods in some regions, (iii) the smaller scale of international operations where certain operating locations are smaller in size, and (iv) the additional reliance on distributors and agents in certain countries which can negatively impact our margins. Proportionately larger investments in sales and technical support are also necessary in certain geographies in order to facilitate the growth of our international operations.\nIn general, the markets in which the businesses in our Global Industrial reportable segment compete are led by a few large companies, with the rest of the market served by smaller entities focusing on more limited geographic regions or a smaller subset of products and services. Our businesses in this segment compete on the basis of their demonstrated value, technical expertise, innovation, digital technology, chemical formulations, global customer support, detection equipment, monitoring capabilities, and dosing and metering equipment. Through the combination of our digitally enabled end-to-end water management and hygiene solutions, data-driven insights and personalized service, our Global Industrial businesses deliver outcomes that help our customers optimize water and energy use, improve productivity, advance food safety, and achieve sustainability and net zero goals, while optimizing total cost of operations.\nThe businesses in our Global Institutional & Specialty and Global Pest Elimination reportable segments have two significant classes of competitors. First, we compete with a small number of large companies selling directly or through distributors on a national or international scale. Second, we have numerous smaller regional or local competitors which focus on more limited geographies, product lines and/or end-use customer segments. We believe we compete principally by providing superior value, premium customer support, training, service, and innovative and differentiated products to help our customers protect their brand reputation and improve their operational efficiency.\nWithin the Global Healthcare & Life Sciences reportable segment, the Healthcare business competes geographically with companies primarily focused on a smaller range of product categories, with few globally scaled competitors. The Life Sciences business competes in the European market versus several mid-size and regional competitors and competes against two large and other mid-size or regional competitors in North America. Outside of North America and Europe competitors are much more fragmented and do not offer the same level of service or coverage as Ecolab. Our businesses in this segment compete by enabling our customers success through improved hygiene, digitally enabled programs in operating room and patient room space as well as a tailored approach to delivering key inputs that directly impact our customers patients globally.\nOur products, systems and services are primarily marketed in domestic and international markets by our Company-trained direct field sales personnel who also advise and assist our customers in the proper and most efficient use of the products and systems in order to meet a full range of cleaning and sanitation, water treatment and process chemistry needs. Independent, third-party distributors and, to a lesser extent, sales agents, are utilized in several markets, as described in the segment descriptions found above.\nCustomers and Classes of Products\nWe believe our business is not materially dependent upon a single customer. Additionally, although we have a diverse customer base and no customer or distributor constituted 10 percent or more of our consolidated revenues in 2024, 2023 or 2022, we do have customers and independent third-party distributors, the loss of which could have a material adverse effect on results of operations for the affected earnings periods; however, we consider it unlikely that such an event would have a material adverse impact on our financial position. No material part of our business is subject to renegotiation or termination at the election of a governmental unit.\nWe sold one class of products within the Global Institutional & Specialty reportable segment which comprised 10% or more of consolidated net sales in the last three years. Sales of warewashing products were approximately 12% of consolidated net sales in 2024, 2023 and 2022.\n\nGeneral Development of Business.\nEcolab was incorporated as a Delaware corporation in 1924. Our fiscal year is the calendar year ending December 31. International subsidiaries are included in the consolidated financial statements on the basis of their U.S. GAAP (accounting principles generally accepted in the United States of America) November 30 fiscal year ends to facilitate the timely inclusion of such entities in our consolidated financial reporting.\nNarrative Description of Business.\nA trusted partner for millions of customers, we are a global sustainability leader offering water, hygiene and infection prevention solutions and services that protect people and the resources vital to life. Building on a century of innovation, we have annual sales of $15.7 billion, employ approximately 48,000 associates and sell to customers in more than 170 countries around the world. We deliver comprehensive science-based solutions, data-driven insights and world-class service to advance food safety, maintain clean and safe environments, and optimize water and energy use. Our innovative solutions improve operational efficiencies and sustainability for customers in the food, healthcare, life sciences, hospitality and industrial markets.\nWe pursue a “One Ecolab” enterprise selling strategy, built on the legacy of 'circle the customer – circle the globe', where we provide an array of innovative programs, products and services designed to meet the specific operational and sustainability needs of our customers throughout the world. Through this strategy and our varied product and service mix, one customer may utilize the offerings of several of our operating segments. Important in our business proposition for customers is our ability to produce improved results while reducing their water and energy use. With that in mind, we focus on continually innovating to optimize both our own operations and the solutions we provide to customers, aligning with our corporate strategy to address some of the world’s most pressing and complex sustainability challenges such as water scarcity and climate change. The work we do matters, and the way we do it matters to our employees, customers, investors and the communities in which we and our customers operate.\nSustainability is core to our business strategy. We deliver sustainable solutions that help companies around the world achieve their business goals while reducing environmental impacts. We partner with customers around the world to reduce water and energy use as well as greenhouse gas emissions through our high-efficiency solutions. By partnering with our customers to help them do more with less through the use of our innovative and differentiated solutions, we aim to help our customers conserve more than 300 billion gallons of water annually by 2030. In 2023, we helped our customers conserve more than 226 billion gallons of water and avoid more than 3.8 million metric tons of greenhouse gas emissions.\n\nGlobal Institutional & Specialty\nThis reportable segment consists of the Institutional and Specialty operating segments, which provide specialized cleaning and sanitizing products to the foodservice, hospitality, lodging, government, education and retail industries. The underlying operating segments exhibit similar manufacturing processes, distribution methods and economic characteristics. Descriptions of the two operating segments which comprise our Global Institutional & Specialty reportable segment follow below.\nInstitutional sells specialized cleaners and sanitizers for washing dishes, glassware, flatware, foodservice utensils and kitchen equipment (“warewashing”), plus specialized cleaners for various applications throughout food service operations, on-premise laundries (typically used by hotel and healthcare customers) and general housekeeping functions. We also sell food safety products and equipment, water filters, dishwasher racks and related kitchen sundries to the foodservice, lodging, educational and healthcare industries. Institutional also provides pool and spa treatment programs for hospitality and other commercial customers, as well as a broad range of janitorial cleaning and floor care products and programs to customers in hospitality, healthcare and commercial facilities. Institutional develops various digital monitoring and chemical dispensing systems which are used by our customers to efficiently and safely dispense our cleaners and sanitizers, and through these products, systems and our on-site sales and service expertise, develop better results for our customers including water savings, energy savings and operating efficiency. In addition, Institutional markets a lease program comprised of energy-efficient dishwashing machines, detergents, rinse additives and sanitizers, including full machine maintenance. Through our EcoSure Brand Protection business, Institutional also provides customized on-site evaluations, training and quality assurance services to foodservice and hospitality operations.\nInstitutional sells its products and programs primarily through its direct field sales and corporate account sales personnel. Corporate account sales personnel establish relationships and negotiate contracts with larger multi-unit or “chain” customers. We also utilize independent, third-party foodservice, broad-line and janitorial distributors to provide logistics to end customers that prefer to work through these distributors. Many of these distributors also participate in marketing our product and service offerings to the end customers. Through our field sales personnel, we generally provide the same customer support to end-use customers supplied by these distributors as we do to direct customers.\nWe believe we are one of the leading global suppliers of warewashing and laundry products and programs to the food service, hospitality and lodging markets.\nSpecialty supplies cleaning and sanitizing products and related items primarily to regional, national and international quick service restaurant (“QSR”) chains and food retailers (i.e., supermarkets and grocery stores). Its products include specialty and general purpose hard surface cleaners, degreasers, sanitizers, polishes, hand care products and assorted cleaning tools and equipment which are primarily sold under the “Ecolab” and “Kay” brand names. QSR’s program also includes a lease program comprised of energy-efficient dishwashing machines, detergents, rinse additives and sanitizers, including full machine maintenance. Specia",
  "item7_clean": "CRITICAL ACCOUNTING ESTIMATES\nOur consolidated financial statements are prepared in accordance with U.S. GAAP. We have adopted various accounting policies to prepare the consolidated financial statements in accordance with U.S. GAAP. Our significant accounting policies are disclosed in Note 2 of the Notes to the Consolidated Financial Statements (“Notes”).\nPreparation of our consolidated financial statements, in conformity with U.S. GAAP, requires us to make estimates and assumptions that affect the amounts reported in the consolidated financial statements and accompanying notes. Estimates are considered to be critical if they meet both of the following criteria: (1) the estimate requires assumptions to be made about matters that are highly uncertain at the time the accounting estimate is made, and (2) different estimates that we reasonably could have used for the accounting estimate in the current period, or changes in the accounting estimate that are reasonably likely to occur from period to period, have a material impact on the presentation of our financial condition or results of operations.\nBesides estimates that meet the “critical” estimate criteria, we make many other accounting estimates in preparing our financial statements and related disclosures. All estimates, whether or not deemed critical, affect reported amounts of assets, liabilities, revenues or expenses as well as disclosures of contingent assets and liabilities. Estimates are based on experience and other information available prior to the issuance of the financial statements. Materially different results can occur as circumstances change and additional information becomes known, even from estimates not deemed critical. Our critical accounting estimates include the following:\nRevenue is measured as the amount of consideration expected to be received in exchange for transferring goods or providing service. Revenue from product and sold equipment is recognized when obligations under the terms of a contract with the customer are satisfied, which generally occurs with the transfer of the product or delivery of the equipment. Revenue from service and leased equipment is recognized when the services are provided, or the customer receives the benefit from the leased equipment, which is over time. Service revenue is recognized over time utilizing an input method and aligns with when the services are provided. Typically, revenue is recognized over time using costs incurred to date because the effort provided by the field selling and service organization represents services provided, which corresponds with the transfer of control. Revenue for leased equipment is accounted for under Topic 842 Leases and recognized on a straight-line basis over the length of the lease contract.\nOur revenue policies do not provide for general rights of return. We record estimated reductions to revenue for customer programs and incentive offerings including pricing arrangements, promotions and other volume-based incentives based primarily on historical experience and anticipated performance over the contract period. Depending on market conditions, we may increase customer incentive offerings, which could reduce gross profit margins over the term of the incentive. We also record estimated reserves for product returns and credits based on specific circumstances and credit conditions. We record an allowance for uncollectible accounts based on our estimates of expected future credit losses.\nThe revenue standard can be applied to a portfolio of contracts with similar characteristics if it is reasonable that the effects of applying the standard at the portfolio would not be significantly different than applying the standard at the individual contract level. We apply the portfolio approach primarily within each operating segment by geographical region. Application of the portfolio approach was focused on those characteristics that have the most significant accounting consequences in terms of their effect on the timing of revenue recognition or the amount of revenue recognized. We determined the key criteria to assess with respect to the portfolio approach, including the related deliverables, the characteristics of the customers and the timing and transfer of goods and services, which most closely aligned within the operating segments. In addition, the accountability for the business operations, as well as the operational decisions on how to go to market and the product offerings, are performed at the operating segment level. For additional information on revenue recognition, refer to Note 17.\nLitigation and Environmental Liabilities\nOur business and operations are subject to extensive environmental laws and regulations governing, among other things, air emissions, wastewater discharges, the use and handling of hazardous substances, waste disposal and the investigation and remediation of soil and groundwater contamination. Some risk of environmental liability is inherent in our operations.\nWe record liabilities related to pending litigation, environmental claims and other contingencies when a loss is probable and can be reasonably estimated. Estimates used to record such liabilities are based on our best estimate of probable future costs. We record the amounts that represent the points in the range of estimates that we believe are most probable or the minimum amount when no amount within the range is a better estimate than any other amount. Potential insurance reimbursements generally are not anticipated in our accruals for environmental liabilities or other insured losses. Expected insurance proceeds are recorded as receivables when recovery is deemed certain. While the final resolution of litigation and environmental contingencies could result in amounts different than current accruals, and therefore have an impact on our consolidated financial results in a future reporting period, we believe the ultimate outcome will not have a significant impact on our consolidated financial position. For additional information on our commitments and contingencies, refer to Note 15.\n\nActuarially Determined Liabilities\nPension and Postretirement Healthcare Benefit Plans\nThe measurement of our pension and postretirement benefit obligations are dependent on a variety of assumptions determined by management and used by our actuaries in their valuations and calculations. These assumptions affect the amount and timing of future pension contributions, benefit payments and expense or income recognized.\nThe significant assumptions used in developing the required estimates are the discount rates, expected returns on assets, projected salary and health care cost increases and mortality tables.\nThe discount rate assumptions for our U.S. plans are assessed using a yield curve constructed from a subset of bonds yielding greater than the median return from a population of non-callable, corporate bonds that have an average rating of AA when averaging available Moody’s Investor Services, Standard & Poor’s and Fitch ratings. The discount rates are calculated by matching each plans’ projected cash flows to the bond yield curve. For 2024 and 2023, we measured service and interest costs by applying the specific spot rates along that yield curve to the plans’ liability cash flows. We believe this approach provides a more precise measurement of service and interest costs by aligning the timing of the plans’ liability cash flows to the corresponding spot rates on the yield curve. In determining our U.S. pension obligations and U.S. postretirement health care obligation for 2024, our weighted-average discount rate increased to 5.58% from 4.95% at year-end 2023.\nThe expected rate of return on plan assets reflects asset allocations, investment strategies and views of investment advisors, and represents our expected long-term return on plan assets. Our weighted-average expected returns on U.S. plan assets used in determining the U.S. pension and U.S. postretirement health care expenses was 8.00% for 2024, 7.75% for 2023 and 7.00% for 2022.\nProjected salary is based on our long-term actual experience, the near-term outlook and assumed inflation. Our weighted-average projected salary increase used in determining the U.S. pension expenses was 3.60% for 2024 and 4.03% for 2023 and 2022.\nFor postretirement benefit measurement purposes as of December 31, 2024, the annual rates of increase in the per capita cost of covered health care were assumed to be 8.59% for pre-65 costs. Post-65 costs are no longer used. The rates are assumed to decrease each year until they reach 4.5% in 2035 and remain at those levels thereafter.\nWe use mortality tables appropriate in the circumstances, which generally are the recently available mortality tables as of the respective U.S. and international measurement dates. Our year-end U.S. valuations reflect mortality tables that estimate the impacts of COVID in an endemic state. This represents a change from prior year when the impact of COVID on future mortality could not be reasonably estimated.\nThe effects of actual results differing from our assumptions, as well as changes in assumptions, are reflected in the unrecognized gains or losses and amortized into earnings in the future. Significant differences in actual experience or significant changes in assumptions may materially affect future pension and other postretirement obligations and income or expense. The unrecognized net losses on our U.S. qualified and non-qualified pension plans increased to $526 million as of December 31, 2024, from $495 million as of December 31, 2023 (both before tax), primarily due to lower actual return on assets partially offset by current year net actuarial gains.\nThe effect of a decrease in the discount rate or in the expected return on assets assumption as of December 31, 2024, on the December 31, 2024 defined benefit obligation and 2025 expense is shown below, assuming no changes in benefit levels. Expense amounts reflect the accounting for gains or losses as a component of other comprehensive income or expense and recognition of the impacts into earnings over time:\nEffect on U.S. Pension Plans\n\nfood & beverage, restaurants and food retail.\nOrganic operating income in Global Pest Elimination increased in 2024 compared to 2023. Organic operating income margins decreased in 2024 when compared to 2023.\nOrganic operating income margins in Global Pest Elimination decreased 0.6 percentage points in 2024, as the 4.4 percentage point positive impacts from strong pricing and higher volumes were more than offset by the 5.8 percentage point negative impacts of investments in the business and costs associated with a fourth quarter spike in accidents.\nConsistent with our internal management reporting, Corporate amounts in the table on page 37 include sales to ChampionX in accordance with the transitional supply agreement entered into with the transaction post-separation, as discussed in Note 17, intangible asset amortization specifically from the Nalco and Purolite transactions and special (gains) and charges that are not allocated to our reportable segments. Items included within special (gains) and charges are shown in the table on page 33.\n\nItem 7. Management’s Discussion and Analysis of Financial Condition and Results of Operations.\nThe following management discussion and analysis (“MD&A”) provides information that we believe is useful in understanding our operating results, cash flows and financial condition. We provide quantitative information about the material sales drivers including the impact of changes in volume and pricing and the effect of acquisitions and changes in foreign currency at the corporate and reportable segment level. We also provide quantitative information regarding special (gains) and charges, discrete tax items and other significant factors we believe are useful for understanding our results. Such quantitative drivers are supported by comments meant to be qualitative in nature. Qualitative factors are generally ordered based on estimated significance.\nComparability of Results\nImpact of Acquisitions and Divestitures\nOur non-GAAP financial measures for organic sales, organic operating income and organic operating income margin are at fixed currency and exclude the impact of special (gains) and charges, the results of our acquired businesses from the first twelve months post acquisition and the results of divested businesses from the twelve months prior to divestiture. As part of the separation of ChampionX in 2020, we entered into an agreement with ChampionX to provide, receive or transfer certain products for a transitionary period. Transitionary period sales of product to ChampionX under this agreement are recorded in product and equipment sales in the Corporate segment along with the related cost of sales. The remaining sales to ChampionX are recorded in product and equipment sales in the Global Industrial segment along with the related cost of sales. Further, due to the sale of the global surgical solutions business on August 1, 2024, we have excluded the results of the business for August through December 2023 from these organic measures for the year ended December 31, 2023 to remain comparable to the corresponding period in 2024. These transactions are removed from the consolidated results as part of the calculation of the impact of acquisitions and divestitures.\nComparability of Reportable Segments\nEffective January 1, 2024, the former Textile Care and Colloidal Technologies Group (“CTG”) operating segments are now part of the Water operating segment which continues to remain in the Global Industrial reportable segment. Additionally, the Pest Elimination operating segment, formerly aggregated with the Textile Care and CTG operating segments within Other, is now reported as the stand-alone Global Pest Elimination reportable segment. We made other immaterial changes, including the movement of certain customers and cost allocations between reportable segments. After these changes, we have eight operating segments.\nFixed Currency Foreign Exchange Rates\nManagement evaluates the sales and operating income performance of our non-U.S. dollar functional currency international operations based on fixed currency exchange rates, which eliminate the impact of exchange rate fluctuations on our international operations. Fixed currency amounts are updated annually at the beginning of each year based on translation into U.S. dollars at foreign currency exchange rates established by management, with all periods presented using such rates. Public currency rate data provided within the “Segment Performance” section of this MD&A reflect amounts translated at actual public average rates of exchange prevailing during the corresponding period and is provided for informational purposes only.\n\nPublic currency operating income change\nPercentages in the above table do not necessarily sum due to rounding.\nReported sales for 2024 reflected the sale of Ecolab’s global surgical solutions business, which closed in the third quarter 2024. Organic sales for Global Healthcare & Life Sciences increased in 2024 as compared to 2023 driven by continued growth in Life Sciences partially offset by modestly lower Healthcare sales. Organic sales for Global Healthcare & Life Sciences increased in 2023 as compared to 2022 driven by strong pricing and new business wins.\nAt an operating segment level,\norganic sales decreased 1% in 2024 as strategic low margin business exits were partially offset by value pricing. Organic sales increased 7% in 2023 driven by pricing and strong growth in North America.\norganic sales increased 3% in 2024 reflecting new business wins and progressively improving industry trends. Organic sales increased 1% in 2023 as pricing was more than offset by soft near-term industry demand.\nOrganic operating income and organic operating income margins for our Global Healthcare & Life Sciences segment b",
  "item2_clean": null
}