{
  "source_file": "ed-20241231.htm",
  "form_type": "10-K",
  "item1_clean": "greenhouse gas emissions reduction targets mandated by the CLCPA. Meeting the goals of the CLCPA will require capital expenditures above historic norms. While the details of CECONY’s investments will continue to be addressed in its rate cases or other filings, subject to the approval of the NYSPSC, CECONY projects that $72 billion of capital expenditures will be needed between 2025 and 2034 to implement its strategy.\nIn an effort to meet the CLCPA’s offshore wind goals, load serving entities, such as CECONY and O&R, will be required to purchase offshore wind renewable energy credits beginning in 2026 when NYSERDA's offshore wind projects are expected to begin operation.\nNYSERDA has issued competitive solicitations for offshore wind energy resulting in two projects that are in development, Sunrise Wind (924 MW), a project that began construction in June 2024 and is expected to enter commercial operation in 2026 and Empire Wind 1 (810 MW), a project that is expected to enter commercial operation in 2027 and connect to the New York City electrical grid at CECONY’s Gowanus substation. In March 2024, FERC approved the interconnection agreement among Empire Offshore Wind LLC, the NYISO and CECONY. In May 2024, the NYSPSC approved a certificate of public convenience and necessity to allow construction of Empire Wind 1 to begin. In February 2025, the NYSPSC granted final approval of Empire Offshore Wind LLC's petition to construct and operate the New York offshore and onshore transmission facilities for Empire Wind 1. At December 31, 2024, New York has one operating offshore wind farm that was awarded a contract by LIPA, the South Fork Wind Farm (132 MW). See “Federal Regulation,” above.\nBuilding Electrification and Energy Efficiency\nIn January 2020, and updated in August 2022, the NYSPSC issued an order directing energy efficiency targets and budgets for New York utilities. The order approved electric and gas energy efficiency programs and heat pump budgets for building electrification, and associated targets, for the years 2020 through 2025 to meet the NYSPSC’s goal of reducing electric use by 3 percent annually and gas use by 1.3 percent annually by 2025. The order and subsequent update authorized budgets for the years 2020 through 2025 for: electric energy efficiency programs of $688 million and $71 million for CECONY and O&R, respectively; gas energy efficiency programs of $338 million and $17 million for CECONY and O&R, respectively; and heat pump programs of $1,106 million and $15 million for CECONY and O&R, respectively. CECONY’s current electric and gas rate plans allow it to recover the costs of heat pumps for building electrification and energy efficiency expenditures, including a full rate of return, in rates from customers. See Note B to the financial statements in Item 8.\nIn November 2023, and updated in January 2024, CECONY and O&R filed preliminary proposals for energy efficiency and heat pump programs for 2026-2030 with aggregate budgets of approximately $2,744 million and $129 million, respectively. The aggregate amounts are comprised of average annual budgets of up to: $373 million and $22 million for electric energy efficiency and heat pump programs for CECONY and O&R, respectively, $150 million and $4 million for gas energy efficiency programs for CECONY and O&R, respectively, and $26 million for steam energy efficiency programs for CECONY. These amounts are subject to approval by the NYSPSC.\nIn July 2020, the NYSPSC established light-duty electric vehicle make-ready and other infrastructure programs that included budgets of $290 million and $24 million for CECONY and O&R, respectively, through 2025. In November 2023, the light-duty infrastructure and other programs, including medium and heavy-duty make-ready pilot projects and a new micromobility infrastructure incentive program, were expanded to approximately $823 million for CECONY and $56 million for O&R, with the ability to extend beyond 2025. The NYSPSC authorized CECONY and O&R to recover these costs, including a full rate of return, through surcharge mechanisms and subsequently in rates from customers.\nIn July 2022, the NYSPSC issued an order that provides CECONY and O&R with up to a total of $31 million and $5.8 million, respectively, through 2025, for implementation of residential vehicle managed charging programs and administration costs. The NYSPSC authorized CECONY and O&R to recover these costs through surcharge mechanisms. The order also provides CECONY and O&R with authorization to offer incentives to encourage electric vehicle charging to occur overnight and during off-peak times totaling approximately $71.8 million and $8.2 million, respectively, through 2025, that would be recovered through the respective company’s revenue reconciliation mechanisms.\nIn October 2022, the NJBPU approved RECO’s electric vehicle make-ready program that includes a budget of $7.6 million through 2026 for electric vehicle infrastructure and related program costs. The NJBPU authorized RECO to recover these costs, including a full rate of return, in rates from customers.\nCON EDISON ANNUAL REPORT 2024\nIn November 2023, the NYSPSC issued an order that provides CECONY and O&R with up to $432 million and $18 million through 2026, respectively, for the implementation of commercial managed charging programs and demand charge rebates, participant incentives and administration costs. The NYSPSC authorized CECONY and O&R to recover these costs, including a full rate of return, through surcharge mechanisms and subsequently in rates from customers.\nIn June 2024, the NYSPSC issued an order adopting an updated roadmap for achieving 6,000 MW of statewide energy storage resource deployment by 2030 and recognized the need for additional statewide energy storage of 12,000 MW by 2040 and 17,000 MW by 2050. The NYSPSC directed New York utilities, including CECONY and O&R, to study the potential of energy storage to provide non-market transmission and distribution services and identify services for which energy storage is suitable.\nCECONY owns and operates two energy storage projects located in Ozone Park, Queens and Fox Hills, Staten Island that are designed to store 1.5 MW/12 MWh and 7.5 MW/30 MWh of energy, respectively. A third energy storage project is under construction in Brownsville, Brooklyn that is designed to store 5.8 MW of energy and that is expected to be completed in 2025. CECONY has procured 115 MW of utility dispatch rights from energy storage projects, is negotiating contracts for additional storage projects and has released a request for proposal for additional utility dispatch rights. The long-term contracts provide CECONY with the right to dispatch energy from the storage projects for both wholesale market and grid purposes. O&R owns and operates an energy storage project located in Pomona, New York that is designed to store 3 MW of energy. O&R is evaluating bids from storage developers for utility dispatch rights. The Utilities expect to recover the cost of energy storage services, including a full rate of return, in rates and surcharges from customers.\nThermal Energy Networks\nIn April 2024, the NYSDPS approved CECONY’s and O&R’s December 2023 Stage 1 filings (Project Scope, Feasibility, and Stakeholder Engagement) for utility-scale thermal energy network pilot projects. The NYSDPS also confirmed CECONY and O&R are authorized to incur costs of $17.1 million and $4.6 million, respectively, through the completion of Stage 2 (Pilot Project Engineering Design and Customer Protection Plan). These projected costs are within the budgets previously proposed by CECONY and O&R in December 2023 of $255 million and $46 million, respectively. In December 2024, the NYSPSC issued an order approving CECONY’s May 2024 petition seeking $6 million for certain unaddressed costs that are necessary to complete Stage 2 of its utility thermal energy network pilot projects, in addition to the $17.1 million described above. The remaining proposed budget amounts are subject to approval by the NYSPSC.\nDistribution System and Distributed Resources\nThe NYSPSC is directing development by New York electric utilities of a distributed system platform to manage and coordinate distributed energy resources in their service areas under NYSPSC regulation and to provide customers, together with third parties, with data and tools to better manage their energy use. The NYSPSC has required the Utilities to file distributed system implementation plans and ordered the Utilities to develop demonstration projects to inform distributed system platform business models. As of December 31, 2024, CECONY and O&R had three and one active demonstration projects, respectively.\nThe NYSPSC approved CECONY’s and O&R’s advanced metering infrastructure (AMI) installation plans for their electric and gas delivery businesses, at a cost of $1,285 million and $98.5 million, respectively, and such work was completed in 2024 and 2020, respectively.\nThe NYSPSC began to change compensation for DERs and place limits on net energy metering (NEM) in 2015. In New York, NEM compensates kilowatt-hours exported to the electric distribution system at the full-service rate for production, delivery, taxes and fees. NYSPSC’s policy is to phase in changes to limit annual bill increases on non-participating customers to two percent. In addition, NEM projects interconnected on or after January 1, 2022 are charged for their share of energy efficiency and other public policy benefit programs.\nNew York City’s Clean Energy Goals\nIn 2014, New York City announced a goal to reduce GHG emissions 80 percent below 2005 levels by 2050. In May 2019, New York City enacted a package of legislation known as the Climate Mobilization Act, that includes provisions intended to reduce GHG emissions from large buildings by 40 percent from 2005 levels by 2030. Building owners may achieve compliance through operational changes, building retrofits, the purchase of GHG offsets, the purchase of renewable energy credits and the use of clean distributed energy resources. CECONY is unable to predict the impact on it of the implementation of this law.\nCON EDISON ANNUAL REPORT 2024\n\nO&R\nO&R and its utility subsidiary, Rockland Electric Company (RECO) (together referred to herein as O&R) provide electric service to approximately\nmillion customers in southeastern New York and northern New Jersey, an approximately 1,300 square mile service area.\nO&R delivers gas to over\nmillion customers in southeastern New York.\nCon Edison Transmission\nCon Edison Transmission, through its subsidiaries, invests in electric transmission projects and manages, through joint ventures, both electric and gas assets while seeking to develop electric transmission projects. Con Edison Transmission is considering strategic alternatives with respect to its investment in Mountain Valley Pipeline, LLC (MVP) and both Con Edison Transmission and CECONY are considering strategic alternatives with respect to their investments in Honeoye Storage Corporation (Honeoye). See “Con Edison Transmission,” below.\nState Utility Regulation\nThe Utilities are subject to regulation by the NYSPSC, that under the New York Public Service Law, is authorized to set the terms of service and the rates the Utilities charge for providing service in New York. See “Rate Plans,” below and in Note B to the financial statements in Item 8. The NYSPSC also approves the issuance of the Utilities’ securities and transactions between the Utilities and Con Edison and its other subsidiaries. See “Capital Resources,” below and Note U to the financial statements in Item 8. The NYSPSC exercises jurisdiction over the siting of electric transmission lines in New York State (see “Con Edison Transmission,” below) and approves mergers or other business combinations involving New York utilities.\nIn addition, under the New York Public Service Law, the NYSPSC has the authority to (i) impose penalties on N",
  "item7_clean": "The Companies recorded asset retirement obligations associated with the removal of asbestos and asbestos-containing material in their buildings (other than the structures enclosing generating stations and substations), electric equipment and steam and gas distribution systems. The Companies also recorded asset retirement obligations relating to gas and oil pipelines abandoned in place and municipal infrastructure support. See Note T to the financial statements in Item 8.\nA 1 percent increase in the assumed inflation rate used to value the ARO liability as of December 31, 2024 would increase the liability by $27 million for Con Edison and CECONY.\nAccounting for Income Taxes\nThe Companies record provisions for income taxes, deferred tax assets and liabilities, valuation allowances against net deferred tax assets, if any, and reserves for uncertain tax positions. The reporting of tax-related assets and liabilities requires the use of estimates and significant judgments by management. Deferred federal and state tax assets and liabilities are recorded to represent future effects on income taxes for temporary differences between the basis of assets for financial reporting and tax purposes. Although management believes that current estimates for deferred tax assets and liabilities are reasonable, actual results could differ from these estimates for several reasons, including, but not limited to: a change in forecasted financial condition and/or results of operations; changes in income tax laws, enacted tax rates or amounts subject to income tax or state apportionments; the form, structure, and timing of asset or stock sales or dispositions; changes in the regulatory treatment of any tax reform benefits; and changes resulting from audits and examinations by taxing authorities. Valuation allowances against deferred tax assets are recorded when management concludes it is more likely than not such tax benefit will not be realized in future periods. Accounting for income taxes also requires that only tax benefits for positions taken or expected to be taken on tax returns that meet the more-likely-than-not recognition threshold can be recognized or continue to be recognized. Management evaluates each position solely on the technical merits and facts and circumstances of the position, assuming that the position will be examined by a taxing authority that has full knowledge of all relevant information. Significant judgment is required to determine recognition thresholds and the related amount of tax benefits to be recognized. At each period end, and as new developments occur, management reevaluates its tax positions. Additional interpretations, regulations, amendments, or technical corrections related to the federal income tax code as a result of the Inflation Reduction Act, may impact the estimates for income taxes discussed above. See “Changes To Tax Laws Could Adversely Affect the Companies” in Item 1A, “Inflation Reduction Act” above, “Federal Income Tax” and “State Income Tax” in Note A and Note L to the financial statements in Item 8.\nFinancial and Commodity Market Risks\nThe Companies are subject to various risks and uncertainties associated with financial and commodity markets. The most significant market risks include interest rate risk, commodity price risk and investment risk.\nThe Companies' interest rate risk primarily relates to new debt financing needed to fund capital requirements, including the capital expenditures of the Utilities and maturing debt securities, and variable-rate debt. Con Edison and its subsidiaries manage interest rate risk through the issuance of mostly fixed-rate debt with varying maturities and through opportunistic refinancing of debt. Con Edison and CECONY estimate that at December 31, 2024 and 2023\n, a 10 percent increase in interest rates applicable to its variable rate debt would result in an increase in annual interest expense of $15 million and $12 million, respectively. Unde\nr CECONY’s current electric, gas and steam rate plans, variations in actual variable rate tax-exempt debt interest expense, including costs associated with the refinancing of the variable rate tax-exempt debt, are reconciled to levels reflected in rates.\nHigher interest rates have resulted in increased interest expense on commercial paper, variable-rate debt and long-term debt issuances.\nCommodity Price Risk\nCon Edison’s commodity price risk primarily relates to the purchase and sale of electricity, gas and related derivative instruments. The Utilities apply risk management strategies to mitigate their related exposures. See Note P to the financial statements in Item 8.\nCON EDISON ANNUAL REPORT 2024\nCon Edison estimates that, as of December 31, 2024, a 10 percent decline in market prices would result in a decline in fair value of $150 million for the derivative instruments used by the Utilities to hedge purchases of electricity and gas, of which $137 million is for CECONY and $13 million is for O&R. As of December 31, 2023, Con Edison estimated that a 10 percent decline in market prices would result in a decline in fair value of $149 million for the derivative instruments used by the Utilities to hedge purchases of electricity and gas, of which $138 million is for CECONY and $11 million is for O&R. Con Edison expects that any such change in fair value would be largely offset by directionally opposite changes in the cost of the electricity and gas purchased.\nThe Utilities do not make any margin or profit on the electricity or gas they sell. In accordance with provisions\napproved by state regulators, the Utilities generally recover from full-service customers the costs they incur for energy purchased for those customers, including gains and losses on certain derivative instruments used to hedge energy purchased and related costs. See “Recoverable Energy Costs” in Note A to the financial statements in Item 8. However, increases in electric and gas commodity prices may contribute to a slower recovery of cash from outstanding customer accounts receivable balances.\nThe Companies’ investment risk relates to the investment of plan assets for their pension and other postretirement benefit plans. Con Edison's investment risk also relates to the investments of Con Edison Transmission that are accounted for under the equity method. See “Critical Accounting Estimates – Accounting for Pensions and Other Postretirement Benefits,” above and “Investments” in Note A and Notes E and F to the financial statements in Item 8.\nThe Companies’ current investment policy for pension plan assets includes investment targets of 26 to 30 percent equity securities, 42 to 60 percent debt securities, 14 to 30 percent alternatives. At December 31, 2024, the pension plan investments consisted of 27 percent equity securities, 51 percent debt securities and 22 percent alternatives.\nFor the Utilities’ pension and other postretirement benefit plans, regulatory accounting treatment is generally applied in accordance with the accounting rules for regulated operations. In accordance with the Statement of Policy issued by the NYSPSC and its current electric, gas and steam rate plans, CECONY defers for payment to or recovery from customers the difference between the pension and other postretirement benefit expenses and the amounts for such expenses reflected in rates. O&R also defers such difference pursuant to its New York rate plans.\nEnvironmental Matters\nFor information concerning climate change, environmental sustainability, potential liabilities arising from laws and regulations protecting the environment and other environmental matters, see “Environmental Matters” in Item 1 and Note G to the financial statements in Item 8.\nMaterial Contingencies\nFor information concerning potential liabilities arising from the Companies’ material contingencies, see “Critical Accounting Estimates – Accounting for Contingencies,” above, and Notes B, G and H to the financial statements in Item 8.\nCON EDISON ANNUAL REPORT 2024\n\nItem 7: Management’s Discussion and Analysis of Financial Condition and Results of Operations\nThis combined management’s discussion and analysis of financial condition and results of operations (MD&A) relates to the consolidated financial statements included in this report of two separate registrants: Con Edison and CECONY, and should be read in conjunction with the financial statements and the notes thereto. As used in this report, the term the “Companies” refers to Con Edison and CECONY. CECONY is a subsidiary of Con Edison and, as such, information in this management’s discussion and analysis about CECONY applies to Con Edison.\nInformation in any item of this report referred to in this discussion and analysis is incorporated by reference herein. The use of terms such as “see” or “refer to” shall be deemed to incorporate by reference into this discussion and analysis the information to which reference is made.\nCon Edison’s principal business operations are those of the Utilities and Con Edison Transmission. CECONY is a regulated utility that provides electric service in New York City and New York's Westchester County, gas service in Manhattan, the Bronx, parts of Queens and parts of Westchester, and steam service in Manhattan. O&R is a regulated utility serving customers in a 1,300-square-mile-area in southeastern New York State and northern New Jersey. Con Edison Transmission, through its subsidiaries, invests in electric transmission projects and manages, through joint ventures, both electric and gas assets while seeking to develop electric transmission projects. Con Edison Transmission is considering strategic alternatives with respect to its investment in MVP and both Con Edison Transmission and CECONY are considering strategic alternatives with respect to their investments in Honeoye. See “Con Edison Transmission” in Item 1.\nIn addition to the risks and uncertainties described in Item 1A and the Companies’ material contingencies described in Notes B, G and H to the financial statements in Item 8, the Companies’ management considers the following events, trends, and uncertainties to be important to understanding the Companies’ current and future financial condition.\nThe success of the Companies’ efforts to meet federal, state and city clean energy policy goals and the impact of energy consumers' efforts to meet such goals on CECONY’s electric, gas and steam businesses and O&R’s electric and gas businesses may impact the Companies’ future financial condition. The Utilities expect electric usage to increase and gas and steam usage to decrease in their service territories as federal, state and local laws and policies are enacted and implemented that aim to reduce the carbon intensity of the energy that is consumed in their respective jurisdictions. The Utilities’ and their regulators’ efforts to maintain electric reliability in their service territories as electric usage increases may also impact the Companies’ future financial condition. The long-term future of the Utilities’ gas businesses depends upon the role that natural gas or other gaseous fuels will play in facilitating New York State’s and New York City’s climate goals. In addition, the impact and costs from climate change impacts on the Utilities’ systems and the success of the Utilities’ efforts to maintain system reliability and manage service interruptions resulting from severe weather may impact the Companies’ future financial condition, results of operations and liquidity.\nAged Accounts Receivable Balances\nAt December 31, 2024, CECONY’s and O&R’s customer accounts receivables balances of $2,947 million and $113 million, respectively, included aged accounts receivables (balances outstanding in excess of 60 days) of $1,652 million and $32 million, respectively. In comparison, CECONY’s and O&R’s customer accounts receivable balances at February 28, 2020 were $1,322 million and $89 million, respectively, including aged accounts receivables (balances outstanding in excess of 60 days) of $408 million and $15 million, respectively. Prior to the start of the COVID-19 pandemic, the Utilities’ practice was to write off customer accounts receivables as uncollectible 90 days after the account is disconnected for non-payment or the account is closed during the collection process. In general, the Utilities suspended collection activities and service disconnections during the COVID-19 pandemic and have since resumed such activities.\nCECONY’s rate plans include reconciliation of late payment charges (from January 1, 2023 through December 31, 2025 for electric and gas and from January 1, 2020 through October 31, 2026 for steam) and write-offs of customer accounts receivable balances (from January 1, 2020 through December 31, 2025 for electric and gas and from\nCON EDISON ANNUAL REPORT 2024\n\nNet income for common stock and earnings per share from the Clean Energy Businesses for the year ended December 31, 2023 reflects\n$2 million or $0.01 a share (after-tax) of the effects of HLBV accounting for tax equity investments in certain renewable electric projects. Net income for common stock and earnings per share from the Clean Energy Businesses also includes $(9) million or $(0.03) a share of net after-tax mark-to-market effect\n. Depreciation and amortization expenses on their assets of $31 million or $0.08 a share (after-tax) were not recorded for the year ended December 31, 2023. On March 1, 2023, Con Edison completed the sale of all of the stock of the Clean Energy Businesses. See Note W and Note X to the financial statements in Item 8. See Note S to the financial statements in Item 8.\n(b) Net income for commo\nn stock and earnings per share from Con Edison Transmission for the year ended December 31, 2024 includes $5 million or $0.01 a share (a\nfter-tax) for accretion of the basis difference of Con Edison's equity investment in Mountain Valley Pipeline, LLC. See “Investment in Mountain Valley Pipeline, LLC (MVP)” in Note A to the financial statements in Item 8.\n(c) Other includes the parent company, Con Edison’s tax equity investments, consolidation adjustments and Broken Bow II, the deferred project held for sale at December 31, 2024, the sale and transfer of which was completed in January 2025. See Note X to the financial statements in Item 8. Net income for common stock and earnings per share for the year ended December 31, 2024 incl\nudes $(46) million (after-tax) or $(0.13) a share (after-tax) for\nadjustments related to the sale of all of the stock of the Clean Energy Bu\nsinesses. Net income for common stock and earnings per share for the year ended December 31, 2024 also includes $(3) million (after-tax) or $(0.01) a share (after-tax) of income tax impact on the effects of HLBV accounting for tax equity investments in certain renewable electric projects. Impact of the sale of the Clean Energy Businesses on the changes in state unitary tax apportionments (net of federal taxes) for the year ended December 31, 2024 is $(3 million) or $(0.01) per share. Net income for common stock and earnings per share for the year ended December 31, 2023 includes $(11) million or $(0.03) a share (after-tax) of income tax\nimpact on the effects of HLBV accounting for tax equity investments in certain renewable electric projects and an immaterial amount or $0.00 a share of income tax impact on the net after-tax mark-to-market effects. Net income for common stock for the year ended December 31, 2023 also includes $(14) million and $(0.04) a share of transaction cost\ns and other accruals related to the sale of the Clean Energy Businesses (net of tax). Impact of the sale of the Clean Energy Businesses on the changes in state unitary tax apportionments (net of federal taxes) for the year ended December 31, 2023 is $(7 million) or $(0.02) per share. D\nepreciation and amortization expenses on the assets of the Clean Energy Businesses $(3) million or $(0.01) a share (after-tax) were not recorded for the ",
  "item2_clean": null
}