{
  "source_file": "efx-20241231.htm",
  "form_type": "10-K",
  "item1_clean": "Our Asia Pacific operation provides consumer and commercial information solutions products, marketing products, employment verification services and consumer credit protection products. We offer a full range of products, generated from credit records and other data, including credit reporting and scoring, decisioning technology, risk management, identity management, authentication and fraud detection services. Our consumer and commercial products are the primary source of revenue in each of the countries in which we operate and include credit reporting, decisioning tools and risk management services. We also provide information, technology and services to support talent management, as well as debt collections and recovery management. Additionally, we provide a variety of consumer and commercial marketing products generated from information databases, including business profile analysis, business prospect lists and database management. The countries in which we operate include Australia, New Zealand and India, as well as Cambodia, Malaysia and Singapore through joint ventures.\nSimilar to the USIS business units, our Canada operation offers products derived from the credit information that we maintain about individual consumers and businesses. We offer many products in Canada, including credit reporting, monitoring and scoring, consumer and commercial marketing, risk management, fraud detection and modeling services, identity management and authentication services, together with certain of our decisioning products that facilitate pre-approved offers of credit and automate a variety of credit decisions. We also offer credit monitoring products to resellers or directly to consumers, as well as commercial credit solutions, which help businesses manage financial and credit risk and gain insights on customers, markets and industry groups using our commercial data assets. We also provide data, technology and services to facilitate the search of land data and process real estate transactions in Canada.\nThe market for our products and services is highly competitive and is subject to constant change. Our competitors vary widely in size and in the nature of the products and services they offer. Sources of competition are numerous and include the following:\nCompetition in the Verification Services business, for both the U.S. and key International segments of Australia, Canada and the U.K., is highly competitive with low barriers to entry and includes employers who manage verifications in-house, lenders who obtain verifications directly from employers, and numerous online and offline firms that provide verification services. Third parties may also seek to obtain verifications directly from employees by leveraging paper copies of information or by seeking employee credentials to access information systems. Competition in the U.S. Employer Services business is also highly competitive with low barriers to entry and includes in-house management of such services or the outsourcing of one or more of such services to numerous online and offline third-party outsourced providers; human resources consulting firms; human resources management services providers; payroll processors; accounting firms; and hundreds of smaller companies that provide one or multiple offerings that compete with our Employer Services business.\nCompetition for our credit information solutions and direct-to-consumer solutions products varies by both application and industry, but generally includes global consumer credit reporting companies that offer a product suite similar to our credit information solutions, providers of personal identity theft protection services and providers offering free credit scores. There are also a large number of competitors who offer competing products in specialized areas (such as fraud prevention, risk management and application processing and decisioning solutions) and software companies offering credit modeling services or analytical tools. We believe our product provides the greatest value for customers given our decisioning technology and the features and functionality of our analytical capabilities. We emphasize our improved decision making and product quality while remaining competitive on price.\nCompetition for our commercial solutions products primarily includes companies providing commercial credit reports, credit marketing and other business insights and analytics, including providers of these services in the international markets we serve.\nCompetition for our debt collection and recovery management software, services and analytics is spread across a number of providers. We believe that the breadth and depth of our offering enables our clients to develop a more current and comprehensive view of consumers. In the category of platforms and analytics, we compete with entities that deploy collections platforms, account management systems or recovery solutions.\nWhile we believe that none of our competitors offers the same mix of products and services as we do, we have strong competition in every category and certain competitors may have a larger share of particular geographic or product markets or operate in geographic areas where we do not currently have a presence.\nWe assess the principal competitive factors affecting our markets to include: our ability to protect information and systems; product attributes such as quality, depth, coverage, adaptability, scalability, interoperability, functionality and ease of use; product price; technical performance including system response time and availability; access to unique proprietary data tools; quickness of response, flexibility and client services and support; effectiveness of sales and marketing efforts; existing market penetration; proprietary technology; and new product innovation.\nTechnology and Intellectual Property\n\nOur vision is to be a trusted global leader in data, analytics and technology that creates innovative solutions and insights for our customers. Our business strategy is driven by the following imperatives:\nLeverage our Equifax Cloud capabilities to accelerate innovation, new products and growth.\nOur cloud data and technology transformation has changed nearly every facet of our global technology infrastructure, including a migration to a public cloud environment that employs virtual private cloud deployment techniques. Central to our move to cloud-native technology is our custom single data fabric, which is a cloud native platform that enables Equifax to build, manage and deploy data products, as well as implementation of best-in-class cloud-based tools and capabilities. Our growth strategy includes leveraging our cloud data and technology transformation to accelerate innovation and new product development, deliver market-leading capabilities to our customers, facilitate customer and partner implementation and integration, improve ease of consumer access to and interaction with Equifax, and strengthen system resiliency and uptime.\nLeverage and expand our differentiated portfolio of data assets.\nWe use proprietary advanced analytical platforms, including capabilities in machine learning, artificial intelligence and advanced visualization tools, to leverage our unique data to develop leading analytical insights that enhance the precision of our customers’ decisioning activities. Our cloud-native technology simplifies our customers’ access to our leading analytical and decisioning platforms, allowing us to accelerate the development of unique insights and the conversion of these insights into innovative new products and services consumable by our customers through our delivery platforms. We strive to advance these capabilities and bring our customers multi-data solutions at scale by expanding our unique and differentiated data assets and analytics through organic growth, business acquisitions and partnerships.\nFoster a culture of putting customers and consumers first.\nWe are focused on maintaining a culture in which our customers and consumers are at the center of our decision processes, and where we exceed customer and consumer expectations by delivering solutions with speed, flexibility, stability and performance. We prioritize engagement with our customers and strive to accelerate innovation through collaboration. We seek to leverage our cloud native technology and unique data assets and capabilities, as well as customer expertise and data and technology assets, to drive the development of high-value analytical products and services designed to address a broader range of customer and consumer needs. We work to maximize the value of our differentiated data assets, analytics and decisioning to drive new products and services that provide a fuller picture of consumers and commercial entities to our customers in banking and financial services, government, employee hiring and onboarding and other service providers.\nExecute strategic acquisitions that expand our data portfolio and capabilities and drive revenue growth.\nA critical lever of our strategy is inorganic growth through accretive and strategic acquisitions that drive incremental annual revenue growth. Our acquisition priorities are clear and focused on re-investing in acquisitions that expand our unique differentiated data assets and solutions to strengthen and grow our core businesses. We continue to invest, including through acquisitions and partnerships, to expand our addressable markets and the data and capabilities we offer to solve customer challenges across the services we provide and to expand our access to differentiated data including across identity authentication, fraud mitigation and risk management. We believe there are opportunities to continue to expand in the U.S. and internationally, across the existing financial, mortgage, telecommunications, automotive, insurance, talent management, human resource services, government and other markets that we serve, as well as in new and emerging market segments.\nContinue our leadership in data security.\nWe are committed to being an industry leader in security. We have built an Equifax culture that prioritizes security, and we consider data and technology security, and more broadly risk management, as a primary requirement in all decisions. We make extensive use of advanced data and technology security tools, techniques, services and processes in order to enhance our ability to protect the information with which we are entrusted. We are committed to working openly with our peers, customers and partners to tackle emerging security challenges, document best practices, provide vital data security thought leadership and work together to deliver solutions that benefit both the security community and consumers.\nBuild a world-class Equifax team by investing in talent to drive our strategy and promote a culture of innovation.\nAt Equifax, we are committed to nurturing a culture where talent thrives. We are focused on providing meaningful opportunities for career advancement and development, fostering an inclusive work environment, and promoting employee engagement and recognition. We leverage our enterprise-wide talent\ninitiatives to develop, retain and attract a highly-qualified workforce in order to promote our culture of innovation, add diverse perspectives and deliver on our business strategy.\nWe seek to enhance shareholder value through the disciplined execution of these imperatives and by positioning our Company as a global data, analytics and technology leader with industry-leading security.\n\nFinancial Marketing Services.\nOur Financial Marketing Services products utilize consumer and commercial financial information enabling our clients to more effectively manage their marketing efforts, including targeting and segmentation, to identify and acquire new clients for their products and services; to develop portfolio strategies to minimize risk and maximize profitability; and to realize additional revenue from existing ",
  "item7_clean": "Revenue increased 31% in 2024 compared to 2023 due to both product pricing and new products.\nRevenue decreased 18% in 2023 compared to 2022 due to significantly lower mortgage credit inquiry volumes in 2023 compared to the prior year.\nFinancial Marketing Services.\nRevenue increased 5% in 2024 compared to 2023 driven by growth in credit marketing services.\nRevenue increased 3% in 2023 compared to 2022 driven by growth in both credit marketing services as well as risk and data services.\nU.S. Information Solutions Operating Margin.\nUSIS operating margin increased to 21.4% in 2024 compared to 21.2% in 2023 due to the aforementioned increase in revenue. USIS operating margin decreased to 21.2% in 2023 compared to 24.3% in 2022 due to an increase in operating expenses, partially offset by the increase in revenue. The increase in operating expenses was due to increased incentive and salary expenses, royalty expenses, third party cloud usage fees, software costs and amortization expenses.\n\nWorkforce Solutions Operating Margin.\nOperating margin increased to 43.3% in 2024 compared to 41.9% in 2023 due to the aforementioned increase in revenue. Operating margin decreased to 41.9% in 2023 compared to 43.3% in 2022 due to an increase in operating expenses. The increased operating expenses were a result of increased royalty costs, costs of purchased data or information, and amortization of capitalized internal-use software and system costs from technology transformation capital spending, partially offset by a decrease in people costs and discretionary expenses.\nU.S. Information Solutions\n\nCost of services increased $183.6 million in 2024 compared to 2023. The increase is primarily due to higher royalty and revenue share costs, costs of purchased data and information, and costs from BVS, which was acquired in the third quarter of 2023. The effect of changes in foreign exchange rates decreased cost of services by $28.1 million.\nCost of services increased $157.9 million in 2023 compared to 2022. The increase is primarily due to higher royalty and revenue share costs, people costs, third party cloud usage fees and software costs, and costs of purchased data and information. The effect of changes in foreign exchange rates decreased cost of services by $16.9 million.\nSelling, General and Administrative Expenses.\nSelling, general and administrative expenses increased $64.8 million in 2024 compared to 2023. The increase is primarily due to increased people costs and costs from BVS, which was acquired in the third quarter of 2023, partially offset by a decrease in professional fees. The increased people costs, excluding the impact of costs from BVS, is primarily due to higher incentive plan costs. The impact of changes in foreign currency exchange rates decreased our selling, general and administrative expenses by $39.2 million.\nSelling, general and administrative expenses increased $56.8 million in 2023 compared to 2022. The increase in 2023 is primarily due to an increase in litigation expense, mainly due to a payment to the U.K. FCA for a penalty associated with resolution of the investigation of a material 2017 cybersecurity incident, as well as higher people costs, partially offset by lower discretionary expenses. The increase in people costs is primarily driven by higher incentive plan costs, partially offset by lower temporary labor. The impact of changes in foreign currency exchange rates decreased our selling, general and administrative expenses by $16.6 million.\n\nLocal currency revenue decreased 2% in 2024 as compared to 2023, primarily driven by Australia due to declines in the commercial and direct to consumer businesses in the first half of the year. Local currency fluctuations against the U.S. dollar negatively impacted revenue by $2.4 million, or 1%. Reported revenue decreased 3% in 2024 as compared to 2023.\nLocal currency revenue increased 4% in 2023 as compared to 2022, driven by growth in Australia due to growth in commercial, identity and fraud, and credit reporting businesses. India revenue also grew due to growth in the credit reporting business primarily due to higher online volumes. Local currency fluctuations against the U.S. dollar negatively impacted revenue by $15.7 million, or 5%. Reported revenue decreased 1% in 2023 as compared to 2022.\nLocal currency revenue increased 4% in 2024 as compared to 2023. Revenue growth in 2024 is driven by growth in the direct to consumer and commercial businesses. Local currency fluctuations against the U.S. dollar negatively impacted revenue by $4.0 million, or 2%, in 2024. Reported revenue increased 2% in 2024 as compared to 2023.\nLocal currency revenue increased 4% in 2023 as compared to 2022. Revenue in 2023 reflected increases in the consumer credit reporting business, as well as commercial and identity and fraud revenue. Local currency fluctuations against the U.S. dollar negatively impacted revenue by $7.8 million, or 3%, in 2023. Reported revenue increased 1% in 2023 as compared to 2022.\nInternational Operating Margin.\nOperating margin was 13.4% in 2024 compared to 13.7% in 2023. The decrease in margin is mainly due to higher amortization costs, principally due to higher amortization of purchased intangible assets related to the BVS acquisition and amortization of capitalized internal-use software and system costs from technology transformation capital spending incurred previously. Operating margin was 13.7% in 2023 and 12.9% in 2022. The increase in margin was mainly due to increased revenue, partially offset by increased salary and incentive costs, increased costs of purchased data or information, higher cloud production costs, increased depreciation expense related to technology transformation project spending and higher amortization of purchased intangible assets related to recent acquisitions.\n\nThe assumptions for our future cash flows begin with our historical operating performance, the details of which are described in our Management’s Discussion & Analysis of operating performance. Additionally, we consider the impact that known economic, industry and market trends, including the impact of rising interest rates and inflation, will have on our future forecasts, as well as the impact that we expect from planned business initiatives including new product initiatives, client service and retention standards, and cost management programs. At the end of the forecast period, the long-term growth rate we used to determine the terminal value of our Asia Pacific reporting unit was between 3.0% and 5.0% based on management’s assessment of the minimum expected terminal growth rate of the reporting unit, as well as broader economic considerations such as GDP, inflation and the maturity of the markets we serve.\nWe projected revenue growth in 2025 for our Asia Pacific reporting unit in completing our 2024 impairment testing based on planned business initiatives and prevailing trends exhibited by this reporting unit. The anticipated revenue growth in this reporting unit, however, is partially offset by assumed increases in expenses and capital expenditures for the reporting unit, which reflects the additional level of investment needed in order to achieve the planned revenue growth and completion of our technology transformation initiatives.\nDiscount Rate Assumptions\nWe utilize a weighted average cost of capital, or WACC, in our impairment analysis that makes assumptions about the capital structure that we believe a market participant would make and include a risk premium based on an assessment of risks related to the projected cash flows for the reporting unit. We believe this approach yields a discount rate that is consistent with an implied rate of return that a market participant would require for an investment in a company having similar risks and business characteristics to the reporting unit being assessed. To calculate the WACC, the cost of equity and cost of debt are multiplied by the assumed capital structure of the reporting unit as compared to industry trends and relevant benchmark company structures. The cost of equity was computed using the Capital Asset Pricing Model which considers the risk-free interest rate, beta, equity risk premium and specific company risk premium related to a particular reporting unit. The cost of debt was computed using a benchmark rate and the reporting unit’s tax rate. For the 2024 annual goodwill impairment evaluation, the discount rate used to develop the estimated fair value of the Asia Pacific reporting unit was consistent with the discount rate used in 2023 and ranged between 10.0% and 11.5%.\nEstimated Fair Value and Sensitivities\nThe estimated fair value of the Asia Pacific reporting unit is highly sensitive to changes in these projections and assumptions; therefore, in some instances, changes in these assumptions could impact whether the fair value of a reporting unit is greater than its carrying value. For example, an increase in the discount rate and decline in the projected cumulative cash flow of a reporting unit could cause the fair value of certain reporting units to be below its carrying value. We perform sensitivity analyses around these assumptions in order to assess the reasonableness of the assumptions and the resulting estimated fair values. Ultimately, future potential changes in these assumptions may impact the estimated fair value of a reporting unit and cause the fair value of the reporting unit to be below its carrying value. Due to the lower cushion when compared to other reporting units, Asia Pacific is more sensitive to changes in the assumptions noted above that could result in a fair value that is less than its carrying value. The excess of fair value over carrying value for the Asia Pacific reporting unit was greater than 10% as of December 1, 2024.\nGiven the relatively smaller excess of fair value over carrying value for the Asia Pacific reporting unit, we believe that it is at risk of a possible future goodwill impairment. The future impact of changes in economic conditions, including rising interest rates and inflation, remains uncertain. Avoidance of a future impairment will be dependent on continued growth during current economic conditions and our ability to execute on initiatives to grow revenue and operating margin and manage expenses prudently. We will continue to monitor the performance of this reporting unit to ensure no interim indications of possible impairment have occurred before our next annual goodwill impairment assessment in December 2025.\n\nDepreciation and Amortization.\nDepreciation and amortization expense for 2024 increased $59.0 million. The increase is primarily due to increased amortization of capitalized internal-use software costs resulting from technology transformation capital spending incurred previously, as well as higher amortization of purchased intangible assets related to the BVS acquisition. The impact of changes in foreign currency exchange rates led to a decrease in depreciation and amortization expense of $2.9 million.\nDepreciation and amortization expense increased $50.7 million in 2023 compared to 2022. The increase is due to increased amortization of capitalized internal-use software and system costs from technology transformation capital spending incurred previously, as well as higher amortization of purchased intangible assets related to recent acquisitions. The impact of changes in foreign currency exchange rates led to a decrease in depreciation and amortization expense of $1.5 million.\nOperating Income and Operating Margin\nOperating Income and Operating Margin\nConsolidated operating revenue\n\nOur general corporate expenses are unallocated costs that are incurred at the corporate level and include those expenses impacted by the overall management and strategic choices of the company, including shared services overhead, technology, security, data and analytics, administrative, legal, restructuring, and the portion of management incentive compensation determined by total company-wide performance.\nGeneral corporate expense increased $28.3 million in 2024. The increase in 2024 as compared to 2023 is primarily due to an increase in people costs, which is primarily due to higher incentive plan costs, and an accrual for a settlement associated with the resolution of a matter with the CFPB.\nGeneral corporate expense increased $69.4 million in 2023 as compared to 2022. The increase in 2023 as compared to 2022 was due to payment of a penalty associated with resolution of the investigation of a material 2017 cybersecurity incident by the U.K. FCA, as well as increased people costs, primarily incentive plans and restructuring charges.\nLIQUIDITY AND FINANCIAL CONDITION\n\nWe record deferred income taxes using enacted tax laws and rates for the years in which the taxes are expected to be paid. We assess the likelihood that our deferred tax assets will be recovered from future taxable income or other tax planning strategies. To the extent that we believe that recovery is not likely, we must establish a valuation allowance to reduce the deferred tax assets to the amount we estimate will be recoverable.\nOur income tax provisions are based on assumptions and calculations which will be subject to examination by various tax authorities. We record tax benefits for positions in which we believe are more likely than not of being sustained under such examinations. We assess the potential outcome of such examinations to determine the adequacy of our income tax accruals.\nJudgments and uncertainties —\nWe consider accounting for income taxes critical because management is required to make significant judgments in determining our provision for income taxes, our deferred tax assets and liabilities, and our future taxable income for purposes of assessing our ability to realize any future benefit from our deferred tax assets. These judgments and estimates are affected by our expectations of future taxable income, mix of earnings among different taxing jurisdictions, and timing of the reversal of deferred tax assets and liabilities.\nWe also use our judgment to determine whether it is more likely than not that we will sustain positions that we have taken on tax returns and, if so, the amount of benefit to initially recognize within our financial statements. We review our uncertain tax positions and adjust our unrecognized tax benefits in light of changes in facts and circumstances, such as changes\nin tax law, interactions with taxing authorities and developments in case law. These adjustments to our unrecognized tax benefits may affect our income tax expense. Settlement of uncertain tax positions may require use of our cash. At December 31, 2024, $42.9 million was recorded for uncertain tax benefits, including interest and penalties, of which it is reasonably possible that up to $15.8 million of our unrecognized tax benefit may change within the next twelve months.\nEffect if actual results differ from assumptions —\nAlthough management believes that the judgments and estimates discussed herein are reasonable, actual results could differ, and we may be exposed to increases or decreases in income tax expense that could be material.\n\nPurchase Accounting for Acquisitions\nWe account for acquisitions under Accounting Standards Codification 805, Business Combinations. In general, the acquisition method of accounting requires companies to record assets acquired and liabilities assumed at their respective fair market values at the date of acquisition. We primarily estimate fair value of identified intangible assets using discounted cash flow analyses based on market participant based inputs. Any amount of the purchase price paid that is in excess of the estimated fair values of net assets acquired is recorded in the line item Goodwill in our Consolidated Balance Sheets. Transaction costs, as well as costs to reorganize acquired companies, are expensed as incurred in our Consolidated St",
  "item2_clean": null
}