{
  "source_file": "efx-20250930.htm",
  "form_type": "10-Q",
  "item1_clean": null,
  "item7_clean": null,
  "item2_clean": "We experience seasonality in certain of our revenue streams. Revenue generated by the online consumer information services component of our USIS operating segment is typically the lowest during the first quarter, when consumer lending activity is at a seasonal low. Revenue generated from the Employer Services business unit within the Workforce Solutions operating segment is generally higher in the first quarter due primarily to the provision of 1095-C services that occur in the first quarter each year. Revenue generated from our financial wealth asset products and data management services in our Financial Marketing Services business is generally higher in the fourth quarter each year due to the significant portion of our annual renewals and deliveries which occur then. Mortgage related revenue is generally higher in the second and third quarters of the year due to the increase in consumer home purchasing during the summer in the U.S. Any change in the U.S. mortgage market has a corresponding impact on revenue and operating profit for our business within the Workforce Solutions and USIS operating segments.\nKey Performance Indicators.\nManagement focuses on a variety of key indicators to monitor operating and financial performance. These performance indicators include measurements of operating revenue, change in operating revenue, operating income, operating margin, net income, diluted earnings per share, cash provided by operating activities and capital expenditures. The key performance indicators for the three and nine months ended September 30, 2025 and 2024 were as follows:\nKey Performance Indicators\nThree Months Ended September 30,\nNine Months Ended September 30,\n(In millions, except per share data)\n\nEquifax Inc. is a global data, analytics and technology company. We provide information solutions for businesses, governments and consumers, and we provide human resources business process automation and outsourcing services for employers. We have a large and diversified group of clients, including financial institutions, corporations, government agencies and individuals. Our services are based on comprehensive databases of consumer and business information derived from numerous sources including credit, financial assets, telecommunications and utility payments, employment, income, educational history, criminal justice, healthcare professional licensure and sanctions, demographic and marketing data. We use advanced statistical techniques, artificial intelligence including machine learning, and proprietary software tools to analyze available data to create customized insights, decision-making and process automation solutions and processing services for our clients. We are a leading provider of information and solutions used in payroll-related and human resource management business process services in the U.S., as well as e-commerce fraud and charge back protection services in North America. For consumers, we provide products and services to help people understand, manage and protect their personal information and make more informed financial decisions. Additionally, we also provide information, technology and services to support debt collections and recovery management.\nWe currently operate in four global regions: North America (U.S. and Canada), Asia Pacific (Australia, New Zealand and India), Europe (the U.K., Spain and Portugal) and Latin America (Argentina, Brazil, Chile, Costa Rica, Dominican Republic, Ecuador, El Salvador, Honduras, Mexico, Paraguay, Peru and Uruguay). We maintain support operations in Chile, Costa Rica, India and Ireland. We also have investments in consumer and/or commercial credit information companies through joint ventures in Brazil, Cambodia, Malaysia and Singapore.\nRecent Events and Company Outlook\nDemand for our services tends to be correlated to general levels of economic activity and to consumer credit and small business commercial credit decisioning and portfolio review, marketing, identity validation and fraud protection activity, employee hiring and onboarding activity, and activity in provisioning support services in the U.S. by government agencies. Demand is also enhanced by our initiatives to expand our products, capabilities and markets served.\nWe remain in a period of economic uncertainty in the U.S. and our global markets, including uncertainty regarding expectations for inflation and interest rates. The direction of global economies, inflation and interest rates will have an impact on demand for our services.\nOur current planning for 2025 assumes that U.S. economic activity, as measured by GDP, will grow at a rate somewhat lower than in 2024. We expect U.S. mortgage credit activity in 2025 to be below the levels of activity seen in 2024. The U.S. mortgage market, particularly the mortgage refinance portion of the U.S. mortgage market, can be significantly impacted by U.S. interest rates which impact mortgage rates available to consumers. In the international markets in which we operate, our planning also assumes that economic activity, as measured by GDP, will generally grow in 2025 at rates below those experienced in 2024. As noted above, due to the current significant economic and market volatility and uncertainty, these assumptions may change.\nSegment and Geographic Information\nThe Workforce Solutions segment consists of the Verification Services and Employer Services business lines. Verification Services revenue is transaction and subscription based and is derived primarily from verifications of employment and income data, as well as criminal justice data and educational background data. Employer Services revenue is derived from our provision of certain human resources business process outsourcing services that include both transaction and subscription based product offerings. These services include unemployment claims management, I-9 and onboarding services, Affordable Care Act (\"ACA\") compliance management, tax credits and incentives and other complementary employment-based transaction services.\nThe USIS segment consists of two service lines: Online Information Solutions and Financial Marketing Services. Online Information Solutions revenue is principally transaction-based and is derived from our sales of products such as consumer and commercial credit reporting and scoring, identity management, fraud detection, modeling services and consumer credit monitoring services. USIS also markets certain analytical and decisioning software and services which facilitate and automate a variety of consumer and commercial credit-oriented decisions. Online Information Solutions also includes our U.S. consumer credit monitoring solutions business. Financial Marketing Services revenue is principally project and subscription based and is derived from our sales of batch credit and consumer wealth information such as those that assist clients in acquiring new customers, cross-selling to existing customers and managing portfolio risk.\n\nOn April 21, 2025, the Board of Directors terminated the existing share repurchase authorization and approved an authorization to repurchase up to $3 billion of shares of common stock. We repurchased 1,237,362 shares of our common stock on the open market for $300.0 million, excluding brokerage commissions and excise taxes of $2.8 million, during the third quarter of 2025. We repurchased 1,716,868 shares of our common stock on the open market for $427.4 million, excluding brokerage commissions and excise taxes of $3.5 million, during the first nine months of 2025. We did not repurchase any shares from public market transactions during the third quarter or first nine months of 2024. At September 30, 2025, approximately $2.6 billion was available for future purchases of common stock under our share repurchase authorization.\nOn April 21, 2025, the Board of Directors approved an increase in our quarterly cash dividend to $0.50 per share beginning in the second quarter of 2025. We paid out $61.5 million, or $0.50 per share, and $172.0 million, or $1.39 per share, in dividends to our shareholders during the third quarter and first nine months of 2025, respectively.\nRESULTS OF OPERATIONS—THREE AND\nNINE\nMONTHS ENDED SEPTEMBER 30, 2025 AND 2024\n\nSelling, general and administrative expenses increased $53.7 million and $87.5 million for the third quarter and first nine months of 2025, respectively, compared to the same periods in 2024. The increase for both periods is primarily due to higher people costs and litigation expense. The impact of changes in foreign currency exchange rates led to a decrease in selling, general and administrative expenses of $1.2 million and $10.5 million for the third quarter and first nine months of 2025, respectively, compared to the same periods in 2024.\nDepreciation and amortization expense increased $14.2 million and $37.0 million for the third quarter and first nine months of 2025, respectively, compared to the same periods in 2024. The increase for both periods is primarily due to increased amortization of capitalized internal-use software costs resulting from technology transformation capital spending incurred previously, partially offset by lower amortization of acquisition related purchased intangibles. The impact of changes in foreign\ncurrency exchange rates led to an increase in depreciation and amortization expense of $0.6 million and a decrease of $2.1 million for the third quarter and first nine months of 2025, respectively, compared to the same periods in 2024.\nOperating Income and Operating Margin\n\nRevenue increased by 12% and 9% for the third quarter and first nine months of 2025, respectively, compared to the same periods in 2024. The increase for both periods is driven by growth in mortgage related services, as well as growth in non-mortgage online services and consumer solutions revenue. The growth in mortgage related services for both periods is primarily due to product pricing, partially offset by lower mortgage "
}