{
  "source_file": "eg-20250930.htm",
  "form_type": "10-Q",
  "item1_clean": null,
  "item7_clean": null,
  "item2_clean": "ITEM 2. MANAGEMENT’S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS\nEverest is a global underwriting leader providing best-in-class property, casualty and specialty reinsurance and insurance solutions. As part of the Standard & Poor’s (“S&P”) 500 Index, we are a leading financial services institution focused on value creation for our shareholders while diversifying our portfolio and geographic presence. Through our direct and indirect subsidiaries operating in the U.S. and internationally, we serve a diverse group of clients worldwide, providing what we believe are extensive product and distribution capabilities, a strong balance sheet, an innovative culture and access to world-class talent.\nAs a global leader with a 50-year track record, we are a preferred Reinsurance partner in the markets we serve, and with our growing Insurance franchise we strive to deliver consistent value to all our stakeholders. We continue to grow and develop our Insurance business, investing in our global platform and strengthening our portfolio and its potential to deliver on our customer promise.\nDuring 2024, we formed a new “Other” segment, primarily comprised of the results of our sports and leisure business sold in October 2024, consisting of policies written prior to the sale and polices renewed and certain new business written on the Company’s paper post-sale. It also includes run-off asbestos and environmental (“A&E”) exposures, certain discontinued insurance programs primarily written prior to 2012 and certain discontinued insurance and reinsurance coverage classes. The Other segment does not generally sell insurance or reinsurance products but is responsible for the management of existing policies and settlement of related losses. These segment presentation changes have been reflected retrospectively. The Company will continue to have two reportable segments that actively sell products, Reinsurance and Insurance, consistent with how the on-going business is managed. See Note 6 of the Notes to the Consolidated Financial Statements for a summary of segment results.\nAll comparisons in this discussion are to the corresponding prior year unless otherwise indicated.\nRecent Developments.\nAdverse Development Cover Reinsurance Agreements\nOn October 26, 2025, Everest Re and Bermuda Re (the “Ceding Companies”) entered into adverse development cover reinsurance agreements with State National Insurance Company, Inc. and MS Transverse Insurance Company. The adverse development cover reinsurance agreements are supported on a retrocessional basis by Longtail Re, an affiliate of Stone Ridge Capital. The adverse development cover reinsurance agreements are effective October 1, 2025 and cover risks arising out of the Ceding Companies’ North American Insurance and Other Segment liabilities and relating to premium earned during 2024 and prior years (the “Subject Business”). The reinsurance agreements exclude certain liabilities, including among others those related to the Ceding Companies’ Asbestos and Environmental reserves included in the Other Segment. The aggregate of the statutory reserves held for the Subject Business, pursuant to the Reinsurance Agreements, is $5.4 billion, as of September 30, 2025.\nThe adverse development cover is composed of two layers in excess of the $5.4 billion of North America Insurance and Other segment liability subject reserves. The first layer is $700 million, upon which Everest will transfer $1.25 billion of in-the-money reserves in consideration upon closing of the transaction.The second layer is $500 million, upon which Everest will pay approximately $122 million of consideration upon closing of the transaction, which will be reported in the consolidated statement of operations for the fourth quarter of 2025. Everest will have a co-participation of $100 million in each layer.\nSale of Certain Retail Commercial Insurance Renewal Rights\nOn October 26, 2025, Group entered into an agreement with American International Group, Inc. (“AIG”) to sell the renewal rights for certain lines of commercial property and casualty insurance business written by the Company in the U.S., U.K. and Asia Pacific, for an aggregate purchase price of $252 million (the “Master Transaction Agreement”). In\naddition, pursuant to the Master Transaction Agreement, AIG has agreed to pay Group $30 million for certain expenses. The closing of the transaction, occurred on October 26, 2025. Pursuant to the Master Transaction Agreement, if the gross written premium paid and payable to AIG with respect to aggregate renewed premiums are less than 80% of the aggregate premiums for the period beginning January 1, 2025 to and including December 31, 2025, including premiums on renewed policies between November 1, 2025 and December 31, 2025, Everest will reimburse a portion of the aggregate purchase price, not to exceed $70 million, to AIG depending on the relative percentage of such 2025 premiums.\nIn addition, on October 26, 2025, Everest entered into an agreement with AIG to sell the renewal rights for certain lines of commercial property and casualty insurance business written by the Company in certain countries in the European Union, for an aggregate purchase price of $49 million (the “EU Master Transaction Agreement,” and together with the Master Transaction Agreement, the “Master Transaction Agreements”). Completion of the transaction will be subject to certain regulatory approvals.\nThe purchase price under the Master Transaction Agreements is subject to adjustment such that the final purchase price will be equal to 15% of the actual premiums written for the period beginning January 1, 2025 to and including December 31, 2025, including premiums on renewed policies between November 1, 2025 and December 31, 2025. Under the Master Transaction Agreements, AIG has also agreed to pay Group a total of $10 million per month for nine months for specified transition services.\nWe monitor and evaluate our overall performance based upon financial results. The following table displays a summary of the consolidated net income (loss), ratios and shareholders’ equity for the periods indicated:\n(Dollars in millions)\nGross written premiums\nNet written premiums\nREVENUES:\nNet investment income\nNet gains (losses) on investments\nOther income (expense)\nNM\nCLAIMS AND EXPENSES:\nIncurred losses and loss adjustment expenses\nCommission, brokerage, taxes and fees\nOther underwriting expenses\nInterest, fees and bond issue cost amortization expense\nTotal claims and expenses\nINCOME (LOSS) BEFORE TAXES\nIncome tax expense (benefit)\nNET INCOME (LOSS)\nRATIOS:\nCommission and brokerage ratio\nOther underwriting expense ratio\n(Dollars in millions, except per share amounts)\nTotal investments and cash\nReserve for losses and loss adjustment expenses\nShareholders' equity\nBook value per share\n(NM, not meaningful)\n(Some amounts may not reconcile due to rounding.)\nGross written premiums decreased by 1.1%, remaining relatively constant at $4.4 billion for the three months ended September 30, 2025, compared to $4.4 billion for the three months ended September 30, 2024. The decrease reflects a $59 million, or 1.8%, decrease in our reinsurance business and a $28 million, or 55.9%, decrease in business within the Other segment, partially offset by a $37 million, or 3.4%, increase in our insurance business. The decrease in reinsurance premiums was primarily due to U.S. casualty pro rata and casualty excess of loss lines of business, partially offset by an increase in the property book of business and financial lines business. Gross written premiums within Other decreased by $28 million as this segment generally represents lines of business that have been discontinued. The increase in insurance premiums compared to the prior year period was primarily due to an increase in accident and health business, professional liability business and other specialty business, partially offset by portfolio actions taken on specialty casualty lines of business primarily in the U.S. portfolio.\nGross written premiums decreased by 0.8% to $13.4 billion for the nine months ended September 30, 2025, compared to $13.6 billion for the nine months ended September 30, 2024. The decrease reflects an $111 million, or 60.6%, decrease within the Other segment and a $22 million, or 0.6%, decrease in our insurance business, partially offset by a $19 million, or 0.2%, increase in our reinsurance business. Gross written premiums within Other has decreased by $111 million as this segment generally represents lines of business that have been discontinued. The decrease in insurance premiums was primarily due to portfolio actions taken on specialty casualty lines of business, partially offset by an increase in other specialty business and property/short tail business. The increase in reinsurance premiums was primarily driven by property pro rata business and property catastrophe excess of loss business in the U.S., partially offset by actions taken on our U.S. reinsurance casualty business.\nNet written premiums decreased by 1.3% remaining relatively constant at $3.8 billion for the three months ended September 30, 2025, compared to $3.8 billion for the three months ended September 30, 2024, primarily driven by overall mix of business. Net written premiums decreased by 1.5% to $11.6 billion for the nine months ended September 30, 2025, compared to $11.8 billion for the nine months ended September 30, 2024. The larger percentage decrease in net written premiums compared to the percentage decrease in gross written premiums was mainly due to higher retention and overall mix of business.\nPremiums earned decreased by 1.6% to $3.9 billion during the three months ended September 30, 2025, compared to $3.9 billion during the three months ended September 30, 2024. Premiums earned increased by 3.9% to $11.7 billion for the nine months ended September 30, 2025, compared to $11.3 billion for the nine months ended September 3"
}