{
  "source_file": "el-20250630.htm",
  "form_type": "10-K",
  "item1_clean": "The Estée Lauder Companies Inc., founded in 1946 by Estée and Joseph Lauder, is one of the world’s leading manufacturers, marketers and sellers of quality skin care, makeup, fragrance and hair care products. We are a steward of over 20 luxury and prestige brands globally. Since the initial launch of the Estée Lauder brand in the United States, we have significantly expanded our consumer reach to approximately 150 countries and territories. We operate as a wholesaler, with our products sold in brick-and-mortar locations and on various e-commerce platforms, including those operated by department stores, duty-free retailers, specialty-multi retailers, online pure players, upscale perfumeries and pharmacies, and top-tier salons and spas. Additionally, we operate a direct-to-consumer business across freestanding stores, our brands' websites and third-party online platforms.\nIn February 2025, we embarked on “Beauty Reimagined,” a strategic vision which focuses on accelerating best-in-class consumer coverage, creating transformative innovation, boosting consumer-facing investments, fueling sustainable growth through bold efficiencies and reimagining the way we work.\nWe have been controlled by the Lauder family since the founding of our Company. Members of the Lauder family, some of whom are directors, executive officers and/or employees, beneficially own, directly or indirectly, as of August 13, 2025, shares of our Company's Class A Common Stock and Class B Common Stock having approximately 84% of the outstanding voting power of the Common Stock.\n- Our broad range of skin care products address various skin care needs. These products include moisturizers, serums, cleansers, toners, eye care, body care, exfoliators, acne and oil correctors, facial masks and sun care products.\n- We offer an extensive array of makeup products across shades and colors. Our full array of makeup products includes foundations, powders, concealers and setting sprays, lipsticks, lip liners and lip glosses, and mascaras, eyeshadows and eyeliners. We also sell related items such as compacts, brushes and other makeup tools.\n- We offer a variety of fragrance products. The fragrances are sold in various forms, including parfum, eau de parfum, eau de toilette, eau de cologne, and body spray, as well as lotions, creams, powders, candles and soaps that are based on a particular fragrance.\n- Our hair care products include shampoos, conditioners, styling products, treatment, finishing sprays and hair color products.\n- The other category includes royalty revenue from our licensing of the TOM FORD trademark to third parties since our fiscal 2023 acquisition of the TOM FORD brand as well as sales from ancillary products and services that do not fit within the definitions of skin care, makeup, fragrance, and hair care.\nGiven the personal nature of our products and the wide array of consumer preferences and tastes, as well as competition for the attention of consumers, our strategy has been to market and promote our products through distinctive brands seeking to address broad preferences and tastes. Each brand has a single global image that is promoted with consistent logos, packaging and advertising designed to enhance its image and differentiate it from other brands in the market. Beauty brands are differentiated by numerous factors, including quality, performance, a particular lifestyle, where they are distributed (e.g., prestige or mass) and price point. Below is a chart showing brands we sell and how we view them based on lifestyle and price point:\n\nAfter increasing our investment to 76% in 2021, we purchased the remaining interest in the Deciem Beauty Group Inc. (\"DECIEM\") in 2024. Known as “The Abnormal Beauty Company,” DECIEM is a Toronto-based, vertically integrated multi-brand beauty company rooted in a consumer-focused and functional approach. Its portfolio includes The Ordinary, an ingredient-focused brand, and NIOD, a science-driven skin care brand.\nBALMAIN Beauty was established in 2022 through a license from the fashion house Balmain Paris “to celebrate all the beauties of the world, no exceptions.” Building upon an exceptional fashion and fragrance legacy, BALMAIN Beauty launched its first fragrances in fiscal 2025.\nFrom time to time, we also make minority investments in companies, mainly in the beauty industry, including through our New Incubation Ventures, the strategic early-stage investment and incubation arm of our Company. In some cases, we have acquired the remaining interests (e.g., Have & Be Co. Ltd. (i.e. Dr.Jart+) and DECIEM). We have several minority investments including a company based in India that manufactures, markets and sells Ayurvedic skin care and other products under the Forest Essentials brand name, primarily in India.\nOur “Luxury Brands” are La Mer, Jo Malone London, TOM FORD, AERIN Beauty, Le Labo, Editions de Parfums Frédéric Malle, KILIAN PARIS and BALMAIN Beauty. Our luxury portfolio also includes Estée Lauder's Re-Nutriv product franchise. Our “Large Brands” are Estée Lauder, La Mer, Clinique and M·A·C. Our “Scaling Brands” are Jo Malone London, TOM FORD, The Ordinary, Aveda, and Bobbi Brown Cosmetics. Our “Developing Brands” are Le Labo, Too Faced, Dr.Jart+, Origins, KILIAN PARIS, Bumble and bumble, Editions de Parfums Frédéric Malle, Smashbox, Darphin Paris, Lab Series, AERIN Beauty, NIOD, Aramis, BALMAIN Beauty and GLAMGLOW.\nSocial Impact and Sustainability\nWe continue to integrate social impact and sustainability into our strategy and business operations. Our social impact and sustainability initiatives help drive innovation, growth and efficiency across the business and within our brand portfolio. These initiatives also aim to foster employee engagement and build consumer trust and loyalty.\nAreas of focus include climate and energy; packaging; sourcing; green chemistry and ingredient transparency; inclusion; employee health and safety; and social investments. We have set goals or made commitments within these focus areas. For example, our goals related to climate and energy support efficiency and conservation within our facilities, internal supply chain and value chain. Certain goals are also intended to help us reduce cost and waste.\nThe Nominating and ESG Committee of our Board of Directors has oversight responsibility for our Company’s environmental, social and governance (“ESG”) activities and practices, including citizenship and sustainability matters. Our social impact and sustainability efforts are led by our President and Chief Executive Officer. Other members of senior management, along with employees across the organization, help to drive our strategic initiatives concerning social impact and sustainability.\nAdditional information related to our social impact and sustainability matters can be found at\nWe operate as a wholesaler, with our products sold in brick-and-mortar locations and on various e-commerce platforms, including those operated by department stores, duty-free retailers, specialty-multi retailers, online pure players, upscale perfumeries and pharmacies, and top-tier salons and spas. Additionally, we operate a direct-to-consumer business across freestanding stores, our brands' websites and third-party online platforms. Our general practice is to accept returns of our products from customers if properly requested and approved.\nOur online sites, including our brand.com sites as well as those operated by authorized retailers and through third-party online platforms are in approximately 50 countries, with a majority of these online sales generated in mainland China, the United States and the United Kingdom. During fiscal 2025, we closed freestanding stores in underperforming areas of our business and opened new freestanding stores where growth opportunities existed. We operated approximately 1,600 freestanding stores as of June 30, 2025. Most freestanding stores are operated by us under a single brand name, such as M·A·C, Jo Malone London and Le Labo. Over 300 of the freestanding stores are multi-branded company stores, primarily in outlet malls.\nWe maintain dedicated sales teams that manage our retail accounts. We have wholly-owned operations in over 50 countries through which we market, sell and distribute our products. In certain countries, we sell our products through carefully selected distributors who we believe share our commitment to protecting the image and position of our brands. For information regarding our net sales by geographic region, see\nItem 8. Financial Statements and Supplementary Data – Note 15 – Revenue Recognition.\nAs we have done historically, we continue to develop our strategy, assess performance and allocate resources by product category and will continue to report results by product category. To enhance accountability and streamline operations within the organization, as well as to align with our recently announced leadership changes, we have reorganized our geographic regions. Beginning with the fiscal 2026 first quarter, we will be reporting our fiscal 2026 and comparative fiscal 2025 results by geographic region under the new regional structure. Our four new geographic regions are:\nThe Americas, which will continue to include North America and Latin America;\nEurope, the United Kingdom and Ireland and Emerging Markets (\"EUKEM\"), which will continue to include the geographic markets of our previously reported Europe, the Middle East & Africa region, will exclude our global travel retail business, and will include our Southeast Asian Emerging Markets, previously reported in our Asia/Pacific region, of Indonesia, Malaysia, the Philippines, Thailand and Vietnam;\nAsia/Pacific, which will continue to include certain geographic markets of our previously reported Asia/Pacific region, such as Japan, Korea, Hong Kong SAR, and Australia, among others, and will also include our global travel retail business, previously reported in our Europe, the Middle East & Africa region; and\nMainland China, previously reported in our Asia/Pacific region, will now be reported as a separate region.\nOur “Emerging Markets” in The Americas are Argentina, Brazil, Chile, Colombia, Mexico, Panama and Peru and in our reorganized region of EUKEM are Central Europe, India, Indonesia, Israel, Kazakhstan, Malaysia, the Middle East, the Philippines, Russia, South Africa, Thailand, Turkey and Vietnam.\nOur “Priority Emerging Markets” in The Americas are Brazil and Mexico and in EUKEM are India, Indonesia, Malaysia, the Middle East, the Philippines, South Africa, Thailand, Turkey and Vietnam.\nOur references to North America within this document include the United States and Canada.\nOur strategy is to build strong relationships globally with select retailers, and our senior management works with executives of our major retail accounts on a regular basis in support of these relationships. We believe we are viewed as an important supplier to these customers. In addition, we connect with our consumers directly through freestanding stores, e-commerce sites and social media to build a robust omnichannel experience that allows consumers to shop in these and other channels.\nOur strategy to market and promote our products begins with our well-diversified portfolio of distinctive brands across four major product categories. Our portfolio can be deployed in multiple distribution channels, key travel corridors and geographies and we continue to expand our consumer coverage by entering high-growth, consumer-preferred channels, markets, media and price tiers where our global reputation and awareness of our brands benefit us. By putting the consumer at the center of every engagement and leveraging our geographic and distribution channel diversity, we offer strong consumer coverage which allows us to reach and engage local consumers across an array of developed and emerging markets by emphasizing products and services with local relevance, inclusiveness and appeal. This strategy",
  "item7_clean": "Management’s Discussion and Analysis of Financial Condition and Results of Operations.\nRESULTS OF OPERATIONS\nWe manufacture, market and sell beauty products including those in the skin care, makeup, fragrance and hair care categories, which are distributed in approximately 150 countries and territories.\nSelling, general and administrative\nRestructuring and other charges\nImpairment of other intangible assets\nTalcum litigation settlement agreements\nTotal operating expenses\nOperating (loss) income\nInterest income and investment income, net\nOther components of net periodic benefit cost\n(Loss) earnings before income taxes\nProvision for income taxes\nNet earnings attributable to redeemable noncontrolling interest\nNet (loss) earnings attributable to The Estée Lauder Companies Inc.\nPercentages not adjusted for differences caused by rounding\nThe following table is a comparative summary of operating results for fiscal 2025, 2024 and 2023, for our product categories and geographic regions and reflects the basis of presentation described in",
  "item2_clean": null
}