{
  "source_file": "elv-20250930.htm",
  "form_type": "10-Q",
  "item1_clean": null,
  "item7_clean": null,
  "item2_clean": "Our medical cost trends are primarily driven by changes in the utilization of services across all provider types and the unit cost of these services. We work to mitigate these trends through various medical management programs such as care and condition management, program integrity and specialty pharmacy management and utilization management, as well as benefit design changes. There are many drivers of medical cost trends that can cause variance from our estimates, such as changes in the level and mix of services utilized, regulatory changes, aging of the population, health status and other demographic characteristics of our members, epidemics, pandemics, advances in medical technology, new high-cost prescription drugs, new indications of existing prescription drugs, provider contracting inflation, labor costs and healthcare fraud, waste and abuse.\nMembership shifts from Medicaid into our Individual ACA (as defined below) business following the redetermination process that began in April 2023, together with lower membership effectuation rates, particularly in geographies with high concentrations of highly subsidized members, have driven a market-wide increase in morbidity, resulting in elevated medical cost trends.\nMedicaid cost trends remain elevated due to higher population acuity and increased utilization of services. In response, we are working on program improvements in partnership with the states, strengthening care management, and optimizing our clinical strategy to improve effectiveness and lower costs.\nWe strive to price our health benefit products consistent with anticipated underlying medical cost trends. We frequently make adjustments to respond to legislative and regulatory changes as well as pricing and other actions taken by existing competitors and new market entrants. Revenues from the Medicare and Medicaid programs are dependent, in whole or in part, upon annual funding from the federal government and/or applicable state governments. Pricing of the Medicare and Medicaid programs may not adequately reflect current underlying healthcare cost trends given the timing lag between when pricing is established and the start of the applicable contract, which could adversely affect our financial results.\nIf the approvals of any annual premium rate changes by contracted government agencies are delayed, we are required to defer the recognition of any premium rate increases to the period in which the premium rates become final. The impact of this deferral can be significant in the period in which the increased premium rates are first recognized depending on the magnitude of the premium rate increase, the number of members to which it applies and the length of the delay between the effective date of the rate increase and the final contract date. Premium rate decreases are recognized in the period the change in premium rate becomes effective and the change in the rate is known, which may be prior to the period in which the contract amendment affecting the rate is finalized.\n: We continue to participate in the Individual state- or federally-facilitated marketplaces (the “Public Exchange”) in nearly all of our Anthem Blue Cross and Anthem Blue Cross and Blue Shield service areas. We have expanded into select service areas in Florida, Maryland, and Texas in 2025, using our Simply Healthcare and Wellpoint brands. Going forward, we expect the Public Exchange to be influenced by policy and regulatory changes, particularly around federal subsidies, compliance requirements, and market stability.\nCarelonRx markets and offers pharmacy services to our affiliated health plan customers throughout the country and to customers outside of the health plans we own. Our comprehensive pharmacy services portfolio includes all core pharmacy services, such as home delivery and specialty pharmacies, claims adjudication, formulary management, pharmacy networks, rebate administration, a prescription drug database and member services, as well as infusion services and injectable therapies.\nCarelonRx delegates certain core pharmacy services to CaremarkPCS Health, L.L.C., which is a subsidiary of CVS Health Corporation (“CVS”), pursuant to an agreement (the “CVS Agreement”) with the current contractual term extending through December 31, 2027. We can elect to have CVS continue to provide services to us for a three-year extension period on the same terms and conditions as in the current CVS Agreement in the event of a termination or non-renewal by either party.\nRegulatory Trends and Uncertainties\nThe federal budget reconciliation legislation, known as the One Big Beautiful Bill Act (the “OBBBA”) was signed into law on July 4, 2025. The OBBBA contains a variety of provisions that could impact our business and operations including: changes to Medicaid renewal and eligibility rules, such as more frequent redeterminations for beneficiaries receiving coverage through the Patient Protection and Affordable Care Act and the Health Care and Education Reconciliation Act of 2010, as amended, (collectively, the “ACA”), and a requirement for certain adults made eligible under the ACA, to meet work or community engagement standards; changes to federal requirements regarding Medicaid state directed payments and provider taxes, including taxes on managed care organizations; delays in the implementation of Medicaid final regulations on certain eligibility and enrollment provisions; application of cost sharing to certain services for adults made eligible under the ACA’s Medicaid expansion; reduction of the allowable home equity asset threshold for members seeking eligibility for Medicaid long term care services; authorization of the U.S. Department of Health and Human Services (“HHS”) to approve certain state home and community-based services waivers; elimination of the repayment limit for excess advanced premium tax credits under the ACA; modification of the rules regarding Health Savings Account eligible plans under the ACA and a permanent extension of the safe harbor first established under the Coronavirus Aid, Relief, and Economic Security Act, allowing pre-deductible coverage of telehealth services for HSA eligible high-deductible health plans; and establishment of a new Rural Health Transformation program, among other provisions. Additional federal and state guidance is being issued to implement these OBBBA provisions, most of which have effective dates in 2027 and 2028, although some states may look to implement certain of these provisions in 2026.\nIn addition, in June 2025,\nthe Centers for Medicare and Medicaid Services (“CMS”)\nfinalized the Marketplace Integrity and Affordability Regulation which modifies the ACA exchange open enrollment period beginning in plan year 2027 and eligibility for premium tax credits among other requirements. In September 2025, a federal court delayed the effective dates for several provisions of the Marketplace Integrity and Affordability Regulation pending the resolution of ongoing litigation challenging the legality of those provisions. Also, in September 2025, CMS issued guidance modifying eligibility requirements for ACA catastrophic plans.\nIn September 2024, the HH\nS, the U.S. Department of Labor, and the U.S Department of the Treasury (collectively, the “Tri-Agencies”) issued final regulations related to mental health parity that will require health plans to make administrative and operational changes to comply with these final regulations. While some provisions became effective on January 1, 2025, additional guidance from the Tri-Agencies will be necessary to assess the full impact of these regulations on our operations and financial results. Litigation has been filed by third parties challenging these final regulations.\nThe Consolidated Appropriations Act of 2023 decoupled Medicaid eligibility redeterminations from the COVID-19 Public Health Emergency initially declared in January 2020. As a result, states were permitted to begin removing ineligible beneficiaries from their Medicaid programs starting April 1, 2023, and the majority of our Medicaid markets began doing so as of June 30, 2023. Although most states have completed this process, CMS has provided that states have until December 31, 2025 to complete these eligibility redeterminations.\nThe Inflation Reduction Act of 2022 (“IRA”) contains a variety of provisions that have impacted, and continue to impact, our business, including by extending the American Rescue Plan Act of 2021’s enhanced Premium Tax Credits (“PTC”) through 2025; imposing a new corporate alternative minimum tax; providing a one percent excise tax on repurchases of stock; allowing CMS to negotiate prices on a limited set of prescription drugs in Medicare effective in 2026; instituting caps on insulin cost sharing in Medicare; redesigning the Medicare Part D benefit; requiring drug manufacturers to pay rebates if prices increase beyond inflation; and delaying the implementation of the Trump Administration Medicare drug rebate rule until at least 2032. The extension of the enhanced PTC has allowed for growth in Individual Public Exchange enrollment and has supported continuity of coverage since Medicaid eligibility redeterminations resumed in 2023. If Congress does not act to extend the enhanced PTC, they will expire at the end of 2025, which could have a material adverse effect on our business and results of operations.\nThe ACA continues to impact our business and results of operations, including pricing, minimum medical loss ratios, and the geographies in which our products are available.\nWe also expect further and ongoing regulatory guidance on a number of issues related to Medicare, including evolving methodology for ratings and quality bonus payments. CMS also frequently proposes changes to its program that audits data\nsubmitted under the risk adjustment programs in ways that could increase financial recoveries from pla\nns. For example, in May 2025, CMS announced plans to substantia"
}