{
  "source_file": "elv-20241231.htm",
  "form_type": "10-K",
  "item1_clean": "Carelon Services integrates physical, behavioral, pharmacy, and social services with the aim of delivering whole health affordably by offering a broad array of healthcare related services and capabilities to internal and external customers through our Carelon Health and Carelon Insights businesses. Carelon businesses promote affordability by managing complex areas of the healthcare system, leveraging data and insights to improve how our members receive safe, appropriate, high-quality care and providers are reimbursed accurately and timely. Our approach to cost management relies on capabilities including provider enablement, value-based networks, member engagement, and utilization management. Our care delivery services primarily target serving the chronic and complex populations by providing personalized care in the home and virtually.\npowered by clinical excellence, curates value-based whole health solutions for populations, one person at a time. Carelon Medical Benefits Management provides specialty care enablement and utilization management support for specialized clinical domains. Carelon Post Acute Solutions manages home health, post-acute institutional management, and durable medical equipment costs. Carelon Behavioral Health provides comprehensive behavioral health management services through clinical services and network\nadministration. Carelon Care Navigation provides comprehensive care management services. Our Carelon Advanced Primary Care business includes palliative care services and management of our partnership with Augusta Topco Holdings L.P. (“Mosaic Health”), a joint venture with Clayton, Dubilier & Rice (“CD&R”). At the end of 2024, we completed our acquisition of CareBridge, which provides virtual care to complex Medicaid and Medicare patients and supports plans in managing home and community-based services.\nCarelon Insights aims to improve the health of the healthcare system by simplifying workflows and providing real-time insights. Carelon Insights capabilities include payment integrity, subrogation, clinical data exchange through our HealthOS platform, research and data services, reporting and clinical analytics, and information technology services and global business process support.\nThe managed care industry is highly competitive, both nationally and in our local markets. Competition continues to be intense due to aggressive marketing, pricing, bid activity for government-sponsored programs, business consolidations, new strategic alliances, new competitors in the market, a proliferation of new products, technological advancements, the impact of legislative reform, increased quality awareness and price sensitivity among customers and changing market practices, such as increased usage of telehealth.\nWe believe that participants in the managed care industry compete for customers based on quality of service, price, access to provider networks, access to care management and wellness programs (including health information), innovation, effective use of digital technology, breadth and flexibility of products and benefits, expertise and reputation (including National Committee on Quality Assurance (“NCQA”) accreditation status as well as CMS Star Ratings), brand recognition and financial stability. Our ability to attract and retain customers is substantially tied to our ability to distinguish ourselves from our competitors in these areas.\nWe believe our exclusive right to market products under the most recognized brand in the industry, BCBS, in our most significant markets provides us with greater brand recognition over competitive product offerings. Typically, we are the largest participant in each of our BCBS branded markets, and thus are closely watched by other health benefits companies.\nProduct pricing remains competitive, and we strive to price our health benefit products and design our Medicare and Medicaid bids consistent with anticipated underlying medical trends. We believe our pricing and bid strategy, based on predictive modeling, proprietary research and data-driven processes, has positioned us to benefit from the potential growth opportunities available through entry into new markets, expansions in existing markets and as a result of any future changes to the current regulatory scheme. We believe that our pricing and bid strategy, brand name and network quality will provide a strong foundation for membership growth opportunities in the future.\nOur provider networks give us a highly competitive unit cost position and provide distinctive service levels which allow us to offer a broad range of affordable health benefit products to our customers. To build our provider networks, we compete with other health benefits plans for the best contracts with hospitals, physicians and other providers. We believe that physicians and other providers primarily consider customer volume, reimbursement rates, timeliness of reimbursement and administrative service capabilities along with the reduction of non-value added administrative tasks when deciding whether to contract with a health benefits plan.\nAt the sales and distribution level, we compete for qualified agents and brokers to recommend and distribute our products. Strong competition exists among insurance companies and health benefits plans for agents and brokers with demonstrated ability to secure new business and maintain existing accounts. We believe that the quality and price of our products, support services, reputation and prior relationships, along with a reasonable commission structure, are the factors agents and brokers consider in choosing whether to market our products. We believe that we have good relationships with our agents and brokers, and that our products, support services and commission structure compare favorably to those of our competitors in all of our markets.\nIn addition, the pharmacy industry is highly competitive, and CarelonRx is subject to competition from national, regional and local pharmacy service providers, insurers, health plans, large retail pharmacy chains, large retail stores, supermarkets, mail order pharmacies, web pharmacies and specialty pharmacies. Strong competition within the pharmacy industry has\ngenerated greater demand for lower product and service pricing, increased revenue sharing and enhanced product and service offerings.\nPricing and Underwriting of Our Products\nWe price our products based on our assessment of current healthcare claim costs and emerging healthcare cost trends, combined with charges for administrative expenses, risk and profit. We continually review our product designs and pricing guidelines on a national and regional basis so that our products remain competitive and consistent with our strategies and profitability goals.\nOur revenue on Medicare policies is based on annual bids submitted to CMS. We base the commercial and Medicaid premiums we charge and our Medicare bids on our estimates of future medical costs over the fixed contract period. In applying our pricing to each employer group and customer, we aim to maintain consistent, competitive and disciplined underwriting standards. We employ our proprietary accumulated actuarial and financial data to determine underwriting and pricing parameters for both our risk-based and fee-based businesses.\nIn most circumstances, our pricing and underwriting decisions follow a prospective rating process in which a fixed premium is determined at the beginning of the contract period. For our risk-based business, any deviation, favorable or unfavorable, from the medical costs assumed in determining the premium is our responsibility. Some of our larger groups employ retrospective rating reviews, where positive experience is partially refunded to the group, and negative experience is charged against a rate stabilization fund established from the group’s favorable experience or charged against future favorable experience. In addition, our ACA and government risk-based contracts may include minimum medical loss ratio, risk adjustment, or risk corridor arrangements, which also stabilize premiums based upon claims experience.\nOur pharmacy services pricing through CarelonRx is presented to market via discounts off the average wholesale price for drugs dispensed through the retail, mail and specialty channels as well as through rebate projections. We utilize group-specific script data, formulary, network and clinical care program selection combined with administrative expense, risk and profit guidance to set market competitive pricing discounts and rebate projections. Pharmacy services pricing guidelines guide the underwriting process and undergo an annual external review process to ensure market competitiveness.\nNetworks and Provider Relations\nOur relationships with physicians, hospitals and professionals that render healthcare services to our members are guided by local, regional and national standards for network development, reimbursement and contract methodologies. While following industry standards, we are simultaneously seeking to lead transformation efforts within our healthcare system, moving from a fragmented model premised on episodic intervention to one based on proactive, coordinated care built around the whole health needs of the patient.\nWe establish “market-based” hospital reimbursement payments that we believe are fair, but aggressive, and among the most competitive in the market. We also seek to ensure that physicians in our network are paid in a timely manner at appropriate rates. In most instances, we deploy multi-year contracting strategies, including fixed case rates and fee schedules, to limit our exposure to medical cost inflation and to increase cost predictability. We maintain both broad and narrow provider networks to ensure member choice, based on both price and access needs, while implementing programs designed to improve the quality of care our members receive. Increasingly, we are supplementing our broad-based networks with smaller or more cost-conscious networks that are designed to be attractive to a more price-sensitive customer segment, such as Public Exchange customers.\n\nITEM 1. BUSINESS.\nElevance Health and its direct and indirect subsidiaries, referred to throughout this document as “we,” “us,” “our,” the “Company” or “Elevance Health,” is a leading health company bringing together the concepts of elevate and advance, in order to exemplify and follow our purpose of improving the health of humanity. We serve people across their entire health journey to better address their full range of needs with an integrated whole-health approach. Through our broad view, we aim to meaningfully improve the health of the people and communities we serve. We strive to deliver on our mission by maximizing the power of partnerships, innovating to fuel growth and health equity, and maintaining a high-performance culture. Our strategy is to be a lifetime trusted health partner through the following four core competencies:\nWith an unyielding commitment to meeting the needs of our diverse customers, we are guided by the following values:\nWe are one of the largest health insurers in the United States in terms of medical membership, serving approximately 45.7 million medical members through our affiliated health plans as of December 31, 2024. We offer a broad spectrum of\nnetwork-based managed care risk-based plans to Individual, Employer Group, Medicaid and Medicare markets. In addition, we provide a broad array of managed care services to fee-based customers, including claims processing, stop loss insurance, provider network access, medical management, care management, wellness programs, actuarial services and other administrative services. We provide services to the federal government in connection with our Federal Health Products & Services business, which administers the Federal Employee Program\n(“FEP\n”). We provide an array of specialty services both to customers of our subsidiary health plans ",
  "item7_clean": "(In Millions, Except Per Share Data or as Otherwise Stated Herein)\nElevance Health is a health company with the purpose of improving the health of humanity. We are one of the largest health insurers in the United States in terms of medical membership, serving approximately 45.7 million medical members through our affiliated health plans as of December 31, 2024. We are an independent licensee of the Blue Cross and Blue Shield Association (“BCBSA”), an association of independent health benefit plans. We serve our members as the Blue Cross licensee for California and as the Blue Cross and Blue Shield (“BCBS”) licensee for Colorado, Connecticut, Georgia, Indiana, Kentucky, Maine, Missouri (excluding 30 counties in the Kansas City area), Nevada, New Hampshire, New York (in the New York City metropolitan area and upstate New York), Ohio, Virginia (excluding the Northern Virginia suburbs of Washington, D.C.) and Wisconsin. In a majority of these service areas, we do business as Anthem Blue Cross and Anthem Blue Cross and Blue Shield. We also conduct business through arrangements with other BCBS licensees, as well as other strategic partners. In addition, we serve members in numerous states as Wellpoint, Carelon, MMM and/or Simply Healthcare. We are licensed to conduct insurance operations in all 50 states, the District of Columbia and Puerto Rico through our subsidiaries. Through various subsidiaries, we also offer pharmacy services through our CarelonRx business, and other healthcare related services as Carelon Insights and Carelon Health.\nWe have organized our brand portfolio into the following core go-to-market brands:\nAnthem Blue Cross/Anthem Blue Cross and Blue Shield — represents our Anthem-branded and affiliated Blue Cross and/or Blue Shield licensed plans;\nWellpoint — unites select non-BCBSA licensed Medicare, Medicaid and commercial plans under the Wellpoint name; and\nCarelon — this brand brings together our healthcare related services and capabilities, including our CarelonRx and Carelon Services businesses, under a single brand name.\nWe report our results of operations in the following four reportable segments: Health Benefits, CarelonRx, Carelon Services and Corporate & Other (our businesses that do not individually meet the quantitative thresholds for an operating segment, as well as corporate expenses not allocated to our other reportable segments).\nOur results of operations discussed throughout this MD&A are determined in accordance with generally accepted accounting principles (“GAAP”). We also calculate operating gain and operating margin to further aid investors in understanding and analyzing our core operating results. Operating gain is calculated as total operating revenue less benefit expense, cost of products sold and operating expense. Operating margin is calculated as operating gain divided by operating revenue. Our definition of operating gain and operating margin may not be comparable to similarly titled measures reported by other companies. We use these measures as a basis for evaluating segment performance, allocating resources, forecasting future operating periods and setting incentive compensation targets. This information is not intended to be considered in isolation or as a substitute for income before income tax expense, net income or fully-diluted shareholders’ earnings per share (“EPS”) prepared in accordance with GAAP. For additional details on operating gain, see our “Reportable Segments Results\nOur operating revenue consists of premiums, product revenue, and service fees. Premium revenue is generated from risk-based contracts where we indemnify our policyholders against costs for covered health benefits. Product revenue represents services performed by CarelonRx for unaffiliated pharmacy customers and includes ingredient costs (net of any rebates or discounts), including co-payments made by or on behalf of the customer, and service fees. Unaffiliated pharmacy customers include our fee-based employer groups that contract with CarelonRx for pharmacy services and external customers outside of the health plans we own. Service fees are generated from our fee-based customers for the processing of transactions or network discount savings realized, revenues from our Medicare processing business and revenues from other health-related businesses, including care management programs and miscellaneous other income.\nOur benefit expense primarily includes costs of care for health services consumed by our risk-based members, such as outpatient care, inpatient hospital care, professional services (primarily physician care) and pharmacy benefit costs. All four components are affected both by unit costs and utilization rates. Unit costs include the cost of outpatient medical procedures per visit, inpatient hospital care per admission, physician fees per office visit and prescription drug prices. Utilization rates represent the volume of consumption of health services and prescription drugs, and typically vary with the age and health status of our members and their social and lifestyle choices, along with clinical protocols and medical practice patterns in each of our markets. A portion of benefit expense recognized in each reporting period consists of actuarial estimates of claims incurred but not yet paid by us. Any changes in these estimates are recorded in the period the need for such an adjustment arises. While we offer a diversified mix of managed care products and services through our managed care plans, our aggregate cost of care can fluctuate based on a change in the overall mix of these products and services. Our managed care plans include: Preferred Provider Organizations; Health Maintenance Organizations; Point-of-Service plans; Traditional Indemnity plans and other hybrid plans, including Consumer-Driven Health Plans; and hospital only and limited benefit products.\nWe classify certain quality improvement costs as benefit expense. Quality improvement activities are those designed to improve member health outcomes, prevent hospital readmissions and improve patient safety. They also include expenses for wellness and health promotion provided to our members. These quality improvement costs may be comprised of expenses incurred for: (i) medical management, including care coordination and case management; (ii) health and wellness, including disease management services for such conditions as diabetes, high-risk pregnancies, congestive heart failure and asthma management and wellness initiatives like weight-loss programs and smoking cessation treatments; and (iii) clinical health policy, such as identification and use of best clinical practices to avoid harm, identifying clinical errors and safety concerns, and identifying potential adverse drug interactions.\nOur cost of products sold represents the cost of pharmaceuticals dispensed by CarelonRx for our unaffiliated pharmacy customers (net of rebates or discounts), including any co-payments made by or on behalf of the customer, per-claim administrative fees for prescription fulfillment and certain direct costs related to sales and administration of customer contracts.\nOur operating expenses consist of fixed and variable costs. Examples of fixed costs are depreciation, amortization and certain facilities expenses. Certain variable costs, such as premium taxes, vary directly with premium volume. Commission expense generally varies with premium or membership volume. Other variable costs, such as salaries and benefits, do not vary directly with changes in premium but are more aligned with changes in membership or services provided to our customers. The acquisition or loss of a significant block of business would likely impact staffing levels and thus, associated compensation expense. Other variable costs include professional and consulting expenses and advertising. Other factors can impact our administrative cost structure, including systems efficiencies, inflation and changes in productivity.\nOur results of operations depend in large part on our ability to accurately predict and effectively manage healthcare costs through effective contracting with providers of care to our members, product pricing, medical management and health and wellness programs, including service coordination and case management for addressing complex and specialized healthcare needs, innovative product design and our ability to maintain or achieve improvement in our Centers for Medicare and Medicaid Services Star Ratings. Several economic factors related to healthcare costs, such as regulatory mandates of\ncoverage as well as direct-to-consumer advertising by providers and pharmaceutical companies, have a direct impact on the volume of care consumed by our members. The potential effect of escalating healthcare costs, any changes in our ability to negotiate competitive rates with our providers and any regulatory or market-driven restrictions on our ability to obtain adequate premium rates to offset overall inflation in healthcare costs, including increases in unit costs and utilization rates resulting from the aging of the population and other demographics, the impact of epidemics and pandemics, as well as advances in medical technology and pharmaceuticals, may impose further risks to our ability to profitably underwrite our business and may have a material adverse impact on our results of operations.\nWe intend to expand through a combination of organic growth, strategic acquisitions and efficient use of capital in both existing and new markets. Our growth strategy is designed to enable us to take advantage of additional economies of scale, as well as provide us access to new and evolving technologies and products. In addition, we believe geographic and product diversity reduces our exposure to local or regional regulatory, economic and competitive pressures and provides us with increased opportunities for growth. We market and offer pharmacy services through CarelonRx and other subsidiaries, and we expect CarelonRx to continue to improve our ability to integrate pharmacy benefits within our medical and specialty platform. We have continued growing our government-sponsored business through organic growth and acquisitions. In all other markets, we intend to maintain our position by delivering excellent service, offering competitively priced products, providing access to high-quality provider networks and effectively capitalizing on the brand strength of the Blue Cross and Blue Cross and Blue Shield names and marks.\n\nOur medical cost trends are primarily driven by changes in the utilization of services across all provider types and the unit cost of these services. We work to mitigate these trends through various medical management programs such as care and condition management, program integrity and specialty pharmacy management and utilization management, as well as benefit design changes. There are many drivers of medical cost trends that can cause variance from our estimates, such as changes in the level and mix of services utilized, regulatory changes, aging of the population, health status and other demographic characteristics of our members, epidemics, pandemics, advances in medical technology, new high-cost prescription drugs, new indications of existing prescription drugs, provider contracting inflation, labor costs and healthcare provider or member fraud.\nRegulatory Trends and Uncertainties\nThe Consolidated Appropriations Act of 2023, decoupled Medicaid eligibility redeterminations from the COVID-19 Public Health Emergency initially declared in January 2020. As a result, states were permitted to begin removing ineligible beneficiaries from their Medicaid programs starting April 1, 2023, and the majority of our Medicaid markets began doing so as of June 30, 2023. Although most states have completed this process, Centers for Medicare and Medicaid Services (“CMS”) has provided that states have until December 31, 2025 to complete these eligibility redeterminations. Since redeterminations have resumed, we have continued to experience a decline in our Medicaid membership. We expect growth over time in our commercial plans, including through the Public Exchanges in states where we offer commercial plans, as members who have lost Medicaid coverage seek alternative coverage elsewhere.\nThe Inflation Reduction Act of 2022 contains a variety of provisions that have impacted, and continue to impact our business including by extending the American Rescue Plan Act of 2021's enhanced Premium Tax Credits (“PTC”) through 2025; imposing a new corporate alternative minimum tax; providing a one percent excise tax on repurchases of stock; allowing CMS to negotiate prices on a limited set of prescription drugs in Medicare effective in 2026; instituting caps on insulin cost sharing in Medicare; redesigning the Medicare Part D benefit; requiring drug manufacturers to pay rebates if prices increase beyond inflation; and delaying the implementation of the Trump Administration Medicare drug rebate rule until at least 2032. The extension of the enhanced PTC has allowed for growth in Individual Public Exchange enrollment and has supported continuity of coverage since Medicaid eligibility redeterminations resumed in 2023. If Congress does not act to extend the enhanced PTC, they will expire at the end of 2025, which could have a material adverse effect on our business and results of operations.\nThe Consolidated Appropriations Act of 2021 (the “2021 Appropriations Act”) has impacted our business, including by imposing additional disclosure and reporting requirements related to broker compensation, mental health parity, pharmacy benefits and drug costs, as well as procedures and coverage requirements related to surprise medical bills, provider directory maintenance and continuity of care for certain patients. The requirements applicable to us under the 2021 Appropriations Act had varying effective dates, beginning in December 2021.\nThe health plan price transparency regulations issued by the U.S. Departments of Health and Human Services, Labor, and Treasury (“the Tri-Agencies”) pursuant to the 2021 Appropriations Act required us to begin disclosing certain pricing information regarding negotiated rates and historical payment information with providers in 2022. Additionally, as directed by law, we make available to members personalized out-of-pocket cost information and underlying negotiated rates.\nIn September 2024, the Tri-Agencies issued final regulations related to mental health parity that will require health plans to make administrative and operational changes to comply with these final regulations. While some provisions became effective on January 1, 2025, additional guidance from the Tri-Agencies will be necessary to assess the full impact of these regulations on our operations and financial results. Litigation has been filed challenging the final regulation and is pending court action.\nThe Patient Protection and Affordable Care Act and the Health Care and Education Reconciliation Act of 2010, as amended (collectively, the “ACA”), continues to impact our business and results of operations, including pricing, minimum\nmedical loss ratios, and the geographies in which our products are available. We also expect further and ongoing regulatory guidance on a number of issues related to Medicare, including evolving methodology for ratings and quality bonus payments. CMS also frequently proposes changes to its program that audits data submitted under the risk adjustment programs in ways that could increase financial recoveries from plans.\n” and Part I, Item 1A “Risk Factors.”\nOther Significant Items\nBusiness and Operational Matters\nPursuant to CMS’ Medicare Advantage Star Ratings system, CMS annually awards between 1.0 and 5.0 Stars to Medicare Advantage plans based on performance in several categories. Plans must have a Star Rating of 4.0 or higher to qualify for bonus payments. Our 2",
  "item2_clean": null
}