{
  "source_file": "eme-20241231.htm",
  "form_type": "10-K",
  "item1_clean": "ITEM 1. BUSINESS\nReferences to the “Company,” “EMCOR,” “we,” “us,” “our” and similar words refer to EMCOR Group, Inc. and its consolidated subsidiaries unless the context indicates otherwise.\nWe are one of the largest specialty contractors in the United States and a leading provider of electrical and mechanical construction and facilities services, building services, and industrial services. In 2024, we had revenues of approximately $14.6 billion. Our services are provided to a broad range of commercial, technology, manufacturing, industrial, healthcare, utility, and institutional customers through approximately 100 operating subsidiaries, which specialize principally in providing construction services relating to electrical and mechanical systems in all types of facilities and in providing various services relating to the operation, maintenance, and management of those facilities. Such operating subsidiaries are organized into the following reportable segments:\nUnited States electrical construction and facilities services;\nUnited States mechanical construction and facilities services;\nUnited States building services;\nUnited States industrial services; and\nUnited Kingdom building services.\nOur operating subsidiaries offer comprehensive and diverse solutions on a broad scale and have many long-standing customer relationships. We provide construction services and building services directly to corporations, municipalities and federal and state governmental entities, owners/developers, and tenants of buildings. We also provide our construction services indirectly by acting as a subcontractor to general contractors, systems suppliers, construction managers, developers, property managers, and other subcontractors. We generally provide industrial services directly to refineries and petrochemical plants.\nWe derive revenues from many different customers in numerous industries, which have operations in several different geographical areas. Of our 2024 revenues, approximately 97% were generated in the United States and approximately 3% were generated in foreign countries, substantially all in the United Kingdom. In 2024, we derived approximately 67% of our revenues from our construction operations, approximately 24% of our revenues from our building services operations, and approximately 9% of our revenues from our industrial services operations. For additional information regarding our revenues, see Note 3 - Revenue from Contracts with Customers of the notes to consolidated financial statements included in Item 8. Financial Statements and Supplementary Data.\nWe believe that our range of service offerings, technical capability, skilled workforce, and strong project execution, along with our safety culture and financial resources, differentiate us from our competition and position us to benefit from future capital and maintenance spending by our customers. Our strategies of expanding our portfolio of service offerings for existing and potential customers and increasing or enhancing our presence in core end markets and geographies, along with our commitment to industry-leading best practices and technological and training capabilities, place us in the position to capitalize on opportunities and trends in the industries we serve and continue to grow our business.\nIncreasingly, our services are focused on delivering sustainable energy solutions, enhancements in energy efficiency, reductions in waste and emissions, and improvements in the safety and comfort of our customers’ facilities.\nThe broad scope of our operations is more particularly described below. For detailed segment financial information refer to Note 18 - Segment Information of the notes to consolidated financial statements included in Item 8. Financial Statements and Supplementary Data.\nOur executive offices are located at 301 Merritt Seven, Norwalk, Connecticut 06851-1092, and our telephone number at those offices is (203) 849-7800.\nUnited States electrical and mechanical construction and facilities services operations:\nOur electrical and mechanical construction services primarily involve the design, integration, installation, start-up, operation and maintenance, and provision of services relating to:\nSystems for electrical power transmission, distribution, and generation, including power cables, conduits, distribution panels, transformers, generators, uninterruptible power supply systems, and related switch gear and controls;\nPremises electrical and lighting systems, including fixtures and controls;\nProcess instrumentation in the refining, chemical processing, and food processing industries;\nLow-voltage systems, such as fire alarm, security, and process control systems;\nVoice and data communications, including fiber optic and low voltage cabling, distributed antenna systems, audiovisual systems, and wireless access points;\nSustainable energy solutions such as solar, photovoltaic, and wind, as well as the installation of electric vehicle charging stations;\nRoadway and transit lighting and signaling and fiber optic lines;\nComputerized traffic control systems, and signal and communication equipment for mass transit systems;\nHeating, ventilation, air conditioning, and refrigeration, including both traditional mechanical systems as well as geothermal solutions;\nClean-room process ventilation systems;\nFire protection and suppression systems;\nPlumbing, process and high-purity piping systems;\nControls and filtration systems;\nWater and wastewater treatment systems;\nCentral plant heating and cooling systems, including manufacturing and installing sheet metal air handling systems;\nCrane and rigging services;\nMillwright services; and\nSteel fabrication, erection, and welding services.\nThe electrical and mechanical construction services industry has experienced growth principally due to the increased content, complexity, and sophistication of electrical and mechanical systems resulting, in part, from growth in digital processing, cloud computing, data storage, and the emergence of artificial intelligence. In addition, facilities of all types require extensive electrical distribution systems, sophisticated power supplies, networks of low-voltage and fiber-optic communications cabling, and various mechanical, plumbing, and fire protection and suppression systems. Moreover, the need for substantial environmental controls within a building, due to the heightened need to maintain extensive computer systems at optimal temperatures, and the demand for increased energy efficiency, have continued to expand opportunities for our electrical and mechanical services businesses. The demand for these services is typically driven by non-residential construction and renovation activity and, in recent years, has benefited from the re-shoring of the supply chain, the need for additional high-tech manufacturing facilities, and the energy transition/expansion throughout the United States.\nOur electrical and mechanical construction services generally fall into one of three categories: (a) large installation projects, with contracts often in the multi-million dollar range, that involve: (i) the construction of manufacturing facilities, data centers, warehousing and distribution facilities, hospitals, and commercial buildings, (ii) institutional, public works, and infrastructure projects, or (iii) the fit-out of large blocks of space within commercial or mixed-use buildings, (b) large and medium sized capital and maintenance projects for commercial, manufacturing, pharmaceutical, healthcare, oil and gas, and industrial clients, and (c) smaller installation projects, of a short duration, typically involving fit-out, renovation, and retrofit work.\nOur United States electrical and mechanical construction operations accounted for approximately 67% of our 2024 total revenues. Of such revenues, approximately 34% were generated by our electrical construction operations and approximately 66% were generated by our mechanical construction operations.\nOur largest projects include those within: (a) the network and communications market sector (including data centers, data and fiber projects, and cabling); (b) the high-tech manufacturing market sector (including semiconductor, biotech, life-sciences, and pharmaceutical facilities, as well as projects across the electric vehicle value chain); (c) the commercial market sector (including warehousing and distribution facilities and office or mixed-use buildings); (d) the manufacturing and industrial market sector (including steel, pulp and paper mills, food processing and traditional automotive manufacturing facilities, power generation (including sustainable energy solutions such as solar and wind), oil and gas refineries, and chemical processing plants); (e) the healthcare market sector (including hospitals, surgical centers, rehabilitation and nursing facilities, and medical offices); (f) the institutional market sector (including educational and correctional facilities and research laboratories); (g) the water and wastewater market sector; (h) the transportation market sector (including highways, bridges, airports, and transit systems); and (i) the hospitality and entertainment market sector (including resorts, hotels, gaming facilities, convention centers, and sports stadiums). Our largest projects, which typically range in size from $10 million up to and occasionally exceeding $200 million, represented approximately 54% of our electrical and mechanical construction services revenues in 2024. These projects often involve new construction and a combination of design, installation, and start-up services. Depending on the size and complexity of these projects, they may span multiple years and typically require significant technical and management skills and the financial strength to obtain performance bonds, which are often a condition to bidding for and winning these projects.\nOur projects of less than $10 million accounted for approximately 46% of our electrical and mechanical construction services revenues in 2024. These projects are typically completed in less than one year. They usually involve electrical and mechanical construction services when an end-user or owner undertakes construction or modification of a facility to accommodate a specific use, upgrade or replace aging systems, or increase energy efficiency. These projects frequently require electrical and mechanical systems to meet special needs such as critical systems power supply, fire protection systems, special environmental controls and high-purity air systems, sophisticated electrical and mechanical systems for data centers, new production lines in manufacturing plants, and office arrangements in existing office buildings. They are not usually dependent upon the new construction market. Demand for these projects and types of services is often prompted by the expiration of leases, changes in technology, the demand for more energy efficient systems, or changes in the customer’s plant or office layout in the normal course of a customer’s business.\nUnited States and United Kingdom building services operations:\nOur building services include:\nMaintenance and services for mechanical, electrical, plumbing, fire safety, and building automation systems;\nModification and retrofit projects;\nProgram development, management, and maintenance for energy systems, including LEED and other sustainable solutions to assist our customers in reducing energy consumption;\nEnergy efficiency retrofit services, including HVAC, lighting, water, weatherization, and air flow management solutions;\nTechnical consulting and diagnostic services;\nServices aimed at improving indoor air quality;\nInstallation and support for building systems;\nCommercial and government site-based operations and maintenance;\nFacility management, maintenance, and services;\nFloor care and janitorial services;\nLandscaping, lot sweeping, and snow removal;\nOther building services, including reception, security, and",
  "item7_clean": "Operating income for the year ended December 31, 2024 was $1,344.9 million, an increase of $469.1 million compared to operating income of $875.8 million for the year ended December 31, 2023. Operating margin was 9.2% and 7.0% in 2024 and 2023, respectively. As described in more detail below, these increases in profitability were predominantly a result of improved operating performance within our United States construction segments, due to a more favorable mix of work and better project execution, including enhanced productivity, due in part to investments in virtual design and construction, prefabrication, and automation. Operating income for 2024 included incremental acquisition contribution of $13.4 million net of amortization expense attributable to identifiable intangible assets of $15.3 million.\nOperating income of our United States electrical construction and facilities services segment for the year ended December 31, 2024 was $447.2 million, or 13.4% of revenues, compared to operating income for the year ended December 31, 2023 of $230.6 million, or 8.3% of revenues. The $216.5 million increase in operating income and 510 basis point improvement in operating margin of this segment were a result of greater gross profit and gross profit margin from projects within the majority of the market sectors in which we operate, due to both an increase in revenues as well as a more favorable mix of work. While the most significant increase in gross profit was experienced within the network and communications market sector, this segment additionally benefited from greater gross profit recognized on projects within the manufacturing and industrial, transportation, institutional, and high-tech manufacturing market sectors.\nOur United States mechanical construction and facilities services segment’s operating income for the year ended December 31, 2024 was $799.6 million, a $269.0 million increase compared to operating income of $530.6 million for the year ended December 31, 2023. Operating margin of this segment for the year ended December 31, 2024 was 12.5%, a 200 basis point improvement over its operating margin for the year ended December 31, 2023 of 10.5%. This segment’s operating income for 2024 included incremental acquisition contribution of $14.4 million net of amortization expense attributable to identifiable intangible assets of $10.3 million. Excluding the impact of acquisitions, the increases in operating income and operating margin of this segment were primarily a result of contribution from projects within: (a) the high-tech manufacturing market sector, including certain mechanical construction or fire protection projects for customers engaged in either the design or manufacturing of semiconductors or the production and development of electric vehicles and/or lithium batteries, and (b) the network and communications market sector. While the most significant increases in gross profit were seen within the above referenced market sectors, this segment also experienced increases in gross profit across all of the other market sectors in which we operate, with notable increases generated within institutional, manufacturing and industrial, and commercial.\nOperating income of our United States building services segment for the year ended December 31, 2024 was $176.7 million, or 5.7% of revenues, compared to operating income of $183.0 million, or 5.9% of revenues, for the year ended December 31, 2023. Increased gross profit from this segment’s mechanical services division, due primarily to greater profitability across its portfolio of HVAC and building automation and controls projects and retrofits, was partially offset by reductions in gross profit from its commercial site-based services and government site-based services divisions, given the loss of certain facilities maintenance contracts not renewed pursuant to rebid. In addition, operating income and operating margin for the year ended December 31, 2024 were negatively impacted by an $11.0 million reserve recorded during the first quarter for a specific customer bankruptcy within this segment’s commercial site-based services division. Such reserve negatively impacted the operating margin of this segment for 2024 by approximately 30 basis points.\nOur United States industrial services segment’s operating income for the year ended December 31, 2024 was $44.2 million, or 3.5% of revenues, compared to operating income of $35.4 million, or 3.0% of revenues, for the year ended December 31, 2023. Operating income of this segment benefited from greater gross profit generated within its: (a) field services division due to the increase in revenues referenced above, and (b) shop services division as a result of an improvement in gross profit margin given favorable pricing. The increase in operating margin of this segment was attributable to the increased gross profit margin within the shop services division.\nOperating income of our United Kingdom building services segment for the year ended December 31, 2024 was $21.5 million, or 5.0% of revenues, compared to operating income of $25.7 million, or 5.9% of revenues, for the year ended December 31, 2023. The decrease in operating income and operating margin was due to a decline in gross profit and gross profit margin. In addition to the impact of lower facilities maintenance revenues, gross profit and gross profit margin were negatively affected by a less favorable mix of work when compared to the prior year, which included a greater number of higher margin projects. Operating income of this segment for 2024 was positively impacted by $0.5 million as a result of favorable exchange rate movements for the British pound versus the United States dollar.\nOur corporate administration expenses were $144.4 million for 2024 compared to $127.2 million in 2023. The increase in corporate expenses was primarily due to: (a) greater employment compensation and related costs, including salaries and benefits, incentive compensation, and share-based compensation, (b) certain severance expenses which were recorded during the first quarter of the year, and (c) higher computer hardware and software costs, due to various information technology and cybersecurity initiatives currently in process.\nInterest expense was $3.8 million and $17.2 million for the years ended December 31, 2024 and 2023, respectively. The year-over-year decrease in interest expense was a result of the repayment, in December of 2023, of all previously outstanding direct borrowings under our credit facility. Interest income was $35.4 million and $15.4 million for the years ended December 31, 2024 and 2023, respectively. The increase in annual interest income resulted from greater returns on our invested cash, due to an increase in our average daily invested cash balance.\nOur income tax provision for the year ended December 31, 2024 was $370.2 million, based on an income tax rate of 26.9%, compared to an income tax provision and an income tax rate of $239.5 million and 27.5%, respectively, for the year ended December 31, 2023. Refer to Note 11 - Income Taxes of the notes to consolidated financial statements included in Item 8. Financial Statements and Supplementary Data for further discussion regarding our income tax provision and effective income tax rate.\nRemaining Unsatisfied Performance Obligations\nThe following table presents the transaction price allocated to remaining unsatisfied performance obligations (“remaining performance obligations”) for each of our reportable segments and their respective percentage of total remaining performance obligations (in thousands, except for percentages):\nRemaining performance obligations:\nUnited States electrical construction and facilities services\nUnited States mechanical construction and facilities services\nUnited States building services\nUnited States industrial services\nTotal United States operations\nUnited Kingdom building services\nOur remaining performance obligations at December 31, 2024 were $10.10 billion compared to $8.85 billion at December 31, 2023. Remaining performance obligations increased within all of our reportable segments, with the exception of our United States building services segment, which experienced a modest decline. The most significant growth was experienced within our United States construction segments, largely as a result of the award of several data center construction contracts within the network and communications market sector. These segments also experienced increases in remaining performance obligations across a number of the other sectors we serve, most notably within healthcare. Remaining performance obligations increased by $178.8 million as a result of acquisitions made by us during 2024. Partially offsetting these increases was a decrease in remaining performance obligations within the high-tech manufacturing market sector primarily as a result of progress made on certain semiconductor and electric vehicle manufacturing construction projects within our United States mechanical construction and facilities services segment.\nSee Note 3 - Revenue from Contracts with Customers of the notes to consolidated financial statements included in Item 8. Financial Statements and Supplementary Data for further disclosure regarding our remaining performance obligations.\nLiquidity and Capital Resources\nThe following section discusses our principal liquidity and capital resources, as well as our primary liquidity requirements and sources and uses of cash.\nWe are focused on the efficient conversion of operating income into cash to provide for the Company’s material cash requirements, including working capital needs, investment in our growth strategies through business acquisitions and capital expenditures, satisfaction of contractual commitments, including principal and interest payments on any outstanding indebtedness, and shareholder return through dividend payments and share repurchases. We strive to maintain a balanced approach to capital allocation in order to achieve growth, deliver value, and minimize risk.\nManagement monitors financial markets and overall economic conditions for factors that may affect our liquidity and capital resources and adjusts our capital allocation strategy as necessary. Negative macroeconomic trends could have an adverse effect on future liquidity if we experience delays in the payment of outstanding receivables beyond normal payment terms, an increase in credit losses, or significant increases in the price of commodities or the materials and equipment utilized for our project and service work, beyond those experienced to date. In addition, during economic downturns, there have typically been fewer small discretionary projects from the private sector and our competitors have aggressively bid larger long-term infrastructure and public sector contracts. Our liquidity is also impacted by: (a) the type and length of construction contracts in place, as performance of long duration contracts typically requires greater amounts of working capital, (b) the level of turnaround activities within our United States industrial services segment, as such projects are billed in arrears pursuant to contractual terms that are standard within the industry, and (c) the billing terms of our maintenance contracts, including those within our United States and United Kingdom building services segments. While we strive to negotiate favorable billing terms, which allow us to invoice in advance of costs incurred on certain of our contracts, there can be no assurance that such terms will be agreed to by our customers.\nAs of December 31, 2024, we had cash and cash equivalents, excluding restricted cash, of $1,339.6 million, which are maintained in depository accounts and highly liquid investments with original maturity dates of three months or less. Both our short-term and long-term liquidity requirements are expected to be met through our cash and cash equivalent balances, cash generated from our operations, and, as necessary, the borrowing capacity under our revolving credit facility. Our credit agreement provides for a $1.30 billion revolving credit facility, for which there was $1.23 billion of available capacity as of December 31, 2024.\nRefer to Note 9 - Debt of the notes to consolidated financial statements included in Item 8. Financial Statements and Supplementary Data for further information regarding our credit agreement. Based upon our current credit rating and financial position, we can also reasonably expect to be able to secure long-term debt financing if required to achieve our strategic objectives; however, no assurances can be made that such debt financing will be available on favorable terms. We believe that we have sufficient financial resources available to meet our short-term and foreseeable long-term liquidity requirements.\nThe following table presents a summary of our operating, investing, and financing cash flows (in thousands):\n\nUnited States electrical construction and facilities services\nUnited States mechanical construction and facilities services\nUnited States building services\nDue to the significant judgments utilized in the estimation process described above, if subsequent actual results and/or updated assumptions, estimates, or projections related to our underlying project positions were to change from those utilized at December 31, 2024, it could result in a material impact to our results of operations. For example, a 50 basis point increase or decrease in the estimated gross profit margin on our uncompleted construction projects, in the aggregate, as a result of a revision in estimated costs to complete a performance obligation or a revision in estimated transaction price, would have resulted in an increase or decrease to operating income of approximately $130 million for the year ended December 31, 2024.\nSee Note 3 - Revenue from Contracts with Customers of the notes to consolidated financial statements included in Item 8. Financial Statements and Supplementary Data for further disclosure regarding revenue recognition.\nInsurance Liabilities\nWe have loss payment deductibles for certain workers’ compensation, automobile liability, general liability, and property claims, have self-insured retentions for certain other casualty claims, and are self-insured for employee-related healthcare claims. In addition, we maintain a wholly-owned captive insurance subsidiary to manage certain of our insurance liabilities. Losses are recorded based upon estimates of our liability for claims incurred and for claims incurred but not reported. The liabilities are derived from known facts, historical trends, and industry averages, utilizing the assistance of an independent third-party actuary to determine the best estimate for the majority of these obligations. We believe the liabilities recognized on the Consolidated Balance Sheets for these obligations are adequate. However, such obligations are difficult to assess and estimate due to numerous factors, including severity of injury, determination of liability in proportion to other parties, timely reporting of occurrences, and effectiveness of safety and risk management programs. Therefore, if our actual experience differs from the assumptions and estimates used for recording the liabilities, adjustments may be required and will be recorded in the period that the experience becomes known. In addition, an increase in the cost to settle insurance claims could result in higher insurance costs and deductibles. Our estimated net insurance liabilities for workers’ compensation, automobile liability, general liability, and property claims increased by $20.0 million for the year ended December 31, 2024 compared to the year ended December 31, 2023, partially as a result of greater potential exposures and an increase in certain of our deductibles or self-insured retentions. If our estimated insurance liabilities for workers’ compensatio",
  "item2_clean": null
}