{
  "source_file": "emr-20250930.htm",
  "form_type": "10-K",
  "item1_clean": "ITEM 1 - BUSINESS\nEmerson Electric Co. (\"Emerson\", \"we\", \"us\", \"our\" or the \"Company”) is a global technology and software company that provides innovative solutions for customers in a wide range of end markets around the world. Through its leading automation portfolio, Emerson helps process, hybrid and discrete manufacturers optimize operations, protect personnel, reduce emissions and achieve their sustainability goals. Sales by geographic destination in 2025 were: the Americas,\n51 percent; Asia, Middle East & Africa, 30 percent (China, 10 percent); and Europe, 19 percent\nPortfolio management is an integral component of Emerson's growth and value creation strategy. Over the past three years, the Company has taken significant actions to accelerate the transformation of its portfolio through the completion of strategic acquisitions and divestitures of non-core businesses. These actions were undertaken to create a cohesive, higher growth, higher margin industrial technology portfolio, and the Company is now a global automation leader serving a diversified set of end markets. The Company’s recent portfolio actions include the following transactions (note that all d\nollars in Item 1 are in millions, except where noted)\nOn March 12, 2025, Emerson completed its purchase of the remaining outstanding shares of common stock of AspenTech not already owned by the Company for approximately $7.2 billion. As a result of the transaction, AspenTech is now a wholly owned subsidiary of the Company. AspenTech was reorganized upon completion of the transaction and now reports to Control Systems & Software leadership. AspenTech's results, which were previously reported as a separate segment, are now consolidated into the Control Systems & Software segment for all periods presented.\nOn October 11, 2023, the Company completed the acquisition of National Instruments Corporation (\"NI\") at an equity value of $8.2 billion. NI, which provides software-connected automated test and measurement systems that enable enterprises to bring products to market faster and at a lower cost, had revenues of approximately $1.7 billion and pretax earnings of approximately\nfor the 12 months ended September 30, 2023.\nOn May 31, 2023, the Company completed the sale of a majority stake in its Climate Technologies business (which constitutes the former Climate Technologies segment, excluding Therm-O-Disc which was divested earlier in 2022; the new standalone business is named Copeland) to private equity funds managed by Blackstone in a $14.0 billion transaction. Emerson received upfront, pre-tax cash proceeds of approximately $9.7 billion and a note receivable with a face value of $2.25 billion, while retaining a 40 percent non-controlling common equity interest in a new standalone joint venture between Emerson and Blackstone. Subsequently, in August 2024, Emerson sold its 40 percent non-controlling common equity interest in Copeland to private equity funds managed by Blackstone for $1.5 billion and sold the note receivable to Copeland for $1.9 billion.\nOn October 31, 2022, the Company completed the divestiture of its InSinkErator business, which manufactures food waste disposers, to Whirlpool Corporation for $3.0 billion.\nFurther information regarding acquisition and divestiture activity is set forth in Notes 4 and 5.\nAs a result of its portfolio transformation discussed above, the Company now reports six segments and two business groups, which are highlighted in the table below (see Note 20 for further details).\nINTELLIGENT DEVICES\nSOFTWARE AND CONTROL\nControl Systems & Software\nMeasurement & Analytical\nSafety & Productivity\nThe Company's comprehensive automation portfolio includes intelligent devices, control systems and design and optimization software solutions to support a diverse set of industries and infrastructure, including process industries (such as chemical, power & renewables and energy), hybrid industries (life sciences, metals & mining, food & beverage, pulp & paper, and others), discrete industries (including automotive, medical, packaging and semiconductor) and more.\nEmerson was incorporated in Missouri in 1890 and has evolved through internal growth and strategic acquisitions. Management has a well-established set of operating mechanisms to manage its business performance and set strategy. The Company also has processes undertaken by management with oversight from the Board of Directors to specifically focus on risks in areas such as cybersecurity, compliance, legal, sustainability, financial and reputational, among others. The Company periodically updates, assesses, and monitors its risk exposures, provides timely updates to the Board, and takes actions to mitigate these risks.\nINTELLIGENT DEVICES\nThe Final Control segment is a leading global provider of control valves, isolation valves, shutoff valves, pressure relief valves, pressure safety valves, actuators, and regulators for process and hybrid industries. These solutions respond to commands from a control system to continuously and precisely control and regulate the flow of liquids or gases to achieve safe operation along with reliability, sustainability and optimized performance. Products within our Final Control segment are marketed under a variety of brands including: Anderson Greenwood, Bettis, Crosby, Fisher, Keystone, KTM and Vanessa.\nMeasurement & Analytical\nThe Measurement & Analytical segment is a leading supplier of intelligent instrumentation measuring the physical properties of liquids or gases, such as pressure, temperature, level, flow, acoustics, corrosion, pH, conductivity, water quality, toxic gases, and flame. These devices transfer data and asset management information to control systems and automation software, allowing process and hybrid industry operators to make educated decisions regarding production, reliability, sustainability and safety. Products within our Measurement & Analytical segment are marketed under a variety of brands including: Flexim, Micro Motion and Rosemount.\nThe Discrete Automation segment includes solenoid valves, pneumatic valves, valve position indicators, pneumatic cylinders and actuators, air preparation equipment, pressure and temperature switches, electric linear motion solutions, programmable automation control systems and software, electrical distribution equipment, and materials joining solutions used primarily in discrete industries. Products within our Discrete Automation segment are marketed under a variety of brands including: Afag, Appleton, ASCO, Aventics, Branson, Movicon, PACSystems, SolaHD, TESCOM, and TopWorx.\nSafety & Productivity\nThe Safety & Productivity segment delivers\ntools for professionals and homeowners that support infrastructure, promote safety and enhance productivity.\nPipe-working tools include pipe wrenches and cutters, pipe threading and roll grooving equipment, battery hydraulic tools for press connections, drain cleaners and diagnostic systems, including sewer inspection cameras and locating equipment. Electrical tools include conduit benders and cable pulling equipment, battery hydraulic tools for cutting and crimping electrical cable, and hole-making equipment. Other professional tools include water jetters, wet-dry vacuums, commercial vacuums and hand tools. Products within our Safety & Productivity segment are marketed under a variety of brands including: Greenlee, Klauke, ProTeam and RIDGID.\nSOFTWARE AND CONTROL\nControl Systems & Software\nThe Control Systems & Software segment provides control systems and software that control plant processes by collecting and analyzing information from measurement devices in the plant. These technologies determine optimal settings with software based on a customer's specific algorithms and use that information to adjust valves, pumps, motors, drives and other control hardware for maximum product quality, process efficiency, sustainability and safety. These solutions include distributed control systems, safety instrumented systems, SCADA systems, application software, digital twins, asset performance management and cybersecurity. Control Systems & Software solutions are predominantly used by process and hybrid manufacturers. This segment also includes the AspenTech business, which is a global leader in asset optimization software that enables industrial manufacturers to design, operate and maintain their operations for maximum performance. AspenTech combines decades of modeling, simulation and optimization capabilities with industrial operations expertise and applies advanced analytics to improve the profitability and sustainability of production assets. The purpose-built software drives value for customers by improving operational efficiency and maximizing productivity, reducing unplanned downtime and safety risks, and minimizing energy consumption and emissions. Products within our Control Systems & Software segment are marketed under a variety of brands including DeltaV and Ovation.\nAs discussed above, Emerson completed the acquisition of NI on October 11, 2023. This business is now referred to as Test & Measurement and is reported as a segment in the Software and Control business group. Test & Measurement provides software-connected automated test and measurement systems that enable enterprises to bring products to market faster and at a lower cost. The Test & Measurement business spans the full range of customer needs including modular instrumentation, data acquisition and control solutions, and general-purpose development software.\nRESEARCH & DEVELOPMENT\nInvesting in innovation to accelerate organic growth is a critical component of Emerson's value creation strategy. The Company is focused on key growth initiatives across its software, control and intelligent devices portfolio. These initiatives include disruptive measurement technologies, software-defined automation systems, self-optimizing asset software and sustainability solutions. Total spending for R&D, engineering expense and customer-funded engineering and development w\nas 8.1 percent of sales in 2025\nand in 2024, compared to 6.9 percent in 2023.\nDISTRIBUTION\nThe principal worldwide distribution channel for a majority of the Company's product offerings is through a direct sales forc\ne, while a network of independent sales representatives, and to a lesser extent independent distributors purchasing products for resale, are also utilized.\nRAW MATERIALS\nThe Company's major requirements for basic raw materials include steel, cast iron, electronics, rare earth metals, aluminum a\nnd brass; and to a lesser extent, plastics and petroleum-based chemicals. The Company seeks to have many sources of supply for each of its major requirements in order to avoid significant dependence on any one or a few suppliers. However, the supply of materials or other items could be disrupted by natural disasters or other events. Despite market price volatility for certain requirements, the raw materials and various purchased components needed for the Company’s products have generally been available in sufficient quantities. See Item 7 - “Management’s Discussion and Analysis of Financial Condition and Results of Operations.”\nPATENTS, TRADEMARKS AND LICENSES\nThe Company maintains an intellectual property portfolio it has developed or acquired over a number of years, including patents, trademarks and licenses. The Company also continues to develop or acquire new intellectual propert\ny. New patent applications are continuously filed to protect the Company’s ongoing research and development activities and the Company periodically reviews the continued utility of patent assets. The Company’s\ntrademark registrations may be renewed and their duration is dependent upon national laws and trademark use. While this proprietary intellectual property portfolio is important to the Company in the aggregate, management does not regard any of its segments as being dependent on any single patent, trademark re",
  "item7_clean": "ITEM 7 - MANAGEMENT'S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS\nSafe Harbor Statement\nNon-GAAP Financial Measures\nTo supplement the Company’s financial information presented in accordance with U.S. generally accepted accounting principles (U.S. GAAP), management periodically uses certain “non-GAAP financial measures,” as such term is defined in Regulation G under SEC rules, to clarify and enhance understanding of past performance and prospects for the future. Generally, a non-GAAP financial measure is a numerical measure of a company’s operating performance, financial position or cash flows that excludes or includes amounts that are included in or excluded from the most directly comparable measure calculated and presented in accordance with U.S. GAAP. For exa\nmple, non-GAAP measures may exclude the impact of certain items such as acquisitions or divestitures, amortization of intangibles, restructuring costs, discrete taxes,\ngains, losses and impairments, or items outside of management’s control, such as foreign currency exchange rate fluctuations. Management believes that the following non-GAAP financial measures provide investors and analysts useful insight into the Company’s financial position and operating performance. Any non-GAAP measure provided should be viewed in addition to, and not as an alternative to, the most directly comparable measure determined in accordance with U.S. GAAP, as identified in italics below. Further, the calculation of these non-GAAP financial measures may\ndiffer from the calculation of similarly titled financial measures presented by other companies and therefore may not be comparable among companies.\nUnderlying sales, which exclude the impact of significant acquisitions, divestitures and fluctuations in foreign currency exchange rates during the periods presented, are provided to facilitate relevant period-to-period comparisons of sales growth by excluding those items that impact overall comparability (U.S. GAAP measure:\nOperating profit (defined as net sales less cost of sales and selling, general and administrative expenses) and operating profit margin (defined as operating profit divided by net sales) are indicative of short-term operational performance and ongoing profitability. Management closely monitors operating profit and operating profit margin of each business to evaluate past performance and actions required to improve profitability. EBIT (defined as earnings before deductions for interest expense, net, related party interest income, and income taxes) and total segment EBIT, and EBIT margin (defined as EBIT divided by net sales) and total segment EBIT margin, are financial measures that exclude the impact of financing on the capital structure and income taxes\n. Adjusted EBITA and adjusted segment EBITA (defined as earnings excluding interest expense, net, related party interest income, income taxes, intangibles amortization expense, restructuring expense, first year purchase accounting related items and transaction fees, and certain gains, losses or impairments) and adjusted EBITA margin and adjusted segment EBITA margin (defined as adjusted EBITA divided by net sales) are measures used by management to evaluate the Company's operational performance, as they exclude the impact of acquisition-related investments and non-operational items. EBITDA (defined as EBIT excluding depreciation and amortization) and EBITDA margin (defined as EBITDA divided by net sales) are also used as measures of the Company's current operating performance, as they exclude the impact of capital and acquisition-related investments. Adjusted EBITDA (defined as EBITDA excluding restructuring expense, first year purchase accounting related items and transaction fees, and certain gains, losses or impairments) and adjusted EBITDA margin (defined as Adjusted EBITDA divided by net sales) are also used to exclude the impact of non-operational items. All of these are commonly used financial measures\nutilized by management to evaluate performance (U.S. GAAP measures:\npretax earnings or pretax profit margin, segment earnings or segment margin\nAdjusted earnings and earnings per share, which exclude certain gains and losses, impairments, restructuring costs, impacts of acquisitions or divestitures, amortization of intangibles, discrete taxes, or other items provide additional insight into the underlying, ongoing operating performance of the Company and facilitate period-to-period comparisons by excluding the earnings impact of these items. Management believes that presenting adjusted earnings and earnings per share excluding these items is more representative of the Company’s operational performance and may be more useful for investors (U.S. GAAP measures:\nearnings, earnings per share\nFree cash flow (operating cash flow less capital expenditures) and free cash flow as a percent of net sales are indicators of the Company’s cash generating capabilities, and dividends as a percent of free cash flow is an indicator of the Company's ability to support its divid\nend, after considering investments in capital assets which are necessary to maintain and enhance existing operations. The determination of operating cash flow adds back noncash depreciation expense to earnings and thereby does not reflect a charge for necessary capital expenditures. Managemen\nt believes that free cash flow, free cash flow as a percent of net sales and dividends as a percent of free cash flow are useful to both management and investors as measures of the Company’s ability to generate cash and support its dividend (U.S. GAAP measures:\noperating cash flow, operating cash flow as a percent of net sales, dividends as a percent of operating cash flow\n\nInternational destination sales, including U.S. exports, increased 1 percent, to $10.6 billion in 2025,\nreflecting the Company's overall increase in sale\ns. U.S. exports of $1.4 billion were up 5 percent compared with 2024. Underlying international destination sales were up 1 percent. Underlying sales increased 3 percent in Asia, Middle East & Africa (China down 4 percent) and 7 percent in Canada, while Europe decreased 2 percent and Latin America was flat.\nOrigin sales by international subsidiaries, including shipments to the U.S., total\ned $9.4 billion in 2025, up 1 percent compa\nInternational destination sales, including U.S. exports, increased 18 percent, to $10.5 billion in 2024, reflecting the Company's overall increase in sales and the impact of the Test & Measurement acquisition. U.S\n. exports of $1.3 billion were up 26 percent compared with 2023\n. Underlying international destination sales were up 9 percent and the Test & Measurement acquisition added 9 percent. Underlying sales\n7 percent in Europe, 8 percent in Asia, Middle East & Africa (China down 3 percent), 21 percent in Latin Americ\na and 5 percent in Canada.\nOrigin sales by international subsidiaries, including shipments to the U.S., totaled $9.3 billion in 2024, up 20 percent compared with 2023.\nACQUISITIONS AND DIVESTITURES\nPortfolio management is an integral component of Emerson's growth and value creation strategy. Over the past three years, the Company has taken significant actions to accelerate the transformation of its portfolio through the completion of strategic acquisitions and divestitures of non-core businesses. These actions were undertaken to create a cohesive, higher growth and higher margin industrial technology portfolio as a global automation leader serving a diversified set of end markets. The Company’s recent portfolio actions include the following transactions:\nOn March 12, 2025, Emerson completed its purchase of the remaining outstanding shares of common stock of AspenTech not already owned by the Company for approximately $\nbillion. Emerson also incurred fees of $\n($65 after-tax) and paid $\nto settle certain AspenTech share-based awards that were outstanding prior to the transaction closing. The purchase of the remaining outstanding shares and related costs are reported as an adjustment to Equity. Separately, AspenTech incurred $\nafter-tax) of deal-related fees which are reported as acquisition/divestiture costs in Other deductions, net. AspenTech is now reported as a part of the Control Systems & Software segment in the Software and Control business group, see Note 20.\nOn November 15, 2024, AspenTech acquired Open Grid Systems Limited, a global provider of network model management technology and a pioneer in developing model-driven applications supporting open access to data through industry standards, for a total purchase price of $\n, net of cash acquired.\nOn October 11, 2023, the Company completed the acquisition of National Instruments Corporation (\"NI\") at an equity value of $8.2 billion. NI, which provides software-connected automated test and measurement systems that enable enterprises to bring products to market faster and at a lower cost, had revenues of approximately $1.7 billion and pretax earnings of approximately $170 for the 12 months ended September 30, 2023.\nIn 2023, the Company acquired two businesses, Flexim, which is reported in the Measurement & Analytical segment, and Afag, which is reported in the Discrete Automation segment, for $715, net of cash acquired.\nOn May 31, 2023, the Company completed the sale of a majority stake in its Climate Technologies business (which\n\nrates, expected equity market returns and the volatility of markets served, particularly when recessionary economic circumstances continue for an extended period of time.\nRETIREMENT PLANS\nThe Company maintains a prudent long-term investment strategy consistent with the duration of pension obligations. The determination of defined benefit plan expense and liabilities is dependent on various assumptions, including the expected annual rate of return on plan assets, the discount rate and the rate of annual compensation increases. In accordance with U.S. generally accepted accounting principles, actual results that differ from the Compa\nny's assumptions are accumulated as deferred actuarial gains or losses and amortized to expense in future periods. The Company's principal U.S. defined benefit plan is closed to employees hired after January 1, 2016 while shorter-tenured employees ceased accruing benefits effective October 1, 2016. Effective January 1, 2025, the Company implemented a new profit sharing retirement program for all U.S. non-union employees. Eligible employees receive a base contribution to a cash balance account administered within the principal U.S. defined benefit plan, funded by surplus pension assets, as well as a potential profit sharing contribution to their defined contribution account. For employees that had continued to accrue benefits in the principal U.S. defined benefit plan, future service after December 31, 2024 is frozen.\nAs of September 30, 2025, the U.S. pension plans were overfunded by $856 in total (approximatel\nercent in excess of the projected benefit obligation), including unfunded plans totaling $161. The non-U.S. plans were underfunded by $65, including unfunded plans totaling $242. The Company contributed a total of $46 to defined benefit plans in 2025 and expects to contribute approximately $40 in 2026. At year-end 2025, the discount rate for U.S. plans was 5.27 percent, and was 4.97 percent in 2024. The assumed investment return on plan assets was 6.50 percent in 2025, 6.50 percent in 2024 and 6.00 percent in 2023, and will be 6.75 percent for 2026. While management believes its assumptions used are appropriate, actual experience may differ. A 0.25 percentage point decrease in the U.S. and non-U.S. discount rates would have increased the total projected benefit obligation at September 30, 2025 by $100 and increased 2026 pension expense by $10. A 0.25 percentage point decrease in the expected return on plan assets would increase 2026 pension expense by $10. See Note 1\nCONTINGENT LIABILITIES\nThe Company is a party to a number of pending legal proceedings and claims, including those involving general and product liability (including asbestos)\nand other matters, several of which claim substantial amounts of damages. The Company accrues for such liabilities when it is probable that future costs (including legal fees and expenses) will be incurred and such costs can be reasonably estimated. Accruals are based on developments to date; management's estimates of the outcomes of these matters; and the Company's experience in contesting, litigating and settling similar matters. T\nhe Company engages an outside expert to develop an actuarial estimate of its expected costs to resolve all pending and future asbestos claims, including defense costs, as well as its related insurance receivables. The reserve for asbestos litigation, which is recorded on an undiscounted basis, is based on projected claims through 2065.\nAlthough it is not possible to predict the ultimate outcome of these matters, the Company historically has been largely successful in defending itself against claims and suits that have been brought against it, and will continue to defend itself vigorously in all such matters. While the Company believes a material adverse impact is unlikely, given the inherent uncertainty of litigation, a remote possibility exists that a future development could have a material adverse impact on the Company. See Note 15.\nINCOME TAXES\nIncome tax expense and tax assets and liabilities reflect management's assessment of taxes paid or expected to be paid (received) on items included in the financial statements. Deferred tax assets and liabilities arise from temporary differences between the consolidated financial statement carrying amounts of existing assets and liabilities and their respective tax bases, and consideration of operating loss and tax credit carryforwards. Deferred income taxes are measured using enacted tax rates in effect for the year in which the temporary differences are expected to be recovered or settled. The impact on deferred tax assets and liabilities of a change in tax rates is recognized in the period that includes the enactment date. Valuation allowances are provided to reduce deferred tax assets to the amount that will more likely than not be realized. This requires management to make judgments and estimates regarding the amount and timing of the reversal of taxable temporary differences, expected future taxable income, and the impact of tax planning strategies.\nUncertainty exists regarding tax positions taken in previously filed tax returns which remain subject to examination, along with positions expected to be taken in future returns. The Company provides for unrecognized tax benefits,\n\nconstitutes the former Climate Technologies segment, excluding Therm-O-Disc which was divested earlier in 2022) to private equity funds managed by Blackstone in a $14.0 billion transaction. The Company recognized a pretax gain of approximately $10.6 billion (approximately $8.4 billion after-tax including tax expense recognized in prior quarters related to subsidiary restructurings). The standalone business is named Copeland.\nSubsequently, on June 6, 2024, the Company entered into definitive agreements to sell its 40 percent non-controlling common equity interest in Copeland to private equity funds managed by Blackstone for $1.5 billion and its note receivable to Copeland for $1.9 billion and the transactions were completed in August 2024.\nOn March 31, 2023, Emerson completed the divestiture of Metran, its Russia-based manufacturing subsidiary and in 2023, recognized a pretax loss of $47 in Other deductions ($47 after-tax, in total $0.08 per share) related to its exit of business operations in Russia. Emerson's historical net sales in Russia represented approximately 2.0 percent of consolidated annual sales.\nOn October 31, 2022, the Company completed the divestiture of its InSinkErator business, which manufactures food waste disposers, to Whirlpool Corp",
  "item2_clean": null
}