{
  "source_file": "eog-20250930.htm",
  "form_type": "10-Q",
  "item1_clean": null,
  "item7_clean": null,
  "item2_clean": "Results of Operations\nThe following review of operations for the three months and nine months ended September 30, 2025 and 2024 should be read in conjunction with the Condensed Consolidated Financial Statements of EOG and notes thereto included in this Quarterly Report on Form 10‑Q. The following includes results of operations from the assets acquired from Encino beginning August 1, 2025.\nThree Months Ended September 30, 2025 vs. Three Months Ended September 30, 2024\nOperating Revenues and Other.\nDuring the third quarter of 2025, total operating revenues decreased $118 million, or 2%, to $5,847 million from $5,965 million for the same period of 2024. Total revenues from sales of EOG's production of crude oil and condensate, NGLs and natural gas for the third quarter of 2025 increased $170 million, or 4%, to $4,554 million from $4,384 million for the same period of 2024. EOG recognized net gains on the mark-to-market of financial commodity and other derivative contracts of $116 million for the third quarter of 2025 compared to net gains of $79 million for the same period of 2024. Gathering, processing and marketing revenues for the third quarter of 2025 decreased $303 million, or 20%, to $1,178 million from $1,481 million for the same period of 2024.\n\nThe primary factors impacting the cost components of per-unit rates of lease and well, GP&T, DD&A, G&A and interest expense, net for the three months ended September 30, 2025, compared to the same period of 2024, are set forth below. See \"Operating Revenues and Other\" above for a discussion of volumes.\nLease and well expenses include expenses for EOG-operated properties, as well as expenses billed to EOG from other operators where EOG is not the operator of a property. Lease and well expenses can be divided into the following categories: costs to operate and maintain crude oil and natural gas wells, the cost of workovers and lease and well administrative expenses. Operating and maintenance costs include, among other things, pumping services, produced water disposal, equipment repair and maintenance, compression expense, lease upkeep and fuel and power. Workovers are operations to restore or maintain production from existing wells.\nEach of these categories of costs individually fluctuates from time to time as EOG attempts to maintain and increase production while maintaining efficient, safe and environmentally responsible operations. EOG continues to increase its operating activities by drilling new wells in existing and new areas. Operating and maintenance costs within these existing and new areas, as well as the costs of services charged to EOG by vendors, fluctuate over time.\nLease and well expenses of $431 million for the third quarter of 2025 increased $39 million from $392 million for the same prior year period primarily due to increased operating and maintenance costs in the United States ($33 million) and increased lease and well administrative expenses ($14 million), partially offset by decreased workover expenditures in the United States ($10 million).\nGP&T costs represent costs to process and deliver hydrocarbon products from the lease to a downstream point of sale. GP&T costs include operating and maintenance expenses from EOG-owned assets, fees paid to third-party operators and administrative expenses associated with operating EOG's GP&T assets. EOG pays third parties to process the majority of its natural gas production to extract NGLs.\nGP&T costs of $587 million for the third quarter of 2025 increased $142 million from $445 million for the same prior year period primarily due to increased GP&T costs related to increased production in the Utica and Permian Basin, partially offset by a decrease in GP&T costs in the Eagle Ford and the Powder River Basin.\nDD&A of the cost of proved oil and gas properties is calculated using the unit-of-production method. EOG's DD&A rate and expense are the composite of numerous individual DD&A group calculations. There are several factors that can impact EOG's composite DD&A rate and expense, such as field production profiles, drilling or acquisition of new wells, disposition of existing wells and reserve revisions (upward or downward) primarily related to well performance, economic factors and impairments. Changes to these factors may cause EOG's composite DD&A rate and expense to fluctuate from period to period. DD&A of the cost of other property, plant and equipment is generally calculated using the straight-line depreciation method over the useful lives of the assets.\nDD&A expenses for the third quarter of 2025 increased $138 million to $1,169 million from $1,031 million for the same prior year period. DD&A expenses associated with oil and gas properties for the third quarter of 2025 were $122 million higher than the same prior year period. The increase primarily reflects increased production in the United States ($201 million) partially offset by decreased unit rates in the United States ($80 million). DD&A expenses associated with other property, plant and equipment for the third quarter of 2025 were $16 million higher than the same prior year period primarily due to an increase in expenses related to GP&T assets and equipment.\nG&A expenses of $239 million for the third quarter of 2025 increased $72 million from $167 million for the same prior year period primarily due to increased professional services and other costs, including Encino acquisition-related costs ($61 million), and employee-related costs ($7 million).\nInterest expense, net of $71 million for the third quarter of 2025 increased $40 million compared to the same prior year period primarily due to the issuance in July 2025 of the New Notes ($46 million) and the issuance in November 2024 of the $1,000 million aggregate principal amount of 5.650% Senior Notes due 2054 ($14 million), partially offset by increased capitalized interest ($15 million) and the maturity in April 2025 of the $500 million aggregate principal amount of 3.15% Senior Notes due 2025 ($4 million).\n\nFinancial Commodity and Other Derivative Transactions.\nAs more fully discussed in Note 12 to the Consolidated Financial Statements included in EOG's 2024 Annual Report, EOG engages in price risk management activities from time to time. These activities are intended to manage EOG's exposure to fluctuations in commodity prices for crude oil, NGLs and natural gas. EOG utilizes financial commodity derivative instruments, primarily price swap, option, swaption, collar and basis swap contracts, as a means to manage this price risk. EOG has not designated any of its financial commodity and other derivative contracts as accounting hedges and, accordingly, accounts for financial commodity and other derivative contracts using the mark-to-market accounting method, including the Brent linked gas sales contract. Under this accounting method, changes in the fair value of outstanding financial and other derivative instruments are recognized as gains or losses in the period of change and are recorded as Gains on Mark-to-Market Financial Commodity and Other Derivative Contracts on the Condensed Consolidated Statements of Income and Comprehensive Income. The related cash flow impact is reflected in Cash Flows from Operating Activities on the Condensed Consolidated Statements of Cash Flows.\nThe total fair value of EOG's financial commodity and other derivative contracts was reflected on the Condensed Consolidated Balance Sheets at September 30, 2025, as a net asset of $46 million.\nAs discussed in \"Operating Revenues and Other,\" the net cash received from settlements of financial commodity derivative contracts during the third quarter of 2025 was $27 million and net cash paid for settlements of financial commodity derivative contracts during the first nine\n\nIn light of these risks, uncertainties and assumptions, the events anticipated by EOG's forward-looking statements may not occur, and, if any of such events do, we may not have anticipated the timing of their occurrence or the duration or extent of their impact on our actual results. Accordingly, you should not place any undue reliance on any of EOG's forward-looking statements. EOG's forward-looking statements speak only as of the date made, and EOG undertakes no obligation, other than as required by applicable law, to update or revise its forward-looking statements, whether as a result of new information, subsequent events, anticipated or unanticipated circumstances or otherwise.\n\nITEM 2. MANAGEMENT'S DISCUSSION AND ANALYSIS OF\nFINANCIAL CONDITION AND RESULTS OF OPERATIONS\nEOG RESOURCES, INC.\nEOG Resources, Inc., together with its subsidiaries (collectively, EOG), is one of the largest independent (non-integrated) crude oil and natural gas companies in the United States of America (United States) with proved reserves in the United States and the Republic of Trinidad and Tobago (Trinidad). EOG is focused on being among the highest return and lowest cost producers, committed to strong environmental performance and playing a significant role in the long-term future of energy. EOG operates under a consistent business and operational strategy that focuses on a comprehensive approach to developing acreage through industry cycles. EOG evaluates rate of return, net present value, margins, payback period and other key metrics. This strategy is intended to enhance the generation of cash flow and earnings from each unit of production on a cost-efficient basis, allowing EOG to maximize long-term growth in shareholder value and maintain a strong balance sheet. EOG implements its strategy primarily by emphasizing the drilling of internally generated prospects in order to find and develop low-cost reserves. Maintaining the lowest possible operating cost structure, coupled with efficient and safe operations and robust environmental stewardship practices and performance, is integral in the implementation of EOG's strategy.\nPrices for crude oil and condensate, natural gas "
}