{
  "source_file": "eog-20241231.htm",
  "form_type": "10-K",
  "item1_clean": "Further, as reflected in its Code of Business Conduct and Ethics for Directors, Officers and Employees, EOG is committed to providing equal opportunity in all aspects of employment and to hiring, evaluating and promoting employees based on skills and performance.\nCompensation, Benefits, Health & Wellness\n. EOG values attracting and retaining talent, and so it provides competitive salaries, bonuses and a subsidized, comprehensive benefits package. EOG also offers a holistic wellness program, a matching gifts program, a flexible work schedule, paid family care leave, paid leave for illness or injury, paid volunteer time and an employee assistance program to support the mental well-being of employees and their dependents. In addition, new-hire stock grants, annual stock grants and an employee stock purchase plan give every employee the opportunity to be a participant in EOG's success.\nTraining and Development\n. EOG supports employees' professional development and provides training in leadership, management skills, communication, team effectiveness, technical skills and use of EOG systems and applications. EOG's leadership training, in particular, is focused on providing continuity of leadership at EOG by further enhancing the skills needed to lead a multi-disciplined, diverse and decentralized workforce. In addition, EOG holds several internal technical conferences each year designed to share best practices and technical advances across the company, including safety and environmental topics. EOG also offers its employees a tuition reimbursement program as well as reimbursement for the costs of professional certifications.\n. EOG's safety management programs and processes provide a framework for assessing safety performance in a systematic way. To foster accountability for conducting operations in a safe manner, EOG's safety performance is also considered in evaluating employee performance and compensation. EOG provides initial, periodic and refresher safety training to employees and contractors. These training programs address various topics, including operating procedures, safe work practices and emergency and incident response procedures. EOG also collects and tracks incident data and metrics to identify trends, implement corrective actions as necessary, and enhance our understanding, identification and implementation of proactive safety management practices.\nEOG competes with major integrated oil and gas companies, government-affiliated oil and gas companies and other independent oil and gas companies for the acquisition of licenses, concessions and leases, properties and reserves and access to the facilities, equipment, materials, services, and employees and other personnel (including geologists, geophysicists, engineers and other specialists) necessary to explore for, develop, produce, market and transport crude oil, NGLs and natural gas. Certain of EOG's competitors have financial and other resources substantially greater than those EOG possesses and have established strategic long-term positions or strong governmental relationships in countries or areas in which EOG may seek new or expanded entry. As a consequence, EOG may be at a competitive disadvantage in certain respects, such as in bidding for drilling rights or in accessing necessary services, facilities, equipment, materials and personnel. In addition, EOG's larger competitors may have a competitive advantage when responding to factors that affect demand for crude oil, NGLs and natural gas, such as changing worldwide prices and levels of production and the cost and availability of alternative fuels. EOG also faces competition from alternative energy sources, such as renewable energy sources. See ITEM 1A, Risk Factors.\nNew or revised rules, regulations and policies may be issued, and new legislation may be proposed, that could impact the oil and gas exploration and production industry. Such rules, regulations, policies and legislation may affect, among other things, (i) permitting for oil and gas drilling on state, tribal and federal lands, (ii) the leasing of state, tribal and federal lands for oil and gas development, (iii) the regulation and disclosure of greenhouse gas (GHG) emissions and/or other climate change-related matters associated with oil and gas operations (e.g., the development, implementation and carrying out of carbon capture and storage activities, including associated financial or tax incentives), (iv) the use of hydraulic fracturing on state, tribal and federal lands, (v) the calculation of royalty payments in respect of oil and gas production from state, tribal and federal lands (including, but not limited to, an increase in applicable royalty percentages), (vi) U.S. federal income tax laws applicable to oil and gas exploration and production companies and (vii) the use of financial derivative instruments to hedge the financial impact of fluctuations in crude oil, NGLs and natural gas prices. For additional discussion regarding the regulatory-related risks to which EOG's operations, financial condition and results of operations are or may be subject, see the below discussion and ITEM 1A, Risk Factors.\nUnited States Regulation of Crude Oil and Natural Gas Production.\nCrude oil and natural gas production operations are subject to various types of regulation, including regulation by federal and state agencies.\nUnited States legislation affecting the oil and gas industry is regularly reviewed, expanded and/or revised by lawmakers. In addition, numerous departments and agencies, both federal and state, are authorized by statute to issue, and have issued, rules and regulations applicable to the oil and gas industry. Such rules and regulations, among other things, require permits for the drilling of wells, regulate the spacing of wells, prevent the waste of natural gas through restrictions on flaring, require surety bonds for various exploration and production operations and regulate the calculation and disbursement of royalty payments (for federal and state leases), production taxes and ad valorem taxes.\nA portion of EOG's oil and gas leases in New Mexico, North Dakota and Wyoming, as well as in other areas, are granted by the federal government and administered by the Bureau of Land Management (BLM) and/or the Bureau of Indian Affairs (BIA), both federal agencies. Operations conducted by EOG on federal oil and gas leases must comply with numerous additional statutory and regulatory restrictions and, in the case of leases relating to tribal lands, certain tribal environmental and permitting requirements and employment rights regulations. In addition, the U.S. Department of the Interior (via various of its agencies, including the BLM, the BIA and the Office of Natural Resources Revenue) has certain authority over our calculation and payment of royalties, bonuses, fines, penalties, assessments and other revenues related to federal and tribal oil and gas leases. In addition, the Inflation Reduction Act of 2022 (IRA) requires that all leases granted and administered by the BLM and entered into on or after August 16, 2022 include a royalty rate of 16.67 percent in respect of the associated oil and gas production. Regulations implementing the new royalty rate were finalized in April 2024.\nBLM and BIA leases contain relatively standardized terms requiring compliance with detailed regulations. Under certain circumstances, the BLM or BIA may require operations on federal leases to be suspended or terminated. Any such suspension or termination could materially and adversely affect EOG's interests on federal lands. From time to time, the U.S. Department of the Interior has also considered limiting or pausing new oil and natural gas leases on federal lands. Any limitation or ban on permitting for oil and gas exploration and production activities on federal lands could have a material and adverse effect on EOG's operations, financial condition and results of operations. EOG's interests in offshore leases are de minimis.\nThe transportation and sale for resale of natural gas in interstate commerce are regulated pursuant to the Natural Gas Act of 1938, as amended (NGA), and the Natural Gas Policy Act of 1978. These statutes are administered by the Federal Energy Regulatory Commission (FERC). Effective January 1993, the Natural Gas Wellhead Decontrol Act of 1989 deregulated natural gas prices for all \"first sales\" of natural gas, which includes all sales by EOG of its own production. All other sales of natural gas by EOG, such as those of natural gas purchased from third parties, remain jurisdictional sales subject to a blanket sales certificate under the NGA, which has flexible terms and conditions. Consequently, all of EOG's sales of natural gas currently may be made at unregulated market prices, subject to applicable contract provisions. EOG's jurisdictional sales, however, may be subject in the future to greater federal oversight, including the possibility that the FERC might prospectively impose more restrictive conditions on such sales. Conversely, sales of crude oil and condensate and NGLs by EOG are made at unregulated market prices.\nEOG owns certain gathering and/or processing facilities and systems in the Permian Basin in West Texas and New Mexico, the Anadarko Basin in Oklahoma, the Powder River Basin in Wyoming, the Utica in Ohio, the Barnett Shale in the Bend Arch-Fort Worth Basin in North Texas, the Bakken and Three Forks plays in the Williston Basin in North Dakota, and the Eagle Ford play and Dorado gas play in South Texas. State regulation of gathering and processing facilities generally includes various safety, environmental and, in some circumstances, nondiscrimination requirements with respect to the provision of gathering and processing services, but does not generally entail rate regulation. EOG's gathering and processing operations could be materially and adversely affected should they be subject in the future to the application of state or federal regulation of rates and services.\nEOG's gathering and processing operations also may be, or become, subject to safety and operational regulations relating to the design, installation, testing, construction, operation, replacement and management of such facilities. Additional rules and legislation pertaining to these matters are considered and/or adopted from time to time. Although EOG cannot predict what effect, if any, such legislation might have on its operations and financial condition, EOG could be required to incur additional capital expenditures and increased compliance and operating costs depending on the nature and extent of such future legislative and regulatory changes.\nEOG also owns crude oil truck unloading facilities in certain of its U.S. plays. Regulation of such facilities is conducted at the state and federal levels and generally includes various safety, environmental and permitting requirements. Additional regulation pertaining to these matters is considered and/or adopted from time to time. Although EOG cannot predict what effect, if any, any such new regulations might have on the transportation of its crude oil production by truck, EOG could be required to incur additional capital expenditures and increased compliance and operating costs depending on the nature and extent of such future regulatory changes. EOG did not transport any crude oil by rail during 2024.\nProposals and proceedings that might affect the oil and gas industry are considered from time to time by Congress, the state legislatures, the FERC and other federal, state and local regulatory commissions, agencies, councils and courts. EOG cannot predict when or whether any such proposals or proceedings may become effective. It should also be noted that the oil and gas industry historically has been very heavily regulated; therefore, there is no assurance that the approach currently being followed by such legislative bodies and regulatory commissions, agencies, counc",
  "item7_clean": "ITEM 7.\nManagement's Discussion and Analysis of Financial Condition and Results of Operations\nEOG Resources, Inc., together with its subsidiaries (collectively, EOG), is one of the largest independent (non-integrated) crude oil and natural gas companies in the United States of America (United States) with proved reserves in the United States and the Republic of Trinidad and Tobago (Trinidad). EOG is focused on being among the highest return and lowest cost producers, committed to strong environmental performance and playing a significant role in the long-term future of energy. EOG operates under a consistent business and operational strategy that focuses on a comprehensive approach to developing acreage through industry cycles. EOG evaluates rate of return, net present value, margins, payback period and other key metrics. This strategy is intended to enhance the generation of cash flow and earnings from each unit of production on a cost-efficient basis, allowing EOG to maximize long-term growth in shareholder value and maintain a strong balance sheet. EOG implements its strategy primarily by emphasizing the drilling of internally generated prospects in order to find and develop low-cost reserves. Maintaining the lowest possible operating cost structure, coupled with efficient and safe operations and robust environmental stewardship practices and performance, is integral in the implementation of EOG's strategy.\nEOG realized net income of $6,403 million during 2024 as compared to net income of $7,594 million for 2023. At December 31, 2024, EOG's total estimated net proved reserves were 4,748 million barrels of oil equivalent (MMBoe), an increase of 250 MMBoe from December 31, 2023. During 2024, net proved crude oil and condensate and natural gas liquids (NGLs) reserves increased by 218 million barrels (MMBbl), and net proved natural gas reserves increased by 192 billion cubic feet, or 32 MMBoe, in each case from December 31, 2023.\nPrices for crude oil and condensate, NGLs and natural gas have historically been volatile. This volatility is expected to continue due to the many uncertainties associated with the world political and economic environment and the global supply of, and demand for, crude oil, NGLs and natural gas and the availability of other energy supplies, the relative competitive relationships of the various energy sources in the view of consumers and other factors.\nThe market prices of crude oil and condensate, NGLs and natural gas impact the amount of cash generated from EOG's operating activities, which, in turn, impact EOG's financial position and results of operations.\nFor the year ended December 31, 2024, the average U.S. New York Mercantile Exchange (NYMEX) crude oil and natural gas prices were $75.72 per barrel and $2.27 per million British thermal units (MMBtu), respectively, representing decreases of 2% and 17%, respectively, from the average NYMEX prices for the year ended December 31, 2023. Market prices for NGLs are influenced by the components extracted, including ethane, propane and butane and natural gasoline, among others, and the respective market pricing for each component.\nInflationary Pressures, Operational Efficiencies & Related Initiatives/Actions.\nDuring 2024, EOG continued to see diminished inflationary pressures on its operating costs and capital expenditures (e.g., for fuel, wellbore tubulars, facilities manufactured using steel, labor and drilling and completion services) and, in certain circumstances, has seen declines in prices. However, because the market for such materials, services and labor continues to fluctuate, there can be no assurance that the inflationary pressures experienced by EOG in prior periods will not resume. Further, the timing and impact of any future price changes on EOG's operating costs and capital expenditures is uncertain.\nEOG has undertaken (and continues to undertake) initiatives to increase its drilling, completion and operating efficiencies and improve the performance of its wells and, in turn, mitigate the inflationary pressures experienced in prior periods. Such initiatives include (among others): (i) EOG's downhole drilling motor program, which has resulted in increased footage drilled per day and, in turn, reduced drilling times; (ii) enhanced techniques for completing its wells, which has resulted in increased footage completed per day and pumping hours per day; (iii) drilling extended laterals, which has resulted in a decrease in cost per foot drilled; and (iv) EOG's self-sourced sand program, which has resulted in cost savings for the sand utilized in its well completion operations. In addition, EOG has entered into agreements with its service providers from time to time, when available and advantageous, to secure the costs and availability of certain drilling and completion services it utilizes as part of its operations.\nEOG plans to continue with these initiatives and actions, though there can be no assurance that such efforts will offset, largely or at all, the impacts of any future inflationary pressures (such as from tariffs) on EOG's operating costs and capital expenditures, cash flows and results of operations. Further, there can be no assurance that the factors contributing to any such future inflationary pressures will not impact EOG's ability to conduct its future day-to-day drilling, completion and production operations. See ITEM 1A. Risk Factors, for related discussion.\n. For a discussion of climate change matters and related regulatory matters, including potential developments related to climate change and the potential impacts and risks of such developments on EOG, see ITEM 1A, Risk Factors, and the related discussion in ITEM 1, Business – Regulation. EOG will continue to monitor and assess any climate change-related developments that could impact EOG and the oil and gas industry, to determine the impact on its business and operations, and take appropriate actions where necessary.\nSeveral important developments have occurred since January 1, 2024.\nEOG's efforts to identify plays with large reserve potential have proven to be successful. EOG continues to drill numerous wells in large acreage plays, which in the aggregate have contributed substantially to, and are expected to continue to contribute substantially to, EOG's crude oil and condensate, NGLs and natural gas production. EOG has placed an emphasis on applying its horizontal drilling and completion expertise to unconventional crude oil and natural gas plays.\nIn 2024, EOG continued to focus on initiatives to increase its drilling, completion and operating efficiencies and improve well performance and, in turn, mitigate the inflationary pressures on its operating costs and capital expenditures experienced in prior periods. In addition, EOG continued to evaluate certain potential crude oil and condensate, NGLs and natural gas exploration and development prospects and to look for opportunities to add drilling inventory through leasehold acquisitions, farm-ins, exchanges or tactical or bolt-on acquisitions. On a volumetric basis, as calculated using a ratio of 1.0 barrel of crude oil and condensate or NGLs to 6.0 thousand cubic feet of natural gas, crude oil and condensate and NGLs production accounted for approximately 72% and 73% of EOG's United States production during 2024 and 2023, respectively. During 2024, EOG's drilling and completion activities occurred primarily in the Delaware Basin play, Eagle Ford play and Rocky Mountain area. EOG's major producing areas in the United States are in New Mexico and Texas. See ITEM 1, Business - Exploration and Production for further discussion regarding EOG's 2024 United States operations.\nIn Trinidad, EOG continues to deliver natural gas under existing supply contracts. Several fields in the South East Coast Consortium (SECC) Block, Modified U(a) Block, Block 4(a) and Banyan and Sercan Areas have been developed and are producing natural gas which is sold to the National Gas Company of Trinidad and Tobago Limited and its subsidiary, and crude oil and condensate which is sold to Heritage Petroleum Company Limited.\nDuring 2024, EOG completed one net developmental well and one net exploratory well from the Osprey B platform in the Modified U(a) Block. EOG also completed two net exploratory wells from the Oilbird platform in the SECC Block, drilled a deep Teak, Saaman and Poui (TSP Deep) exploratory well which allowed EOG to retain a 50% working interest in the TSP Deep Area and recompleted one net well in the Sercan Area. EOG also completed construction and installation of the Mento platform in the Ska, Mento and Reggae Area and commenced pipeline and associated tie-in installations that will connect the Mento platform to the Pelican platform. In 2024, EOG relinquished its rights to a portion of the contract area governed by the Trinidad Northern Area License located offshore the southwest coast of Trinidad and signed a farmout agreement with BP Trinidad and Tobago LLC, which allows EOG to earn a 50% working interest to develop the Coconut field in the Coconut Area located within the East Mayaro and South East Galeota exploration and production licenses. Additionally, EOG was selected as the preferred bidder in the Lower Reverse L and North Coast Marine Area 4(a) Blocks in respect of the 2023 shallow water offshore bid round.\nOther International.\nIn February 2025, a subsidiary of EOG signed an exploration participation agreement with Bapco Energies B.S.C. (Closed) to evaluate a gas exploration project in the Kingdom of Bahrain, with drilling anticipated to commence in the second half of 2025. The transaction, which includes a concession agreement with the Kingdom of Bahrain, is subject to further government approvals, which the parties anticipate receiving in the second half of 2025.\nIn November 2021, a subsidiary of EOG was granted an exploration permit for the WA-488-P Block, located offshore Western Australia. The company has deferred drilling plans to further evaluate the prospect.\nEOG continues to evaluate other select exploration, development and exploitation opportunities outside the United States, primarily by pursuing opportunities in countries where crude oil and natural gas reserves have been identified.\nOne of management's key strategies is to maintain a strong balance sheet with a consistently below average debt-to-total capitalization ratio as compared to those in EOG's peer group. EOG's debt-to-total capitalization ratio was 14% at December 31, 2024 and 12% at December 31, 2023. As used in this calculation, total capitalization represents the sum of total current and long-term debt and total stockholders' equity.\nAt December 31, 2024, EOG maintained a strong financial and liquidity position, including $7.1 billion of cash and cash equivalents on hand and $1.9 billion of availability under its senior unsecured revolving credit facility (discussed below).\nOn November 21, 2024, EOG closed on its offering of $1.0 billion aggregate principal amount of its 5.650% Senior Notes due 2054 (the Notes). EOG received net proceeds of $985 million from the issuance of the Notes, which will be used for general corporate purposes, including (i) the repayment of the $500 million aggregate principal amount of 3.15% Senior Notes due 2025 and (ii) the funding of future capital expenditures.\nThe Internal Revenue Service previously announced tax relief related to 2024 severe weather events occurring in various Texas counties, including Harris County, where EOG's corporate offices are located. The tax relief permitted eligible taxpayers to postpone certain tax filings and payments. In February 2025, EOG paid approximately $700 million of such federal tax payments related to the 2024 tax year.\nDuring 2024, EOG funded $6.7 billion ($109 million of which was non-cash) in exploration and development and other property, plant and equipment expenditures (excluding asset retirement obligations), paid $2.1 billion in dividends to common stockholders and paid $3.2 billion to repurchase shares of common stock, primarily by utilizing net cash provided by its operating activities and cash on hand.\nTotal anticipated 2025 capital expenditures are estimated to range from approximately $6.0 billion to $6.4 billion, including exploration and development drilling, facilities, leasehold acquisitions, capitalized interest, dry hole costs and other property, plant and equipment and excluding property acquisitions, asset retirement costs, non-cash exchanges and transactions and exploration costs incurred as operating expenses. The majority of 2025 expenditures will be focused on United States crude oil drilling activities. EOG has significant flexibility with respect to financing alternatives, including borrowings under its commercial paper program, bank borrowings, borrowings under its senior unsecured revolving credit facility, joint development agreements and similar agreements and equity and debt offerings.\nManagement continues to believe EOG has one of the strongest prospect inventories in EOG's history. When it fits EOG's strategy, EOG will make acquisitions that bolster existing drilling programs or offer incremental exploration and/or production opportunities.\nCash Return Framework.\nIn November 2023, EOG announced an increase in its cash return commitment - specifically, a commitment, effective beginning with fiscal year 2024, to return a minimum of 70% of annual net cash provided by operating activities before certain balance sheet-related changes, less total capital expenditures, to stockholders through a combination of quarterly dividends, special dividends and share repurchases. For discussion regarding EOG's payment of dividends and share repurchases, see ITEM 1A, Risk Factors, and ITEM 5, Market for Registrant's Common Equity, Related Stockholder Matters and Issuer Purchases of Equity Securities.\nDividend Declarations.\nOn February 22, 2024, the Board of Directors (Board) declared a quarterly cash dividend on the common stock of $0.91 per share paid on April 30, 2024, to stockholders of record as of April 16, 2024.\nOn May 2, 2024, the Board declared a quarterly cash dividend on the common stock of $0.91 per share paid on July 31, 2024, to stockholders of record as of July 17, 2024.\nOn August 1, 2024, the Board declared a quarterly cash dividend on the common stock of $0.91 per share paid on October 31, 2024, to stockholders of record as of October 17, 2024.\nOn November 7, 2024, the Board increased the quarterly cash dividend on the common stock from the previous $0.91 per share to $0.975 per share, effective beginning with the dividend paid on January 31, 2025, to stockholders of record as of January 17, 2025.\nOn February 27, 2025, the Board declared a quarterly cash dividend on the common stock of $0.975 per share to be paid on April 30, 2025, to stockholders of record as of April 16, 2025.\nResults of Operations\nOperating Revenues and Other\nDuring 2024, operating revenues decreased $488 million, or 2%, to $23,698 million from $24,186 million in 2023. Total revenues from sales of EOG's production of crude oil and condensate, NGLs and natural gas, increased $202 million, or 1%, to $17,578 million in 2024 from $17,376 million in 2023. Revenues from the sales of crude oil and condensate and NGLs in 2024 were 91% of total revenues from sales of crude oil and condensate, NGLs and natural gas compared to 90% in 2023. During 2024, EOG recognized net gains on the mark-to-market of financial commodity and other derivative contracts of $204 million compared to net gains of $818 million in 2023. Gathering, processing and marketing revenues decreased $6 million during 2024, to $5,800 million from $5,806 million in 2023. EOG recognized net gains on asset dispositions of $16 million in 2024 compared to net gains on asset dispositions of $95 million in 2023.\nVolume and price statistics for the years ended December 31, 2024, 2023 and 2022 were ",
  "item2_clean": null
}