{
  "source_file": "epam-20241231.htm",
  "form_type": "10-K",
  "item1_clean": "utilize our delivery professionals and specialists to balance the needs of our clients with the availability, location, and skill sets of our employees and their need for diverse and challenging work. We manage utilization through strategic hiring and efficient staffing of projects for our clients. For the years ended December 31, 2024, 2023 and 2022, the utilization rates of our delivery professionals were approximately 76.7%, 74.3%, and 75.8%, respectively.\nEPAM invests significant resources in training and developing our employees through our learning and development programs. Our largest learning and development investment has been directed towards developing our engineering talent, including targeted training programs, innovation labs, and significant internal production projects. Our employees consumed 2.4 million learning hours in 2024. We deliver training and development opportunities and content through our unique learning ecosystem that promotes learning in the daily workflow to improve retention and productivity, and through dedicated learning events.\nWe deliver learning and development content through proprietary platforms that are available to all of our employees. Our digital learning platform provides our employees with a recommendation engine that suggests courses and materials based on employee role, level, location and skills. Our electronic library platform makes books and publications available to all of our employees and we celebrate learning achievements through our recognition portal, where we promote our employees’ learning accomplishments and employees can recognize each other for their teamwork, initiative, and unique, valuable skills.\nEPAM provides our clients with the skills of our talented personnel, which includes people with varied backgrounds and characteristics, to drive innovation and varied approaches to delivering our services. We believe that innovation comes from the unique perspectives, knowledge, and experiences of our global employees, so we strive to create a culture to support that uniqueness by creating employee groups that recognize and share the varied perspectives of our personnel so employees of all backgrounds, interests, and identities can grow and thrive professionally.\nIncreasing the breadth of viewpoints and experiences in executive and key operational leadership roles is an organizational priority that starts at the top of our organization. Women currently represent approximately 44% of the independent directors on our Board and we have developed programs to identify, retain, mentor, and supply a pipeline of qualified candidates from all backgrounds at every level of our Company. Our programs include dedicating resources and personnel in our talent acquisition team to identify, recognize, and hire from underrepresented groups in engineering, IT, and business.\nRecognizing that giving all people access to jobs in the software and technology industries starts with access to science, technology, engineering, and mathematics (“STEM”) education, EPAM created the EPAM E-Kids program where our employees volunteer their time to teach elementary school age children STEM concepts and introductory software coding skills. As of the end of 2024, we offered the EPAM E-Kids program in 25 countries.\nEmployee Engagement and Retention:\nAs a participant in the United Nations Global Compact, we are committed to respecting our employees' fundamental human rights at work. We believe that retaining skilled talent requires substantially more than meeting basic employment and labor rights, and that employees who are fairly compensated, feel supported in their career development, and are engaged with their employer are more likely to remain with that employer. That is why we strive to provide pay and benefits that demonstrate the value of our employees to us, including a competitive salary, flexible work-life balance, paid time off, health coverage, ongoing training programs, relocation options, and recognition opportunities for open-source software contributions.\nOur career development programs create detailed and progressive training plans for our employees and help them choose from internal and external training options, mentoring programs, and hands-on opportunities to experience emerging technology areas. We designed our career development programs to enable our employees to develop their engineering skills, influence our culture, develop thought leadership, and introduce them to leaders in our industry. Our career development programs also give our employees opportunities to earn accreditation and relevant expertise in various technology fields, including software and project management certifications and recognition and credentialing from the industry’s primary software and cloud services providers.\nWe focus on retaining and engaging top talent by hiring people with the skill sets our clients need and who also share our values so we can build long-term employee satisfaction, which is supported by our voluntary attrition rate of 8.9%, 8.6%, and 13.8% in 2024, 2023 and 2022, respectively. We endeavor to recruit for careers, not for short-term projects, and actively foster feedback from our employees so we can improve the EPAM employee experience. Receiving and learning from employee feedback plays a critical role in engaging and retaining our employees because it offers us insights on how we can improve our operations and enhance the skills of our employees. Our employees have demonstrated their satisfaction with our approach by giving their highest percentage of positive responses in our 2024 employee survey when asked if they can easily get support from their colleagues (93%), if they get management support (92%), if they feel that EPAM provides a supportive environment for all employees, regardless of gender, race, background, religion, or other personal traits (89%), and if they feel comfortable being themselves while working for EPAM (89%). Our focus on our employees’ experience is recognized inside and outside of EPAM. In 2023, the employee experience we create was recognized with awards from a number of different organizations in North America, Europe, and Asia, and we were also named on Newsweek’s list of Top 100 Most Loved Workplaces for the fourth consecutive year and recognized by Glassdoor as a Best Workplace for three consecutive years.\nWe market and sell our services through our senior management, sales and business development teams, account managers, and professional staff. Our client service professionals and account managers, who maintain direct client relationships, play an integral role in engaging with current clients to identify and pursue potential business opportunities. This strategy has been effective in promoting repeat business and growth from within our existing client base and we believe that our reputation as a reliable provider of software engineering solutions drives additional business from inbound requests and referrals. In addition to effective client management, our sales model also utilizes an integrated sales and marketing approach that leverages a dedicated sales team to identify and acquire new accounts.\nWe maintain a marketing team, which coordinates corporate-level branding efforts such as participation in and the hosting of industry conferences and events as well as sponsorship of programming competitions. We have been recognized by many top global independent research agencies, such as Forrester, Gartner, IDC and Everest and by publications such as Newsweek, Forbes and Fortune. We are proud to be among the top 15 companies in Information Technology Services in the Fortune 1000 and to be recognized as a leader in the IDC MarketScapes for Worldwide Experience Build Services, Worldwide Experience Design Services and Worldwide Software Engineering Services.\nThe markets in which we compete are changing rapidly and we face competition from multiple market participants such as other global technology solutions providers, specialized consulting firms, boutique digital companies and outsourcing companies based primarily in specific geographies with lower cost labor such as Eastern Europe, India, Latin America and China. We believe that the principal competitive factors in our business include technical expertise and industry knowledge, end-to-end solution offerings, a reputation for and a track record of high-quality and on-time delivery of work, effective employee recruiting, training and retention, responsiveness to clients’ business needs, ability to scale, financial stability and price.\nWe face competition from various technology services providers such as Accenture, Atos, Capgemini, Cognizant Technology Solutions, Deloitte Digital, DXC Technology, Endava, Genpact, GlobalLogic, Globant, Grid Dynamics, HCL Technologies, Infosys, Tata Consultancy Services, and Wipro, among others. Additionally, we compete with numerous smaller local companies in the various geographic markets in which we operate.\nWe believe that our focus on complex and innovative software product development solutions, our technical employee base, and our development and continuous improvement in process methodologies, applications and tools position us well to compete effectively in the future.\nQuality Management and Information Security\nWe are continuously investing in systems, applications, tools and infrastructure to manage all aspects of our global delivery process in order to manage quality and information security risks, while providing control and visibility across all project lifecycle stages both internally and to our clients. We have developed sophisticated project management techniques and procedures facilitated through our proprietary project management tools, a web-based collaborative environment for software development, which we consider critical for visibility into project deliverables, resource management, team messaging and project-related documents. These tools promote collaboration and effective oversight, reduce work time and costs, and increase quality for our IT management and our clients.\nWe maintain, monitor, and improve processes and infrastructure to protect our, our clients’ and their customers’ confidential and sensitive information and allocate internal and external resources to assess and ensure information security, cybersecurity and data privacy. We have made significant investments in the appropriate people, processes and technology to establish and manage information security, confidentiality requirements, and laws and regulations governing our activities, such as the European Union data protection legal framework referred to as the General Data Protection Regulation (“GDPR”), the California Consumer Privacy Act and California Privacy Rights Act, and others.\nWe maintain a focus on adhering to stringent security, privacy and quality standards as well as internal controls which are compliant with ISO 27001, ISO 27701 and ISO 9001 standards. For certain services, EPAM obtains SOC1, SOC2, and/or SOC3 reports and shares them with our clients. These audits are performed by an independent auditor utilizing globally recognized attestation standards (ISAE 3402 and ISAE 3000). Our SOC reports, along with other certifications we hold, provide our clients with independent third-party assurance and validation of our information security, privacy management, quality management and general controls practices.\nCorporate and Social Responsibility and Environmental, Social, and Governance Initiatives\nWe are committed to integrating positive social, environmental and ethical practices into our business operations, corporate governance, and strategy. This commitment is key to our continual development as a business and drives value for our employees, clients, business partners, the community and other stakeholders. We practice the principles established in our Code of Ethical Conduct by making positive contributions t",
  "item7_clean": "Item 7. Management’s Discussion and Analysis of Financial Condition and Results of Operations\nYou should read the following discussion and analysis of our financial condition and results of operations together with our audited consolidated financial statements and the related notes included elsewhere in this annual report. In addition to historical information, this discussion contains forward-looking statements that involve risks, uncertainties and assumptions that could cause actual results to differ materially from management’s expectations. Factors that could cause such differences are discussed in the sections entitled “Forward-Looking Statements” and “Part I. Item 1A. Risk Factors.” We assume no obligation to update any of these forward-looking statements.\nWe have used our software engineering expertise to become a leading global provider of digital engineering, cloud and AI-enabled transformation services, as well as a leading business and experience consulting partner for global enterprises and ambitious startups. We address our clients’ transformation challenges by fusing EPAM Continuum’s integrated strategy, experience and technology consulting with our 30+ years of engineering execution to speed our clients’ time to market and drive greater value from their digital investments.\nThrough increased specialization in focused verticals and a continued emphasis on strategic partnerships, we are able to deliver technology transformation from start to finish, leveraging agile methodologies, proven client collaboration frameworks, engineering excellence tools, hybrid teams and our award-winning proprietary global delivery platform.\nOur clients depend on us to solve their complex technical challenges and rely on our expertise in core engineering, advanced technologies, digital design and intelligent enterprise development. We combine our software engineering heritage with strategic business and innovation consulting, design thinking, and physical-digital capabilities to deliver end-to-end digital transformation services for our clients. We focus on building long-term partnerships with our clients in a market that is constantly challenged by the pressures of digitization through our innovative strategy and scalable software solutions, integrated advisory, business consulting and experience design, and a continually evolving mix of advanced capabilities.\nOur global delivery model and centralized support functions, combined with the benefits of scale from the shared use of fixed-cost resources, enhance our productivity levels and enable us to better manage the efficiency of our global operations. As a result, we have created a delivery base whereby our applications, tools, methodologies and infrastructure allow us to seamlessly deliver services and solutions from our global delivery centers to our clients across the world. Our teams of consultants, designers, architects, engineers and trainers have the capabilities and skill sets to deliver business results.\nDuring the year ended December 31, 2024, we have completed several acquisitions of businesses, including NEORIS and First Derivative. We believe these acquisitions will enhance our client portfolio and service offerings as well as expand our presence in Latin America and Europe.\nBusiness Update Regarding the War in Ukraine\nOn February 24, 2022, Russian forces attacked Ukraine and its people and EPAM has repeatedly called for an immediate end to this unlawful and unconscionable attack. EPAM’s highest priority is the safety and security of its employees and their families in Ukraine as well as in the broader region, and we have continued to support relocating our employees to lower risk locations, both within Ukraine and to other countries where we operate. The vast majority of our Ukraine employees are in safe locations and operating at levels of productivity consistent with those achieved prior to the attack. As of December 31, 2024, Ukraine continues to be a significant delivery location with a large number of delivery professionals. Furthermore, we have maintained our $100 million humanitarian aid commitment to our people in Ukraine in addition to our other donations and volunteer efforts.\nThe impact of Russia’s invasion of Ukraine on our operations, personnel, and physical assets in Ukraine has had, and, along with any escalation of the war that includes Belarus’ territory or military, could continue to have a material adverse effect on our operations. Actions taken by other countries, including new and stricter sanctions by Canada, the United Kingdom, the European Union, the U.S. and other companies and organizations against officials, individuals, regions, and industries in Belarus, and Belarus’ responses to those sanctions, including counter-sanctions and other actions, have had and could continue to have a material adverse effect on our operations. Clients have and may continue to seek altered terms, conditions, and delivery locations for the performance of services, delay planned work or seek services from alternate providers, or suspend, terminate, fail to renew, or reduce existing contracts or services, which could have a material adverse effect on our financial condition. Some of our clients have implemented steps to block internet communications with Ukraine and Belarus to protect against potential cyberattacks or other information security threats, which has caused a material adverse effect on our ability to deliver our services to these clients from those locations. Such material adverse effects disrupt our delivery of services, cause us to shift all or portions of our work occurring in the region to other countries, restrict our ability to engage in certain projects in the region and serve certain clients in or from the region, and could negatively impact our personnel, operations, financial results and business outlook. Our Board of Directors continues its oversight of our strategic, geopolitical, and cybersecurity risks and the risks related to our geographic expansion. Our Board has received updates from management during both regular and special meetings, while also providing oversight of the risks associated with Russia’s invasion of Ukraine and other strategic areas of importance related to the war.\nWe continue to monitor and respond to the difficult conditions in Ukraine while maintaining a focus on our clients and long-term growth. We execute on our business continuity plans and adapt to developments as they occur to protect the safety of our people and address impacts on our delivery infrastructure, including reallocating work to other geographies within our global footprint. We engage with both our personnel and our clients when navigating delivery challenges and we continue to operate productively in a multitude of locations and provide consistent high-quality delivery to our clients. Our global delivery centers have sufficient resources, including infrastructure and capital, to support ongoing operations while maintaining the safety and security of our employees and their families in Ukraine as well as in the broader region.\nThe implementation and execution of our business continuity plans, relocation costs, our humanitarian commitment to our people in Ukraine, and the cost of our phased exit from Russia resulted in materially increased expenses. Some of these expenses continued during this year and we expect some of these expenses will continue to occur in subsequent quarters for some time in the future.\nWe have no way to predict the progress or outcome of the war in Ukraine because the conflict and government reactions change quickly and are beyond our control. Prolonged military activities, broad-based sanctions and counter-sanctions, or escalation of the war that includes Belarus’ territory or military could have a material adverse effect on our operations and financial condition. The information contained in this section is accurate as of the date hereof but may become outdated due to changing circumstances beyond our control or present awareness.\n\nCost of Revenues (Exclusive of Depreciation and Amortization)\nThe principal components of our cost of revenues (exclusive of depreciation and amortization) are salaries, bonuses, fringe benefits, stock-based compensation, project-related travel costs and fees for subcontractors who are assigned to client projects. Salaries and other compensation expenses of our delivery professionals are reported as cost of revenues regardless of whether the employees are actually performing services for clients during a given period. Our employees are a critical asset, necessary for our continued success and therefore we expect to continue hiring talented employees and providing them with competitive compensation programs. Additionally, government incentives and assistance related to services performed by delivery professionals and contractors assigned to client projects are reported in cost of revenues.\nWe manage the utilization levels of our delivery professionals through strategic hiring practices, dynamic management of staff, and efficient staffing of projects. Our staff utilization also depends on the general economy and its effect on our clients and their business decisions regarding the use of our services.\nDuring the year ended December 31, 2024, cost of revenues (exclusive of depreciation and amortization) was $3.277 billion, representing an increase of 0.6% from $3.257 billion reported last year. The increase during the year ended December 31, 2024 compared to 2023, was primarily due to an increase in compensation costs, including a $12.1 million increase in stock-based compensation expense, as well as $19.4 million in reduced benefits from our hedging program and a 0.2% unfavorable impact from changes in foreign currency exchange rates. Compensation costs also increased due to impacts from salary increases and promotions for existing professionals, an increase in variable compensation expense, the relocation of employees to higher cost geographies as well as a 2.2% growth in the average number of production professionals contributed in part by our acquisition of businesses during 2024. The increases were significantly offset by benefits totaling $68.8 million recognized in the second half of 2024 for government incentives related to conducting R&D activities in Poland and a decline in costs associated with our humanitarian efforts for Ukraine of $8.9 million and our unbilled business continuity resources of $9.4 million year-over-year.\nExpressed as a percentage of revenues, cost of revenues (exclusive of depreciation and amortization) was 69.3% and 69.4% during the years ended December 31, 2024 and 2023, respectively. The year-over-year decrease is primarily due to benefits totaling $68.8 million recognized in the second half of 2024 for government incentives related to conducting R&D activities in Poland and improved utilization, largely offset by a $12.1 million increase in stock-based compensation expense, increases in compensation costs including variable compensation, reduced benefits from our hedging program and the negative impact from the appreciation of foreign currencies in certain of our delivery locations.\nSelling, General and Administrative Expenses\nSelling, general and administrative expenses represent expenditures associated with promoting and selling our services and general and administrative functions of our business. These expenses include the costs of salaries, bonuses, fringe benefits, stock-based compensation, severance, bad debt, travel, legal and accounting services, insurance, facilities including operating leases, advertising, and other promotional activities. Additionally, selling, general and administrative expenses contain costs of relocating our employees and various one-time and unusual expenses such as impairment charges.\nDuring the year ended December 31, 2024, selling, general and administrative expenses were $816.3 million, representing an increase of 0.2% as compared to $815.1 million reported last year. The increase in selling, general and administrative expenses during 2024 compared to 2023 was primarily driven by a $14.1 million increase in personnel-related costs, including a $7.4 million increase in stock-based compensation expense, a $10.3 million increase in professional fee expenses related to our business acquisition efforts and a $4.7 million increase in expenses associated with our humanitarian efforts for Ukraine. Personnel-related costs increased due to impacts from salary increases and promotions for existing professionals, increases in variable compensation expense and severance, which reflects the impact from the Cost Optimization Programs initiated in the second quarter of 2024 and the third quarter of 2023. See Note 12 “Cost Optimization Programs” for more information regarding the Company’s restructuring programs. These year-over-year increases were partially offset by an $8.4 million decrease in bad debt expense, a $5.6 million reduction in facility exit costs and a $3.9 million reduction in facilities and infrastructure expenses as compared to the prior year.\nExpressed as a percentage of revenues, selling, general and administrative expenses decreased 0.1% to 17.3% for the year ended December 31, 2024, as compared to the prior year primarily driven by reductions in facility exit costs, bad debt expense and facilities and infrastructure expenses as a percentage of revenues.\nDepreciation and Amortization Expense\nDepreciation and amortization expense includes depreciation of physical assets used in the operation of our business such as computer equipment, software, buildings we purchased, leasehold improvements as well as various office furniture and equipment. Depreciation and amortization expense also includes amortization of acquired finite-lived intangible assets.\nDuring the year ended December 31, 2024, depreciation and amortization expense was $89.6 million, representing a decrease of $2.2 million from $91.8 million reported in the prior year. The decrease in depreciation and amortization expense was primarily the result of lower depreciation on furniture, fixtures, other equipment and computer hardware, partially offset by increased amortization of software licenses and acquired finite-lived intangible assets. Expressed as a percentage of revenues, depreciation and amortization expense remained the same at 1.9% during the year ended December 31, 2024, as compared to 2023.\nLoss on Sale of Business\nOn July 26, 2023, the Company completed the sale of its remaining holdings in Russia to a third-party. The Company recorded a loss on sale of $25.9 million during the year ended December 31, 2023, including the recognition of the accumulated currency translation loss related to this foreign entity that was previously included in Accumulated other comprehensive loss.\nInterest and Other Income, Net\nInterest and other income, net includes interest earned on cash, cash equivalents and short-term investments, gains and losses from certain financial instruments, interest expense related to our borrowings, certain government grant income, and changes in the fair value of contingent consideration. Interest and other income, net decreased from $51.1 million during the year ended December 31, 2023 to $46.9 million during the year ended December 31, 2024. This decrease was largely driven by a $4.2 million decrease in government grant income and a $2.9 million increase in loss due to the change in fair value of contingent consideration, partially offset by a $1.1 million increase in other income.\nProvision for Income Taxes\nDetermining the consolidated provision for income tax expense, deferred income tax assets and liabilities and any potential related valuation allowances involves judgment. We consider factors that may contribute, favorably or unfavorably, to the overall annual effective tax rate in the current year as well as ",
  "item2_clean": null
}