{
  "source_file": "eqr-20241231.htm",
  "form_type": "10-K",
  "item1_clean": "We have entered into, and may continue in the future to enter into, real estate technology and other real estate fund investments. Noncontrolling interests and passive investments are inherently risky because we have limited ability to influence business decisions. The managers of such investments have autonomy over the day-to-day operations of the business and may make business, financial or management decisions with which we do not agree or take risks or otherwise act in a manner that does not serve our interests. In addition, the market for the technologies or products these companies are developing are typically in the early stages and may not materialize to the expected scale, causing these companies to abandon, modify or alter their product, service or overall strategy. Further, there is no assurance that these companies can obtain additional capital or resources, generate sufficient cash flow to sustain operations and successfully execute their strategy or that their equity will become sufficiently liquid for us to effectively monetize our investment. The performance of these investments may also rely on the services of a limited number of key individuals, the loss of whom could significantly adversely affect such investments’ performance. As a result, we may recognize an impairment of our investment or be unable to sell or otherwise monetize any of the investments we have acquired or may acquire in the future.\n\nCorporate responsibility evaluations remain highly important to some investors and other stakeholders. Certain organizations that provide corporate governance and other corporate risk advisory services to investors have developed scores and ratings to evaluate companies and investment funds based upon corporate responsibility metrics. Many investors focus on corporate responsibility-related business practices and scores when choosing to allocate their capital and may consider a company's score as a reputational or other factor in making an investment decision. Government regulators' and investors' increased focus and activism related to corporate responsibility and similar matters may constrain our business operations or increase expenses or capital expenditures. In addition, investors may decide to refrain from investing in us as a result of their assessment of our approach to and consideration of corporate responsibility factors. We may face reputational damage in the event our corporate responsibility procedures or standards do not meet the standards set by various constituencies. In addition, the criteria by which companies are rated for their efforts may change, which could cause us to receive different scores than in previous years. Our rating could result in a negative perception of the Company, exclusion of our securities from consideration by certain investors who may elect to invest with our competition instead and/or cause investors to reallocate their capital away from the Company, all of which could have an adverse impact on the price of our securities.\n\nWe deliver this performance through rapidly evolving technology and innovation that is increasingly prevalent in our industry. We have been and continue to be a leader in deploying and investing in property technology to serve our customers better and operate more efficiently. Having a history as a first mover in such important areas as online leasing, we are focused on technology that drives superior margins and improves customer experience. We use a standardized purchasing system to control our operating expenses and a business intelligence platform and other data analytics that allow our team members to quickly identify and address issues and opportunities. Many of these initiatives allow us to interact with our customers in a safe, responsible and convenient manner, including self-guided tours, automated responses to customer inquiries and enhanced service and maintenance management. While we believe areas such as “smart home” technology and others will provide the foundation for current and future improvements to how we do business, we will continue to consider the cost and longevity of technology capital investments and their benefits.\n\nWe have developed and may continue to develop initiatives that are intended to serve our customers better and operate more efficiently, including “smart home” technology and self-service options that are accessible to residents through smart devices or otherwise. Such initiatives have involved and may involve our employees having new or different responsibilities and processes with which they may be unfamiliar. We may incur significant costs and divert resources in connection with such initiatives, and these initiatives may not perform as expected, which could adversely affect our business, results of operations, cash flows and financial condition.​\n\nWe intend to continue to develop multifamily properties through both wholly owned and joint venture arrangements as part of our business strategy. Development often includes long planning and entitlement timelines, subjecting the projects to changes in market conditions. It can involve complex and costly activities, including significant environmental remediation or construction work in our markets. We have experienced and may continue to experience an increase in costs due to general disruptions that affect the cost of labor and/or materials, such as supply chain disruptions, trade disputes, tariffs, immigration issues, labor unrest, geopolitical conflicts or other factors that create inflationary pressures. We may abandon opportunities that we have already begun to explore for a number of reasons, and as a result, we may fail to recover costs already incurred in exploring those opportunities, potentially causing an impairment charge. We may also be unable to obtain, or experience delays in obtaining, necessary zoning, occupancy, or other required governmental or third-party permits and authorizations. These and other risks inherent in development projects, including the joint venture risks noted below, could result in increased costs or the delay or abandonment of opportunities.\n\nThe Non-Residential space (includes retail and public parking garage operations) at our properties primarily serves as an additional amenity for our residents and neighbors. The longer-term nature of our Non-Residential leases (generally five to ten years with market based renewal options) and the characteristics of many of our Non-Residential tenants (generally small, local businesses) may subject us to certain risks. We may not be able to lease new space for rents that are consistent with our projections or for market rates. Also, when leases for our existing Non-Residential space expire or are otherwise terminated, the space may not be relet or the terms of reletting, including the cost of allowances and concessions to tenants, may be less favorable than the current lease terms. The presence of competitive alternatives and other market conditions (including online shopping) may affect our ability to lease our Non-Residential space and impact the level of rents we can obtain. If our Non-Residential tenants experience financial distress or bankruptcy, they may fail to comply with their contractual obligations, seek concessions, such as rent abatements and deferrals, in order to continue operations or cease their operations, any or all of which could lead us to record a non-cash write-off of a tenant's straight-line rent receivable (like we did in 2023 due to the Rite Aid bankruptcy) and could adversely impact our results of operations and financial condition.\n\nCertain provisions of our Declaration of Trust and Bylaws may delay or prevent a change in control of the Company or other transactions that could provide the security holders with a premium over the then-prevailing market price of their securities or which might otherwise be in the best interest of our security holders. This includes the Ownership Limit described above. While our existing preferred shares/preference units do not have all of these provisions, any future series of preferred shares/preference units may have certain voting provisions that could delay or prevent a change in control or other transactions that might otherwise be in the interest of our security holders. Our Bylaws require certain information to be provided by any security holder, or persons acting in concert with such security holder, who proposes business or a nominee at an annual meeting of shareholders, including disclosure of information related to hedging activities and investment strategies with respect to our securities. These requirements could delay or prevent a change in control or other transactions that might otherwise be in the interest of our security holders. The Board of Trustees may use its powers to issue preferred shares and to set the terms of such securities to delay or prevent a change in control of the Company even if a change in control were in the interest of the security holders.\n\nAny gain resulting from transfers of properties we hold as inventory or primarily for sale to customers in the ordinary course of business is treated as income from a prohibited transaction subject to a 100% penalty tax unless certain safe harbor exceptions set forth in the Code apply. We do not believe that our transfers or disposals of property are prohibited transactions. However, whether property is held for investment purposes is a question that depends on all the facts and circumstances surrounding the particular transaction. The IRS may contend that certain transfers or dispositions of properties by us or contributions of properties are prohibited transactions. While we believe the IRS would not prevail in any such dispute, if the IRS were to argue successfully that a transfer or disposition of property constituted a prohibited transaction, we would be required to pay a 100% penalty tax on any gain allocable to us from the prohibited transaction. In addition, income from a prohibited transaction might adversely affect our ability to satisfy the income tests for qualification as a REIT.\n\nWe believe we have created an industry-leading operating platform and balance sheet to run our properties. Our employees are focused on delivering remarkable customer service to our residents so they will stay with us longer, be willing to pay higher rent for a great experience and will tell others about how much they love living in an Equity Residential property. We utilize technology and other innovative methods of engagement with our residents to foster relationships and community, improve the resident experience and operate our business more efficiently. We pair that with disciplined balance sheet management that enhances returns and value creation while maintaining flexibility to take advantage of future opportunities. We believe that our stakeholders value stability, liquidity, predictability and accountability and that is the mission to which we remain unwaveringly committed.\n\nA breach or significant and extended disruption in the function of our systems, including our primary website, could damage our reputation and cause us to lose residents and revenues, result in a violation of applicable privacy and other laws, generate third-party claims, result in the unintended and/or unauthorized public disclosure or the misappropriation of proprietary, personally identifiable and confidential information and require us to incur significant expenses to address and remediate or otherwise resolve these kinds of issues. We may not be able to recover these expenses in whole or in any part from our service providers, our insurers or any other responsible parties. Our insurance coverage may not be sufficient to cover all losses related to cybersecurity incidents. As a result, there can be no assurance that our financial results would not be negatively impacted.\n\nWe may periodically collect and store personally id",
  "item7_clean": "Inflation primarily impacts our results of operations as a result of wage/payroll pressures, increases in utilities through escalation of commodity costs and increases in repair and maintenance costs through higher contractor costs. In addition, inflation could also impact the interest we pay on our floating rate debt and upon refinancing of fixed rate debt in a high-inflationary environment, our cost of capital and our cost of development, renovation and capital expenditure activities. However, the majority of our apartment leases have initial terms of 12 months or less, which generally enables us to compensate for inflationary effects by increasing rents on our apartment homes, subject to supply and demand conditions. Although an extreme or sustained escalation in costs could have a negative impact on our residents and their ability to absorb rent increases, we do not believe inflation had a material impact on our results of operations for the years ended December 31, 2024, 2023 and 2022.\n\nProperty management expenses include off-site expenses associated with the self-management of the Company’s properties as well as management fees paid to any third-party management companies. The increase during the year ended December 31, 2024 as compared to 2023 is primarily attributable to increases in payroll-related costs, information technology expenses and legal and professional fees.\n\nGeneral and administrative expenses, which include corporate operating expenses, increased during the year ended December 31, 2024 as compared to 2023, primarily due to increases in legal and professional fees and other public company costs, partially offset by decreases in payroll-related costs.\n\nOther expenses increased during the year ended December 31, 2024 as compared to 2023, primarily due to increases in litigation accruals and advocacy contributions, partially offset by decreases in data transformation project costs that occurred during 2023 but not during 2024.\n\nOur operating cash flows are primarily impacted by NOI and its components, such as Average Rental Rates, Physical Occupancy levels and operating expenses related to our properties. Cash provided by operating activities for the year ended December 31, 2024 as compared to 2023 increased by approximately $40.8 million primarily as a result of the NOI and other changes discussed above in\nResults of Operations\n\nAcquisition Capitalization Rate or Cap Rate – NOI that the Company anticipates receiving in the next 12 months (or the year two or three stabilized NOI for properties that are in lease-up at acquisition) less an estimate of property management costs/management fees allocated to the project (generally ranging from 2.0% to 4.0% of revenues depending on the size and income streams of the asset) and less an estimate for in-the-unit replacement capital expenditures (generally ranging from $100-$450 per apartment unit depending on the age and condition of the asset) divided by the gross purchase price of the asset. The weighted average Acquisition Cap Rate for acquired properties is weighted based on the projected NOI streams and the relative purchase price for each respective property.\n\nDisposition Yield – NOI that the Company anticipates giving up in the next 12 months less an estimate of property management costs/management fees allocated to the project (generally ranging from 2.0% to 4.0% of revenues depending on the size and income streams of the asset) and less an estimate for in-the-unit replacement capital expenditures (generally ranging from $150-$450 per apartment unit depending on the age and condition of the asset) divided by the gross sales price of the asset. The weighted average Disposition Yield for sold properties is weighted based on the projected NOI streams and the relative sales price for each respective property.\n\nInterest expense, including amortization of deferred financing costs, increased during the year ended December 31, 2024 as compared to 2023, primarily due to higher overall debt balances outstanding and higher overall rates, partially offset by higher capitalized interest. The effective interest cost on all indebtedness, excluding debt extinguishment costs/prepayment penalties, for the year ended December 31, 2024 was 3.91% as compared to 3.82% in 2023. The Company capitalized interest of approximately $14.5 million and $12.3 million during the years ended December 31, 2024 and 2023, respectively.\n\nThe Company evaluates its long-lived assets, including its investment in real estate, for indicators of impairment at least quarterly. The judgments regarding the existence of impairment indicators are based on factors such as operational performance, market conditions, legal, regulatory and environmental concerns, the Company’s intent and ability to hold the related asset, as well as any significant cost overruns on development properties. Future events could occur which would cause the Company to conclude that impairment indicators exist and an impairment loss is warranted. Assessing impairment can be complex and involves a high degree of subjectivity in determining if indicators are present and in estimating the future undiscounted cash flows or the fair value of an asset. In particular, these estimates are sensitive to significant assumptions, including the estimation of future rental revenues, operating expenses, discount and capitalization rates and our intent and ability to hold the related asset, all of which could be affected by our expectations about future market or economic conditions. Assumptions are primarily subject to property-specific characteristics, especially with respect to our intent and ability to hold the related asset. While these property-specific assumptions can have a significant impact on the undiscounted cash flows or estimated fair value of a particular asset, our evaluation of the reported carrying values of long-lived assets during the current year were not particularly sensitive to external or market assumptions.\n\nThe Company has identified the significant accounting policies below as critical accounting policies. These critical accounting policies are those that have the most impact on the reporting of our financial condition and those requiring significant judgments and estimates. With respect to these critical accounting policies, management believes that the application of judgments and estimates is consistently applied and produces financial information that fairly presents the results of operations for all periods presented.\n\nIssued $600.0 million of ten-year 4.65% unsecured notes, receiving net proceeds of approximately $598.0 million before underwriting fees, hedge termination costs and other expenses. The proceeds from this issuance were used to partially fund the Company’s acquisition activity during 2024.\n\nThe Company has a $2.5 billion unsecured revolving credit facility maturing on October 26, 2027. The Company has the ability to increase available borrowings by an additional $750.0 million by adding lenders to the facility, obtaining the agreement of existing lenders to increase their commitments or incurring one or more term loans. The interest rate on advances under the facility will generally be the Secured Overnight Financing Rate (\"SOFR\") plus a spread (currently 0.725%), or based on bids received from the lending group, and the Company pays an annual facility fee (currently 0.125%). Both the spread and the facility fee are dependent on the Company’s senior unsecured credit rating and other terms and conditions per the agreement. See Note 8 in the Notes to Consolidated Financial Statements for additional discussion of the Company’s credit facility.\n\nFor comparison of the year ended December 31, 2023 to the year ended December 31, 2022, refer to Item 7,\nManagement’s Discussion and Analysis of Financial Condition and Results of Operations\n\nThe National Association of Real Estate Investment Trusts (“Nareit”) defines funds from operations (“FFO”) (December 2018 White Paper) as net income (computed in accordance with accounting principles generally accepted in the United States (“GAAP”)), excluding gains or losses from sales and impairment write-downs of depreciable real estate and land when connected to the main business of a REIT, impairment write-downs of investments in entities when the impairment is directly attributable to decreases in the value of depreciable real estate held by the entity and depreciation and amortization related to real estate. Adjustments for partially owned consolidated and unconsolidated partnerships and joint ventures are calculated to reflect funds from operations on the same basis.\n\nOther on-site operating expenses – A $3.4 million increase primarily driven by higher property-related legal expenses;\n\nItem 7. Management’s Discussion and Analysis of\nFinancial Condition and Results of Operations\n\nCorporate overhead includes property management and general and administrative expenses.\n\nManagement’s Discussion and Analysis of Financial Condition and Results of Operations\n\nForward sale agreements under the ATM program allow the Company, at its election, to settle the agreements by issuing Common Shares in exchange for net proceeds at the then-applicable forward sale price specified by the agreement or, alternatively, to settle the agreements in whole or in part through the delivery or receipt of Common Shares or cash. Issuances of shares under these forward sale agreements are classified as equity transactions. Accordingly, no amounts relating to the forward sale agreements are recorded in the consolidated financial statements until settlement occurs. Prior to any settlements, the only impact to the consolidated financial statements is the inclusion of incremental shares, if any, within the calculation of diluted net income per share using the treasury stock method (see Note 10 in the Notes to Consolidated Financial Statements). The actual forward price per share to be received by the Company upon settlement will be determined on the applicable settlement date based on adjustments made to the initial forward price to reflect the then-current overnight federal funds rate and the amount of dividends paid to holders of the Company’s Common Shares over the term of the forward sale agreement.\n\nThe Company believes that FFO and FFO available to Common Shares and Units / Units are helpful to investors as supplemental measures of the operating performance of a real estate company, because they are recognized measures of performance by the real estate industry and by excluding gains or losses from sales and impairment write-downs of depreciable real estate and excluding depreciation related to real estate (which can vary among owners of identical assets in similar condition based on historical cost accounting and useful life estimates), FFO and FFO available to Common Shares and Units / Units can help compare the operating performance of a company’s real estate between periods or as compared to different companies. The Company also believes that Normalized FFO and Normalized FFO available to Common Shares and Units / Units are helpful to investors as supplemental measures of the operating performance of a real estate company because they allow investors to compare the Company’s operating performance to its performance in prior reporting periods and to the operating performance of other real estate companies without the effect of items that by their nature are not comparable from period to period and tend to obscure the Company’s actual operating results. FFO, FFO available to Common Shares and Units / Units, Normalized FFO and Normalized FFO available to Common Shares and Units / Units do not represent net income, net income available to Common Shares / Units or net cash flows from operating activities in accordance with GAAP. Therefore, FFO, FFO available to Common Shares and Units / Units, Normalized FFO and Normalized FFO available to Common Shares and Units / Units should not be exclusively considered as alternatives to net income, net income available to Common Shares / Units or net cash flows from operating activities as determined by GAAP or as a measure of liquidity. The Company’s calculation of FFO, FFO available to Common Shares and Units / Units, Normalized FFO and Normalized FFO available to Common Shares and Units / Units may differ from other real estate companies due to, among other items, variations in cost capitalization policies for capital expenditures and, accordingly, may not be comparable to such other real estate companies.\n\nThe Company expects to meet its long-term liquidity requirements, such as lump sum unsecured note and mortgage debt maturities, property acquisitions and financing of development activities, through the issuance of secured and unsecured debt and equity securities (including additional OP Units), proceeds received from the disposition of certain properties and joint ventures, along with cash generated from operations after all distributions. The Company has a significant number of unencumbered properties available to secure additional mortgage borrowings should unsecured capital be unavailable or the cost of alternative sources of capital be too high. The value of and cash flow from these unencumbered properties are in excess of the requirements the Company must maintain in order to comply with covenants under its unsecured notes and line of credit. Of the $30.0 billion in investment in real estate on the Company’s balance sheet at December 31, 2024, $26.8 billion or 89.4% was unencumbered. However, there can be no assurances that these sources of capital will be available to the Company in the future on acceptable terms or otherwise. For additional details, see Item 1A,\n\nOverall, the fundamentals of our business are healthy. Long-term, we expect elevated single family home ownership costs, positive household formation trends, manageable competitive new supply in our Established Markets and moderating competitive new supply in our Expansion Markets. With an overall deficit in housing across the country, we believe our business is well positioned for the future. We also see our resident base as being resilient to economic uncertainty, including elevated inflation, due to higher levels of disposable income and lower relative rent-to-income ratios.\n\nTotal Budgeted Capital Cost – Estimated remaining cost for projects under development and/or developed plus all capitalized costs incurred to date, including land acquisition costs, construction costs, capitalized real estate taxes and insurance, capitalized interest and loan fees, permits, professional fees, allocated development overhead and other regulatory fees, plus any estimates of costs remaining to be funded for all projects, all in accordance with GAAP. Amounts for partially owned consolidated and unconsolidated properties are presented at 100% of the project.\n\nThe preparation of financial statements in conformity with accounting principles generally accepted in the United States requires management to use judgment in the application of accounting policies, including making estimates and assumptions. If our judgment or interpretation of the facts and circumstances relating to various transactions had been different or different assumptions were made, it is possible that different accounting policies would have been applied, resulting in different financial results or different presentation of our financial statements.\n\nThe Company’s primary financial measure for evaluating each of its apartment communities is net operating income (“NOI”). NOI represents rental income less direct property operating expenses (including real estate taxes and insurance). The Company believes that NOI is helpful to investors as a supplemental measure of its operating performance because it is a direct measure of the actual operating results of the Company’s apartment properties.\n\nInterest and",
  "item2_clean": null
}