{
  "source_file": "eqr-20250930.htm",
  "form_type": "10-Q",
  "item1_clean": null,
  "item7_clean": null,
  "item2_clean": "During the nine months ended September 30, 2025, the Company's operating business performed well, driven by sustained demand across most of our markets and supported by high resident retention, continued low levels of unemployment and solid wage growth among our target renter demographic. Competitive new supply was modest in most of our Established Markets, but remains elevated in our Expansion Markets in 2025, resulting in a more challenging pricing environment. On a positive note, portions of our portfolio in Atlanta, particularly our suburban assets, have shown continued stability, with indications of potential improvement in market conditions as supply is beginning to abate.\nSan Francisco and New York continue to be our best performing markets. Each of these markets has experienced healthy demand as evidenced by strong Physical Occupancy, healthy pricing, low Turnover and modest new supply. The Seattle market also continued to improve due to large employers’ return to office policies and continued investment from technology companies, particularly around artificial intelligence, though higher supply levels mean the recovery in Seattle is occurring at a slower pace than in San Francisco. We did begin to see weakness in traffic during the second half of September 2025, particularly in Washington D.C., but also in other markets. Washington, D.C. experienced a market slowdown late in the third quarter of 2025, a result of several factors including uncertainty from government cuts, national guard deployment and an impending government shutdown. Los Angeles continues to face ongoing challenges as growth from the entertainment industry remains muted, limiting pricing power, despite an improving quality of life.\nOverall, the fundamentals of our business are healthy and remain resilient despite recent macroeconomic uncertainty. Long-term, we expect continued positive secular tailwinds for our business due to elevated single family home ownership costs, positive household formation trends, historically low competitive new supply in our Established Markets and moderating competitive new supply in our Expansion Markets. With an overall deficit in housing across the country, we believe our business is well positioned for the future. We also see our resident base as being more resilient to economic uncertainty, including elevated inflation, due to higher levels of disposable income and lower relative rent-to-income ratios.\n\nEQR is the general partner of, and as of September 30, 2025 owned an approximate 97.5% ownership interest in, ERPOP. All of the Company’s property ownership, development and related business operations are conducted through the Operating Partnership and EQR has no material assets or liabilities other than its investment in ERPOP. EQR issues equity from time to time, the net proceeds of which it is obligated to contribute to ERPOP, but does not have any indebtedness as all debt is incurred by the Operating Partnership. The Operating Partnership holds substantially all of the assets of the Company, including the Company’s ownership interests in its joint ventures. The Operating Partnership conducts the operations of the business and is structured as a partnership with no publicly traded equity.\nThe Company’s corporate headquarters is located in Chicago, Illinois and the Company also operates regional property management offices in most of its markets.\nAvailable Information\nwww.equityapartments.com.\nThese reports/statements are made available on our website as soon as reasonably practicable after we file them with or furnish them to the SEC. The information contained on our website, including any information referred to in this report as being available on our website, is not a part of or incorporated into this report.\nBusiness Objectives and Operating and Investing Strategies\n\nThe increase in consolidated total NOI is a result of the Company’s higher NOI from non-same store properties as noted above and higher NOI from same store properties, largely due to improvement in same store revenues and the Company's continued focus on same store expense efficiency.\nsection below for additional discussion of those results. See the reconciliation table of net income per the consolidated statements of operations to NOI above for the dollar and percentage changes related to the comparison discussions provided below.\nProperty management expenses include off-site expenses associated with the self-management of the Company’s properties as well as management fees paid to any third-party management companies. The increase during the nine months ended September 30, 2025 as compared to the prior year period is primarily attributable to increases in training and marketing expenses and information technology expenses, partially offset by decreases in workforce/contractors costs. Property management expenses decreased during the quarter ended September 30, 2025 as compared to the prior year period, primarily due to decreases in payroll-related costs, legal and professional fees and workforce/contractor costs, partially offset by increases in information technology expenses.\nGeneral and administrative expenses, which include corporate operating expenses, increased during the nine months and quarter ended September 30, 2025 as compared to the prior year periods, primarily due to increases in payroll-related costs, workforce/contractor costs and other public company costs.\nDepreciation expense increased during the nine months and quarter ended September 30, 2025 as compared to the prior year periods, primarily as a result of additional depreciation expense on properties acquired in 2024 and 2025 and development properties placed in service during 2024 and 2025, partially offset by lower depreciation from properties sold in 2024 and 2025.\nNet gain on sales of real estate properties increased during the nine months and quarter ended September 30, 2025 as compared to the prior year periods, primarily as a result of the mix of properties sold in 2025 vs. 2024.\nInterest and other income increased during the nine months and quarter ended September 30, 2025 as compared to the prior year periods, primarily due to a net increase in realized/unrealized gains on various investment securities, interest income on mortgages receivable and an employment tax refund received in 2025 but not in 2024, partially offset by lower insurance/litigation settlement proceeds received during 2025 as compared to 2024.\n\nOther expenses decreased during the nine months ended September 30, 2025 as compared to the prior year period, primarily due to decreases in litigation accruals and advocacy contributions, partially offset by increases in the write-off of development pursuit costs and overhead. Other expenses increased during the quarter ended September 30, 2025 as compared to the prior year period, primarily due to increases in litigation accruals and the write-off of development pursuit costs and overhead, partially offset by decreases in advocacy contributions.\nInterest expense, including amortization of deferred financing costs, increased during the nine months and quarter ended September 30, 2025 as compared to the prior year periods, primarily due to higher overall debt balances outstanding and higher overall rates. The effective interest cost on all indebtedness, excluding debt extinguishment costs/prepayment penalties, for the nine months ended September 30, 2025 was 3.94% as compared to 3.90% for the prior year period, and for the quarter ended September 30, 2025 was 3.96% as compared to 3.92% for the prior year period. The Company capitalized interest of approximately $9.6 million and $10.7 million during the nine months ended September 30, 2025 and 2024, respectively, and $2.9 million and $3.8 million during the quarters ended September 30, 2025 and 2024, respectively.\n\nThe Company declared a dividend/distribution for the first, second and third quarters of 2025 of $0.6925 per share/unit in each quarter, an annualized increase of 2.6% over the amount paid in 2024. All future dividends/distributions remain subject to the discretion of the Company’s Board of Trustees.\nTotal dividends/distributions paid in October 2025 amounted to $269.9 million (excluding distributions on Partially Owned Properties), which consisted of certain distributions declared during the quarter ended September 30, 2025.\nLong-Term Financing and Capital Needs\nThe Company expects to meet its long-term liquidity requirements, such as lump sum unsecured note and mortgage debt maturities, property acquisitions and financing of development activities, through the issuance of secured and unsecured debt and equity securities (including additional OP Units), proceeds received from the disposition of certain properties and joint ventures, along with cash generated from operations after all distributions. The Company has a significant number of unencumbered properties available to secure additional mortgage borrowings should unsecured capital be unavailable or the cost of alternative sources of capital be too high. The value of and cash flow from these unencumbered properties are in excess of the requirements the Company must maintain in order to comply with covenants under its unsecured notes and line of credit. Of the $30.6 billion in investment in real estate on the Company’s balance sheet at September 30, 2025, $27.6 billion or 90.2% was unencumbered. However, there can be no assurances that these sources of capital will be available to the Company in the future on acceptable terms or otherwise. For additional details, see Item 1A,\nEQR issues equity and guarantees certain debt of the Operating Partnership from time to time. EQR does not have any indebtedness as all debt is incurred by the Operating Partnership.\nThe Company’s total debt summary schedule as of September 30, 2025 is as follows:\nDebt Summary as of September 30, 2025\n\nCompleted construction and stabilized one unconsolid"
}