{
  "source_file": "eqt-20250930.htm",
  "form_type": "10-Q",
  "item1_clean": null,
  "item7_clean": null,
  "item2_clean": "EQT CORPORATION AND SUBSIDIARIES\nManagement's Discussion and Analysis of Financial Condition and Results of Operations\ndemand for alternatives to natural gas; environmental and weather risks, including the possible impacts of climate change; and disruptions to our business due to recently completed divestitures, acquisitions and other significant strategic transactions, including the Olympus Energy Acquisition. These and other risks and uncertainties are described under the \"Risk Factors\" section and elsewhere in EQT's Annual Report on\nAny forward-looking statement speaks only as of the date on which such statement is made, and, except as required by law, we do not intend to correct or update any forward-looking statement, whether as a result of new information, future events or otherwise.\nRecent and Significant Events\nOlympus Energy Acquisition\nOn July 1, 2025, we completed our acquisition (the Olympus Energy Acquisition) of certain oil and gas properties and related upstream and midstream assets, including approximately 90,000 net acres with approximately 500 million cubic feet (MMcf) per day of net production, from Olympus Energy LLC, Hyperion Midstream LLC and Bow & Arrow Land Company LLC (collectively, Olympus Energy). The purchase price for the Olympus Energy Acquisition consisted of 25,229,166 shares of EQT common stock, with an aggregate value of $1,471 million based on an EQT common stock share price of $58.32 (the last reported per share sale price of EQT common stock on the day prior to the completion of the Olympus Energy Acquisition), and approximately $475 million in cash, each as adjusted pursuant to customary purchase price adjustments and subject to final post-closing purchase price adjustments. We funded the cash consideration with cash on hand and borrowings under EQT's revolving credit facility. See Note 11 to the Condensed Consolidated Financial Statements for further discussion of the Olympus Energy Acquisition.\nNEPA Gathering System Acquisition and NEPA Non-Operated Asset Divestitures\nBeginning May 31, 2024, our results of operations reflect (i) our divestiture (the First NEPA Non-Operated Asset Divestiture) of an undivided 40% interest in our non-operated natural gas assets in Northeast Pennsylvania and (ii) our 100% ownership of the NEPA Gathering System (defined in Note 11 to the Condensed Consolidated Financial Statements) following our acquisition of additional ownership interests therein in connection with the NEPA Gathering System Acquisition (defined in Note 11 to the Condensed Consolidated Financial Statements) and the First NEPA Non-Operated Asset Divestiture.\nIn addition, our results of operations for 2025 reflect our divestiture (the Second NEPA Non-Operated Asset Divestiture, and together with the First NEPA Non-Operated Asset Divestiture, the NEPA Non-Operated Asset Divestitures) of the remaining undivided 60% interest in our non-operated natural gas assets in Northeast Pennsylvania, which was completed on December 31, 2024.\nEquitrans Midstream Merger\nBeginning July 22, 2024, our results of operations reflect our operation of the assets acquired in the Equitrans Midstream Merger (defined in Note 11 to the Condensed Consolidated Financial Statements).\nFollowing the Equitrans Midstream Merger, the gathering and transmission services previously provided to us by Equitrans Midstream Corporation are provided to our Production segment by our Gathering and Transmission segments as affiliate transactions. As a result, our Production segment's third-party gathering expense decreased and its affiliate transportation and processing expense increased, and our Gathering and Transmission segments' affiliate revenue increased. As the affiliate expense and revenue are eliminated in consolidation, the net impact is a reduction in our consolidated transportation and processing expense.\nIn addition, in connection with the Equitrans Midstream Merger, we acquired an equity method investment in the MVP Joint Venture (defined in Note 8 to the Condensed Consolidated Financial Statements). Because the investment is not consolidated, costs incurred by our Production segment for transportation services provided by the MVP (defined in Note 8 to the Condensed Consolidated Financial Statements) are reported in our consolidated transportation and processing expense, and equity earnings recognized by our Transmission segment from our investment in the MVP Joint Venture are reported in income from investments in the Statements of Condensed Consolidated Operations.\nEQT CORPORATION AND SUBSIDIARIES\nManagement's Discussion and Analysis of Financial Condition and Results of Operations\nSee Note 11 to the Condensed Consolidated Financial Statements for further discussion of the Equitrans Midstream Merger.\nTrends and Uncertainties\nCommodity prices have been volatile thus far in 2025, and we expect commodity prices to continue to be volatile for the remainder of 2025 due to macroeconomic uncertainty, changes to the regulatory environment and geopolitical tensions, including developments pertaining to Russia's invasion of Ukraine, conflicts in the Middle East and potential further imposition of domestic and foreign tariffs. Our revenue, profitability, liquidity and financial position will continue to be impacted in the future by the market prices for natural gas and, to a lesser extent, NGLs and oil.\nIn response to price volatility in the natural gas market and to optimize in-basin pricing, we implement strategic curtailments from time to time to reduce our gross production. During the three months ended September 30, 2025, strategic curtailments resulted in decreased sales volumes of approximately 3 billion cubic feet equivalent (Bcfe). In addition, we have included approximately 15 Bcfe to 20 Bcfe of strategic curtailments in our sales volume guidance for the fourth quarter of 2025, subject to market conditions. Low natural gas prices or volatility in the natural gas market may result in further adjustments to our 2025 planned development schedule and/or adjustments to the development schedule of non-operated wells in which we have a working interest. We cannot control or otherwise influence the development schedule of non-operated wells in which we have a working interest. Adjustments to our 2025 planned development schedule or the development schedule of non-operated wells in which we have a working interest, including due to declines in natural gas prices, the pace of well completions, access to sand and water to conduct drilling operations, access to sufficient pipeline takeaway capacity, unscheduled downtime at processing facilities or otherwise, could impact our future sales volume, operating revenues and expenses, per unit metrics and capital expenditures.\nOn July 4, 2025, President Trump signed the One Big Beautiful Bill Act into law. See Note 6 to the Condensed Consolidated Financial Statements for further discussion of the One Big Beautiful Bill Act. We expect the enactment of the One Big Beautiful Bill Act to favorably impact our projected cash income tax obligations over the next five years by deferring the payment of a significant portion of current federal income taxes.\nPresident Trump has also executed several executive orders, some of which impact the oil and gas industry, and he and others in Congress have indicated the potential for further changes to regulations, many of which could impact the oil and gas industry, as well as the implementation of tariffs on foreign goods and services. It is uncertain at this time to what extent such changes in regulations and tariffs will impact our business. Tariffs on foreign goods and services could result in other countries instituting tariffs on U.S. goods and services, which could impact the demand for and price of natural gas, increase the price of supplies and raw materials that we rely on to conduct our business, and could impact interest rates. A changing regulatory environment and domestic or foreign tariffs could ultimately impact our future sales volume, operating revenues and expenses, per unit metrics and capital expenditures.\nConsolidated Results of Operations\nNet income attributable to EQT Corporation for the three months ended September 30, 2025 was $335.9 million, $0.53 per diluted share, compared to net loss attributable to EQT Corporation of $300.8 million, $0.54 per diluted share, for the same period in 2024. The improvement was driven primarily by increased operating revenues, decreased acquisition-related transaction costs and decreased gathering expense, partly offset by income tax expense in 2025 compared to income tax benefit in 2024 and higher depreciation and depletion expense.\nNet income attributable to EQT Corporation for the nine months ended September 30, 2025 was $1,362.1 million, $2.23 per diluted share, compared to net loss attributable to EQT Corporation of $187.8 million, $0.39 per diluted share, for the same period in 2024. The improvement was driven primarily by increased sales of natural gas, decreased gathering expense, increased pipeline revenues, decreased acquisition-related transaction costs and increased equity earnings from the MVP Joint Venture. These favorable impacts were partly offset by income tax expense in 2025 compared to income tax benefit in 2024, higher depreciation and depletion expense, the 2024 gain on the First NEPA Non-Operated Asset Divestiture and higher income attributable to noncontrolling interests.\nEQT CORPORATION AND SUBSIDIARIES\nManagement's Discussion and Analysis of Financial Condition and Results of Operations\nSee \"Average Realized Price Reconciliation\" for a discussion and calculation of our average realized price, which is based on our Production segment's adjusted operating revenues (Production adjusted operating revenues), a non-GAAP supplemental financial measure that has been reconciled to total Production operating revenues in \"Non-GAAP Financial Measures Reconciliation.\" See \"B"
}