{
  "source_file": "erie-20241231.htm",
  "form_type": "10-K",
  "item1_clean": "Erie Indemnity Company (\"Indemnity\", \"we\", \"us\", \"our\") is a publicly held Pennsylvania business corporation that has since its incorporation in 1925 served as the attorney-in-fact for the subscribers (policyholders) at the Erie Insurance Exchange (\"Exchange\"). The Exchange, which also commenced business in 1925, is a Pennsylvania-domiciled reciprocal insurer that writes property and casualty insurance. The Exchange has wholly owned property and casualty insurance subsidiaries including: Erie Insurance Company, Erie Insurance Company of New York, Erie Insurance Property & Casualty Company and Flagship City Insurance Company, and a wholly owned life insurance company, Erie Family Life Insurance Company (\"EFL\").\nOur primary function as attorney-in-fact is to perform policy issuance and renewal services on behalf of the subscribers at the Exchange. We also act as attorney-in-fact on behalf of the subscribers at the Exchange with respect to all claims handling and investment management services, as well as the service provider for all claims handling, life insurance, and investment management services for the Exchange's insurance subsidiaries, collectively referred to as \"administrative services\". Acting as attorney-in-fact in these two capacities is done in accordance with a subscriber's agreement (a limited power of attorney) executed individually by each subscriber (policyholder), which appoints Indemnity as each subscriber's attorney-in-fact to transact certain business on their behalf. In accordance with the subscriber’s agreement for acting as attorney-in-fact in these two capacities, we retain a management fee calculated as a percentage, not to exceed 25%, of the direct and affiliated assumed premiums written by the Exchange. The management fee rate is set at least annually by our Board of Directors. The process of setting the management fee rate includes, but is not limited to, the evaluation of current year operating results compared to both prior year and industry estimated results for both Indemnity and the Exchange, and consideration of several factors for both entities including, but not limited to: their relative financial strength and capital position; projected revenue, expense and earnings for the subsequent year; future capital needs; as well as competitive position.\nWe operate under a single reportable segment: management operations. Financial information about this segment is set forth in and referenced to Item 8. “Financial Statements and Supplementary Data - Note 4, Segment Information, of Notes to Consolidated Financial Statements” contained within this report. Further discussion of financial results for our single operating segment is provided in and referenced to Item 7. “Management’s Discussion and Analysis of Financial Condition and Results of Operations” contained within this report.\nThe policy issuance and renewal services we provide on behalf of the subscribers at the Exchange are related to the sales, underwriting and issuance of policies. The sales related services we provide include agent compensation and certain sales and advertising support services. Agent compensation includes scheduled commissions to agents based upon premiums written as well as incentive compensation, which is earned by achieving targeted measures. Agent compensation comprised approximately 69% of our 2024 policy issuance and renewal expenses. The underwriting services we provide include underwriting and policy processing and comprised approximately 9% of our 2024 policy issuance and renewal expenses. The remaining services we provide include customer service and administrative support. We also provide information technology services that support all the functions listed above that comprised approximately 9% of our 2024 policy issuance and renewal expenses. Included in these expenses are allocations of costs for departments that support these policy issuance and renewal functions.\nConsistent with its legal structure as a reciprocal insurer, the Exchange does not have any employees or officers. Therefore, it enters into contractual relationships by and through the subscribers' attorney-in-fact. Indemnity serves as the attorney-in-fact on behalf of the subscribers at the Exchange with respect to its administrative services as enumerated in the subscriber's agreement. The Exchange's insurance subsidiaries also utilize Indemnity for these services in accordance with the service agreements between each of the subsidiaries and Indemnity. Claims handling services include costs incurred in the claims process, including the adjustment, investigation, defense, recording and payment functions. Life insurance management services include costs incurred in the management and processing of life insurance business. Investment management services are related to investment trading activity, accounting and all other functions attributable to the investment of funds. Included in these expenses are allocations of costs for departments that support these administrative functions. The subscriber's agreement and service agreements provide for reimbursement of amounts incurred for these services to Indemnity. Reimbursements are settled at cost. State insurance regulations require that intercompany service agreements and any material amendments be approved in advance by the state insurance department.\nErie Insurance Exchange\nAs our primary purpose is to manage the affairs at the Exchange for the benefit of the subscribers (policyholders) through the policy issuance and renewal services and administrative services, the Exchange is our sole customer. Our earnings are largely generated from management fees based on the direct and affiliated assumed premiums written by the Exchange. We have no direct competition in providing these services to the Exchange.\nThe Exchange generates revenue by insuring preferred and standard risks, with personal lines comprising 71% of the 2024 direct and affiliated assumed written premiums and commercial lines comprising the remaining 29%. The principal personal lines products are private passenger automobile and homeowners. The principal commercial lines products are commercial multi-peril, commercial automobile and workers compensation. Historically, due to policy renewal and sales patterns, the Exchange's direct and affiliated assumed written premiums tend to be greater in the second and third quarters than in the first and fourth quarters of the calendar year.\nThe Exchange is represented by independent agencies that serve as its sole distribution channel. In addition to their principal role as salespersons, the independent agents play a significant role as underwriting and service providers and are an integral part of the Exchange's success.\nOur results of operations are tied to the growth and financial condition of the Exchange. If any events occurred that impaired the Exchange's ability to grow or sustain its financial condition, including but not limited to reduced financial strength ratings, disruption in the independent agency relationships, significant catastrophe losses, or products not meeting customer demands, the Exchange could find it more difficult to retain its existing business and attract new business. A decline in the business of the Exchange almost certainly could have as a consequence a decline in the total premiums paid and a correspondingly adverse effect on the amount of the management fees we receive. We also have an exposure to a concentration of credit risk related to the unsecured receivables due from the Exchange for net management fee and other reimbursements. See Part II, Item 8. \"Financial Statements and Supplementary Data - Note 16, Concentrations of Credit Risk, of Notes to Consolidated Financial Statements\" contained within this report. See the risk factors related to our dependency on the growth and financial condition of the Exchange in Item 1A. \"Risk Factors\" contained within this report.\nOur primary function as attorney-in-fact is to perform policy issuance and renewal services on behalf of the subscribers at the Exchange. We also act as attorney-in-fact on behalf of the subscribers at the Exchange, as well as the service provider for the Exchange's insurance subsidiaries, with respect to all administrative services. There are a limited number of companies that provide services under a reciprocal insurance exchange structure. We do not directly compete against other such companies, given we are appointed by the subscribers at the Exchange to provide these services.\nThe direct and affiliated assumed premiums written by the Exchange drive our management fee, which is our primary source of revenue. The property and casualty insurance industry is highly competitive. Property and casualty insurers generally compete on the basis of customer service, price, consumer recognition, coverages offered, claims handling, financial stability and geographic coverage. Vigorous competition, particularly in the personal lines automobile and homeowners lines of business, exists from large, well-capitalized national companies, some of which have broad distribution networks of employed or captive agents, by smaller regional insurers, and by large companies who market and sell personal lines products directly to consumers. Innovations by competitors or other market participants may also increase the level of competition in the industry. In addition, because the insurance products of the Exchange are marketed exclusively through independent insurance agents, the Exchange faces competition within its appointed agencies based upon ease of doing business, product, price, and service relationships.\nMarket competition bears directly on the price charged for insurance products and services subject to regulatory limitations. Industry capital levels can also significantly affect prices charged for coverage. Growth is driven by a company's ability to provide insurance services and competitive prices while maintaining target profit margins. Growth is a product of a company's ability to retain existing customers and to attract new customers, as well as movement in the average premium per policy.\nThe Exchange's business model is designed to provide the advantages of localized marketing and claims servicing with the economies of scale and low cost of operations from centralized support services. Indemnity, as part of its role managing and conducting the business and affairs of the Exchange, also carefully selects the independent agencies that represent the Exchange, which seeks to be the lead insurer with its agents in order to enhance the agency relationship and the likelihood of receiving the most desirable underwriting opportunities from its agents.\nThe Exchange’s strategic focus as a reciprocal insurer is to employ a disciplined underwriting philosophy and to leverage its strong surplus position to generate higher risk adjusted investment returns. The goal is to produce acceptable returns, on a long-term basis, through careful risk selection, appropriate pricing and superior investment returns. This focus allows the Exchange\nto accomplish its mission of providing as near perfect protection, as near perfect service as is humanly possible at the lowest possible cost.\nSee the risk factors related to our dependency on the growth and financial condition of the Exchange in Item 1A. \"Risk Factors\" contained within this report for further discussion on competition in the insurance industry.\nHuman Capital Management\nOur human capital management strategy, including initiatives to shape our workforce and workplace, is designed to attract, retain, and develop talent to ensure we are well positioned for the future. Our partnership with our employees is one of the cornerstones of our success.\nOur employee value proposition includes a culture that focuses on physical, financial, and emotional well-being. We strive to maintain a positive employee experience through a continuous",
  "item7_clean": "See Item 8. \"Financial Statements and Supplementary Data - Note 2, Significant Accounting Policies, of Notes to Consolidated Financial Statements\" contained within this report for a discussion of recently adopted and issued accounting standards and the impact on our consolidated financial statements if known.\nOPERATING OVERVIEW\nWe are a Pennsylvania business corporation that since 1925 has been the managing attorney-in-fact for the subscribers (policyholders) at the Exchange, a reciprocal insurer that writes property and casualty insurance. Our primary function as attorney-in-fact is to perform policy issuance and renewal services on behalf of the subscribers at the Exchange. We also act as attorney-in-fact on behalf of the subscribers at the Exchange, as well as the service provider for the Exchange's insurance subsidiaries, with respect to all administrative services.\nThe Exchange is a reciprocal insurance exchange, which is an unincorporated association of individuals, partnerships and corporations that agree to insure one another. Each applicant for insurance (a subscriber) to the Exchange signs a subscriber's agreement, which contains an appointment of Indemnity as their attorney-in-fact to transact the business of the Exchange on their behalf.\nIn accordance with the subscriber’s agreement for acting as attorney-in-fact in these two capacities, we retain a management fee. Management fee revenue is based upon all direct and affiliated assumed premiums written by the Exchange and the management fee rate, which is not to exceed 25%. Our Board of Directors establishes the management fee rate at least annually, generally in December for the following year. The process of setting the management fee rate includes, but is not limited to, the evaluation of current year operating results compared to both prior year and industry estimated results for both Indemnity and the Exchange, and consideration of several factors for both entities including, but not limited to: their relative financial strength and capital position; projected revenue, expense and earnings for the subsequent year; future capital needs; as well as competitive position. The management fee rate was set at 25% for 2024, 2023 and 2022. Based on analysis of the foregoing factors, our Board of Directors set the 2025 management fee rate again at 25%.\nOur earnings are primarily driven by the management fee revenue generated for the services we provide on behalf of the subscribers at the Exchange. The policy issuance and renewal services we provide are related to the sales, underwriting and issuance of policies. The sales related services we provide include agent compensation and certain sales and advertising support services. Agent compensation includes scheduled commissions to agents based upon premiums written as well as incentive compensation, which is earned by achieving targeted measures. Agent compensation comprised approximately 69% of our 2024 policy issuance and renewal expenses. The underwriting services we provide include underwriting and policy processing and comprised approximately 9% of our 2024 policy issuance and renewal expenses. The remaining services we provide include customer service and administrative support. We also provide information technology services that support all the functions listed above that comprised approximately 9% of our 2024 policy issuance and renewal expenses. Included in these expenses are allocations of costs for departments that support these policy issuance and renewal functions.\nConsistent with its legal structure as a reciprocal insurer, the Exchange does not have any employees or officers. Therefore, it enters into contractual relationships by and through the subscribers' attorney-in-fact. Indemnity serves as the attorney-in-fact on behalf of the subscribers at the Exchange with respect to its administrative services as enumerated in the subscriber's agreement. The Exchange's insurance subsidiaries also utilize Indemnity for these services in accordance with the service agreements between each of the subsidiaries and Indemnity. Claims handling services include costs incurred in the claims process, including the adjustment, investigation, defense, recording and payment functions. Life insurance management services include\ncosts incurred in the management and processing of life insurance business. Investment management services are related to investment trading activity, accounting and all other functions attributable to the investment of funds. In 2024, approximately 70% of the administrative services expenses were entirely attributable to the respective administrative functions (claims handling, life insurance management and investment management), while the remaining 30% of these expenses were allocations of costs for departments that support these administrative functions. The expenses we incur and related reimbursements we receive for administrative services are presented gross in our Consolidated Statements of Operations. The subscriber's agreement and service agreements provide for reimbursement of amounts incurred for these services to Indemnity. Reimbursements are settled at cost on a monthly basis. State insurance regulations require that intercompany service agreements and any material amendments be approved in advance by the state insurance department.\nOur results of operations are tied to the growth and financial condition of the Exchange as the Exchange is our sole customer, and our earnings are largely generated from management fees based on the direct and affiliated assumed premiums written by the Exchange. The Exchange generates revenue by insuring preferred and standard risks, with personal lines comprising 71% of the 2024 direct and affiliated assumed written premiums and commercial lines comprising the remaining 29%. The principal personal lines products are private passenger automobile and homeowners. The principal commercial lines products are commercial multi-peril, commercial automobile and workers compensation.\nWe generate investment income from our fixed maturity and equity security portfolios. Our portfolio is managed with the objective of maximizing after-tax returns on a risk-adjusted basis. We actively evaluate the fixed maturity portfolios for securities in an unrealized loss position and record impairment write-downs on investments in instances where we have the intent to sell or it's more likely than not that we would be required to sell the security. Impairments resulting from a credit loss are recognized in earnings with a corresponding allowance on the Consolidated Statements of Financial Position.\nYears ended December 31,\n(dollars in thousands, except per share data)\nTotal investment income\nNM\nNM\nInterest expense, net\nNM\nNM\nNM\nIncome before income taxes\nNet income per share - diluted\nOperating income increased in 2024 compared to 2023 as growth in operating revenue outpaced the growth in operating expenses. Management fee revenue is based upon the management fee rate we charge and the direct and affiliated assumed premiums written by the Exchange. The management fee rate was 25% for 2024, 2023, and 2022. The direct and affiliated assumed premiums written by the Exchange increased 18.4% to $11.9 billion in 2024 and 17.0% to $10.1 billion in 2023.\nCost of operations for policy issuance and renewal services increased 15.0% to $2.3 billion in 2024 primarily due to higher scheduled commissions driven by direct and affiliated assumed written premium growth, as well as increased personnel costs and underwriting report costs, partially offset by decreased professional fees. Cost of operations for policy issuance and renewal services increased 12.0% to $2.0 billion in 2023 primarily due to higher scheduled commissions driven by direct and affiliated assumed written premium growth, as well as increased employee compensation and technology costs, partially offset by decreased agent incentive compensation driven by higher claims severity and related loss costs experienced by the Exchange.\nManagement fee revenue for administrative services increased 7.4% to $68.4 million in 2024 compared to an increase of 9.2% in 2023. The administrative services reimbursement revenue and corresponding cost of operations increased both total operating revenue and total operating expenses by $806.3 million in 2024 and $737.1 million in 2023, but had no net impact on operating income.\nTotal investment income increased $40.3 million in 2024 primarily due to an increase in net investment income and net realized and unrealized gains in 2024 compared to net realized and unrealized losses in 2023. Total investment income increased $28.3 million in 2023 primarily due to lower realized and unrealized investment losses and an increase in net investment income compared to 2022.\nGeneral Conditions and Trends Affecting Our Business\nUnfavorable changes in economic conditions, including declining consumer confidence, inflation, high unemployment, and the threat of recession, among others, may lead the Exchange’s customers to modify coverage, not renew policies, or even cancel policies, which could adversely affect the premium revenue of the Exchange, and consequently our management fee revenue. Elevated inflation or supply chain disruptions could impact the Exchange's operations and our management fees. In particular, unanticipated increased inflation costs including medical cost inflation, building material cost inflation, auto repair and replacement cost inflation, and social inflation may impact adequacy of estimated loss reserves and future premium rates of the Exchange. If any of these items impacted the financial condition or operations of the Exchange, it could have an impact on our financial results. See Financial Condition, Liquidity and Capital Resources, and Part I, Item 1A. \"Risk Factors\" contained within this report for a discussion of potential impacts to our operations or those of the Exchange.\n\nRatings are supplied by S&P, Moody’s, and Fitch . The table is based upon the lowest rating for each security.\n(2) Structured securities include residential and commercial mortgage-backed securities, collateralized debt obligations, and asset-backed securities.\nEquity securities primarily include nonredeemable preferred stocks and are carried at fair value in the Consolidated Statements of Financial Position with all changes in unrealized gains and losses reflected in the Consolidated Statements of Operations.\nThe following table presents an analysis of the fair value of our equity securities by sector as of December 31:\nShareholders' Equity\nPostretirement benefit plans\nThe funded status of our postretirement benefit plans is recognized in the Consolidated Statements of Financial Position, with a corresponding adjustment to accumulated other comprehensive income (loss), net of tax. At December 31, 2024, shareholders' equity amounts related to these postretirement plans decreased by $41.3 million, net of tax, of which $5.2 million primarily represents amortization of net actuarial gain and $36.1 million primarily represents the current period actuarial loss. The 2024 actuarial loss was driven primarily by the lower than expected return on plan assets, partially offset by the higher discount rate used to measure the future benefit obligations. At December 31, 2023, shareholders' equity amounts related to these postretirement plans decreased by $33.8 million, net of tax, of which $11.0 million represents amortization of the prior service cost and net actuarial gain and $22.8 million primarily represents the current period actuarial loss. The 2023 actuarial loss was driven by the lower discount rate used to measure the future benefit obligations, partially offset by higher than expected return on plan assets. Although we are the sponsor of these postretirement plans and record the funded status of these plans, there are reimbursements between us and the Exchange and its insurance subsidiaries for their allocated share of pension income or cost. See Item 8. \"Financial Statements and Supplementary Data - Note 10, Postretirement Benefits, of Notes to Consolidated Financial Statements\" contained within this report for additional details on these reimbursements.\nLIQUIDITY AND CAPITAL RESOURCES\nWe continue to monitor the sufficiency of our liquidity and capital resources given the potential impact of current economic\nconditions, including the uncertain inflationary and interest rate environment. While we did not see a significant impact on our sources or uses of cash in 2024, future market disruptions could occur which may affect our liquidity position. If our normal operating and investing cash activities were to become insufficient to meet future funding requirements, we believe we have sufficient access to liquidity through our cash position, diverse liquid marketable securities, and our $100 million bank revolving line of credit that does not expire until November 1, 2029. See broader discussions of potential risks to our operations in Operating Overview and Part I, Item 1A. \"Risk Factors\" contained within this report.\nSources and Uses of Cash\nLiquidity is a measure of a company's ability to generate sufficient cash flows to meet the short- and long-term cash requirements of its business operations and growth needs. Our liquidity requirements have been met primarily by funds generated from management fee revenue and income from investments. Cash provided from these sources is used primarily to fund the costs of our management operations including commissions, salaries and wages, pension plans, share repurchases, dividends to shareholders, the purchase and development of information technology, and other capital expenditures. We expect that our operating cash needs will be met by funds generated from operations. Cash in excess of our operating needs is primarily invested in investment grade fixed maturities. As part of our liquidity review, we regularly evaluate our capital needs based on current and projected results and consider the potential impacts to our liquidity, borrowing capacity, financial covenants and capital availability.\nWe have certain obligations and commitments to make future payments under various agreements. Cash requirements within the next twelve months include accounts payable, accrued liabilities, and other current obligations.\nOur long-term cash requirements under various contractual obligations and commitments include:\n– We have a funded noncontributory defined benefit pension plan covering substantially all employees and an unfunded SERP for certain members of executive and senior management. See Item 8. \"Financial Statements and Supplementary Data - Note 10, Postretirement Benefits, of Notes to Consolidated Financial Statements\" for the funding policy and related contributions for our defined benefit pension plan, and accumulated benefit obligation for our unfunded SERP.\nDeferred compensation\n– We have two deferred compensation plans for our executives, senior vice presidents and other selected officers, and two deferred compensation plans for our outside directors. See Item 8. \"Financial Statements and Supplementary Data - Note 11, Incentive and Deferred Compensation Plans, of Notes to Consolidated Financial Statements\" for additional details of these obligations and estimated future payments.\nHome office renovations\n– We have agreements with external contracting firms for renovations to an office building that is part of our principal headquarters. Remaining commitments related to the underlying contracts total $45.4 million at December 31, 2024, of which over half is due in the next 12 months. Additional contracts will be executed as we begin each new phase of the overall renovation project and will be funded using our working capital. See Item 8. \"Financial Statements and Supplementary Data - Note 8, Fixed Assets, of Notes to Consolidated Financial Statements\" for a",
  "item2_clean": null
}