{
  "source_file": "erie-20250930.htm",
  "form_type": "10-Q",
  "item1_clean": null,
  "item7_clean": null,
  "item2_clean": "Additionally, we have incurred and will continue to incur certain expenses related to the information security incident, including expenses to respond to, remediate and investigate this matter. We have cybersecurity insurance that we expect will cover a portion of lost income due to business interruption and related expenses. The full impact has not yet been determined, but is not expected to be material to our consolidated financial condition, results of operations or cash flows.\nThree months ended September 30,\nNine months ended September 30,\n(dollars in thousands, except per share data)\nTotal investment income\nIncome before income taxes\nNet income per share – diluted\nOperating income increased in both the third quarter and nine months ended September 30, 2025, compared to the same periods in 2024, as growth in operating revenue outpaced the growth in operating expenses. Management fee revenue for policy issuance and renewal services increased 7.3% to $825.3 million in the third quarter of 2025 and 9.5% to $2.4 billion for the nine months ended September 30, 2025. Management fee revenue is based upon the management fee rate we charge and the direct and affiliated assumed premiums written by the Exchange. The management fee rate was 25% for both 2025 and 2024. The direct and affiliated assumed premiums written by the Exchange increased 7.6% to $3.4 billion in the third quarter of 2025 and 10.1% to $9.9 billion for the nine months ended September 30, 2025, compared to the same periods in 2024.\nCost of operations for policy issuance and renewal services increased 4.7% to $642.1 million in the third quarter of 2025 and 9.1% to $1.9 billion for the nine months ended September 30, 2025, compared to the same periods in 2024, primarily due to higher scheduled commissions driven by direct and affiliated assumed written premium growth and increased agent incentive compensation due to improved profitability. Cost of operations for policy issuance and renewal services in the third quarter of 2025 were partially offset by decreased personnel costs related to incentive compensation.\nManagement fee revenue for administrative services increased 9.8% to $18.8 million in the third quarter of 2025 and 7.1% to $54.8 million for the nine months ended September 30, 2025, compared to the same periods in 2024. The administrative services reimbursement revenue and corresponding cost of operations increased both total operating revenue and total operating expenses by $215.7 million in the third quarter of 2025 and $638.6 million for the nine months ended September 30, 2025, but had no net impact on operating income.\nTotal investment income increased $2.0 million in the third quarter of 2025 and $12.2 million for the nine months ended September 30, 2025, compared to the same periods in 2024. The results from both periods were primarily due to an increase in net investment income.\nGeneral Conditions and Trends Affecting Our Business\nFinancial market volatility\nOur portfolio of available-for-sale and equity security investments is subject to market volatility, especially in periods of instability in the worldwide financial markets. Net investment income is impacted by the general level of interest rates, which impact reinvested cash flow from the portfolio and business operations. Depending upon market conditions, considerable fluctuation could occur in the fair value of our investment portfolio and reported total investment income, which could have an adverse impact on our consolidated financial condition, results of operations and cash flows. Various ongoing geopolitical events, the uncertain tariff, inflationary and interest rate environment and a potential economic slowdown could have a significant impact on the global financial markets with the potential for future losses and/or impairments on our investment portfolio.\nRESULTS OF OPERATIONS\n\nA constraining estimate of variable consideration exists related to the potential for management fees to be returned if a policy were to be cancelled mid-term. Management fees are returned to the Exchange when policies are cancelled mid-term and unearned premiums are refunded.\nManagement fee revenue - administrative services is recognized over time as the services are provided. See Part I, Item 1. \"Financial Statements - Note 3, Revenue, of Notes to Consolidated Financial Statements\" contained within this report.\nDirect and affiliated assumed premiums written by the Exchange\nDirect and affiliated assumed premiums include premiums written directly by the Exchange and premiums assumed from its wholly owned property and casualty subsidiaries. Direct and affiliated assumed premiums written by the Exchange increased 7.6% to $3.4 billion in the third quarter of 2025 compared to the third quarter of 2024, primarily driven by increased personal lines and commercial multi-peril premiums written. Year-over-year policies in force for all lines of business increased 0.2% in the third quarter of 2025 compared to 6.0% in the third quarter of 2024. The year-over-year average premium per policy for all lines of business increased 10.7% at September 30, 2025 compared to 12.8% at September 30, 2024.\nPremiums generated from new business decreased 20.5% to $351 million in the third quarter of 2025 compared to the same period in 2024, primarily driven by decreased premiums written in the personal auto, commercial multi-peril and homeowners lines. Contributing to this change was a 24.1% decrease in new business policies written, partially offset by a 8.5% increase in year-over-year average premium per policy on new business at September 30, 2025. Premiums generated from new business increased 9.5% to $441 million in the third quarter of 2024 compared to the same period in 2023, primarily driven by increased premiums written in the commercial multi-peril and homeowners lines. Contributing to this change was a 15.9% increase in year-over-year average premium per policy on new business, somewhat offset by a 4.0% decrease in new business policies written in the third quarter of 2024.\nPremiums generated from renewal business increased 12.1% to $3.1 billion in the third quarter of 2025 compared to the third quarter of 2024 and increased 20.0% to $2.7 billion in the third quarter of 2024 compared to the third quarter of 2023. Underlying the trend in renewal business premiums in both periods was an 11.3% increase in year-over-year average premium per policy at September 30, 2025, and 12.3% at September 30, 2024, as well as an increase in year-over-year policies in force of 4.1% and 5.7% in the third quarters of 2025 and 2024, respectively.\n– Total personal lines premiums written increased 7.1% to $2.5 billion in the third quarter of 2025, compared to 20.1% in the third quarter of 2024, driven by a 11.1% increase in total personal lines year-over-year average premium per policy, slightly offset by a 0.2% decrease in total personal lines policies in force.\n– Total commercial lines premiums written increased 8.9% to $902 million in the third quarter of 2025, compared to 13.9% in the third quarter of 2024, driven by a 7.9% increase in total commercial lines year-over-year average premium per policy and a 3.0% increase in total commercial lines policies in force.\nFuture trends-premium revenue\n– Through a careful agency selection and monitoring process, the Exchange plans to continue efforts to utilize its agency force to increase market penetration in existing operating territories to contribute to future growth.\nPolicy issuance and renewal services\nThree months ended September 30,\nNine months ended September 30,\n(dollars in thousands)\nManagement fee revenue - policy issuance and renewal services\nService agreement revenue\nCost of operations - policy issuance and renewal services\nOperating income - policy issuance and renewal services\nPolicy issuance and renewal services\nThe management fee revenue allocated for providing policy issuance and renewal services was 24.37% and 24.40% of the direct and affiliated assumed premiums written by the Exchange for both the three and nine month periods ended September 30, 2025 and 2024, respectively. This portion of the management fee is recognized as revenue when the policy is issued or renewed because it is at that time that the services we provide are substantially complete and the executed insurance policy is transferred to the customer. The increase in management fee revenue for policy issuance and renewal services was driven by the increase in the direct and affiliated assumed premiums written by the Exchange discussed previously.\nService agreement revenue\nService agreement revenue primarily consists of service charges we collect from subscribers (policyholders) for providing multiple payment plans on policies written by the Exchange and its property and casualty subsidiaries and also includes late payment and policy reinstatement fees. The service charges are fixed dollar amounts per billed installment. Service agreement revenue also includes fees received from the Exchange for the use of shared office space.\nCost of policy issuance and renewal services\nThree months ended September 30,\nNine months ended September 30,\n(dollars in thousands)\nNon-commission expense:\nUnderwriting and policy processing\nInformation technology\nSales and advertising\nAdministrative and other\nTotal non-commission expense\nTotal cost of operations - policy issuance and renewal services\n– Commissions increased $41.0 million in the third quarter of 2025 and $145.6 million for the nine months ended September 30, 2025, compared to the same periods in 2024, primarily driven by the growth in direct and affiliated assumed written premium and, to a lesser extent, an increase in agent incentive compensation. The estimated agent incentive payouts at September 30, 2025 are based on actual underwriting results for the two prior years and current year-to-date actual results and forecasted results for the remainder of 2025. The"
}