{
  "source_file": "ess-20241231.htm",
  "form_type": "10-K",
  "item1_clean": "In March 2024, the Company acquired its joint venture partner's 49.9% interest in the BEXAEW LLC’s (“BEXAEW”) portfolio comprised of four communities for a total purchase price of $505.0 million on a gross basis.\nIn April 2024, the Company accepted the third-party sponsor’s common equity interest affiliated with its $14.7 million preferred equity investment. The community was consolidated on the Company’s financial statements at a $46.6 million valuation.\nIn July 2024, the Company acquired its joint venture partner's 49.9% common equity interest in Patina at Midtown for a total purchase price of $117.0 million on a gross basis.\nIn September 2024, the Company acquired its joint venture partner's 50% common equity interest in Century Towers for a total purchase price of $173.5 million on a gross basis.\nIn October 2024, the Company acquired its joint venture partner’s 49.9% interest in the BEX II, LLC (“BEX II”) portfolio, comprised of four communities for a total contract price of $337.5 million on a gross basis.\nDispositions of Real Estate Interests\nAs part of its strategic plan to own quality real estate in supply-constrained markets, the Company continually evaluates all of its communities and sells those communities that no longer meet the Company’s strategic criteria. The Company may use the capital generated from the dispositions to invest in higher-return communities, other real estate investments or to fund other commitments. The Company believes that the sale of these communities will not have a material impact on its future results of operations or cash flows nor will the sale of these communities materially affect the Company’s ongoing operations. In general, the Company seeks to offset the dilutive impact on long-term earnings and funds from operations from these dispositions through the positive impact of reinvestment of proceeds.\nThe table below summarizes disposition activity for the year ended December 31, 2024 ($ in millions):\nSale Price at Pro Rata Share\nCA\nIn October 2024, the Company sold its 81.5% interest in a consolidated co-investment, Hillsdale Garden, a 697-unit apartment home community, for a contract price of $252.4 million on a gross basis ($205.7 million at pro rata).\nDevelopment Pipeline\nThe Company defines development projects as new communities that are being constructed, or are newly constructed and are in a phase of lease-up and have not yet reached stabilized operations.\nThe Company defines predevelopment projects as proposed communities in negotiation or in the entitlement process with an expected high likelihood of becoming entitled development projects. The Company may also acquire land for future development purposes. As of December 31, 2024, the Company’s development pipeline was comprised of various consolidated predevelopment projects with total incurred costs of $52.7 million.\nDuring 2024, the Company made regularly scheduled principal payments of $3.1 million to its secured mortgage notes payable at an average interest rate of 3.5%.\nIn March 2024, the Operating Partnership issued $350.0 million of senior unsecured notes due on April 1, 2034 with a coupon rate of 5.500% per annum (the \"2034 Notes\"), which are payable on April 1 and October 1 of each year, beginning on October 1, 2024. The 2034 Notes were offered to investors at a price of 99.752% of the principal amount. The 2034 Notes are general unsecured senior obligations of the Operating Partnership, rank equally in right of payment with all other senior unsecured indebtedness of the Operating Partnership and are unconditionally guaranteed by Essex. The Company used the net proceeds of this offering to repay debt maturities, including to fund a portion of the repayment of its outstanding 3.875% senior unsecured notes due May 2024 and for other general corporate and working capital purposes. In August 2024, the Operating Partnership issued an additional $200.0 million of the 2034 Notes at a price of 102.871% of the principal amount, plus accrued interest from and including March 2024, up to, but excluding, the settlement date of August 21, 2024, with an effective yield of 5.110% per annum. These additional notes have substantially identical terms of the 2034 Notes issued in March 2024.\nAs of December 31, 2024, Moody’s Investor Service and Standard and Poor’s (“S&P”) credit agencies rated Essex Property Trust, Inc. and Essex Portfolio, L.P. Baa1/Stable and BBB+/Stable, respectively.\nAs of December 31, 2024, the Company had two unsecured lines of credit aggregating $1.28 billion. The Company’s $1.2 billion credit facility had an interest rate of Adjusted Secured Overnight Financing Rate (“Adjusted SOFR”) plus 0.765% which is based on a tiered rate structure tied to the Company’s credit ratings, adjusted for the facility’s sustainability metric adjustment feature, and a scheduled maturity date of January 2029 with two six-month extensions, exercisable at the Company’s option. In September 2024, the scheduled maturity date was extended from January 2027 to January 2029. The Company’s $75.0 million working capital unsecured line of credit had an interest rate of Adjusted SOFR plus 0.765%, which is based on a tiered rate structure tied to the Company’s credit ratings, adjusted for the facility’s sustainability metric adjustment feature. Prior to its maturity in July 2024 the line of credit facility was amended such that the line’s capacity was increased from $35.0 million to $75.0 million and the scheduled maturity date was extended to July 2026.\nIn August 2024, the Company entered into a new equity distribution agreement pursuant to which the Company may offer and sell shares of its common stock having an aggregate gross sales price of up to $900.0 million (the “2024 ATM Program”). In connection with the 2024 ATM Program, the Company may also enter into related forward sale agreements whereby, at the Company’s discretion, it may sell shares of its common stock under the 2024 ATM Program under forward sale agreements. The use of a forward sale agreement would allow the Company to lock in a share price on the sale of shares of its common stock at the time the agreement is executed, but defer receipt of the proceeds from the sale of shares until a later date.\nThe 2024 ATM Program replaced the prior equity distribution agreement entered into in September 2021 (the “2021 ATM Program”), which was terminated upon the establishment of the 2024 ATM Program.\nDuring the year ended December 31, 2024, the Company did not issue any shares of common stock under the 2024 ATM Program or the 2021 ATM Program. As of December 31, 2024, there were no outstanding forward sale agreements, and $900.0 million of shares remained available to be sold under the 2024 ATM Program.\nIn September 2022, the Company’s Board of Directors approved a stock repurchase plan to allow the Company to acquire shares of common stock up to an aggregate value of $500.0 million. The plan supersedes the Company’s previous common stock repurchase plan announced in December 2015. During the year ended December 31, 2024, the Company did not repurchase any shares. As of December 31, 2024, the Company had $302.7 million of purchase authority remaining under the stock repurchase plan.\nThe Company has entered into, and may continue in the future to enter into, joint ventures or partnerships (including limited liability companies) through which it owns an indirect economic interest in less than 100% of the community or land or other investments owned directly by the joint venture or partnership. For each joint venture the Company holds a non-controlling interest in the venture and, in most cases, may earn customary management fees, development fees, asset property management fees, and a promote interest.\nThe Company has also made, and may continue in the future to make, preferred equity investments in various multifamily stabilized communities or development projects. The Company earns a preferred rate of return on these investments.\nHUMAN CAPITAL MANAGEMENT\nCompany Overview and Values\nThe Company’s mission is to create quality communities in premier locations and it is critical to the Company’s mission that it attracts, trains and retains a talented and diverse team by providing a compelling place to work and opportunities for professional growth. The Company’s culture supports its mission and is guided by its core values: to act with integrity, to care about what matters, to do right with urgency, to lead at every level and to seek fairness. The Company is headquartered in San Mateo, CA, and has regional corporate offices in Woodland Hills, CA; Irvine, CA and Bellevue, WA.\nAs of December 31, 2024, the Company had 1,715 employees, 99.8% of whom were full-time employees. A total of 1,293 employees worked on-site at our operating communities and 422 worked in our corporate offices. The Company’s employee statistics for 2024 include the following data as of December 31, 2024: the Company’s workforce was comprised of 6 self-identified ethnically diverse groups, making up 71% of our population, 52% of the Company’s managerial employees, and included 29% of its senior executives; there were 204 women in positions of manager or higher, equating to 59% of managerial positions in the Company; the Company’s workforce self-identified as 41% female and 58% male (1% chose not to disclose their gender); and, 55% of the Company’s corporate associates self-identified as female.\nThe Company believes it has a broad perspective that better serves both the communities it operates in and the associates it employs due to fostering one of the most talented and diverse workforces among its peers in the real estate industry. The Company also supports employee-led resource groups which are open to all employees and intended to foster a sense of community and inclusion for associates at the Company that are intended to engage, educate, enable, and empower the Company’s employees.\nTraining and Development\nThe Company values leadership at every level and enables the same by providing opportunities for all associates to develop personal and professional skills through programs that encourage associate retention and advancement. The Company currently offers training courses to its associates via Workday Learning, and its associates spent 13,122 hours learning in 2024. The Company also provides its associates with an annual $3,000 tuition reimbursement to further support outside professional growth opportunities. To identify, retain and reward top performers, the Company engages in meaningful internal succession planning and offers a tenure program, excellence awards, and a bonus recognition program to reward associates for good teamwork, good ideas, and good service. The Company encourages internal promotions and hiring for open positions, and the executive team actively mentors the Company’s top talent to ensure strong leadership at the Company for the future. 38% of the Company’s associates have approached or surpassed the Company’s average tenure of 6.57 years, with 22% reaching beyond 10 years of service.\nEmployee Safety, Health, and Wellness\nSafety is a top priority. The Company deeply cares about the wellbeing of its associates and residents. The Essex Safety Committee, comprised of key stakeholders across departments, meets quarterly and reviews the overall safety of the company in both our corporate offices and our communities. To maximize real-time responses, the Company has also established a working safety subcommittee that meets bi-weekly. The Company has implemented enhanced safety programs, which include a new Workplace Violence Prevention Program enacted companywide in 2024, regular safety inspections, emergency preparedness processes, hazard identification and control protocols, and related associate training.\nThe Company’s safety policies align with its health and wellness goals and seeks to proactively prevent workplace accidents and protect the h",
  "item7_clean": "As of December 31, 2024, the Company had operating lease commitments of $125.1 million for ground, building and garage leases with maturity dates ranging from 2025 to 2083. $6.4 million of these commitments are due within the next twelve months.\nVariable Interest Entities\nIn accordance with accounting standards for consolidation of variable interest entities (“VIEs”), the Company consolidated the Operating Partnership, 18 DownREIT entities (comprising nine communities) and five co-investments as of December 31, 2024. As of December 31, 2023, the Company consolidated the Operating Partnership, 18 DownREIT entities (comprising nine communities) and six co-investments. The Company consolidates these entities because it is deemed the primary beneficiary. Essex has no assets or liabilities other than its investment in the Operating Partnership. The consolidated total assets and liabilities related to the above consolidated co-investments and DownREIT entities, net of intercompany eliminations, were $893.0 million and $319.1 million, respectively, as of December 31, 2024, and $956.7 million and $324.5 million, respectively, as of December 31, 2023. Noncontrolling interests in these entities were $105.1 million and $121.1 million as of December 31, 2024 and 2023, respectively. The Company’s financial risk in each VIE is limited to its equity investment in the VIE. As of December 31, 2024, the Company was not deemed to be the primary beneficiary of any other VIEs.\nCritical Accounting Estimates\nThe preparation of consolidated financial statements, in accordance with U.S. GAAP, requires the Company to make estimates and judgments that affect the reported amounts of assets, liabilities, revenues and expenses and related disclosures of contingent assets and liabilities. The Company defines critical accounting estimates as those that involve a significant level of estimation uncertainty and have had or are reasonably likely to have a material impact on the financial condition or results of operations of the Company. The Company’s critical accounting estimates relate principally to the following key areas: (i) accounting for the acquisition of investments in real estate; and (ii) evaluation of events and changes in circumstances indicating that the carrying value of any of the Company’s rental properties may not be recoverable.\nThe Company accounts for its acquisitions of investments in real estate by assessing each acquisition to determine if it meets the definition of a business or if it qualifies as an asset acquisition. We expect that acquisitions of individual operating communities will generally be viewed as asset acquisitions, and result in the capitalization of acquisition costs, and the allocation of purchase price to the assets acquired and liabilities assumed based on the relative fair value of the respective assets and liabilities.\nIn making estimates of fair values for purposes of allocating purchase price, the Company utilizes a number of sources, including independent land appraisals which consider comparable market transactions, its own analysis of recently acquired or developed comparable properties in our portfolio for land comparables and building replacement costs, and other publicly available market data. In calculating the fair value of identified intangible assets of an acquired property, the in-place leases are valued based on in-place rent rates and amortized over the average remaining term of all acquired leases. The allocation of the total consideration exchanged for a real estate acquisition between the identifiable assets and liabilities and the depreciation we recognize over the estimated useful life of the asset could be impacted by different assumptions and estimates used in the calculation. The reasonable likelihood that the estimate could have a material impact on the financial condition of the Company is based on the total consideration exchanged for real estate during any given year.\nThe Company periodically assesses its real estate investments for events or changes in circumstances that indicate the carrying value may not be recoverable. The judgments regarding the existence of impairment indicators are based on monitoring investment market conditions and performance for operating properties including the net operating income for the most recent\n12 month period, monitoring estimated costs for properties under development, the Company’s ability to hold and its intent with regard to each asset, and each property’s remaining useful life. Although each of these may result in an impairment indicator, the shortening of an expected holding period due to the potential sale of a property is the most likely impairment indicator. Whenever events or changes in circumstances indicate that the carrying amount of a property held for investment may not be fully recoverable, the carrying amount is evaluated. If the sum of the property’s expected future cash flows (undiscounted and without interest charges) is less than the carrying amount of the property, then the Company will recognize an impairment loss equal to the excess of the carrying amount over the fair value of the property. Changes in operating and market conditions may result in a change of our intent to hold the property through the end of its useful life and may impact the assumptions utilized to determine the future cash flows of the real estate investment.\nThe Company bases its accounting estimates on historical experience, current market conditions and various other assumptions that are believed to be reasonable under the circumstances. Actual results may vary from those estimates made by management and those estimates could be different under different assumptions or conditions.\nFunds from Operations Attributable to Common Stockholders and Unitholders\nFunds from Operations Attributable to Common Stockholders and Unitholders (“FFO”) is a financial measure that is commonly used in the REIT industry. The Company presents FFO and FFO excluding non-core items (referred to as “Core FFO”) as supplemental operating performance measures. FFO and Core FFO are not used by the Company as, nor should they be considered to be, alternatives to net income computed under U.S. GAAP as an indicator of the Company’s operating performance or as alternatives to cash from operating activities computed under U.S. GAAP as an indicator of the Company’s ability to fund its cash needs.\nFFO and Core FFO are not meant to represent a comprehensive system of financial reporting and do not present, nor do they intend to present, a complete picture of the Company’s financial condition and operating performance. The Company believes that net income computed under U.S. GAAP is the primary measure of performance and that FFO and Core FFO are only meaningful when they are used in conjunction with net income.\nThe Company considers FFO and Core FFO to be useful financial performance measurements of an equity REIT because, together with net income and cash flows, FFO and Core FFO provide investors with additional bases to evaluate operating performance and ability of a REIT to incur and service debt and to fund acquisitions and other capital expenditures and to pay dividends. By excluding gains or losses related to sales of depreciated operating properties and land, excluding real estate depreciation (which can vary among owners of identical assets in similar condition based on historical cost accounting and useful life estimates) and excluding impairment write-downs from operating real estate and unconsolidated co-investments driven by a measurable decrease in the fair value of real estate held by the co-investment, FFO can help investors compare the operating performance of a real estate company between periods or as compared to different companies. By further adjusting for items that are not considered part of the Company’s core business operations, Core FFO allows investors to compare the core operating performance of the Company to its performance in prior reporting periods and to the operating performance of other real estate companies without the effect of items that by their nature are not comparable from period to period and tend to obscure the Company’s actual operating results. The Company believes that its consolidated financial statements, prepared in accordance with U.S. GAAP, provide the most meaningful picture of its financial condition and its operating performance.\n\n2024 Same-Property Revenues\nincreased by $51.5 million or 3.3%. The increase was primarily attributable to increases of 1.9% in average rental rates from $2,605 for 2023 to $2,655 for 2024, 0.8% in other property income, and 0.9% from a decrease in delinquencies, partially offset by a decrease of 0.4% in occupancy.\n2024 Non-Same Property Revenues\nincreased by $54.4 million or 74.3% to $127.7 million in 2024 compared to $73.3 million in 2023. The increase was primarily due to acquisitions of Hacienda at Camarillo Oaks in 2023, as well as the acquisitions of ARLO Mountain View, Maxwell Sunnyvale, and Beaumont, and the acquisition of the Company’s joint venture partner’s interests in the BEXAEW and BEX II portfolios, Patina at Midtown, and Century Towers in 2024. The increases were partially offset by the sale of Hillsdale Garden in 2024.\nProperty operating expenses, excluding real estate taxes\nincreased by $26.4 million or 8.8% to $326.1 million in 2024 compared to $299.7 million in 2023, primarily due to increases of $10.6 million in utilities expenses, $7.8 million in administrative expenses, $7.3 million in personnel costs, and $0.7 million in maintenance and repairs expenses. 2024 Same-Property operating expenses, excluding real estate taxes, increased by $19.5 million or 6.7% to $308.8 million in 2024 compared to $289.3 million in 2023, primarily due to increases of $7.5 million in utilities expenses, $6.9 million in insurance and other expenses, $4.5 million in personnel costs, and $1.3 million in administrative expenses, offset by a decrease of $0.7 million in maintenance and repairs expenses.\nincreased by $7.6 million or 4.1% to $193.4 million in 2024 compared to $185.8 million in 2023, primarily due to increases in tax rates in California and the Seattle Metro region and due to the purchase of Hacienda at Camarillo Oaks in 2023 and acquisitions in 2024. 2024 Same-Property real estate taxes increased by $3.4 million or 1.9% to $179.8 million in 2024 compared to $176.4 million in 2023 primarily due to increases in tax rates in California and\nthe Seattle Metro region.\nDepreciation and amortization expense\nincreased by $31.8 million or 5.8% to $580.2 million in 2024 compared to $548.4 million in 2023, primarily due to acquisitions in 2023 and 2024. These increases were offset by the sale of CBC and The Sweeps in 2023 and Hillsdale Garden in 2024.\nGain on sale of real estate and land\nof $175.6 million in 2024 was attributable to the sale of Hillsdale Garden in 2024.\nincreased by $22.6 million or 10.6% to $235.5 million in 2024 compared to $212.9 million in 2023\nprimarily due to the issuance of $550.0 million senior unsecured notes in 2024 which resulted in an increase in interest expense of $20.1 million. The increase was also due to borrowing on the $300.0 million unsecured term loan in April 2023, the $298.0 million of 10-year secured loans closed in July 2023, and increased borrowing on the Company’s unsecured lines of credit in 2024 resulting in a $16.2 million increase in interest expense. Additionally, there was a $0.6 million decrease in capitalized interest in 2024, due to a decrease in development activity as compared to the same period in 2023. These increases in interest expense were partially offset by regular principal payments and various debts that matured or were paid off, primarily due to the pay off of the $300.0 million of senior unsecured notes due May 1, 2023 and $400.0 million of senior unsecured notes due May 1, 2024 during and after 2023, which resulted in a decrease in interest expense of $14.3 million for 2024.\nInterest and other income\nincreased by $34.7 million or 74.9% to $81.0 million in 2024 compared to $46.3 million in 2023, primarily due to increases of $34.8 million in legal settlements and $1.3 million in interest income, offset by a decrease of $1.7 million in realized and unrealized gains on marketable securities.\nEquity income from co-investments\nincreased by $37.6 million or 354.7% to $48.2 million in 2024 compared to $10.6 million in 2023, primarily due to a decrease of $30.0 million in impairment losses from unconsolidated co-investments, increases of $8.7 million in equity income from non-core co-investments, $1.5 million in co-investment promote income, and a decrease of $4.8 million in equity loss from co-investments. These increases were offset by a decrease of $6.5 million in income from preferred equity investments, including income from early redemption of preferred equity investments.\nGain on remeasurement of co-investments\nof $210.6 million resulted from the Company's acquisition of its joint venture partner's interests in the BEXAEW and BEX II portfolios, Patina at Midtown and Century Towers.\nComparison of Year Ended December 31, 2023 to the Year Ended December 31, 2022\nLiquidity and Capital Resources\nThe following table sets forth the Company’s cash flows for the periods presented ($ in thousands):\nYear Ended December 31,\n\nExpensed acquisition and investment related costs\nTax (benefit) expense on unconsolidated co-investments\nRealized and unrealized (gains) losses on marketable securities, net\nProvision for credit losses\nEquity (income) loss from non-core co-investments\nLoss on early retirement of debt, net\nLoss on early retirement of debt from unconsolidated co-investment\nCo-investment promote income\nIncome from early redemption of preferred equity investments and notes receivable\nGeneral and administrative and other, net\nInsurance reimbursements, legal settlements, and other, net\nCore funds from operations attributable to common stockholders and unitholders\nCore FFO per share-diluted\nWeighted average number of shares outstanding, diluted\nThe Company consolidates certain co-investments. The noncontrolling interest’s share of net operating income in these investments for the years ended December 31, 2024, 2023 and 2022 were $2.9 million, $3.3 million, and $3.3 million, respectively. For the year ended December 31, 2024, the amount includes $32.4 million of gain on sale attributable to noncontrolling interest.\nRepresents tax related to net unrealized gains or losses on technology co-investments.\nRepresents the Company’s share of co-investment income or loss from technology co-investments.\nIncludes political advocacy costs of $33.3 million, $4.1 million, and $1.9 million for the years ended December 31, 2024, 2023 and 2022 respectively.\nIncludes legal settlement gains of $42.5 million, $7.7 million, and $4.2 million for the for the years ended December 31, 2024, 2023 and 2022 respectively.\nAssumes conversion of all outstanding OP Units into shares of the Company’s common stock and excludes DownREIT limited partnership units.\nNet Operating Income\nNet operating income (“NOI”) and Same-Property NOI are considered by management to be important supplemental performance measures to earnings from operations included in the Company’s consolidated statements of income. The presentation of Same-Property NOI assists with the presentation of the Company’s operations prior to the allocation of depreciation and any corporate-level or financing-related costs. NOI reflects the operating performance of a community and allows for an easy comparison of the operating performance of individual communities or groups of communities. In addition, because prospective buyers of real estate have different financing and overhead structures, with varying marginal impacts to overhead by acquiring real estate, NOI is considered by many in the real estate indu",
  "item2_clean": null
}