{
  "source_file": "etr-20241231.htm",
  "form_type": "10-K",
  "item1_clean": "RISK FACTORS SUMMARY\nEntergy’s business is subject to numerous risks and uncertainties that could affect its ability to successfully implement its business strategy and affect its financial results. Carefully consider all of the information in this report and, in particular, the following principal risks and all of the other specific factors described in Part I, Item 1A of this report, “Risk Factors,” before deciding whether to invest in Entergy or the Registrant Subsidiaries.\nUtility Regulatory Risks\nThe terms and conditions of service, including electric and gas rates, of the Registrant Subsidiaries are determined through regulatory approval proceedings that can be lengthy and subject to appeal, potentially resulting in lengthy litigation, and uncertainty as to ultimate results.\nEntergy’s business could experience adverse effects related to changes to state or federal legislation or regulation, including increased tariffs, as well as changes to governmental policies and programs, including tax credits, loans, grants, guarantees, and other subsidies, or experience risks associated with participation in the MISO markets and allocation of transmission upgrade costs.\nThe Utility operating companies recover fuel, purchased power, and associated costs through rate mechanisms that are subject to risks of delay or disallowance in regulatory proceedings.\nA delay or failure in recovering amounts for storm restoration costs incurred as a result of severe weather could have material effects on Entergy and its Utility operating companies affected by severe weather.\nWeather, economic conditions, technological developments, and other factors may have a material impact on electricity and gas usage and otherwise materially affect the Utility operating companies’ results of operations.\nNuclear Operating, Shutdown, and Regulatory Risks\nThe results of operations, financial condition, and liquidity of Entergy Arkansas, Entergy Louisiana, and System Energy could be materially affected by the following:\ninability to consistently operate their nuclear power plants at high capacity factors;\nrefueling outages that last materially longer than anticipated or unplanned outages;\nrisks related to the purchase of uranium fuel (and its conversion, enrichment, and fabrication);\nthe risk that the NRC will change or modify its regulations, suspend or revoke their licenses, or increase oversight of their nuclear plants;\nrisks and costs related to operating and maintaining their nuclear power plants;\nthe costs associated with the storage of the spent nuclear fuel, as well as the costs of and their ability to fully decommission their nuclear power plants;\nthe potential requirement to pay substantial retrospective premiums and/or assessments imposed under the Price-Anderson Act and/or by Nuclear Electric Insurance Limited (NEIL) in the event of a nuclear incident, and losses not covered by insurance;\nthe risk that the decommissioning trust fund assets may not be adequate to meet decommissioning obligations if market performance and other changes decrease the value of assets in the decommissioning trusts and/or actual decommissioning costs are higher than estimated; and\nnew or existing safety concerns regarding operating nuclear power plants and nuclear fuel.\nEntergy and the Registrant Subsidiaries depend on access to the capital markets and, at times, may face potential liquidity constraints. Disruptions in the capital and credit markets or a downgrade in Entergy’s or its Registrant Subsidiaries’ credit ratings could, among other things, adversely affect their ability to meet liquidity needs, or to access capital to operate and grow their businesses, and the cost of capital.\nEntergy Corporation, Utility operating companies, and System Energy\nThe reputation of Entergy or its Registrant Subsidiaries may be materially adversely affected by negative publicity or the inability to meet their stated goals or commitments, among other potential causes.\nChanges in tax legislation and taxation as well as the inherent difficulty in quantifying potential tax effects of business decisions could negatively impact Entergy’s and the Registrant Subsidiaries’ results of operations, financial condition, and liquidity.\nEntergy and its subsidiaries’ ability to successfully execute on their business strategies, including their ability to execute on their growth strategies and to complete strategic transactions, is subject to significant risks, and, as a result, they may be unable to achieve some or all of the anticipated results of such strategies.\nThe success of certain Utility operating companies’ investments in new generation and transmission assets to support large-scale data centers depends on a limited number of customers, the continued demand for electricity to power data centers and the successful completion of the associated generation and transmission projects. Any reduction in the demand for electricity to power data centers or delays or unexpected costs associated with such projects may harm the growth prospects, future operating results and financial condition of Entergy and these Utility operating companies.\nEntergy may not be able to attract, retain, and manage an appropriately staffed and qualified workforce, which could negatively affect Entergy or its subsidiaries’ results of operations.\nEntergy and its subsidiaries, including the Utility operating companies and System Energy, may incur substantial costs (i) to fulfill their obligations related to environmental and other matters or (ii) related to reliability standards.\nEntergy could be negatively affected by the effects of climate change, including physical risks, such as increased frequency and intensity of hurricanes, availability of water, droughts, and other severe weather and wildfires, and transition risks, such as environmental and regulatory obligations intended to combat the effects of climate change, including by compelling greenhouse gas emission reductions or reporting, or increasing clean or renewable energy requirements, or placing a price on greenhouse gas emissions.\nMarket performance, interest rate changes, and other changes may decrease the value of employee benefit plan assets, which then could require additional funding of such benefit plans and result in increased benefit plan costs.\nThe litigation environment in the states in which the Registrant Subsidiaries operate poses a significant risk to those businesses.\nTerrorist attacks and sabotage, physical attacks, cyber attacks, system failures, data breaches or other disruptions of Entergy’s and its subsidiaries’ or their suppliers’ physical infrastructure or technology systems may adversely affect Entergy’s business and results of operations.\nEntergy and the Registrant Subsidiaries are subject to risks associated with their ability to obtain adequate insurance at acceptable costs.\nSignificant increases in commodity prices, other materials and supplies, and operation and maintenance expenses may adversely affect Entergy’s results of operations, financial condition, and liquidity.\nThe effect of higher purchased gas cost charges to customers taking gas service may adversely affect Entergy New Orleans’s results of operations and liquidity.\nSystem Energy owns and, through an affiliate, operates a single nuclear generating facility, and it is dependent on sales to affiliated companies for all of its revenues. Certain contractual arrangements relating to System Energy, the affiliated companies, and these revenues are the subject of ongoing and potential future litigation and regulatory proceedings.\nAs a holding company, Entergy Corporation depends on cash distributions from its subsidiaries to meet its debt service and other financial obligations and to pay dividends on its common stock, and has provided, and may continue to provide, capital contributions or debt financing to its subsidiaries, which would reduce the funds available to meet its other financial obligations.\nThe hazardous activities associated with power generation and delivery could adversely impact our results of operations and financial condition.\nEntergy Corporation, Utility operating companies, and System Energy\nENTERGY’S BUSINESS\nEntergy is an integrated energy company engaged primarily in electric power production and retail distribution operations. Entergy owns and operates power plants with approximately 25,000 MW of electric generating capacity. Entergy delivers electricity to approximately 3 million Utility customers in Arkansas, Louisiana, Mississippi, and Texas. Entergy had annual revenues of $11.9 billion in 2024 and had approximately 12,000 employees as of December 31, 2024.\nEntergy operates primarily through a single reportable segment, Utility. The Utility segment includes the generation, transmission, distribution, and sale of electric power in portions of Arkansas, Mississippi, Texas, and Louisiana, including the City of New Orleans; and operation of a small natural gas distribution business in portions of Louisiana. See “\nNatural Gas Distribution Businesses\n” in Note 14 to the financial statements for discussion of the planned sale of the Entergy New Orleans and Entergy Louisiana natural gas distribution businesses. Entergy completed its multi-year strategy to exit the merchant nuclear power business in 2022. See Note 13 to the financial statements for discussion of and financial information regarding Entergy’s business segments.\nEntergy’s strategy is to operate and grow its utility business through a customer-centric approach designed to understand and meet customer needs, creating value for all of its key stakeholders, including customers, communities, employees, and owners. As part of its strategy, Entergy invests significant capital to support customer growth and its customers’ growing demands for greater reliability, resilience, and clean energy, while remaining focused on affordability. Entergy manages risks by ensuring its Utility investments are customer-driven, the result of robust analysis, supported by broad stakeholder outreach and progressive regulatory constructs, and executed with disciplined project management. Further, Entergy continues to integrate key sustainability elements, including social responsibility and good governance, into every decision it makes.\nThe Utility segment includes five retail electric utility subsidiaries: Entergy Arkansas, Entergy Louisiana, Entergy Mississippi, Entergy New Orleans, and Entergy Texas. These companies generate, transmit, distribute, and sell electric power to retail and wholesale customers in Arkansas, Louisiana, Mississippi, and Texas. Entergy Louisiana and Entergy New Orleans also provide natural gas utility services to customers in and around Baton Rouge, Louisiana, and New Orleans, Louisiana, respectively. See “\nNatural Gas Distribution Businesses\n” in Note 14 to the financial statements for discussion of the planned sale of the Entergy New Orleans and Entergy Louisiana natural gas distribution businesses. Also included in the Utility is System Energy, a wholly-owned subsidiary of Entergy Corporation that owns or leases 90 percent of Grand Gulf. System Energy sells its power and capacity from Grand Gulf at wholesale to Entergy Arkansas, Entergy Louisiana, Entergy Mississippi, and Entergy New Orleans. Effective January 1, 2025, Entergy Louisiana divested all of its 14% share of capacity and energy from Grand Gulf and all of the capacity and energy from Grand Gulf that it purchases from Entergy Arkansas (approximately 2.43%) to Entergy Mississippi. This divestiture is being effectuated initially under a designated PPA between Entergy Louisiana and Entergy Mississippi, effective as of January 1, 2025. The five retail utility subsidiaries are each regulated by the FERC and by state utility commissions, or, in the case of Entergy New Orleans, the City Council. System Energy is regulated by the FERC because all of its transactions are at wholesale. The Utilit",
  "item7_clean": null,
  "item2_clean": null
}