{
  "source_file": "evrg-20250930.htm",
  "form_type": "10-Q",
  "item1_clean": null,
  "item7_clean": null,
  "item2_clean": "In 2024, Evergy Kansas Central and Evergy Missouri West requested predetermination from the KCC and a CCN from the MPSC, respectively, for their planned natural gas investments. In July 2025, the KCC approved a non-unanimous partial settlement agreement regarding Evergy Kansas Central's investments in its planned natural gas plants. In July 2025, the MPSC approved a non-unanimous stipulation and agreement regarding Evergy Missouri West's investments in its planned natural gas plants. See \"Applications for Predetermination\" and \"Requests for Certificate of Convenience and Necessity\" in Note 4 to the consolidated financial statements for information regarding Evergy Kansas Central's and Evergy Missouri West's applications for predetermination and CCN for their investments in these natural gas plants.\nRenewable Plant Investments\nEvergy Kansas Central intends to construct and own an approximately 159 MW solar generation facility to be located in Kansas called Kansas Sky. Kansas Sky is expected to begin operations by summer of 2027 and construction is subject to the granting by the KCC of predetermination with reasonably acceptable terms and other closing conditions. In July 2025, the KCC approved a unanimous partial settlement agreement for the Kansas Sky solar investment. See \"Applications for Predetermination\" in Note 4 to the consolidated financial statements for additional information regarding Evergy Kansas Central's application for predetermination for its investment in this renewable generating plant.\nIn 2024, Evergy Missouri West entered into agreements to own two solar generation facilities currently under development. The first facility, to be called Sunflower Sky, is a solar generation facility to be located in Kansas with an expected generating capacity of approximately 65 MW. In September 2025, Evergy Missouri West acquired the Sunflower Sky solar facility assets from the developer and will complete construction of the facility. The second facility, to be called Foxtrot, is a solar generation facility to be located in Missouri with an expected generating capacity of approximately 100 MW. In November 2025, Evergy Missouri West acquired the Foxtrot solar facility assets from the developer and will complete construction of the facility. The solar generation facilities are expected to begin operations by summer of 2027. In July 2025, the MPSC approved a unanimous stipulation and agreement regarding Evergy Missouri West's planned investments in the solar generation facilities. See \"Requests for Certificate of Convenience and Necessity\" in Note 4 to the consolidated financial statements for information regarding Evergy Missouri West's application for a CCN for its investment in these renewable generating plants.\nRegulatory Proceedings\nSee Note 4 to the consolidated financial statements for information regarding other regulatory proceedings.\nWolf Creek Refueling Outage\nWolf Creek's most recent refueling outage began in October 2025 and the unit is expected to return to service in November 2025.\nThe following table summarizes Evergy's net income and diluted EPS.\n(millions, except per share amounts)\nNet income attributable to Evergy, Inc.\nEarnings per common share, diluted\nNet income attributable to Evergy, Inc. increased for the three months ended September 30, 2025, compared to the same period in 2024, primarily due to new Evergy Missouri West retail rates effective in January 2025 and higher retail sales in the third quarter of 2025 driven by higher weather-normalized demand; partially offset by higher interest and depreciation expenses and lower proceeds from corporate-owned life insurance (COLI).\n\na $29.6 million decrease in revenue from the Kansas property tax rider, which is offset in taxes other than income tax.\nAdditionally, the increase in Evergy's gross margin (GAAP) was also impacted by:\na $23.3 million decrease in taxes other than income tax as further described below; and\na $5.0 million decrease in operating and maintenance expenses which are determined to be directly attributable to revenue producing activities; offset by\na $28.3 million increase in depreciation and amortization as further described below.\nOperating and Maintenance\nEvergy's operating and maintenance expense increased $19.1 million year to date September 30, 2025, compared to the same period in 2024, primarily driven by:\na $15.2 million increase in general and administrative labor and employee benefits expense, including higher medical claims; and\na $5.6 million increase in credit loss expense.\nDepreciation and Amortization\nEvergy's depreciation and amortization increased $8.0 million for the three months ended September 30, 2025 and $28.3 million year to date September 30, 2025, compared to the same periods in 2024, primarily due to capital additions.\nTaxes Other than Income Tax\nEvergy's taxes other than income tax decreased $12.1 million for the three months ended September 30, 2025 and $23.3 million year to date September 30, 2025, compared to the same periods in 2024, primarily driven by a 2024 over-collection of property taxes in Kansas and subsequent amortization of a refund to customers through the Kansas property tax rider, which is offset in utility gross margin; partially offset by higher assessed property tax values in 2025.\nOther Income (Expense), Net\nEvergy's other income, net for the three months ended September 30, 2024, became other expense, net for the three months ended September 30, 2025, resulting in a $7.4 million increase in net other expense, primarily driven by recording lower Evergy Kansas Central COLI benefits in the third quarter of 2025.\nEvergy's other income, net year to date September 30, 2024, became other expense, net year to date September 30, 2025, resulting in a $23.1 million increase in net other expense, primarily driven by:\n$29.0 million of unrealized losses and impairment losses from non-regulated investments in early-stage clean energy and energy solution companies; and\na $7.8 million increase primarily due to recording lower Evergy Kansas Central COLI benefits in 2025; partially offset by\n$11.6 million of income related to the sale of a commercial solar generation project completed in 2025.\nEvergy's interest expense increased $8.1 million for the three months ended September 30, 2025, compared to the same period in 2024, primarily driven by:\nan $18.3 million increase due to issuances of long-term debt; partially offset by\na $5.8 million decrease due to increases in carrying costs deferred to a regulatory asset in accordance with PISA due to a higher outstanding balance of qualified PISA additions; and\na $5.7 million decrease due to the repayment of long-term debt.\n\n$6.0 million for the three months ended September 30, 2025, compared to the same period in 2024, primarily driven by:\na $3.4 million increase primarily due to higher pre-tax income in the third quarter of 2025; and\na $2.4 million increase primarily due to lower recognition of amortization of excess deferred income taxes.\nEvergy's income tax expense increased $10.9 million year to date September 30, 2025, compared to the same period in 2024, primarily driven by an $8.3 million increase due to lower recognition of amortization of excess deferred income taxes.\nLIQUIDITY AND CAPITAL RESOURCES\nShort-Term Borrowings\nAs of September 30, 2025, Evergy had $1,263.5 million of available borrowing capacity under its master credit facility. The available borrowing capacity under the master credit facility consisted of $254.2 million for Evergy, Inc., $495.3 million for Evergy Kansas Central, $402.1 million for Evergy Metro and $111.9 million for Evergy Missouri West. The Evergy Companies' borrowing capacity under the master credit facility also supports their issuance of commercial paper. See Note 7 to the consolidated financial statements for more information regarding the master credit facility.\nAlong with cash flows from operations and receivable sales facilities, Evergy generally uses borrowings under its master credit facility and the issuance of commercial paper to meet its day-to-day cash flow requirements. Evergy may also utilize these short-term borrowings to repay maturing long-term debt until the long-term debt is able to be refinanced.\nSignificant Debt Issuances\nSee Note 8 to the consolidated financial statements for information regarding significant debt issuances.\n\nITEM 2. MANAGEMENT'S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS\nEVERGY, INC.\nEXECUTIVE SUMMARY\nEvergy is a public utility holding company incorporated in 2017 and headquartered in Kansas City, Missouri. Evergy operates primarily through the following wholly-owned direct subsidiaries listed below.\nEvergy Kansas Central is an integrated, regulated electric utility that provides electricity to customers in the state of Kansas. Evergy Kansas Central has one active wholly-owned subsidiary with significant operations, Evergy Kansas South.\nEvergy Metro is an integrated, regulated electric utility that provides electricity to customers in the states of Missouri and Kansas.\nEvergy Missouri West is an integrated, regulated electric utility that provides electricity to customers in the state of Missouri.\nEvergy Transmission Company owns 13.5% of Transource with the remaining 86.5% owned by AEP Transmission Holding Company, LLC, a subsidiary of AEP. Transource is focused on the development of competitive electric transmission projects. Evergy Transmission Company accounts for its investment in Transource under the equity method.\nEvergy Kansas Central also owns a 50% interest in Prairie Wind, which is a joint venture between Evergy Kansas Central and subsidiaries of AEP and Berkshire Hathaway Energy Company. Prairie Wind owns a 108-mile, 345 kV double-circuit transmission line that provides transmission service in the SPP. Evergy Kansas Central accounts for its investment in Prairie Wind under the equity method.\nEvergy Kansas Central, Evergy Kansas "
}