{
  "source_file": "evrg-20241231.htm",
  "form_type": "10-K",
  "item1_clean": "ITEM 1. BUSINESS\nInformation in other Items of this report as to which reference is made in this Item 1 is hereby incorporated by reference in this Item 1. The use of terms such as \"see\" or \"refer to\" shall be deemed to incorporate into this Item 1 the information to which such reference is made.\nEVERGY, INC.\nEvergy is a public utility holding company incorporated in 2017 and headquartered in Kansas City, Missouri. Evergy operates primarily through the following wholly-owned direct subsidiaries listed below.\nEvergy Kansas Central, Inc. (Evergy Kansas Central) is an integrated, regulated electric utility that provides electricity to customers in the state of Kansas. Evergy Kansas Central has one active wholly-owned subsidiary with significant operations, Evergy Kansas South, Inc. (Evergy Kansas South).\nEvergy Metro, Inc. (Evergy Metro) is an integrated, regulated electric utility that provides electricity to customers in the states of Missouri and Kansas.\nEvergy Missouri West, Inc. (Evergy Missouri West) is an integrated, regulated electric utility that provides electricity to customers in the state of Missouri.\nEvergy Transmission Company, LLC (Evergy Transmission Company) owns 13.5% of Transource Energy, LLC (Transource) with the remaining 86.5% owned by AEP Transmission Holding Company, LLC, a subsidiary of American Electric Power Company, Inc. (AEP). Transource is focused on the development of competitive electric transmission projects. Evergy Transmission Company accounts for its investment in Transource under the equity method.\nEvergy Kansas Central also owns a 50% interest in Prairie Wind Transmission, LLC (Prairie Wind), which is a joint venture between Evergy Kansas Central and subsidiaries of AEP and Berkshire Hathaway Energy Company. Prairie Wind owns a 108-mile, 345 kilovolt (kV) double-circuit transmission line that provides transmission service in the Southwest Power Pool, Inc. (SPP). Evergy Kansas Central accounts for its investment in Prairie Wind under the equity method.\nEvergy Kansas Central, Evergy Kansas South, Evergy Metro, and Evergy Missouri West conduct business in their respective service territories using the name Evergy. The Evergy Companies assess financial performance and allocate resources on a consolidated basis (i.e., operate in one segment). Evergy serves approximately 1.7 million customers located in Kansas and Missouri. Customers include approximately 1.5 million residences, 0.2 million commercial firms and 7,500 industrials, municipalities and other electric utilities. Evergy is significantly impacted by seasonality with approximately one-third of its retail revenues recorded in the third quarter.\nEvergy expects to continue operating its integrated utilities within the currently existing regulatory frameworks and is focused on enabling economic development across all of its service territories to strengthen the communities it serves and meet customer electric demand growth through the continued evolution of its generation, transmission and distribution systems. Evergy will remain focused on consistently delivering on its affordability, reliability and\n\nCurrent KCC rate orders do not contain an explicit allowed return on equity. The return on equity presented in this table reflects the current order in Kansas which stated an allowed return on equity to be utilized for purposes of the transmission delivery charge (TDC).\nCurrent MPSC rate orders do not contain an explicit allowed return on equity.\nEvergy expects its 2025 Kansas and Missouri jurisdictional retail revenues to be approximately 60% and 40%, respectively, based on historical averages of Evergy Kansas Central's, Evergy Metro's and Evergy Missouri West's total retail revenues.\nSee Item 7, MD&A, Critical Accounting Policies section, and Note 4 to the consolidated financial statements for additional information concerning regulatory matters.\nMissouri and Kansas continue to operate on the fully integrated and regulated retail utility model. As a result, the Evergy Companies do not compete with others to supply and deliver electricity in their franchised service territories in exchange for agreeing to have their terms of service regulated by state regulatory bodies. If Missouri or Kansas were to pass and implement legislation authorizing or mandating retail choice, Evergy may no longer be able to apply regulated utility accounting principles to deregulated portions of its operations, which may require a surcharge to recover certain costs from legacy customers or could lead to a write-off of certain regulatory assets and liabilities.\nEvergy competes in the wholesale market to sell power in circumstances when the power it generates is not required for retail customers in its service territory. This competition primarily occurs within the Southwest Power Pool, Inc. (SPP) Integrated Marketplace, in which Evergy Kansas Central, Evergy Metro and Evergy Missouri West are participants. This marketplace determines which generating units among market participants should run, within the operating constraints of a unit, at any given time for maximum regional cost-effectiveness.\nThe SPP Integrated Marketplace is similar to other regional transmission organization (RTO) or Independent System Operator (ISO) markets currently operating in other regions of the United States.\nEvergy has approximately 15,800 megawatts (MWs) of owned generating capacity and renewable power purchase agreements. Evergy's owned generation and power purchases from others, as a percentage of total megawatt hours (MWhs) generated and purchased, was approximately 60% and 40%, respectively, over the last three years. About 60% of Evergy's purchased power was purchased under long-term renewable purchased power contracts over the last three years. Evergy purchases power to meet its customers' needs, to satisfy firm power commitments or to meet renewable energy standards. Management believes Evergy will be able to meet its future power purchase needs due to the coordination of planning and operations in the SPP region and existing power purchase agreements; however, price and availability of power purchases may be impacted during periods of high demand or reduced supply.\nEvergy's total capacity by fuel type, including both owned generating capacity and power purchase agreements, is detailed in the table below.\nEstimated 2025 MW Capacity\nPercent of Total Capacity\nSolar and landfill gas\nMWs are based on nameplate capacity of the wind facility. Includes owned generating capacity of 778 MWs and long-term power purchase agreements of approximately 3,747 MWs of wind generation that expire from 2028 through 2048. See Item 2, Properties, for additional information.\n\nChief People Officer at J.E. Dunn Construction Company (2017-2021), as Vice President People Strategy / HR Business Partner of Walmart Corporation (2016-2017), as Vice President HR Business Partner Operations at DIRECTV, Inc. (2012-2015), and in various roles of increasing responsibility, including as Vice President, with Sprint Corporation (1997-2012; 2015-2016).\nMs. Humphrey was appointed Senior Vice President, General Counsel and Corporate Secretary of Evergy, Inc. in June 2018. Ms. Humphrey previously served as Senior Vice President - Corporate Services and General Counsel of Great Plains Energy, Evergy Metro and Evergy Missouri West (2016-2018). She previously served as General Counsel (2010-2016) and Senior Vice President - Human Resources of Great Plains Energy, Evergy Metro and Evergy Missouri West (2012-2016). She served as Vice President - Human Resources of Great Plains Energy, Evergy Metro and Evergy Missouri West (2010-2012). She was Senior Director of Human Resources and Interim General Counsel of Great Plains Energy, Evergy Metro and Evergy Missouri West (2010) and Managing Attorney of Evergy Metro (2007-2010).\nMr. King was appointed Senior Vice President and Chief Technology Officer of Evergy, Inc. in February 2020. He previously served as Senior Vice President, Information Technology and Chief Information Officer (2019) and Vice President, Information Technology and Chief Information Officer (2018-2019) of Evergy, Inc. Prior to that, he served as Vice President - Information Technology (2013-2018), as Senior Director of Information Technology Applications and Delivery (2013) and Director of Information Technology Applications (2011-2013) of Evergy Metro and Evergy Missouri West. Mr. King also served in various roles, including leadership roles, with Dish Network, CenturyLink, Sprint and Accenture.\nEvergy Kansas Central, Inc.\nEvergy Kansas Central, a Kansas corporation incorporated in 1924 and headquartered in Topeka, Kansas, is an integrated, regulated electric utility that engages in the generation, transmission, distribution and sale of electricity. Evergy Kansas Central serves approximately 744,600 customers located in central and eastern Kansas. Customers include approximately 645,300 residences, 94,100 commercial firms, and 5,200 industrials, municipalities and other electric utilities. Evergy Kansas Central's retail revenues averaged approximately 75% of its total operating revenues over the last three years. Wholesale firm power, bulk power sales, transmission and miscellaneous electric revenues accounted for the remainder of Evergy Kansas Central's revenues. Evergy Kansas Central is significantly impacted by seasonality with approximately one-third of its retail revenues recorded in the third quarter.\nEvergy Metro, a Missouri corporation incorporated in 1922 and headquartered in Kansas City, Missouri, is an integrated, regulated electric utility that engages in the generation, transmission, distribution and sale of electricity. Evergy Metro serves approximately 586,500 customers located in western Missouri and eastern Kansas. Customers include approximately 519,700 residences, 65,000 commercial firms, and 1,800 industrials, municipalities and other electric utilities. Evergy Metro's retail revenues averaged approximately 86% of its total operating revenues over the last three years. Wholesale firm power, bulk power sales and miscellaneous electric revenues accounted for the remainder of Evergy Metro's revenues. Evergy Metro is significantly impacted by seasonality with approximately one-third of its retail revenues recorded in the third quarter. Missouri and Kansas jurisdictional retail revenues for Evergy Metro averaged approximately 55% and 45%, respectively, of total retail revenues over the last three years.\n\nprincipal supply region of low-sulfur coal, and with local suppliers. The coal to be provided under these contracts is expected to satisfy approximately 65%, 45% and 35% of the projected coal requirements for 2025, 2026 and 2027, respectively. The remainder of the coal requirements is expected to be fulfilled through entering into additional contracts or spot market purchases.\nEvergy Kansas Central, Evergy Metro and Evergy Missouri West have also entered into rail transportation contracts with various railroads to transport coal from the PRB and local suppliers to their generating units. The transportation services to be provided under these contracts are expected to satisfy all of the projected transportation requirements for 2025 and 60% and 20% of the projected transportation requirements for 2026 and 2027, respectively. The contract rates adjust for changes in railroad costs.\nEvergy Kansas South and Evergy Metro each owns 47% of Wolf Creek, which is Evergy's only nuclear generating unit. Wolf Creek purchases uranium and has it processed for use as fuel in its reactor. This process involves conversion of uranium concentrates to uranium hexafluoride, enrichment of uranium hexafluoride and fabrication of nuclear fuel assemblies. The owners of Wolf Creek have on hand or under contract all the uranium, uranium enrichment and conversion services needed to operate Wolf Creek through the first quarter of 2030. The owners also have under contract ",
  "item7_clean": "See Note 4 to the consolidated financial statements for information regarding Evergy Kansas Central's and Evergy Missouri West's applications for predetermination and CCN, respectively, for their investments in these renewable generating plants.\nRegulatory Proceedings\nSee Note 4 to the consolidated financial statements for information regarding other regulatory proceedings.\nWolf Creek Refueling Outage and Fuel Supply\nWolf Creek's most recent refueling outage began in March 2024 and the unit returned to service in May 2024. Wolf Creek's next refueling outage is planned to begin in the fourth quarter of 2025.\nIn May 2024, President Biden signed into law the Prohibiting Russian Uranium Imports Act, which limits the importation of uranium from the Russian Federation. The Evergy Companies have a Russian-sourced contract beginning in 2025 to obtain nuclear fuel and have taken mitigating measures to minimize the impact of the Prohibiting Russian Uranium Imports Act to their supply chain. The Evergy Companies do not expect a material impact to their supply chain or financial results. See Part I, Item 1, Business - Fuel - Nuclear Fuel for additional information regarding Evergy's purchases of nuclear fuel.\nThe following table summarizes Evergy's net income and diluted EPS.\n(millions, except per share amounts)\nNet income attributable to Evergy, Inc.\nEarnings per common share, diluted\nNet income attributable to Evergy, Inc. increased in 2024, compared to the same period in 2023, primarily due to new Evergy Kansas Central retail rates effective in December 2023, the recognition of a $96.5 million regulatory liability in the third quarter of 2023 for future refund of amounts of revenues previously collected from customers related to COLI rate credits, higher transmission revenues and lower pension non-service costs; partially offset by higher taxes other than income tax, depreciation, interest, income tax and operating and maintenance expense and lower investment earnings in 2024.\nDiluted EPS increased in 2024, compared to the same period in 2023, primarily due to the increase in net income attributable to Evergy, Inc. discussed above.\nFor additional information regarding the change in net income, refer to the Evergy Results of Operations section within this MD&A.\nEvergy Utility Gross Margin (non-GAAP)\nUtility gross margin (non-GAAP) is a financial measure that is not calculated in accordance with GAAP. Utility gross margin (non-GAAP), as used by the Evergy Companies, is defined as operating revenues less fuel and purchased power costs and amounts billed by the SPP for network transmission costs. Expenses for fuel and purchased power costs, offset by wholesale sales margin, are subject to recovery through cost adjustment mechanisms. As a result, changes in fuel and purchased power costs are offset in operating revenues with minimal impact on net income. In addition, SPP network transmission costs fluctuate primarily due to investments by SPP members for upgrades to the transmission grid within the SPP RTO. As with fuel and purchased power costs, changes in SPP network transmission costs are mostly reflected in the prices charged to customers with minimal impact on net income. The Evergy Companies' definition of utility gross margin (non-GAAP) may differ from similar terms used by other companies.\nUtility gross margin (non-GAAP) is intended to aid an investor's overall understanding of results. Management believes that utility gross margin (non-GAAP) provides a meaningful basis for evaluating the Evergy Companies'\n\nAdditionally, the decrease in Evergy Metro's gross margin (GAAP) was also impacted by:\na $16.0 million decrease in depreciation and amortization as further described below; partially offset by\na $14.6 million increase in taxes other than income tax as further described below; and\na $1.2 million increase in operating and maintenance expenses which are determined to be directly attributable to revenue producing activities primarily driven by a $10.8 million increase in transmission and distribution operating and maintenance expense; partially offset by a $9.6 million decrease in operating and maintenance expense at generating facilities as further described below.\nEvergy Metro Operating and Maintenance\nEvergy Metro's operating and maintenance expense decreased $2.4 million in 2024, compared to 2023, primarily driven by:\na $9.6 million decrease in operating and maintenance expense at generating facilities primarily driven by:\na $7.6 million decrease at fossil-fuel generating units driven by maintenance outages at Iatan Station and Hawthorn Station in 2023; and\na $3.2 million decrease at Wolf Creek primarily driven by a $1.7 million decrease in non-labor expense primarily due to lower contractor costs and a $1.5 million decrease in labor expense including an increase in labor capitalization as a result of the refueling outage completed in May 2024.\na $3.6 million decrease in administrative and general expense driven by higher costs billed primarily to Evergy Missouri West for common use assets related to facilities and software assets; partially offset by\na $10.8 million increase in transmission and distribution operating and maintenance expenses driven by a $6.3 million increase in non-labor expense primarily due to higher costs billed for common use assets primarily from Evergy Kansas Central to Evergy Metro, higher contractor costs and a $1.8 million increase in vegetation management costs; and a $4.5 million increase in labor expense primarily due to a decrease in labor capitalization driven by lower capitalization activity related to the installation of transformers and meters in 2024.\nEvergy Metro Depreciation and Amortization\nEvergy Metro's depreciation and amortization expense decreased $16.0 million in 2024, compared to 2023, primarily due to a change in depreciation rates as a result of Evergy Metro's 2023 rate case effective in December 2023.\nEvergy Metro Taxes Other than Income Tax\nEvergy Metro's taxes other than income tax increased $14.6 million in 2024, compared to 2023, primarily driven by the rebasing of property taxes as a result of Evergy Metro's 2023 rate case effective in December 2023.\nEvergy Metro Other Income (Expense), Net\nEvergy Metro's other expense, net in 2023 became other income, net in 2024 as a result of an $18.9 million increase in net other income items, primarily driven by:\na $14.7 million decrease in pension non-service costs primarily due to the resetting of pension expense in retail rates as a result of Evergy Metro's Kansas 2023 rate case effective in December 2023; and\na $2.7 million increase in equity AFUDC primarily driven by higher construction work in progress balances and lower short-term debt balances in 2024.\nEvergy Metro Interest Expense\nEvergy Metro's interest expense increased $11.3 million in 2024, compared to 2023, primarily driven by:\na $19.0 million increase due to issuances of long-term debt; partially offset by\n\noperations across periods because utility gross margin (non-GAAP) excludes the revenue effect of fluctuations in fuel and purchased power costs and SPP network transmission costs. Utility gross margin (non-GAAP) is used internally to measure performance against budget and in reports for management and the Evergy Board. Utility gross margin (non-GAAP) should be viewed as a supplement to, and not a substitute for, gross margin, which is the most directly comparable financial measure prepared in accordance with GAAP. Gross margin under GAAP is defined as the excess of sales over cost of goods sold.\nUtility gross margin (non-GAAP) differs from the GAAP definition of gross margin due to the exclusion of operating and maintenance expenses determined to be directly attributable to revenue-producing activities, depreciation and amortization and taxes other than income tax. See the Evergy Companies' Results of Operations for a reconciliation of utility gross margin (non-GAAP) to gross margin, the most comparable GAAP measure.\nAdjusted Earnings (non-GAAP) and Adjusted EPS (non-GAAP)\nManagement believes that adjusted earnings (non-GAAP) and adjusted EPS (non-GAAP) are representative measures of Evergy's recurring earnings, assists in the comparability of results and is consistent with how management reviews performance.\nEvergy's adjusted earnings (non-GAAP) and adjusted EPS (non-GAAP) for 2024 were $877.9 million or $3.81 per share. For 2023, Evergy's adjusted earnings (non-GAAP) and adjusted EPS (non-GAAP) were $815.6 million or $3.54 per share.\nIn addition to net income attributable to Evergy, Inc. and diluted EPS, Evergy's management uses adjusted earnings (non-GAAP) and adjusted EPS (non-GAAP) to evaluate earnings and EPS without:\nthe mark-to-market impacts of economic hedges related to Evergy Kansas Central's 8% ownership share of JEC;\nthe costs resulting from non-regulated energy marketing margins from the February 2021 winter weather event;\nthe second quarter 2023 recognition of a regulatory liability for the refund to customers of revenues previously collected since October 2019 for costs related to an electric subdivision rebate program to be refunded to customers in accordance with a June 2020 KCC order;\nthe recognition of a regulatory liability for future refund of amounts of revenues previously collected from customers related to COLI rate credits in accordance with a September 2023 KCC rate case unanimous settlement agreement; and\nthe costs incurred in the fourth quarter 2024 resulting from the realignment of the executive operations corporate structure.\nAdjusted earnings (non-GAAP) and adjusted EPS (non-GAAP) are intended to aid an investor's overall understanding of results. Management believes that adjusted earnings (non-GAAP) provides a meaningful basis for evaluating Evergy's operations across periods because it excludes certain items that management does not believe are indicative of Evergy's ongoing perf\normance or that can create period to period earnings volatility.\njusted earnings (non-GAAP) and adjusted EPS (non-GAAP) are used internally to measure performance against budget and in reports for management and the Evergy Board. Adjusted earnings (non-GAAP) and adjusted EPS (non-GAAP) are financial measures that are not calculated in accordance with GAAP and may not be comparable to other companies' presentations or more useful than the GAAP information provided elsewhere in this report.\n\nTotal electric retail sales\nEvergy's gross margin (GAAP) increased $178.3 million in 2024, compared to 2023, and Evergy's utility gross margin (non-GAAP) increased $285.7 million in 2024, compared to 2023, both measures were driven by:\na $119.6 million net increase from new retail rates in Kansas effective in December 2023 consisting of $141.8 million from higher Evergy Kansas Central retail rates, partially offset by $22.2 million from lower Evergy Metro retail rates;\na $96.5 million increase due to the third quarter 2023 recognition of a regulatory liability at Evergy Kansas Central for the refund to customers of revenues previously collected from customers related to COLI rate credits;\na $79.4 million increase in transmission revenue primarily due to updated transmission costs reflected in Evergy Kansas Central's FERC transmission formula rate (TFR) effective in January 2024;\na $21.6 million increase due to Evergy Missouri West's recovery of extraordinary fuel and purchased power costs incurred as part of the February 2021 winter weather event through a securitized utility tariff charge effective in February 2024;\na $6.1 million increase due to lower mark-to-market losses in 2024 related to forward contracts for natural gas and electricity entered into as economic hedges against fuel price volatility related to Evergy Kansas Central's 8% ownership share of JEC; and\na $4.4 million increase primarily due to higher retail sales driven by higher weather-normalized residential and commercial demand, partially offset by unfavorable weather (cooling degree days decreased by 5% and heating degree days decreased by 4%); partially offset by\na $30.8 million decrease related to non-regulated sales in 2023 related to Evergy Kansas Central's 8% ownership share of JEC, which is included in rate base in 2024 as a result of Evergy Kansas Central's 2023 rate case; and\nan $11.1 million decrease as a result of recording a reduction in the second quarter of 2023 to Evergy Metro's Earnings Review and Sharing Plan (ERSP) refund obligation to customers.\nAdditionally, the increase in Evergy's gross margin (GAAP) was also impacted by:\na $37.5 million increase in depreciation and amortization as further described below;\na $46.0 million increase in taxes other than income taxes as further described below; and\na $23.9 million increase in operating and maintenance expenses which are determined to be directly attributable to revenue producing activities primarily driven by a $16.7 million increase in transmission and distribution operating and maintenance expense and a $7.3 million increase in operating and maintenance expense at generating facilities as further described below.\n\nOperating and Maintenance\nEvergy's operating and maintenance expense increased $16.6 million in 2024, compared to 2023, primarily driven by:\na $16.6 million increase in transmission and distribution operating and maintenance expenses primarily driven by a $10.2 million increase in labor expense primarily due to a decrease in labor capitalization driven by lower capitalization activity related to the installation of transformers and meters in 2024 and higher employee headcount and a $6.5 million increase in non-labor expense including a $2.8 million increase in vegetation management costs; and\na $7.3 million increase in operating and maintenance expense at generating facilities primarily driven by:\na $7.4 million increase at fossil-fuel generating units primarily due to a $15.4 million increase at Evergy Kansas Central driven by major maintenance outages at JEC and Lawrence Energy Center (LEC) in 2024, partially offset by a $7.6 million decrease at Evergy Metro driven by maintenance outages at Iatan Station and Hawthorn Station in 2023; and\na $3.2 million increase at renewable generating units primarily at Evergy Kansas Central driven by the acquisition of Persimmon Creek Wind Farm (Persimmon Creek) in the second quarter of 2023; partially offset by\na $6.4 million decrease at Wolf Creek at Evergy Kansas Central and Evergy Metro primarily driven by a $3.4 million decrease in non-labor expense primarily due to lower contractor costs and a $3.0 million decrease in labor expense including an increase in labor capitalization as a result of the refueling outage completed in May 2024; partially offset by\na $7.3 million decrease in general and administrative expense primarily driven by a $9.5 million decrease at Evergy Kansas Central due to the amortization of Evergy Kansas Central's refunds to customers of storm costs previously collected in rates in accordance with Evergy Kansas Central's 2023 rate case.\nDepreciation and Amortization\nEvergy's depreciation and amortization increased $37.5 million in 2024, compared to 2023, primarily driven by:\na $29.8 million increase primarily due to a change in depreciation rates as a result of Evergy Kansas Central's and Evergy Metro's 2023 rate cases effective in December 2023; and\na $7.7 million increase primarily due to capital additions.\nTaxes Other Than Income Tax\nEvergy's taxes other than income tax increased $46.0 million in 2024, compared to 2023, primarily driven by increases at Evergy Kansas Central and Evergy Metro primarily due to the rebasing of property taxes as a result of Evergy Kansas Central's and Evergy Metro's 2023 rate cases effective in December 2023.\nOther Income (Expense), Net\nEvergy's other expense, net in 2023 became other income, net in 2024 as a result of a $7.9 million increase in net other income items, primarily driven by:\na $34.6 mil",
  "item2_clean": null
}