{
  "source_file": "exe-20241231.htm",
  "form_type": "10-K",
  "item1_clean": "The tables below set forth information as of December 31, 2024, with respect to our estimated proved reserves, the associated estimated future net revenue, the present value of estimated future net revenue and the standardized measure of discounted future net cash flows. None of the estimated future net revenue, PV-10 nor the standardized measure are intended to represent the current market value of the estimated natural gas, oil and NGL reserves we own. All of our estimated reserves are located within the United States.\nNGL\nStandardized measure\nEstimated future net revenue\nPresent value of estimated future net revenue (PV-10)\n___________________________________________\n(a) Haynesville, Northeast Appalachia and Southwest Appalachia accounted for approximately 19%, 39% and 42%, respectively, of our estimated proved reserves by volume as of December 31, 2024.\n(b) Estimated future net revenue represents the estimated future revenue to be generated from the production of proved reserves, net of estimated production and future development costs, using pricing differentials and costs under existing economic conditions as of December 31, 2024, and assuming commodity prices as set forth below. For the purpose of determining prices used in our reserve reports, we used the unweighted arithmetic average of the prices on the first day of each month within the 12-month period ended December 31, 2024. The price used in our PV-10 measure was $2.13 per Mcf of natural gas and $75.48 per Bbl of oil and NGL, before basis differential adjustments. These prices should not be interpreted as a prediction of future prices, nor do they reflect the value of our commodity derivative instruments in place as of December 31, 2024. The amounts shown do not give effect to non-property-related expenses, such as corporate general and administrative expenses and debt service, or to depreciation, depletion and amortization. The present value of estimated future net revenue typically differs from the standardized measure because the former does not include the effects of estimated future income tax expense of $36 million as of December 31, 2024.\nManagement uses PV-10, which is calculated without deducting estimated future income tax expenses, as a measure of the value of the Company's current proved reserves and to compare relative values among peer companies. We also understand that securities analysts and rating agencies use this measure in similar ways. While estimated future net revenue and the present value thereof are based on prices, costs and discount factors which may be consistent from company to company, the standardized measure of discounted future net cash flows is dependent on the unique tax situation of each individual company. PV-10, a non-GAAP measure, should not be considered in isolation or as a substitute for the standardized measure of discounted future net cash flows or any other measure of a company's financial or operating performance presented in accordance with GAAP.\nA comparison of the standardized measure of discounted future net cash flows to PV-10 is presented above. Neither PV-10 nor the standardized measure of discounted future net cash flows purport to represent the fair value of our proved natural gas and oil reserves.\nAs of December 31, 2024, our proved reserve estimates included 3,842 Bcfe of reserves classified as proved undeveloped, compared to 3,325 Bcfe as of December 31, 2023. Presented below is a summary of changes in our proved undeveloped reserves for 2024:\nProved undeveloped reserves, beginning of period\nExtensions and discoveries\nRevisions of previous estimates\nConversion to proved developed reserves\nPurchase of reserves-in-place\nSales of reserves-in-place\nProved undeveloped reserves, end of period\nAs of December 31, 2024, all PUDs were planned to be developed within five years of original recording. In 2024, we invested approximately $395 million to convert 1,050 Bcfe of PUDs to proved developed reserves. We added 55 Bcfe of PUD reserves through extensions and discoveries due to new PUDs added in Northeast Appalachia. We had a net downward revision in previous estimates of 1,625 Bcfe. The net downward revision primarily consisted of 2,022 Bcfe of downward revisions due to lower natural gas, oil and NGL prices in 2024, and a downward revision of 183 Bcfe due to development plan changes in Northeast Appalachia and Haynesville, partially offset by 462 Bcfe of positive revisions on existing PUD locations primarily related to increased production forecasts, increased ownership interest in the locations, and improved differentials in the Haynesville, as well as 118 Bcfe of PUDs added in areas previously categorized as proved in Northeast Appalachia and Haynesville. We added 3,137 Bcfe of PUDs through purchase of reserves-in-place, primarily as a result of the Southwestern Merger.\nThe future net revenue attributable to our estimated PUDs was $3.0 billion, and the present value was $1.0 billion as of December 31, 2024. These values were calculated assuming that we will expend approximately $1.8 billion to develop these reserves ($739 million in 2025, $546 million in 2026, $530 million in 2027, $8 million in 2028 and $7 million in 2029). The amount and timing of these expenditures will depend on a number of factors, including actual drilling results, service costs, commodity prices and the availability of capital. Our developmental drilling schedules are subject to revision and reprioritization throughout the year resulting from unknowable factors such as commodity prices, unexpected developmental drilling results, title issues and infrastructure availability or constraints.\nAs of December 31, 2024, approximately 1,606 Bcfe, or 8%, of our total proved reserves were developed and non-producing, primarily due to our deferred turn in line program.\nOur ownership interest used for calculating proved reserves and the associated estimated future net revenue assumes maximum participation by other parties to our farm-out and participation agreements.\nOur estimated proved reserves and the standardized measure of discounted future net cash flows of the proved reserves as of December 31, 2024, 2023 and 2022, along with the changes in quantities and standardized measure of the reserves for each of the three years then ended, are shown in\nSupplemental Disclosures About Natural Gas, Oil and NGL Producing Activities\nof this report. No estimates of proved reserves comparable to those included herein have been included in reports to any federal agency other than the SEC.\nThere are numerous uncertainties inherent in estimating quantities of proved reserves and in projecting future rates of production and timing of development expenditures, including many factors beyond our control. The reserve data represents only estimates. Reserve engineering is a subjective process of estimating underground accumulations of natural gas and oil that cannot be measured exactly, and the accuracy of any reserve estimate is a function of the quality of available data and of engineering and geological interpretation and judgment. As a result, estimates made by different engineers often vary. Accordingly, reserve estimates often differ from the actual quantities of natural gas, oil and NGL that are ultimately recovered. Furthermore, the estimated future net revenue from proved reserves and the associated present value are based upon certain assumptions, including prices, future production levels and costs that may not prove correct. Future prices and costs may be materially higher or\nlower than the prices and costs as of the date of any estimate. See\nSupplemental Disclosures About Natural Gas, Oil and NGL Producing Activities\nof this report for further discussion of our reserve quantities.\nWe engaged Netherland, Sewell & Associates, Inc., a third-party engineering firm, to audit our total proved reserves as of December 31, 2024. A copy of the audit letter issued by the engineering firm is filed with this report as Exhibit 99.1. The qualifications of the technical persons at the firm primarily responsible for overseeing the audit of our reserve estimates are set forth below.\nOver 43 combined years of practical experience in the estimation and evaluation of reserves;\nLicensed Professional Engineer in the State of Texas and Bachelor of Science degree in Chemical Engineering;\nLicensed Professional Geoscientist in the State of Texas and Bachelor of Science and Master of Science degrees in Geology.\nOur Corporate Reserves Department prepared our estimated proved reserves as of December 31, 2024 disclosed in this report. Those estimates were established utilizing standard geological and engineering technologies, which are generally accepted by the petroleum industry and were based upon the best available production, engineering and geologic data. These technologies, including computational methods, provide reasonable certainty in our reserves estimation and include technologies and inputs such as drilling results and well performance, decline curve analysis of wells in analogous reservoirs, material balance, volumetric calculation, statistical analysis, well logs, geologic maps and seismic data.\nOur Manager – Corporate Reserves, who is in charge of our Corporate Reserves Department, is the technical person primarily responsible for overseeing the preparation of our reserve estimates and for coordinating any reserves work conducted by a third-party engineering firm. His qualifications include the following:\nOver 17 years of practical experience in the oil and gas industry, with over 15 years in reservoir engineering;\nLicensed Professional Engineer (Petroleum) in the State of Oklahoma;\nMember in good standing of the Society of Petroleum Evaluation Engineers;\nBachelor of Science in Mechanical Engineering; and\nMasters of Business Administration.\nWe ensure that the key members of our Corporate Reserves Department have appropriate technical qualifications to oversee the preparation of reserve estimates. Our engineering technicians have a minimum of a four-year degree in mathematics, economics, finance or other technical/business/science field. We maintain a continuous education program for our engineers and technicians on new technologies and industry advancements as well as refresher training on basic skills and analytical techniques.\nWe maintain internal controls such as the following to ensure the reliability of reserves estimations:\nWe follow comprehensive SEC-compliant internal policies to estimate and report proved reserves. Reserve estimates are made by experienced reservoir engineers or under their direct supervision. All material changes are reviewed and approved by the Manager – Corporate Reserves.\nThe Corporate Reserves Department reviews our proved reserves at the close of each quarter.\nEach quarter, Reservoir Managers, the Manager – Corporate Reserves, the Vice Presidents of each operating area and the Vice President of Corporate and Strategic Planning review all significant reserves changes and all new proved undeveloped reserves additions.\nThe Corporate Reserves Department reports independently of our operations.\nThe five-year PUD development plan is reviewed and approved annually by the Manager – Corporate Reserves and the Vice President of Corporate and Strategic Planning.\nThe following table sets forth our gross and net developed and undeveloped natural gas and oil leasehold and fee mineral acreage as of December 31, 2024. Gross acres are the total number of acres in which we own a working interest. Net acres refer to gross acres multiplied by our fractional working interest.\nUndeveloped Leasehold\nNortheast Appalachia\nSouthwest Appalachia\n___________________________________________\n(a) Includes 1.2 million net acres retained in the 2016 divestiture of our Devonian Shale assets, in which we retained all rights below the base of the Kope formation.\nMost of our leases have a three- to five-year primary term",
  "item7_clean": "Management’s Discussion and Analysis of Financial Condition and Results of Operations\nThis Management’s Discussion and Analysis of Financial Condition and Results of Operations is intended to provide a reader of our financial statements with management’s perspective on our financial condition, liquidity, results of operations and certain other factors that may affect our future results. This information is intended to provide investors with an understanding of our past performance, current financial condition and outlook for the future and should be read in conjunction with",
  "item2_clean": null
}