{
  "source_file": "expd-20241231.htm",
  "form_type": "10-K",
  "item1_clean": null,
  "item7_clean": "Historically, our business has not been adversely affected by inflation. Beginning in 2021 and continuing through 2024, many countries including the United States experienced increasing levels of inflation. As a result, our business continues to experience rising labor costs, service provider rate increases, higher rent and occupancy and other expenses. While buy rates for freight transportation capacity started declining in the second half of 2022, purchase prices for labor and other expenditures have continued to increase. Due to the high degree of competition in the marketplace we may not be able to increase our prices to our customers to offset this inflationary pressure, which could lead to an erosion in our margins and operating income in the future. Conversely, raising our prices to keep pace with inflationary pressure may result in a decrease in volume and customer demand for our services. As we are not required to purchase or maintain extensive property and equipment and have not otherwise incurred substantial interest rate-sensitive indebtedness, we currently have limited direct exposure to increased costs resulting from increases in interest rates.\n\nOur operating units share revenue using the same arms-length pricing methodologies that we use when our offices transact business with independent agents. Certain costs are allocated among the segments based on the relative value of the underlying services, which can include allocation based on actual costs incurred or estimated cost plus a profit margin. Our strategy closely links compensation with operating unit profitability, which includes shared revenues and allocated costs. Therefore, individual success is closely linked to cooperation with other operating units within our network. The mix of services varies by segment based primarily on the import or export orientation of local operations in each of our regions. North Asia is our largest export-oriented region and accoun\ned for 28% of revenues, 33% of d\nectly related cost of transportation and other expenses and 23% of operating income for the year ended December 31, 2024.\n\nOrder management revenues increased 29% and expenses increased 32% in 2024, due to higher volumes from new and existing customers. Direct ocean freight forwarding revenues decreased 2% while expenses remained flat in 2024, principally due to lower volumes and rates for ancillary services.\n\nSouth Asia revenues and expenses increased 66% and 82%, respectively, in 2024 as compared with 2023 due to a 40% increase in tonnage and significant increases in average sell and buy rates. This was driven by elevated demand for airfreight as a result of manufacturing relocations into the region and shippers shifting to airfreight due to the conflicts in the Middle East. North Asia revenues and expenses increased 16% and 17%, respectively, in 2024 as compared with 2023 due to a 9% increase in tonnage driven by demand in technology sectors and higher average sell and buy rates driven by high demand from international direct e-commerce. Average sell and buy rates decreased on exports out of North America and Europe due to excess available capacity relative to soft demand.\n\nAirfreight services revenues and expenses increased 13% and 16%, respectively, in 2024, as compared with 2023, due to a 12% increase in tonnage and 2% and 5% increase in average sell and buy rates, respectively. Tonnage increased in all regions, with the largest increase coming from exports out of South Asia and North Asia\nAverage sell rates increased in South Asia, North Asia and MAIR as a result of higher buy rates while they decreased in North America and Europe as a result of lower buy rates. Tonnage increased in all regions as a result of increased market demand driven by the technology sector compared to a soft 2023.\n\nWe operate in over 60 countries in the competitive global logistics industry and our activities are closely tied to the global economy. International trade is influenced by many factors, including economic and political conditions in the United States and abroad, currency exchange rates, laws and policies relating to tariffs, trade restrictions, foreign investment, and taxation. Periodically, governments consider various changes to tariffs and impose trade restrictions and accords. The United States has imposed increased tariffs on China, and is considering imposing increased tariffs on imports from Canada, Mexico, and other countries. These measures will likely face retaliatory tariffs from these countries. The potential for further tariff increases and trade restrictions remains high, creating an unpredictable environment for international trade. Additionally, changes to import and export regulations may impact the flow of trade. We cannot predict how changes in tariffs, trade restrictions, and accords will affect our business. As governments impose import and export restrictions, shippers may adjust their sourcing patterns and potentially shift manufacturing to other countries over time. Doing business in foreign locations also subjects us to a variety of risks and considerations not normally encountered by domestic enterprises. In addition to being influenced by governmental policies and inter-governmental disputes concerning international trade, our business may also be negatively affected by political developments and changes in government personnel or policies in the United States and other countries, as well as economic turbulence, political unrest and security concerns in the nations and on the trade shipping lanes in which we conduct business and the future impact that these events may have on international trade, oil prices and security costs. We do not have employees, assets, or operations in Russia, Ukraine, Israel, the Gaza Strip or the West Bank. While limited, any shipment activity is conducted with independent agents in those countries in compliance with all applicable trade sanctions, laws and regulations. We have a branch and employees in Lebanon but no significant assets.\n\nOur ability to provide services to our customers is highly dependent on good working relationships with a variety of entities, including airlines; ocean carrier lines and ground transportation providers, as well as governmental agencies. We select and engage with best-in-class, compliance-focused, efficiently run, growth-oriented partners, based upon defined value elements and are intentional in our relationship and performance management activity, reinforcing success by awarding service providers who consistently achieve at the highest levels with additional business. We consider our current working relationships with these entities to be satisfactory. However, changes in the financial stability and operating capabilities and capacity of asset-based carriers, capacity allotments available from carriers, governmental regulation or deregulation efforts, modernization of the regulations governing customs brokerage, and/or changes in governmental restrictions, quota restrictions or trade accords could affect our business in unpredictable ways. When the market experiences seasonal peaks or any sort of disruption, the carriers often increase their pricing suddenly. This carrier behavior creates pricing volatility that could impact Expeditors' ability to maintain historical unitary profitability.\n\nOcean freight consolidation, direct ocean forwarding, and order management are the three basic services that constitute and are collectively referred to as ocean freight and ocean services. Ocean freight and ocean services revenues and expenses increased 33% and 44%, respectively, in 2024, as compared with 2023. The largest component of our ocean freight and ocean services revenue is derived from ocean freight consolidation, which represented 71% and 65% of ocean freight and ocean services revenue in 2024 and 2023, respectively.\n\nAs a customs broker, we make significant cash advances for a select group of our credit-worthy customers. These cash advances are for customer obligations such as the payment of duties and taxes to customs authorities in various countries throughout the world. Increases in duty rates could result in increases in the amounts we advance on behalf of our customers. Cash advances are a “pass through” and are not recorded as a component of revenue and expense. The billings of such advances to customers are accounted for as a direct increase in accounts receivable from the customer and a corresponding increase in accounts payable to governmental customs authorities. As a result of these “pass through” billings, the conventional Days Sales Outstanding or DSO calculation does not directly measure collection efficiency. For customers that meet certain criteria, we have agreed to extend payment terms beyond our customary terms. Management believes that it has established effective credit control procedures, and historically has experienced relatively insignificant collection problems.\n\nThe outcome of loss contingencies, including legal proceedings and claims and government investigations, brought against us are subject to significant uncertainty. An estimated loss from a contingency, including a legal or tax proceeding, claim, government investigation or audit, or a customer claim, is recorded by a charge to income if it is probable that an asset has been impaired, or a liability has been incurred and the amount of the loss can be reasonably estimated. Disclosure of a loss contingency is made if there is at least a reasonable possibility that a significant loss has been incurred. In determining whether a loss should be recorded, management evaluates several factors, including advice from outside legal counsel and qualified tax advisors, in order to estimate the likelihood of an unfavorable outcome and to make a reasonable estimate of the amount of loss or range of reasonably possible loss. Changes in these factors could have a material impact on our financial position, results of operations and operating cash flows for any particular quarter or year.\n\nWe derive our revenues by entering into agreements that are generally comprised of a single performance obligation, which is that freight is shipped for and received by our customer. Each performance obligation is comprised of one or more of the Company's services. We typically satisfy our performance obligations as services are rendered over time. A typical shipment would include services rendered at origin, such as pick-up and delivery to port, freight services from origin to destination port and destination services, such as customs clearance and final delivery. Our three principal services are the revenue categories presented in our financial statements: 1) airfreight services, 2) ocean freight and ocean services, and 3) customs brokerage and other services. The most significant drivers of changes in gross revenues and related transportation expenses are volume, sell rates and buy rates. Volume has a similar effect on the change in both gross revenues and related transportation expenses in each of our three primary sources of revenue.\n\nCustoms brokerage and other services revenues and expenses increased 2% and 1%, respectively, in 2024 as compared with 2023, primarily due to increases in customs clearances, import services and road freight from higher shipment volumes, principally in Europe and MAIR offset by decreases in warehousing and distribution primarily in North America.\n\nOur consolidated financial statements and accompanying notes are prepared in accordance with accounting principles generally accepted in the United States (U.S. GAAP). Preparing our consolidated financial statements requires management to make estimates and assumptions that affect the reported amounts of assets, liabilities and expenses. A summary of our significant accounting policies can be found in Note 1 to the consolidated financial statements in this report. Management believes that the nature of our business is such that there are few complex challenges in accounting for operations. While judgments and estimates are a necessary component of any system of accounting, the use of estimates is limited primarily to accrual of loss contingencies, accrual of various tax liabilities and contingencies, accrual of insurance liabilities for the portion of the related exposure that we have self-insured, and accounts receivable valuation.\n\nOur principal source of liquidity is cash and cash equivalents and cash generated from operating activities. Net cash provided by operating activities for the year ended December 31, 2024 was $723 million, as compared with $1,053 million for 2023. This $330 million decrease is primarily due to changes in working capital as we made investments to finance our business growth in the second half of 2024. At December 31, 2024, working capital was $1,593 million, including cash and cash equivalents of $1,148 million. Other than our recorded lease liabilities, we had no long-term obligations or debt at December 31, 2024. Management believes that our current cash position and operating cash flows will be sufficient to meet our capital and liquidity requirements for at least the next 12 months and thereafter for the foreseeable future, including meeting any contingent liabilities related to standby letters of credit and other obligations.\n\nOther overhead expenses increased 1% in 2024, as compared with 2023. The increase in 2024 is primarily due to higher rental and occupancy expenses, travel, and technology related expenses partially offset by a $24 million decrease in expenses related to indirect tax and other contingencies and lower depreciation expense.\n\nIn 2024 ocean freight consolidation revenues and expenses increased by 46% and 58% respectively, as compared with 2023, primarily due to 38% and 48% increases in average sell and buy rates, respectively, and a 7% increase in containers shipped. Average buy rates per container increased due to strong demand and longer transit times, congestion and capacity issues caused by the disruptions in the Red Sea. Importers front loaded shipments creating a peak in demand starting in June 2024 in anticipation of potential US East and Gulf Coast ports disruptions, concerns over tariffs and factoring in longer transit times. These conditions boosted volumes and caused sharp increases in buy rates in 2024. We expect the rate declines that started in the fourth quarter of 2024 to continue into at least the first half of 2025 as demand softens and capacity increases as additional vessels are delivered.\n\nSeasonal changes in demand, impact from disruptions in the ocean market due to security and port congestion concerns and variable demand for airfreight capacity from direct e-commerce business cause volatility in average buy rates on certain lanes. Additionally, continued uncertainty in the economy, geopolitical concerns, as well as potential inter-governmental trade disputes and tariff changes could negatively affect demand for airfreight services which could reduce our volumes and average sell rates. These conditions could result in decreases in our revenues, expenses and operating income. We are unable to predict how these uncertainties and any future disruptions will affect our operations or financial results prospectively.\n\nGlobal economic conditions and trade policies remain uncertain. Further, carriers are adding new vessels which will increase capacity. In addition, if safe passage through the Red Sea resumes, additional capacity will become available due to shorter transit times. These conditions could depress sell and buy rates. We expect that pricing volatility will continue as carriers adapt to fluctuations in fuel prices, new regulations, security risks and manage available capacity. As customers seek lower pricing and react to governmental trade policies and other regulations, this could result in decreases in our revenues and operating income.\n\nThe ",
  "item2_clean": null
}