{
  "source_file": "exr-20241231.htm",
  "form_type": "10-K",
  "item1_clean": "Extra Space Storage Inc. (“we,” “our,” “us” or the “Company”) is a fully integrated, self-administered and self-managed real estate investment trust (“REIT”) formed as a Maryland corporation on April 30, 2004. We closed our initial public offering (“IPO”) on August 17, 2004. Our common stock is traded on the New York Stock Exchange under the symbol “EXR.”\nWe were formed to continue the business of Extra Space Storage LLC and its subsidiaries, which had engaged in the self-storage business since 1977. These companies were reorganized after the consummation of our IPO and various formation transactions. Our executive management team and board of directors have extensive experience and ownership positions in the Company.\nSubstantially all of our business is conducted through Extra Space Storage LP (the “Operating Partnership”). Our primary assets are general partner and limited partner interests in the Operating Partnership. This structure is commonly referred to as an umbrella partnership REIT, or UPREIT. We have elected to be taxed as a REIT under the Internal Revenue Code of 1986, as amended (the “Internal Revenue Code”). To the extent we continue to qualify as a REIT, we will not be subject to U.S. federal tax, with certain exceptions, on our REIT taxable income that is distributed to our stockholders.\nOur principal offices are located at 2795 East Cottonwood Parkway, Suite 300, Salt Lake City, Utah 84121, telephone number (801) 365-4600.\nSelf-Storage Operations\nWe own, operate, manage, provide lending to, acquire, develop and redevelop self-storage properties (“stores”). We operate and manage our business by evaluating the operating performance of the properties for our entire portfolio which includes wholly-owned stores, stores in which we have a partial ownership interest and managed stores. Stores offer month-to-month rental of storage space for personal or business use.\nAs of December 31, 2024, we owned and/or operated 4,011 stores in 42 states, and Washington, D.C., comprising approximately 308.4 million square feet of net rentable space in approximately 2.8 million units.\nOur tenant reinsurance activities include the reinsurance of risks relating to the loss of goods stored by tenants in our stores. Our customers have the option of purchasing insurance from a non-affiliated insurance company to cover certain losses to their goods stored at our facilities, as well as those we manage for third parties. A wholly-owned, consolidated subsidiary fully reinsures such policies and thereby assumes all risk of losses under these policies and receives reinsurance premiums, substantially equal to the premiums collected from our tenants, from the non-affiliated insurance company.\nAs of December 31, 2024, we managed 1,575 stores for third party owners. Our management business enables us to generate increased revenues through management fees as well as expand our geographic footprint, data sophistication and scale with little capital investment. We believe this expanded footprint enables us to reduce our operating costs through economies of scale. In addition, our management business is a potential future acquisition pipeline.\nWe have a bridge lending program, under which we provide financing to third party self storage owners for operating properties that we manage. This program helps us increase our management business, create additional potential future acquisition opportunities, and strengthen our relationships with partners, all while generating interest and fee income. We generally originate mortgage loans and mezzanine loans with the option to sell a portion of the mortgage loans to third parties, while retaining our interests in the mezzanine loans. As of December 31, 2024, the total balance of bridge loans receivable was $1.2 billion.\nWe have made investments in preferred stock of other self-storage companies. These investments benefit us by providing dividend income, creating additional potential future acquisition opportunities through relationships with the companies in which we invest, or increasing our management business.\nLong-Term Growth and Investment Strategies\nOur primary business objectives are to maximize cash flow available for distribution to our stockholders and to achieve sustainable long-term growth in cash flow per share in order to maximize long-term stockholder value both at acceptable levels of risk. We continue to evaluate a range of growth initiatives and opportunities. Our primary strategies include the following:\nMaximize the performance of our stores through strategic, efficient and proactive management\nWe pursue revenue-generating and expense-minimizing opportunities in our operations. We seek to maximize revenue by responding to changing market conditions through our advanced technology systems' ability to provide real-time, interactive rental rate and discount management. We have implemented one of the most dynamic online marketing programs in the industry, which we believe will attract more customers to our stores at a lower net cost compared with our competitors.\nWe continually analyze our portfolio to look for long-term value-enhancing opportunities. We proactively redevelop properties to add units or modify existing unit mix to better meet the demand in a given market and to maximize revenue. We also redevelop properties to extend their useful life, increase visual appeal, enhance security and improve brand consistency across the portfolio.\nAcquire self-storage stores\nOur acquisitions team continues to pursue the acquisition of multi-store portfolios and single stores which can range from fully occupied to various stages of lease-up that we believe can provide stockholder value. We have established a reputation as a reliable, ethical buyer, which we believe enhances our ability to negotiate and close acquisitions. In addition, we believe our status as an UPREIT enables flexibility when structuring deals. We remain a disciplined buyer and only execute acquisitions that we believe will strengthen our portfolio and increase stockholder value.\nIn addition to the pursuit of operating stores, from time to time we develop stores from the ground up, frequently in a joint venture with a developer, and provide the construction capital. We also purchase stores at the completion of construction from third party developers, who build to our specifications. These stores purchased at completion of construction (a “Certificate of Occupancy store”) create additional long-term value for our stockholders. We are typically able to acquire these assets at a lower price than a stabilized store, and we expect greater long term returns on these stores on average. However, in the short term, these acquisitions cause dilution to our earnings during the two-to-four year period required to lease up the Certificate of Occupancy stores. We expect that this trend will continue as we continue to acquire Certificate of Occupancy stores.\nFinancing of Our Long-Term Growth Strategies\nAs a REIT, we are required to distribute at least 90% of our REIT taxable income to our stockholders. Consequently, we require access to additional sources of capital to fund our growth. We expect to maintain a flexible approach to financing growth. We plan to finance future acquisitions, store development and re-development, capital expenditures and our bridge loan program through a diverse capital optimization strategy which includes, but is not limited to, the following: cash generated from operations, borrowings under our revolving lines of credit (the “Credit Lines”), commercial paper, secured and unsecured financing, equity offerings, joint ventures and the sale of stores.\nWe have two credit lines which we primarily use as short-term bridge financing until we obtain longer-term financing through either debt or equity. As of December 31, 2024, our Credit Lines had available capacity of $2.1 billion, of which $1.3 billion was undrawn.\n- We have a commercial paper program which we use as short-term financing until we obtain longer-term financing through either debt or equity. As of December 31, 2024, our commercial paper program had available capacity of $1.0 billion, of which $500 million was undrawn.\nSecured and Unsecured Debt -\nWe primarily use public bonds, unsecured private placement bonds and unsecured bank term loans to finance store acquisitions and development efforts. We will continue to utilize a combination of secured and unsecured financing for future store acquisitions and development. As of December 31, 2024, we had $1.0 billion of secured notes payable and $10.2 billion of unsecured notes payable outstanding.\nWe have an active “at the market” (“ATM”) program for selling stock. We sell stock under the ATM program from time to time to raise capital when we believe conditions are advantageous. During the year ended December 31, 2024, we did not issue or sell any shares of common stock.\nWe view equity interests in our Operating Partnership as another source of capital that can provide an attractive tax planning opportunity to sellers of real estate. We issue common and preferred Operating Partnership units to sellers in certain acquisitions. Common Operating Partnership units receive distributions equal to the dividends on common stock, while Preferred Operating Partnership units receive distributions at various negotiated rates. We may issue additional units in the future when circumstances are favorable. During the year ended December 31, 2024, we issued 623,621 Operating Partnership units.\nAs of December 31, 2024, we owned 460 of our stores through unconsolidated joint ventures with third parties. Our joint venture partners typically provide most of the equity capital required for the acquisition of stores owned in these joint ventures. Most joint venture agreements include buy-sell rights, as well as rights of first offer in connection with the sale of stores by the joint venture. We manage the day-to-day operations of the stores owned in these joint ventures and have the right to participate in major decisions relating to sales of stores or financings by the applicable joint venture, but we do not control the joint ventures.\nSale of Properties -\nWe have not historically sold a high volume of stores, as we generally believe we are able to optimize the cash flow from stores through continued operations. However, we may sell more stores or interests in stores in the future in response to changing economic, financial or investment conditions. For the year ended December 31, 2024, we sold six stores for $102.5 million. For the year ended December 31, 2023, we did not sell any stores.\nIndustry & Competition\nWe are the largest self-storage operator in the United States. Our three primary competitors who are public self-storage REITs are CubeSmart, National Storage Affiliates and Public Storage.\nStores offer month-to-month rental of storage space for personal or business use. Tenants typically rent fully enclosed spaces that vary in size and typically range from 5 feet by 5 feet to 20 feet by 20 feet, with an interior height of 8 feet to 12 feet. Tenants have responsibility for moving their items into and out of their units. Stores generally have on-site managers who supervise and run the day-to-day operations, providing tenants with assistance as needed.\nSelf-storage provides a convenient way for individuals and businesses to store their possessions due to life changes, or simply because of a need for storage space. The mix of residential tenants using a store is determined by a store’s local demographics and often includes people who are experiencing life changes such as downsizing their living space or others who are not yet settled into a permanent residence. Items that tenants place in self-storage may include furniture, household items and appliances. Commercial tenants tend to include small business owners who require easy and frequent access to their goods, records, inven",
  "item7_clean": "Item 7. Management’s Discussion and Analysis of Financial Condition and Results of Operations\nOVERVIEW\nWe are a fully integrated, self-administered and self-managed REIT, formed to own, operate, manage, acquire, develop and redevelop self-storage properties (“stores”). We derive substantially all of our revenues from our two segments: self-storage operations and tenant reinsurance. Primary sources of revenue for our self-storage operations segment include rents received from tenants under leases at each of our wholly-owned stores. Our operating results depend materially on our ability to lease available self-storage units, to actively manage unit rental rates, and on the ability of our tenants to make required rental payments. Consequently, management spends a significant portion of their time maximizing cash flows from our diverse portfolio of stores. Revenue from our tenant reinsurance segment consists of insurance revenues from the reinsurance of risks relating to the loss of goods stored by tenants in our stores.\nOur stores are generally situated in highly visible locations clustered around large population centers. The clustering of our assets around these population centers enables us to reduce our operating costs through economies of scale. To maximize the performance of our stores, we employ industry-leading revenue management systems. Developed by our management team, these systems enable us to analyze, set and adjust rental rates daily across our portfolio in order to respond to changing market conditions. We believe our systems and processes allow us to more pro-actively manage revenues.\nWe operate in competitive markets, often where consumers have multiple stores from which to choose. Competition has impacted, and will continue to impact, our store results. We experience seasonal fluctuations in occupancy levels, with occupancy levels generally higher in the summer months due to increased moving activity. We believe that we are able to respond quickly and effectively to changes in local, regional and national economic conditions by adjusting rental rates through the combination of our revenue management team and our industry-leading technology systems. We consider a store to be in the lease-up stage after it has been issued a certificate of occupancy, but before it has achieved stabilization. We consider a store to be stabilized once it has achieved either an 80% occupancy rate for a full year measured as of January 1 of the current year, or has been open for three years prior to January 1 of the current year.\nCRITICAL ACCOUNTING POLICIES AND ESTIMATES\nOur financial statements have been prepared in accordance with U.S. generally accepted accounting principles. The preparation of these financial statements requires us to make estimates and assumptions that affect the reported amount of assets and liabilities at the date of the financial statements and the reported amount of revenues and expenses during the reporting period. On an ongoing basis, we evaluate our estimates and assumptions, including those that impact our most critical accounting policies. We base our estimates and assumptions on historical experience and on various other factors that we believe are reasonable under the circumstances. A summary of significant accounting policies is also provided in the notes to our consolidated financial statements (see Note 2 to our consolidated financial statements). Actual results may differ from these estimates. We believe the following are our most critical accounting policies and estimates:\nCONSOLIDATION:\nArrangements that are not controlled through voting or similar rights are accounted for as variable interest entities (“VIEs”). An enterprise is required to consolidate a VIE if it is the primary beneficiary of the VIE.\nUnder certain circumstances when we enter into arrangements for the formation of joint ventures, a VIE may be created. The primary factors that require the most judgment in determining whether the joint venture is a VIE are whether the decisions that most significantly impact the entity’s economic performance were controlled by the equity holders as a group and whether the joint venture has sufficient equity to finance its activities without additional subordinated support.\nIf the joint venture is determined to be a VIE, we perform a qualitative analysis, including considering which party, if any, has the power to direct the activities most significant to the economic performance of each VIE and whether that party has the obligation to absorb losses of the VIE or the right to receive benefits from the VIE that could be significant to the VIE. If we are determined to be the primary beneficiary of the VIE, the assets, liabilities and operations of the VIE are consolidated within\nour financial statements. Otherwise, our investment is generally accounted for under the equity method. Our ability to correctly assess the influence or control over an entity affects the presentation of the investment in our consolidated financial statements.\nREAL ESTATE ASSETS:\nWe account for the acquisition of stores, including by merger and other acquisitions of real estate, in accordance with ASC 805-10, “\nBusiness Combinations.\n\nWe use our judgment to determine if assets acquired meet the definition of a business or if the acquisition should be considered an asset acquisition. We must make significant assumptions and estimates in determining the fair value of the tangible and intangible assets and liabilities acquired and consideration transferred. These fair value estimates are sensitive to price of land per square foot and current replacement cost estimates, including adjustments for the age, class, height, square footage, condition, location, and turnkey factor. These assumptions and estimates require judgment, and therefore others could come to materially different conclusions as to the estimated fair values, which could result in differences in depreciation and amortization expense, gains and losses on the sale of real estate assets, and real estate and intangible asset values.\nEVALUATION OF ASSET IMPAIRMENT:\nLong lived assets held for use are evaluated for impairment when events or circumstances indicate that there may be impairment. We review each store at least annually to determine if any such events or circumstances have occurred or exist. We focus on stores where occupancy and/or rental income have decreased by a significant amount. For these stores, we determine whether the decrease is temporary or permanent and whether the store will likely recover the lost occupancy and/or revenue in the short term. In addition, we review stores in the lease-up stage and compare actual operating results to original projections. We may not have identified all material facts and circumstances that affect impairment of our stores. No material impairments were recorded in the year ended December 31, 2024.\nWe evaluate goodwill for impairment at least annually and whenever events, circumstances, and other related factors indicate that fair value of the related reporting unit may be less than the carrying value. If the fair value of the reporting unit is determined to exceed the aggregate carrying amount, no impairment charge is recorded. Otherwise, an impairment charge is recorded for the amount in which the carrying value of the reporting unit exceeds the fair value. No impairments were recorded in our evaluations for any period presented herein.\nDERIVATIVE INSTRUMENTS AND HEDGING ACTIVITIES:\nWe hold a number of derivative instruments which we use to hedge our exposure to variability in expected future cash flows, mainly related to our interest rates on variable interest debt. We do not use derivatives for trading or speculative purposes. We assess our derivatives both at inception and on an ongoing quarterly basis for whether the derivatives used in hedging transactions are effective. The rules and interpretations relating to the accounting for derivatives are complex. Failure to apply this guidance correctly may require us to recognize all changes in fair value of the hedged derivative in earnings, which may materially impact our results.\nINCOME TAXES:\nWe have elected to be treated as a REIT under Sections 856 through 860 of the Internal Revenue Code. In order to maintain our qualification as a REIT, among other requirements, we are required to distribute at least 90% of our REIT taxable income to our stockholders and meet certain tests regarding the nature of our income and assets. As a REIT, we are not subject to U.S. federal income tax with respect to that portion of our income which meets certain criteria and is distributed annually to our stockholders. We plan to continue to operate so that we meet the requirements for taxation as a REIT. Many of these requirements, however, are highly technical and complex. For any taxable year that we fail to qualify as a REIT and for which applicable statutory relief provisions did not apply, we would be subject to U.S. federal corporate income tax on all of our taxable income for at least that year and the ensuing four years. We could also be subject to penalties and interest, and our net income may be materially different from the amounts reported in our financial statements.\nWe have elected to treat certain corporate subsidiaries, including Extra Space Management, Inc., as a TRS. In general, a TRS may perform additional services for tenants and generally may engage in any real estate or non-real estate related business. A TRS is subject to U.S. federal corporate income tax and may also be subject to state and local income taxes. Interest and penalties relating to uncertain tax positions will be recognized in income tax expense when incurred. If tax authorities determine that amounts paid by any of our TRSs to us are not reasonable compared to similar arrangements among unrelated parties, we could be subject to a penalty tax on the excess payments.\nRECENT ACCOUNTING PRONOUNCEMENTS\nFor a discussion of recent accounting pronouncements affecting our business, see Item 8, “Financial Statements and Supplementary Data–Recently Issued Accounting Standards.”\nRESULTS OF OPERATIONS\nComparison of the Year Ended December 31, 2024 to the Year Ended December 31, 2023\nResults for the year ended December 31, 2024 included the operations of 2,436 stores (1,967 wholly-owned, nine in consolidated joint ventures, and 460 in joint ventures accounted for using the equity method) compared to the results for the year ended December 31, 2023, which included the operations of 2,377 stores (1,903 wholly-owned, two in consolidated joint ventures, and 472 in joint ventures accounted for using the equity method). Material or unusual changes in the results of our operations are discussed below:\nThe following table presents information on revenues earned for the years indicated:\n\nManagement fees and other income\nThe increase in property rental revenue for the year ended December 31, 2024 was primarily the result of an increase of $570,407 associated with our merger with Life Storage on July 20, 2023, (the “Life Storage Merger” or “Merger”) and other acquisitions completed in 2023 and 2024. We acquired 757 wholly-owned stores in the Merger and an additional 14 stores during the year ended December 31, 2023. We acquired 58 stores during the year ended December 31, 2024. The increase is also attributed to the Life Storage stores being on our platform for a full 12 months in 2024 in comparison with five months in 2023. In addition to the increase attributable to the Merger, property rental revenue increased by $5,440 due to operating results at our same-store pool and increased by $4,892 as a result of increases in occupancy at our lease-up stores.\n—The increase in tenant reinsurance revenue was due primarily to an increase in the number of stores operated, as well as the Life Storage stores being on our platform for a full 12 months in 2024 in comparison with five months in 2023. We operated 4,011 stores at December 31, 2024, compared to 3,714 stores at December 31, 2023.\nManagement Fees and Other Income\n—Management fees and other income represent the fees collected for our management of stores owned by third parties and unconsolidated joint ventures and other transaction fee income. The increase for the year ended December 31, 2024 was primarily due to an increase in the number of stores managed. As of December 31, 2024, we managed 2,044 stores for third parties and unconsolidated joint ventures, compared to 1,811 stores as of December 31, 2023.\nThe following table presents information on expenses for the years indicated:\n\nLife Storage Merger transition costs\nGeneral and administrative\nDepreciation and amortization\n—The increase in property operations expense consists primarily of an increase of $186,294 associated with the Life Storage Merger and other acquisitions completed in 2023 and 2024. We acquired 757 wholly-owned stores in the merger and an additional 14 stores during the year ended December 31, 2023. We acquired 58 stores during the year ended December 31, 2024. The increase is also attributed to the Life Storage stores being on our platform for a full 12 months in 2024 in comparison with five months in 2023. Additionally, property operations expense increased $23,122 at our same-store pool due to increased marketing expense, payroll, and property taxes.\n—Tenant reinsurance expense represents the costs that are incurred to provide tenant reinsurance. The increase in tenant reinsurance expense for the year ended December 31, 2024 was due primarily to the increase in total number of stores operated compared to the prior year. We operated 4,011 stores at December 31, 2024, compared to 3,714 stores at December 31, 2023.\nLife Storage Merger Transition Costs—\nRepresents the costs that were incurred as part of the Life Storage Merger primarily consisting of severance paid as part of employment agreements with certain employees and officers of Life Storage.\nGeneral and Administrative—\nGeneral and administrative expenses primarily include all expenses not directly related to our stores, including corporate payroll, travel and professional fees. These expenses are recognized as incurred. Our overall General and Administrative expense has increased primarily as a result of our increased size through acquisitions, business combinations and growth through our joint venture partners and managed portfolio. No other material trends in specific travel or other expenses were observed.\nDepreciation and Amortization\n—Depreciation and amortization expense increased primarily as a result of the acquisition of new stores. We acquired 58 wholly-owned stores during the year ended December 31, 2024. We acquired 757 wholly-owned stores in the Life Storage Merger and an additional 14 wholly-owned stores during the year ended December 31, 2023.\nOther Income and Expenses\nThe following table presents information on other revenues and expenses for the years indicated:\n\nTotal face value of debt\nWeighted average interest rate\nNon-cash Interest Expense Related to Amortization of Discount on Life Storage Unsecured Senior Notes—\nRepresents the amortization of the discount assigned to the fair value of the Life Storage unsecured senior notes assumed as part of the Life Storage Merger.\nInterest income represents interest earned on variable interest rate bridge loans, debt securities and on notes receivable from common and preferred Operating Partnership unit holders. The increase in interest income during the year ended December 31, 2024 was primarily the result of an increase in the amount of bridge loans outstanding. The balance of bridge loans was $1,244,575 as of December 31, 2024, compared to $594,727 as of December 31, 2023.\nEquity in Earnings and Dividend Income from Unconsolidated Real Estate Entities—\nEquity in earnings of unconsolidated real estate entities represents the income earned through our ",
  "item2_clean": null
}