{
  "source_file": "exr-20250930.htm",
  "form_type": "10-Q",
  "item1_clean": null,
  "item7_clean": null,
  "item2_clean": "ITEM 2. MANAGEMENT’S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS\nCAUTIONARY LANGUAGE\nThe following discussion and analysis should be read in conjunction with our unaudited\n“Condensed Consolidated Financial Statements”\nNotes to Condensed Consolidated Financial Statements (unaudited)”\nappearing elsewhere in this report and the\n“Consolidated Financial Statements,” “Notes to Consolidated Financial Statements”\n“Management’s Discussion and Analysis of Financial Condition and Results of Operations”\nStatement on Forward-Looking Information\nCRITICAL ACCOUNTING POLICIES\nIn many cases, the accounting treatment of a particular transaction is specifically dictated by GAAP and does not require our judgment in its application. There are areas in which our judgment in selecting among available alternatives would not produce a materially different result, but there are some areas in which our judgment in selecting among available alternatives would produce a materially different result. See the notes to the unaudited condensed consolidated financial statements that contain additional information regarding our accounting policies and other disclosures.\nOVERVIEW\nWe are a fully integrated, self-administered and self-managed real estate investment trust (“REIT”), formed to own, operate, manage, acquire, develop and redevelop self-storage properties (“stores”). We derive substantially all of our revenues from our two segments: self-storage operations and tenant reinsurance. Primary sources of revenue for our self-storage operations segment include rents received from tenants under leases at stores that are wholly-owned and in consolidated joint ventures. Our operating results depend materially on our ability to lease available self-storage units, to actively manage unit rental rates, and on the ability of our tenants to make required rental payments. Consequently, management spends a significant portion of their time maximizing cash flows from our diverse portfolio of stores. Revenue from our tenant reinsurance segment consists of insurance revenues from the reinsurance of risks relating to the loss of goods stored by tenants in our stores.\nOur stores are generally situated in highly visible locations clustered around large population centers. The clustering of our assets around these population centers enables us to reduce our operating costs through economies of scale. To maximize the performance of our stores, we employ industry-leading revenue management systems. Developed by our management team, these systems enable us to analyze, set and adjust rental rates daily across our portfolio in order to respond to changing market conditions. We believe our systems and processes allow us to more proactively manage revenues.\nWe operate in competitive markets, often where consumers have multiple stores from which to choose. Competition has impacted, and will continue to impact, our store results. We experience seasonal fluctuations in occupancy levels, with occupancy levels generally higher in the summer months due to increased moving activity. We believe that we are able to respond quickly and effectively to changes in local, regional and national economic conditions by adjusting rental rates through the combination of our revenue management team and our industry-leading technology systems. We consider a store to be in the lease-up stage after it has been issued a certificate of occupancy, but before it has achieved stabilization. We consider a store to be stabilized once it has been open for three years or has sustained average square foot occupancy of 80% or more for one calendar year.\nPROPERTIES\nAs of September 30, 2025, we owned or had ownership interests in 2,427 operating stores. Of these stores, 2,005 are wholly-owned, 11 are in consolidated joint ventures, and 411 are in unconsolidated joint ventures. In addition, we managed an additional 1,811 stores for third parties bringing the total number of stores which we own and/or manage to 4,238. These stores are located in 43 states and Washington, D.C. The majority of our stores are clustered around large population centers. The clustering of assets around these population centers enables us to reduce our operating costs through economies of scale. Our acquisitions have given us an increased scale in many core markets as well as a foothold in many markets where we had no previous presence.\nAs of September 30, 2025, approximately 2,460,000 tenants were leasing storage units at the operating stores that we own and/or manage, primarily on a month-to-month basis, providing the flexibility to increase rental rates over time as market conditions permit. Existing tenants generally receive rate increases at least annually, for which no direct correlation has been drawn to our vacancy trends. Although leases are short-term in duration, the typical tenant tends to remain at our stores for an extended period of time. For same-stores as of September 30, 2025, the average length of stay for tenants who have vacated was approximately 17.0 months.\nOur store portfolio is made up of different types of construction and building configurations. Most often sites are what we consider “hybrid” stores, a mix of drive-up and multi-floor buildings.\nThe following table presents additional information regarding net rentable square feet and the number of stores by state:\nNet Rentable Square Feet\nNet Rentable Square Feet\nNet Rentable Square Feet\nNet Rentable Square Feet\n(1) Includes 11 stores in consolidated joint ventures.\nRESULTS OF OPERATIONS\nAmounts in thousands, except store and share data\nComparison of the three and nine months ended September 30, 2025 and 2024\nResults for the three and nine months ended September 30, 2025 included the operations of 2,427 stores (2,005 wholly-owned, 11 in consolidated joint ventures, and 411 in joint ventures accounted for using the equity method) compared to the results for the three and nine months ended September 30, 2024, which included the operations of 2,401 stores (1,934 wholly-owned, seven in consolidated joint ventures, and 460 in joint ventures accounted for using the equity method).\nThe following table presents information on revenues earned for the periods indicated:\nFor the Three Months Ended September 30,\nFor the Nine Months Ended September 30,\nManagement fees and other income\nThe increase in property rental revenues for the three and nine months ended September 30, 2025 was primarily the result of an increase of $32,063 and $78,672, respectively, associated with acquisitions completed in 2024 and acquisitions completed in the first nine months of 2025. The increase in revenue resulting from these acquisitions was partially offset by decreases in rental revenue of $5,882 and $15,601, respectively, due to property dispositions for the three and nine months ended September 30, 2025. We acquired 58 wholly-owned stores and disposed of six wholly-owned stores in 2024, and we acquired 46 wholly-owned stores and disposed of 12 wholly-owned stores during the nine months ended September 30, 2025.\nThe increase in tenant reinsurance revenues was due primarily to an increase in the number of stores operated. We operated 4,238 stores at September 30, 2025 compared to 3,862 stores at September 30, 2024.\nManagement fees and other income—\nManagement fees and other income primarily represent the fees collected for our management of stores owned by third parties and unconsolidated joint ventures and other transaction fee income. The increase for the three and nine months ended September 30, 2025 was due to both an increase in the number of stores managed and an increase in the overall revenue of stores under management when compared to the same period last year. As of September 30, 2025, we managed 2,222 stores for unconsolidated joint ventures and third parties, compared to 1,921 stores as of September 30, 2024.\nThe following table presents information on expenses for the periods indicated:\nFor the Three Months Ended September 30,\nFor the Nine Months Ended September 30,\nGeneral and administrative\nDepreciation and amortization\nProperty operations—\nThe increase in property operations expense during the three and nine months ended September 30, 2025 consists primarily of an increase of $14,738 and $38,855, respectively, related to acquisitions completed in 2024 and acquisitions completed in the first nine months of 2025. We acquired 58 wholly-owned stores in 2024 and an additional 46 wholly-owned stores during the nine months ended September 30, 2025. Additionally, for the three and nine months ended September 30, 2025, there was an increase of $9,184 and $31,215, respectively, at our same-store properties primarily due to an increase in payroll and benefits, marketing, repairs and maintenance, and property tax expenses.\nTenant reinsurance expense represents the costs that are incurred to provide tenant reinsurance and is subject to volatility due to increased claims arising when significant events occur at stores.\nGeneral and administrative—\nGeneral and administrative expenses primarily include all expenses not directly related to our stores, including corporate payroll, office expense, office rent, travel and professional fees. These expenses are recognized as incurred. Our overall general and administrative expense increased primarily as a result of our increased size through acquisitions and growth in our managed portfolio.\nDepreciation and amortization—\nWe amortize to expense intangible assets-customer intangibles on a straight-line basis over the average period that a tenant is expected to utilize the facility (currently estimated at 18 months). Depreciation and amortization expense decreased for both the three and nine month periods, primarily due to the customer intangibles associated with our merger with Life Storage being fully expensed in January of this year.\nOther Revenues and Expenses\nThe following table presents information on other"
}