{
  "source_file": "fast-20250930.htm",
  "form_type": "10-Q",
  "item1_clean": null,
  "item7_clean": null,
  "item2_clean": "Daily sales impact of currency fluctuations\nNet sales increased $223.2, or 11.7%, in the third quarter of 2025 when compared to the third quarter of 2024. Both periods had the same number of selling days. Even though industrial production was still sluggish in the third quarter of 2025, t\nhe performance reflects the contribution from improved customer contract signings since the first quarter of 2024. Chang\nes in foreign exchange rates positively affected sales in the third quarter of 2025 by approximately 10 basis points and negatively affected sales in the third quarter of 2024 by approximately 10 basis points.\nWe experienced an increase in unit sales in the third quarter of 2025. This was due to growth in the number of customer sites spending $10k or more per month with Fastenal and, to a lesser degree, growth in average monthly sales per customer site across all customer spend categories. The im\npact of product pricing on net sal\nes in the third quarter of 2025 was an increase of\n240 to 270 basis point\ns, in contrast to the third quarter of 2024, when the impact of product pricing was not material.\nFrom a product standpoint, we have three categories: fasteners, including fasteners used in OEM and MRO, safety supplies, and other product lines, the latter of which includes eight smaller product categories, such as tools, janitorial supplies, and cutting tools.\nIndustrial production was still sluggish in the third quarter of 2025; however, the performance of our fastener product line outperformed our non-fastener product lines. The fastener category experienced improved growth in the third quarter of 2025, as compared to the third quarter of 2024, driven by easier comparisons, increased contribution from large customer signings, better product availability in our distribution centers, and pricing actions implemented in the second and third quarters of 2025. We achieved growth in our safety category reflecting the lower volatility of PPE demand, which tends to be utilized in more MRO than OEM applications, growth of our vending installed base, and success with data center customers. Other product lines experienced higher growth from MRO-oriented lines, such as janitorial, and from OEM-oriented lines, such as welding/\nabrasives, despite continued soft manufacturing demand.\nThe DSR change when compared to the same period in the prior year and the percent of sales in the period were as follows:\nFrom an end market standpoint, we have four categories: heavy manufacturing, other manufacturing, non-residential construction, and other, the latter of which includes reseller, government/education, transportation, warehousing and storage, and data centers.\nOur manufacturing end markets outperformed primarily due to the relative strength we are experiencing with key account customers with significant managed spend where our service model and technology are particularly impactful. This disproportionately benefits manufacturing customers. The non-residential construction end market experienced growth for the second time in twelve consecutive quarters. Other end market sales were favorably impacted by growth with education and healthcare, transportation, and data center customers. These were partially offset by declining sales with resellers, although at a lower decline than we've historically seen. The D\nSR change when compared to the same period in the prior year and the percent of sales in the period were as follows:\nNon-residential construction\nTotal non-manufacturing\nFrom a customer standpoint, we have two categories: contracts, which include national multi-site, local and regional, and government customers with significant revenue potential, and non-contracts, which include all other customers. Sales with our contract customers continue to outperform as we realize incremental sales from implementing strong customer signings that we have achieved since the first quarter of 2024, which was partially offset by subdued business activity. Non-contract customers tend to be smaller and utilize fewer of our tools and capabilities, providing fewer avenues for share gains and therefore more closely reflect overall business trends, which remain sluggish. The DSR change when compared to the same period in the prior y\near and the percent of sales in the period were as follows:\nPrior to 2025, our disclosed metrics primarily addressed development of capabilities, including branch openings, geographic expansion, growth of national accounts, growth of non-fastener products, FMI installations, and Onsite signings, to name a few. The data provided in the chart below measures the number of customer sites that are served throughout our in-market network, categorizing them by monthly customer spend categories and end market, and the sales and average sales per site. We believe this supplemental information may be useful to investors in evaluating Fastenal's business trends and whether and to what degree we are being successful. Historical end market sales have been updated in the table below to categorize by customer site and may not be able to be recalculated due to the rounding of those dollar values.\nMo. Sales per Customer Site\nMo. Sales per Customer Site\nTotal non-manufacturing\nCustomer sites represent the number of customer locations served by our in-market network. Individual customers with multiple locations across multiple in-market locations will have multiple customer sites.\nCustomer sites are an average of the number of customer sites calculated each month.\nMonthly sales per customer site totals do not include the sales from other sales lines, as there is no customer site count associated with it. This column is not rounded to the millions and represents the exact dollar amount.\n$50k+ customer sites are disclosed as a representation of Onsite-like customers and are also a subset of $10k+ customer sites.\nOther sales represent impacts to sales that are not tied to a specific site or in-market location. This includes certain service fees, cash sales, direct product sales, etc.\nFMI Technology comprises our FASTStock\n(scanned stocking locations), FASTBin\n(infrared, RFID, and scaled bins), and FASTVend\n(vending devices) offerings. FASTStock's fulfillment processing technology is not embedded, is relatively less expensive and highly flexible in application, and is delivered using our proprietary mobility technology. FASTBin and FASTVend incorporate highly efficient and powerful embedded data tracking and fulfillment processing technologies. The first statistic below is a\n, which combines the signings and installations of FASTBin and FASTVend in a standardized machine equivalent unit (MEU) based on the expected output of each type of device. We do not include FASTStock in this measurement because scanned stocking locations can take many forms, such as bins, shelves, cabinets, pallets, etc., that cannot be converted into a standardized MEU. The second statistic is\nsales through FMI Technology\n, which combines the sales through FASTStock, FASTBin, and FASTVend. A portion of the growth in sales experienced by FMI, particularly FASTStock and FASTBin, reflects the migration of products from less efficient non-digital stocking locations to more efficient, digital stocking locations.\n\nAccounts receivable, net\nTrade working capital\nTrade working capital, net\nNet sales in last three months\nNote - Amounts may not foot due to rounding differences.\nThe increase in our accounts receivable balance in the third quarter of 2025 was primarily attributable to\ngrowth in sales with our customers, including relative growth with larger customers that tend to carry longer payment terms.\nThe increase in our inventory balance in the third quarter of 2025 was primarily attributable\nto two factors. First, we added inventory to support projected growth in our business. Second, and to a lesser extent, tariffs and general inflation have led to increased inventory valuation.\nThe increase in our accounts payable balance in the third quarter of 2025 was primarily attributable\nto an increase in our product purchases as reflected in the growth in inventories.\nNet Cash Used in Investing Activities\nNet cash used in investi\nng activities decreased $1.1 in the third quarter of 2025 when compared to the third quarter of 2024.\nThis was primarily related to an increase in spending for FMI hardware to support growth in our installed base, facility construction and upgrades, IT, and vehicles that was partially offset by an increase in proceeds from sales of vehicles and property.\nOur capital spending typically falls into five categories: (1) purchases related to FMI hardware, (2) purchases of property and equipment related to expansion of and enhancements to distribution centers, owned or leased branch properties, and other company facilities, (3) spending on software and hardware for our information processing systems, (4) the addition of fleet vehicles, and (5) the addition of manufacturing equipment. Proceeds from the sales of property and equipment, typically for the planned disposition of pick-up trucks as well as distribution vehicles and trailers in the normal course of business, are netted against these purchases and additions. During the third quarter of 2025, our net capital expenditures (purchases of property and equipment, net of proceeds from sales of property and equipment) were $54.7, which was a slight decrease from $55.8 in the third quarter of 2024.\nThis was primarily related to an increase in spending for FMI hardware to support growth in our installed base, facility construction and upgrades, IT, and vehicles that was partially offset by an increase in proceeds from sales of vehicles and property.\nCash requirements for capital expenditures were\nsatisfied from cash generated from operations, available cash and cash equivalents, our borrowing capacity, and the proceeds of disposals. For 2025, we\nnet capital expenditures\nto be within a range of $235.0 to $255.0, "
}