{
  "source_file": "fcx-20250930.htm",
  "form_type": "10-Q",
  "item1_clean": null,
  "item7_clean": null,
  "item2_clean": "We expect our average unit net cash costs (net of by-product credits) for our U.S. copper mines to continue to trend lower for the year 2025 and in 2026, compared to 2024 levels, reflecting the projected impact of efficiencies, improved volumes and cost reduction plans currently in progress.\nAverage unit net cash costs (net of by-product credits) for our U.S. copper mines are expected to approximate $3.03 per pound of copper for the year 2025, based on achievement of current sales volume and cost estimates, and assuming an average price of $25.00 per pound of molybdenum in fourth-quarter 2025. Our U.S. copper mines’ average unit net cash costs for the year 2025 would change by approximately $0.01 per pound for each $2 per pound change in the average price of molybdenum in fourth-quarter 2025.\nWe manage two copper operations in South America – Cerro Verde in Peru (55.08%-owned) and El Abra in Chile (51%-owned), which are consolidated in our financial statements.\nSouth America operations include open-pit mining, sulfide-ore concentrating, leaching and SX/EW facilities. Production from our South America operations is sold as copper concentrate or cathode under long-term contracts.\nOur South America operations also sell a portion of their copper concentrate production to Atlantic Copper. In addition to copper, the Cerro Verde mine produces molybdenum concentrate and silver.\nDevelopment Activities.\nAt the El Abra operations in Chile, we have completed substantial drilling and evaluations to define a large sulfide resource that could support a potential major mill project similar to the large-scale concentrator at Cerro Verde. The estimated resource approximates 20 billion recoverable pounds of copper, which could result in the addition of 750 million pounds of copper production per year. We have advanced stakeholder engagement and preparation of our permitting application and plan to submit an environmental impact statement in first-quarter 2026. Preliminary estimates, which remain under review, indicate that the project economics would be supported using an incentive copper price of less than $4.00 per pound. The decision to proceed with and timing of the potential project will take into account overall copper market conditions, required permitting and other factors.\nFollowing is summary consolidated operating data for South America operations:\nThree Months Ended September 30,\nNine Months Ended September 30,\n\nIncludes favorable (unfavorable) adjustments to prior period provisionally priced concentrate and cathode copper sales totaling $11 million ($1 million to net income attributable to common stock or less than $0.01 per share) in third-quarter 2025, $(32) million ($(13) million to net income attributable to common stock or $(0.01) per share) in third-quarter 2024, $63 million ($21 million to net income attributable to common stock or $0.01 per share) for the first nine months of 2025 and $28 million ($9 million to net income attributable to common stock or $0.01 per share) for the first nine months of 2024. Refer to Note 5 for further discussion.\nWe defer recognizing profits on intercompany sales until final sales to third parties occur. Changes in these deferrals attributable to variability in intercompany volumes resulted in net additions (reductions) to operating income totaling $13 million ($15 million to net income attributable to common stock or $0.01 per share) in third-quarter 2025, $(42) million ($(13) million to net income attributable to common stock or $(0.01) per share) in third-quarter 2024, $161 million ($58 million to net income attributable to common stock or $0.04 per share) for the first nine months of 2025 and $79 million ($23 million to net income attributable to common stock or $0.02 per share) for the first nine months of 2024. Refer to “Operations – Downstream Processing Facilities\nIncludes net charges totaling $48 million in third-quarter 2025 and $72 million for the first nine months of 2025, primarily related to idle facility costs and recovery efforts associated with the September 2025 mud rush incident at PTFI, PTFI smelter fire repair costs not recoverable by insurance, and oil and gas impairments, partly offset by net favorable adjustments to environmental obligations and a gain on sales of assets. The first nine months of 2025 also include charges for previously capitalized costs associated with PTFI’s downstream processing facilities, partly offset by an adjustment to PTFI’s asset retirement obligation.\nIncludes net charges totaling $30 million in third-quarter 2024 and $81 million for the first nine months of 2024, primarily associated with impairments for legacy oil and gas matters and nonrecurring labor-related charges at Cerro Verde associated with new collective labor agreements (CLA), partly offset by a reduction in accruals for uncertain U.S. tax positions. The first nine months of 2024 also included charges associated with assumed oil and gas abandonment obligations resulting from bankruptcies of other companies, revisions to environmental obligation estimates and related litigation reserves, and inventory adjustments/write-offs.\nCash used for working capital totaled $168 million in third-quarter 2025, $5 million in third-quarter 2024, $510 million for the first nine months of 2025 and $29 million for the first nine months of 2024.\nThree Months Ended September 30,\nNine Months Ended September 30,\nSUMMARY OPERATING DATA\n(millions of recoverable pounds)\n\nConsolidated revenues totaled $7.0 billion in third-quarter 2025, $6.8 billion in third-quarter 2024, $20.3 billion for the first nine months of 2025 and $19.7 billion for the first nine months of 2024. Revenues from our mining operations and processing facilities primarily include the sale of copper cathode, copper in concentrate, copper rod, gold in concentrate and anode slimes, gold bars and molybdenum. Refer to Note 8 for a summary of product revenues.\nFollowing is a summary of changes in our consolidated revenues between periods (in millions):\nThree Months Ended September 30\nNine Months Ended September 30\nConsolidated revenues – 2024 period\n(Lower) higher sales volumes:\nHigher average realized prices:\nAdjustments for prior period provisionally priced copper sales\nHigher Atlantic Copper revenues\nLower revenues from purchased copper\nLower treatment charges\nLower royalties and export duties\nOther, including intercompany eliminations\nConsolidated revenues – 2025 period\nConsolidated copper and gold sales volumes decreased in the 2025 periods, compared to the 2024 periods, primarily reflecting the temporary suspension of operations in Indonesia since the September 2025 mud rush incident at PTFI and lower ore grades in Indonesia. Lower copper and gold sales volumes for the first nine months of 2025, compared to the first nine months of 2024, also reflect the impact of lower operating rates in Indonesia resulting from planned major maintenance projects.\nOur consolidated revenues can vary significantly as a result of fluctuations in the market prices of copper, gold and molybdenum. Our average realized prices in third-quarter 2025, compared with third-quarter 2024, were 9% higher for copper, 38% higher for gold and 5% higher for molybdenum. Average realized prices for the first nine months of 2025, compared with the first nine months of 2024, were 7% higher for copper, 42% higher for gold and 3% higher for molybdenum.\nDuring the third quarter and first nine months of 2025, our average U.S. copper price realization, which is generally based on COMEX settlement prices, was approximately 7% to 9% higher than the average copper price realizations for our South America and Indonesia operations, which are generally based on LME settlement prices. Refer to “Markets” for further discussion of COMEX and LME copper prices.\n\nCopper sales from South America operations are expected to approximate 1.1 billion pounds for the year 2025. Refer to “Outlook” for projected molybdenum sales volumes.\nUnit Net Cash Costs.\nWe believe unit net cash costs per pound of copper is a measure that provides investors with information about the cash-generating capacity of our mining operations expressed on a basis relating to the primary metal product for our respective operations. We use this measure for the same purpose and for monitoring operating performance by our mining operations. This information differs from measures of performance determined in accordance with U.S. GAAP and should not be considered in isolation or as a substitute for measures of performance determined in accordance with U.S. GAAP. This measure is presented by other metals mining companies, although our measure may not be comparable to similarly titled measures reported by other companies.\nGross Profit per Pound of Copper\nThe following tables summarize unit net cash costs and gross profit per pound at our South America operations for the third quarters and first nine months of 2025 and 2024. Unit net cash costs per pound of copper are reflected under the by-product and co-product methods as the South America operations also had sales of molybdenum and silver. Refer to “Product Revenues and Production Costs” for an explanation of the “by-product” and “co-product” methods and a reconciliation of unit net cash costs per pound to production and delivery costs applicable to sales reported in our consolidated financial statements.\nThree Months Ended September 30,\n\ncontinue to drive gold prices to record highs, with the London PM gold price reaching an all-time high of $4,294 per ounce in October 2025 and closing at $4,012 per ounce on October 31, 2025.\nThis graph presents the\nMolybdenum Dealer Oxide weekly average prices from January 2015 through September 2025. During third-quarter 2025, the weekly average prices for molybdenum averaged $24.33 per pound (ranging from a low of $22.10 per pound to a high of $25.93 per pound) and closed at $25.05 per pound on September 30, 2025. Overall glob"
}