{
  "source_file": "fds-20250531.htm",
  "form_type": "10-Q",
  "item1_clean": null,
  "item7_clean": null,
  "item2_clean": "ITEM 2. MANAGEMENT’S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS\nOur MD&A is designed to provide a reader of our financial statements with a narrative from the perspective of our management on our financial condition, results of operations, liquidity and certain other factors that may affect our future results. Our MD&A is presented in the following sections:\nAnnual Subscription Value (\"ASV\")\nClient and User Additions\nResults of Operations\nNon-GAAP Financial Measures\nLiquidity and Capital Resources\nOff-Balance Sheet Arrangements\nForeign Currency Exposure\nCritical Accounting Estimates\nNew Accounting Pronouncements\nFactSet Research Systems Inc. and its wholly-owned subsidiaries (\"we,\" \"our,\" \"us,\" or \"FactSet\") is a global financial digital platform and enterprise solutions provider with open and flexible technologies that deliver financial intelligence to investment professionals worldwide.\nOur platform delivers expansive data, sophisticated analytics, and flexible technology used by global financial professionals to power their critical investment workflows. As of May 31, 2025, we had more than 8,800 clients comprised of over 220,000 investment professionals, including institutional asset managers, bankers, wealth managers, asset owners, partners, hedge funds, corporate users, and private equity and venture capital professionals. Our revenues are primarily derived from subscriptions to our multi-asset class data and solutions powered by our connected data and technology platform. Our products and services include workstations, portfolio analytics and enterprise data solutions. We also offer managed services that operate as an extension of our clients' internal teams to support data, performance, risk and reporting workflows.\nWe drive our business based on our detailed understanding of our clients' workflows, which helps us to solve their most complex challenges. We provide financial data and market intelligence on securities, companies, industries and people to enable our clients to research investment ideas and analyze, monitor and manage their portfolios. Our solutions span the investment lifecycle of investment research, portfolio construction and analysis, trade execution, performance measurement, risk management and reporting. We provide open and flexible technology offerings, including a configurable desktop and mobile platform, comprehensive data feeds, cloud-based digital solutions, and application programming interfaces (\"APIs\"). The CUSIP Global Services (\"CGS\") business supports security master files relied on by the investment industry for critical front, middle and back-office functions. All of our platforms and solutions are supported by our dedicated client service team.\nWe operate our business through three reportable segments (\"segments\"): the Americas, EMEA and Asia Pacific. Within each segment, we offer data, products and analytical applications by firm type:\n\"Institutional Buyside\" focuses on global asset managers, asset owners, and hedge fund professionals,\n\"Dealmakers\" focuses on investment bankers, sell-side research analysts, corporate users, investor relations officers and private equity and venture capital professionals,\n\"Wealth\" focuses on wealth management clients, and\n\"Partnerships and CGS\": \"Partnerships\" delivers solutions to firms in the financial services ecosystem including data, analytics and technology platform providers. \"CGS\" is an originator of securities identification, managed on behalf of the American Bankers Association, for all sectors of the global financial markets.\nSegment Information,\nWe strive to be a trusted enterprise partner and service provider to our clients across the financial services spectrum, delivering relevant intelligence, insights and execution solutions tailored to our clients' business models.\nWe are focused on growing our global business through three strategically aligned geographic segments: the Americas, EMEA and Asia Pacific. This approach allows us to better manage resources, target solutions and interact with clients effectively.\nTo execute our strategy, we are focused on three core pillars and primary areas of investment:\nExpanding our data offerings:\nWe continue to scale up our data ecosystem to provide a comprehensive inventory of industry, proprietary and third-party data. This includes granular data for key industry verticals, real-time market data, fund data and sustainable finance. We believe that our breadth of high-quality, connected data will serve as critical raw material for large language models. In addition to using our growing data catalog to power our artificial intelligence (\"AI\") powered workstation products, we aim to continue to expand our data delivery capabilities in the cloud and through other methods to advance our position as an enterprise data provider for our clients.\nEmbedding deeper in client workflows\n: Through continued innovation, we aim to deepen our integration into our clients' workflows. We are focused on expanding further into the buy-side front office by leveraging our expertise in portfolio performance, analytics, and risk management. In addition, we are building on our strong presence on advisor desktops by expanding into prospecting and digital reporting workflows. We are also working to introduce next-generation automation in research, financial modeling, and pitch creation.\n: Our artificial intelligence roadmap, driven by our FactSet AI Blueprint, continues to resonate with our clients. We recently launched new AI-powered solutions for generating portfolio performance commentary, analyzing earnings call transcripts, and requesting FactSet data using natural language queries in client-built environments and chatbots. We believe that our pragmatic, open and flexible approach to leveraging AI to enhance our clients’ workflows will differentiate FactSet from our competitors and drive growth.\nExecutive Leadership Transition\nOn June 3, 2025, FactSet announced the appointment of Sanoke Viswanathan as Chief Executive Officer and that he will join FactSet’s Board of Directors, effective on September 1, 2025, or such other mutually agreed date. Mr. Viswanathan will succeed F. Philip Snow, who will retire from these roles effective on Mr. Viswanathan's start date. To support a smooth leadership transition, Mr. Snow will continue employment with FactSet in an advisory capacity until November 15, 2025 or such later date as mutually agreed.\nFiscal 2025 Third Quarter in Review\nRevenues in the third quarter of fiscal 2025 were $585.5 million, an increase of 5.9% from the comparable prior year period. This 5.9% growth in revenues was driven by a 4.4% increase in organic revenues, a 1.4% increase from acquisition-related revenues and a 0.1% net increase from foreign currency exchange rate fluctuations. Revenues increased in all our segments, primarily in the Americas. Revenues increased primarily from workstations and, to a lesser extent, front office solutions and CGS. Refer to Part I, Item 2.\nManagement's Discussion and Analysis of Financial Condition and Results of Operations, Non-GAAP Financial Measures,\nAs of May 31, 2025, organic annual subscription value (\"Organic ASV\") totaled $2,296.9 million, an increase of 4.5% over the prior year. Organic ASV increased in all our segments, with the majority of the increase in the Americas. The Organic ASV increase was mainly driven by workstations and, to a lesser extent, CGS and data solutions. Refer to Part I, Item 2.\nManagement's Discussion and\nAnalysis of Financial Condition and Results of Operations, Annual Subscription Value,\nOperating margin was 33.2% for the third quarter of fiscal 2025, compared to 36.6% in the prior year period. When expenses are expressed as a percentage of revenues, this decrease in operating margin was mainly due to higher employee compensation costs and amortization of intangible assets, partially offset by growth in revenues and a benefit from the net settlement of our foreign currency forward contracts. Diluted earnings per common share (\"Diluted EPS\") was $3.87 for the third quarter of fiscal 2025, a decrease of 5.4% from the comparable prior year period, primarily driven by lower operating income.\nWe returned $120.2 million to our stockholders in the form of share repurchases and dividends during the three months ended May 31, 2025.\nAs of May 31, 2025, our client and user count was 8,811 and 220,496, respectively. Our employee headcount was 12,579 as of May 31, 2025, up 2.6% compared to the prior year. This increase was driven by net headcount growth of 5.2% in Americas, 3.4% in EMEA and 1.7% in Asia Pacific.\nAnnual Subscription Value (\"ASV\")\nWe believe ASV reflects our ability to grow recurring revenues and generate positive cash flows, and thus serves as a key indicator of the successful execution of our business strategy.\n\"ASV\" at any point in time represents our forward-looking revenues for the next 12 months from all subscription services currently being supplied to clients.\n\"Organic ASV\" at any point in time equals our ASV excluding ASV from acquisitions and dispositions completed within the last 12 months and the effects of foreign currency movements.\nBeginning in fiscal 2025, we are reporting Organic ASV, rather than Organic ASV plus professional services, to focus on the recurring nature of our revenues. This underscores the shift of our offerings toward providing more managed services and less project-based services.\nThe following table presents the calculation of Organic ASV as of May 31, 2025. With proper notice provided as contractually required, our clients can add to, delete portions of, or terminate service, subject to certain limitations.\n(dollar amounts in millions)\nASV\nOrganic ASV annual growth rate\nThe impact from foreign currency movements.\nAcquired ASV from acquisitions completed within the last 12 months.\nAs of May 31, 2025, Organic ASV was $2,296.9 million, an increase of 4.5% compa"
}