{
  "source_file": "fdx-20250831.htm",
  "form_type": "10-Q",
  "item1_clean": null,
  "item7_clean": null,
  "item2_clean": "principal amount of the senior unsecured notes were issued by FedEx under a shelf registration statement and are guaranteed by certain direct and indirect subsidiaries of FedEx (“Guarantor Subsidiaries”). FedEx owns, directly or indirectly, 100% of each Guarantor Subsidiary. The guarantees are (1) unsecured obligations of the respective Guarantor Subsidiary, (2) rank equally with all of their other unsecured and unsubordinated indebtedness, and (3) are full and unconditional and joint and several. If we sell, transfer, or otherwise dispose of all of the capital stock or all or substantially all of the assets of a Guarantor Subsidiary to any person that is not an affiliate of FedEx, the guarantee of that Guarantor Subsidiary will terminate, and holders of debt securities will no longer have a direct claim against such subsidiary under the guarantee. See\nof the accompanying unaudited condensed consolidated financial statements for information regarding the issuance by FedEx of its 3.500% Notes due 2032 and 4.125% Notes due 2037 guaranteed by the Guarantor Subsidiaries that was completed during the first quarter of 2026.\nAdditionally, FedEx fully and unconditionally guarantees the payment obligation of Federal Express in respect of the $711 million principal amount of the Certificates. See\nof the accompanying unaudited condensed consolidated financial statements and\nto the financial statements included in our Annual Report for additional information regarding the terms of the Certificates.\nThe following tables present summarized financial information for FedEx (as Parent) and the Guarantor Subsidiaries on a combined basis after transactions and balances within the combined entities have been eliminated\nParent and Guarantor Subsidiaries\nThe following table presents the summarized balance sheet information as of August 31, 2025 and May 31, 2025 (in millions):\nIntercompany Receivable\nIntercompany Payable\nThe following table presents the summarized statement of income information for the three-month period ended August 31, 2025 (in millions):\nIntercompany Charges, net\nIntercompany Charges, net\nIncome Before Income Taxes\nThe following tables present summarized financial information for FedEx (as Parent Guarantor) and Federal Express (as Subsidiary Issuer) on a combined basis after transactions and balances within the combined entities have been eliminated.\nParent Guarantor and Subsidiary Issuer\nThe following table presents the summarized balance sheet information as of August 31, 2025 and May 31, 2025 (in millions):\nIntercompany Receivable\nIntercompany Payable\nThe following table presents the summarized statement of income information for the three-month period ended August 31, 2025 (in millions):\nIntercompany Charges, net\nIntercompany Charges, net\nIncome Before Income Taxes\nLIQUIDITY OUTLOO\nK\nIn response to current business and economic conditions as referenced above in the “Outlook” section of this MD&A, we are continuing to actively manage and optimize our capital allocation in response to the slowdown in the economy, inflationary pressures, changing fuel prices, geopolitical conflicts, and uncertainty regarding international trade, including the impact of global trade policies. We held $6.2 billion in cash and cash equivalents at August 31, 2025 and had $3.5 billion in available liquidity under our $1.75 billion three-year credit agreement (the “Three-Year Credit Agreement”) and $1.75 billion five-year credit agreement (the “Five-Year Credit Agreement” and together with the Three-Year Credit Agreement, the “Credit Agreements”), and we believe that our cash and cash equivalents, cash from operations, and available financing sources will be adequate to meet our liquidity needs, which include operational requirements, expected capital expenditures, voluntary pension contributions, dividend payments, and stock repurchases. In the third quarter of 2025, we began incurring costs and expenses related to the planned spin-off of FedEx Freight, which are expected to be significant but are not expected to adversely affect our liquidity.\nWe repurchased an aggregate of $500 million of our common stock in the first quarter of 2026 through open market transactions. See\nof the accompanying unaudited condensed consolidated financial statements and\n“Item 2. Unregistered Sales of Equity Securities and Use of Proceeds”\nfor more information. Subject to market conditions, our liquidity needs, and other factors, we expect to continue repurchasing additional shares of our common stock during the remainder of 2026.\nOur cash and cash equivalents balance at August 31, 2025 includes $4.0 billion of cash in foreign jurisdictions associated with our permanent reinvestment strategy. We are able to access the majority of this cash without a material tax cost and do not believe that the indefinite reinvestment of these funds impairs our ability to meet our U.S. domestic debt or working capital obligations.\nOur capital expenditures for 2026 are expected to be approximately $4.5 billion, $0.4 billion higher than 2025.The increase is driven by investment in Network 2.0 initiatives and other efforts to modernize our facilities and package handling equipment in the U.S. and internationally. Aircraft spend is expected to decline to approximately $1.0 billion, $0.3 billion lower than 2025.\nThere have been no material changes to the contractual commitments described in Part II, Item 7 in our Annual Report. We do not have any guarantees or other off-balance sheet financing arrangements, including variable interest entities, which we believe could have a material effect on our financial condition or liquidity.\nWe have several aircraft modernization programs under way that are supported by the purchase of Boeing 777 Freighter (“B777F”) and Boeing 767-300 Freighter (“B767F”) aircraft. These aircraft are significantly more fuel-efficient per unit than the aircraft types previously utilized, and these expenditures are necessary to achieve significant long-term operating savings and to replace older aircraft. Our ability to delay the timing of these aircraft-related expenditures is limited without incurring significant costs to modify existing purchase agreements.\nThe Three-Year Credit Agreement and the Five-Year Credit Agreement expire in March 2027 and March 2029, respectively. Each of the Credit Agreements has a $125 million letter of credit sublimit. The Credit Agreements are available to finance our operations and other cash flow needs. See\nof the accompanying unaudited condensed consolidated financial statements for more information.\nto sell, in one or more future offerings, pass-through certificates.\nDuring the first three months of 2026, we made voluntary contributi\nons of $200 million to our tax-qualified U.S. domestic pension plan (“U.S. Pension Plan”) and anticipate making up to $200 million of additional voluntary contributions during the remainder of\n2026. There are currently no required minimum contributions to our U.S. Pension Plan, and we maintain a credit balance related to our cumulative excess voluntary pension contributions over those required that\nexceeds $3.0 billion. The c\nredit balance is subtracted from plan assets to determine the minimum funding requirements. Therefore, we have the flexibility to eliminate all required contributions to our U.S. Pension Plan for several years. Our U.S. Pension Plan has ample funds to meet expected benefit payments.\nOn August 7, 2025, our Board of Directors declared a quarterly cash dividend of $1.45 per share of common stock. The dividend will be paid on October 1, 2025 to stockholders of record as of the close of business on September 8, 2025\nEach quarterly dividend payment is subject to review and approval by our Board of Directors, and we evaluate our dividend payment amount on an annual basis.\nStandard & Poor’s has assigned us a senior unsecured debt credit rating of BBB, a Certificates rating of AA-, a commercial paper rating of A-2, and a ratings outlook of “stable.” Moody’s Investors Service has assigned us an unsecured debt credit rating of Baa2, a Certificates rating of Aa3, a commercial paper rating of P-2, and a ratings outlook of “stable.” Our interest expense may increase in the event of a reduction in our credit rating. If our unsecured debt or commercial paper ratings are reduced to below investment grade, our access to the capital markets may become limited.\nCRITICAL ACCOUNTING ESTIMATES\nThe preparation of financial statements in accordance with accounting principles generally accepted in the United States requires management to make significant judgments and estimates to develop amounts reflected and disclosed in the financial statements. In many cases, there are alternative policies or estimation techniques that could be used. We maintain a thorough process to review the application of our accounting policies and to evaluate the appropriateness of the many estimates that are required to prepare the financial statements of a complex, global corporation. However, even under optimal circumstances, estimates routinely require adjustment based on changing circumstances and new or better information.\nGOODWILL.\nGoodwill is tested for impairment between annual tests whenever events or circumstances make it more likely than not that the fair value of a reporting unit has fallen below its carrying value\n. We do not believe there has been any additional change of events or circumstances that would indicate that additional reevaluation of the goodwill of our reporting units is required as of August 31, 2025, nor do we believe the goodwill of our reporting units is at risk of failing impairment testing.\nFor additional details on goodwill impairment testing, refer to Note 1 to the financial statements included in our Annual Report.\nInformation regarding our critical accounting estimates can be found in our Annual Report, including Note 1 to the financial statements therein. Management has discusse"
}