{
  "source_file": "fe-20250930.htm",
  "form_type": "10-Q",
  "item1_clean": null,
  "item7_clean": null,
  "item2_clean": "Short-term borrowings, net\nProceeds from FET Equity Interest Sale\nNoncontrolling interest cash distributions\nCommon stock dividend payments\nDebt issuance and redemption costs, and other\nFirstEnergy and JCP&L had the following issuances and redemptions during the nine months ended September 30, 2025:\nRedemption / Issuance Date\nFE\nSenior Unsecured Notes\nFE redeemed unsecured notes that became due.\nSenior Unsecured Notes\nTrAIL redeemed unsecured notes that became due.\nSenior Unsecured Notes\nTrAIL redeemed unsecured notes that became due.\nFE\nSenior Unsecured Convertible Notes\nFE repurchased approximately $1,206 million of the principal amount of its 2026 Convertible Notes for $1,225 million, including a premium of approximately $19 million.\nSenior Unsecured Notes\nProceeds were used to redeem senior notes that came due in 2025, to refinance existing debt, for working capital, and for other general corporate purposes.\nATSI\nSenior Unsecured Notes\nProceeds were used to refinance existing debt, to finance capital expenditures, for working capital, and for other general corporate purposes.\nOE\nSenior Unsecured Notes\nProceeds were used to refinance existing debt, to finance capital expenditures, for working capital, and for other general corporate purposes.\nMAIT\nSenior Unsecured Notes\nProceeds were used to refinance existing debt, to finance capital expenditures, for working capital, and for other general corporate purposes.\nPE\nProceeds were used to refinance existing debt, to finance capital expenditures, for working capital, and for other general corporate purposes.\nTE\nSenior Secured Notes\nProceeds were used to refinance existing debt, to finance capital expenditures, and for other general corporate purposes.\nFE\nSenior Unsecured Convertible Notes\nProceeds were used to refinance existing debt, to repurchase a portion of its 2026 Convertible Notes, and for other general corporate purposes.\nFE\nSenior Unsecured Convertible Notes\nProceeds were used to refinance existing debt, to repurchase a portion of its 2026 Convertible Notes, and for other general corporate purposes.\nFET\nSenior Unsecured Notes\nProceeds were used to refinance existing debt, to finance capital expenditures, for working capital, and for other general corporate purposes.\nJCP&L\nSenior Unsecured Notes\nProceeds were used to refinance existing debt, including the repayment of all of the remaining $650 million aggregate principal amount of JCP&L’s 4.30% senior notes due 2026, to finance capital expenditures, and for other general corporate purposes.\nJCP&L\nSenior Unsecured Notes\nProceeds were used to refinance existing debt, including the repayment of all of the remaining $650 million aggregate principal amount of JCP&L’s 4.30% senior notes due 2026, to finance capital expenditures, and for other general corporate purposes.\nJCP&L\nSenior Unsecured Notes\nProceeds were used to refinance existing debt, including the repayment of all of the remaining $650 million aggregate principal amount of JCP&L’s 4.30% senior notes due 2026, to finance capital expenditures, and for other general corporate purposes.\nFE or its affiliates may, from time to time, seek to retire or purchase outstanding debt through open-market purchases, privately negotiated transactions or otherwise. Such repurchases, if any, will be upon such terms and at such prices as FE or its affiliates may determine, and will depend on prevailing market conditions, liquidity requirements, contractual restrictions and other factors.\nConvertible Notes Issuance\nAs set forth above, on June 12, 2025, FE issued $1.35 billion aggregate principal amount of its 2029 Convertible Notes and $1.15 billion aggregate principal amount of its 2031 Convertible Notes.\nThe 2029 Convertible Notes and 2031 Convertible Notes bear interest at a rate of 3.625% per year and 3.875% per year, respectively, payable semiannually in arrears on January 15 and July 15 of each year, beginning on January 15, 2026. The 2029 Convertible Notes and 2031 Convertible Notes are unsecured and unsubordinated obligations of FE and will mature on January 15, 2029 and January 15, 2031, respectively, unless earlier converted or repurchased in accordance with their terms.\nThe notes are included within “Long-term debt and other long-term obligations” on the FirstEnergy Consolidated Balance Sheets. Proceeds from the issuance were approximately $2.47 billion, net of issuance costs.\nHolders may convert notes at their option at any time prior to the close of business on the business day immediately preceding: (i) October 15, 2028, with respect to the 2029 Convertible Notes; and (ii) October 15, 2030, with respect to the 2031 Convertible Notes, only under certain conditions:\nDuring any calendar quarter, if the last reported sale price of FE’s common stock for at least 20 trading days during the period of 30 consecutive trading days ending on, and including, the last trading day of the immediately preceding calendar quarter is greater than or equal to 130% of the conversion price on each applicable trading day;\nDuring the five consecutive business day period immediately after any 10 consecutive trading day period in which the trading price per $1,000 principal amount of the 2029 Convertible Notes and 2031 Convertible Notes for each trading day of such 10 trading-day period was less than 98% of the product of the last reported sale price of FE’s common stock and the conversion rate on each such trading day; or\nUpon the occurrence of certain corporate events specified in the indenture governing the 2029 Convertible Notes and 2031 Convertible Notes.\nOn or after October 15, 2028, in the case of the 2029 Convertible Notes, and on or after October 15, 2030, in the case of the 2031 Convertible Notes, until the close of business on the second scheduled trading day immediately preceding the maturity date of the relevant series of notes, holders may convert all or any portion of their notes of such series at any time, regardless of the foregoing conditions. FE will settle conversions of such notes by paying cash up to the aggregate principal amount of the notes to be converted and paying or delivering, as the case may be, cash, shares of its common stock or a combination of cash and shares of its common stock, at its election, in respect of the remainder, if any, of its conversion obligation in excess of the aggregate principal amount of the notes being converted, subject to the applicable terms of the indentures.\nThe conversion rate for each of the series of notes will initially be 20.9275 shares of FE’s common stock per $1,000 principal amount of such notes (equivalent to an initial conversion price of approximately $47.78 per share of FE’s common stock). The initial conversion price of such notes represents a premium of approximately 20% over the last reported sale price of FE’s common stock on the New York Stock Exchange on June 9, 2025. The conversion rate and the corresponding conversion price will be subject to adjustment in some events but will not be adjusted for any accrued and unpaid interest. In addition, following certain corporate events that occur prior to the maturity date with respect to a series of notes (and, in the case of the 2031 Convertible Notes, if FE delivers a notice of redemption with respect to the 2031 Convertible Notes), FE will, in certain circumstances, increase the conversion rate for a holder who elects to convert its notes of such series in connection with such corporate event or redemption as applicable.\nFE may not redeem the 2029 Convertible Notes prior to the maturity date of the 2029 Convertible Notes. On or after January 15, 2029 and prior to the 40th trading day immediately before the maturity date of the 2031 Convertible Notes, FE may redeem for cash all or any of the portion of the 2031 Convertible Notes, subject to certain partial redemption limitations and only under certain conditions.\nIf FE undergoes a fundamental change (as defined in the relevant indenture), subject to certain conditions, holders of the 2029 Convertible Notes and/or 2031 Convertible Notes may require FE to repurchase for cash all or any portion of their notes at a repurchase price equal to 100% of the principal amount of the convertible notes to be repurchased, plus accrued and unpaid interest to, but excluding, the fundamental change repurchase date (as defined in the relevant indenture). In addition, following certain corporate events that occur prior to the maturity date with respect to a series of convertible notes (and, in the case of the 2031 Convertible Notes, if FE delivers a notice of redemption with respect to the 2031 Convertible Notes), FE will, in certain circumstances, increase the conversion rate for a holder who elects to convert its notes of such series in connection with such corporate event or redemption, as applicable.\nFE Convertible Notes Repurchase\nSeparate from the issuance of the 2029 Convertible Notes and 2031 Convertible Notes, FE repurchased approximately\naggregate principal amount of the 2026 Convertible Notes, using a portion of the proceeds from the offering of the 2029 Convertible Notes and 2031 Convertible Notes described above. FE may, in the future, effect additional repurchases of remaining outstanding 2026 Notes.\nFET Senior Notes and Registration Rights\nOn August 13, 2025, FET issued $450 million of senior unsecured notes due in 2033, in a private offering that included a registration rights agreement in which FET agreed to conduct an exchange offer of these senior notes for the like principal amounts registered under the Securities Act within 366 days of closing of the offering.\nJCP&L Senior Notes and Registration Rights\nOn December 5, 2024, JCP&L issued $700 million of senior unsecured notes due in 2035 in a private offering that included a registration rights agreement in which JCP&L agreed to conduct an exchange offer of these senior notes for like principal amounts registered under the Securities Act. On April 1, 2025, J"
}