{
  "source_file": "ffiv-20250930.htm",
  "form_type": "10-K",
  "item1_clean": "F5 NGINX Plus software delivers cloud-native, Kubernetes-friendly solutions that drive mission-critical applications and APIs with scalability, visibility, security, and governance\nF5 NGINX Plus can be easily integrated into enterprise application workflows and CI/CD pipelines, as well as automation frameworks and ecosystems. F5 NGINX Plus is lightweight and can be used as a per-application ADC, but also scalable and performant enough for an enterprise’s largest and most critical applications. F5 NGINX Plus is also offered as a fully managed native service on the Microsoft Azure Cloud allowing teams to lift-and-shift their applications to the cloud with no configuration change removing the operational burden of self-managed instances from teams.\nF5 NGINX One Console.\nThe F5 NGINX One Console is a unified SaaS management platform designed to streamline the deployment, configuration, monitoring, and administration of NGINX instances across hybrid and multi-cloud environments. Tailored for organizations leveraging NGINX for modern application delivery, the NGINX One Console provides centralized visibility and real-time analytics to optimize application performance, ensure security, and monitor traffic flows. Its intuitive interface simplifies the management of NGINX instances and supports automated workflows, integration with DevOps pipelines, and role-based access controls (\"RBAC\"). By empowering teams to manage containerized and microservices-based applications efficiently, the NGINX One Console enables enterprises to deliver reliable, scalable, and secure applications in increasingly distributed environments.\nF5 NGINX Ingress Controller.\nThe F5 NGINX Ingress Controller provides traffic management for Kubernetes clusters. This solution is deployed at the central point of entry into a Kubernetes cluster and reduces complexity, increases uptime, and provides better insights into application health and performance at scale. This offering is sold in a subscription consumption model that scales with the customer’s Kubernetes cluster size.\nF5 WAF for NGINX is a comprehensive WAF security and denial-of-service (\"DoS\") defense solution designed to protect applications and API’s from advanced Layer 7 attacks. It is a lightweight solution that seamlessly integrates into DevOps environments and is platform-agnostic running across distributed architectures and hybrid environments to deliver consistent protection. It can be used in a variety of the use cases where F5 NGINX Plus is deployed and integrate easily into CI/CD pipelines for automation. F5 WAF for NGINX can be added to subscriptions and is bundled into \"advanced\" offerings for F5 NGINX Ingress Controller.\nF5 BIG-IP.\nOur F5 BIG-IP family of product offerings provide feature-rich, highly programmable and configurable application delivery and security solutions for legacy applications in enterprises and service providers. Also known as traditional applications, legacy applications are based on monolithic, three-tier, or client-server architectures. Such legacy applications are the most ubiquitous application architecture today, and many organizations continue to rely exclusively on legacy applications to power the most mission-critical business applications, customer-facing digital interfaces and internally used applications. For most organizations, the priority around legacy applications is maximizing operational efficiency and minimizing the total cost of ownership. F5 BIG-IP's \"best-of-suite\" approach helps standardize and consolidate application delivery and security functions into a single solution, automating functions and reducing operational cost. The F5 BIG-IP family of products includes packaged software, which are available in subscription and perpetual consumption models, and F5 BIG-IP system offerings.\nF5 BIG-IP Packaged Software.\nF5 BIG-IP packaged software includes a growing portfolio of products that provide the performance and security to deliver applications to end users. F5 BIG-IP Packaged Software offerings include the following:\nF5 BIG-IP application security products include F5 BIG-IP Access Policy Manager that secures and protects user access to applications, F5 BIG-IP Advanced Web Application Firewall that protects applications with behavioral analytics, bot defense and application layer encryption, and F5 BIG-IP SSL Orchestrator that maximizes infrastructure security with encryption/decryption and traffic steering. We also offer F5 BIG-IP Advanced Firewall Manager which drives accurate detection with machine learning, stress monitoring, dynamic signatures, and attack mitigation, F5 BIG-IP Carrier Grade NAT which provides carrier-grade scalability with a high number of IP address translations, fast network address translation setup rates and high-speed logging, and F5 BIG-IP DDoS Hybrid Defender which delivers advanced cloud and on-premises DDoS defenses to ensure real-time protection against volumetric DDoS threats and dynamic network and applications attacks.\nF5 BIG-IP Application Delivery.\nF5 BIG-IP Application Delivery products include F5 BIG-IP Local Traffic Manager which manages network traffic ensuring applications are always fast, available, and secure; F5 BIG-IP DNS which provides hyperscale and security during high query volumes and DNS DDoS attacks; F5 BIG-IP Policy Enforcement Manager which improves network performance through effective policy management; and F5\nBIG-IP Next for Kubernetes which supports ingress and egress traffic management for integration to multiple networks.\nF5 BIG-IP Automation Tool Chain.\nF5 BIG-IP Automation Tool Chain is a set of automation tools that make it faster and easier to deploy and configure F5 application services. Via the F5 Automation Tool Chain, F5 BIG-IP capabilities easily integrate into orchestration frameworks such as Ansible, HashiCorp Terraform, OpenShift, and Cloud Foundry as part of a CI/CD pipeline.\nF5 BIG-IQ Centralized Management.\nF5 BIG-IQ simplifies, enhances management of, and reduces customer operational costs associated with F5 BIG-IP deployments through central management, analytics, and automation for F5 BIG-IP instances.\nF5 BIG-IP systems are designed to enhance the performance of our software by leveraging a combination of custom field-programmable gate array (\"FPGA\") logic and off-the-shelf silicon, providing customers a balance of cost and flexibility. All of our systems run all available F5 BIG-IP software modules. Our next-generation hardware, rSeries systems and VELOS chassis and blades are designed to enable enhanced automation and multi-tenancy, a capability that enables running multiple versions of F5 BIG-IP software on the same system thereby making it easy to migrate from one version to another with minimal or no downtime.\nAs F5 expands its reach and role into a broader set of hybrid multicloud application delivery and security solutions, our competitive set evolves and includes vendors with capabilities associated with application delivery, application security, and multicloud networking.\nThe principal competitive factors in the markets in which we compete include deployment model, consumption model, ecosystem integrations, features and performance, customer support, brand recognition, scope of distribution and sales channels, and pricing. We believe we generally compete favorably on the basis of these factors because of our robust solutions and services, our ability to deliver and secure any application, and any API, anywhere, and our platform approach.\nTo provide a unified experience across all our offerings, we have introduced the F5 ADSP. With the F5 ADSP, customers can leverage the full strength of our broad portfolio with capabilities to enhance security, scalability, and operational efficiency while enabling key capabilities such as policy management, analytics, and automation.\nWhile customers broadly are expressing increasing preference for a platform approach that simplifies complexity and eliminates operational burden, we also compete on a point-solution basis. Within application delivery, our customers have the best of both worlds: reliability that F5’s always been known for – across any environment from on-premises to multicloud; and agility and flexibility enabled by lightweight modern technologies, without compromising security or manageability. Our F5 BIG-IP offerings compete against Citrix and Broadcom. Our lightweight, agile, developer-friendly F5 NGINX offerings, which provide capabilities like optimizing Kubernetes traffic management and load balancing cloud-native and hybrid cloud applications compete against Amazon Web Services (\"AWS\"), Google Cloud Platform, Envoy, and HAProxy.\nIn application security, we compete with vendors that offer web application firewall, bot detection and mitigation, API protection, carrier-grade firewall, carrier-grade network address translation (\"NAT\"), SSL orchestration, access policy management, and DDoS mitigation including Akamai, Cisco, Cloudflare, Fortinet, Juniper Networks, Palo Alto, Radware, and Thales (Imperva).\nF5 Distributed Cloud Services use cases include application and API security delivered as SaaS, as well as multicloud networking. F5 competes with traditional edge players including Akamai, Cloudflare and Fastly, as well as networking vendors including Broadcom and Cisco, and pure-play vendors like Aviatrix, and public cloud providers.\nWe outsource the manufacturing of our products to various manufacturing partners, including our primary third-party manufacturer service provider, Flex Ltd. (\"Flex\"), to manufacture our hardware systems according to our specifications. Assembly, quality control and systems testing are carried out at Flex's facilities in Guadalajara, Mexico and Zhuhai, China. Additionally, Flex manages material procurement and fulfillment activities on our behalf, ensuring we maintain high standards of efficiency and scalability across our operations. Systems built in Guadalajara are shipped to the Flex fulfillment center in Memphis, Tennessee for distribution primarily to distributors, value-added resellers, or end-users in the Americas and EMEA. Systems built and fulfilled in Zhuhai are distributed to partners and customers in APAC. Title to the products transfers from Flex to us and then to our customers upon shipment from a designated fulfillment location.\nOur sales and operations planning cadence provides Flex and other partners with a rolling demand forecast. This approach enables our manufacturing partners to plan for the appropriate stock levels of raw materials and manufacturing line capacity, resulting in the right finished goods inventories to meet our end-user demand. The components for our hardware products consist of commodity parts and custom components. The component parts within our products are either sourced by our manufacturing partners or by us from various component suppliers. F5 has established a robust and resilient global hardware supply chain. We continuously monitor areas of potential impact within our supply chain, such as geopolitical, supplier, and other risk factors, as well as proactively take steps to minimize disruptions, including securing alternate supply when applicable.\nWe evaluate opportunities to acquire complementary businesses, technologies, services, and intellectual property to complement our organic innovation and research and development efforts, advance the development of our platforms, and enable further investment in our key priority areas. Our evaluation of acquisition opportunities seeks to confirm that any potential transaction would accelerate our strategy, represent an attractive customer opportunity, address a customer need, align with our customer base and go-to-market strategy, and present a clear timeline and path for value accretion. Our acquisitions enable us to gain access to talent, technology, products and features, and can range in size and complexity, from those that enhance or co",
  "item7_clean": "Management’s Discussion and Analysis of Financial Condition and Results of Operations\nF5 is a global leader in application delivery and security solutions which enables its customers to deploy, operate, secure, optimize, and govern every application and API across on-premises architectures, in the cloud, and at the network edge. Our cloud, software, and hardware solutions enable our customers to deliver fast, available, and secure digital experiences to their customers at scale. Our application services are available as hardware, software, SaaS, and software-only solutions optimized for hybrid, multicloud environments, with modules that can run independently, or as part of an integrated solution on our high-performance appliances. We market and sell our products primarily through multiple indirect sales channels in our Americas; Europe, the Middle East, and Africa (\"EMEA\"); and Asia Pacific (\"APAC\") regions. Enterprise customers (Fortune 1000 or Business Week Global 1000 companies) in the technology, financial services, transportation, education, manufacturing, and health care industries, along with government customers, and service providers continue to make up the largest percentage of our customer base.\nOur management team monitors and analyzes a number of key performance indicators in order to manage our business and evaluate our financial and operating performance on a consolidated basis. Those indicators include:\n. Our revenue is derived from the sales of both products and services. The majority of our product revenues are derived from sales of our application delivery and security solutions including our F5 BIG-IP software and systems, F5 NGINX software, and our F5 Distributed Cloud Services offerings. Our F5 BIG-IP software solutions are sold both on a subscription and perpetual license basis. We sell F5 NGINX on a subscription basis as deployable software or SaaS. F5 Distributed Cloud Services provides security, multicloud networking, and edge-based computing solutions and are offered on a subscription basis, under a unified SaaS platform and managed service platform. Our services revenue includes annual maintenance contracts, training and consulting services.\nWe monitor the sales mix of our revenues within each reporting period. We believe customer acceptance rates of our new products, feature enhancements and consumption models are indicators of future trends. We also consider overall revenue concentration by geographic region as an additional indicator of current and future trends. In fiscal 2025, we benefited from improving customer demand, which began to stabilize and improve following macroeconomic uncertainties at the start of fiscal 2024.\nCost of revenues and gross margins.\nWe strive to control our cost of revenues and thereby maintain our gross margins. Significant items impacting cost of revenues are hardware costs paid to our contract manufacturers, third-party software license fees, technology costs, including cloud hosting and software licenses expenses, amortization of developed technology and personnel and overhead expenses. In addition, factors such as sales price, product and services mix, inventory obsolescence, returns, component price increases, warranty costs, and global supply chain constraints could significantly impact our gross margins.\nOperating expenses are substantially driven by personnel and related overhead expenses. Existing headcount and future hiring plans are the predominant factors in analyzing and forecasting future operating expense trends. Other significant operating expenses that we monitor include costs associated with cyber and enterprise-wide security, marketing and promotions, travel, professional fees, technology costs, including cloud hosting and software licenses expenses, related to the development of new products and provision of services, facilities and depreciation expenses.\nLiquidity and cash flows.\nOur financial condition remains strong with significant cash and investments. The increase in cash and investments for fiscal year 2025 was primarily due to cash provided by operating activities of $949.7 million, partially offset by $502.1 million of cash used for the repurchase of outstanding common stock under our stock repurchase program, including the payment of related excise taxes. In addition, $171.1 million of cash was used for the acquisition of businesses during fiscal 2025, and $43.3 million of cash was used for capital expenditures related to the expansion of our facilities to support our operations worldwide, as well as investments in technology, including cloud hosting and software licenses, and equipment purchases to support our core business activities. Going forward, we believe the primary driver of cash flows will\ncontinue to be net income from operations. We will continue to evaluate possible acquisitions of, or investments in businesses, products, or technologies that we believe are strategic, which may require the use of cash. Additionally, on January 31, 2020, we entered into a Revolving Credit Agreement (the \"Revolving Credit Agreement\") that provides for a senior unsecured revolving credit facility in an aggregate principal amount of $350.0 million (the \"Revolving Credit Facility\"). On January 31, 2025, the Revolving Credit Facility expired. At the time of expiration, there were no outstanding borrowings under the Revolving Credit Facility.\nWe view cash, short-term and long-term investments, deferred revenue, accounts receivable balances and days sales outstanding as important indicators of our financial health. Deferred revenues continued to increase in fiscal 2025 due to an increase in deferred subscription contracts, including SaaS and maintenance associated with licensed-based subscriptions, which includes sales as part of our Flexible Consumption Program. Our days sales outstanding for the fourth quarter of fiscal year 2025 was 46. Days sales outstanding is calculated by dividing ending accounts receivable by revenue per day for a given quarter.\nOn October 15, 2025, we disclosed information about a Cyber Incident in which a highly sophisticated nation-state threat actor had gained unauthorized long-term, persistent access to certain Company systems, and exfiltrated certain files, some of which contained certain portions of our BIG-IP source code and information about undisclosed vulnerabilities that our engineering teams were working on in BIG-IP. Upon identifying the threat, we immediately activated our incident response process and took extensive actions to contain the threat actor, which included engaging leading external cybersecurity experts. Our investigation, monitoring, and related activities related to the incident are ongoing. To date, we believe our containment actions have been successful, and since the initiation of these efforts, we have not observed any evidence of new unauthorized activity.\nTo date, we are not aware of any undisclosed critical or remote code vulnerabilities, and we are not aware of active exploitation of any undisclosed vulnerabilities within our products. Further, to date, we have no evidence of modification to our software supply chain, including our source code and our build and release pipelines. This assessment has been validated through independent reviews by leading cybersecurity research firms. We have no evidence that the threat actor accessed or modified the NGINX source code or product development environment, nor do we have evidence they accessed or modified our F5 Distributed Cloud Services or Silverline systems. In response to the incident, we have prioritized delivering reliable software release updates to address all undisclosed high vulnerabilities in BIG-IP source code, with a significant number of our largest customers having completed these updates with minimal disruption. We have, and will continue to prioritize steps to bolster our security posture in implementing further measures to strengthen our security environment and protect our customers.\nCritical Accounting Estimates\nOur consolidated financial statements have been prepared in accordance with accounting principles generally accepted in the United States of America. The preparation of these financial statements requires us to make estimates and judgments that affect the reported amounts of assets, liabilities, revenues and expenses, and related disclosure of contingent assets and liabilities. We base our estimates on historical experience and on various other assumptions that are believed to be reasonable under the circumstances. Actual results may differ from these estimates under different assumptions or conditions.\nWe believe that, of our significant accounting policies, which are described in Note 1 of the notes to the consolidated financial statements, the following accounting policy involves a greater degree of judgment and complexity. Accordingly, we believe the following policy is the most critical to aid in fully understanding and evaluating our consolidated financial condition and results of operations.\nRevenue Recognition.\nThe majority of our contracts with our customers include various combinations of our products and subscriptions and support. Our hardware products and software licenses are distinct from our subscriptions and support services as the customer can benefit from the product without these services and such services are separately identifiable within the contract. We account for multiple agreements with a single customer as a single contract if the contractual terms and/or substance of those agreements indicate that they may be so closely related that they are, in effect, parts of a single contract. The\namount of consideration we expect to receive in exchange for delivering on the contract is allocated to each performance obligation based on its relative standalone selling price.\nWhen estimating standalone selling price, we first consider the prices charged for a deliverable when sold separately. If the standalone selling price is not observable through past transactions, we estimate it based on our pricing model and our go-to-market strategy, which include factors such as target gross margins, the geographies in which our offerings were sold, and offering type (products or services). As our business offerings evolve over time, we may be required to modify our estimated standalone selling prices, and as a result the timing and classification of our revenue could be affected.\nImpact of Macroeconomic Conditions\nOur overall performance depends in part on worldwide economic and geopolitical conditions and their impacts on customer behavior. Uncertain economic conditions, including inflation, tariffs and other duties, higher interest rates, slower growth, fluctuations in foreign exchange rates, and other changes in economic conditions, may adversely affect our results of operations and financial performance. For further discussion of the potential impacts of recent macroeconomic events on our business, financial condition, and operating results, see Part I, Item 1A titled \"Risk Factors.\"\nResults of Operations\n\n(in thousands, except percentages)\nCost of net revenues and gross profit\nPercentage of net revenues and gross margin (as a percentage of related net revenue)\nCost of Net Product Revenues.\nCost of net product revenues consist of finished products purchased from our contract manufacturers, personnel costs, including the salaries, stock-based compensation, and related benefits of our personnel, manufacturing overhead, freight, warranty, provisions for excess and obsolete inventory, technology costs, including cloud hosting and software licenses expenses, facilities and depreciation expenses, and amortization expenses in connection with developed technology from acquisitions. Cost of net product revenues increased primarily due to systems and software revenue growth. The increase was largely offset by an improvement in product margins driven by a more favorable product mix.\nCost of Net Service Revenues.\nCost of net service revenues consist of personnel costs, including the salaries, stock-based compensation, and related benefits of our professional services personnel, travel, technology costs, including cloud hosting and software licenses expenses, facilities and depreciation expenses. Cost of net service revenues increased $14.5 million, or 6.6% in fiscal year 2025 from the prior year. The increase in cost of net service revenues was primarily due to an increase in personnel costs.\n\n(in thousands, except percentages)\nResearch and development\nGeneral and administrative\nRestructuring charges\nOperating expenses (as a percentage of net revenue)\nResearch and development\nGeneral and administrative\nRestructuring charges\nSales and Marketing.\nSales and marketing expenses consist of personnel costs, including the salaries, commissions, stock-based compensation, and related benefits of our sales and marketing personnel, the costs of our marketing programs, including public relations, advertising and trade shows, travel, facilities, technology costs, including cloud hosting and software licenses expenses, facilities and depreciation expenses. Sales and marketing expense increased $28.2 million, or 3.4% in fiscal year 2025 from the prior year. The increase in sales and marketing expense for fiscal year 2025 was primarily due to an increase of $20.6 million in personnel costs. Sales and marketing headcount at the end of fiscal year 2025 increased to 2,186 from 2,165 at the end of fiscal year 2024. In addition, technology expenditures to support the sales and marketing organization increased $6.5 million in fiscal year 2025 from the prior year.\nResearch and Development.\nResearch and development expenses consist of personnel costs, including the salaries, stock-based compensation, and related benefits of our product development personnel, prototype materials and other expenses related to the development of new and improved products, technology costs, including cloud hosting and software licenses expenses,\nfacilities, depreciation and amortization expenses. Research and development expense increased $49.7 million, or 10.1% in fiscal year 2025 from the prior year. The increase in research and development expense for fiscal year 2025 was primarily due to an increase of $31.4 million in personnel costs. In addition, technology costs to support the research and development organization increased $18.9 million in fiscal year 2025 from the prior year.\nGeneral and Administrative.\nGeneral and administrative expenses consist of personnel costs, including the salaries, benefits and related costs of our executive, finance, information technology, human resource and legal personnel, third-party professional service fees, bad debt charges, technology costs, including cloud hosting and software licenses expenses, facilities and depreciation expenses. General and administrative expense increased $53.5 million, or 19.9% in fiscal year 2025 from the prior year. The increase in general and administrative expense for fiscal year 2025 was primarily due to an increase of $25.8 million in personnel costs. General and administrative headcount at the end of fiscal year 2025 increased to 898 from 875 at the end of fiscal year 2024. In addition, fees paid for professional services increased $19.7 million in fiscal year 2025 from the prior year, primarily due to activity related to acquisitions.\nRestructuring charges\n. In the first and fourth fiscal quarters of 2025, and the first fiscal quarter of 2024, we completed restructuring plans to better align strategic and financial objectives, optimize operations, and drive efficiencies for long-term growth and profitability. As a result of the first and fourth quarters of fiscal 2025 restructuring initiatives, we recorded charges of $11.3 million and $14.3 million, net of adjustments, related to reductions in workforce that are reflected in our results for fiscal 2025. As a",
  "item2_clean": null
}