{
  "source_file": "fico-20250930.htm",
  "form_type": "10-K",
  "item1_clean": "We specialize in solutions that empower businesses to operationalize analytics to uncover new opportunities, make timely decisions that matter, and execute them at scale. With more than 65 years of analytics and software experience, we have found that bringing human and digital intelligence together allows our customers to target and acquire customers more efficiently, increase customer value, reduce fraud and credit losses, lower operating expenses, and enter new markets more profitably.\nOur principal areas of research and development expertise are focused on the following four analytic domains.\nPredictive modeling identifies and mathematically represents underlying relationships in historical data to make predictions or classifications about future events. Predictive models typically analyze current and historical data about individuals to produce easily understood metrics such as scores. These scores rank-order individuals or specific transactions against a particular variable such as the likelihood of making credit payments on time, the likelihood of a transaction being fraudulent or the probability of responding to a particular offer for services. Our predictive models are frequently used in mission-critical transactional systems and drive decisions and actions in near real time.\nSeveral analytic methodologies underlie our products in this area. These include proprietary applications of both linear and nonlinear optimization algorithms, advanced neural systems, machine learning and artificial intelligence (“AI”). We also apply various statistical techniques for analysis and pattern detection within large datasets and can derive insights and predictive features from various forms of data, including unstructured data.\nDecision Analysis and Optimization\nDecision analysis refers to the broad quantitative field that deals with modeling, analyzing, and optimizing decisions made by individuals, groups, and organizations. Whereas predictive models analyze multiple aspects of individual behavior to forecast future behavior, decision analysis analyzes multiple aspects of a given decision to identify the most effective action to take to reach a desired result. This is often referred to as prescriptive analytics. Our integrated approach to decision analysis incorporates a decision model that mathematically maps the entire decision structure; proprietary optimization technology that identifies the most effective strategies, given both the performance objective and constraints; testing and simulation required for active, continuous learning; and the robust extrapolation of an optimized strategy to a wider set of scenarios than historically encountered. Our optimization capabilities also include native support for Python modeling, as well as our own proprietary mathematical modeling and programming language, an easy-to-use authoring environment, a configurable business simulation and scenario management interface and a set of pre-built optimization algorithms.\nTransaction Profiling\nTransaction profiling is a patent-protected technique used to extract meaningful information and reduce the complexity of transaction data used in modeling. Many of our products operate using transactional data, such as credit card purchase transactions, consumer interactions, or other types of data that change over time. In its raw form, this data is very difficult to use in predictive models for several reasons. First, an isolated transaction contains very little information about the behavior of the individual who generated the transaction. Second, transaction patterns change rapidly over time. Third, this type of data can often be highly complex. To overcome these issues, we have developed a set of techniques that transform raw transactional data into a mathematical representation that reveals latent information, and which make the data more usable by predictive models. This profiling technology accumulates data across multiple transactions of many types to create and update profiles of transaction patterns. These profiles enable our neural network models to efficiently and effectively make accurate assessments of, for example, fraud risk and credit risk within real-time transaction streams.\nCustomer Data Integration\nDecisions made about customers or prospects can benefit from data stored in multiple sources, both inside and outside the enterprise. In the areas of analytics and digital decisioning, more data is generally better. We have developed proprietary data ingestion and management tools that are able to assemble and integrate disparate data sources into a unified view of the customer, household, or other subject through the application of persistent keying technology. This data can include structured or unstructured data. In addition, our technology can integrate multiple data sources in real-time and make them available for rapid analysis and decisions such as credit approval, fraud detection and “next best offer” workflows.\nWe believe our analytic tools and solutions are among the best commercially available, and that we are uniquely positioned to integrate advanced analytic, software and data technologies into mission-critical business solutions that offer superior returns on investment.\nFICO\nFICO\nPlatform is an analytic and decisioning environment that empowers businesses to configure solutions that orchestrate and operationalize high velocity decisions that matter, at scale. Users of FICO Platform can bring together data from multiple sources, apply advanced analytics to derive insights, and translate those insights into actions and workflows that can be executed in real-time. Based on a modular cloud architecture, FICO Platform can be configured by our customers to solve a vast array of business challenges. FICO Platform delivers increasing value to our customers over time as they add additional analytic capabilities, configure their own solutions or utilize pre-configured solutions to address a diverse set of use cases and integrate disparate analytic and decisioning silos onto a centralized, scalable platform. This drives additional subscription software revenue for FICO over time as customers purchase more FICO Platform capabilities and pay for more usage of those capabilities.\nOur goal is to move substantially all of FICO’s current software products onto FICO\nPlatform. Many capabilities of FICO’s current software products are now part of FICO Platform, addressing use cases such as origination, fraud detection, customer management, and next best action, among others. We believe this strategy of moving our software products to FICO Platform will result in revenue growth through follow-on “land and expand” sales to existing FICO Platform customers and more sales to medium-sized businesses typically served through value-added resellers and systems integrators.\nOur annual recurring revenue (“ARR”) from FICO\nPlatform based products was $263.6 million as of September 30, 2025, representing 35% of our total software ARR. For information about ARR, refer to Part II, Item 7,\nManagement’s Discussion and Analysis of Financial Condition and Results of Operations, Annual Recurring Revenue\nWe sell our software primarily as analytic and decisioning software or pre-configured solutions. Our software offerings are sold both individually and as integrated bundles of multiple products.\nAnalytic and Decisioning Software\nFICO analytic and decisioning software offerings use proprietary and open source microservices and capabilities to enable both business users and data scientists to develop and execute advanced analytics and decision modeling. Our key products in this category include:\nFICO\nDecision Modeler and FICO\nare our core decision rules modeling tools, which enable users to flexibly author and manage decision rules and strategies. FICO Decision Modeler delivers the functionality of our industry leading FICO Blaze Advisor product, with the added benefit of seamless integration into FICO\nPlatform. FICO Blaze Advisor, the predecessor to FICO Decision Modeler, is available as an off-platform product.\nFICO\nXpress Optimization provides operations research professionals and business analysts with world-class solvers and productivity tools to determine optimal outcomes for a wide range of industry problems. FICO Xpress Optimization includes a powerful modeling and programming language to quickly model and solve even the largest optimization problems. FICO Xpress Optimization runs on FICO\nFICO\nAnalytics Workbench is a predictive analytics tool that allows businesses to create and deploy explainable machine learning models for use in decisions that typically require strict governance and compliance, often including regulatory oversight. FICO Analytics Workbench runs on FICO\nFICO\nData Orchestrator is a data retrieval and mapping solution that can access, gather, and transform data from corporate or public facing information services. FICO Data Orchestrator runs on FICO\nFICO\nDMP Streaming is a real-time and batch data ingestion solution that uniquely delivers in-stream analytics for real-time data insights and complex event processing.\nFICO\nBusiness Outcome Simulator enables business users to run a wide variety of insightful scenarios to assess how their business is likely to perform under varying conditions and assumptions. It unlocks insights into how key outcomes will likely shift in the face of changing competitor strategy, macroeconomic changes, evolving customer preferences, and more. FICO Business Outcome Simulator runs on FICO\nFICO\nDecision Optimizer helps business users understand how different customers will react to a variety of different actions that are being considered. Once that link is understood, FICO Decision Optimizer identifies the combination of actions most likely to lead to the desired portfolio outcomes through decisions such as who to offer a new product, what limit and/or price to offer, or how to treat delinquent customers. FICO Decision Optimizer runs on FICO\nPre-Configured Solutions\nFICO's pre-configured solutions optimize customer interactions in real-time, driving greater customer engagement and improving business results. They enable acquisition and growth marketing, account activation and management, omni-channel communication, risk assessment, and fraud detection and prevention. Key FICO solutions currently offered include:\nFICO\nFraud Solutions empower organizations to safeguard the business and their customers from payments fraud and application fraud. Leveraging advanced analytic capabilities on a large scale and in real-time, FICO Fraud Solutions identify fraud and enable strategies designed to prevent fraud across payment cards, money transfers, and instances where stolen or synthetic identities are exploited to open accounts. Our models are continually improved using a proprietary, global data set of transaction data contributed by more than 10,000 institutions that participate in the FICO\nIntelligence Network. Certain Fraud Solutions capabilities are available on FICO\nPlatform today, and we plan to make additional Fraud Solutions capabilities available on FICO Platform in the future.\nFICO\nOriginations Solution is an application-to-decision credit originations solution. It enables banks, credit unions, finance companies, online lenders, auto lenders, and other companies to automate and improve the processing of requests for credit. Our Originations Solution increases the speed, consistency and efficiency with which requests are handled, reducing losses, and increasing approval rates through the application of sophisticated policies and analytics that assess applicant risk and reduce the need for manual review by underwriters. Originations capabilities are available on FICO\nFICO\nCustomer Communication Service is an intelligent omnichannel digital communication manager for resolving customer interactions. It enables businesses to automate individualized customer dialogues",
  "item7_clean": "Research and development\nSelling, general and administrative\nAmortization of intangible assets\nRestructuring charges\nGain on product line asset sale\nTotal operating expenses\nInterest expense, net\nIncome before income taxes\nProvision for income taxes\nCost of revenues consists primarily of employee salaries, incentives, and benefits for personnel directly involved in delivering software products, operating SaaS infrastructure, and providing support, implementation and consulting services; overhead, facilities and data center costs; software royalty fees; consumer reporting agency data and processing services; third-party hosting fees related to our SaaS services; travel costs; and outside services.\nThe fiscal 2025 over 2024 increase in cost of revenues of $5.5 million was primarily attributable to an $8.7 million increase in infrastructure and facilities costs, partially offset by a $2.1 million decrease in outside services costs and a $1.4 million decrease in personnel and labor costs. The increase in infrastructure and facilities costs was primarily attributable to an increase in third-party data center hosting costs and an increase in depreciation on data center computer hardware. The decrease in outside services costs was primarily attributable to decreased third-party contractor costs. The decrease in personnel and labor costs was primarily attributable to decreased incentive expense. Cost of revenues as a percentage of revenues decreased to 18\nduring fiscal 2025 from 20% during fiscal 2024, primarily due to increased sales of our higher-margin Scores products.\nResearch and Development\nResearch and development expenses include personnel and related overhead costs incurred in the development of new products and services, including research of mathematical and statistical models and development of new versions of Software products.\nThe fiscal 2025 over 2024 increase in research and development expenses of $16.4 million was primarily attributable to a $6.9 million increase in infrastructure and facilities costs, a $5.7 million increase in outside services costs, and a $3.8 million increase in personnel and labor costs. The increase in infrastructure and facilities costs was primarily attributable to increased third-party data center hosting costs and\nthird-party SaaS services costs.\nThe increase in outside services costs was primarily attributable to increased third-party contractor costs. The increase in personnel and labor costs was primarily attributable to increased headcount. Research and development expenses as a percentage of revenues decreased to\nduring fiscal 2025 from 10% during fiscal 2024.\nSelling, General and Administrative\nSelling, general and administrative expenses consist principally of employee salaries, incentives, commissions and benefits; travel costs; overhead costs; advertising and other promotional expenses; corporate facilities expenses; legal expenses; and business development expenses.\nThe fiscal 2025 over 2024 increase in selling, general and administrative expenses of $50.2 million was primarily attributable to a $23.7 million increase in personnel and labor costs, a $22.4 million increase in advertising and other promotional costs, and a $3\nmillion increase in travel costs. The increase in personnel and labor costs was primarily attributable to increased headcount, market base-pay adjustments, commission expense, and share-based compensation expense, partially offset by decreased fringe benefit costs related to our supplemental retirement and savings plan. The increase in advertising and other promotional costs was primarily attributable to increased costs for advertising campaigns and corporate events. The increase in travel costs was primarily attributable to promotional and corporate events. Selling, general and administrative expenses as a percentage of revenues decreased to 26\nduring fiscal 2025 from 27% during fiscal 2024.\nRestructuring Charges\nDuring the fourth quarter of fiscal 2025, we incurred charges of\nmillion in employee separation costs due to the elimination of 226 positions throughout the Company. Cash payments for all the employee separation costs will be paid by the end of our fiscal 2026.\nInterest Expense, Net\nInterest expense includes interest on the senior notes issued in May 2025, December 2021, December 2019, and May 2018, as well as interest and credit agreement fees on the revolving line of credit and term loans. On our consolidated statements of income and comprehensive income, interest expense is netted with interest income, which is derived primarily from the investment of funds in excess of our immediate operating requirements.\nThe fiscal 2025 over 2024 increase in net interest expense of $28.0 million was primarily attributable to the $1.5 billion of 2025 Senior Notes (as defined below), partially offset by a lower average outstanding balance and a lower average interest rate on borrowings under our credit agreement during fiscal 2025.\nOther income, net consists primarily of unrealized investment gains/losses and realized gains/losses on marketable securities classified as trading securities, exchange rate gains/losses resulting from remeasurement of foreign-currency-denominated receivable and cash balances held by our various reporting entities into their respective functional currencies at period-end market rates, net of the impact of offsetting foreign currency forward contracts, and other non-operating items.\nThe fiscal 2025 over 2024 decrease in other income, net of $2.6 million was primarily attributable to a\nin net unrealized gains on investments classified as trading securities in our supplemental retirement and savings plan, partially offset by an\nin net exchange rate gains resulting from remeasurement of foreign-currency-denominated receivable and cash balances held by our various reporting entities into their respective functional currencies at period-end market rates, net of the impact of offsetting foreign currency forward contracts.\nProvision for Income Taxes\nOur effective income tax rates were 18.8%, 20.1% and 22.4% in fiscal 2025, 2024 and 2023, respectively.\nThe decrease in our effective tax rate in fiscal 2025 compared to fiscal 2024 was due to an increase in excess tax benefits related to share-based compensation.\n\nRevolving line of credit\nInterest due on Senior Notes\nOperating lease obligations\nFinance lease obligations\nPurchase obligations\nUnrecognized tax benefits\nRepresents the unpaid principal payments due under the Senior Notes and revolving line of credit.\nRepresents purchase obligations primarily consisting of commitments to purchase certain services. For services that have been delivered under these arrangements as of September 30, 2025, we recorded related liabilities within accounts payable or other accrued liabilities on our consolidated balance sheet, which are excluded from the purchase obligations amount.\nRepresents unrecognized tax benefits related to uncertain tax positions. As we are not able to reasonably estimate the timing of the payments or the amount by which the liability will increase or decrease over time, the related balances have not been reflected in the section of the table showing payment by fiscal year.\nCRITICAL ACCOUNTING ESTIMATES\nWe prepare our consolidated financial statements in conformity with U.S. GAAP. These accounting principles require management to make certain judgments and assumptions that affect the reported amounts of assets and liabilities and the disclosure of contingent assets and liabilities as of the date of the financial statements, and the reported amounts of revenues and expenses during the reporting period. We periodically evaluate our estimates including those relating to revenue recognition, goodwill resulting from business combinations and other long-lived assets – impairment assessment, share-based compensation, income taxes, and contingencies and litigation. We base our estimates on historical experience and various other assumptions that we believe to be reasonable based on the specific circumstances, the results of which form the basis for making judgments about the carrying value of certain assets and liabilities that are not readily apparent from other sources. Actual results may differ from these estimates and such differences could be material to our financial condition and results of operations. Critical accounting estimates are those that involve a significant level of estimation uncertainty and have had or are reasonably likely to have a material impact on our financial condition and results of operations.\nWhile our significant accounting policies are more fully described in Note 1 and Note 9 to our consolidated financial statements included elsewhere in this report, we believe the following accounting policies require the most critical accounting estimates, which involve significant subjectivity and judgment, and changes to such estimates or assumptions could have a material impact on our financial condition or operating results. Therefore, we consider an understanding of the variability and judgment required in making these estimates and assumptions to be critical in fully understanding and evaluating our reported financial results.\nFor our SaaS subscriptions, we estimate the total variable consideration at contract inception — subject to any constraints that may apply — and update the estimates as new information becomes available and recognize the amount ratably over the SaaS service period, unless we determine it is appropriate to allocate the variable amount to each distinct service period and recognize revenue as each distinct service period is performed. Variable consideration is included in the transaction price if, in our judgment, it is probable that a significant future reversal of cumulative revenue recognized under the contract will not occur. Variable consideration is estimated based on either the expected value or the most likely amount method depending on which method we expect to better predict the amount of consideration to which we will be entitled. Our estimates of variable consideration are based largely on an assessment of our anticipated performance and all information (historical, current and forecasted) that is reasonably available to us at contract inception and require judgment. For the periods presented, we have not experienced significant changes to our estimates and judgments related to variable consideration in our contracts.\nOur contracts with customers often include promises to transfer multiple products and services to a customer. Determining whether products and services are considered distinct and should be accounted for separately may require significant judgment. Specifically, when implementation service is included in the original software or SaaS offerings, judgment is required to determine if the implementation service significantly modifies or customizes the software or SaaS service in such a way that the risks of providing it and the customization service are inseparable. In rare instances, contracts may include significant modification or customization of the software of SaaS service and will result in the combination of software or SaaS service and implementation service as one performance obligation. For the periods presented, we have not experienced significant changes to our estimates and judgments related to the identification of performance obligations for our contracts.\nWe determine the standalone selling prices (“SSP”) using data from our historical standalone sales, or, in instances where such information is not available (such as when we do not sell the product or service separately), we consider factors such as the stated contract prices, our overall pricing practices and objectives, go-to-market strategy, size and type of the transactions, and effects of the geographic area on pricing, among others. When the selling price of a product or service is highly variable, we may use the residual approach to determine the SSP of that product or service. Significant judgment may be required to determine the SSP for each distinct performance obligation when it involves the consideration of many market conditions and entity-specific factors discussed above. For the periods presented, we have not experienced significant changes to our estimates and judgments related to the determination of our SSPs.\nGoodwill and Other Long-Lived Assets - Impairment Assessment\nGoodwill represents the excess of cost over the fair value of identifiable assets acquired and liabilities assumed in business combinations. We assess goodwill for impairment for each of our reporting units on an annual basis during our fourth fiscal quarter using a July 1 measurement date unless circumstances require a more frequent measurement.\nWe have determined that our reporting units are the same as our reportable segments. When evaluating goodwill for impairment, we may first perform an assessment qualitatively whether it is more likely than not that a reporting unit's carrying amount exceeds its fair value, referred to as a “step zero” approach. If, based on the review of the qualitative factors, we determine it is not more likely than not that the fair value of a reporting unit is less than its carrying value, we would bypass the two-step impairment test. Events and circumstances we consider in performing the “step zero” qualitative assessment include macro-economic conditions, market and industry conditions, internal cost factors, share price fluctuations, and the operational stability and overall financial performance of the reporting units. If we conclude that it is more likely than not that a reporting unit's fair value is less than its carrying amount, we would perform the first step (“step one”) of the two-step impairment test and calculate the estimated fair value of the reporting unit by using discounted cash flow valuation models and by comparing our reporting units to guideline publicly-traded companies. These methods require estimates of our future revenues, profits, capital expenditures, working capital, and other relevant factors, as well as selecting appropriate guideline publicly-traded companies for each reporting unit. We estimate these amounts by evaluating historical trends, current budgets, operating plans, industry data, and other relevant factors. Alternatively, we may bypass the qualitative assessment described above for any reporting unit in any period and proceed directly to performing step one of the goodwill impairment test.\nOur other long-lived assets are assessed for potential impairment when there is evidence that events and circumstances related to our financial performance and economic environment indicate the carrying amount of the assets may not be recoverable. When impairment indicators are identified, we test for impairment using undiscounted projected cash flows. If such tests indicate impairment, then we measure and record the impairment as the difference between the carrying value of the asset and the fair value of the asset. Significant management judgment is required in forecasting future operating results used in the preparation of the projected cash flows. Should different conditions prevail, material write downs of our other long-lived assets could occur.\nAs discussed above, while we believe that the assumptions and estimates utilized were appropriate based on the information available to management, different assumptions, judgments and estimates could materially affect our impairment assessments for our goodwill and other long-lived assets. For the periods presented, we have not experienced significant changes to our estimates and judgments related to our goodwill or other long-lived assets impairment assessment. We believe our projected operating results and cash flows would need to be significantly less favorable to have a material impact on our impairment assessment. However, based upon our",
  "item2_clean": null
}