{
  "source_file": "fico-20250630.htm",
  "form_type": "10-Q",
  "item1_clean": null,
  "item7_clean": null,
  "item2_clean": "Our Scores segment includes our business-to-business (“B2B”) scoring solutions and services which give our clients access to predictive credit and other scores that can be easily integrated into their transaction streams and decision-making processes. This segment also includes our business-to-consumer (“B2C”) scoring solutions, including our myFICO.com subscription offerings.\nOur Software segment includes pre-configured analytic and decision management solutions designed for a specific type of business need or process — such as account origination, customer management, customer engagement, fraud detection, and marketing — as well as associated professional services. This segment also includes FICO\nPlatform, a modular software offering designed to support advanced analytic and decision use cases, as well as stand-alone analytic and decisioning software that can be configured by our customers to address a wide variety of business use cases. Our offerings are available to our customers as software-as-a-service (“SaaS”) or as on-premises software.\nHighlights from the quarter and nine months ended June 30, 2025\nTotal revenues were $536.4 million during the quarter ended June 30, 2025, a 20% increase from the quarter ended June 30, 2024, and $1.5 billion during the nine months ended June 30, 2025, a 17% increase from the nine months ended June 30, 2024.\nRevenues for our Scores segment were $324.3 million during the quarter ended June 30, 2025, a 34% increase from the quarter ended June 30, 2024, and $857.0 million during the nine months ended June 30, 2025, a 28% increase from the nine months ended June 30, 2024.\nAnnual Recurring Revenue for our Software segment as of June 30, 2025 was $739.1 million, a 4% increase from June 30, 2024.\nDollar-Based Net Retention Rate for our Software segment was 103% as of June 30, 2025.\nOperating income was $262.5 million during the quarter ended June 30, 2025, a 38% increase from the quarter ended June 30, 2024, and $687.7 million during the nine months ended June 30, 2025, a 28% increase from the nine months ended June 30, 2024.\nNet income was $181.8 million during the quarter ended June 30, 2025, a 44% increase from the quarter ended June 30, 2024, and $496.9 million during the nine months ended June 30, 2025, a 32% increase from the nine months ended June 30, 2024.\nDiluted EPS was $7.40 during the quarter ended June 30, 2025, a 47% increase from the quarter ended June 30, 2024, and $20.12 during the nine months ended June 30, 2025, a 34% increase from the nine months ended June 30, 2024.\nCash flows from operating activities were $555.1 million during the nine months ended June 30, 2025, compared with $406.5 million during the nine months ended June 30, 2024.\nCash and cash equivalents were $189.0 million as of June 30, 2025, compared with $150.7 million as of September 30, 2024.\nWe issued $1.5 billion of senior notes and used the net proceeds to repay all the outstanding balances on our term loans and revolving line of credit. We also amended our credit agreement to increase our borrowing capacity under the unsecured revolving line of credit to $1.0 billion and extended its maturity. Total debt balance was $2.8 billion as of June 30, 2025, compared with $2.2 billion as of September 30, 2024.\nTotal share repurchases during the quarter ended June 30, 2025 were $511.3 million, compared with $255.5 million during the quarter ended June 30, 2024, and during the nine months ended June 30, 2025 were $878.1 million, compared with $506.8 million during the nine months ended June 30, 2024.\nKey performance metrics for Software segment\nAnnual Contract Value Bookings (“ACV Bookings”)\nManagement regards ACV Bookings as an important indicator of future revenues, but it is not comparable to, nor is it a substitute for, an analysis of our revenues and other U.S. generally accepted accounting principles (“U.S. GAAP”) measures. We define ACV Bookings as the average annualized value of software contracts signed in the current reporting period that generate current and future on-premises and SaaS software revenue. We only include contracts with an initial term of at least 24 months and we exclude perpetual licenses and other software revenues that are non-recurring in nature. For renewals of existing software subscription contracts, we count only incremental annual revenue expected over the current contract as ACV Bookings.\nACV Bookings is calculated by dividing the total expected contract value by the contract term in years. The expected contract value equals the fixed amount — including guaranteed minimums, if any — stated in the contract, plus estimates of future usage-based fees. We develop estimates from discussions with our customers and examinations of historical data from similar products and customer arrangements. Differences between estimates and actual results occur due to variability in the estimated usage. This variability can be the result of the economic trends in our customers’ industries, individual performance of our customers relative to their competitors, and regulatory and other factors that affect the business environment in which our customers operate. For the periods presented, ACV Bookings related to estimates of future usage-based fees was approximately 30% of the total ACV Bookings amount on an annualized basis. Differences between the initial estimates of future usage-based fees and actual results historically have not been material and we do not currently expect that they will be materially different in the future.\nWe disclose estimated revenue expected to be recognized in the future related to remaining performance obligations in Note 7 to the accompanying condensed consolidated financial statements. However, we believe ACV Bookings is a useful supplemental measure of our business as it includes estimated revenues and future billings excluded from Note 7, such as usage-based fees and guaranteed minimums derived from our on-premises software licenses, among others.\nThe following table summarizes our ACV Bookings during the periods indicated:\nQuarter Ended June 30,\nNine Months Ended June 30,\nTotal on-premises and SaaS software\nAnnual Recurring Revenue (“ARR”)\nAccounting Standards Codification Topic 606,\nRevenue from Contracts with Customers\n, requires us to recognize a significant portion of revenue from our on-premises software subscriptions at the point in time when the software is first made available to the customer, or at the beginning of the subscription term, despite\n\nWe calculate ARR as the quarterly recurring revenue run-rate multiplied by four.\nThe following table summarizes our ARR for on-premises and SaaS software exiting each of the dates presented:\nARR\nDollar-Based Net Retention Rate (“DBNRR”)\nWe consider DBNRR to be an important measure of our success in retaining and growing revenue from our existing customers. To calculate DBNRR for any period, we compare the ARR at the end of the prior comparable quarter (“base ARR”) to the ARR from that same cohort of customers at the end of the current quarter (“retained ARR”); we then divide the retained ARR by the base ARR to arrive at the DBNRR. Our calculation includes the positive impact among this cohort of customers of selling additional products, price increases and increases in usage-based fees, and the negative impact of customer attrition, price decreases, and decreases in usage-based fees during the period. However, the calculation does not include the positive impact from sales to any new customers acquired during the period. Our DBNRR may increase or decrease from period to period as a result of various factors, including the timing of new sales and customer renewal rates.\nThe following table summarizes our DBNRR for on-premises and SaaS software exiting each of the dates presented:\nDBNRR\nRESULTS OF OPERATIONS\nWe are organized into two reportable segments: Scores and Software. Although we sell solutions and services into a large number of end user product and industry markets, our reportable business segments reflect the primary method in which management organizes and evaluates internal financial information to make operating decisions and assess performance.\nSegment revenues, operating income, and related financial information, including disaggregation of revenue, are set forth in Note 7 and Note 10 to the accompanying condensed consolidated financial statements.\nThe following tables set forth certain summary information on a segment basis related to our revenues for the quarters and nine-month periods ended June 30, 2025 and 2024:\nQuarter Ended June 30,\nPercentage of Revenues\nPeriod-to-Period Change\n\nResearch and development\nSelling, general and administrative\nAmortization of intangible assets\nTotal operating expenses\nInterest expense, net\nIncome before income taxes\nProvision for income taxes\nCost of revenues consists primarily of employee salaries, incentives, and benefits for personnel directly involved in delivering software products, operating SaaS infrastructure, and providing support, implementation and consulting services; overhead, facilities and data center costs; software royalty fees; credit bureau data and processing services; third-party hosting fees related to our SaaS services; travel costs; and outside services.\nThe quarter-over-prior year quarter decrease in cost of revenues of $0.7 million was primarily attributable to a $1.6 million decrease in personnel and labor costs and a $1.1 million decrease in outside services costs, partially offset by a $2.3 million increase in infrastructure and facilities costs. The decrease in personnel and labor costs was primarily attributable to decreased incentive expense. The decrease in outside services costs was primarily attributable to decreased third-party contractor costs. The increase in infrastructure and facilities costs was primarily attributable to an increase in third-party data center hosting costs. Cost of revenues as a percentage of r"
}