{
  "source_file": "fis-20250930.htm",
  "form_type": "10-Q",
  "item1_clean": null,
  "item7_clean": null,
  "item2_clean": "Item 2. Management's Discussion and Analysis of Financial Condition and Results of Operations\nUnless stated otherwise or the context otherwise requires, all references to \"FIS,\" \"we,\" \"our,\" \"us,\" the \"Company\" or the \"registrant\" are to Fidelity National Information Services, Inc., a Georgia corporation, and its subsidiaries.\nActual results, performance or achievement could differ materially from these forward-looking statements. The risks and uncertainties to which forward-looking statements are subject include the following, without limitation:\nchanges in general economic, business and political conditions, a recession, intensified or expanded international hostilities, acts of terrorism, increased rates of inflation or interest, effects of announced or future tariff increases and any resulting regulatory changes in global trade relations, changes in consumer or business confidence;\nchanges in either or both the United States and international lending, capital and financial markets or currency fluctuations;\nthe risk that acquired businesses will not be integrated successfully or that the integration will be more costly or more time-consuming and complex than anticipated;\nthe risk that cost savings and synergies anticipated to be realized from acquisitions may not be fully realized or may take longer to realize than expected or that costs may be greater than anticipated;\nthe risks of doing business internationally;\nthe effect of legislative initiatives or proposals, statutory changes, governmental or applicable regulations and/or changes in industry requirements, including privacy, data protection, cybersecurity, cyber resilience and AI laws and regulations;\nour ability to comply with climate change legal and regulatory requirements and to maintain practices that meet our stakeholders' evolving expectations;\nthe risks of reduction in revenue from the elimination of existing and potential customers due to consolidation in, or new laws or regulations affecting, the banking, retail and financial services industries or due to financial failures or other setbacks suffered by firms in those industries;\nchanges in the growth rates of the markets for our solutions;\nthe amount, declaration and payment of future dividends is at the discretion of our Board of Directors and depends on, among other things, our investment opportunities, results of operations, financial condition, cash requirements, future prospects, and other factors that may be considered relevant by our Board of Directors, including legal and contractual restrictions;\nthe amount and timing of any future share repurchases is subject to, among other things, our share price, our other investment opportunities and cash requirements, our results of operations and financial condition, our future prospects and other factors that may be considered relevant by our Board of Directors and management;\nfailures to adapt our solutions to changes in technology or in the marketplace;\ninternal or external security or privacy breaches of our systems, including those relating to unauthorized access, theft, corruption or loss of personal information and computer viruses and other malware affecting our software or platforms, and the reactions of customers, card associations, government regulators and others to any such events;\nthe risk that implementation of software, including software updates, for customers or at customer locations or employee error in monitoring our software and platforms may result in the corruption or loss of data or customer information, interruption of business operations, outages, exposure to liability claims or loss of customers;\nthe risk that partners and third parties may fail to satisfy their legal obligations to us;\nrisks associated with managing pension cost, cybersecurity issues, IT outages and data privacy;\nour ability to navigate the opportunities and risks associated with using and/or incorporating AI technologies into our business;\nthe reaction of current and potential customers to communications from us or regulators regarding information security, risk management, internal audit or other matters;\nthe risk that the pending acquisition of Issuer Solutions will not be completed or will not provide the expected benefits, including the anticipated cost or revenue synergies, within the expected timeframe, in full or at all;\nthe risk that the integration of Issuer Solutions will be more difficult, time-consuming or expensive than anticipated;\ncompetitive pressures on pricing related to the decreasing number of community banks in the U.S., the development of new disruptive technologies competing with one or more of our solutions, increasing presence of international competitors in the U.S. market and the entry into the market by global banks and global companies with respect to certain competitive solutions, each of which may have the impact of unbundling individual solutions from a comprehensive suite of solutions we provide to many of our customers;\nthe failure to innovate in order to keep up with new emerging technologies, which could impact our solutions and our ability to attract new, or retain existing, customers;\nan operational or natural disaster at one of our major operations centers;\nfailure to comply with applicable requirements of payment networks or changes in those requirements;\nfraud by bad actors; and\nOther unknown or unpredictable factors also could have a material adverse effect on our business, financial condition, results of operations and prospects. Accordingly, readers should not place undue reliance on these forward-looking statements. These forward-looking statements are inherently subject to uncertainties, risks and changes in circumstances that are difficult to predict. Except as required by applicable law or regulation, we do not undertake (and expressly disclaim) any obligation and do not intend to publicly update or review any of these forward-looking statements, whether as a result of new information, future events or otherwise.\nRevision of Prior-Period Consolidated Financial Statements\nDuring the third quarter of 2024, we identified immaterial misstatements affecting the Company’s previously issued consolidated financial statements as of and for the annual periods ended December 31, 2023 and 2022, and the quarterly periods ended March 31 and June 30, 2024. The misstatements related primarily to the timing of the recognition of expenses associated with inventory-related accruals, along with their related balance sheet impacts, and the presentation of certain value-added tax balances in the consolidated financial statements. We have revised our prior-period financial statements to correct these misstatements as well as other unrelated immaterial misstatements, including adjustments to Revenue and Other income (expense), net. The revisions ensure comparability across all periods reflected herein.\nFIS is a financial technology company providing solutions to financial institutions, businesses and developers. We unlock financial technology to the world across the money lifecycle underpinning the world's financial systems. Our people are dedicated to advancing the way the world pays, banks and invests, by helping our clients to confidently run, grow and protect their businesses. Our expertise comes from decades of experience helping financial institutions and businesses of all sizes adapt to meet the needs of their customers by harnessing where reliability meets innovation in financial technology. Headquartered in Jacksonville, Florida, FIS is a member of the Fortune 500® and the Standard & Poor’s 500® Index. FIS is incorporated under the laws of the State of Georgia as Fidelity National Information Services, Inc., and our stock is traded under the trading symbol \"FIS\" on the New York Stock Exchange.\nGrowth and Strategy Objectives\nOur growth has been driven by a number of factors, including growth of our customers' businesses, our internal development of new solutions that enhance our client offerings, and our sales and marketing efforts to expand our customer base and addressable markets. Acquisitions have also contributed additional solutions that complement or enhance our\nofferings, diversify our client base, expand our geographic coverage, and provide entry into new and attractive adjacent markets that align with our strategic objectives. We continue to strategically allocate resources to both internal and external growth initiatives to enhance the long-term value of our business.\nOn January 31, 2024, we completed the sale (the \"2024 Worldpay Sale\") of a 55% equity interest in our Worldpay Merchant Solutions business to private equity funds managed by GTCR, LLC (such funds, the \"Buyer\"). FIS retained a non-controlling 45% equity interest in a new standalone joint venture, Worldpay Holdco, LLC (\"Worldpay\"), following the closing of the 2024 Worldpay Sale. Worldpay continues to provide merchant acquiring and related services to businesses of all sizes and across any industry globally, enabling them to accept, authorize and settle electronic payment transactions.\nPending Acquisition of Issuer Solutions Business and Sale of Remaining Equity Interest in Worldpay\nAs previously disclosed, on April 17, 2025, FIS entered into a transaction agreement pursuant to which FIS has agreed to buy the Issuer Solutions business (\"Issuer Solutions\") from Global Payments Inc. (\"Global Payments\") for an enterprise value of $13.5 billion, inclusive of $1.5 billion of anticipated net present value of tax assets, or a net purchase price of $12.0 billion, subject to customary adjustments (the \"Issuer Solutions Acquisition\"). As consideration for the Issuer Solutions Acquisition, FIS has agreed to sell to Global Payments all of its equity interests in Worldpay for a pre-tax value of $6.6 billion, net of transaction fees and other costs, and to pay the remainder of the purchase price in cash. FIS intends to fund the cash portion of the purchas"
}