{
  "source_file": "fis-20241231.htm",
  "form_type": "10-K",
  "item1_clean": "Banking Solutions (1)\nCapital Market Solutions\nTotal Consolidated Revenue\nDuring 2024, the Company revised its previously issued consolidated financial statements as of and for the annual periods ended December 31, 2023 and 2022, to correct certain immaterial misstatements. See Note 24 to the consolidated financial statements for information about our revision of prior-period consolidated financial statements.\nBanking Solutions (\"Banking\")\nThe Banking segment is focused on serving financial institutions with core processing software, transaction processing software and complementary applications and services, many of which interact directly with core processing software. We sell these solutions on either a bundled or stand-alone basis. Clients in this segment include global financial institutions, U.S. regional and community banks, credit unions and commercial lenders, as well as government institutions and other commercial organizations. We provide our clients integrated solutions characterized by multi-year processing contracts that generate recurring revenue. The predictable nature of cash flows generated from the Banking segment provides opportunities for further investments in innovation, integration, information and security, and compliance in a cost-effective manner.\nOur solutions in this segment include the following:\nCore Processing and Ancillary Applications.\nOur core processing software applications, including deposit and lending, customer management and other central management systems, are designed to run banking processes for our financial institution clients. Clients use these applications to maintain the primary records of their customer accounts. Our diverse selection of market-focused core processing software applications enables FIS to compete effectively in a wide range of markets. We continue to invest in our core modernization efforts to further differentiate our offerings for the long term. We also offer a number of solutions that are ancillary to the primary applications listed above, including branch automation, back-office support systems and compliance support.\nDigital, including Mobile and Online.\nOur comprehensive suite of retail and commercial applications enables financial institutions to streamline and integrate customer-facing operations with back-office processes, thereby improving customer experience across channels (e.g., branch, internet, mobile, ATM, and call centers). FIS' focus on real-time consumer access has driven significant market innovation in multi-channel, API-enabled embedded and multi-hosted solutions, underpinned by a strategy that provides tight integration and a seamless customer experience.\nOur innovative digital banking capabilities are now available to financial institutions with continually expanding\nfunctionality. Our digital offerings are\nintegrated with core banking platforms offered by FIS and are also offered to customers of non-FIS core systems.\nFraud, Risk Management and Compliance.\nOur decision solutions offer a spectrum of options that cover the account lifecycle from helping to identify qualified account applicants to managing existing customer accounts and fraud. Our applications enable Know Your Customer, new account decisioning and opening, account and transaction management, fraud management and collections. Our risk management solutions use our proprietary risk management models and data sources to assist in detecting fraud and assessing the risk of opening a new account. Our systems use a combination of advanced authentication procedures, predictive analytics, artificial intelligence modeling and proprietary and shared databases to assess and detect fraud risk for deposit, card and other transactions for financial institutions.\nCard and Retail Payments.\nOur card and retail payment technology solutions allow clients to issue VISA\nor other payment network-branded credit and debit cards or other electronic payment cards for use by both consumer and business accounts. Card-based volumes continue to increase, driven by both the number of transactions per month and the value of those transactions. We offer EMV (Europay, MasterCard and Visa) integrated circuit cards, often referred to as chip cards, as well as a variety of stored-value card types and loyalty programs, including our Premium Payback service that allows our financial institutions' customers to use loyalty points at a variety of merchant point-of-sale systems. Our integrated solutions range from card production and activation to processing to an extensive range of fraud management solutions and value-added loyalty programs designed to increase card usage and fee-based revenue for financial institutions and merchants. The majority of our programs are full service, including most of the operations and support necessary for an issuer to operate a credit card program. We do not make credit decisions for our card issuing clients. We are also a leading provider of prepaid card solutions, which include digital cards, gift cards and reloadable cards, with end-to-end solutions for the development, processing and administration of stored-value programs, including government benefit programs. Our closed-loop gift card solutions and loyalty programs provide merchants compelling solutions to drive consumer loyalty.\nElectronic Funds Transfer and Network.\nOur electronic funds transfer and debit card processing businesses offer settlement and card management solutions for financial institution card issuers. We offer a modern, core-agnostic payment hub with real-time fraud monitoring across payment rails. We own and operate several U.S. domestic debit, prepaid, ATM and credit networks that carry transactions for a variety of transaction modes. Our networks connect millions of cards and point-of-sale locations nationwide, providing consumers with secure, real-time access to their money. Also through our networks, clients such as financial institutions, retailers and independent ATM operators can capitalize on the efficiency, consumer convenience and security of electronic real-time payments, real-time account-to-account transfers, and strategic alliances, such as surcharge-free ATM network arrangements.\nWealth and Retirement.\nWe provide wealth and retirement solutions that help banks, trust companies, brokerage firms, insurance firms, retirement plan professionals, benefit administrators and independent advisors acquire, service and grow their client relationships. We provide solutions for client acquisition, transaction management, trust accounting and recordkeeping that can be deployed stand-alone, as part of an integrated wealth or retirement platform, or on an outsourced basis.\nItem Processing and Output Solutions.\nOur item processing solutions furnish financial institutions with the technology needed to capture data from checks, transaction tickets and other items; image and sort items; process exceptions through keying; and perform balancing, archiving and the production of statements. Our item processing services are performed at one of our multiple item processing centers located throughout the U.S. or on-site at client locations. Our extensive solutions include distributed (i.e., non-centralized) data capture, mobile deposit capture, check and remittance processing, fraud detection, and document and report management. Clients encompass banks and corporations of all sizes, from de novo banks to the largest financial institutions and corporations. We offer a number of output solutions that are ancillary to the primary solutions we provide, including print and mail capabilities, document composition software and solutions, and card personalization fulfillment solutions. Our print and mail solutions offer complete computer output solutions for the creation, management and delivery of print and fulfillment needs. We provide our card personalization fulfillment solutions for branded credit cards and branded and non-branded debit and prepaid cards.\nCapital Market Solutions (\"Capital Markets\")\nThe Capital Markets segment is focused on serving global financial services clients and corporations with a broad array of buy- and sell-side, treasury, risk management and lending solutions. Clients in this segment include asset managers, private equity firms, sell-side securities brokerage and trading firms, insurers, asset and auto financiers and other commercial organizations. Our solutions include a variety of mission-critical buy- and sell-side applications for recordkeeping, data and analytics, trading and financing, as well as corporate treasury and risk management applications. Capital Markets clients purchase our solutions in various ways including licensing and managing technology \"in-house,\" using consulting and third-party service providers, as well as procuring fully outsourced end-to-end solutions. Our long-established relationships with many of these financial and commercial institutions generate significant recurring revenue. We have made, and continue to make, investments in modern platforms, advanced technologies, open APIs, machine learning and artificial intelligence, and regulatory technology to support our Capital Markets clients.\nOur solutions in this segment include the following:\nTrading and Asset Services.\nWe offer solutions that support our customers across the buy and sell sides of the capital markets industry, assisting them to control their front, middle and back office operations through integrated ecosystems. Our solutions support institutional investors, managers, broker-dealers, asset servicers and transfer agents across all asset classes including private equity, hedge, credit, and traditional. Our trading applications focus on advanced trade life-cycle management, including market making and risk management, cleared derivatives processing, securities processing and securities finance, tax processing, and regulatory compliance, including anti-money laundering (AML) and trade surveillance. Our Asset Servicing solutions support every stage of the investment process, from research and portfolio management to order and position management, valuation, risk management, corporate actions, reconciliation, investment accounting, investor accounting, transfer agency and client reporting. Our solutions improve both investment decision making and operational efficiency, while managing risk and increasing transparency across the industry.\n. Our lending solutions offer full life-cycle commercial lending functionality from loan origination, commercial credit assessment and customer risk rating to loan servicing and data analytics. We also offer the leveraged and syndicated loan markets solutions that manage amendments, secondary market trading, deal management and bookrunning. In the asset finance space, we offer a single, end-to-end leasing platform that helps auto and equipment finance companies manage the entire financing process, supporting origination and pricing, credit decisioning, contract management, servicing and collections.\nOur treasury solutions help chief financial officers and treasurers manage working capital by reducing risk and improving communication and response time between a company's buyers, suppliers, banks, and other stakeholders. Our end-to-end financial management framework helps bring together receivables, treasury, and payments for a single view of cash and risk, which helps our clients optimize business processes for enhanced liquidity management. Our risk portfolio of solutions manages market and credit risk and regulatory compliance for banks and actuarial risk for insurance firms.\nThe Corporate and Other segment consists of corporate overhead expense, certain leveraged functions and miscellaneous expenses that are not included in the operating segments, as well as certain non-strategic businesses that we plan to wind down or sell. The overhead and leveraged costs relate to corporate marketing, finance, accounting, hu",
  "item7_clean": "Management's Discussion and Analysis of Financial Condition and Results of Operations\nThe following section discusses management's view of the financial condition and results of operations of FIS and its consolidated subsidiaries as of December 31, 2024 and 2023, and for the years ended December 31, 2024, 2023 and 2022, unless otherwise noted.\nThis section should be read in conjunction with our audited consolidated financial statements and related notes included elsewhere in this Annual Report. Management's Discussion and Analysis of Financial Condition and Results of Operations contains forward-looking statements. See \"Statement Regarding Forward-Looking Information\" and \"\nof this Annual Report for a discussion of the uncertainties, risks and assumptions associated with these forward-looking statements that could cause future results to differ materially from those reflected in this section.\nBusiness Trends and Conditions\nRevenue Sources and Markets\nOur revenue from continuing operations is primarily derived from a combination of technology and processing solutions, transaction processing fees, professional services and software license fees. While we are a global company and do business around the world, the majority of our revenue is generated by clients in the U.S. The majority of our international revenue is generated by clients in the U.K., Germany, Canada, Australia, Brazil, Switzerland and France. In addition, the majority of our revenue has historically been recurring under multi-year Banking and Capital Markets contracts that contribute relative stability to our revenue stream. These solutions, in general, are considered critical to our clients' operations. Professional services revenue is typically non-recurring, though recognition often occurs over time rather than at a point in time. Sales of software licenses are typically non-recurring with point-in-time recognition and are less predictable.\nWe are experiencing relatively stable sales cycles and levels of client activity across our businesses. We have experienced, and continue to experience, relatively high inflation in our primary markets over the medium-term cycle. Relatively high interest rates have had, and may continue to have, a negative impact on our interest expense. However, during 2024, we used a portion of the net proceeds from the Worldpay Sale to repay our borrowings under our commercial paper programs and reduce our long-term debt, which has decreased our interest expense from previous levels. Impacts of foreign currency fluctuations remained slightly favorable during 2024. Given the volatility of exchange rates and the mix of currencies involved in both revenues and expenses, the direction and magnitude of future effects of currency fluctuations are uncertain.\nOn January 31, 2024, the Company completed the Worldpay Sale for cash consideration in a transaction valuing the Worldpay Merchant Solutions business at an enterprise value of $18.5 billion, including $1.0 billion of consideration contingent on the returns realized by Buyer exceeding certain thresholds. The net cash proceeds received by FIS at the closing were greater than $12 billion, net of estimated closing adjustments, debt restructuring fees, taxes and transaction costs. We used a portion of the proceeds from the sale to retire debt and repurchase shares, and we plan to continue to use the remaining proceeds to return additional capital to shareholders through our existing share repurchase authorizations, as well as for general corporate purposes, including acquisitions, while maintaining an investment grade credit rating. In connection with the Worldpay Sale, FIS and Worldpay entered into commercial agreements, preserving a key value proposition for clients of both businesses and minimizing potential dis-synergies. FIS and Worldpay also entered into additional agreements as described in Note 4 to the consolidated financial statements. Upon closing of the Worldpay Sale, we retained a non-controlling 45% equity interest in Worldpay. FIS' share of the net income of Worldpay subsequent to the sale is reported as Equity method investment earnings (loss), net of tax.\nAs a result of the Worldpay Sale, we recorded an estimated loss on sale of $578 million during 2024. We\nalso recorded a tax benefit of $1.1 billion\nprimarily from the release of U.S. deferred tax liabilities that were not transferred in the Worldpay Sale, net of the estimated U.S. tax cost that we expect to incur as a result of the Worldpay Sale.\nCompletion of remaining purchase agreement provisions in connection with the Worldpay Sale could result in further adjustments to the loss on sale amount and the estimated U.S. tax cost.\nInvestments in Innovation\nWe continue to assist financial institutions and other businesses in migrating to outsourced integrated technology solutions to improve their profitability and address increasing and ongoing regulatory requirements. We believe our integrated solutions and outsourced services are well-positioned to address this outsourcing trend across the markets we serve.\nWe continue to invest in modernization, innovation and integrated solutions to meet the demands of the markets we serve and to compete with global banks, financial and other technology providers, and emerging technology innovators. We invest both internally and through investment opportunities in companies building complementary technologies in the financial services space. Our internal development activities have related primarily to the modernization of our proprietary core systems in each of our segments, design and development of next-generation digital and innovative solutions and development of\nprocessing systems and related software applications and risk management platforms. We expect to continue to invest an appropriate level of resources to maintain, enhance and extend the functionality of our proprietary systems and existing software applications, to develop new and innovative software applications and systems to address emerging technology trends in response to the needs of our clients, and to enhance the capabilities of our outsourcing infrastructure.\nDigital One Platform\nConsumer preference, particularly in younger generations, continues to shift from traditional branch banking services to digital-first banking solutions. It is increasingly clear that a priority for our clients is to provide a unified, engaging and inclusive banking experience powered by digital capabilities across all channels and customer activities. Our Digital One platform helps our clients, from top-tier large financial institutions with over $10 billion in assets to top-tier and mid-tier community banks, provide a set of modern digital solutions to support all customer types, including retail consumers, sole proprietors, small businesses and large corporations, through any channel, including desktop, tablet, smartphone, and branch. The uniform customer experience extends to support a broad range of financial services including opening new accounts, servicing existing accounts, money movement, and personal financial management, as well as other consumer, small business and commercial banking capabilities. The Digital One platform is host-agnostic, and our digital suite has been enabled across multiple FIS core banking platforms, including IBS, Horizon, Modern Banking Platform, AffinityEdge, and Systematics, in addition to non-FIS platforms run by banking financial institutions who demand market-leading digital capabilities.\nBanking Industry Consolidation\nConsolidation within the banking industry has occurred and may continue to occur, primarily in the form of merger and acquisition activity among financial institutions, which generally increases competition among financial technology providers. However, consolidation resulting from specific merger and acquisition transactions may be beneficial to our business. When consolidations of financial institutions occur, merger partners often operate systems obtained from competing service providers. The newly formed entity generally makes a determination to migrate its core and payments systems to a single platform. When a financial institution processing client is involved in a consolidation, we may benefit if the client retains our solutions and expands the use of them following the consolidation to support the newly combined entity. Conversely, we may lose revenue if we are providing solutions to both entities, or if a client of ours is involved in a consolidation and our solutions are not chosen to support the newly combined entity. It is also possible that larger financial institutions resulting from consolidation may have greater leverage in negotiating terms or could decide to perform in-house some or all of the solutions that we currently provide or could provide. We seek to mitigate the risks of consolidations by offering other competitive solutions to take advantage of specific opportunities at the surviving company.\nDemand in Payments Market\nWe continue to see demand in the payments market for innovative solutions that will deliver faster, more convenient payment options in mobile channels, internet applications, in-store cards, and digital currencies. The payment processing industry is adopting new technologies, developing new solutions, evolving new business models, and is being affected by new market entrants and by an evolving regulatory environment. As financial institutions respond to these changes by seeking solutions to help them enhance their own offerings to consumers, including the ability to accept card-not-present payments in eCommerce and mobile environments, as well as contactless cards and mobile wallets at the point of sale, FIS believes that payment processors will seek to develop additional capabilities in order to serve clients' evolving needs. To facilitate this expansion, we believe that payment processors will need to enhance their technology platforms so they can deliver these capabilities and differentiate their offerings from other providers.\nWe believe that these market changes present both an opportunity and a risk for us, and we cannot predict which emerging technologies or solutions will be successful. However, FIS believes that payment processors, like FIS, that have scalable, integrated business models, provide solutions across the payment processing value chain and utilize broad distribution capabilities will be best-positioned to enable emerging alternative electronic payment technologies in the long term. Further, FIS believes that its depth of capabilities and breadth of distribution will enhance its position as emerging payment technologies are adopted by merchants and other businesses. FIS' ability to partner with non-financial institution enterprises, such as mobile payment providers and internet, retail and social media companies, continues to create attractive growth opportunities as these new entrants seek to become more active participants in the development of alternative electronic payment technologies and to facilitate the convergence of retail, online, mobile and social commerce applications.\nCybersecurity Threats and Solutions\nCyberattacks on information technology systems and the vendors and technological supply chain on which they rely continue to grow in frequency, complexity and sophistication. This is a trend we expect to continue with widespread impacts, including potentially some pertinent to FIS. The continued growth in the frequency, complexity and sophistication of cyberattacks, coupled with the continued interconnection in the global technology ecosystem, present both a threat and an opportunity for FIS. Using expertise we have gained from our ongoing focus and investment, we have developed and we offer fraud, security, risk management and compliance solutions to target this growth opportunity in the financial services industry. We also use certain of these solutions to manage our own risks. See Item 1C for additional discussion of how the Company assesses, identifies, and manages cybersecurity risks.\nCritical Accounting Policies and Estimates\nThe accounting policies and estimates described below are those we consider critical in preparing our consolidated financial statements. These policies require management to make estimates, judgments and assumptions that affect the reported amounts of assets and liabilities and disclosures with respect to contingent assets and liabilities at the date of the consolidated financial statements and the reported amounts of revenue and expenses during the reporting periods. Actual amounts could differ from those estimates. See Note 2 to the consolidated financial statements for a more detailed description of the significant accounting policies that have been followed in preparing our consolidated financial statements.\nApplication of GAAP related to the measurement and recognition of revenue requires us to make judgments and estimates. Specifically, complex arrangements with nonstandard terms and conditions may require significant contract interpretation in the determination of distinct performance obligations. Other judgments may include the evaluation of the standalone selling price for each performance obligation and whether separate contracts with the same customer should be combined and considered part of one arrangement.\nThe determination as to whether individual promised solutions or services can be considered distinct or should instead be combined with other promised solutions or services in a contract may require judgment. We assess the solutions and services promised in our contracts with customers and identify a performance obligation for each promise to transfer to the customer a solution or service (or bundle of solutions or services) that is distinct - i.e., if a solution or service is separately identifiable from other items in the bundled package and if a customer can benefit from it on its own or with other resources that are readily available to the customer.\nDue to the large number, broad nature and average size of our individual customer contracts, the impact of judgments and assumptions that we apply in recognizing revenue for any single contract is not likely to have a material effect on our consolidated operations or financial position. However, the accounting policies that we apply across similar contracts, products or classes of clients could significantly influence the timing and amount of revenue recognized in our historical and future results of operations or financial position.\nWe allocate the purchase price of acquired businesses to the assets acquired and liabilities assumed in business combination transactions at their estimated fair values, except as otherwise required. Any portion of the purchase price in excess of the recorded amount of the net identifiable assets acquired is recognized as goodwill. The estimates used to determine the fair value of long-lived assets, such as customer relationships and software intangible assets, are complex and require a significant amount of management judgment. When necessary, we engage third-party valuation specialists to assist us in making these fair value determinations. We generally use discounted cash flow models, which require internally developed assumptions, to determine the acquisition fair value of customer relationship intangible assets and developed technology software assets. Assumptions for customer relationship asset valuations typically include forecasted revenue attributable to existing customer contracts and relationships, estimated annual attrition, forecasted margin, and estimated weighted average cost of capital and discount rates. Assumptions for software asset valuations typically include forecasted revenue attributable to the software assets, obsolescence rates, estimated royalty rates and estimated weighted average cost of capital and discount rates. The forecasted r",
  "item2_clean": null
}