{
  "source_file": "fisv-20250930.htm",
  "form_type": "10-Q",
  "item1_clean": null,
  "item7_clean": null,
  "item2_clean": "ITEM 2. MANAGEMENT’S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS\nForward-Looking Statements\nThis quarterly report contains “forward-looking statements” intended to qualify for the safe harbor from liability established by the Private Securities Litigation Reform Act of 1995. Forward-looking statements include those that express a plan, belief, expectation, estimation, anticipation, intent, contingency, future development, outlook, or similar expression, and can generally be identified as forward-looking because they include words such as “believes,” “anticipates,” “expects,” “could,” “should,” “confident,” “likely,” “plan,” or words of similar meaning. Statements that describe our future plans, objectives or goals are also forward-looking statements.\nManagement’s discussion and analysis of financial condition and results of operations is provided as a supplement to our unaudited consolidated financial statements and accompanying notes to help provide an understanding of our financial condition, the changes in our financial condition and our results of operations. Our discussion is organized as follows:\nThis section contains background information on our company and the products and services that we provide, acquisitions and dispositions, and the trends affecting our industry in order to provide context for management’s discussion and analysis of our financial condition and results of operations.\nChanges in critical accounting policies and estimates.\nResults of operations.\nThis section contains an analysis of our results of operations presented in the accompanying unaudited consolidated statements of income by comparing the results for the three and nine months ended September 30, 2025 to the comparable periods in 2024.\nLiquidity and capital resources.\nThis section provides an analysis of our cash flows and a discussion of our outstanding debt at September 30, 2025.\nWe are a leading global provider of payments and financial services technology solutions. We serve clients around the globe, including merchants, banks, credit unions, other financial institutions, corporate and public sector clients. We help clients achieve best-in-class results through a commitment to innovation and excellence in areas including account processing and\n\nsolutions, enabling our ability to accelerate the deployment of our Clover\nPOS and business management platform across Europe. On April 4, 2025, we acquired Pinch Payments NZ Limited (together with Zootive Pty Ltd, “Pinch Payments”), a payment facilitator. Pinch Payments is included within the Merchant segment and expands our flexible payment services for our partners and clients, and presence within the Asia-Pacific region. On June 4, 2025, we acquired Money Money Serviços Financeiros S.A. (“Money Money”), a provider of risk analysis and credit decisioning solutions. Money Money is included within the Merchant segment and expands our payment and financial service capabilities, enabling access to working capital and other payment solutions for small and medium-sized businesses. On September 4, 2025, we acquired CardFree Inc. (“CardFree”), an all-in-one platform delivering integrated order, payment and loyalty solutions for merchants. CardFree is included within the Merchant segment and further expands the capabilities of our Clover\nplatform across the hospitality, restaurant and lodging industries. On September 25, 2025, we acquired the Smith Consulting Group, LLC business (“SCG”), an operational consulting service utilized by community banks and credit unions across the U.S. SCG is included within the Financial segment and supports our ability to provide consultative engagement to enhance community banks’ and credit unions’ strategic investments.\nWe acquired these businesses for an aggregate purchase price, including deferred payments, of $397 million, net of $73 million of acquired cash and including earn-out provisions estimated at a fair value of $27 million.\nOn September 26, 2025, we entered into definitive agreements to acquire StoneCastle Cash Management, LLC, INDX Processing, LLC and StoneCastle Trust Co. (collectively, “StoneCastle”). StoneCastle enables its network of depository institutions to easily access stable, cost-efficient deposit funding. StoneCastle will be included within the Financial segment and enables us to become a technology-enabled source of institutional deposits, helping financial institutions strengthen their balance sheets. This transaction is expected to close by the first quarter of 2026, subject to regulatory approval and other customary closing conditions. On October 1, 2025, we acquired a portion of The Toronto-Dominion Bank’s (“TD Bank”) merchant processing business in Canada. This business will be included within the Merchant segment and expands the footprint of our Clover\nplatform. In connection with this transaction, we signed a multi-year strategic managed services program agreement with TD Bank to utilize our technology, including Clover\n, within the TD Bank Merchant Solutions business. We expect to acquire these businesses for an aggregate purchase price of approximately $460 million.\nIn the third quarter of 2024, Wells Fargo Bank, National Association (“Wells Fargo”) provided us with a notice of non-renewal for the Wells Fargo Merchant Services merchant alliance (“WFMS”), which was accounted for as an equity method investment. Upon the expiration of the joint venture on April 1, 2025, we received an initial cash payment of $453 million. Completion of the contractual valuation and separation process during the third quarter of 2025 did not result in a significant adjustment to the initial cash payment received. In connection with the non-renewal of WFMS, we entered into a multi-year agreement with Wells Fargo to provide processing for current and future merchant clients as well as other services to Wells Fargo’s merchant business.\nOn April 17, 2025, we acquired the remaining 19% ownership interest in ICICI Merchant Services Private Limited, a merchant acceptance business, for $22 million. We previously held a majority controlling financial interest in this subsidiary, which continues to be consolidated and reported within the Merchant segment. On September 5, 2025, we acquired the remaining 49.9% ownership interest, including cash held of $195 million, in AIB Merchant Services (“AIBMS”), a payments solution provider, for $420 million. We previously held a majority controlling financial interest in this subsidiary, which continues to be consolidated and reported within the Merchant segment.\nThe global payments landscape continues to evolve, with rapidly advancing technologies and a steady expansion of digital payments, e-commerce and real-time payments infrastructure. Because of this growth, competition also continues to intensify. Business and consumer expectations continue to rise, with a focus on speed, convenience, choice and security. To meet these expectations, payments companies are focused on modernizing their technology, expanding the use of data and enhancing the customer experience.\nThe rapid growth in and globalization of mobile and e-commerce, driven by consumers’ desire for simpler, more efficient shopping experiences, has created an opportunity for merchants to reach consumers nearly anywhere, through any device, which often requires a merchant acquiring provider to enable and optimize the acceptance of payments. Merchants are demanding simpler, integrated and flexible systems to enable them to serve customers and help manage cash flow and everyday business operations. When combined with the ever-increasing ways a consumer can pay for goods and services, merchants have sought modern end-to-end solutions throughout their growth lifecycle to streamline the complexity. Furthermore, merchants can\n\nIn addition, our operating results in certain foreign countries in which we operate may be adversely impacted by fluctuations in interest rates and exchange rates for currencies other than the U.S. dollar, including the Euro, British Pound, Indian Rupee, Brazilian Real and Argentine Peso. The strengthening of the U.S. dollar against certain foreign currencies in countries in which we operate would negatively impact our revenue and earnings. We also have exposure to risks related to currency devaluation in certain countries, which may negatively impact our international operating results if there is a prolonged devaluation of local currencies relative to the U.S. dollar or if the economic conditions in these countries decline. While the majority of our revenue is earned in the U.S., we actively monitor the interest rate and foreign exchange rate environment and may enter into derivative instruments and utilize other non-derivative hedging instruments with creditworthy institutions in an effort to manage these risks.\nOne Fiserv Action Plan\nIn the third quarter of 2025, we launched a multi-year transformation program, which we refer to as the One Fiserv action plan, designed to prioritize and enhance client focus across five strategic pillars. The One Fiserv action plan is designed to center our investments in areas that build on Fiserv’s strengths, including: operating with a client-first mindset to win new enterprise clients and grow average revenue per client; building the pre-eminent small business operating platform through Clover\ncreating differentiated, innovative platforms in finance and commerce, including embedded finance and stablecoin; delivering operational excellence enabled by artificial intelligence (“AI”); and employing disciplined capital allocation for the long-term. This action plan involves using emerging technology, including generative and agentic AI, to enhance our solutions, modernize our gateways and orchestration layers, facilitate embedded finance, and improve our operations.\nChanges in Critical Accounting Policies and Estimates\nResults of Operations\nThe following table presents cer"
}