{
  "source_file": "fox-20250630.htm",
  "form_type": "10-K",
  "item1_clean": "ITEM 1. BUSINESS\nThe Company is a news, sports and entertainment company, which manages and reports its businesses in four operating segments: Cable Network Programming, Television, Credible and the FOX Studio Lot with the following two reportable segments:\nCable Network Programming\n, which produces and licenses news and sports content distributed through traditional cable television systems, direct broadcast satellite operators and telecommunication companies (“traditional MVPDs”), virtual multi-channel video programming distributors (“virtual MVPDs”) and other digital platforms, primarily in the U.S.\n, which produces, acquires, markets and distributes programming through the FOX broadcast network, advertising supported video-on-demand (“AVOD”) service Tubi, 29 full power broadcast television stations, including 11 duopolies, and other digital platforms, primarily in the U.S. Eighteen of the broadcast television stations are affiliated with the FOX Network and 11 are affiliated with MyNetworkTV. The segment also includes various production companies that produce content for the Company and third parties.\nCredible is a U.S. consumer finance marketplace. The FOX Studio Lot, located in Los Angeles, California, provides television and film production services along with office space, studio operation services and includes all operations of the facility.\nFOX became a standalone publicly traded company on March 19, 2019, when Twenty-First Century Fox, Inc. (“21CF”) spun off the Company to 21CF stockholders and FOX’s Class A Common Stock and Class B Common Stock (collectively, the “Common Stock”) began trading on The Nasdaq Global Select Market (the “Transaction”). The Walt Disney Company (“Disney”) acquired the remaining 21CF assets and 21CF became a wholly-owned subsidiary of Disney. The Company is party to a separation and distribution agreement and a tax matters agreement that govern certain aspects of the Company’s relationship with 21CF and Disney following the Transaction.\nThe Company’s fiscal year ends on June 30 of each year. The Company was incorporated in 2018 under the laws of the State of Delaware. The Company’s principal executive offices are located at 1211 Avenue of the Americas, New York, New York 10036 and its telephone number is (212) 852-7000. The Company’s website is\nwww.foxcorporation.com\nCaution Concerning Forward-Looking Statements\nThis Annual Report contains “forward-looking statements” within the meaning of Section 27A of the Securities Act of 1933, as amended, and Section 21E of the Exchange Act. All statements other than statements of historical or current fact are “forward-looking statements” for purposes of federal and state securities laws. Forward-looking statements may include, among others, the words “may,” “will,” “should,” “likely,” “anticipates,” “expects,” “intends,” “plans,” “projects,” “believes,” “estimates,” “outlook” or any other similar words. Although the Company’s management believes that the expectations reflected in any of the Company’s forward-looking\nstatements are reasonable, actual results could differ materially from those projected or assumed in any forward-looking statements. The Company’s future financial condition and results of operations, as well as any forward-looking statements, are subject to change and to inherent risks and uncertainties. Important factors that could cause the Company’s actual results, performance and achievements to differ materially from those estimates or projections contained in the Company’s forward-looking statements include, but are not limited to, government regulation, economic, strategic, political and social conditions. For more detailed information about these factors, see Item 1A, “Risk Factors,” and Item 7, “Management’s Discussion and Analysis of Financial Condition and Results of Operations—Caution Concerning Forward-Looking Statements.”\nForward-looking statements in this Annual Report speak only as of the date hereof. The Company does not undertake any obligation to update or release any revisions to any forward-looking statement made herein or to report any events or circumstances after the date hereof or to reflect the occurrence of unanticipated events or to conform such statements to actual results or changes in our expectations, except as required by law.\nFOX produces and delivers compelling news, sports and entertainment content through its iconic brands, including FOX News Media, FOX Sports, Tubi Media Group, FOX Entertainment and FOX Television Stations. The Company differentiates itself in a crowded media and entertainment marketplace through the leadership positions of its brands and premium programming that focus on live and “appointment-based” content, a significant presence in major markets, and broad distribution of its content across traditional and digital platforms.\nOur Competitive Strengths\nPremium brands that resonate deeply with viewers.\nUnder the FOX banner, we produce and distribute content through some of the world’s leading and most valued brands. Our long track record of challenging the status quo emboldens us to continue making innovative decisions, disrupting norms and forming deeper relationships with audiences. FOX News Media is among the most influential and recognized news brands in the world. FOX Sports has earned a reputation for bold sports programming and, with its availability in virtually every U.S. market, is a leading destination for live sports events and sports commentary. Tubi, our leading AVOD service, attracts a young, diverse and highly engaged audience to its content library of nearly 300,000 movies and television episodes. FOX Entertainment is renowned for its compelling primetime entertainment, including scripted dramas, leading unscripted programming and its longstanding Sunday animation block. These brands and others in our portfolio, such as our 29 owned and operated local television stations, including 18 broadcasting under the FOX brand, hold cultural significance with consumers and commercial importance for distributors and advertisers. The quality of our programming and the strength of our brands maximize the value of our content through a combination of affiliate fees and advertising sales.\nLeadership positions across strategically significant programming platforms.\nFOX enjoys leadership positions across its core news, sports and entertainment businesses. As linear television viewership declines across the industry, “appointment-based” programming that is the FOX hallmark remains resilient.\nFor over 20 consecutive years, FOX News has been the top-rated national cable news channel in Monday to Friday primetime viewing, according to The Nielsen Company (“Nielsen”). FOX News also finished the fiscal year as the #1 cable network in Monday to Friday primetime and total day viewing among total viewers for the tenth consecutive year and delivered ratings that were comparable to ratings delivered by the four broadcast networks in weekday primetime viewing. A leader in marquee live sports broadcasts, FOX Sports programs the National Football League (“NFL”) featuring\nAmerica's Game of the Week\n), college football (including the Big Ten Conference), Major League Baseball's (“MLB”) Regular Season,\nand post-season, including exclusive rights to the\n, National Association of Stock Car Auto Racing (“NASCAR”) and other marquee cyclical events, including the\nand the Fédération Internationale de Football Association (“FIFA”) Men's\n. FOX Sports has secured a significant portion of its marquee rights under long-term contracts. Under FOX’s ownership, Tubi has become one of the most relevant and\nfastest growing AVOD services in the country, with 13% growth in total view time (the total number of hours watched) in fiscal 2025 compared to the prior fiscal year. Tubi finished the fiscal year with approximately 2.2% share of all television viewing according to Nielsen’s\n, making it among the most watched free ad-supported streaming services in the U.S. FOX Entertainment has delivered the youngest and most diverse audience of the broadcast networks across all programming in primetime for over two decades. During the 2024-2025 broadcast season, FOX Entertainment featured two of the season’s top three debuts including the #1 Comedy\nUniversal Basic Guys\n, along with television’s three highest-rated and most watched cooking shows\n. FOX Television Stations covers 18 Nielsen-designated market areas (“DMAs”), including 14 of the 15 largest, and was the #1 or #2 rated news provider in the hours of 5 a.m. - 9 a.m. in the majority of the markets in which it operates among adults 25-54.\nWe believe the strength and leadership of our brands will continue to support our ability to secure industry leading affiliate rate and advertising price increases, while enabling us to nimbly respond to the opportunities and challenges traditional media companies are facing as technologies and changes in consumer behavior continue to rapidly evolve.\nSignificant presence and relevance in major domestic markets.\nThe FOX portfolio combines the range of national cable and broadcast networks and digital distribution platforms with the power of tailored local television. FOX News and FOX Business are available in approximately 60 million U.S. households and FOX Sports and FOX Entertainment programming on the FOX Network is available in virtually every U.S. market. Tubi’s ubiquitous availability provides broad distribution of films, episodic television programming, live local and national news content and sports programming. Tubi carries over 100 local station feeds (including feeds of our owned and operated stations), covering 78 DMAs and 23 of the top 25 markets. Additionally, our 29 owned and operated television stations cover 18 DMAs, including 14 of the 15 largest, and maintain duopolies in 11 DMAs, including New York, Los Angeles and Chicago, the three largest. These stations provide balanced content of national interest with programming of note to local communities, producing over 1,350 hours of local news coverage each week. The breadth and depth of our footprint allows us to produce and distribute our content in a cost-effective manner and share best business practices and models across regions. It also enables us to engage audiences, develop deeper consumer relationships and create more compelling product offerings.\nAttractive financial profile, including multiple revenue streams, strong balance sheet and other assets.\nWe have consistently achieved strong operational and financial results in a complex industry environment. Additionally, our solid balance sheet provides us with the financial flexibility to continue to invest across our businesses, allocate resources toward investments in growth initiatives, take advantage of strategic opportunities, including potential acquisitions across the range of media categories in which we operate and related adjacencies, and return capital to our stockholders. We have maintained significant liquidity, ending fiscal 2025 with approximately $5.4 billion of cash and cash equivalents on our balance sheet while returning approximately $1.25 billion of capital to our stockholders through our stock repurchase program and cash dividends and retiring $600 million of debt during fiscal 2025. We also benefit from a tax asset that resulted from the step-up in the tax basis of our assets following the Transaction, which is expected to provide an annual cash tax benefit for many years. Our asset portfolio also includes the FOX Studio Lot in Los Angeles, California, which spans over 50 acres and close to 2 million square feet of space for administration and television and film production services available to industry clients, including 15 sound stages, and other production facilities. Additionally, we own an equity stake in Flutter Entertainment plc (“Flutter”), an online sports betting and gaming company with operations in the U.S. and international",
  "item7_clean": "was primarily due to the net impact of the October 2023 issuance of $1.25 billion of senior notes and the repayment of $1.25 billion and $600 million of senior notes that matured in January 2024 and April 2025, respectively (See Note 9—Borrowings to the accompanying Financial Statements).\nStock Repurchase Program\nSee Note 11—Stockholders’ Equity to the accompanying Financial Statements under the heading “Stock Repurchase Program.”\nDividends paid in fiscal\ntotaled $0.54 per share of FOX’s\nClass A Common Stock, par value $0.01 per share (the “Class A Common Stock”), and Class B Common Stock, par value $0.01 per share (the “Class B Common Stock” and, together with the Class A Common Stock, the “Common Stock”)\n, the Company declared a semi-annual dividend of $0.28 per share on both the Class A Common Stock and the Class B Common Stock. The dividend declared is payable on September 24, 2025 with a record date for determining dividend entitlements of September 3, 2025.\nBased on the number of shares outstanding as of\n, and the new annual dividend rate stated above, the total aggregate cash dividends expected to be paid to stockholders in fiscal\nis approximately $250 million.\nThe following table summarizes cash (used in) repayment of borrowings and cash from borrowings for fiscal 2025 and 2024:\nFor the years ended June 30,\nNotes due 2025 and 2024\nIn April 2025 and January 2024, $600 million of 3.050% senior notes and $1.25 billion of 4.030% senior notes matured and were repaid in full, respectively (See Note 9—Borrowings to the accompanying Financial Statements).\nSee Note 9—Borrowings to the accompanying Financial Statements under the heading \"Public Debt - Senior Notes Issued.\"\nRatings of the Senior Notes\nThe following table summarizes the Company’s credit ratings as of June 30, 2025:\nBBB\nRevolving Credit Agreement\nIn June 2023, the Company entered into an unsecured $1.0 billion revolving credit facility\nwith a maturity date of June 2028 (See Note 9—Borrowings to the accompanying Financial Statements).\nCommitments and Contingencies\nThe Company has commitments under certain firm contractual arrangements (“firm commitments”) to make future payments. These firm commitments secure the future rights to various assets and services to be used in the normal course of operations. For additional details on commitments and contingencies see Note 14—Commitments and Contingencies to the accompanying Financial Statements under the headings “Licensed Programming,” “Other commitments and contractual obligations” and “Contingencies.”\nPension and other postretirement benefits and uncertain tax benefits\nThe table in Note 14—Commitments and Contingencies to the accompanying Financial Statements excludes the Company’s pension and other postretirement benefits (“OPEB”) obligations and the gross unrecognized tax benefits for uncertain tax positions as the Company is unable to reasonably predict the ultimate amount and timing. The Company made contributions of $40 million and $86 million to its pension plans in fiscal 2025 and 2024, respectively. The majority of these contributions were voluntarily made to improve the funded status of the plans. Future plan contributions are dependent upon actual plan asset returns, interest rates and statutory requirements. Assuming that actual plan asset returns are consistent with the Company’s expected plan returns in fiscal 2026 and beyond and that interest rates remain constant, the Company would not be required to make any material contributions to its pension plans for the immediate future. Required pension plan contributions for the next fiscal year are not expected to be material but the Company may make voluntary contributions in future periods. Payments due to participants under the Company’s pension plans are primarily paid out of underlying trusts. Payments due under the Company’s OPEB plans are not required to be funded in advance, but are paid as medical costs are incurred by covered retiree populations, and are principally dependent upon the future cost of retiree medical benefits under the Company’s OPEB plans. The Company does not expect its net OPEB payments to be material in fiscal 2026 (See Note 15—Pension and\nOther Postretirement Benefits to the accompanying Financial Statements for further discussion of the Company’s pension and OPEB plans).\nCRITICAL ACCOUNTING POLICIES AND ESTIMATES\nAn accounting policy is considered to be critical if it is important to the Company’s financial condition and results of operations and if it requires significant judgment and estimates on the part of management in its application. The development and selection of these critical accounting policies and estimates have been determined by management of the Company and the related disclosures have been reviewed with the Audit Committee of the Company’s Board of Directors. For the Company’s summary of significant accounting policies, see Note 2—Summary of Significant Accounting Policies to the accompanying Financial Statements.\nSee Note 2—Summary of Significant Accounting Policies to the accompanying Financial Statements under the heading “Use of Estimates.”\nRevenue is recognized when control of the promised goods or services is transferred to the Company’s customers in an amount that reflects the consideration the Company expects to be entitled to in exchange for those goods or services. The Company considers the terms of each arrangement to determine the appropriate accounting treatment. Significant judgments used in revenue recognition include the identification of performance obligations and the allocation of consideration, including those contracts containing bundled advertising sales or licenses.\nThe Company generates advertising revenue from sales of commercial time within the Company’s network programming, and from sales of advertising on the Company’s owned and operated television stations and various digital properties. Advertising revenue from customers is recognized as the commercials are aired. Certain of the Company’s advertising contracts have guarantees of a certain number of targeted audience views, referred to as impressions, where the performance obligation is the guarantee and revenue is recognized as the guarantee is satisfied. For contracts without guarantees, the individual advertising spots are the performance obligation and consideration is allocated based on relative standalone selling price. Advertising contracts, which are generally short-term, are billed monthly for the spots aired during the month, with payments due shortly thereafter.\nThe Company generates affiliate fee revenue from agreements with MVPDs for cable network programming and for the broadcast of the Company’s owned and operated television stations. In addition, the Company generates affiliate fee revenue from agreements with independently owned television stations that are affiliated with the FOX Network and receives retransmission consent fees from MVPDs for their signals. Affiliate fee revenue is recognized as the Company satisfies the performance obligation by continuously making the network programming available to the customer over the term of the agreement. For contracts with affiliate fees based on the number of the affiliate’s subscribers, revenues are recognized based on the contractual rate multiplied by the estimated number of subscribers each period. For contracts with fixed affiliate fees, revenues are recognized based on the relative standalone selling price of the network programming provided over the contract term, which generally reflects the invoiced amount. Affiliate contracts are generally multi-year contracts billed monthly with payments due shortly thereafter.\nLicensed and Owned Programming\nThe Company incurs costs to license programming rights and to produce owned programming. Licensed programming includes costs incurred by the Company for access to content owned by third parties. The Company has single and multi-year contracts for sports and non-sports programming. Licensed programming is recorded at the earlier of payment or when the license period has begun, the cost of the program is known or reasonably determinable and the program is accepted and available for airing. Advances paid for the right to broadcast sports events within one year and programming with an initial license period of one year or less are classified as current inventories included within Inventories, net in the Consolidated Balance Sheets, and license fees for programming with an initial license period of greater than one year are classified as non-current\ninventories included within Other non-current assets in the Consolidated Balance Sheets. Licensed programming is predominantly amortized as the associated programs are made available over the shorter of the license period or the period in which an economic benefit is expected to be derived. The costs of multi-year sports contracts are primarily amortized based on the ratio of each contract’s current period attributable revenue to the estimated total remaining attributable revenue. Estimates can change and, accordingly, are reviewed periodically and amortization is adjusted as necessary. Such changes in the future could be material.\nOwned programming, included within Other non-current assets in the Consolidated Balance Sheets, includes content internally developed and produced as well as co-produced content. Capitalized costs for owned programming, including direct costs, production overhead and development costs, are predominantly amortized using the individual-film-forecast-computation method, which is based on the ratio of current period revenue to estimated total future remaining revenue, and related costs are expensed as incurred. Future remaining revenue includes imputed license fees for content used by FOX as well as revenue expected to be earned based on distribution strategy and historical performance of similar content. Changes to estimated future revenues may result in impairments or changes in amortization patterns. When production partners distribute owned programming on the Company’s behalf, the net participation in profits is recorded as content license revenue. Projects in-process are written off at the earlier of abandonment or three years after initial capitalization.\nInventories are evaluated for recoverability when an event or circumstance occurs that indicates that fair value may be less than unamortized costs. The Company will determine if there is an impairment by evaluating the fair value of the inventories, which are primarily supported by internal forecasts as compared to unamortized costs. Where an evaluation indicates unamortized costs, including advances on multi-year sports rights contracts, are not recoverable, amortization of rights is accelerated in an amount equal to the amount by which the unamortized costs exceed fair value. Owned programming is predominantly monetized and tested for impairment on an individual basis. Licensed programming is predominantly monetized as a group and tested for impairment on a channel, network, or daypart basis. The recoverability of certain sports rights is assessed on an aggregate basis. The Company recognized impairments of approximately $40 million, $40 million, and $10 million in fiscal 2025, 2024 and 2023, respectively, related to owned programming at the Television segment, which were recorded in Operating expenses in the accompanying Consolidated Statements of Operations.\nGoodwill and Other Intangible Assets\nThe Company’s intangible assets include goodwill, Federal Communications Commission (“FCC”) licenses, MVPD affiliate agreements and relationships, software and trademarks and other copyrighted products.\nThe Company accounts for its business combinations under the acquisition method of accounting. The total cost of acquisitions is allocated to the underlying net assets acquired, based on their respective estimated fair values at the date of acquisition. Goodwill is recorded as the difference between the consideration transferred to acquire entities and the estimated fair values assigned to their tangible and identifiable intangible net assets and is assigned to one or more reporting units for purposes of testing for impairment. Determining the fair value of assets acquired and liabilities assumed requires management’s judgment and often involves the use of significant estimates and assumptions, including assumptions with respect to future cash inflows and outflows, discount rates, long-term growth rates, asset lives, market multiples and relevant comparable transactions, among other items. Identifying reporting units and assigning goodwill to them requires judgment involving the aggregation of business units with similar economic characteristics and the identification of existing business units that benefit from the acquired goodwill. The judgments made in determining the estimated fair value assigned to each class of intangible assets acquired, their reporting unit, as well as their useful lives can significantly impact net income. The Company allocates goodwill to disposed businesses using the relative fair value method.\nCarrying values of goodwill and intangible assets with indefinite lives are reviewed at least annually for possible impairment. The Company’s impairment review is based on a discounted cash flow analysis and market-based valuation approach that requires significant management judgment. The Company uses its judgment in assessing whether assets may have become impaired between annual valuations. Indicators such as unexpected adverse economic factors, unanticipated technological changes or competitive activities, loss of key personnel and acts by governments and courts, may signal that an asset has become impaired and require the Company to perform an interim impairment test.\nThe direct valuation method used for FCC licenses requires, among other inputs, the use of published industry data that is based on subjective judgments about future advertising revenues in the markets where the Company owns television stations. This method also involves the use of management’s judgment in estimating appropriate terminal growth rates, operating margins and discount rates reflecting the risk of a market participant in the broadcast industry. The resulting fair values for FCC licenses are sensitive to these long-term assumptions and any adverse changes to such assumptions could result in an impairment to existing carrying values in future periods and such impairment could be material.\nDuring fiscal 2025, the Company recorded a non-cash impairment charge for intangible assets of approximately $70 million primarily related to FCC licenses in Restructuring, impairment and other corporate matters in the accompanying Consolidated Statements of Operations within the Television segment. Based on the Company’s annual assessment, the carrying value of FCC licenses in certain markets exceeded their fair value primarily as a result of updated market data, including lower expected future advertising revenue. Additionally, the fair value of FCC licenses in certain markets exceeded their respective carrying value by less than 10% as of June 30, 2025. An increase to the discount rate of 0.5 percentage points, or a decrease to the terminal growth rate of 0.5 percentage points, assuming no changes to other long-term assumptions, would cause the aggregate fair value of FCC licenses to fall below the aggregate carrying value by approximately $80 million and $50 million, respectively. Further adverse changes in market conditions may result in additional non-cash impairment charges.\nDuring fiscal 2025, the Company determined that the goodwill included in the accompanying Consolidated Balance Sheets as of June 30, 2025 was not impaired based on the Company’s annual assessment and there are no reporting units at risk of impairment. While the Company believes its judgments represent reasonably po",
  "item2_clean": null
}