{
  "source_file": "fox-20250930.htm",
  "form_type": "10-Q",
  "item1_clean": null,
  "item7_clean": null,
  "item2_clean": "The Company has approximately $4.4 billion of cash and cash equivalents as of September 30, 2025 and an unused five-year $1.0 billion unsecured revolving credit facility (See Note 5—Borrowings to the accompanying Financial Statements). The Company also has access to the worldwide capital markets, subject to market conditions. As of September 30, 2025, the Company was in compliance with all of the covenants under the revolving credit facility, and it does not anticipate any noncompliance with such covenants.\nThe principal uses of cash that affect the Company’s liquidity position include the following: the acquisition of rights and related payments for entertainment and sports programming; operational expenditures including production costs; marketing and promotional expenses; expenses related to broadcasting the Company’s programming; employee and facility costs; capital expenditures; acquisitions, including redeemable noncontrolling interests; income taxes, interest and dividend payments; debt repayments; legal settlements; and stock repurchases.\nThe Company has evaluated, and expects to continue to evaluate, possible acquisitions and dispositions of certain businesses and assets. Such transactions may be material and may involve cash, the Company’s securities or the assumption of additional indebtedness.\nSources and Uses of Cash\nNet cash (used in) provided by operating activities for the three months ended September 30, 2025 and 2024 was as follows (in millions):\nFor the three months ended September 30,\nNet cash (used in) provided by operating activities\nThe change in net cash (used in) provided by operating activities during the three months ended September 30, 2025, as compared to the corresponding period of fiscal 2025, was primarily due to lower political advertising receipts due to the absence of the 2024 presidential and congressional elections, higher sports and entertainment programming payments and higher tax payments, partially offset by higher Segment EBITDA.\nNet cash used in investing activities for the three months ended September 30, 2025 and 2024 was as follows (in millions):\nFor the three months ended September 30,\nNet cash used in investing activities\nThe increase in net cash used in investing activities during the three months ended September 30, 2025, as compared to the corresponding period of fiscal 2025, was primarily due to an increase in the Company’s investments and capital expenditures.\nNet cash used in financing activities for the three months ended September 30, 2025 and 2024 was as follows (in millions):\nFor the three months ended September 30,\nNet cash used in financing activities\nThe increase in net cash used in financing activities during the three months ended September 30, 2025, as compared to the corresponding period of fiscal 2025, was primarily due to the Company’s purchase of noncontrolling interest.\nStock Repurchase Program\nSee Note 6—Stockholders’ Equity to the accompanying Financial Statements under the heading “Stock Repurchase Program.”\nThe Company declared a semi-annual dividend of\nper share on both the Class A Common Stock and the Class B Common Stock during the\nthree months ended September 30, 2025, which was paid on September 24, 2025\nexpects to continue to pay semi-annual dividends, although each dividend is subject to approval by the Company’s Board of Directors.\nBorrowings include senior notes (See Note 5—Borrowings to the accompanying Financial Statements).\nRatings of the Senior Notes\nThe following table summarizes the Company’s credit ratings as of September 30, 2025:\nBBB\nRevolving Credit Agreement\nThe Company has an unused five-year $1.0 billion unsecured revolving credit facility with a maturity date of June 2028 (See Note 5—Borrowings to the accompanying Financial Statements).\nCommitments and Contingencies\nSee Note 8—Commitments and Contingencies to the accompanying Financial Statements.\nCRITICAL ACCOUNTING POLICIES AND ESTIMATES\nCAUTION CONCERNING FORWARD-LOOKING STATEMENTS\nThis document contains “forward-looking statements” within the meaning of Section 27A of the Securities Act of 1933, as amended, and Section 21E of the Securities Exchange Act of 1934, as amended. All statements other than statements of historical or current fact are “forward-looking statements” for purposes of federal and state securities laws, including any statements regarding (i) future earnings, revenues or other measures of the Company’s financial performance; (ii) the Company’s plans, strategies and objectives for future operations; (iii) proposed new programming or other offerings; (iv) future economic conditions or performance; (v) future share repurchases; and (vi) assumptions underlying any of the foregoing. Forward-looking statements may include, among others, the words “may,” “will,” “should,” “likely,” “anticipates,” “expects,” “intends,” “plans,” “projects,” “believes,” “estimates,” “outlook” or any other similar words.\nAlthough the Company’s management believes that the expectations reflected in any of the Company’s forward-looking statements are reasonable, actual results could differ materially from those projected or assumed in any forward-looking statements. The Company’s future financial condition and results of operations, as well as any forward-looking statements, are subject to change and to inherent risks and uncertainties, such as those disclosed or incorporated by reference in our filings with the SEC. Important factors that could cause the Company’s actual results, performance and achievements to differ materially from those estimates or projections contained in the Company’s forward-looking statements include, but are not limited to, government regulation, economic, strategic, political and social conditions and the following factors:\nevolving technologies and distribution platforms and offerings and changes in consumer behavior as consumers seek more control over when, where and how they consume content, and related impacts on advertisers and MVPDs;\ndeclines in advertising expenditures due to various factors such as the economic prospects of advertisers or the economy, evolving technologies and distribution platforms and related changes in consumer behavior and shifts in advertisers’ expenditures, the evolving digital advertising market, major sports events and election cycles, and audience measurement methodologies’ ability to accurately reflect actual multiplatform viewership levels;\nfurther declines in the number of subscribers to MVPD services;\nthe failure to enter into or renew on favorable terms, or at all, affiliation or carriage agreements or arrangements through which the Company makes its content available for viewing through online video platforms;\nthe highly competitive nature of the industry in which the Company’s businesses operate;\nthe popularity of the Company’s content, including special sports events; and the continued popularity of the sports franchises, leagues and teams for which the Company has acquired programming rights;\nthe Company’s ability to renew programming rights, particularly sports programming rights, on sufficiently favorable terms, or at all;\ndamage to the Company’s brands or reputation;\nthe inability to realize the anticipated benefits of the Company’s acquisitions, investments and other strategic initiatives, and the effects of any combination or significant acquisition, disposition or other similar transaction involving the Company;\nthe loss of key personnel;\nlabor disputes, including labor disputes involving professional sports leagues whose games or events the Company has the right to broadcast;\nlower than expected valuations associated with the Company’s reporting units, indefinite-lived intangible assets, investments or long-lived assets;\na degradation, failure or misuse of the Company’s network and information systems and other technology relied on by the Company that causes a disruption of services or improper disclosure of personal data or other confidential information;\ncontent piracy and signal theft and the Company’s ability to protect its intellectual property rights;\nthe failure to comply with laws, regulations, rules, industry standards or contractual obligations relating to privacy and personal data protection;\nchanges in tax, federal communications or other laws, regulations, practices or the interpretation or enforcement thereof;\nthe impact of any investigations or fines from governmental authorities, including Federal Communications Commission (“FCC”) rules and policies and FCC decisions regarding revocation, renewal or grant of station licenses, waivers and other matters;\nthe failure or destruction of satellites or transmitter facilities the Company depends on to distribute its programming;\nunfavorable litigation outcomes or investigation results that require the Company to pay significant amounts or lead to onerous operating procedures;\nchanges in GAAP or other applicable accounting standards and policies;\nthe Company’s ability to secure additional capital on acceptable terms; and\nForward-looking statements in this Quarterly Report speak only as of the date hereof, and forward-looking statements in documents that are incorporated by reference hereto speak only as of the date of those documents. The Company does not undertake any obligation to update or release any revisions to any forward-looking statement made herein or to report any events or circumstances after the date hereof or to reflect the occurrence of unanticipated events or to conform such statements to actual results or changes in our expectations, except as required by law.\n\nITEM 2. MANAGEMENT’S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS\nINTRODUCTION\nManagement’s discussion and analysis of financial condition and results of operations is intended to help provide an understanding of the Company’s financial condition, changes in financial condition and results of operations. This discussion is organized as fo"
}