{
  "source_file": "frt-20241231.htm",
  "form_type": "10-K",
  "item1_clean": "ITEM 1. BUSINESS\nFederal Realty Investment Trust (the \"Parent Company\" or the \"Trust\") is an equity real estate investment trust (\"REIT\"). Federal Realty OP LP (the \"Operating Partnership\") is the entity through which the Trust conducts substantially all of its operations and owns substantially off of its assets. The Trust owns 100% of the limited liability company interest of, is sole member of, and exercises exclusive control over Federal Realty GP LLC (the \"General Partner\"), which in turn, is the sole\ngeneral partner of the Operating Partnership. Unless stated otherwise or the context otherwise requires, \"we,\" \"our,\" and \"us\" means the Trust and its business and operations conducted through its directly and indirectly owned subsidiaries, including the Operating Partnership. We specialize in the ownership, management, and redevelopment of high quality retail and mixed-use properties located primarily in communities where we believe retail demand exceeds supply, in strategically selected metropolitan markets in the Mid-Atlantic and Northeast regions of the United States, California, and South Florida. As of December 31, 2024, we owned or had a majority interest in community and neighborhood shopping centers and mixed-use properties which are operated as 102 predominantly retail real estate projects comprising approximately 26.8 million commercial square feet. In total, the real estate projects were 96.2% leased and 94.1% occupied at December 31, 2024. Our revenue is primarily generated from lease agreements with tenants. We have paid quarterly dividends to our shareholders continuously since our founding in 1962 and have increased our dividends per common share for 57 consecutive years.\nWe were founded in 1962 as a REIT under the laws of the District of Columbia and re-formed as a REIT in the state of Maryland in 1999. In January of 2022, we consummated the UPREIT reorganization described in the Explanatory Note at the beginning of this Annual Report. We operate in a manner intended to qualify as a REIT for tax purposes pursuant to provisions of the Internal Revenue Code of 1986, as amended (the “Code”). Our principal executive offices are located at 909 Rose Avenue, North Bethesda, Maryland 20852. Our telephone number is (301) 998-8100. Our website address is\nwww.federalrealty.com\n. The information contained on our website is not a part of this report and is not incorporated herein by reference.\nBusiness Objectives and Strategies\nOur primary business objective is to own, manage, acquire and redevelop a portfolio of high quality retail focused properties that will:\nprovide increasing cash flow for distribution to shareholders;\ngenerate higher internal growth than the shopping center industry over the long term;\nprovide potential for capital appreciation; and\nprotect investor capital.\nOur portfolio includes, and we continue to acquire and redevelop, high quality retail in many formats ranging from regional, community and neighborhood shopping centers that often are anchored by grocery stores to mixed-use properties that are typically centered around a retail component but also include residential and office components.\nOperating Strategies\nWe continuously evaluate and assess our operating strategies to ensure they are effective and put us in the best position to address changes in the market. We actively manage our properties to maximize rents and maintain occupancy levels by attracting and retaining a strong and diverse base of tenants and replacing less relevant, weaker, underperforming tenants with stronger ones. Our properties are generally located in some of the most densely populated and affluent areas of the country. These strong demographics help our tenants generate higher sales, which has generally enabled us to maintain higher occupancy rates, charge higher rental rates, and maintain steady rent growth, all of which increase the value of our portfolio. Our operating strategies also include:\nincreasing rental rates through the negotiation of contractual rental increases during the term of the lease, the renewal of expiring leases or the leasing of space to new tenants at higher rental rates while limiting vacancy and down-time;\nmaintaining a diversified tenant base, thereby limiting exposure to any one tenant’s financial or operating difficulties;\nactively managing the merchandising mix of our tenant base to achieve a balance of strong national and regional tenants with local specialty tenants;\nminimizing overhead and operating costs;\nactively managing the physical appearance of our properties and the construction quality, condition and design of the buildings and other improvements located on our properties to maximize our ability to attract customers and thereby generate higher rents and occupancy rates;\nmanaging our properties to take into account their impact on climate change and their resilience in the face of climate change;\ndeveloping local and regional market expertise in order to capitalize on market and retailing trends;\nleveraging the contacts and experience of our management team to build and maintain long-term relationships with tenants;\nproviding exceptional customer service; and\ncreating an experience at many of our properties that is identifiable, unique and serves the surrounding communities to help insulate these properties and the tenants at these properties from the impact of on-line retailing.\nInvesting Strategies\nOur investment strategy is to deploy capital at risk-adjusted rates of return that exceed our long-term weighted average cost of capital in projects that have potential for future income growth and increased value. Our investments primarily fall into one of the following four categories:\nrenovating, expanding, reconfiguring and/or retenanting our existing properties to take advantage of under-utilized land or existing square footage to increase revenue;\nrenovating or expanding tenant spaces for tenants capable of producing higher sales, and therefore, paying higher rents;\nacquiring quality retail and mixed-use properties located in densely populated and/or affluent areas where barriers to entry for further development are high, and that have possibilities for enhancing operating performance and creating value through renovation, expansion, reconfiguration and/or retenanting; and\ndeveloping the retail portions of mixed-use properties and developing or otherwise investing in non-retail portions of mixed-use properties we already own in order to capitalize on the overall value created in these properties.\nWhen we evaluate potential redevelopment, retenanting, expansion, acquisition and development opportunities, we consider such factors as:\nthe expected returns in relation to our short and long-term cost of capital as well as the anticipated risk we will face in achieving the expected returns;\nthe anticipated growth rate of operating income generated by the property;\nthe ability to increase the long-term value of the property through redevelopment and retenanting;\nthe tenant mix at the property, tenant sales performance and the creditworthiness of those tenants;\nthe geographic area in which the property is located, including the population density, household incomes, education levels, as well as the population and income trends in that geographic area. This may from time to time include the evaluation of new markets;\ncompetitive conditions in the vicinity of the property, including gross leasable area (GLA) per capita, competition for tenants and the ability of others to create competing properties through redevelopment, new construction or renovation;\naccess to and visibility of the property from existing roadways and the potential for new, widened or realigned, roadways within the property’s trade area, which may affect access and commuting and shopping patterns;\nthe level and success of our existing investments in the market area;\nthe current market value of the land, buildings and other improvements and the potential for increasing those market values; and\nthe physical condition of the land, buildings and other improvements, including the structural and environmental condition.\nFinancing Strategies\nOur financing strategies are designed to enable us to maintain an investment grade balance sheet while retaining sufficient flexibility to fund our operating and investing activities in the most cost-efficient way possible. Our financing strategies include:\nmaintaining a prudent level of overall leverage and an appropriate pool of unencumbered properties that is sufficient to support our unsecured borrowings;\nmanaging our exposure to variable-rate debt;\nmaintaining sufficient levels of cash and available line of credit to fund operating and investing needs on a short-term basis;\ntaking advantage of market opportunities to refinance existing debt, reduce interest costs and manage our debt maturity schedule so that a significant portion of our debt relative to our size does not mature in any one year;\nselling properties that have limited growth potential or are not a strategic fit within our overall portfolio and redeploying the proceeds to redevelop, renovate, retenant and/or expand our existing properties, acquire new properties or reduce debt; and\nutilizing the most advantageous long-term source of capital available to us to finance redevelopment and acquisition opportunities, which may include:\nthe sale of our equity or debt securities through public offerings, including our at-the-market (\"ATM\") equity program in which we may from time to time offer and sell common shares including through forward sales contracts, or private placements,\nthe incurrence of indebtedness through unsecured or secured borrowings including exchangeable debt,\nthe issuance of units in our operating partnership (generally issued in exchange for a tax deferred contribution of property); these units typically receive the same distributions as our common shares and the holders of these units have the right to exchange their units for cash or common shares at our option, or\nthe use of joint venture arrangements.\nAt February 10, 2025, we had 304 full-time employees and 5 part-time employees. None of our employees are represented by a collective bargaining unit. We believe that our relationship with our employees is good. We are an Equal Opportunity/Affirmative Action employer, and strive to maintain a workplace that is free from discrimination on the basis of race, color, religion, sex, sexual orientation, nationality, disability, or protected Veteran status.\nHealth, Safety, and Wellness\nWe are committed to the health, safety, and wellness of our employees, and foster an environment that allows our people to succeed while balancing work and life. We provide our employees with access to health and wellness programs, which includes benefits that support both physical and mental health. We have also transitioned to a hybrid work model.\nCompensation and Benefits\nWe provide competitive pay and benefits including health, dental, vision, short and long-term disability, life insurance and a 401(k) retirement program, as well as a generous paid time off program that includes vacation, sick, and personal leave. In addition to our equity awards program, we also offer a quarterly recognition program, as well as rewarding employees with spot bonuses for stellar performance or going above and beyond the base requirements of their job description.\nEmployees have access to a variety of different training courses, books, book summaries and audio books, and an array of source materials covering a myriad of different business and soft skills training subjects. Additionally, we provide reimbursement for tuition and professional licensures.\nCommunity Involvement\nGiving back to the community is an integral part of who we are and what we do. We provide ample ways to give back through programs at our properties or charitable endeavors and volunteer opportunities that also serve as tea",
  "item7_clean": "ITEM 7. MANAGEMENT'S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS\nForward-Looking Statements\nCertain statements in this section or elsewhere in this report may be deemed “forward-looking statements”. See “Item 1A. Risk Factors” in this report for important information regarding these forward-looking statements and certain risk and uncertainties that may affect us. The following discussion should be read in conjunction with the consolidated financial statements and notes thereto appearing in “Item 8. Financial Statements and Supplementary Data” of this report.\nFederal Realty Investment Trust (the \"Parent Company\" or the \"Trust\") is an equity real estate investment trust (\"REIT\"). Federal Realty OP LP (the \"Operating Partnership\") is the entity through which the Trust conducts substantially all of its operations and owns substantially all of its assets. The Trust owns 100% of the limited liability company interest of, is sole member of, and exercises exclusive control over Federal Realty GP LLC (the \"General Partner\"), which in turn, is the sole general partner of the Operating Partnership. Unless stated otherwise or the context otherwise requires, \"we,\" \"our,\" and \"us\" means the Trust and its business and operations conducted through its directly and indirectly owned subsidiaries, including the Operating Partnership. We specialize in the ownership, management, and redevelopment of high quality retail and mixed-use properties located primarily in communities where we believe demand exceeds supply, in strategically selected metropolitan markets in the Northeast and Mid-Atlantic regions of the United States, California, and South Florida. As of December 31, 2024, we owned or had a majority interest in community and neighborhood shopping centers and mixed-use properties which are operated as 102 predominantly retail real estate projects comprising approximately 26.8 million commercial square feet. In total, the real estate projects were 96.2% leased and 94.1% occupied at December 31, 2024. We have paid quarterly dividends to our shareholders continuously since our founding in 1962 and have increased our dividends per common share for 57 consecutive years.\nGeneral Economic Conditions\nThe economy continues to face several issues including inflation risk, high interest rates, and potentially worsening economic conditions, which presents risks for our business and our tenants. We continue to monitor and address risks related to the general state of the economy. We believe that the actions we have taken to improve our financial position and maximize our liquidity will continue to mitigate the impact to our cash flow caused by tenants not timely paying contractual rent.\nAdditional discussion of the impact of current economic conditions on our results and long-term operations can be found throughout Item 7 and\nCorporate Responsibility\nWe actively endeavor to operate and develop our properties in a sustainable, responsible, and effective manner with the objective being to drive long-term growth and aid in value creation for our shareholders, tenants, employees, and local communities. We have aligned our program and efforts with the United Nations Sustainable Development Goals, as described in our Sustainability Policy and our 2023 Environmental Social and Governance Report, which are provided only for informational purposes on our website and not incorporated by reference herein.\nWe are committed to implementing sustainable business practices at our operating properties that focus on energy efficiency, water conservation and waste minimization and have established greenhouse gas (GHG) emissions reduction targets in accordance with the Science-Based Targets initiative as well as energy reduction targets. To achieve these targets, we are actively addressing energy efficiency projects on site such as upgrading to LED lighting, procuring green energy, reducing electric consumption, and increasing our onsite solar generation capacity. We have installed on-site solar systems at 28 of our properties with a capacity of 15 MW with more projects actively in progress. We also installed electric vehicle car charging\nstations in numerous properties throughout our portfolio. We currently have over 400 charging stations in operation with more under construction.\nWe also understand that we face risks presented by climate change and are working to evaluate our risk exposure. In our 2023 Sustainability report, we provided a disclosure pursuant to the Task Force on Climate Related Financial Disclosure and we intend to provide that disclosure annually.\nWe are also highly committed to our employees and fostering a work environment that promotes growth, development and personal well-being. Our four core values are accountability, excellence, innovation and integrity and we seek to attract and retain talented professionals who embrace those values. All of our efforts with respect to corporate responsibility are overseen by our Board of Trustees.\nOur development activities have been heavily focused on owning, developing and operating properties that are certified under the U.S. Green Building Council’s® (“USGBC”) Leadership in Energy and Environmental Design™ (LEED®) rating system which serves as a third-party verification that a building or community was designed and built to mitigate its environmental footprint. We currently have 25 LEED certified buildings and our Pike & Rose project has achieved LEED for Neighborhood Development Stage 3 Gold certification.\nOur chief information officer, who has over 30 years of experience in managing information systems for real estate companies, heads our internal team of technology professionals who are responsible for managing our cybersecurity risks, which includes identifying our primary areas of risk, establishing processes, procedures, and systems to mitigate those risks and identifying and remediating any breaches that may occur. Cybersecurity risk management falls under our general counsel as part of our overall risk management program, which is ultimately overseen by the Audit Committee of the Board of Trustees. Our team is supported by a third party company that we have retained to act as our chief information security officer based on the third party company's experience in preventing cybersecurity incidents, advising clients about appropriate cybersecurity procedures and processes, and assessing the integrity of those procedures and processes. The assessment and management of our cybersecurity risks covers all of our internal systems as well as the systems of third parties who maintain our data.\nWe rely on our management team's experience in risk management, in consultation with our third party advisor, to appropriately address cybersecurity threats. As part of our processes to manage risks from cybersecurity threats, we have developed and enforce company-wide policies related to password encryption, strength and expiration, we require multi-factor authentication where appropriate, and we conduct regular employee training about our policies and cybersecurity threats. We make use of firewalls, anti-virus software, backups, redundancies, regular penetration testing, and our systems monitor and flag irregularities in how our information systems are accessed or used. Any known cybersecurity incidents would be reported by our chief information officer to our general counsel and disclosure committee for evaluation and remediation, and for a determination of how we might develop further security systems and procedures to address evolving cybersecurity threats. Management provides written and verbal updates to the Audit Committee at least quarterly identifying our primary areas of risk, actions taken or planned to be taken to mitigate those risks, and specific activities undertaken during the quarter, including employee training and the results of that training. Management would also provide updates to seek oversight from the Audit Committee on an ad hoc basis in connection with any material cybersecurity incident, should one occur.\nWe have not experienced any cybersecurity incident that has had a material impact on our business strategy, results of operations, or financial condition. For more information, see Item 1A. Risk Factors (\"We face risks relating to cybersecurity threats that could cause loss of confidential information and other business distributions\").\nCritical Accounting Policies and Estimates\nThe preparation of financial statements in conformity with accounting principles generally accepted in the United States of America, referred to as “GAAP”, requires management to make estimates and assumptions that in certain circumstances affect the reported amounts of assets and liabilities, disclosure of contingent assets and liabilities, and revenues and expenses. These estimates are prepared using management’s best judgment, after considering past and current events and economic conditions. In addition, information relied upon by management in preparing such estimates includes internally generated financial and operating information, external market information, when available, and when necessary, information obtained from consultations with third party experts. Actual results could differ from these estimates. A discussion of possible risks which may affect these estimates is included in “Item 1A. Risk Factors” of this report. Management considers an accounting estimate to be critical if changes in the estimate could have a material impact on our consolidated results of operations or financial condition.\nOur significant accounting policies are more fully described in Note 2 to the consolidated financial statements; however, the most critical accounting policies, which are most important to the portrayal of our financial condition and results of operations, and involve the use of complex estimates and significant assumptions as to future uncertainties and, therefore, may result in actual amounts that differ from estimates, are as follows:\nCollectibility of Lease Income\nOur leases with our tenants are classified as operating leases. When collection of substantially all lease payments during the lease term is considered probable, the lease qualifies for accrual accounting. When collection of substantially all lease payments during the lease term is not considered probable, total lease revenue is limited to the lesser of revenue recognized under accrual accounting or cash received. Determining the probability of collection of substantially all lease payments during a lease term requires significant judgment. This determination is impacted by numerous factors including our assessment of the tenant’s credit worthiness, economic conditions, tenant sales productivity in that location, historical experience with the tenant and tenants operating in the same industry, future prospects for the tenant and the industry in which it operates, and the length of the lease term. If leases currently classified as probable are subsequently reclassified as not probable, any outstanding lease receivables (including straight-line rent receivables) would be written-off with a corresponding decrease in rental income. For example, in the event that our collectibility determinations were not accurate and we were required to write off additional receivables equaling 1% of rental income, our rental income and net income would decrease by $11.7 million. If leases currently classified as not probable are subsequently changed to probable, any lease receivables (including straight-line rent receivables) are re-instated with a corresponding increase to rental income.\nReal Estate Acquisitions\nUpon acquisition of operating real estate properties, we estimate the fair value of assets and liabilities acquired including land, building, improvements, leasing costs, intangibles such as acquired leases, assumed debt, and current assets and liabilities, if any. Based on these estimates, we allocate the purchase price to the applicable assets and liabilities. We utilize methods similar to those used by independent appraisers in estimating the fair value of acquired assets and liabilities. The value allocated to acquired leases is amortized over the related lease term and reflected as rental income in the statement of operations. We consider qualitative and quantitative factors in evaluating the likelihood of a tenant exercising a below market renewal option and include such renewal options in the calculation of in-place lease value when we consider these to be bargain renewal options. If the value of below market lease intangibles includes renewal option periods, we include such renewal periods in the amortization period utilized. If a tenant vacates its space prior to contractual termination of its lease, the unamortized balance of any acquired lease value is written off to rental income.\nDuring 2024 and 2023, we acquired properties included in our consolidated financial statements with a total purchase price of $341.0 million. $1.8 million, or 1% of the total purchase price was allocated to above market lease assets and $18.5 million, or 5% was allocated to below market lease liabilities. If the amounts allocated in 2024 and 2023 to below market lease liabilities and building assets were each reduced by 5% of the total purchase price, annual below market lease liability amortization increasing rental income would decrease by approximately $0.8 million (using the weighted average life of below market liabilities at each respective acquired property) and annual depreciation expense would decrease by approximately $0.4 million (using a depreciable life of 35 years).\nLong-Lived Assets and Impairment\nThere are estimates and assumptions made by management in preparing the consolidated financial statements for which the actual results will be determined over long periods of time. This includes the recoverability of long-lived assets, including our properties that have been acquired or redeveloped and our investment in certain joint ventures. Management’s evaluation of impairment includes review for possible indicators of impairment as well as, in certain circumstances, undiscounted and discounted cash flow analysis. Since most of our investments in real estate are wholly-owned or controlled assets which are held for use, a property with impairment indicators is first tested for impairment by comparing the undiscounted cash flows, taking into account the anticipated hold period, including residual value, to the current net book value of the property. If the undiscounted cash flows are less than the net book value, the property is written down to expected fair value.\nThe calculation of both discounted and undiscounted cash flows requires management to make estimates of future cash flows including revenues, operating expenses, required maintenance and development expenditures, market conditions, demand for space by tenants and rental rates over long periods. Because our properties typically have a long life, the assumptions used to estimate the future recoverability of book value requires significant management judgment. We are also required to estimate the anticipated hold period. A change in the expected holding period from a long term hold to a short term would cause a significant change in the undiscounted cash flows and could result in an impairment charge. Actual results could be significantly different from the estimates. These estimates have a direct impact on net income, because recording an impairment charge results in a negative adjustment to net income.\nRecently Adopted and Recently Issued Accounting Pronouncements\nSee Note 2 to the consolidated financial statements.\n2024 Acquisitions and Dispositions\nOn May 31, 2024, we acquired the fee interest in Virginia Gateway, which is comprised of five adjacent shopping centers in Gainesville, Virginia, totaling 664,000 square feet, for $215.0 mill",
  "item2_clean": null
}