{
  "source_file": "fslr-20241231.htm",
  "form_type": "10-K",
  "item1_clean": "by 2030. The government has also announced a series of policy and regulatory measures to incentivize domestic manufacturing of PV solar modules, as described below under “Incentive Programs.” These targets, policies, and regulatory measures are expected to help create significant and sustained demand for PV solar energy. In addition to these factors, our CdTe solar technology is well suited for the India market given its hot and humid climate conditions. As a result of such market opportunities and renewable targets, we recently expanded production of Series 7 modules at our first manufacturing facility in India, bringing our total installed nameplate production capacity in the country to 3.2 GW.\nAlthough we compete in markets that do not require solar-specific government incentive programs, our net sales and profits remain subject to variability based on the scope of tax and production incentives, renewable portfolio standards, tendering systems, and other support programs intended to stimulate economies, achieve decarbonization initiatives, and/or establish greater energy independence. Such programs continue to influence the demand for PV solar energy around the world.\nIn the United States, incentive programs exist at both the federal and state levels and may take the form of investment and production tax credits, sales and property tax exemptions and abatements, and/or renewable energy targets. However, the potential policies of the new U.S. presidential administration and Congress have raised some uncertainty as to such incentive programs. For more information about certain risks associated with such incentives, see Item 1A. “Risk Factors – We have received and expect to continue to receive certain financial benefits as a result of tax incentives provided by the Inflation Reduction Act of 2022. If these financial benefits vary significantly from our assumptions, our business, financial condition, and results of operations could be adversely affected.” and “Risk Factors – Existing regulations and policies, changes thereto, and new regulations and policies may present technical, regulatory, and economic barriers to the purchase and use of PV solar products, which may\nsignificantly reduce demand for our modules.” For more information about pending and ongoing developments related to the IRA, see Item 7. “Management’s Discussion and Analysis of Financial Condition and Results of Operations – Certain Trends and Uncertainties.” Government incentives include the following:\nAdvanced Manufacturing Production Credit\n. In August 2022, the previous U.S. President signed the IRA into law, which was intended to accelerate the country’s ongoing energy transition. The provisions of the IRA are generally effective for tax years beginning after 2022. As discussed above, the IRA offers various tax credits, including the advanced manufacturing production credit, pursuant to Section 45X of the Internal Revenue Code (the “IRC”), for solar modules and certain solar module components manufactured in the United States and sold to third parties. Such credit may be refundable by the Internal Revenue Service (“IRS”) or transferable to a third party and is available from 2023 through 2032, subject to phase down beginning in 2030. For eligible components, the credit is equal to (i) $12 per square meter for a PV wafer, (ii) 4 cents multiplied by the capacity of a PV cell in watts, and (iii) 7 cents multiplied by the capacity of a PV module in watts. Such financial incentives are expected to increase both the demand for, and the domestic manufacturing of, solar modules and solar module components in the United States. For more information about certain risks associated with the benefits available to us under the IRA, see Item 1A. “Risk Factors – We have received and expect to continue to receive certain financial benefits as a result of tax incentives provided by the Inflation Reduction Act of 2022. If these financial benefits vary significantly from our assumptions, our business, financial condition, and results of operations could be adversely affected.” For more information about pending and ongoing developments related to the IRA, see Item 7. “Management’s Discussion and Analysis of Financial Condition and Results of Operations – Certain Trends and Uncertainties.”\nInvestment and Production Tax Credits\n. At the federal level, investment and production tax credits for business and residential solar systems have gone through cycles of enactment and expiration over several decades. The current federal energy investment tax credit (“ITC”) for solar energy property requires projects to meet certain wage and apprenticeship requirements and to have commenced construction by a certain date, which may be achieved by certain qualifying procurement activities. In 2022, the U.S. Congress reinstated the 30% ITC as part of the IRA discussed above. Similarly, the IRA extended the renewable electricity PTC, which provides a tax credit for electricity generated by solar and other qualifying technologies for the first 10 years of a system’s operations. Both the ITC and PTC are available until a four-year phase down is triggered, which occurs at the later of 2032 or the year in which power-sector emissions are 25% of 2022 levels. The ITC and PTC have been important economic drivers of solar installations and qualifying procurement activities in the United States. The positive impact of the ITC and PTC depends, in large part, on the availability of tax equity for project financing or the ability to transfer such credits to other taxpayers.\n. The U.S. Department of Energy, though its Solar Energy Technologies Office (“SETO”), funds various solar energy R&D projects, including PV, system integration, and manufacturing initiatives, among others. In September 2023, SETO announced the Advancing U.S. Thin-Film Solar Photovoltaics Funding Opportunity, which provides incentives for qualifying solar R&D projects related to CdTe development and the manufacturing of perovskite tandem PV products. In May 2024, SETO announced the award recipients for this funding opportunity, which included First Solar. These grants are intended to accelerate and expand domestic solar R&D to strengthen U.S. solar manufacturing and contribute to renewable energy targets.\nIn India, incentives at both the federal and state levels have contributed to growth in domestic PV solar module manufacturing and solar energy installations. Such incentives include the following:\nProduction Linked Incentive.\nIn March 2023, the government of India allocated financial incentives under the Production Linked Incentive (“PLI”) scheme to certain PV module manufacturers, including First Solar. The PLI scheme is expected to provide aggregate funding of INR 185 billion ($2.2 billion), which is\nintended to promote the manufacturing of high efficiency solar modules in India and to reduce India’s dependency on foreign imports of solar modules. For more information about pending and ongoing developments related to the PLI, see Item 7. “Management’s Discussion and Analysis of Financial Condition and Results of Operations – Certain Trends and Uncertainties.”\nVarious proposed and contemplated environmental and tax policies may create regulatory uncertainty in the renewable energy sector, including the solar energy sector, and may lead to a reduction or removal of various clean energy programs and initiatives designed to curtail climate change. For more information about the risks associated with these potential government actions, see Item 1A. “Risk Factors – The modification, reduction, elimination, or expiration of government subsidies, economic incentives, tax incentives, renewable energy targets, and other support for on-grid solar electricity applications, or the impact of other public policies, such as tariffs or other trade remedies imposed on solar cells and modules or related raw materials or equipment, could negatively impact demand and/or price levels for our solar modules and limit our growth or lead to a reduction in our net sales or increase our costs, thereby adversely impacting our operating results.”\nOur primary segment is our modules business, which involves the design, manufacture, and sale of CdTe solar modules, which convert sunlight into electricity. Since the inception of First Solar, our modules have used our advanced thin film semiconductor technology. Our Series 6 Plus module is a glass laminate approximately 4ft x 6ft in size that encapsulates thin film PV semiconductor materials. Our Series 7 module has a larger form factor of approximately 4ft x 7ft in size. At the end of 2024, our Series 6 Plus and Series 7 modules had an average power output of 459 watts and 531 watts, respectively.\nOur module manufacturing process uses approximately 30 types of raw materials and components to construct a solar module, including CdTe, front glass coated with transparent conductive oxide, other semiconductor materials, organics such as adhesives, heat-strengthened back glass, frames, packaging components such as interlayer, cord plate/cord plate cap, lead wire, and solar connectors. Before we use these materials and components in our manufacturing process, a supplier must undergo rigorous qualification procedures, and we continually evaluate new suppliers as part of our cost reduction roadmap and expansion activities. When possible, we attempt to use suppliers that can provide a raw material supply source that is near our manufacturing locations, reducing the cost and lead times for such materials. For more information about the risks associated with our supply chain, see Item 1A. “Risk Factors – Several of our key raw materials and components are either single-sourced or sourced from a limited number of suppliers, and their failure to perform could cause manufacturing delays and impair our ability to deliver solar modules to customers in the required quality and quantities and at a price that is profitable to us.”\nOur customers include system developers, independent power producers, utilities, commercial and industrial companies, and other system owners and operators. During 2024, our third-party module sales represented approximately 100% of our total net sales, and we sold the majority of our solar modules to customers with projects in the United States. During 2024, no customer accounted for more than 10% of our modules business net sales. For more information about risks related to our customers, see Item 1A. “Risk Factors – The loss of any of our large customers, or the inability of our customers and counterparties to perform under their contracts with us, could significantly reduce our net sales and negatively impact our results of operations.”\nWe continue to focus on certain key geographic markets, particularly in areas with abundant solar resources and sizable electricity demand, and additional customer relationships to diversify our customer base. The wholesale commercial and industrial market continues to represent a promising opportunity for the widespread adoption of PV solar technology as corporations undertake certain sustainability commitments. The demand for corporate\nrenewables continues to accelerate, with corporations worldwide committing to the RE100 campaign. We believe we also have a competitive advantage in the commercial and industrial market due to many customers’ sensitivity to the sustainability, experience, and financial stability of their suppliers and geographically diverse operating locations. With our financial strength, global footprint, and commitment to responsible solar, we are well positioned to meet these needs.\nAdditionally, the increase of utility-owned generation and overall electric load growth, especially as a result of AI-driven data center demand, have expanded the number of potential buyers of our modules as such utility and data center customers benefit from a potentially low cost of capital available through rate-",
  "item7_clean": "and 19 GW and sell between 18 GW and 20 GW.\nIn May 2024, we achieved a new world record CdTe research cell conversion efficiency of 23.1%, which was certified by the U.S. Department of Energy’s National Renewable Energy Laboratory.\nIn July 2024, our dedicated R&D innovation center in Ohio was formally commissioned. This R&D facility features a high-volume manufacturing scale production pilot line, which is expected to enable the production of full-sized prototypes of thin film and tandem PV modules, supporting the implementation of our technology roadmap.\nIn December 2024, we entered into two agreements with Visa Inc. (“Visa”) for the sale of $857.2 million of Section 45X tax credits we generated during 2024 for aggregate cash proceeds of $818.6 million and received initial cash proceeds of $616.0 million. We expect to receive the remaining cash proceeds during the first quarter of 2025.\nSolar energy is one of the fastest growing forms of renewable energy with numerous benefits, including economic and speed of deployment, that make it an attractive complement to or substitute for traditional forms of energy generation. In recent years, the cost of producing electricity from PV solar power systems has decreased to levels that are competitive with or below the wholesale price of electricity in many markets. Other technological developments in the renewable energy industry, such as the advancement of energy storage capabilities, have further enhanced the prospects of solar energy as an alternative to traditional forms of energy generation. As a result of these and other factors, worldwide solar markets continue to develop and expand. Government incentive programs, such as the IRA discussed previously, have contributed to this momentum by providing solar module manufacturers, project developers, and project owners with various incentives to accelerate the deployment of solar power generation. For more information about these incentive programs, see Item 1. “Business – Incentive Programs.”\nAs a result of the market opportunities described above, we recently commenced production of Series 7 modules at our first manufacturing facility in Alabama and are in the process of expanding our manufacturing capacity, including the construction of our fifth U.S. manufacturing facility, which is expected to commence operations in the second half of 2025. We continue to evaluate opportunities for future expansion worldwide. We believe manufacturers of solar cells and modules, particularly those in China, have significant installed production capacity, relative to global demand, and the ability for additional capacity expansion. Accordingly, we believe the solar industry may experience periods of structural imbalance between supply and demand, which could lead to periods of pricing volatility. Further, demand for solar energy in key markets, such as the United States and India, may be affected by the nature and extent of commitments to the renewable energy transition at the local and global levels. For example, certain large oil and gas and energy companies have experienced investor pressure to pursue returns commensurate with those currently associated with fossil fuel projects, where returns have become easier as fossil fuel prices have rebounded since the COVID-19 pandemic. Notwithstanding these considerations, utility and corporate demand for clean energy, and overall electric load growth, especially as a result of AI-driven data center demand, continue to increase. Internationally, given the\ncombination of (i) a European Union market captured by Chinese solar modules, which pricing is at levels near or below manufacturing costs, (ii) an India market effectively closed to Southeast Asian finished goods, (iii) the uncertain U.S. policy environment following the 2024 U.S. elections, and (iv) a supply and demand imbalance for Southeast Asian product, we have decided to reduce production output of our Series 6 modules at our manufacturing facilities in Malaysia and Vietnam by a combined total of 1 GW in 2025. In light of such market realities, we continue to advocate for industrial and trade policies that provide a level playing field for domestic manufacturers of solar cells and modules. We also continue to focus on our strategies and points of differentiation, which include our advanced module technology, our manufacturing process and distributed manufacturing presence, our R&D capabilities, our commitment to responsible solar, and our financial stability.\nPricing Competition.\nThe solar industry has been characterized by intense pricing competition, both at the module and system levels. This competition may result in an environment in which pricing falls rapidly, which could potentially increase demand for solar energy solutions but constrain the ability for module manufacturers and project developers to sustain meaningful and consistent profitability. Our results of operations could be adversely affected if competitors reduce pricing below their costs, bid aggressively low prices for module sale agreements, or are able to operate at minimal or negative operating margins for sustained periods of time. For certain of our competitors, including many in China, these practices may be enabled by their direct or indirect access to sovereign capital or other forms of state support. Although module average selling prices in many global markets continue to decline, recent module pricing in the United States, our primary market, has been relatively stable due, in part, to the demand for domestically manufactured modules as a result of the IRA.\nWe face intense competition from manufacturers of crystalline silicon solar modules and other emerging technologies. Solar module manufacturers compete with one another on sales price per watt, which may be influenced by several module value attributes, including energy yield, wattage (through a larger form factor or an improved conversion efficiency), degradation, sustainability, and reliability. Sales price per watt may also be influenced by warranty terms, customer payment terms, and/or module content attributes. We believe that utility-scale solar will continue to be a compelling offering and will continue to represent an increasing portion of the overall electricity generation mix. However, this focus on utility-scale module offerings exists within a current market environment that includes rooftop and distributed generation solar, which may influence our future offerings.\nWe continue to devote significant resources to support the implementation of our technology roadmap and improve the energy output of our modules. In the course of our R&D activities, we explore various technologies in our efforts to sustain competitive differentiation of our modules. Such technologies include the development of bifacial modules, the implementation of our CuRe program, and ongoing research and development of multi-junction solar modules.\nWhile conventional solar modules are monofacial, meaning their ability to produce energy is a function of direct and diffuse irradiance on their front side, most module manufacturers offer bifacial modules that also capture diffuse irradiance on the back side of a module. Bifaciality compromises nameplate efficiency, but by converting both front and rear side irradiance, such technology may improve the overall energy production of a module relative to nameplate efficiency when applied in certain applications, which could lower the overall LCOE of a system when compared to systems using monofacial solar modules. We recently began commercial production of bifacial solar modules at certain of our manufacturing facilities and delivered our first bifacial modules to customers. Our bifacial module features an innovative transparent back contact which, in addition to converting both front and rear side irradiance, allows infrared light to pass through rather than be absorbed as heat. This design lowers the operational temperature of the module, resulting in a higher energy yield.\n. Our CuRe program is intended to improve our current semiconductor structure by replacing copper with certain other elements that are expected to enhance module performance by improving its bifaciality characteristics, improving its temperature coefficient, and improving its warranted degradation. As a result of these performance improvements, our PV solar modules are expected to produce more energy in real-\nworld operating conditions over their estimated useful lives than crystalline silicon modules with the same nameplate capacity. In May 2024, we achieved a new world record CdTe research cell conversion efficiency of 23.1%, which was based on our CuRe program and certified by the U.S. Department of Energy’s National Renewable Energy Laboratory. We commenced a limited commercial production run of modules employing our CuRe technology in late 2024 and intend to begin a phased replication of the technology across our fleet in the first quarter of 2026.\n. We continue to evaluate opportunities to develop and leverage other solar cell technologies in multi-junction applications that combine our thin film PV technology with another high efficiency PV semiconductor, with each layer optimized for a different range of the solar spectrum. We believe such applications, which are expected to utilize at least one thin-film semiconductor, have the potential to significantly increase the efficiency of PV modules beyond the limits of traditional single-junction devices. Our acquisition of Evolar is expected to accelerate the development of high efficiency multi-junction devices by integrating Evolar’s expertise with First Solar’s existing R&D capabilities.\nProduct Efficiencies.\nThe efficiencies gained from the vertical integration of our manufacturing model and our cost management initiatives allow us to compete favorably in markets where pricing for modules and systems is highly competitive. Our cost competitiveness is based in large part on our advanced thin film semiconductor technology, module wattage, proprietary manufacturing process (which enables us to produce a CdTe module in a matter of hours using a continuous and highly automated industrial manufacturing process, as opposed to a batch process), and focus on operational excellence. In addition, our CdTe modules use approximately 2% to 3% of the amount of semiconductor material that is used to manufacture conventional crystalline silicon solar modules. The cost of polysilicon is a significant driver of the manufacturing cost of crystalline silicon solar modules, and the timing and rate of change in the cost of silicon feedstock and polysilicon could lead to changes in solar module pricing levels.\nIn many climates our solar modules provide certain energy production advantages relative to competing crystalline silicon solar modules. As a result, our solar modules can produce more annual energy in real-world operating conditions than conventional crystalline silicon modules with the same nameplate capacity. For more information about these advantages, see\nItem 1. “Business – Business Strategy.”\nAdditionally, we warrant that our solar modules will produce at least 98% of their labeled power output rating during the first year, with the warranty coverage reducing by a degradation factor that is generally between 0.3% and 0.5%, depending on the module series, every year thereafter throughout the limited power output warranty period of up to\nWhile our modules are generally competitive in cost, reliability, and performance attributes, there can be no guarantee such competitiveness will continue to exist in the future to the same extent or at all. Any declines in the competitiveness of our products could result in further declines in the average selling prices of our modules and additional margin compression. Accordingly, we continue to focus on enhancing the competitiveness of our solar modules through our module technology and cost reduction roadmaps.\nCertain Trends and Uncertainties\nOur business is evolving worldwide and is shaped by the varying ways in which our offerings can be compelling and economically viable solutions to energy needs in various markets. In addressing electricity demands, we are focused on providing utility-scale module offerings in key geographic markets that we believe have a significant need for mass-scale PV solar electricity, including markets throughout the United States and India. We closely evaluate and monitor the appropriate level of resources required to support such markets and their associated sales opportunities. When deployed in utility-scale applications, our modules provide energy at a lower LCOE compared to traditional forms of energy generation, making them an attractive alternative to or replacement for aging fossil fuel-based\ngeneration resources. Accordingly, future retirements of aging energy generation resources represent a significant increase in the potential market for solar energy.\nDemand for our PV solar module offerings depends, in part, on market factors outside our control. For example, many governments have proposed or enacted policies or incentive programs intended to encourage renewable energy investments to achieve decarbonization objectives and/or establish greater energy independence. While we compete in markets that do not require solar-specific government subsidies or incentive programs, our net sales and profits remain subject to variability based on the availability and size of government subsidies and economic incentives. Adverse changes in these factors could increase the cost of utility-scale systems, which could reduce demand for our solar modules. Recent developments to government incentive programs include the following:\nIn August 2022, the previous U.S. President signed the IRA into law, which was intended to accelerate the country’s energy transition. Among other things, the financial incentives provided by the IRA have significantly increased demand for modules manufactured in the United States. Accordingly, the demand for these solar modules is expected to increase domestic manufacturing in the near term, which may result in localized supply chain constraints and periods of inflationary pricing for certain of our key raw materials. The financial incentives provided by the IRA have also increased demand for solar modules in general due to the incremental tax credit available for the qualified production of clean hydrogen that is powered by renewable resources. Given the complexities of the IRA, we continue to evaluate the extent of benefits available to us, which we expect will favorably impact our results of operations in future periods. For example, we currently expect to qualify for the advanced manufacturing production credit under Section 45X of the IRC, which provides certain specified benefits for solar modules and solar module components manufactured in the United States and sold to third parties. See Note 9. “Government Grants” and\n\nNote 18. “Income Taxes” to our consolidated financial statements for discussion of our expectation of the financial benefits available to us under the IRA and developments to technical guidance and regulations, respectively. Also, the new presidential administration and control of the U.S. Congress present uncertainty as to the continued availability of such benefits. For example, on January 20, 2025, the U.S. President issued the executive order entitled, “Unleashing American Energy,” which, among other things, indicated a lack of support for federal funding of certain solar and solar-related projects. For more information about certain risks associated with the benefits available to us under the IRA, see Item 1A. “Risk Factors – We have received and expect to continue to receive certain financial benefits as a result of tax incentives provided by the Inflation Reduction Act of 2022. If these financial benefits vary significantly from ou",
  "item2_clean": null
}