{
  "source_file": "ftv-20241231.htm",
  "form_type": "10-K",
  "item1_clean": "We own numerous patents, trademarks, copyrights, and trade secrets and hold licenses to use intellectual property owned by others. Although in aggregate our intellectual property is important to our operations, we do not consider any single patent, trademark, copyright, trade secret, or license to be of material importance to any segment or to the business as a whole. From time to time, we engage in litigation to protect our intellectual property rights. For a discussion of risks related to our intellectual property, please refer to “Item 1A. Risk Factors.” All capitalized brands and product names throughout this document are trademarks owned by, or licensed to, Fortive.\nWe believe that we are a leader in many of our served markets. Although our businesses generally operate in highly competitive markets, our competitive position cannot be determined accurately in the aggregate or by segment, since none of our competitors offer all of the same product and service lines or serve all of the same markets as we do. Because of the range of the products and services we sell and the variety of markets we serve, we encounter a wide variety of competitors, including larger companies or divisions of larger companies with substantial sales, marketing, research, and financial capabilities, as well as well-established regional competitors who are more specialized than we are in particular markets. We face increased competition in a number of our served markets as a result of the entry of competitors based in low-cost manufacturing locations, and increasing consolidation in particular markets. The number of competitors varies by product and service line. Our management believes that we have a market leadership position in most of the markets we serve. Key competitive factors vary among our businesses and product and service lines, but include the specific factors noted above with respect to each particular business and typically also include price, quality, performance, delivery speed, applications expertise, distribution channel access, service and support, technology and innovation, breadth of product, service and software offerings, and brand name recognition. For a discussion of risks related to competition, please refer to “Item 1A. Risk Factors.”\nSeasonal Nature of Business\nGeneral economic conditions impact our business and financial results, and certain of our businesses experience seasonal and other trends related to the industries and end markets that they serve. For example, sales of capital equipment and sterilization consumables are often stronger in the fourth calendar quarter and sales to OEMs are often stronger immediately preceding and following the launch of new products. However, as a whole, we are not subject to material seasonality.\nHuman Capital Management\nFortive is a global team, over 18,000 strong, energized by a powerful purpose. Our people strategy centers on empowering inclusive teams working together to solve problems no one could solve alone. We intentionally seek out different skills, backgrounds, and voices to deliver results for our customers and fulfill our employee promise – For you. For us. For growth. Our people strategy is defined by this inclusive growth culture and is advanced through FBS and our career development and reward systems. We continually measure, review, and refine our people strategy through measured employee experience processes. These key elements enable us to accelerate progress for our customers, our teams, and the world.\nInclusive Growth Culture\nWe are more together. Our inclusive growth culture sets the tone for Fortive’s people strategy and drives Fortive’s success.\nWe know that a workforce empowered by inclusivity, continuous improvement, and FBS creates extraordinary long-term value for our customers, people and shareholders. We are focused on cultivating an inclusive workplace where everyone can contribute to their fullest potential, attracting and retaining top talent from a wide variety of candidate sources, and sustaining policies and practices to ensure that no group is inadvertently disadvantaged. Fortive is committed to adhering to EEO (equal employment opportunity) principles. All people are evaluated through a neutral merit-based process. We do not consider race, ethnicity, gender, or any other protected trait in our hiring, promotional, or other processes.\nOur Board of Directors, along with the Compensation Committee, also oversee our inclusive growth culture practices as an integral part of our people strategy and measurement actions.\nWe are committed to continued transparency by publicly sharing our workforce representation and inclusion results through our website (where we provide our EEO-1 report), and our annual Sustainability Report.\nBusiness, Career Development, and Reward Systems\nOur culture of continuous improvement inspires us to keep experimenting, growing, and learning. Our career development and reward systems advance our people strategy by attracting, growing, and retaining the exceptional people we need now and in the future. These business and career development systems strengthen our ability to deliver our employee value proposition, build our employer brand, drive professional growth for our people and results for our customers.\nOur Performance and Development processes drive results and career growth for our global teams. Performance for Growth rigorously deploys our strategies into cascaded goals throughout the organization, while Development for Growth translates our beliefs and values into desired leader competencies, at all levels of the organization. Together, these provide a roadmap for the way we work, deliver results, and build high-performing teams.\nAdditionally, we design our Total Rewards programs to attract and retain talented, curious people with a growth mindset and a passion for innovation, collaboration, and continuous improvement. We offer leading programs that inspire and reward superior performance, are equitable, and foster an inclusive, diverse, and healthy global workforce.\nWe also invest in our people at every level through our growth and development experiences. These experiences range from leadership learning and FBS immersion to hands-on skill building in each of our three FBS pillars—growth, lean, and leadership. Collectively, these experiences build skills, strengthen performance, and prepare our people for challenging opportunities and outsized impact.\nWith our strong and evolving portfolio, our people have the opportunity to accelerate their career across multiple industries, meaningfully contributing to customer success and impact in the world.\nEmployee Experience and Feedback\nOur promise to employees is ‒ For you. For us. For growth. To achieve this promise, our leaders at all levels of the organization actively seek feedback with quarterly touchpoints to strengthen our inclusive growth culture.\nIn our last comprehensive census survey in Q4 2024, over 85% of our global team responded, delivering continued strength in overall engagement and inclusion and belonging at high ratings of 76% and 84%, respectively. Our results continue to inform both management and our Board of Directors on appropriate actions to enhance our culture and overall employee experience.\nGovernment Contracts\nAlthough the majority of our revenue in 2024 was from customers other than governmental entities, each of our segments has agreements relating to the sale of products and services to government entities. As a result, we are subject to various statutes and regulations that apply to companies doing business with governments and government-owned entities. For a discussion of risks related to government contracting requirements, please refer to “Item 1A. Risk Factors.”\nWe face extensive government regulation both within and outside the United States relating to the development, manufacture, marketing, sale, and distribution of our products, software, and services. The following sections describe certain significant regulations that we are subject to. These are not the only regulations that our businesses must comply with. For a description of the risks related to the regulations that our businesses are subject to, please refer to “Item 1A. Risk Factors.”\nMedical Device Regulations\nMany of our products in the Advanced Healthcare Solutions segment are classified as medical devices and are subject to restrictions under domestic and foreign laws, rules, regulations, self-regulatory codes, circulars, and orders, including, but not limited to, the U.S. Food, Drug, and Cosmetic Act (the “FDCA”). The FDCA requires these products, when sold in the United States, to be safe and effective for their intended uses and to comply with the regulations administered by the U.S. Food and Drug Administration (“FDA”). The FDA regulates the design, development, research, preclinical and clinical testing, introduction, manufacture, advertising, labeling, packaging, marketing, distribution, import and export, and record keeping for such products.\nMedical devices can be marketed only for the indications for which they are cleared or approved. After a device has received 510(k) clearance for a specific intended use, any change or modification that significantly affects its safety or effectiveness, such as a significant change in the design, materials, method of manufacture, or intended use, may require a new 510(k) clearance and payment of an FDA user fee.\nMarket access, sales, and marketing of medical devices in non-U.S. countries are subject to foreign regulatory requirements that vary widely from country to country. For example in the European Economic Area (“EEA”), a medical device must meet the Medical Devices Directive’s (“MDD”) Essential Requirements or, for new devices placed on the market after May 26, 2021, the Medical Devices Regulation’s (“MDR”) General Safety and Performance Requirements as well as other requirements set out in the MDD/MDR, depending on the device’s risk class. Before placing a medical device on the EEA market, the manufacturer must prepare a declaration of conformity, certifying that the device complies with the MDD/MDR, and must then affix the CE mark. The notified body typically audits and examines the device’s technical documentation, and the quality system for the manufacture, design, and final inspection of the relevant device before issuing a CE certificate. Following the issuance of this CE certificate, manufacturers may prepare the declaration of conformity and affix the CE mark to the devices covered by this CE certificate. Similar requirements apply in the UK. For access to the UK market, manufacturers must obtain a UKCA Certificate and affix a UKCA mark to their medical devices.\nAny medical devices we manufacture and distribute are subject to pervasive and continuing regulation by the FDA and certain state and certain other comparable foreign authorities. As a medical device manufacturer, our manufacturing facilities are subject to inspection on a routine basis by the FDA and other comparable foreign authorities as well as audits by our notified body. We are required to adhere to the Current Good Manufacturing Practices requirements, as set forth in the Quality Systems Regulation, as well as other applicable standards which require manufacturers, including third-party manufacturers, to follow stringent design, testing, control, documentation, and other quality assurance procedures during all phases of the design and manufacturing process.\nWe must also comply with global post-market surveillance regulations, including adverse event reporting requirements, which require that we review and report to the FDA and other comparable foreign authorities any incident in which our products may have caused or contributed to a death or serious injury. We must also report any incident in which our product has malfunctioned if that malfunction would likely cause or contribute to a death or s",
  "item7_clean": "Year Ended December 31,\nNet cash provided by operating activities\nCash paid for acquisitions, net of cash received\nPurchases of property, plant and equipment\nProceeds from sale of property\nCash infusion into divestiture\nAll other investing activities\nNet cash used in investing activities\nNet proceeds from (repayments of) commercial paper borrowings\nProceeds from borrowings (maturities longer than 90 days), net of issuance costs\nRepayment of borrowings (maturities greater than 90 days)\nRepurchase of common shares\nPayment of dividends\nAll other financing activities\nNet cash provided by (used in) financing activities\nOperating Activities\nCash flows from operating activities can fluctuate significantly from period-to-period as working capital needs and the timing of payments for income taxes, interest, pension funding, and other items impact reported cash flows.\nOperating cash flows were $1.5 billion in 2024, representing an increase of $173 million, or 12.8%, as compared to 2023, primarily attributable to the following factors:\nYear-over-year increases of $35 million in Operating cash flow from net earnings, net of non-cash items (Amortization, Depreciation, Stock-based compensation, Gain on sale of property, Loss from divestiture, and Loss from equity investments).\nThe aggregate changes in accounts receivable, inventories, and trade accounts payable generated $79 million of cash during 2024 compared to using $9 million of cash during 2023. The amount of cash flow generated from or used by the aggregate of accounts receivable, inventories, and trade accounts payable depends upon how effectively we manage the cash conversion cycle, which generally represents the number of days that elapse from the day we pay for the purchase of raw materials and components to the collection of cash from our customers, and can be significantly impacted by the timing of collections and payments in a period.\nThe aggregate change in prepaid expenses and other assets, accrued expenses and other liabilities, and changes in deferred income taxes used $40 million of cash in 2024 as compared to using $91 million in 2023. The year-over-year changes were driven by timing differences related to contract assets, contract liabilities, and payments of income taxes, interest, and restructuring.\nInvesting Activities\nCash outflows from investing activities increased by $1.6 billion in 2024 as compared to 2023 with the increase primarily due to a year-over year increase in cash used for acquisitions, net of cash acquired, of approximately $1.6 billion, an increase in capital expenditures of approximately $13 million, and the cash infusion into the Invetech Divestiture entity totaling $14 million, partially offset by the year-over-year increase in proceeds from sale of property and business of approximately $54 million.\nCapital expenditures are made primarily for increasing production capacity, replacing aged equipment, supporting product development initiatives for hardware and software offerings, improving information technology systems, and purchasing equipment that is used in revenue arrangements with customers. We expect capital spending to be between approximately $120 million and $150 million in 2025, though actual expenditures will ultimately depend on business conditions.\nFinancing Activities and Indebtedness\nFinancing cash flows consist primarily of cash flows associated with the issuance and repayments of debt and commercial paper, payments of cash dividends to shareholders and share repurchases. Financing activities used cash of $793 million in 2024, and generated cash of $32 million in 2023.\nFinancing activities during 2024 reflected the following transactions:\nOn January 2, 2024, we drew down an additional $450 million of the Delayed-Draw Term Loan due 2024 as part of the funding for the acquisition of EA.\nOn February 13, 2024, we completed the sale of our registered offering of the 2026 Notes and the 2029 Notes, yielding net proceeds of approximately $1.3 billion.\nOn February 13 2024, we repaid $1.0 billion in outstanding principal of the Delayed-Draw Term Loan due 2024, using net proceeds from the 2026 Notes and 2029 Notes.\nWe repaid $597 million in net commercial paper repayments under the U.S. dollar-denominated commercial paper program.\nWe repurchased 12 million shares of our common stock for approximately $890 million, including excise tax payments, under our share repurchase program.\nWe made dividend payments to common shareholders totaling $111 million.\nAll other financing activities primarily include activities related to the stock incentive plan.\nFinancing activities during 2023 reflected the following transactions:\nOn December 7, 2023, we entered into a term loan credit agreement, which provides for a 364-days delayed draw term loan facility up to an aggregate principal amount of $1.3 billion. On December 14, 2023, we drew down $550 million of the $1.3 billion delayed-draw senior unsecured term facility (“Delayed-Draw Term Loan due 2024”) as a Term Secured Overnight Financing Rate (“Term SOFR”) Loan. The repayment of the principal is due on December 12, 2024.\nWe borrowed $840 million in net commercial paper under the U.S. dollar-denominated commercial paper program.\nOn August 24, 2023, we repaid $250 million in outstanding principal of the Delayed-Draw Term Loan due 2023. On December 14, 2023, we repaid the remaining $750 million in outstanding principal and accrued interest thereon using the proceeds from the Delayed-Draw Term Loan due 2024 and available cash.\nWe repurchased 4 million shares of our common stock for approximately $273 million under our share repurchase program.\nDividend payments to common shareholders totaling $102 million.\nWe generally expect to satisfy any short-term liquidity needs that are not met through operating cash flows and available cash primarily through term loans or issuances of commercial paper under the Commercial Paper Programs, with credit support provided by the Revolving Credit Facility.\nThe carrying value of total debt outstanding as of December 31, 2024 was approximately $3.7 billion. We had $2.0 billion available under the Revolving Credit Facility as of December 31, 2024.\nThe availability of the Revolving Credit Facility as a standby liquidity facility to repay maturing commercial paper is an important factor in maintaining the existing credit ratings of the Commercial Paper Programs when we have outstanding borrowings. As of December 31, 2024 and 2023, we had $650 million and $1.3 billion borrowings outstanding under our Commercial Paper Program, respectively. We expect to limit any future borrowings under the Revolving Credit Facility to amounts that would leave sufficient credit available under the facility to allow us to borrow, if needed, to repay any outstanding commercial paper as it matures.\nRefer to Note 9 to the consolidated financial statements for additional information regarding the Company’s financing activities and indebtedness, including the Company’s outstanding debt as of December 31, 2024, the Company’s commercial paper program, and the Revolving Credit Facility. Refer to Note 15 to the consolidated financial statements for a description of the Company’s share repurchase program.\nOn November 6, 2024, we declared a regular quarterly dividend of $0.08 per common share paid on December 27, 2024 to holders of record on November 29, 2024.\nCash and Cash Requirements\nAs of December 31, 2024, we held approximately $813 million of cash and cash equivalents, of which approximately 88% was held outside of the United States. Our cash and cash equivalents were invested in highly liquid investment-grade instruments with a maturity of 90 days or less.\nWe have cash requirements to support working capital needs, capital expenditures and acquisitions, pay interest and service debt, pay taxes and any related interest or penalties, fund our pension plans as required, pay dividends to shareholders, and support other business needs or objectives. With respect to our cash requirements, we generally intend to use available cash and internally generated funds to meet these cash requirements, but in the event that additional liquidity is required, particularly in connection with acquisitions and repayment of maturing debt, we may also borrow under our commercial paper programs or credit facilities or enter into new credit facilities and either borrow directly thereunder or use such credit facilities to backstop additional borrowing capacity under our commercial paper programs. We also may from time to time access the capital markets, including to take advantage of favorable interest rate environments or other market conditions.\nForeign cumulative earnings remain subject to foreign remittance taxes. We have made an election regarding the amount of earnings that we do not intend to repatriate due to local working capital needs, local law restrictions, high foreign remittance costs, previous investments in physical assets and acquisitions, or future growth needs. For most of our foreign operations, we make an assertion regarding the amount of earnings in excess of intended repatriation that are expected to be held for indefinite reinvestment. No provisions for foreign remittance taxes have been made with respect to earnings that are planned to be reinvested indefinitely. The amount of foreign remittance taxes that may be applicable to such earnings is not readily determinable given local law restrictions that may apply to a portion of such earnings, unknown changes in foreign tax law that may occur during the applicable restriction periods caused by applicable local corporate law for cash repatriation, and the various tax planning alternatives we could employ if we repatriated these earnings.\nThe following table sets forth a summary of our short-term and long-term cash requirements as of December 31, 2024 under (1) long-term debt principal and interest obligations, (2) leases, (3) purchase obligations and (4) other long-term liabilities reflected on our balance sheet under GAAP. The table below does not reflect any such obligations, as the timing and amounts of any such payments are uncertain.\nDue within one year of December 31, 2024\nDue later than one year from December 31, 2024\nLong-term debt principal payments\nInterest payments on long-term debt\nOperating lease obligations\nPurchase obligations\nOther liabilities reflected on the balance sheet under GAAP\nThe amount due within one year of December 31, 2024 is related to the Euro Term Loan due 2025 and Yen Term Loan due 2025. Refer to Note 9 to the consolidated financial statements for additional information regarding the Company’s indebtedness as of December 31, 2024.\nInterest payments on long-term debt are projected for future periods using the interest rates in effect as of December 31, 2024. Certain of these projected interest payments may differ in the future based on changes in market interest rates.\nIncludes future lease payments for operating leases having initial noncancelable lease terms in excess of one year.\nConsist of agreements to purchase goods or services that are enforceable and legally binding on us and that specify all significant terms, including fixed or minimum quantities to be purchased, fixed, minimum or variable price provisions, and the approximate timing of the transaction.\nPrimarily consist of obligations under product service and warranty policies and allowances, performance and operating cost guarantees, estimated environmental remediation costs, self-insurance and litigation claims, post-retirement benefits, pension benefit obligations, net tax liabilities, and deferred compensation obligations. The timing of cash flows associated with these obligations is based upon management’s estimates over the terms of these arrangements and is largely based upon historical experience.\nIncludes non-contractual obligations of $173 million of noncurrent gross unrecognized tax benefits. However, the timing of these liabilities is uncertain, and therefore, they have been included in the “due later than one year from December 31, 2024” column. The amounts also include our obligation under the TCJA for the transition tax on cumulative foreign earnings and profits, which we expect to pay over eight years. Refer to Note 12 to the consolidated financial statements for additional information on unrecognized tax benefits.\nIn addition to the obligations noted above, we have issued guarantees, consisting primarily of outstanding standby letters of credit, bank guarantees, and performance and bid bonds, in connection with certain arrangements with vendors, customers, financing counterparties, and governmental entities to secure our obligations and/or performance requirements related to specific transactions. These guarantees are not recorded on our balance sheet and $41 million in commitments expire within one year of December 31, 2024 and $20 million later than one year from December 31, 2024.\nDuring 2024, we contributed $1 million and $8 million to our U.S. and non-U.S. defined benefit pension plans, respectively. During 2025, our cash contribution requirements for our U.S. and non-U.S. defined benefit pension plans are expected to be approximately $1 million and $8 million, respectively. The ultimate amounts we will contribute depend upon, among other things, legal requirements, underlying asset returns, the plan’s funded status, the anticipated tax deductibility of the contribution, local practices, market conditions, interest rates, and other factors.\nAs of December 31, 2024 we expect to have sufficient liquidity to satisfy our cash needs for the foreseeable future.\nCRITICAL ACCOUNTING ESTIMATES\nManagement’s discussion and analysis of our financial condition and results of operations is based upon our consolidated financial statements, which have been prepared in accordance with GAAP. The preparation of these financial statements requires management to make estimates and judgments that affect the reported amounts of assets, liabilities, revenues and expenses, and related disclosure of contingent assets and liabilities. We base these estimates and judgments on historical\nexperience, the current economic environment, and on various other assumptions that are believed to be reasonable under the circumstances. Actual results may differ materially from these estimates and judgments.\nWe believe the following accounting estimates are most critical to an understanding of our financial statements. Estimates are considered to be critical if they meet both of the following criteria: (1) the estimate requires assumptions about material matters that are uncertain at the time the estimate is made, and (2) material changes in the estimate are reasonably likely from period to period. For a detailed discussion on the application of these and other accounting estimates, refer to Note 2 to the consolidated financial statements.\nAcquired Intangibles and Goodwill\n: Our business acquisitions, including EA, typically result in the recognition of goodwill, developed technology, and other intangible assets, which affect the amount of future period amortization expense and possible impairment charges that we may incur. The fair value of acquired intangible assets are determined using information available near the acquisition date based on estimates and assumptions that are deemed reasonable by us. Significant assumptions include the discount rates and certain assumptions that form the basis of the forecasted cash flows of the acquired business including earnings before interest, taxes, depreciation and amortization (“EBITDA”), revenue, revenue growth rates, royalty rates, customer attrition rates, and technology obsolescence rates. These assumptions are forward looking and could be affected by future economic and market conditions. We engage third-party valuation specialists who review our critical assumptions and calculations of the fair val",
  "item2_clean": null
}