{
  "source_file": "ftv-20250926.htm",
  "form_type": "10-Q",
  "item1_clean": null,
  "item7_clean": null,
  "item2_clean": "ITEM 2. MANAGEMENT’S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS\nFortive Corporation (“Fortive,” the “Company,” “we,” “us,” or “our”) innovates essential technologies to keep the world safe and productive. Our strategic segments - Intelligent Operating Solutions (“IOS”) and Advanced Healthcare Solutions (“AHS”) - include iconic inventor brands with leading positions in their markets. Our businesses design, develop, manufacture, and market products, software, and services, building upon leading brand names, innovative technologies, and strong market positions. Our research and development, manufacturing, sales, distribution, service, and administrative facilities are located in approximately 50 countries around the world.\nPrecision Technologies Separation\nOn June 28, 2025 (the “Distribution Date”), the Company completed the separation (the “Separation” or the “PT Separation”) of its former Precision Technologies segment by distributing to Fortive shareholders on a pro rata basis all of the issued and outstanding common stock of Ralliant Corporation (“Ralliant”), the entity incorporated to hold the PT businesses. The accounting requirements for reporting Ralliant as a discontinued operation were met when the Separation was completed. Accordingly, the accompanying consolidated condensed financial statements for all periods presented reflect this business as a discontinued operation. Unless otherwise indicated, all references in this report refer to continuing operations. Refer to Note 2 of the consolidated condensed financial statements for additional information.\nInformation Relating to Forward-Looking Statements\nResults of Operations\nLiquidity and Capital Resources\nCritical Accounting Estimates\nINFORMATION RELATING TO FORWARD-LOOKING STATEMENTS\nForward-looking statements are based on assumptions and assessments made by our management in light of their experience and perceptions of historical trends, current conditions, expected future developments, and other factors they believe to be appropriate. Forward-looking statements are not guarantees of future performance and actual results may differ materially from the results, developments and business decisions contemplated by our forward-looking statements. Accordingly, you should not\nplace undue reliance on any such forward-looking statements. Important factors that could cause actual results to differ materially from those envisaged in the forward-looking statements include, among others, the following:\nRisk Related to Our Business Operations\nConditions in the global economy, the markets we serve, and the financial markets may adversely affect our business and financial results.\nIf we cannot adjust our manufacturing capacity, supply chain management or the purchases required for our manufacturing activities to reflect changes in market conditions, international trade policies, customer demand, prolonged government shutdown, and supply chain disruptions, our profitability may suffer. In addition, our reliance upon sole or limited sources of supply for certain materials, components, and services could cause production interruptions, delays and inefficiencies.\nOur financial results are subject to fluctuations in the cost and availability of commodities or components that we use in our operations.\nOur growth could suffer if the markets into which we sell our products and services decline, do not grow as anticipated, or experience cyclicality.\nWe face intense competition and if we are unable to compete effectively, we may experience decreased demand and decreased market share. Even if we compete effectively, we may be required to reduce prices for our products and services.\nOur growth depends in part on the timely development and commercialization and customer acceptance of new and enhanced products and services based on technological innovation.\nOur ability to attract, develop, and retain senior leaders and other key employees is critical to our success.\nDisruptions in, or breaches in security of, our information technology systems have adversely affected, and in the future could adversely affect, our business.\nDefects and unanticipated use or inadequate disclosure with respect to our products (including software) or services could adversely affect our business, reputation, and financial results.\nAdverse changes in our relationships with, or the financial condition, performance, purchasing patterns, or inventory levels of, key distributors and other channel partners could adversely affect our financial results.\nOur restructuring activities could have long-term adverse effects on our business.\nWork stoppages, works council campaigns, and other labor disputes could adversely impact our productivity and results of operations.\nIf we suffer loss to our facilities, supply chains, distribution systems, or information technology systems due to catastrophe or other events, our operations could be seriously harmed.\nIf we do not or cannot adequately protect our intellectual property, or if third parties infringe our intellectual property rights, we may suffer competitive injury or expend significant resources enforcing our rights.\nThird parties may claim that we are infringing or misappropriating their intellectual property rights and we could suffer significant litigation expenses, losses, or licensing expenses or be prevented from selling products or services.\nWe are subject to a variety of litigation and other legal and regulatory proceedings in the course of our business that could adversely affect our financial results.\nClimate change, or legal or regulatory measures to address climate change, may negatively affect us.\nWe use artificial intelligence in our business and in our products, and challenges with properly managing its use could result in reputational harm, competitive harm, and legal liability, and adversely affect our results of operations.\nRisk Related to our International Operations\nInternational economic, political, legal, trade policies, compliance, and business factors could negatively affect our financial results.\nTrade relations between the United States and other countries, including imposition of tariffs and related uncertainty thereof, and the impact on cost and demand resulting therefrom could continue to have a material adverse effect on our business and financial results.\nForeign currency exchange rates, including the volatility thereof, may adversely affect our financial results.\nRisk Related to Our Acquisitions, Investments, and Dispositions\nAny inability to consummate acquisitions at appropriate prices, and to make appropriate investments and capital allocation that support our long-term strategy, could negatively impact our growth rate and stock price.\nOur acquisition of businesses, investments, joint ventures, and other strategic relationships could negatively impact our financial results.\nThe indemnification provisions of acquisition agreements by which we have acquired companies may not fully protect us and as a result we may face unexpected liabilities.\nDivestitures or other dispositions could negatively impact our business, and contingent liabilities from businesses that we have sold could adversely affect our financial results.\nPotential indemnification liabilities to Ralliant Corporation (“Ralliant”) and Vontier Corporation (“Vontier”) pursuant to the respective separation agreements could materially and adversely affect our businesses, financial condition, results of operations, and cash flows.\nRisk Related to Regulatory and Compliance Matters\nChanges in industry standards and governmental regulations may reduce demand for our products or services or increase our expenses.\nOur reputation, ability to do business, and financial results may be impaired by improper conduct by any of our employees, agents, or business partners.\nOur operations, products, and services expose us to the risk of environmental, health, and safety liabilities, costs, and violations that could adversely affect our reputation and financial results.\nOur businesses are subject to extensive regulation, including healthcare regulations; failure to comply with those regulations could adversely affect our financial results and our business, including our reputation.\nRisk Related to Our Tax and Accounting Matters\nChanges in our effective tax rates or exposure to additional tax liabilities or assessments could affect our profitability. In addition, audits by tax authorities could result in additional tax payments for prior periods.\nWe could incur significant liability if our separation from Danaher, our separation of our Automation and Specialty business, our separation of Vontier, or our separation of Ralliant (collectively, the “Separation Transactions”) is determined to be a taxable transaction.\nChanges in U.S. GAAP could adversely affect our reported financial results and may require significant changes to our internal accounting systems and processes.\nWe may be required to recognize impairment charges for our goodwill and other intangible assets.\nRisk Related to Our Financing Activities\nWe have incurred a significant amount of debt, and our debt obligations, including the cost of such debt, will increase further if we incur additional debt and do not retire existing debt, our credit rating declines, or if the applicable interest rates rise.\nOVERVIEW\nFortive is a multinational business with global operations with approximately 44% of our sales derived from customers outside the United States in 2024. As a company with global operations, our businesses are affected by worldwide, regional, and industry-specific economic, trade policies, fiscal policies, regulatory, and political factors. Our geographic and industry diversity, as well as the range of products, software, and services we offer, typically help limit the impact of any one industry or the economy of any single country, except for the United States, on our operating results. Given the"
}