{
  "source_file": "gd-20241231.htm",
  "form_type": "10-K",
  "item1_clean": "ITEM 1.\nBUSINESS\n(Dollars in millions, unless otherwise noted)\nBUSINESS OVERVIEW\nGeneral Dynamics is a global aerospace and defense company that specializes in high-end design, engineering and manufacturing to deliver state-of-the-art solutions to our customers. We offer a broad portfolio of products and services in business aviation; ship construction and repair; land combat vehicles, weapons systems and munitions; and technology products and services. Our leadership positions in attractive business aviation and defense markets enable us to deliver superior and enduring shareholder returns.\nOur company consists of 10 business units, which are organized into four operating segments: Aerospace, Marine Systems, Combat Systems and Technologies. We refer to the latter three collectively as our defense segments. To optimize market focus, customer intimacy, agility and operating expertise, each business unit is responsible for the development and execution of its strategy and operating results. This structure allows for a lean corporate function, which sets the overall strategy and governance for the company and is responsible for allocating and deploying capital.\nOur business units seek to deliver superior operating results by building industry-leading franchises. To achieve this goal, we invest in advanced technologies, pursue a culture of continuous improvement, and strive to be the low-cost, high-quality provider in each of our markets. The result is long-term value creation measured by strong earnings and cash flow and an attractive return on capital.\nOver the past decade, we have invested to create, renew or expand our portfolio of products and services across our businesses. This includes product development investments in Aerospace to bring to market an all-new lineup of business jet aircraft, capital investments in Marine Systems to support significant growth in U.S. Navy ship and submarine construction plans over the next two decades, development of next-generation platforms and technologies to meet customers’ emerging requirements in Combat Systems, and strategic acquisitions to achieve critical mass and build out a complete spectrum of solutions for our Technologies customers. We expect to realize an attractive return from these investments in each of our segments, and we will continue to evaluate our capital deployment opportunities to deliver long-term growth and enduring value to our shareholders.\nFollowing is additional information on each of our operating segments. For a supplemental discussion of segment performance and backlog, see Management’s Discussion and Analysis of Financial Condition and Results of Operations in Item 7.\nAEROSPACE\nOur Aerospace segment is recognized as a leading producer of business jets and the standard bearer in new technology aircraft, aircraft repair, customer support and custom completion services. The segment consists of our Gulfstream and Jet Aviation business units. We have earned our reputation through:\nsuperior aircraft design, manufacturing excellence, quality, performance, safety and reliability;\ntechnologically advanced flight deck and cabin systems; and\nindustry-leading customer support.\nWe believe the key to long-term value creation in the business jet industry is steady investment in new aircraft models and technologies and in customer service capabilities. Since acquiring Gulfstream more than 20 years ago, we have made significant investments in research and development (R&D), state-of-the-art manufacturing facilities, and maintenance and support through a combination of product development efforts, capital expansion and Jet Aviation’s global support network. We are also the industry leader in the use of sustainable aviation fuel (SAF) and energy efficient engines.\nWe are committed to continual investment in R&D to create new aircraft that consistently broaden customer offerings while raising the bar for safety and performance. The result is the unprecedented development of an all-new lineup of the most technologically advanced business jet aircraft in the world. The Gulfstream family of aircraft offer industry-leading cabin, cockpit and safety technologies and the longest ranges at the fastest speeds in their respective classes.\nThe following represents Gulfstream’s current product line, along with the maximum range, maximum speed, cabin length (excluding baggage), and total number of city-pair speed records held for each aircraft:\nGulfstream’s in-service aircraft hold 405 city-pair speed records, more than any other business jet manufacturer, including the National Aeronautic Association’s polar and westbound around-the-world speed records.\nThe most recent addition to the in-service Gulfstream fleet is the ultra-long-range, ultra-large-cabin G700, which entered service following U.S. Federal Aviation Administration (FAA) certification in March 2024. It combines our most spacious cabin with our advanced Symmetry Flight Deck, the industry’s most technologically advanced flight deck, and the superior high-speed performance of all-new engines to create best-in-class capabilities.\nIn 2021, we introduced two new aircraft, the ultra-long-range, ultra-large-cabin G800 and the large-cabin G400, completing a nearly two decade effort to develop an all new family of Gulfstream aircraft.\nBoth aircraft feature our industry-leading high-speed range and efficiency, safety enhancements, and our advanced Symmetry Flight Deck. The G800 is Gulfstream’s longest-range aircraft, with an 8,000 nautical mile range at Mach 0.85. The G800 replaces the G650 and G650ER, which currently operate in 55 countries with more than 580 aircraft of this family in service. The G400 is a clean-sheet (i.e., all new) design developed in concert with the G500 and G600, thus expanding the commonality across the Gulfstream family of aircraft. The G400 will join a market segment in which Gulfstream has not participated for several decades. Both aircraft will enter service following FAA certification.\nThe G500 and G600 entered service in 2018 and 2019, respectively. These clean sheet aircraft replaced the G450 and G550 models, whose combined family has an installed base of more than 1,650 aircraft around the world. Our investment in the development of these aircraft included a new wing, new avionics, new fuselage and new ergonomically designed larger interiors, as well as systems and technologies to improve the manufacturing process and quality of the aircraft. As a result, the G500 and G600 are faster, more fuel efficient, and have greater cabin volume, reduced emissions, more range and improved flight controls compared with the aircraft they replaced. At year-end 2024, cumulative deliveries of the G500 and G600 aircraft totaled more than 300.\nOur disciplined and consistent approach to new product development has allowed us to introduce repeatedly first-to-market capabilities that set industry standards for safety, performance, quality, speed and comfort. Product enhancement and development efforts include initiatives in advanced avionics, composites, flight-control and vision systems, acoustics, and cabin technologies.\nGulfstream designs, develops and manufactures aircraft in Savannah, Georgia, including all large-cabin models. The mid-cabin G280 is assembled by a non-U.S. partner. All models are outfitted in Gulfstream’s and Jet Aviation’s facilities. As Gulfstream’s aircraft portfolio and customer base have grown and become increasingly global in reach over the years, we have invested in our facilities and operations around the world. At our Savannah campus, we added new purpose-built manufacturing facilities, increased aircraft service capacity, opened a customer-support distribution center and expanded our R&D capabilities.\nWe offer comprehensive support for the more than 3,000 Gulfstream aircraft in service around the world and operate an extensive network of factory-owned service centers. We continue to invest in these maintenance, repair and overhaul (MRO) facilities and inventory to accommodate fleet growth. We also operate a 24/7 year-round customer support center and offer on-call Gulfstream aircraft technicians ready to deploy around the world for customer service requirements under our Field and Airborne Support Team (FAST) rapid-response unit.\nIn addition to expanding the reach of Gulfstream’s aircraft maintenance network outside the United States, Jet Aviation provides a comprehensive suite of innovative aircraft services for aircraft owners and operators around the world. With approximately 50 locations throughout North America, Europe, the Middle East and the Asia-Pacific region, our offerings include maintenance, completion, aircraft management, charter, staffing and fixed-base operator (FBO) services.\nJet Aviation manages approximately 310 business aircraft globally on behalf of individuals and corporate owners. We operate a leading global FBO network of approximately 30 facilities on four continents and support all aircraft types with a full range of maintenance services, including 24/7 global aircraft-on-ground support. We also operate one of the world’s largest custom completion and refurbishment centers for both narrow- and wide-body aircraft and perform modifications, upgrades and lifecycle sustainment support for various government fleets. We continue to grow our global footprint through acquisitions, expansions and significant renovations in strategic business aviation markets most\nfrequented by these customers. In 2024, we acquired FBO operations in Milwaukee, Wisconsin, and broke ground on a new facility in Miami, Florida, at Opa Locka Executive Airport, expanding options in the Upper Midwest and on the East Coast for customers based in and traveling across these regions.\nThe following map displays the broad reach of our combined Gulfstream and Jet Aviation services network, including authorized service centers:\nThe Aerospace segment places a priority on sustainability throughout its manufacturing and service operations, producing aircraft that maximize fuel efficiency while offering customers options to reduce or eliminate their carbon footprints. Gulfstream and Jet Aviation have been at the forefront of the industry by adopting and expanding the availability of SAF, which achieves as much as an 80% reduction in carbon dioxide emissions per gallon over its lifecycle compared to petroleum-based jet fuel. Gulfstream’s service and test aircraft have flown more than two million nautical miles on SAF since 2016, and in 2019, Gulfstream became the first business jet manufacturer to make SAF available to customers. In November 2023, Gulfstream conducted the world’s first transatlantic flight using 100% SAF. Gulfstream also offers operators the ability to achieve carbon-neutral travel by facilitating the purchase of carbon-offset credits. In addition to actively expanding the availability of SAF at its FBO locations, Jet Aviation allows customers to purchase SAF at locations where it is not available through a book-and-claim system. Since 2019, Jet Aviation has uploaded more than 11 million gallons of blended SAF to its customers.\nRevenue for the Aerospace segment was 24% of our consolidated revenue in 2024, 20% in 2023 and 22% in 2022. Revenue by major products and services was as follows:\nYear Ended December 31\nAircraft manufacturing\nMARINE SYSTEMS\nOur Marine Systems segment is the leading designer and builder of nuclear-powered submarines and a leader in surface combatant and auxiliary ship design and construction for the U.S. Navy. We also provide maintenance, modernization and lifecycle support services for Navy ships and maintain the most sophisticated marine engineering expertise in the world to support future capabilities. Our ability to design, build and maintain our nation’s most technologically sophisticated warships is a critical element of the U.S. defense industrial base. In addition to Navy ships, we have designed and built o",
  "item7_clean": "ITEM 7.\nMANAGEMENT’S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS\n(Dollars in millions, except per-share amounts or unless otherwise noted)\nBUSINESS ENVIRONMENT\nGLOBAL EVENTS\nThe coronavirus (COVID-19) pandemic caused significant disruptions to national and global economies and government activities, including supply chain and staffing challenges. Additionally, in response to the Russian invasion of Ukraine, the United States and several other countries imposed economic and trade sanctions, export controls and other restrictions targeting Russia and Belarus. Lastly, the impact of the conflict in the Middle East continues to evolve. The disruptions caused by these events continue to impact global economies and businesses, including ours. The primary impact to our business is supply chain challenges, including availability of parts, quality escapes and inflationary pressures.\nIn our Aerospace segment, supply chain challenges paced our ability to ramp up production at the rate we like in response to strong customer demand for our aircraft, causing out-of-sequence manufacturing that increased costs and decreased operational efficiency. In addition, the conflict in the Middle East impacted the delivery schedule for our Israel-based supplier of mid-cabin aircraft. Within our defense segments, the COVID-19 pandemic resulted in supply chain challenges that continue to impact our Marine Systems segment. The Russia-Ukraine conflict and increased threat environment have created additional demand for certain of our products and services, particularly in our Combat Systems segment.\nAny longer-term impact of these global events to our business is currently unknown due to the uncertainty around duration and their broader impact. For additional information, see the Risk Factors in Part I, Item 1A.\nOUR MARKETS\nWith approximately 70% of our revenue from the U.S. government, government spending levels\nparticularly defense spending\ninfluence our financial performance. The Congress has not yet passed a defense appropriations bill for the government’s current fiscal year. However, the government has been operating under a continuing resolution (CR) that provides funding for some federal agencies through March 14, 2025. When the government operates under a CR, all programs of record are funded at the prior year’s appropriated levels until the current year appropriations bill is signed into law. Therefore, the U.S. Department of Defense (DoD) is prohibited from starting new programs or increasing funding on existing programs unless there is an exception for the program included in the CR. The current CR included exceptions allowing the DoD to obligate additional funds for two fiscal year 2024 and one fiscal year 2025 Virginia-class submarines, and for non-executive pay improvements and infrastructure\ninvestments to support the submarine industrial base. In addition, the CR included an exception allowing the DoD to obligate funds for the construction of the second submarine under the existing Columbia-class submarine contract. We do not anticipate the current CR having a material impact on our results of operations, financial condition or cash flows. However, the impact to our business from an extended CR or government shutdown that may result from any continuing delay by Congress to pass a new defense appropriations bill would depend on the duration and government implementation of the CR or shutdown.\nThe long-term outlook for our U.S. defense business is influenced by the U.S. military’s funding priorities, the diversity of our programs and customers, our insight into customer requirements stemming from our incumbency on core programs, our ability to evolve our products to address a fast-changing threat environment and our proven track record of successful contract execution.\nInternational demand for military equipment and technologies presents opportunities for our non-U.S. operations and exports from our North American businesses. While the revenue potential can be significant, there are risks to doing business in foreign countries, including changing budget priorities and overall spending pressures unique to each country.\nIn our Aerospace segment, we expect our investment in the development of new aircraft products and technologies to support the segment’s long-term growth. Similarly, we believe our aircraft services business will be a source of steady revenue growth as the global business jet fleet continues to grow.\nRESULTS OF OPERATIONS\nINTRODUCTION\nThe following paragraphs explain how we recognize revenue and operating costs in our operating segments and the terminology we use to describe our operating results.\nIn the Aerospace segment, we record revenue on contracts for new aircraft when the customer obtains control of the asset, which is generally upon delivery and acceptance by the customer of the fully outfitted aircraft. Revenue associated with the segment’s services businesses is recognized as work progresses or upon delivery of services. Fluctuations in revenue from period to period result from the number and mix of new aircraft deliveries, and the level and type of aircraft services performed during the period.\nThe majority of the Aerospace segment’s operating costs relates to new aircraft production on firm orders and consists of labor, material, subcontractor and overhead costs. The costs are accumulated in production lots, recorded in inventory and recognized as operating costs at aircraft delivery based on the estimated average unit cost in a production lot. While changes in the estimated average unit cost for a production lot impact the level of operating costs, the amount of operating costs reported in a given period is based largely on the number and type of aircraft delivered. Operating costs in the Aerospace segment’s services businesses are recognized generally as incurred.\nFor new aircraft, operating earnings and margin are a function of the prices of our aircraft, our operational efficiency in manufacturing and outfitting the aircraft, and the mix of ultra-large-cabin, large-cabin and mid-cabin aircraft deliveries. Aircraft mix can also refer to the stage of program maturity for our aircraft models. A new aircraft model typically has lower margins in its initial production lots, and then margins generally increase as we realize efficiencies in the production process. Additional factors affecting the segment’s earnings and margin include the volume, mix and profitability\nof services work performed, the market for pre-owned aircraft, and the level of general and administrative (G&A) and net research and development (R&D) costs incurred by the segment.\nIn the defense segments, revenue on long-term government contracts is recognized generally over time as the work progresses, either as products are produced or as services are rendered. Typically, revenue is recognized over time using costs incurred to date relative to total estimated costs at completion to measure progress toward satisfying our performance obligations. Incurred costs represent work performed, which corresponds with, and thereby best depicts, the transfer of control to the customer. Contract costs include labor, material, overhead and, when appropriate, G&A expenses. Variances in costs recognized from period to period reflect primarily increases and decreases in production or activity levels on individual contracts. Because costs are used as a measure of progress, year-over-year variances in costs result in corresponding variances in revenue, which we generally refer to as volume.\nOperating earnings and margin in the defense segments are driven by changes in volume, performance or contract mix. Performance refers to changes in profitability based on adjustments to estimates at completion on individual contracts. These adjustments result from increases or decreases to the estimated value of the contract, the estimated costs to complete the contract or both. Therefore, changes in costs incurred in the period compared with prior periods do not necessarily impact profitability. It is only when total estimated costs at completion on a given contract change without a corresponding change in the contract value (or vice versa) that the profitability of that contract may be impacted. Contract mix refers to changes in the volume of higher- versus lower-margin work. Higher or lower margins can result from a number of factors, including contract type (e.g., fixed-price/cost-reimbursable) and type of work (e.g., development/production). Contract mix can also refer to the stage of program maturity for our long-term production contracts. New long-term production contracts typically have lower margins initially, and then margins generally increase as we achieve learning curve improvements or realize other cost reductions.\nCONSOLIDATED OVERVIEW\n2024 IN REVIEW\nStrong operating performance:\nRevenue of $47.7 billion, an increase of 12.9% from 2023\nOperating earnings of $4.8 billion, an increase of 13% from 2023, with sequential growth throughout the year\nDiluted earnings per share of $13.63, up 13.4% from 2023\nCash provided by operating activities of $4.1 billion, or 109% of net earnings\nBacklog of $90.6 billion, supporting our long-term growth expectations:\nStrong Gulfstream aircraft order activity, including orders across all aircraft models\nSeveral significant contract awards received in our defense segments, including $3.7 billion of combined awards from the U.S. Navy for advance procurement and other work for the Virginia-class submarine program\nYear Ended December 31\nOperating costs and expenses\nOur consolidated revenue increased in 2024 driven by growth across all segments, including double digit percentage growth in our Aerospace and Marine Systems segments. Operating margin increased 10 basis points.\nREVIEW OF OPERATING SEGMENTS\nFollowing is a discussion of operating results and outlook for each of our operating segments. For the Aerospace segment, results are analyzed by specific types of products and services, consistent with how the segment is managed. For the defense segments, the discussion is based on markets and the lines of products and services offered with a supplemental discussion of specific contracts and programs when significant to the results. Additional information regarding our segments can be found in Note O to the Consolidated Financial Statements in Item 8.\nAEROSPACE\nYear Ended December 31\nGulfstream aircraft deliveries (in units)\nThe increase in the Aerospace segment’s revenue in 2024 consisted of the following:\nAircraft manufacturing\nAircraft manufacturing revenue increased in 2024 due primarily to the number and mix of aircraft deliveries, including our ultra-long-range, ultra-large-cabin G700 aircraft, which began deliveries in the second quarter of 2024 following U.S. Federal Aviation Administration (FAA) and European Union Aviation Safety Agency (EASA) certification. The number of G700 deliveries in 2024 was impacted by supplier quality escapes, late delivery of components and out of station work. Aircraft services revenue was higher in 2024 due to increased customer demand for aircraft maintenance based on established maintenance cycles, a larger installed base and customer flight activity.\nThe increase in the segment’s operating earnings in 2024 consisted of the following:\nAircraft manufacturing\nAircraft manufacturing operating earnings increased in 2024 but not at the same rate as revenue, reflecting additional costs associated with the initial deliveries of G700 aircraft due to out of station work caused by supplier quality escapes and late delivery of components. Aircraft services operating earnings were higher in 2024 due to higher volume. G&A/other expenses increased in 2024 consistent with the growth in the business. In total, the Aerospace segment’s operating margin decreased 70 basis points in 2024.\nWe expect the Aerospace segment’s 2025 revenue to increase to approximately $12.7 billion with operating margin of approximately 13.7%.\nMARINE SYSTEMS\nYear Ended December 31\n\nThe increase in the Marine Systems segment’s revenue in 2024 consisted of the following:\nU.S. Navy ship construction\nU.S. Navy ship engineering, repair and other services\nRevenue from U.S. Navy ship construction and engineering was up in 2024 due primarily to increased volume on the Columbia-class and Virginia-class submarine programs. The Marine Systems segment’s operating margin decreased 50 basis points in 2024 due to a $123 unfavorable profit adjustment in the fourth quarter of 2024 on the Virginia-class Block IV contract as it approaches completion in 2026. The Virginia-class program has been impacted by supplier quality issues and late supply chain deliveries causing cost growth and schedule delays.\nWe expect the Marine Systems segment’s 2025 revenue to increase to approximately $15 billion with operating margin of approximately 6.8%.\nCOMBAT SYSTEMS\nYear Ended December 31\nThe increase in the Combat Systems segment’s revenue in 2024 consisted of the following:\nWeapons systems and munitions\nU.S. military vehicles\nInternational military vehicles\nWeapons systems and munitions revenue increased in 2024 due to heightened demand for artillery products. Revenue from U.S. military vehicles was up in 2024 due primarily to higher volume on the U.S. Army’s M10 Booker combat vehicle program. The Combat Systems segment’s operating margin increased 30 basis points compared with 2023 driven by favorable contract mix.\nWe expect the Combat Systems segment’s 2025 revenue to increase to approximately $9.1 billion with operating margin of approximately 14.5%.\nTECHNOLOGIES\nYear Ended December 31\nThe increase in the Technologies segment’s revenue in 2024 consisted of the following:\nInformation technology (IT) services\nCommand, control, communications, computers, cyber, intelligence, surveillance and reconnaissance\nThe Technologies segment’s revenue increased in 2024 due primarily to strong demand for IT services, including the ramp-up of new programs, offset partially by C5ISR solutions program timing and the ramp-down of legacy programs. Overall, the segment’s margin increased 30 basis points compared with 2023 due to strong operating performance.\nWe expect the Technologies segment’s 2025 revenue to increase to approximately $13.5 billion with operating margin of approximately 9.2%.\nCORPORATE\nCorporate operating costs totaled $139 in 2024 and $160 in 2023 and consisted primarily of equity-based compensation expense. Corporate operating costs are expected to be approximately $150 in 2025.\nOTHER INFORMATION\nPRODUCT AND SERVICE REVENUE AND OPERATING COSTS\nYear Ended December 31\nThe increase in product revenue in 2024 consisted of the following:\nAircraft manufacturing\nWeapons systems and munitions\nAircraft manufacturing revenue increased due to additional aircraft deliveries. Ship construction revenue was up due primarily to higher volume on the Columbia-class and Virginia-class submarine programs. Weapons systems and munitions revenue increased due to heightened demand for artillery products. In 2024, product operating costs increased at a higher rate than revenue due to supplier quality issues and late supply chain deliveries on the Virginia-class Block IV contract within our Marine Systems segment and additional costs associated with initial deliveries of G700 aircraft due to out of station work caused by supplier quality escapes and late delivery of components in our Aerospace segment.\nThe increase in service revenue in 2024 consisted of the following:\nC5ISR solutions/IT services\nAircraft services revenue increased due to additional maintenance work. C5ISR solutions and IT services revenue was up due to higher volume, including the ramp-up of new programs. Ship services revenue increased due to higher volume on the Columbia-class submarine program. The primary drivers of the increase in service operating costs were the cha",
  "item2_clean": null
}