{
  "source_file": "gd-20250928.htm",
  "form_type": "10-Q",
  "item1_clean": null,
  "item7_clean": null,
  "item2_clean": "ITEM 2.\nMANAGEMENT’S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION\nAND RESULTS OF OPERATIONS\n(Dollars in millions, except per-share amounts or unless otherwise noted)\nBUSINESS OVERVIEW\nGeneral Dynamics is a global aerospace and defense company that offers a broad portfolio of products and services in business aviation; ship construction and repair; land combat vehicles, weapons systems and munitions; and technology products and services.\nBUSINESS ENVIRONMENT\nWith approximately 70% of our revenue from the U.S. government, government spending levels influence our financial performance. Although the government's new fiscal year (FY) began on October 1, 2025, the Congress has not passed a continuing resolution (CR) nor a FY funding bill, resulting in a government shutdown. The impact on our 2025 results of operations, financial condition and cash flows is uncertain and depends on the duration and government management of the shutdown. In response to the shutdown, we issued commercial paper subsequent to quarter end to support liquidity in the event of slow or non-payment by our customers impacted by the shutdown. In the Results of Operations section that follows, we have included our current outlook for each operating segment. This outlook reflects management's judgment in light of the uncertainties due to the government shutdown.\nIn 2025, the administration has taken steps to address federal spending, including forming the Department of Government Efficiency (DOGE) to assist in this process. Thus far, the directives of the administration and actions of the DOGE have resulted in federal government staff reductions, hiring freezes, contract modifications and terminations, and delays in contract awards. We have experienced some award delays and contract terminations as a result of these actions as well as changes in agency priorities, largely within our IT services business. In addition, the administration has implemented new tariffs as part of U.S. trade policy. The duration and extent of the tariffs and any reciprocal tariffs, as well as any available opportunities to lessen the impact, continue to evolve. To date, these actions have not had a material impact on our results of operations, financial condition or cash flows.\nDuring the third quarter, we began deliveries of our new ultra-large-cabin G800, the world's longest-range business aircraft. The G800 is the replacement aircraft for the G650, which had its final delivery in the second quarter of 2025. In September 2025, we announced our all-new super-midsize G300 aircraft, which will replace the G280 aircraft.\nRESULTS OF OPERATIONS\nINTRODUCTION\nThe following paragraphs explain how we recognize revenue and operating costs in our operating segments and the terminology we use to describe our operating results.\nIn the Aerospace segment, we record revenue on contracts for new aircraft when the customer obtains control of the asset, which is generally upon delivery and acceptance by the customer of the fully outfitted aircraft. Revenue associated with the segment’s services businesses is recognized as work progresses or upon delivery of services. Fluctuations in revenue from period to period result from the number and mix of new aircraft deliveries, and the level and type of aircraft services performed during the period.\nThe majority of the Aerospace segment’s operating costs relates to new aircraft production on firm orders and consists of labor, material, subcontractor and overhead costs. The costs are accumulated in production lots, recorded in inventory and recognized as operating costs at aircraft delivery based on the estimated average unit cost in a production lot. While changes in the estimated average unit cost for a production lot impact the level of operating costs, the amount of operating costs reported in a given period is based largely on the number and type of aircraft delivered. Operating costs in the Aerospace segment’s services businesses are recognized generally as incurred.\nFor new aircraft, operating earnings and margin are a function of the prices of our aircraft, our operational efficiency in manufacturing and outfitting the aircraft, and the mix of ultra-large-cabin, large-cabin and mid-cabin aircraft deliveries. Aircraft mix can also refer to the stage of program maturity for our aircraft models. A new aircraft model typically has lower margins in its initial production lots, and then margins generally increase as we realize efficiencies in the production process. Additional factors affecting the segment’s earnings and margin include the volume, mix and profitability of services work performed, the market for pre-owned aircraft, and the level of general and administrative (G&A) and net research and development (R&D) costs incurred by the segment.\nIn the defense segments, revenue on long-term government contracts is recognized generally over time as the work progresses, either as products are produced or as services are rendered. Typically, revenue is recognized over time using costs incurred to date relative to total estimated costs at completion to measure progress toward satisfying our performance obligations. Incurred costs represent work performed, which corresponds with, and thereby best depicts, the transfer of control to the customer. Contract costs include labor, material, overhead and, when appropriate, G&A expenses. Variances in costs recognized from period to period reflect primarily increases and decreases in production or activity levels on individual contracts. Because costs are used as a measure of progress, year-over-year variances in costs result in corresponding variances in revenue, which we generally refer to as volume.\nOperating earnings and margin in the defense segments are driven by changes in volume, performance or contract mix. Performance refers to changes in profitability based on adjustments to estimates at completion on individual contracts. These adjustments result from increases or decreases to the estimated value of the contract, the estimated costs to complete the contract or both. Therefore, changes in costs incurred in the period compared with prior periods do not necessarily impact profitability. It is only when total estimated costs at completion on a given contract change without a corresponding change in the contract value (or vice versa) that the profitability of that contract may be impacted. Contract mix refers to changes in the volume of higher- versus lower-margin work. Higher or\nlower margins can result from a number of factors, including contract type (e.g., fixed-price/cost-reimbursable) and type of work (e.g., development/production). Contract mix can also refer to the stage of program maturity for our long-term production contracts. New long-term production contracts typically have lower margins initially, and then margins generally increase as we achieve learning curve improvements or realize other cost reductions.\nCONSOLIDATED OVERVIEW\nOperating costs and expenses\nOperating costs and expenses\nOur consolidated revenue increased in the third quarter and first nine months of 2025 due primarily to double digit percentage growth in our Aerospace and Marine Systems segments. Operating margin increased 20 basis points in the third quarter and 40 basis points in the first nine months of 2025 due primarily to strong operating performance in our Aerospace segment.\nREVIEW OF OPERATING SEGMENTS\nFollowing is a discussion of operating results for each of our operating segments. For the Aerospace segment, results are analyzed by specific types of products and services, consistent with how the segment is managed. For the defense segments, the discussion is based on markets and the lines of products and services offered with a supplemental discussion of specific contracts and programs when significant to the results. Additional information regarding our segments can be found in Note L to the unaudited Consolidated Financial Statements in Part I, Item 1.\nAEROSPACE\nGulfstream aircraft deliveries (in units)\nGulfstream aircraft deliveries (in units)\nThe increase in the Aerospace segment’s revenue in the third quarter and first nine months of 2025 consisted of the following:\nAircraft manufacturing\nAircraft manufacturing revenue increased in the third quarter and first nine months of 2025 due primarily to additional G700 aircraft deliveries. Aircraft services revenue was up in the third quarter and first nine months of 2025 due primarily to increased customer demand for aircraft maintenance based on established maintenance cycles, a larger installed base and customer flight activity.\nThe increase in the segment’s operating earnings in the third quarter and first nine months of 2025 consisted of the following:\nAircraft manufacturing\nAircraft manufacturing operating earnings increased in the third quarter and first nine months of 2025 due primarily to the number and mix of aircraft deliveries, as well as productivity improvements stemming from increased stabilization of the supply chain. G&A/other expenses decreased in the third quarter and first nine months of 2025 due primarily to reduced R&D expenditures after the completion of G800 certification processes. In total, the Aerospace segment’s operating margin increased 100 basis points in the third quarter and 190 basis points in the first nine months of 2025 compared with the prior-year periods.\nWe expect the Aerospace segment’s 2025 revenue to be approximately $13.2 billion with operating margin of approximately 13.3%.\nMARINE SYSTEMS\nThe increase in the Marine Systems segment’s revenue in the third quarter and first nine months of 2025 consisted of the following:\nU.S. Navy ship construction\nU.S. Navy ship engineering, repair and other services\nRevenue from U.S. Navy ship construction was up in the third quarter and first nine months of 2025 due primarily to increased volume on Virginia-class and Columbia-class submarine construction. The Marine Systems segment"
}