{
  "source_file": "gddy-20250930.htm",
  "form_type": "10-Q",
  "item1_clean": null,
  "item7_clean": null,
  "item2_clean": "Item 2. Management's Discussion and Analysis of Financial Condition and Results of Operations\n(Throughout the tables and this discussion and analysis, dollars are in millions, excluding average revenue per user (ARPU), and shares are in thousands.)\nWe serve a large market of entrepreneurs through the development and delivery of easy-to-use products in a one stop shop solution alongside personalized guidance. We serve small businesses, individuals, organizations, developers, designers and domain investors. We manage and report our business in the following two segments:\nApplications and Commerce (A&C)\n, which primarily consists of sales of products containing proprietary software, notably our website building products, as well as our proprietary commerce solutions and third-party email and productivity solutions and sales of certain products when they are included in bundled offerings of our proprietary software products.\nCore Platform (Core)\n, which primarily consists of sales of domain registrations and renewals, aftermarket domain sales, domain protection, website hosting products and website security products when not included in bundled offerings of our proprietary software products as well as sales of products not containing a software component.\nConsolidated Third Quarter Financial Highlights\nBelow are our key consolidated financial highlights for the three months ended September 30, 2025, with comparisons to the three months ended September 30, 2024.\nTotal revenue of $1,265.3 million, an increase of 10.3% on a reported and constant currency basis\nInternational revenu\ne of $422.5 million, an increase of 14.4% on a reported and constant currency basis\nTotal bookings of $1,354.5 million, an increase of 9.1%, or 9.0% on a constant currency basis\nncome of $296.7 million, an increase of 16.9%.\nof $210.5 million, an increase of 10.5%.\nDA\nof $408.6 million, an increase of 11.5%.\nNet cash provided by op\nerating activities of $444.2 million, an increase of 25.1%.\nDiscussion of constant currency is set forth in \"Quantitative and Qualitative Disclosures about Market Risk.\"\n\nThe $112.8 million, or 9.1%, increase in total bookings for the three months ended September 30, 2025 and the $300.5 million, or 7.9%, increase in total bookings for the nine months ended September 30, 2025\nwere driven by strength in domains and aftermarket and continued customer adoption of our subscription-based A&C products. For the nine months ended September 30, 2025, the increase was offset by a\nimpact from changes in foreign currency exchange rates net of hedging gains from our cash flow hedging program.\nAfter October 3, 2025, following a competitive rebid in the second quarter of 2025, we will no longer operate as the registry service provider for the .CO top-level domain. We do not expect this transition to have a material impact to our financial results and will continue to offer .CO to customers in our capacity as an accredited registrar.\nCosts and Operating Expenses\nCost of revenue primarily represents the direct costs incurred in connection with selling an incremental product to our customers. Such costs primarily relate to domain registration fees, payment processing fees, third-party commissions and licensing fees for third-party productivity applications. Similar to our billing practices, we pay domain costs at the time of purchase for the life of each subscription but recognize the costs of service ratably over the term of our customer contracts. The terms for domain costs are established by agreements between registries and registrars and can vary significantly depending on the top-level domain (TLD). We expect cost of revenue to increase in absolute dollars in future periods due to increased sales of domains and third-party productivity applications. However, cost of revenue may fluctuate as a percentage of total revenue, depending on the mix of products sold in a particular period.\nCost of revenue (excluding depreciation and amortization)\nThe $60.9 million, or 14.9%, increase in cost of revenue for the three months ended September 30, 2025 was driven by the increases in revenue described above as well as a combined $8.9 million increase related to the timing of certain costs associated with the sale of bundled products and a higher number of lower-margin aftermarket sales.\nThe $120.9 million, or 9.8%, increase in cost of revenue for the nine months ended September 30, 2025 were driven by the increases in revenue described above.\nTechnology and development\nTechnology and development expenses represent the costs associated with the creation, development and distribution of our products and websites. These expenses primarily consist of personnel costs associated with the design, development, deployment, testing, operation and enhancement of our products, as well as costs associated with the operation of our data centers and systems infrastructure supporting those products, excluding depreciation expense.\nWe expect technology and development expenses to decrease as a percentage of revenue in future periods following a period of investment in product development and migration toward a unified infrastructure platform.\nTechnology and development\nThere was no material change in technology and development expenses for the three months ended September 30, 2025.\nThe $16.2 million, or 2.6%, increase in technology and development expenses for the nine months ended September 30, 2025, was attributable to a $14.6 million increase in personnel costs associated with our continued investment in product development.\nMarketing and advertising\nMarketing and advertising expenses represent the costs associated with attracting and acquiring customers, primarily consisting of fees paid to third parties for marketing and advertising campaigns across a variety of channels. These expenses also include personnel costs and affiliate program commissions. We expect marketing and advertising expenses to fluctuate depending on both the mix of internal and external marketing resources used, the size and scope of our future campaigns and the level of discretionary investments we make in marketing to drive future sales.\nMarketing and advertising\nThe $7.6 million, or 9.0%, increase in marketing and advertising expenses for the three months ended September 30, 2025 and the $20.4 million, or 7.7%, increase in marketing and advertising expenses for the nine months ended September 30, 2025, were attributable to an increase in discretionary advertising spend in support of our strategic initiatives, including broader awareness of our AI-powered solutions, including our GoDaddy Airo experience.\nCustomer care expenses represent the costs to guide and service our customers, primarily consisting of personnel costs. We expect customer care expenses to fluctuate depending on the methods of customer interaction utilized as well as the level of personnel required to support our business.\nThere was no material change in customer care expenses for the three and nine months ended September 30, 2025.\nGeneral and administrative\nGeneral and administrative expenses primarily consist of personnel costs for our administrative functions, professional service fees, office rent for all locations, acquisition-related expenses and other general costs. We expect general and administrative expenses to fluctuate depending on the level of personnel and other administrative costs required to support our business as well as the significance of any strategic acquisitions we choose to pursue.\nGeneral and administrative\nThere was no material change in general and administrative expenses for the three and nine months ended September 30, 2025.\nRestructuring and other\nRestructuring and other\nThere was no material change in restructuring and other for the three months ended September 30, 2025.\nRestructuring and other was $7.9 million for the nine months ended September 30, 2025, which related to severance and employee benefits incurred pursuant to restructuring activities. Restructuring and other was $29.7 million for the nine months ended September 30, 2024, which includes $17.4 million of costs incurred pursuant to restructuring activities and $5.7 million of expense related to the abandonment of certain operating leases.\nDepreciation and amortization\nDepreciation and amortization expenses consist of charges relating to the depreciation of the property and equipment used in our operations and the amortization of acquired intangible assets. These expenses may increase or decrease in absolute dollars in future periods depending on our future level of capital investments in hardware and other equipment as well as the significance of any future acquisitions.\nDepreciation and amortization\nThere was no material change in depreciation and amortization expenses for the three months ended September 30, 2025.\nThe $13.3 million, or 12.9%, decrease in depreciation and amortization expense for the nine months ended September 30, 2025 was attributable to fully depreciated assets and accelerated depreciation related to office closures in Q2 2024.\nThere was no material change in interest expense for the three and nine months ended September 30, 2025.\nOther income (expense), net\nOther income (expense), net\nThere was no material change in other income (expense), net for the three and nine months ended September 30, 2025.\nSegment Results of Operations\nOur two operating segments, A&C and Core, reflect the way we manage and evaluate the performance of our business. Our chief operating decision maker evaluates segment performance based upon several factors, of which the primary financial measures are revenue and Segment EBITDA, our segment measure of profitability. See Note 16 to our financial statements for a reconciliation of Segment EBITDA to net income, its most directly comparable GAAP financial measure.\nApplications and Commerce\nThe following table presents the results for our A&C segment for the periods indicated:"
}