{
  "source_file": "gddy-20241231.htm",
  "form_type": "10-K",
  "item1_clean": "domain names registered worldwide as of December 31, 2024. Our global presence gives us the ability to leverage our brand — a competitive advantage when customers search for products and solutions. We have 20.5 million paying customers and a customer retention rate of approximately 84% for the year ended December 31, 2024. We market and sell to customers in over 200 markets around the world and in 2024, 49% of our customer base and approximately a third of our revenue was derived from our international presence.\nSeamlessly Intuitive Experiences.\nOur customers often self-identify as non-technical and inexperienced in areas such as marketing, content creation and customer management. Because they may lack the expertise to take full advantage of powerful tools, customers may be overwhelmed as they attempt to build and maintain their business. Our solutions aim to simplify this complexity with seamlessly intuitive experiences.\nFor example, with Managed WordPress, we help reduce the complexity of launching and managing WordPress sites so our customers can stay focused on growing their business, not managing complex WordPress hosting tasks. We provide this on a fully managed platform that delivers fast performance and AI-powered site creation. With Websites + Marketing, our proprietary CMS, we incorporate seamlessly intuitive experiences by uniting marketing, content, commerce and customer management tools into a single experience.\nAdditionally, with Airo, an experience that can help proactively build and grow our customers' businesses with AI, we aim to reduce complexities for our customers through an experience that can anticipate their needs and provide solutions through informed interactions, small business industry expertise, knowledge queries and best practices. Airo can help our customers build their identity with domain searching, personalized logos, email inboxes and email templates and aims to help our customers grow\ntheir business with proactive email and text messages, proposed product descriptions and social media posts, conversational UI landing pages and auto-generated product catalogs.\nWe also seek to leverage data and insights to personalize the products and experiences of our customers as well as tailor our solutions and marketing efforts to each of our customer groups. The automation and content creation abilities inherent in these tools elevate the discoverability of and engagement with our products, creating a true one-stop-shop experience. This further enhances our customers' capacity to market their products, sell online, manage their businesses and grow, all in a seamless, low-friction manner. We constantly seek to improve our website, marketing programs and customer care to intelligently respond to each stage of our customers' lifecycles and identify their specific product needs based on experimentation. This allows us to interact more frequently with our customers and understand what products work well for them. We intend to continue investing in our technology and data platforms to harness the power of generative AI to further enable our personalization efforts and make our products even more intuitive for our customers.\nPersonalized Guidance.\nOur customers deeply value expertise and know-how, which has been part of the GoDaddy DNA since our founding. Our customers' needs are highly individualized and unique to their ventures, which we believe makes operating a guidance experience – at scale – a competitive advantage.\nIn recent years, we extended this competency into several new interfaces and subject matters. These interfaces allow us to take learnings and insights gained from customer interactions to build and grow our product and service offerings and drive more thoughtful engagements for our customers. For example, within our Websites + Marketing platform, we are now creating customized action plans for our customers as they seek to market their businesses in a number of different channels based on the type of their venture and their geography. We have also significantly increased the training and engagement content available to our customers, through a number of different content forums and across platforms like YouTube and Instagram. In addition, customers who utilizeAiro-enabled solutions get access to personalized support for website content, logos, ready-to-use social media posts and more.\nGoDaddy Venture Forward Research Initiative.\nEstablished in 2018, GoDaddy's Venture Forward research initiative quantifies the impact that more than 20 million online businesses (measured by a unique domain and an active website) have on their economies. Most of these businesses employ fewer than ten people, categorizing each as a microbusiness. While these microbusinesses may be small, their impact on economies is outsized even though they are often too informal or too new to show up in traditional government statistics. Venture Forward’s data helps those studying, reporting on or advocating for entrepreneurs understand developing themes and insights into microbusiness/digital entrepreneurship. The data also helps us better understand our customers' mindsets, the requirements and challenges they face from start-up through more substantial developments, their aspirations as well as their current circumstances. We can also tailor topics covered by our survey to reflect current events, providing real time updates that can inform on key insights and themes from the populations surveyed. We update this information quarterly and share it to download for free.\nOur people embody the same grit and determination as our customers. Our world-class engineers, designers, marketers and GoDaddy Guides share a passion for technology and its ability to change our customers' lives. We live by the same principles that enable our customers' ideas to survive and thrive, including owning outcomes, building value, joining forces, working courageously and living passionately. Our relentless pursuit of building value and doing right for our customers has been a crucial ingredient of our growth.\nAs of December 31, 2024, we employed 5,518 people worldwide, made up of 2,131 in care and services (who comprise a portion of our GoDaddy Guides), 2,247 in technology and development, 367 in marketing and advertising and 773 in general and administrative functions. In addition, GoDaddy partners with various third-party providers and vendors to provide contracted care and support services to our customers; approximately 3,700 individuals are employed with or engaged by our external partners. These third-party providers are primarily located in international markets, most significantly in India, the Philippines, and Malaysia. A majority of our employees are based in the U.S. and Europe. None of our U.S. employees are represented by a labor union or are party to any collective bargaining agreement in connection with his, her or their employment with us. Certain of our employees in Germany are represented by employee works councils and some other internationally based employees are represented by worker representatives in accordance with local regulations.\nAt GoDaddy, we strive for a workplace culture where everyone has the opportunity to thrive. We support this goal by focusing on key human capital initiatives including:\nCompensation, Pay Parity and Benefits.\nWe actively work to attract a diverse employee population and are committed to providing equitable opportunity in all aspects of employment. In line with this, our compensation programs and practices are designed to compensate our employees fairly based on the work that they perform. Our Compensation and Human Capital Committee aims to design compensation programs that align our pay for performance philosophy at each stage at which compensation decisions are made, including at hire, promotion and throughout the annual compensation cycle. Since 2015, we have published an annual diversity and pay parity report and, according to our analysis, we continue to compensate our male and female employees substantially the same for performing similar jobs across the company for all entities included in our analysis. In 2017, we began reporting on our pay practices across U.S.-based employee populations and reported each year that, according to our analysis of such data, we have paid employees of color and white employees substantially the same for performing similar jobs across the company. In addition to these pay practices, we continue to offer employees a range of comprehensive and competitive benefits and well being offerings that support our human-centered approach and that allow us to attract and retain top talent.\nDiversity, Equity, Inclusion and Belonging.\nAt GoDaddy, we are committed to attracting, hiring, and retaining the best talent from around the world. We strive to foster a diverse, inclusive and equitable workplace where all employees have the opportunity to learn, grow, and succeed. Our employee resource groups (ERGs) play an important role in supporting these goals. ERGs are voluntary, employee-led groups open to all employees that focus on the common topics, identities, affinities, and interests that matter to our people. Aligning with our values of joining forces and respecting one another, our ERGs help employees connect with one another, feel a sense of belonging at GoDaddy, support one another’s professional development and come together. We also continuously work to have hiring, development, and retention practices that enable GoDaddy to be an employer of choice for top talent globally. To do so, we leverage the expertise of organizations like the Human Rights Campaign, PulseLearning and VMware Women’s Leadership Innovation Lab at Stanford University to understand best practices in these areas. As we work to make opportunity more inclusive for all, we remain committed to cultivating a workplace where our employees can thrive.\nTalent and Career Development.\nWe commit to providing fulfilling career development opportunities for our employees. Through our learning and development initiatives, we aim to achieve three goals: (i) align employees to our company strategy and goals; (ii) connect employees through experiential learning; and (iii) grow employee skill sets for the future. We offer extensive learning opportunities to our employees spanning leadership, sales, service and technology and compliance training through e-learning, instructor-led content, video-based and blended platforms. We offer several leadership development opportunities including new manager onboarding, a leadership development program for managers and above, and a multi-month management program for our care and services managers. In addition, for our GoDaddy Guides, we offer continuing education and training programs that are immersive with environments, technology, and tools that enable active learning. We are also supporting our employees with the latest technologies to enhance and assist in productivity and learning, including AI solutions and software, such as our Guide Assist Bot, GABI, which supports our GoDaddy Guides as they provide care to our customers.\nEmployee Engagement.\nWe aim to create a working environment and culture in which our employees feel respected and supported to do their best work. To that end, we ensure that we are engaging, listening and responding to employee concerns through our annual anonymous employee engagement survey known as GoDaddy Voice. Approximately 84% of our employees participated in the survey in 2024. We monitor employee responses to identify areas of opportunity and set goals and expectations for improvement to ensure employees feel connected and engaged with GoDaddy's mission, our customers and their own teams. Following a comprehensive review, the key results, areas of progress and opportunity, and plans for improvement are shared with all employees.\nCommunity Engagement.\nOur social impact work, overseen by o",
  "item7_clean": "Item 7. Management's Discussion and Analysis of Financial Condition and Results of Operations\nThe following discussion and analysis of our financial condition and results of operations should be read together with our financial statements and related notes included in \"Financial Statements and Supplementary Data.\" Some of the information contained in this discussion and analysis, including information with respect to our plans and strategies for our business, includes forward-looking statements involving significant risks and uncertainties. As a result of many factors, such as those set forth in \"Risk Factors,\" actual results may differ materially from the results described in, or implied by, these forward-looking statements.\n(Throughout the tables and this discussion and analysis, dollars are in millions, excluding average revenue per user (ARPU), and shares are in thousands.)\nWe serve a large market of entrepreneurs, through the development and delivery of easy-to-use products in a one stop shop solution alongside personalized guidance. We serve small businesses, individuals, organizations, developers, designers and domain investors. We manage and report our business in the following two segments:\nApplications and Commerce (A&C)\n, which primarily consists of sales of products containing proprietary software, notably our website building products, as well as our proprietary commerce solutions and third-party email and productivity solutions and sales of certain products when they are included in bundled offerings of our proprietary software products.\nCore Platform (Core)\n, which primarily consists of sales of domain registrations and renewals, aftermarket domain sales, domain protection, website hosting products and website security products when not included in bundled offerings of our proprietary software products as well as sales of products not containing a software component.\nWe have developed a stable and durable business model driven by strong brand recognition, seamless technology, scale of our business and customer care. We generate bookings and revenue, which help us measure the success of our efforts, from the sales of our product subscriptions. In addition, we monitor total bookings as we believe it is an indicator of the expected growth in our revenue and is a supplemental measure of the operating performance of our business. Total bookings and revenue derived from both of our product categories have increased in each of the last three years, with many of our non-domains products growing faster in recent periods.\nThe primary factors driving growth in our business are pricing and bundling, seamless technology experience, commerce, cost optimization and retention of high intent customers. Our key priorities, developments and highlights in these areas include:\nSeamless Technology and Airo\n. We continue to expand our AI-powered experiences, including Airo, and incorporate AI innovations into our products, services and throughout our operations to make use of efficiencies and increase productivity. We remain focused on expanding our solutions and operations to stay up to date with these developments in order to maintain and grow our business.\nCost Optimization and Profitability\n. During the year ended December 31, 2024, the Company engaged in cost optimization initiatives, including reductions in headcount, decreases in rent and utilities expenses, and reductions in costs associated with data center and systems infrastructure as we continue to migrate to a cloud-based infrastructure.\nPricing and Bundling\n. During the year ended December 31, 2024, pricing and bundling initiatives resulted in an increase in bookings and continued strong growth in A&C revenue. We aim to continue to experiment and utilize various pricing strategies and price points for our solutions. In addition, as we continue to incorporate AI innovations into our solutions, monetization trends could be affected.\nWe continue to grow our commerce offerings with tailored OmniCommerce solutions, including point-of-sale systems and SaaS plans with premium features and discounted transaction fees to merchants. We also continue to enhance our offerings with new AI-powered features that simplify operations for our customers.\nCustomer Composition.\nStrong customer retention continues to drive our business. Our marketing efforts set out to educate current and potential customers about the depth and breadth of our offerings. We aim to attract high-intent customers that attach more at the outset of our relationship and over time. Our onboarding paths and seamless technology are designed to help customers more easily navigate the solutions for their one-stop-shop experience through an integrated platform. We have focused our efforts here because we know through our long history and vast amount of data that customers with a greater number of products with us retain at higher rates and produce higher lifetime value. For the year ended December 31, 2024, our customer retention rate was approximately 84%, a slight reduction from the approximate 85% in each of the four years prior, due to divestitures, migrations and the end of life of certain products as part of our efforts to streamline brands outside the GoDaddy platform. For the year ended December 31, 2024, customer retention for customers within the GoDaddy platform, which represents the vast majority of our customers, was approximately 87%. In addition, the retention rate for our customers who had been with us for over three years as of December 31, 2024 was approximately 90%. Greater than 89% of our total revenue was generated by customers who were also customers in the prior year.\nWe believe the breadth and depth of our solutions, the intelligent and proactive AI-powered experiences and the high quality and responsiveness of our customer care team builds strong relationships with our customers and are key to our high level of customer retention. To that end, we continue to monitor our customer cohorts to ensure growth and stability of our customer base. We track revenue and retention rates generated by our annual customer cohorts over time, as well as corresponding marketing and advertising spend.\nFinancial Highlights\nBelow are our key consolidated financial highlights for 2024, with comparisons to 2023.\nTotal revenue of $4,573.2 million, an increase of 7.5% on a reported and constant currency basis\nInternational revenue of $1,459.8 million, an increase of 5.7%, or approximately 5.8% on a constant currency basis\nTotal bookings of $5,038.8 million, an increase of 9.5%, or approximately 9.7% on a constant currency basis\nOperating income of $893.5 million, an increase of 63.2%.\nNet income of $936.9 million, a decrease of 31.9%.\nof $1,395.9 million, an increase of 23.0%.\nNet cash provided by operating activities of $1,287.7 million, an increase of 22.9%.\nDiscussion of constant currency is set forth in \"Quantitative and Qualitative Disclosures about Market Risk.\"\nOur operating results for the year ended December 31, 2024 and December 31, 2023 included $39.4 million and $90.8 million, respectively, in restructuring and other charges, as further discussed in Note 14 to our financial statements. Net income for the year ended December 31, 2023 included a $971.8 million benefit for income taxes primarily due to a $1,014.0 million release of the majority of our domestic valuation allowance\nA reconciliation of Normalized EBITDA to net income, its most directly comparable GAAP financial measure, is set forth in \"Reconciliation of NEBITDA\"\n\nResults of Operations\nThe following table sets forth our results of operations for the periods presented and as a percentage of our total revenue for those periods. The period-to-period comparison of financial results is not necessarily indicative of future results.\nYear Ended December 31,\nA&C\nCosts and operating expenses:\nCost of revenue (excluding depreciation and amortization)\nTechnology and development\nMarketing and advertising\nGeneral and administrative\nRestructuring and other\nDepreciation and amortization\nTotal costs and operating expenses\nLoss on debt extinguishment\nOther income (expense), net\nIncome before income taxes\nBenefit (provision) for income taxes\nLess: net income attributable to non-controlling interests\nNet income attributable to GoDaddy Inc.\nNon-GAAP Financial Measures, Operating Metrics and Business Metrics\nIn addition to our results determined in accordance with GAAP, we believe that the following non-GAAP financial measures, operating metrics and business metrics may be useful as supplements in evaluating our ongoing operational performance:\nYear Ended December 31,\nAnnualized recurring revenue\nTotal customers at period end (in thousands)\nARPU\nDomains under management (in thousands)\nNormalized EBITDA (NEBITDA).\nNEBITDA is a supplemental measure of our operating performance used by management to evaluate our business. We calculate NEBITDA as net income excluding depreciation and amortization, interest expense (net), provision or benefit for income taxes, equity-based compensation expense, acquisition-related costs, restructuring-related expenses and certain other items. We believe that the inclusion or exclusion of certain recurring and non-recurring items provides a supplementary measure of our core operating results and permits useful alternative period-over-period comparisons of our operations. NEBITDA should not be viewed as a substitute for comparable GAAP measures.\nAnnualized recurring revenue (ARR).\nARR is an operating metric defined as annualized quarterly recurring GAAP revenue, net of refunds, from new and renewed subscription-based services. ARR is exclusive of any revenue that is non-recurring, including, without limitation, domain aftermarket, domain transfers, one-time set-up or migration fees and non-recurring professional website services fees. We believe ARR helps illustrate the scale of certain of our products and facilitates comparisons to other companies in our industry.\n. Total bookings is an operating metric representing the total value of customer contracts entered into during the period, excluding refunds. We believe total bookings provides additional insight into the performance of our business and the effectiveness of our marketing efforts since we typically collect payment at the inception of a customer contract but recognize revenue ratably over the term of the contract.\n. We define a customer as an individual or entity, each with a unique account and paid transactions in the trailing twelve months or with paid subscriptions as of the end of the period. Total customers is one way we measure the scale of our business and can be a contributing factor to our ability to increase our revenue base.\nAverage revenue per user (ARPU)\n. We calculate ARPU as total revenue during the preceding 12 month period divided by the average of the number of total customers at the beginning and end of the period. ARPU is one measure that provides insight into our ability to sell additional products to our customers.\nReconciliation of NEBITDA\nThe following table reconciles NEBITDA to net income, its most directly comparable GAAP financial measure:\nYear Ended December 31,\nDepreciation and amortization\nEquity-based compensation expense\nInterest expense, net of interest income\nAcquisition-related expenses, net of reimbursements\nRestructuring and other\nProvision (benefit) for income taxes\nNEBITDA\n_________________________________\nThe year ended December 31, 2024 and 2023 excludes $0.8 million and $2.3 million, respectively, of equity-based compensation expense associated with our restructuring activities, which is included within restructuring and other.\nIn addition to the restructuring and other in our statements of operations, other charges are primarily composed of lease-related expenses associated with closed facilities, charges related to certain legal matters, adjustments to the fair value of our equity investments, expenses incurred in relation to the refinancing of our long-term debt, and incremental expenses associated with certain professional services.\nYear-Over-Year Comparison\nWe generate the majority of our revenue from sales of product subscriptions, as described in Note 2 to our financial statements. Our subscriptions can range from monthly terms to multi-annual terms of up to ten years, depending on the product. Revenue is presented net of refunds, and we maintain a reserve to provide for refunds granted to customers.\nThe following table presents our revenue for the periods indicated:\nYear Ended December 31,\nApplications and commerce\nTotal revenue increased 7.5%, due to the increases in our A&C and Core revenues, as described below:\nA&C\n. The 15.6% increase in A&C revenue for the year ended December 31, 2024 was driven by: (i) 20.3% growth in revenue related to our productivity applications, most notably from our pricing and bundling initiatives; (ii) 8.7% growth in revenues due to continued customer adoption of our subscription-based products designed to establish and grow an online presence; and (iii) 40.1% growth in revenue related to our commerce solutions, as continued customer adoption has resulted in an increase in payment volume.\nThe 3.4% increase in Core revenue for the year ended December 31, 2024 was driven by 7.1% growth in domain registration and add-on revenues and 5.0% growth in aftermarket revenues due to increasing sales volume. Partially offsetting these increases was an 11.6% decrease in hosting revenues primarily due to end-of-life and migration activities from certain products and disposition of certain hosting assets.\nThe following table presents our total bookings for the periods indicated:\n\nSegment EBITDA Margin\nThe 14.1% increase in Core Segment EBITDA for the year ended December 31, 2024 was attributed to a $96.6 million increase in revenue as described above and a $42.1 million decrease in operating expenses (excluding acquisition-related costs and equity-based compensation expense and depreciation and amortization) attributable to lower marketing, customer care and technology and development costs. Partially offsetting these increases was an increase in cost of revenue due to 7.1% growth in domain registration and add-on revenues and 5.0% growth in aftermarket revenues.\nLiquidity and Capital Resources\nOur principal sources of liquidity have been cash flow generated from operations and long-term debt borrowings. Our principal uses of cash have been to fund operations and capital expenditures, to make mandatory principal and interest payments on our long-term debt and to effectuate our share repurchase program. Our liquidity position also benefits from U.S. and state DTAs such that we have not historically paid a significant amount of U.S. federal or state income taxes.\nIn general, we seek to deploy our capital by focusing on requirements for our operations, on growth investments and on stockholder returns. Our strategy is to deploy capital, whether debt, equity or internally generated cash, depending on the adequacy and availability of the source of capital and which source may be used most efficiently and at the lowest cost at such time. Therefore, while cash from operations is our primary source of operating liquidity and we believe our internally-generated cash flows are sufficient to support our day-to-day operations, we may use a variety of capital sources to fund our needs for less predictable investment decisions such as strategic acquisitions and share repurchases.\nWe believe our existing cash and cash equivalents and cash generated by operating activities will be sufficient to meet our anticipated operating cash needs for at least the next 12 months. However, our future capital requirements will depend on many factors, including our growth rate, macroeconomic activity, the timing and extent of spending to support domestic and international development efforts, continued brand develop",
  "item2_clean": null
}