{
  "source_file": "gehc-20241231.htm",
  "form_type": "10-K",
  "item1_clean": "ITEM 1. BUSINESS\nGE HealthCare Technologies Inc. (“GE HealthCare,” the “Company,” “our,” or “we”) is a trusted partner and leading global healthcare solutions provider, innovating medical technology, pharmaceutical diagnostics, and integrated, cloud-first AI-enabled solutions, services, and data analytics. We have approximately 53,000 colleagues dedicated to our mission to create a world where healthcare has no limits. We operate at the center of the healthcare ecosystem, enabling precision care by increasing health system capacity, enhancing productivity, digitizing healthcare delivery, and improving clinical outcomes while serving patients’ demand for greater efficiency, access, and personalized medicine. Our products, services, and solutions are designed to enable clinicians to make more informed decisions quickly and efficiently, improving patient care from screening and diagnosis to therapy and monitoring. We have more than 125 years of experience and one of the strongest reputations in the global healthcare industry, built from our demonstrated record of delivering industry-defining innovation. This is complemented by our broad service capabilities and dedication to quality and integrity with a strong operational culture, deeply embedded in lean continuous improvement.\nPrecision care is expected to drive continued demand and the need for novel technologies and future innovation, as healthcare providers and researchers seek new solutions and tools for managing various disease states. The pursuit of precision care opportunities significantly expands our addressable markets to include integrated diagnostics, AI and machine learning-based clinical decision support, highly personalized therapies enabled by more precise diagnostics, and remote patient monitoring. The scale and breadth of our portfolio, combined with our innovation capabilities, position us to be a leading enabler of precision care.\nWe generate revenue from the sale of medical devices, consumable products, service capabilities, and digital solutions. We serve customers in over 160 countries with a global team of approximately 9,800 sales professionals and 8,300 field service engineers.\nOur customers are healthcare providers and researchers, including public, private, and academic institutions. We are organized into four business segments that are aligned with the industries we serve: Imaging, Advanced Visualization Solutions (“AVS”), Patient Care Solutions (“PCS”), and Pharmaceutical Diagnostics (“PDx”). Our portfolio of solutions addresses the biggest challenges facing healthcare providers and patients today, and helps drive better patient outcomes and improved productivity for customers. These qualities foster trust, loyalty, and partnership with our global customer base.\nOur revenues and operating profits vary from quarter to quarter. Financial results in the fourth quarter have historically been higher than in other quarters due to the spending patterns of our customers.\nGE HealthCare Technologies Inc. is a Delaware corporation with\ncorporate headquarters in Chicago, Illinois. On January 3, 2023, the General Electric Company, which now operates as GE Aerospace (“GE”), completed the spin-off of GE HealthCare (the “Spin-Off”). Refer to Note 1, “Organization and Basis of Presentation” for further information regarding the Spin-Off.\nOUR SEGMENTS\nWe develop, manufacture, and market a broad portfolio of products, services, and complementary digital solutions used in the diagnosis, treatment, and monitoring of patients. We have a large, global installed base of medical imaging, ultrasound, and patient monitoring systems.\nEffective July 1, 2024, Image Guided Therapies (“IGT”), previously part of the Imaging segment, was realigned to the Ultrasound segment to better match its clinical usage and realize stronger business and customer impact by providing the right image guidance in the right care setting. The Ultrasound segment was subsequently renamed Advanced Visualization Solutions. Following this realignment, the Company continues to have four reportable segments: Imaging, AVS, PCS, and PDx, as described below.\nIMAGING.\nGE HealthCare is a global leader in medical imaging with a comprehensive portfolio of scanning devices, clinical applications, service capabilities, and digital solutions. Our Imaging portfolio spans the care continuum and provides critical tools for clinicians, from initial screening and diagnosis, through therapeutic decision-making and monitoring of patient progression. Our products support providers in the delivery of care for a broad spectrum of clinical specialties, including oncology, cardiology, neurology, nuclear medicine, orthopedics, women’s health, pediatrics, and surgery.\nOur Imaging portfolio includes five product lines and associated service capabilities: Molecular Imaging (“MI”), Computed Tomography (“CT”), Magnetic Resonance (“MR”), Women’s Health, and X-ray. We manage our Molecular Imaging and Computed Tomography product lines together (“MI/CT”) and our Women’s Health and X-ray product lines together (“WH/XR”).\nMolecular imaging enables the visualization, characterization, and quantification of functional processes taking place at the cellular and subcellular levels within patients. The images produced by MI systems allow clinicians to study the cellular and molecular pathways and mechanisms of disease in patients. We offer a complete MI solution from cyclotrons, chemistry synthesis, positron emission tomography (“PET”), computed tomography (“PET/CT”), PET/MR, and nuclear medicine to advanced digital and AI-enabled solutions. Our Molecular Imaging team works closely with the PDx segment and their innovations and collaborations with pharmaceutical companies.\nComputed tomography scans render 3D anatomical images of structures, such as bone, soft tissue, and air cavities using an X-ray tube that rotates around a patient. The images are used in a wide variety of applications, including the detection of tumors or lesions, blocked blood vessels in the brain, abnormal heart conditions, complex bone fractures, and internal injuries from trauma. Our comprehensive Computed Tomography portfolio includes multi-purpose and specialty scanners.\nMagnetic resonance is a non-invasive imaging technology that produces detailed anatomical images of almost every internal structure in the human body, such as the brain, spinal cord, heart, breast, kidneys, muscles, ligaments, and tendons. MR can also be used for functional imaging, and it is well-suited for disease detection, diagnosis, and treatment monitoring of a variety of conditions, including stroke, cancer, trauma, aneurysm, multiple sclerosis, cardiomyopathy, and congenital disorders. Our Magnetic Resonance portfolio includes scanners for a range of clinical capabilities through different bore sizes, magnetic field strengths, and scalable platforms.\nWomen’s Health products use X-ray technology to help clinicians screen for and diagnose breast cancer as well as bone and metabolic diseases in women. The product portfolio includes imaging and biopsy positioning systems designed to image the breast and dual energy X-ray absorptiometry scanners designed to image bones with low mineral density.\nX-ray systems are used by clinicians to perform first-line diagnostic imaging examinations of anatomical structures in the body, such as bones, lungs, and the gastrointestinal tract. Our X-ray product portfolio includes systems for three distinct clinical situations: fixed room radiography products installed in hospitals and imaging centers; mobile radiography products used for bedside or other point-of-care imaging needs; and fluoroscopy products installed in hospitals for dynamic or “moving” X-ray imaging in applications like gastrointestinal examinations.\nWe also offer a suite of AI-enabled software and applications that help clinicians improve productivity, address staff shortages, and deliver better patient outcomes. These software solutions and applications are upgradable through the lifecycle of the equipment and are especially beneficial for multi-site, multi-disciplinary networks that have complex operations. We also offer Picture Archiving and Communication Systems (“PACS”) and Radiological Information Systems to manage the storage and reporting of radiology images.\nIn addition to our core products, digital solutions, and service offerings, we provide complementary enterprise solutions, such as education and training and data integration services. Our broad enterprise solutions used along the imaging continuum enable us to drive connectivity across healthcare systems and throughout the product lifecycle.\nADVANCED VISUALIZATION SOLUTIONS.\nGE HealthCare is a global leader in ultrasound, image guided therapies, and interventional solutions with a broad portfolio that spans the continuum of care, including screening, diagnosis, treatment, and monitoring of certain diseases. Our AVS business is focused on designing solutions that are aligned by specialties or care areas for specific clinical workflows to better serve the unique needs of our customers and improve patient outcomes. We continue to deliver innovative solutions to support interventional procedures, all with digital and AI-enabled solutions that help clinicians increase diagnostic confidence, while simplifying clinical and operational workflows.\nThe AVS segment has a portfolio that serves customers across two core areas: Specialized Ultrasound and Procedural Guidance. Specialized Ultrasound includes Comprehensive Care Ultrasound, and Women’s Health Ultrasound. Procedural Guidance includes CardioVascular and Interventional Solutions, and Surgical Innovations.\nComprehensive Care Ultrasound includes systems that produce images to support precise screening, diagnosis, monitoring, and treatment across the whole body, including liver, thyroid, kidney, breast, vascular, and transcranial applications. These systems include point of care and handheld ultrasound devices to support clinical decision-making throughout various care pathways in diverse sites of care. Our systems combine high image quality with comprehensive clinical tools including measurement quantification, workflow automation, cross-modality networking, real-time and AI-enabled scan guidance, and cloud-based technologies with versatility, accessibility, and portability required to deliver care.\nWomen’s Health Ultrasound provides systems to support obstetrics, gynecology, and assisted reproductive medicine. These care areas require specially designed ultrasound products that account for patient comfort and workflow constraints to enable practitioners to provide higher-quality screening, exams, and procedural care, and give clinicians images with the clarity and definition they need to focus on early detection and intervention.\nCardioVascular and Interventional Solutions provides clinicians with tools to diagnose, treat, and monitor cardiovascular conditions with precision and confidence as well as technologies to help assist clinicians and surgeons during open surgeries and minimally invasive and interventional procedures. This includes ultrasound systems used to assess the structure and function of the heart, as well as real-time advanced X-ray imaging that integrates with ultrasound and other imaging and diagnostic systems. These technologies support planning, guiding, and assessing a variety of surgical procedures like cardiac interventions and those that involve insertion of devices like deep brain stimulators, spinal implants, and other neurological devices.\nSurgical Innovations products are used in the operating environment and include a broad portfolio of advanced mobile surgical C-arms that meet clinical needs for surgical imaging and are designed to be easily maneuverable in crowded operating rooms and adaptable for various surgical procedures. Surgical visualization and guidance technology expands the use of ultrasound beyon",
  "item7_clean": "KEY TRENDS AFFECTING RESULTS OF OPERATIONS.\nRussia and Ukraine Conflict\nWe had $162 million and $153 million of assets in, or directly related to, Russia and Ukraine as of December 31, 2024 and December 31, 2023, respectively, none of which are subject to sanctions that impact the carrying value of the assets. We generated revenues of $363 million, $340 million, and $395 million from customers in these two countries for the years ended December 31, 2024, 2023, and 2022, respectively. The potential inability to repatriate earnings from these two countries will not have a material impact on our ability to operate.\nWe continue to monitor the effects of Russia’s invasion of Ukraine, including the consideration of financial impact, cybersecurity risks, the applicability and effect of sanctions, and the employee base in Ukraine and Russia. Under the current U.S. Department of Commerce regulations, we are permitted to export, re-export, or transfer medical equipment and spare parts that meet stated criteria under a License Exception, which has eliminated the need for us to obtain individual U.S. licenses in most cases; however, licenses still may be needed for some transactions. The European Union and other countries have also expanded licensing requirements for certain spare parts, services, software, and other items. We will continue to apply for licenses to supply to these customers and to support our business in Russia, as required. The implementation of these measures affected our ability to supply customers in Russia during the years ended December 31, 2024 and 2023 and will continue to do so as we confirm applicability of the U.S. License Exception to our transactions and continue to obtain licenses. There is no guarantee we will obtain all of the licenses for which we applied, that any approvals we obtain will be on a timely basis, or that our business in Russia will not be further disrupted due to evolving legal or operational considerations. The Board, together with management, will continue to assess whether developments related to the conflict have had, or are reasonably likely to have, a material impact on the Company.\nWe continue to monitor developments in the market in China. In March 2024, the government in China announced a new stimulus program (“2024 stimulus”) that includes the healthcare sector and is being implemented through China’s provinces. In addition, an anti-corruption campaign directed at the healthcare sector remains ongoing. Both of these factors contributed to delayed orders and sales in our China business throughout 2024. We expect the 2024 stimulus program will result in opportunities for our business in China in the longer term, but it has had a short-term impact as provinces develop and announce their plans and customers begin to make purchasing decisions. We expect the effects of the delay in the 2024 stimulus and the anti-corruption campaign to continue to impact our orders and sales in the near term, although we are unable to predict the exact duration or magnitude of the impact. We expect both of these impacts to be temporary, and we believe the focus of government policy in China on expanding access to healthcare will benefit our business in China in the long term.\nIn February 2025, the United States imposed additional tariffs on products from China. These tariffs, and any future tariffs, including on products from Mexico or Canada, by the United States or other countries, will likely result in additional costs to us. The impact of tariffs will depend on various factors including the timing, amount, scope, and nature of the tariffs, and any mitigating actions we implement.\nTax Valuation Allowances\nDeferred income tax assets represent amounts available to reduce income taxes payable on taxable income in future years. We evaluate the recoverability of these future tax deductions and credits by evaluating all available positive and negative evidence. We have a valuation allowance against certain U.S. and foreign deferred tax assets and will release the valuation allowance when there is sufficient positive evidence to support a conclusion that it is more likely than not the deferred tax assets will be realized. For additional information regarding our income taxes, see Note 11, “Income Taxes.”\nOur revenues and operating profits vary from quarter to quarter. Financial results in the fourth quarter have historically been higher than in other quarters due to the spending patterns of our customers.\nOPERATION AS A STAND-ALONE COMPANY.\nFinancial Presentation Under GE Ownership\nGE HealthCare utilized allocations and carve-out methodologies through the date of the Spin-Off to prepare historical combined financial statements. The combined financial statements herein for periods prior to the Spin-Off may not be indicative of our future performance, do not necessarily include the actual expenses that would have been incurred by us, and may not reflect our results of operations, financial position, and cash flows had we been a separate, stand-alone company during the historical periods presented. For additional information, see Note 1, “Organization and Basis of Presentation.”\nStand-Alone Company Expenses\nAs a result of the Spin-Off, we are subject to federal and state securities laws and stock exchange requirements. We have established additional procedures and practices as a stand-alone public company. As a result, we have and will continue to incur additional costs related to external reporting, internal audit, treasury, investor relations, Board of\nDirectors and officers, and stock administration.\nWe have instituted competitive compensation policies and programs as an independent public company. The expense for these policies and programs increased from the compensation expense allocated by GE in years prior to the Spin-Off, driven primarily by higher cash and stock compensation to retain employees and align more closely with industry peers.\nSUMMARY OF KEY PERFORMANCE MEASURES\nManagement reviews and analyzes several key performance measures including Total revenues, Operating income, Net income attributable to GE HealthCare, Earnings per share, and Cash from (used for) operating activities. Management also reviews and analyzes Organic revenue*, Adjusted earnings before interest and taxes* (“Adjusted EBIT*”), Adjusted net income*, Adjusted tax expense*, Adjusted effective tax rate* (“Adjusted ETR*”), Adjusted earnings per share*, and Free cash flow*, which are non-GAAP financial measures. These measures are reviewed and analyzed in order to evaluate our business performance, identify trends affecting our business, allocate capital, and make strategic decisions, including those discussed below. See “Results of Operations” and “Liquidity and Capital Resources” below for further discussion on our key performance measures.\nThe non-GAAP financial measures should be considered along with the most directly comparable U.S. GAAP financial measures. Definitions of these non-GAAP financial measures, a discussion of why we believe they are useful to management and investors as well as certain of their limitations, and reconciliations to their most directly comparable U.S. GAAP financial measures are provided below under “Non-GAAP Financial Measures.”\n____________________\n*Non-GAAP Financial Measure\nRESULTS OF OPERATIONS\nThe following tables set forth our results of operations for each of the periods presented.\nConsolidated and Combined Statements of Income\nFor the years ended December 31\nSelling, general, and administrative\nResearch and development\nTotal operating expenses\nInterest and other financial charges – net\nNon-operating benefit (income) costs\nOther (income) expense – net\nIncome from continuing operations before income taxes\nBenefit (provision) for income taxes\nNet income from continuing operations\nIncome (loss) from discontinued operations, net of taxes\nNet (income) loss attributable to noncontrolling interests\nNet income attributable to GE HealthCare\nTOTAL REVENUES.\nFor the years ended December 31\n\nNet income attributable to GE HealthCare\nAdjusted net income*\nFor the year ended December 31, 2024\nOperating income was $2,625 million, an increase of $190 million and 90 basis points as a percent of Total revenues. The increase was due to the following factors:\nGross profit increased $283 million or 120 basis points as a percent of Total revenues primarily due to a reduction in Cost of products sold. Cost of products sold decreased $194 million or 120 basis points as a percent of Sales of products. The decrease as a percent of sales was driven by cost productivity, favorable mix within our product offerings, and an increase in pricing of our products, partially offset by cost inflation. Cost of services sold increased $31 million but decreased 80 basis points as a percent of Sales of services. The decrease as a percent of sales was driven by cost productivity and an increase in pricing of our service offerings, partially offset by cost inflation. Included in our total cost of revenue as part of our product investment was $405 million in engineering costs for design follow-through on new product introductions and product lifecycle maintenance subsequent to the initial product launch, compared to $438 million for the\nprior year comparable period\nTotal operating expenses increased $93 million, with an increase in R&D investments of $106 million and a decrease in Selling, general, and administrative (“SG&A”) expense of $13 million primarily driven by cost saving initiatives, including information technology, largely offset by increased restructuring spend. As a result, R&D as a percentage of Total revenues increased by 50 basis points and SG&A as a percentage of Total revenues decreased by 20 basis points.\nNet income attributable to GE HealthCare and Net income margin were $1,993 million and 10.1%, an increase of $425 million and 210 basis points, respectively, primarily due to the following factors:\nOperating income increased $190 million, as discussed above;\nInterest and other financial charges – net decreased $38 million primarily driven by repayments made on the Term Loan Facility;\nNon-operating benefit income increased $24 million primarily related to the amortization of net gains on our pension plans;\nOther income – net decreased $31 million primarily driven by favorable impacts from Net financing and investment income in the prior year driven by impacts from the revaluation of investments; and\nProvision for income taxes decreased $212 million primarily due to the release of the France valuation allowance partially offset by the establishment of a reserve for ongoing audits in France. In the prior year, there were larger non-recurring impacts from the Tax Matters Agreement with GE as well as an incremental charge for the accrual of withholding and other foreign taxes due upon future distribution of earnings. For additional detail regarding our income taxes, see Note 11, “Income Taxes.”\nAdjusted EBIT* and Adjusted EBIT margin* were $3,211 million and 16.3%, an increase of $255 million and 120 basis points, respectively, primarily due to an increase in Gross profit, partially offset by investment in R&D.\nAdjusted net income*\n\nwas $2,060 million, an increase of $263 million primarily due to an increase in Gross profit and lower Interest and other financial charges – net, partially offset by investment in R&D.\n____________________\n*Non-GAAP Financial Measure\nFor the year ended December 31, 2023\nOperating income was $2,435 million, a decrease of $87 million and 130 basis points as a percent of Total revenues. The decrease as a percent of Total revenues was due to the following factors:\nCost of products sold increased $490 million but decreased 170 basis points as a percent of Sales of products. The decrease as a percent of sales was driven by cost productivity and an increase in pricing of our products, partially offset by cost inflation. Cost of services sold decreased $22 million or 130 basis points as a percent of Sales of services. The decrease as a percent of sales was driven by cost productivity and an increase in pricing of our service offerings, partially offset by cost inflation. Included in our total cost of revenue as part of our product investment was $438 million in engineering costs for design follow-through on new product introductions and product lifecycle maintenance subsequent to the initial product launch, compared to $429 million for the\nprior year comparable period\nTotal operating expenses increased $830 million due to an increase in SG&A expense of $651 million driven by increased costs associated with both the one-time stand-up and recurring operations of a stand-alone company and commercial and marketing investments and an increase in R&D investments of $179 million. As a result, SG&A as a percentage of Total revenues increased by 210 basis points and R&D as a percentage of Total revenues increased by 60 basis points.\nNet income attributable to GE HealthCare and Net income margin were $1,568 million and 8.0%, a decrease of $348 million and 240 basis points, respectively, primarily due to the following factors:\nOperating income decreased $87 million, as discussed above;\nInterest and other financial charges – net increased $465 million primarily due to interest expense related to the debt securities issued by GE HealthCare in November of 2022 and the Term Loan Facility drawn upon in January of 2023;\nNon-operating benefit income increased $377 million primarily related to the pension plans transferred to GE HealthCare as part of the Spin-Off; and\nProvision for income taxes increased $180 million primarily due to t\nhe tax effect of foreign currency movement, the impact of the Tax Matters Agreement, including the effect of completing the 2022 U.S. federal tax return\n, taxes accrued for the future repatriation of current earnings with a one-time charge for prior period earnings of certain of our foreign subsidiaries, and the impact of adjusting deferred tax assets and liabilities to stand-alone GE HealthCare tax rates. For additional detail regarding our income taxes, see Note 11, “Income Taxes.”\nAdjusted EBIT* and Adjusted EBIT margin* were $2,956 million and 15.1%, an increase of $95 million but a decrease of 50 basis points, respectively, primarily due to an increase in Total revenues, offset by an increase in Total operating expenses, excluding the impact of one-time Spin-Off and separation costs, as discussed above.\nAdjusted net income*\n\nwas $1,797 million, a decrease of $306 million primarily due to higher Interest and other financial charges – net, partially offset by an increase in Operating Income, excluding the impact of one-time Spin-Off and separation costs, as discussed above.\nRESULTS OF OPERATIONS\nSEGMENTS\nWe exclude from Segment EBIT certain corporate-related expenses and certain transactions or adjustments that our Chief Operating Decision Maker (which is our Chief Executive Officer) considers to be non-operational, such as Interest and other financial charges – net, Benefit (provision) for income taxes, restructuring costs, acquisition and disposition-related benefits (charges), Spin-Off and separation costs, Non-operating benefit (income) costs, gain (loss) on business and asset dispositions, amortization of acquisition-related intangible assets, Net (income) loss attributable to noncontrolling interests, Income (loss) from discontinued operations, net of taxes, and investment revaluation gain (loss). See Note 4, “Segment and Geographical Information” for additional information on our reportable segments, and “Results of Operations” above for discussion on segment revenue performance.\nFor the years ended December 31\n% of segment revenues\n% of segment revenues\n% of segment revenues\n\n____________________\n*Non-GAAP Financial Measure\nFor the year ended December 31, 2024\nImaging Segment EBIT was $962 million, an increase of $141 million due to cost p",
  "item2_clean": null
}