{
  "source_file": "gen-20250328.htm",
  "form_type": "10-K",
  "item1_clean": "Purpose: Powering Digital Freedom.\nMission: We create innovative and easy-to-use technology solutions that help people grow, manage and secure their digital and financial lives.\nProtecting people is what inspires us, and our people are at the core of what we do. We seek to attract talent that embraces the following values:\nCustomer Driven. Community Minded.\nWe are customer obsessed and drive positive impact.\nWe embrace change and innovate fearlessly.\nBe Scrappy. Make it Happen.\nBig or small, we get things done irrespective of title or role.\nPlay to Win. Together.\nWe win for our customers, with passion and integrity.\nGen is a global company powering Digital Freedom with a family of trusted brands including Norton, Avast, LifeLock and more. We bring award-winning products and services in cyber safety, covering security, privacy, identity protection and financial wellness to approximately 500 million users in more than 150 countries, empowering them to live their digital lives safely, privately, and confidently today and for generations to come.\nToday’s world is increasingly digital, and this has changed the way we live our lives every day. The last decade has brought increasingly impressive technological advances that have unlocked new ways to play and transact online, control smart homes, manage our life and more. The possibilities in the digital world will continue to unlock new possibilities. However, as our digital footprint expands, so do the risks and exposure. Cybercriminals use a mix of old and new tactics and technologies, including phishing, vishing, smishing, based on machine learning and generative artificial intelligence (AI) technologies, to execute highly advanced threats and attacks. We are our customers’ trusted ally that they can depend on to help secure and control their digital lives so they can be free to enjoy the promise of the digital world. We are committed more than ever to protecting and empowering people’s digital lives with personalized, human-centered safety.\nWe are well-positioned to drive awareness of cyber safety for individuals, families, and small businesses, fueled by an increasingly connected world. We maintain a global, omni-channel sales approach, including direct, indirect and freemium acquisition and a family of brands marketing program. This program is designed to grow our customer base by increasing brand awareness and understanding of our products and services and maximizing our global reach to prospective customers.\nWe help prevent, detect and restore potential damages caused by cybercriminals. We also make it easy for consumers to find, buy and use our products and services. To this end, we offer both free and paid subscription-based cyber safety solutions primarily direct-to-consumer through our family of brands and indirectly through partner relationships. Most of our subscriptions are offered on annual terms, but we also provide monthly subscriptions.\nAs of March 28, 2025, we have approximately 500 million total users, which come from direct, indirect and freemium channels. Of these total users, we have approximately 65 million paid cyber safety customers including over 40 million direct customers with whom we have a direct billing relationship.\nDirect-to-consumer channel:\nWe use advertising to elevate our family of brands, attract new customers and generate significant demand for our services. Our direct subscriptions are primarily sold through our e-commerce platform and mobile apps, and we have a direct billing relationship with the majority of these customers.\nIndirect partner distribution channels:\nWe use strategic and affiliate partner distribution channels to refer prospective customers to us and expand our reach to our partners’ and affiliates’ customer bases. We developed and implemented a global partner sales organization that targets new, as well as existing, partners to enhance our partner distribution channels. These channels include retailers, telecom service providers, hardware original equipment manufacturers (OEMs), employee benefit providers, strategic partners, small offices, home offices and very small businesses. Physical retail and OEM partners represent a small portion of our distribution, which minimizes the impact of supply chain disruptions.\nWith the acquisitions of Avast and Avira, we have expanded our go-to-market with multiple freemium channels. We use free versions of our products to reach the broadest set of consumers globally and bring cyber safety to a larger audience, especially in international markets. The free solution offers a baseline of protection and presents premium functionalities based on the risk profile and specific needs of the user. The user can choose to add specific premium solutions or upgrade to suites that provide security, identity, and privacy across multiple platforms and devices, thereby becoming a paid customer.\nAs is typical for many consumer technology companies, portions of our business are impacted by seasonality. However, we believe the net impact on our business is limited. Seasonal behavior in orders primarily reflects consumer spending patterns during our fiscal third and fourth quarters, as order volume is generally higher due to the holidays in our third quarter, as well as due to follow-on holiday purchases and the U.S. tax filing season which is in our fourth quarter. Revenue generally reflects similar seasonal patterns but to a lesser extent than orders because of our subscription business model, as the majority of our in-period revenues are recognized ratably from our deferred revenue balance.\nOur strategy is focused on long-term profitable growth. To fuel our growth, our consumer-centric strategy is to provide comprehensive and easy-to-use integrated platforms, which we have built in-house or acquired. By combining and leveraging our family of trusted consumer brands, including offerings from Norton, Avast, LifeLock and more, we deliver an industry-leading cyber safety and trust-based solutions.\nWe are positioned for long-term growth and expansion. Our three primary growth levers are:\nLeveraging an omni-channel strategy and building partnerships to broaden privacy and identity protection internationally.\nCross-selling and up-selling, and expanding security, identity and privacy solutions to address consumers’ evolving needs.\nIncrease customer loyalty and retention, as consumers move from point products protecting their devices towards all-in-one comprehensive cyber safety memberships.\nThe key elements of our strategy include the following:\nExtend our leadership position through new products and continued enhancement of our trust-based solutions and services:\nCyber safety is a large and expanding market, which we believe provides a significant growth opportunity. Our strategy is to grow our business through innovation and acquisitions to expand the solutions and services we offer into new cohorts, territories and sectors. We believe there are many additional areas where we can both offer new solutions, as well as use our core capabilities and our integrated platform to reach new customers and markets globally.\nGrow our customer base through multiple channels:\nWe have multiple go-to-market channels to reach new customers globally, including direct-to-customer, indirect partnerships and freemium. We intend to leverage our expertise in digital marketing, as well as existing and new strategic partnerships, to grow our customer base. We believe that continued investments in these areas, as well as our product offerings and infrastructure, will allow us to further enhance our leading brands and superior products, increase awareness of our consumer services and enhance our ability to efficiently acquire new customers.\nContinue our focus on customer retention:\nWe continue to optimize and expand the value we provide to customers which we believe can positively impact retention. We aim to continue to increase customer engagements through actionable alerts, education on timely topics and introducing new product capabilities. We also plan to continue investing in enhancing both desktop and mobile customer experiences throughout a customer’s journey with Gen, from purchase, to onboarding and beyond.\nIncrease value to existing customers:\nWe believe strong customer satisfaction will provide us with the opportunity to engage customers in new services offerings. We maintain the Norton 360 and Avast One platforms that have multiple tiers of membership, and we continue to engage customers with standalone products to offer membership options and show the value proposition of our premium solutions. Over time, we plan to drive further growth as we add additional offerings and services for our customers.\nDraw strength from our world-class customer service support:\nOur global support team seeks to ensure the voice of the consumer is heard and that we put our customers first. We leverage frequent communication and feedback from our customers to continually improve our solutions and services. We embrace end-to-end customer experience and aim to continue to improve our Net Promoter Scores and overall customer satisfaction.\nLeverage our global brands to drive growth:\nWe will work to keep building our family of trusted brands in markets globally as we strive to bring protection and empowerment to all consumers when it comes to their digital lives. According to our most recent research, Norton has 93% global brand awareness, and we are best positioned and top of mind in consumer cyber safety, according to the internal H1 2025 Gen Brand Tracker.\nOur Cyber Safety Solutions and Services\nOur broad portfolio of products and services is developed from consumer insights to help us bring to market real solutions to real problems and to engage and educate consumers about cyber safety. We continuously aim to release new products and features to outpace evolving threats and find synergies to integrate current and future technology acquisitions.\nOur cyber safety portfolio provides protection across three key categories in multiple channels and geographies, including security and performance, identity protection, and online privacy. Leveraging our technology platforms, we integrate software and service capabilities within these three categories into comprehensive and easy-to-use products and solutions across our brands.\nWe have also evolved beyond traditional cyber safety to offer adjacent trust-based solutions, including digital identity and access management, digital reputation, and restoration support services.\nWe protect and empower consumers by providing solutions and services in two main ways:\nComprehensive membership plans:\nProviding a comprehensive and all-in-one cyber safety portfolio of solutions for a membership fee. Plans are offered through Norton 360 and Avast One subscriptions, with both brands providing multiple levels of membership tiers that range from basic, mid-level, or premium tiers where identity theft and online privacy features are included.\nProviding individual, stand-alone products and services in security, identity and privacy, offering flexibility for consumers to choose between free or paid solutions. These products solve for a specific need, when you need it, and can add on to the value you already have. Please see below for our full set of products by category.\nWe are well positioned across three key cyber safety categories:\nSecurity and Performance (Norton, Avast, Avira, AVG, and CCleaner offerings):\nOur offerings provide real-time threat protection for PCs, Macs and mobile devices against malware, viruses, adware, ransomware and other online emerging threats. These offerings monitor and block unauthorized traffic from the internet to the device to help protect private and sensitive information when customers are online. Additionally, our all-in-one cybersecurity solutions help small business owners safeguard their team’s online activities, devices and customer d",
  "item7_clean": "Management’s Discussion and Analysis of Financial Condition and Results of Operations\nOVERVIEW\nGen is a global company powering Digital Freedom with a family of trusted brands including Norton, Avast, LifeLock, MoneyLion and more. Our core cyber safety portfolio provides protection across three key categories in multiple channels and geographies, including security and performance management, identity protection, and online privacy. We have built a technology platform that brings together software and service capabilities within these three categories into a comprehensive and easy-to-use integrated platform across our brands. We bring award-winning products and services in cybersecurity, covering security, privacy and identity protection to approximately 500 million users in more than 150 countries so they can live their digital lives safely, privately, and confidently today and for generations to come.\nWe have a 52/53-week fiscal year ending on the Friday closest to March 31. Fiscal 2025, 2024 and 2023 in this report refers to fiscal years ended March 28, 2025, March 29, 2024 and March 31, 2023, respectively, each of which was a 52-week year.\nThe following table provides our key financial metrics for fiscal 2025 compared with fiscal 2024:\n(In millions, except for per share amounts)\nOperating income (loss)\nNet income (loss) per share - diluted\nNet cash provided by (used in) operating activities\nCash and cash equivalents\nNet revenues increased $135 million, primarily due to higher sales in both our consumer security and identity and information protection products.\nOperating income (loss) increased $500 million, primarily due to increased net revenues, decreased legal costs related to ongoing litigation, lower amortization of intangible assets and restructuring costs related to our acquisition of Avast.\nNet income (loss) increased $36 million and net income per share increased $0.08, primarily due to increased operating income discussed above and decreased interest expense associated with our Term A and Term B facilities. This is offset by the absence of an income tax benefit in the second quarter of fiscal 2024.\nCash and cash equivalents increased by $160 million compared to March 29, 2024, primarily due to cash generated from operating activities during fiscal 2025 and proceeds from the issuance of 6.25% Senior Notes. This is partially offset by repurchases of our common stock, cash interest paid, dividends paid to shareholders, repayment of 5.00% Senior Notes, voluntary prepayments of our Term B facility, and mandatory principal amortization payments of our Term A and B facility.\nDuring fiscal 2025, we returned $955 million of capital back to shareholders and bondholders. This was achieved through the repurchase of 11 million shares of our common stock, totaling $272 million. Additionally, we paid out a total of $313 million in quarterly dividends and carried out $370 million in net debt pay downs, including $30 million in voluntary prepayments applied exclusively to the Term B facility.\nDuring fiscal 2025, we increased net Direct customers by 1.3 million, increased monthly Direct ARPU by $0.04 and increased our Direct retention rate by 1%.\nGLOBAL MACROECONOMIC CONDITIONS\nAs a global company, our results of operations and cash flows may be influenced by global macroeconomic conditions, including, but not limited to, increased tariffs, foreign currency exchange rate fluctuations, the impact of interest rate fluctuations, elevated inflation, ongoing and new geopolitical conflicts, including the unknown impacts of current and future trade regulations, instability in the global banking sector, economic slowdown and recession risks, any of which may persist for an extended period.\nDespite this, we are confident in the long-term overall health of our business, the strength of our product offerings and our ability to continue to execute on our strategy, including bringing award-winning products and services in cybersecurity and offering comprehensive financial wellness to our customers.\nWe continue to monitor the direct and indirect impacts of these global macroeconomic or other geopolitical factors. If the economic uncertainty continues, we may experience additional negative impacts on customer renewals, customer collections, sales and marketing efforts, customer deployments, product development, or other financial metrics. Additional broader implications of these events on our business, results of operations, and overall financial position still remain uncertain and could result in further adverse impacts to our reported results. For further discussion of the potential impacts of global macroeconomic conditions and geopolitical factors on our business, please see “Risk Factors” in Part I, Item 1A and Part II, Item 7A below.\nCRITICAL ACCOUNTING ESTIMATES\nThe preparation of our Consolidated Financial Statements and related notes in accordance with generally accepted accounting principles in the U.S. (U.S. GAAP) requires us to make estimates, including judgments and assumptions that affect the reported amounts of assets, liabilities, revenue and expenses, and related disclosure of contingent assets and liabilities. We have based our estimates, judgements and assumptions on historical experience and on various other factors we believe to be reasonable under the circumstances. We evaluate our estimates, judgements and assumptions on a regular basis and make changes accordingly. Management believes that the accounting estimates employed and the resulting amounts are reasonable; however, actual results may differ from these estimates. Making estimates, judgments and assumptions about future events is inherently unpredictable and is subject to significant uncertainties, some of which are beyond our control. Should any of these estimates, judgements or assumptions change or prove to have been incorrect, it could have a material impact on our results of operations, financial position and cash flows.\nBusiness combinations\nWe allocate the purchase price of acquired businesses to the tangible and identifiable intangible assets acquired and liabilities assumed based on their estimated fair values on the acquisition date. Any residual purchase price is recorded as goodwill. The allocation of purchase price requires management to make significant estimates and assumptions in determining the fair values of the assets acquired and liabilities assumed especially with respect to intangible assets.\nCritical estimates in valuing intangible assets include, but are not limited to, future expected cash flows from customer relationships, developed technology, trade names and other intangibles, and discount rates. Management estimates of fair value are based upon assumptions believed to be reasonable but which are inherently uncertain and unpredictable. Third-party valuation specialists are utilized for certain estimates. Unanticipated events and circumstances may occur which may affect the accuracy or validity of such assumptions, estimates or actual results.\nWe are subject to tax in multiple U.S. and foreign tax jurisdictions. We are required to estimate the current tax exposure as well as assess the temporary differences between the accounting and tax treatment of assets and liabilities, including items such as accruals and allowances not currently deductible for tax purposes. We apply judgment in the recognition and measurement of current and deferred income taxes which includes the following critical accounting estimates.\nWe use a two-step process to recognize liabilities for unrecognized tax benefits. The first step is to evaluate the tax position for recognition by determining if the weight of available evidence indicates that it is more likely than not that the position will be sustained on audit, including resolution of related appeals or litigation processes, if any. There is judgement and complexity involved in assessing if the tax position is more likely than not. If we determine that the tax position will more likely than not be sustained on audit, the second step requires us to estimate and measure the tax benefit as the largest amount that is more than 50% likely to be realized upon ultimate settlement. It is inherently difficult and subjective to estimate such amounts, as this requires us to determine the probability of various outcomes. We re-evaluate these unrecognized tax benefits on a quarterly basis. This evaluation is based on factors including, but not limited to, changes in facts or circumstances, changes in tax law, effectively settled issues under audit and new audit activity. Such a change in recognition or measurement would result in the recognition of a tax benefit or an additional charge to the tax provision in the period.\nWe are subject to contingencies that expose us to losses, including, but not limited to, regulatory proceedings, claims, mediations, arbitration and litigation, arising out of the ordinary course of business. An estimated loss from such contingencies is recognized as a charge to income if it is probable that a liability has been incurred and the amount of the loss can be reasonably estimated. Judgment is required in both the determination of probability and the determination as to whether a loss is reasonably estimable. We review the status of each significant matter quarterly, and we may revise our estimates. Until the final resolution of such matters, there may be an exposure to loss in excess of the amount recorded, and such amounts could be material. Should any of our estimates and assumptions change or prove to have been incorrect, it could have a material impact on our Consolidated Financial Statements for that reporting period.\nRecently adopted authoritative guidance\nRecently issued authoritative guidance not yet adopted\nASU 2023-09, Income Taxes (Topic 740): Improvements to Income Tax Disclosures.\nIn December 2023, the FASB issued new guidance to update income tax disclosure requirements, requiring disaggregated information about an entity’s effective tax rate reconciliation as well as income taxes paid. This is effective for fiscal years beginning after December 15, 2024. We are currently evaluating the impact of the adoption of this guidance on our Consolidated Financial Statements and disclosures.\nASU 2024-03 and ASU 2025-01, Income Statement - Reporting Comprehensive Income (Subtopic 220-40): Expense Disaggregation Disclosures.\nIn November 2024, the FASB issued new guidance requiring that public business entities disclose additional information about specific expense categories in the notes to financial statements at interim and annual reporting periods. This is effective for annual reporting periods beginning after December 15, 2026, and interim reporting periods beginning after December 15, 2027. We are currently evaluating the impact of the adoption of this guidance on our Condensed Consolidated Financial Statements and disclosures.\nRESULTS OF OPERATIONS\nPart II, Item 7. Management’s Discussion and Analysis of Financial Condition and Results of Operations\nThe following table sets forth our Consolidated Statements of Operations data as a percentage of net revenues for the periods indicated:\nResearch and development\nGeneral and administrative\nAmortization of intangible assets\nRestructuring and other costs\nImpairment of intangible assets\nTotal operating expenses\nOperating income (loss)\nOther income (expense), net\nIncome (loss) before income taxes\nIncome tax expense (benefit)\nNote: The percentages may not add due to rounding.\n(In millions, except for percentages)\nFiscal 2025 compared to fiscal 2024\nNet revenues increased $135 million, due to a $95 million increase in sales of our identity and information protection products and a $53 million increase in sales of our consumer security products. This was partially offset by a $13 million decrease in our legacy product offerings. This is inclusive of $11 million of foreign exchange headwinds, in our consumer security solutions.\nWe regularly monitor a number of metrics in order to measure our current performance and estimate our future performance. We believe these key operating metrics are useful to investors because management uses these metrics to assess the growth of\nour business and the effectiveness of our marketing and operational strategies. Our metrics may be calculated in a manner different than similar metrics used by other companies.\nThe following table summarizes supplemental key performance metrics for our solutions:\n(In millions, except for per user amounts and percentages)\nDirect customer revenue\nTotal cyber safety revenues\nDirect customer count (at quarter-end)\nDirect average revenue per user (ARPU)\n(1) Legacy revenues includes revenues from products or solutions from markets that we have exited and in which we no longer operate, have been discontinued or identified to be discontinued, or remain in maintenance mode as a result of integration and product portfolio decisions.\nWe define direct customer count as active paid users of our products and solutions who have a direct billing and/or registration relationship with us at the end of the reported period. We exclude users on free trials from our direct customer count. Users who have indirectly purchased and/or registered for our products or solutions through partners are excluded unless such users convert or renew their subscription directly with us or sign up for a paid membership through our web stores or third-party app stores.\nARPU is calculated as estimated direct customer revenues for the period divided by the average direct customer count for the same period, expressed as a monthly figure. Non-GAAP estimated direct customer revenues and ARPU have limitations as analytical tools and should not be considered in isolation or as a substitute for U.S. GAAP estimated direct customer revenues or other U.S. GAAP measures. We monitor ARPU because it helps us understand the rate at which we are monetizing our consumer customer base.\nRetention rate is defined as the percentage of direct customers as of the end of the period from one year ago who are still active as of the most recently completed fiscal period. We monitor the retention rate to evaluate the effectiveness of our strategies to improve renewals of subscriptions.\nThe methodologies used to measure these metrics require judgment and are subject to change due to improvements or revisions to our methodology. From time to time, we review our metrics and may discover inaccuracies or make adjustments to improve their accuracy, which can result in adjustments to our historical metrics. Our ability to recalculate our historical metrics may be impacted by data limitations or other factors that require us to apply different methodologies for such adjustments. We generally do not intend to update previously disclosed metrics for any such inaccuracies or adjustments that are deemed not material.\nNet revenues by geographical region\nPercentage of revenue by geographical region as presented below is based on the billing location of the customers.\nEMEA\nAPJ\n(1) From time to time, changes in allocation methodologies cause changes to the revenue by geographic area above. When changes occur, we recast historical amounts to match the current methodology, such as for fiscal 2024 where we aligned allocation methodologies across similar product categories.\nThe Americas include U.S., Canada, and Latin America; EMEA includes Europe, Middle East, and Africa; APJ includes Asia Pacific and Japan.\nPercentage of revenue by geographic region remained consistent in fiscal 2025 and fiscal 2024.\n(In millions, except for percentages)\nFiscal 2025 compared to fiscal 2024\nOur cost of revenues increased $45 million, primarily due to a $42 million increase in marketing affiliate expenses.\n(In millions, except for percentages)\nResearch and development\nGeneral and administrative\nAmortization of intangible assets\nRestructuring and other",
  "item2_clean": null
}