{
  "source_file": "gen-20251003.htm",
  "form_type": "10-Q",
  "item1_clean": null,
  "item7_clean": null,
  "item2_clean": "Management’s Discussion and Analysis of Financial Condition and Results of Operations\nForward-looking statements and factors that may affect future results\nOVERVIEW\nGen Digital Inc. is a global company powering Digital Freedom through its family of trusted consumer brands including Norton, Avast, LifeLock, MoneyLion, and more. Our portfolio spans Cyber Safety Platform and Trust-Based Solutions, delivering intuitive, AI-powered services that enable people to confidently grow, manage, and protect their digital and financial lives. From cybersecurity and online privacy to identity protection and financial empowerment, our products and services are designed to meet the real-world needs of today’s digital generation. Through a foundation of trust and innovation, our brands deliver the protection and confidence people need to thrive in a digital-first world.\nOur Cyber Safety Platform delivers technology solutions and superior threat protection to help people navigate the digital world, securely, privately and with confidence. Our Trust-Based Solutions provide innovative solutions and insights that empower consumers to manage their identity, reputation and finances confidently to achieve freedom.\nWe have a 52/53-week fiscal year ending on the Friday closest to March 31. The three months ended October 3, 2025 and September 27, 2024 each consisted of 13 weeks. The six months ended October 3, 2025 consisted of 27 weeks, whereas the six months ended September 27, 2024 consisted of 26 weeks. Our 2026 fiscal year consists of 53 weeks and ends on April 3, 2026.\nKey financial metrics\nThe following tables provide our key financial metrics for the periods presented:\n(In millions, except for per share amounts)\nOperating income (loss)\nNet income (loss) per share - diluted\nCash, cash equivalents and restricted cash\nContract liabilities\nBelow are our financial highlights for the second quarter of fiscal 2026, compared to the corresponding period in the prior year:\nNet revenues increased $246 million, primarily due to higher sales in both our Cyber Safety Platform products and Trust-Based Solutions, including an increase of $202 million due to the acquisition of MoneyLion, reported in Trust-Based Solutions.\nOperating income increased $36 million, primarily due to increased net revenues described above, offset by an increase in marketing costs, payment processing fees, amortization of intangible assets and compensation related expenses.\nNet income decreased $27 million and net income per share decreased $0.05, primarily due to a decrease in other income (expense), net resulting from changes in fair value and impairment of our non-marketable equity investments partially offset by an increase in operating income as discussed above.\nBelow are our financial highlights for the first six months of fiscal 2026, compared to the corresponding period in the prior year:\nNet revenues increased $538 million, primarily due to higher sales in both our Cyber Safety Platform products and Trust-Based Solutions, including an increase of $370 million due to the acquisition of MoneyLion, and an increase of $87 million due to the favorable impact from the additional week in the first quarter of fiscal 2026.\nOperating income increased $65 million, primarily due to increased net revenues described above, offset by an increase in marketing costs, payment processing fees, amortization of intangible assets and compensation related expenses.\nNet income decreased $73 million and net income per share decreased $0.12, primarily due to a decrease in other income (expense), net resulting from changes in fair value and impairment of our non-marketable equity investments and an increase in income tax expense partially offset by an increase in operating income as discussed above.\nCash and cash equivalents decreased by $305 million compared to March 28, 2025, primarily due to the cash consideration paid for our acquisition of MoneyLion, timing of principal payments of our Term A and B facilities and cash interest paid. This is partially offset by proceeds from the issuance of our Incremental Term Loan B and cash generated from operating activities during the first six months of fiscal 2026.\nContract liabilities decreased $61 million compared to March 28, 2025, primarily due to billing seasonality.\nAcquisition of MoneyLion\nOn April 17, 2025, we completed our acquisition of MoneyLion Inc. (MoneyLion). MoneyLion extends our identity solutions into offering comprehensive financial wellness through MoneyLion’s full-featured personal finance platform that includes credit building and financial management services. See Note 4 of the Notes to the Condensed Consolidated Financial Statements for further information about the acquisition.\nGLOBAL MACROECONOMIC CONDITIONS\nAs a global company, our results of operations and cash flows may be influenced by global macroeconomic conditions and their impact on customer behavior. Global macroeconomic conditions include, but are not limited to, increased tariffs and an uncertain global trade environment, foreign currency exchange rate fluctuations, the impact of interest rate fluctuations, elevated inflation, ongoing and new geopolitical conflicts, the impacts of current and future trade regulations, instability in the global banking sector, slow growth and recession risks, and changes in legislation or regulations and actions by regulators, including changes in enforcement and administrative policies, any of which may be difficult to predict and may persist for an extended period.\nDespite challenging global macroeconomic conditions and although we recognize that inflation and broader economic uncertainty can influence customer behavior, we are confident in the long-term overall health of our business, the strength of our product offerings and our ability to continue to execute on our strategy, including bringing award-winning products and services in cybersecurity and offering comprehensive financial wellness to our customers.\nWe continue to monitor the direct and indirect impacts of these global macroeconomic or other geopolitical factors. If the economic uncertainty continues, we may experience negative impacts on customer renewals, customer collections, sales and marketing efforts, customer deployments, product development, or other financial metrics. Additional broader implications of these events on our business, results of operations, and overall financial position still remain uncertain and could result in further adverse impacts to our reported results. For further discussion of the potential impacts of global macroeconomic conditions on our business, please see Part 1, Item III and “Risk Factors” in Part II, Item 1A below.\nCRITICAL ACCOUNTING ESTIMATES\nThe preparation of our Condensed Consolidated Financial Statements and related notes in accordance with generally accepted accounting principles in the U.S. requires us to make estimates, including judgments and assumptions that affect the\nreported amounts of assets, liabilities, revenue and expenses, and related disclosure of contingent assets and liabilities. We have based our estimates, judgments and assumptions on historical experience and on various other factors we believe to be reasonable under the circumstances. We evaluate our estimates, judgments and assumptions on a regular basis and make changes accordingly. Management believes that the accounting estimates employed and the resulting amounts are reasonable; however, actual results may differ from these estimates. Making estimates, judgments and assumptions about future events is inherently unpredictable and is subject to significant uncertainties, some of which are beyond our control. Should any of these estimates, judgments or assumptions change or prove to have been incorrect, it could have a material impact on our results of operations, financial position and cash flows.\nRESULTS OF OPERATIONS\nThe following table sets forth our Condensed Consolidated Statements of Operations data as a percentage of net revenues for the periods indicated:\nResearch and development\nGeneral and administrative\nAmortization of intangible assets\nRestructuring and other costs\nTotal operating expenses\nOperating income (loss)\nOther income (expense), net\nIncome (loss) before income taxes\nIncome tax expense (benefit)\nNote: Percentages may not add due to rounding.\n(In millions, except for percentages)\nThree Months Ended October 3, 2025 Compared with Three Months Ended September 27, 2024\nNet revenues increased $246 million, due to a $25 million increase in sales of our Cyber Safety Platform products and a $221 million increase in sales of our Trust-Based Solutions, including a $202 million increase in Trust-Based Solutions due to the acquisition of MoneyLion.\nSix Months Ended October 3, 2025 Compared with Six Months Ended September 27, 2024\nNet revenues increased $538 million, due to a $114 million increase in sales of our Cyber Safety Platform products and a $424 million increase in sales of our Trust-Based Solutions, including a $370 million increase in Trust-Based Solutions due to the acquisition of MoneyLion. Net revenues also increased $87 million due to the favorable impact from the additional week in the first quarter of fiscal 2026, impacting both segment financials. Specifically, the additional week contributed $56 million to our Cyber Safety Platform and $31 million to Trust-Based Solutions.\nWe regularly monitor a number of metrics in order to measure our current performance and estimate our future performance. We believe these key operating metrics are useful to investors because management uses these metrics to assess the growth of\nour business and the effectiveness of our marketing and operational strategies. Our metrics may be calculated in a manner different than similar metrics used by other companies.\nThe following table summarizes supplemental key performance metrics:\nCyber Safety Platform\nTrust-Based Solutions\nTotal paid custome"
}