{
  "source_file": "gev-20241231.htm",
  "form_type": "10-K",
  "item1_clean": "SUMMARY OF RISK FACTORS\nAn investment in our company is subject to a number of risks. These risks relate to our business and strategy, industry dynamics, laws and\nregulations, the Spin-Off, our common stock, and the securities market. Any of these risks and other risks as more fully described below\nresults of operations, cash flows, financial condition, and the actual outcome of matters as to which forward-looking statements are made in\nWe provide complex and specialized products, solutions, and services, and we could be adversely affected by actual or perceived\nquality issues or safety failures.\nIf our ongoing efforts to achieve our anticipated operational cost savings and implement initiatives to control or reduce our\noperating costs are not successful, our financial results and cash flows may be adversely affected.\nSignificant disruptions in our supply chain, including the high cost or unavailability of raw materials, components, and products\nessential to our business, and significant disruptions to our manufacturing and production facilities and distribution networks could\nadversely affect our future financial results and our ability to execute our operations on a timely basis.\nOur failure to manage customer relationships and customer contracts could adversely affect our financial results.\nOur ability to maintain our investment grade credit ratings could affect our ability to access capital, could increase our interest\nrates, and could limit our ability to secure new contracts or business opportunities.\nThe strategic priorities and financial performance of many of our businesses are subject to market and other dynamics related to\ndecarbonization, which can pose risks in addition to opportunities.\nPolicies may alter the demand mix for our products in unfavorable ways, and any reductions or the elimination of governmental\nincentives or policies that support renewable energy could have a material adverse effect on our business, results of operations,\ncash flows, financial condition, and prospects.\nOur business is exposed to risks associated with the volatile global economic environment and geopolitical conditions.\nWe operate in highly competitive environments. Our failure to compete successfully could adversely affect our results of\noperations, cash flows, and financial condition.\nOur business strategy may include acquisitions, investments, joint ventures,\ndivestitures to support our growth\nand financial performance, and our failure to successfully execute these transactions could adversely affect our business.\nThere are risks associated with our joint venture arrangements, consortiums, and similar collaborations with third parties for\ncertain projects, which could impose additional costs and obligations on\nOur future success will depend, in part, on our ability to develop and introduce new technologies.\nFailure to meet ESG (including sustainability) expectations or standards or achieve our ESG goals could adversely affect our\nbusiness, results of operations, cash flows, and financial condition.\nOur operations are subject to various EHS laws and regulations, and potential litigation, and non-compliance with, or liabilities\nunder, such laws and regulations could result in substantial costs, fines, sanctions, claims, additional regulatory oversight,\nsuspension of operations, and reputational harm.\nWe are subject to laws and regulations governing government contracts, public procurement, and government reimbursements in\nmany jurisdictions, and the failure to comply could adversely affect our business.\nIf we are unable to attract and retain highly qualified personnel, we may not be able to execute our business strategy effectively\nand our operations and financial results could be adversely affected.\nWe may be unable to obtain, maintain, protect, or effectively enforce our IP rights.\nIncreased cybersecurity requirements, vulnerabilities, threats, and more sophisticated and targeted computer crimes pose a risk to\nour systems, networks, products, solutions, services, and data, as well as our reputation, which could adversely affect our\nFailure to comply with evolving data privacy and data protection laws and regulations or to otherwise protect personal information\nin the jurisdictions in which we operate, may adversely impact our business and financial results.\nVolatility in currency exchange rates may adversely affect our financial condition, results of operations, and cash flows.\nWe may be unable to achieve some or all of the benefits that we expect to achieve from the Spin-Off.\nOur stock price may fluctuate significantly.\nVernova and GE Vernova’s common stock. The risks and uncertainties described below are not the only risks and uncertainties we face.\nAdditional risks and uncertainties not presently known to us or that we presently deem less significant may also adversely affect our\nRisks Relating to Our Business and Our Industry\nRisks Relating to Operations and Supply Chain\nWe provide complex and specialized products, solutions, and services, and we could be adversely affected by actual or\nperceived quality issues or safety failures.\nWe produce highly sophisticated and leading-edge products and provide specialized\nsolutions and services for complex technology and engineered products and projects, including both products and software. Many of our\nproducts, solutions, and services involve complex industrial machinery or infrastructure projects, such as gas turbines, onshore and\noffshore wind turbines, grid infrastructure, or nuclear power generation. A serious product or execution failure could result in a range of\nadverse outcomes, including injuries or death, widespread power outages, suspension of power production, installation or fleet delivery\ndelays, environmental impacts, or similar systemic issues and could have a material adverse effect on our business, reputation, financial\nposition, cash flows, and results of operations. Actual or perceived design, production, performance, or other quality issues related to new\nproduct introductions or existing product lines have resulted and can result in direct warranty, maintenance, and other claims for damages,\nincluding costs associated with project delays, repairs, or replacements, some of which have been and can in the future be for significant\namounts. For example, during the summer of 2024, a wind turbine blade event occurred, related to a manufacturing deviation, at the\nVineyard Wind offshore wind farm where we are the manufacturer and supplier of our newly developed Haliade-X 220m wind turbines\nde-X). See Item 7. \"Management's Discussion and Analysis of Financial Condition and Results of Operations — Offshore Wind\" for\nadditional information.\nQuality issues can also result in reputational harm to our business with a potential loss of attractiveness of our\nproducts, solutions, and services to new and existing customers. A widespread fleet issue could result in revenue loss while the associated\nproduct is suspended from operation. This risk is pronounced in connection with the introduction of new technology. For example, due to\nthe difficulties associated with scaling up production of new products and components, the challenges of servicing our substantial installed\nfleet of onshore wind turbines and the difficulties of servicing our offshore wind turbines, a widespread fleet product quality issue with our\nwind turbines could cause us to incur substantial costs and could take significant time to address. Additionally, many of our products,\nsolutions, and services function under demanding operating conditions and meet exacting certification, performance, and reliability\nstandards that we, our customers, or regulators adopt. Developing and maintaining products, solutions, and services that meet or exceed\nthese standards can be costly and technologically challenging and require extensive coordination of our suppliers and team members at\nour technology, manufacturing, and remote project sites in both developed and developing markets around the world. Failures to deliver\nproducts, solutions, and services that meet these standards, whether actual or perceived, have resulted and may in the future result in\ncustomers or other third parties asserting contractual or other claims, often for significant amounts, or regulators suspending installation or\noperations, which could have significant adverse financial, competitive, or reputational effects.\nOur products contain and are integrated with products from third parties. From time to time, the processes used to ensure the quality of\nthose third-party products may fail to detect defects. Despite the operational processes around product design, manufacture, performance,\nand servicing that we and our customers or other third parties have developed to meet rigorous quality standards, the risk of operational\nprocess or product failures and other problems cannot be eliminated. Such problems could result in increased costs, delayed payments,\nlost products or services revenue, and product, safety, quality, regulatory, or environmental risks, which could have an adverse effect on our\nIf our ongoing efforts to achieve our anticipated operational cost savings and implement initiatives to control or reduce our\noperating costs are not successful, our financial results and cash flows may be adversely affected.\nAchieving our long-term\nfinancial results and cash flow goals depends significantly on our ability to control and/ or reduce our operating costs. Generally, because\nmany of our costs are affected by factors completely, or substantially outside our control, we must seek to control or reduce costs through\nproductivity initiatives. We seek continued cost savings through lean operations and supply chain management. While controlling our cost\nbase is important for our business and future competitiveness, there is no guarantee that we will achieve this goal. Additionally, cost\nsavings anticipated by us are based on estimates and assumptions that are inherently uncertain and may be subject to significant business,\neconomic and competitive uncertainties, and contingencies, all of which are difficult to predict and may be beyond our control. For example,\nthe rapid pace of innovation among onshore and offshore wind turbine manufacturers in recent years has led to short product cycles, early\nmarket introductions, and faster time to market, all of which have and can lead to quality and execution issues, higher costs, or other\nchallenges to achieving profitability for new products. Such risks are especially acute in the offshore wind industry, which is a nascent\nindustry, with higher ramp up costs and the potential for new product introductions to result in losses both in the short-and in the long-run.\nSee Item 7. \"Management's Discussion and Analysis of Financial Condition and Results of Operations — Offshore Wind\" for a description\nof recent quality and execution issues we have experienced at our Offshore Wind projects. If we are not able to identify and implement\ninitiatives that control and/or reduce costs and increase operating efficiency, or if the cost savings initiatives we have implemented to date\ndo not generate expected cost savings, our financial results could be adversely affected.\nWe enter into long-term service agreements in connection with significant contracts for the sale of products, particularly in our Gas Power\nbusiness unit. In connection with these agreements, we estimate our products’ durability and reliability, as well as our costs associated with\ndelivering the products and the provision of services over time in order to be profitable and generate acceptable returns on our investments.\nParticularly for our long-cycle businesses and contracts like these, a failure to appropriately estimate, plan for, or execute our business\nplans may adversely affect our delivery of products, services, and outcomes in line with our projected financial performance or cost\nestimates, and ultimate",
  "item7_clean": "organically*, primarily driven by higher volume, price, and productivity.\n*Non-GAAP Financial Measure\nOTHER INFORMATION\nGross Profit and Gross Margin.\nand gross margin was\nfor the years ended De\ncember 31, 2024, 2023, and 2022, respectively. The increase in gross profit in 2024 was due to an increase\nat Power due to Gas Power Services driven from volume, mix, productivity, and price, which more than offset inflation; an increase at\nElectrification due to higher volume, price, and cost productivity at Grid Solutions and Electrification\n; and an increase at Wind, due\nto Onshore Wind through improved pricing, volume, market selectivity, and the impact of cost reduction activities, and a gain recorded on\nthe settlement of a previously canceled project at Offshore Wind, partially offset by incremental contract losses at Offshore Wind.\nSelling, General, and Administrative.\nS\nelling, general, and administrative costs were\nof revenues for the years ended December 31, 2024, 2023, and 2022, respectively. The decrease in\ncosts in 2024 was primarily attributable to a $0.3 billion arbitration refund received in the second quarter of 2024 and cost reduction\ninitiatives, partially offset by higher corporate costs required to operate as a stand-alone public company and separation costs.\nRestructuring and Other Charges.\nWe continuously evaluate our cost structure and are implementing several restructuring and process\ntransformation actions\nconsidered necessary\nto simplify our organizational structure. In addition, in connection with the Spin-Off, we\nincurred and will continue to incur certain one-time separation costs and recognized a benefit related to deferred intercompany profit upon\nGE retaining the renewable energy U.S. tax equity investments. See Note\nin the Notes to the consolidated and combined financial\nstatements for further information.\nResearch and Development (R&D).\n\n, respectively. See Note\nin the Notes to the consolidated and combined financial state\nments for further information.\nORGANIC REVENUES (NON-GAAP)\nV%\nTotal revenues (GAAP)\nLess: Business dispositions\nLess: Foreign currency effect\nOrganic revenues (Non-GAAP)\nEQUIPMENT AND SERVICES ORGANIC REVENUES (NON-GAAP)\nV%\nTotal equipment revenues (GAAP)\nLess: Business dispositions\nLess: Foreign currency effect\nEquipment organic revenues (Non-GAAP)\nTotal services revenues (GAAP)\nLess: Business dispositions\nLess: Foreign currency effect\nServices organic revenues (Non-GAAP)\nWe believe that Adjusted EBITDA* and Adjusted EBITDA margin*, which are adjusted to exclude the effects of unique and/or non-cash\nitems that are not closely associated with ongoing operations, provide management and investors with meaningful measures of our\nperformance that increase the period-to-period comparability by highlighting the results from ongoing operations and the underlying\nprofitability factors. We believe Adjusted organic EBITDA* and Adjusted organic EBITDA margin* provide management and investors with,\nwhen considered with Adjusted EBITDA* and Adjusted EBITDA margin*, a more complete understanding of underlying operating results\nand trends of established, ongoing operations by further excluding the effect of acquisitions, dispositions, and foreign currency, which\nincludes translational and transactional impacts, as these activities can obscure underlying trends. We believe these measures provide\nadditional insight into how our businesses are performing on a normalized basis. However, Adjusted EBITDA*, Adjusted organic EBITDA*,\n*Non-GAAP Financial Measure\nAdjusted EBITDA margin* and Adjusted organic EBITDA margin* should not be construed as inferring that our future results will be\nunaffected by the items for which the measures adjust.\nADJUSTED EBITDA AND ADJUSTED EBITDA MARGIN (NON-GAAP)\nV%\nNet income (loss) (GAAP)\nF\nAdd: Restructuring and other charges(a)\nAdd: Steam Power asset sale impairment\nAdd: Purchases and sales of business interests(b)\nAdd: Russia and Ukraine charges(c)\nAdd: Separation costs (benefits)(d)\nAdd: Arbitration refund(e)\nAdd: Non-operating benefit income(f)\nAdd: Depreciation and amortization(g)\nAdd: Interest and other financial charges – net(h)(i)\nAdd: Provision (benefit) for income taxes(i)\nAdjusted EBITDA (Non-GAAP)\nF\nNet income (loss) margin (GAAP)\nAdjusted EBITDA margin (Non-GAAP)\n(a) Consists of severance, facility closures, acquisition and disposition, and other charges associated with major restructuring programs.\n(b) Consists of gains and losses resulting from the purchases and sales of business interests and assets.\n(c) Related to recoverability of asset charges recorded in connection with the ongoing conflict between Russia and Ukraine and resulting\nsanctions primarily related to our Power business.\n(d) Costs incurred in the Spin-Off and separation from GE, including system implementations, advisory fees, one-time stock option grant,\nand other one-time costs. I\nn addition, includes\nbenefit related to deferred intercompany profit that was recognized upon\nGE retaining the renewable energy U.S. tax equity\nvestments at the time of the Spin-Off in the second quarter of 2024.\n(e) Represents cash refund received in connection with an arbitration proceeding, constituting the payments previously made to a\nmultiemployer pension plan, and excludes\nrelated to the interest on such amounts that was recorded in Interest and other\nfinancial charges – net in the second quarter of 2024.\n(f) Primarily related to the expected return on plan assets, partially offset by interest cost.\n(g) Excludes depreciation and amortization expense related to Restructuring and other charges. Includes amortization of basis differences\nincluded in Equity method investment income (loss) which is part of Other income (expense) - net.\n(h) Consists of interest and other financial charges, net of interest income, other than financial interest related to our normal business\noperations primarily with customers.\n(i) Excludes interest expense (income) of\n\nOn July 13, 2024, a wind turbine blade event occurred, related to a manufacturing deviation, at the Vineyard Wind\noffshore wind farm where we are the manufacturer and supplier of our newly developed Haliade-X 220m wind turbines (Haliade-X). On July\nBSEE\nissued a suspension order to cease power production and the installation of new wind turbines at the project site. On\nAugust 10, 2024, BSEE issued a superseding order allowing us to resume the installation of towers and nacelles, subject to certain\nconditions. On October 22, 2024, BSEE issued another superseding order allowing us to resume the installation of new blades, subject to\ncertain conditions. In December, the first new blade set was installed, and commercial power production by that turbine commenced. On\nJanuary 17, 2025, BSEE terminated its suspension order. Going forward, the installation of new blades and the production of power are\nsubject to specified conditions and we will be required to remove blades previously installed. In addition to the blade event at the Vineyard\nWind offshore wind farm, there have been blade events in prior quarters related to commissioning and installation at the Dogger Bank\nAs we work through these issues, we are gaining experience across our Haliade-X backlog related to installation timelines, including vessel\navailability, manufacturing and quality control processes, and various other project activities. Based on this experience, we are developing\nand implementing our remediation plans, which includes updates to our project timelines to account for the slower pace of execution.\nAs a result of the above, we recorded incremental contract losses of approximately $0.9 billion in the third and fourth quarters for both\nprojects which include the estimated impact of changes in execution timelines, project-related commercial liabilities, costs to remediate\nquality issues including the removal of previously installed blades at the Vineyard Wind project, and additional project-related supply chain\nand manufacturing costs. Additional changes or other developments could have an adverse effect on our cash collection timelines and\ncontract margins and could result in further losses, which could be material.\nIn addition, on September 12, 2024, we entered into a settlement agreement regarding a project that was previously canceled by a\ncustomer resulting in a gain of approximately $0.3 billion in the third quarter, which was recorded as $0.5 billion in revenues and $0.2 billion\nin cost of sales. The settlement included recovery of costs previously incurred on the canceled project.\nRESULTS OF OPERATIONS\n\nincreased at Electrification\nand Power, partially offset by Wind.\nEARNINGS (LOSS)\nOperating income (loss)\nNet income (loss) attributable to GE Vernova\nDiluted earnings (loss) per share(a)\nThe computation of earnings (loss) per share for all periods through\nwas calculated using\nwere issued upon Spin-Off and excludes Net loss (income) attributable to noncontrolling interests. For periods prior to the Spin-Off, the\nCompany participated in various GE stock-based compensation plans. For periods prior to the Spin-Off, there were no dilutive equity\ninstruments as there were no equity awards of GE Vernova outstanding prior to Spin-Off.\noperating income (loss) was\nincrease, primarily due to: an increase in\nsegment results at Power of\n, primarily attributable to Gas Power, where higher volume, favorable pricing, and increased\nproductivity more than offset the impact of inflation; at Electrification of\n, primarily due to higher volume, price, and productivity;\n, primarily at Onshore Wind as a result of improved pricing, market selectivity, and the impact of cost reduction\nactivities, and a gain recorded on the settlement of a previously canceled project at Offshore Wind, which was partially offset by\nincremental contract losses at Offshore Wind; as well as $0.3 billion re\nceived related to an arbitration refund and a $0.1 billion benefit\nrelated to deferred intercompany profit that was recognized upon GE retaining the renewable energy U.S. tax equity investments in\nconnection with the Spin-Off in the second quarter; partially offset by higher corporate costs required to operate as a stand-alone public\ncompany and separation costs.\nNet income (loss) and Net income (loss) margin were\n\nWe have long-term service agreements with our customers within our Power and Wind\nsegments that require us to maintain the customers’ assets over the contract terms, which generally range from 5 to 25 years.\nWithin Power, these long-term service agreements, which we refer to as contractual service agreements, generally include\nmaintenance associated with major outage events and revenues are recognized as we perform under the arrangements using the\npercentage of completion method, which is based on costs incurred relative to our estimate of total expected costs. This requires us to\nmake estimates of customer payments expected to be received over the contract term as well as the costs to perform required\nmaintenance services.\nCustomers generally pay us based on the utilization of the asset (per hour of usage for example) or upon the occurrence of a major\nmaintenance event within the contract. As a result, a significant estimate in determining expected revenues of a contract is estimating how\ncustomers will utilize their assets over the term of the agreement. The estimate of utilization, which can change over the contract life,\nimpacts both the amount of customer payments we expect to receive and our estimate of future contract costs. Customers’ asset utilization\nwill influence the timing and extent of maintenance events over the life of the contract. We generally use historical utilization trends in\ndeveloping our revenue estimates. To develop our cost estimates, we consider the timing and extent of future maintenance events,\nincluding the amount and cost of labor, spare parts and other resources required to perform the services.\nWe routinely review estimates under long-term service agreements and regularly revise them to adjust for changes in outlook. These\nrevisions are based on objectively verifiable information that is available at the time of the review. Contract modifications that change the\nrights and obligations, as well as the nature, timing and extent of future cash flows, are evaluated for potential price concessions, contract\nasset impairments and significant financing to determine if adjustments of earnings are required before effectively accounting for a modified\ncontract as a new contract.\nWe regularly assess expected billings adjustments and customer credit risk inherent in the carrying amounts of receivables and contract\nassets, including the risk that contractual penalties may not be sufficient to offset our accumulated investment in the event of customer\ntermination. We gain insight into future utilization and cost trends, as well as credit risk, through our knowledge of the installed base of\nequipment and close interaction with our customers that comes with supplying critical services and parts over extended periods. Revisions\nmay affect a long-term services agreement’s total estimated profitability resulting in an adjustment of earnings.\nAs of December 31, 2024, our net long-term service agreements balance of $3.5 billion represents approximately 5% of our total estimated\nlife of contract billings. Our contracts (on average) are approximately 29% complete based on costs incurred to date and our estimate of\nfuture costs. Revisions to our estimates of future billings or costs that increase or decrease total estimated contract profitability by one\npercentage point would increase or decrease the long-term service agreements contract assets balance by $0.2 billion. Billings on these\ncontracts were $5.0 billion during both the years ended December 31, 2024 and 2023. See Notes\nin the Notes to the consolidated\nand combined financial statements for further information.\nThe equipment within our Wind segment generally does not require major planned outages and revenues associated with service\nagreements are recognized on a straight-line basis consistent with the nature, timing and extent of these arrangements, which generally\ninclude planned and unplanned maintenance and may also include performance guarantees of the wind farm’s availability to operate under\nadequate wind conditions. Availability is typically measured across the wind farm over a reference period of one year. Any forecasted\nshortfalls that may result in a payment to a customer are recorded as a reduction of revenues, while additional revenues are recognized\nwhen availability exceeds the contractual targets. During the\nhe reduction of revenues\nfrom availability shortfalls was $0.3 billion, $0.3 billion and $0.1 billion, respectively. A further 1% reduction in availability across the entire\nfleet would have resulted in an additional revenue reduction of less than $0.1 billion.\nRevenue Recognition on Equipment on an Over-Time Basis.\n\nWe have agreements for the sale of customized goods, including power\ngeneration equipment such as gas and certain wind turbines. We recognize revenues as we perform under the arrangements using the\npercentage of completion method, which is based on our costs incurred to date relative to our estimate of total expected costs. This\nrequires us to make estimates of customer payments expected to be received over the contract term as well as the costs to complete the\nproject. In addition, variable consideration is included in the transaction price if, in our judgment, it is expected that a significant future\nreversal of cumulative revenue under the contract will not occur. Some of our contracts with customers for the sale of equipment contain\nclauses for liquidated damages related to milestones established for on-time delivery or meeting certain product specifications. On an\nongoing basis, we evaluate the probability and magnitude of having to pay liquidated damages. This is factored into our ",
  "item2_clean": null
}