{
  "source_file": "gev-20250930.htm",
  "form_type": "10-Q",
  "item1_clean": null,
  "item7_clean": null,
  "item2_clean": "We believe our performance and future success depends on a number of\nfactors that present significant opportunities for us but also pose risks and challenges, including those discussed below.\nOur worldwide operations are affected by regional and global factors impacting energy demand, including industry trends like\ndecarbonization, an increasing demand for renewable energy alternatives, governmental regulations and policies, and changes in broader\neconomic and geopolitical conditions. These trends, along with the growing focus on the digitization and sustainability of the electricity\ninfrastructure, can impact performance across each of our business segments. We believe that our industry-defining technologies and\ncommitment to innovation position us well to capitalize on, as well as mitigate adverse impacts from, these long-term trends:\nDemand growth for electricity generation\n– Significant investment, infrastructure, and supply diversity will be essential to help meet\nforecasted energy demand growth arising from population and global economic growth.\n– The urgency to combat climate change is fueling technology advancements that improve the economic viability and\nefficiency of renewable energy alternatives and facilitate the transition to a more sustainable power sector.\nEvolving generation mix\n– The power industry is shifting from coal generation to more electricity generated from zero- or low-carbon\nenergy sources, and an evolving balance of generation sources will be necessary to maintain a reliable, resilient, and affordable\nEnergy resilience & security\n– Threats and challenges from extreme weather events, cyber-attacks, and geopolitical tensions have\nincreased focus on the strength and resilience of power generation and transmission and reinforced the need for a diversified mix of\nGrid modernization and investment\n– Increased demand and the integration of advanced generation and storage solutions drive the\nneed to update aging infrastructure with new grid integration and automation solutions.\nRegulatory and policy changes\n– Government policies and regulations, such as carbon pricing, renewable energy mandates, and\nsubsidies for renewable energy technologies, can significantly impact the power generation landscape. Staying ahead of regulatory\nchanges and adapting to new compliance requirements is crucial for maintaining a competitive advantage.\nFinancial and investment dynamics\n– Access to capital and investment trends in the energy sector can influence the development and\ndeployment of new power generation projects. Understanding market dynamics and securing funding are key to progressing strategic\nRESULTS OF OPERATIONS\n\nin 2025; the nonrecurrence of proceeds from the\nsale of an approximately 16% equity interest in GE Vernova T&D India Ltd. in the third quarter of 2024 of $0.7 billion; and dividends paid of\n$0.2 billion in 2025\nMaterial Cash Requirements.\nIn the normal course of business, we enter into contracts and commitments that oblige us to make\npayments in the future. See Notes\nin the Notes to the consolidated and combined financial statements for further information\nregarding our obligations under lease and guarantee arrangements as well as our investment commitments. See Note\nthe consolidated and combined financial statements for further information regarding material cash requirements related to our pension\nTotal debt, excluding finance leases, was less than\nRevolving Credit Facility to fund near-term intra-quarter working capital needs as they arise. In addition,\ncommitted trade finance facility (Trade Finance Facility, and together with the Revolving Credit Facility, the Credit\nFacilities). The Trade Finance Facility has not been and is not expected to be utilized, and does not contribute to direct liquidity. We believe\nthat our financing arrangements, future cash from operations, and access to capital markets will provide adequate resources to fund our\nfuture cash flow needs. For more information about the Credit Facilities, refer to our Current Report on Form 8-K, filed with the SEC on April\n2, 2024, and see Note\nin the Notes to the consolidated and combined financial statements.\nCredit Ratings and Conditions.\nWe have access to the Revolving Credit Facility to fund operations, and we may rely on debt capital\nmarkets in the future to further su\npport our liquidity needs. The cost and availability of any debt financing is influenced by our credit ratings\nand market conditions. Standard and Poor's Global Ratings (S&P) and Fitch Ratings (Fitch) have issued credit ratings for the Company. On\nMarch 12, 2025, Fitch affirmed GE Vernova Inc.'s long-term credit rating and revised its outlook to Positive from Stable. On May 23, 2025,\nS&P affirmed GE Vernova Inc.'s long-term credit rating and revised its outlook to Positive from Stable. Our credit ratings as of the date of\nthis filing are set forth in the following table.\nS&P\nBBB-\nBBB\n*Non-GAAP Financial Measure\nWe are disclosing our credit ratings to enhance understanding of our sources of liquidity and the effects of our ratings on our costs of funds\nand access to credit. Our ratings may be subject to a revision or withdrawal at any time by the assigning rating organization, and each\nrating should be evaluated independently of any other rating. See Item 1A. \"Risk Factors\nRisks Relating to Our Business and Our Industry\nRisks Relating to Operations and Supply Chain\" and Item 1A. \"Risk Factors\nRisks Relating to Financial, Accounting, and Tax Matters\" in\nreduction in our credit ratings.\nIf we are unable to maintain investment grade ratings, we could face significant challenges in being awarded new contracts, substantially\nincreasing financing and hedging costs, and refinancing risks as well as substantially decreasing the availability of credit. As of\n\nin the Notes to the consolidated and combined financial statements for further information.\nThree months ended September 30\nNine months ended September 30\nORGANIC REVENUES (NON-GAAP)\nV%\nV%\nTotal revenues (GAAP)\nLess: Business dispositions\nLess: Foreign currency effect\nOrganic revenues (Non-GAAP)\nEQUIPMENT AND SERVICES ORGANIC\nREVENUES (NON-GAAP)\nThree months ended September 30\nNine months ended September 30\nV%\nV%\nTotal equipment revenues (GAAP)\nLess: Business dispositions\nLess: Foreign currency effect\nEquipment organic revenues (Non-GAAP)\nTotal services revenues (GAAP)\nLess: Business dispositions\nLess: Foreign currency effect\nServices organic revenues (Non-GAAP)\nWe believe that Adjusted EBITDA* and Adjusted EBITDA margin*, which are adjusted to exclude the effects of unique and/or non-cash\nitems that are not closely associated with ongoing operations, provide management and investors with meaningful measures of our\nperformance that increase the period-to-period comparability by highlighting the results from ongoing operations and the underlying\nprofitability factors. We believe Adjusted organic EBITDA* and Adjusted organic EBITDA margin* provide management and investors with,\nwhen considered with Adjusted EBITDA* and Adjusted EBITDA margin*, a more complete understanding of underlying operating results\nand trends of established, ongoing operations by further excluding the effect of acquisitions, dispositions, and foreign currency, which\nincludes translational and transactional impacts, as these activities can obscure underlying trends. We believe these measures provide\nadditional insight into how our businesses are performing on a normalized basis. However, Adjusted EBITDA*, Adjusted organic EBITDA*,\nAdjusted EBITDA margin* and Adjusted organic EBITDA margin* should not be construed as inferring that our future results will be\nunaffected by the items for which the measures adjust.\nADJUSTED EBITDA AND ADJUSTED EBITDA MARGIN (NON-GAAP)\nThree months ended September 30\nNine months ended September 30\nV%\nV%\nNet income (loss) (GAAP)\nF\nAdd: Restructuring and other charges\nAdd: (Gains) losses on purchases and sales of business interests(a)\nAdd: Separation costs (benefits)(b)\nAdd: Arbitration refund(c)\nAdd: Non-operating benefit income\nAdd: Depreciation and amortization(d)\nAdd: Interest and other financial (income) charges – net(e)(f)\nAdd: Provision (benefit) for income taxes(f)\nAdjusted EBITDA (Non-GAAP)\nF\nF\nNet income (loss) margin (GAAP)\nAdjusted EBITDA margin (Non-GAAP)\n(a) Includes unrealized (gains) losses related to our interest in China XD Electric Co., Ltd, recorded in Net interest and investment\nincome (loss) which is part of Other income (expense) - net. See Note\nfor further information.\n(b) Costs incurred in the Spin-Off and separation from GE, including system implementations, advisory fees, one-time stock option\ngrant, and other one-time costs. In addition, 2024 includes $136 million benefit related to deferred intercompany profit that was\nrecognized upon GE retaining the renewable energy U.S. tax equity investments.\n(c) Represents a cash refund received related to an arbitration proceeding with a multiemployer pension plan and excludes $52 million\nrelated to the interest on such amounts that was recorded in Interest and other financial charges – net.\n(d) Excludes depreciation and amortization expense related to Restructuring and other charges. Includes amortization of basis\ndifferences included in Equity method investment income (loss) which is part of Other income (expense) - net.\n(e) Consists of interest and other financial charges, net of interest income, other than financial interest related to our normal business\noperations primarily with customers.\n(f) Excludes interest expense (income) of zero and\nand benefit (provision) for income taxes of zero and\n\nWe believe the organic measures presented below provide management and investors with a more complete understanding of underlying\noperating results and trends of established, ongoing operations by excluding the effect of acquisitions, dispositions, and foreign currency,\nwhich includes translational and transactional impacts, as these activities can "
}