{
  "source_file": "gild-20250930.htm",
  "form_type": "10-Q",
  "item1_clean": null,
  "item7_clean": null,
  "item2_clean": "Item 2. MANAGEMENT’S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS\nGilead Sciences, Inc. (including its consolidated subsidiaries, referred to as “Gilead,” the “company,” “we,” “our” or “us”) is a biopharmaceutical company that has pursued and achieved breakthroughs in medicine for more than three decades, with the goal of creating a healthier world for all people. We are committed to advancing innovative medicines to prevent and treat life-threatening diseases, including HIV, viral hepatitis, coronavirus disease 2019 (“COVID-19”), cancer and inflammation. We operate in more than 35 countries worldwide, with headquarters in Foster City, California.\nKey Business Updates\nAnnounced settlement agreements to resolve Biktarvy patent litigation with generic manufacturers Lupin Ltd., Cipla Ltd. and Laurus Labs Ltd. Under the agreements, the earliest date the three generic manufacturers can market a generic version of full dose Biktarvy in the U.S. is April 1, 2036, subject to standard acceleration provisions. This is more than two years later than our previous loss of exclusivity projection for Biktarvy (December 2033).\nReceived a strong recommendation for the use of twice-yearly injectable Yeztugo (lenacapavir) for HIV pre-exposure prophylaxis (“PrEP”) in the new U.S. Centers for Disease Control and Prevention guidelines.\nAnnounced a partnership with the U.S. State Department and the U.S. President’s Emergency Plan for AIDS Relief (“PEPFAR”) to deliver lenacapavir for HIV PrEP for up to two million people over three years in countries supported by both PEPFAR and the Global Fund.\nReceived European Commission (“EC”) marketing authorization for Yeytuo (lenacapavir) for use as PrEP to reduce the risk of sexually acquired HIV-1 in adults and adolescents with increased HIV-1 acquisition risk.\nReceived U.S. Food and Drug Administration (“FDA”) approval for Yeztugo (lenacapavir) for PrEP to reduce the risk of sexually acquired HIV in adults and adolescents weighing at least 35kg. Yeztugo is the first and only twice-yearly HIV PrEP option available in the U.S.\nAnnounced that FDA had placed a clinical hold on the HIV treatment trials of GS-1720 and/or GS-4182, including the WONDERS-1 and WONDERS-2 trials. These drug candidates are investigational and not approved anywhere globally.\nAnnounced that our Phase 3 ASCENT-07 study of Trodelvy evaluating sacituzumab govitecan-hziy (“SG”) as a first-line treatment post-endocrine therapy in hormone receptor-positive, human epidermal growth factor receptor 2-negative (“HR+/HER2-”) metastatic breast cancer patients did not meet the primary endpoint of progression-free survival. Overall survival is a key secondary endpoint and was not mature at the time of the primary analysis; however, an early trend was observed favoring patients treated with Trodelvy compared to chemotherapy.\nPresented Phase 3 ASCENT-03 data for Trodelvy in 1L metastatic triple-negative breast cancer (“mTNBC”) patients who are not candidates for PD-1/PD-L1 checkpoint inhibitors at the 2025 European Society for Medical Oncology Congress. Trodelvy is not approved in this setting.\nEntered into a collaboration with Shenzhen Pregene Biopharma Co., Ltd. (“Pregene”) to develop next-generation in vivo therapies.\nAnnounced the acquisition of Interius BioTherapeutics, Inc. (“Interius”), a privately held biotechnology company developing in vivo chimeric antigen receptor therapeutics, for approximately $350 million.\nPresented results from the Phase 3 ASCENT-04 trial evaluating Trodelvy plus Keytruda in 1L PD-L1+ mTNBC at the American Society of Clinical Oncology meeting. Trodelvy is not approved in this setting.\nEntered into an exclusive option and license agreement with Kymera Therapeutics, Inc. to develop novel oral molecular glue CDK2 degraders with broad oncology treatment potential.\nReceived conditional marketing authorization from the EC for seladelpar for the treatment of primary biliary cholangitis (“PBC”) in combination with ursodeoxycholic acid (“UDCA”) in adults who have an inadequate response to UDCA alone, or as monotherapy in those unable to tolerate UDCA.\nAnnounced ground-breaking on a new Pharmaceutical Development and Manufacturing Technical Development Center in Foster City, California as part of a planned $32 billion investment in the U.S. through 2030.\nKey Financial Results\nThe following table summarizes our key financial results for the period and period-over-period changes:\n(in millions, except percentages and per share amounts)\nNet income (loss) attributable to Gilead\nNM\nNM\nDiluted earnings (loss) per share attributable to Gilead\nNM\nNM\n_______________________________\nTotal revenues increased 3% to $7.8 billion for the three months ended September 30, 2025, compared to the same period in 2024, primarily due to higher royalty, contract and other revenues, as well as higher HIV and Liver Disease product sales, partially offset by lower Veklury and Cell Therapy product sales.\nTotal revenues increased 2% to $21.5 billion for the nine months ended September 30, 2025, compared to the same period in 2024, primarily due to higher HIV and Liver Disease product sales, as well as higher royalty, contract and other revenues. These increases were partially offset mainly by lower Veklury and Cell Therapy product sales.\nNet income attributable to Gilead was $3.1 billion and diluted earnings per share attributable to Gilead was $2.43 for the three months ended September 30, 2025, compared to net income attributable to Gilead of $1.3 billion and diluted earnings per share attributable to Gilead of $1.00 for the same period in 2024. The increase was primarily due to:\nA pre-tax in-process research and development (“IPR&D”) partial impairment charge of $1.8 billion during the three months ended September 30, 2024 related to assets acquired by Gilead from Immunomedics, Inc. (“Immunomedics”), which did not repeat in the current period;\nHigher royalty, contract and other revenues;\nLower acquired IPR&D expenses; and\nHigher net unrealized gains on equity securities; partially offset by\nHigher income tax expense.\nNet income attributable to Gilead was $6.3 billion and diluted earnings per share attributable to Gilead was $5.04 for the nine months ended September 30, 2025, compared to net loss attributable to Gilead of $1.3 billion and diluted loss per share attributable to Gilead of $1.04 for the same period in 2024. The increase was primarily due to:\nLower pre-tax IPR&D partial impairment charges, with $190 million during the nine months ended September 30, 2025 related to assets acquired from MYR GmbH (“MYR”) compared to $4.2 billion during the nine months ended September 30, 2024 related to assets acquired from Immunomedics;\nA $3.9 billion acquired IPR&D expense related to the acquisition of CymaBay Therapeutics, Inc. (“CymaBay”) during the three months ended March 31, 2024, which did not repeat in the current period;\nHigher royalty, contract and other revenues; and\nHigher net unrealized gains on equity securities; partially offset by\nHigher income tax expense.\nPlease refer to “Results of Operations” below for further information on results for the three and nine months ended September 30, 2025.\nResults of Operations\nThe following table summarizes our Total revenues and period-over-period changes:\nThree Months Ended September 30, 2025\nThree Months Ended September 30, 2024\n(in millions, except percentages)\nU.S.\nU.S.\nHIV\nSymtuza - Revenue share\nSofosbuvir/Velpatasvir\nRoyalty, contract and other revenues\nNM\nNine Months Ended September 30, 2025\nNine Months Ended September 30, 2024\nU.S.\nU.S.\nHIV\nSymtuza - Revenue share\nSofosbuvir/Velpatasvir\nRoyalty, contract and other revenues\nNM\n_______________________________\nRepresents our revenue from cobicistat (“C”), emtricitabine (“FTC”) and tenofovir alafenamide (“TAF”) in Symtuza (darunavir/C/FTC/TAF), a fixed dose combination product commercialized by Janssen Sciences Ireland Unlimited Company.\nIncludes Atripla, Complera/Eviplera, Emtriva, Stribild, Sunlenca, Truvada, Tybost and Yeztugo/Yeytuo.\nIncludes Epclusa and the authorized generic version of Epclusa sold by Gilead’s separate subsidiary, Asegua Therapeutics LLC (“Asegua”).\nIncludes ledipasvir/sofosbuvir (Harvoni and the authorized generic version of Harvoni sold by Asegua), Hepcludex, Hepsera, Livdelzi/Lyvdelzi, Sovaldi, Viread and Vosevi.\nIncludes Cayston, Jyseleca, Letairis and Zydelig.\nHIV\nHIV product sales increased 4% to $5.3 billion for the three months ended September 30, 2025, compared to the same period in 2024, primarily due to higher demand and favorable inventory dynamics, partially offset by lower average realized price driven by the U.S. Medicare Part D program redesign impact. In particular:\nBiktarvy sales increased 6% primarily due to higher demand, including patients switching from Genvoya and other Gilead HIV products, and favorable inventory dynamics, partially offset by lower average realized price; and\nDescovy sales increased 20% primarily due to higher demand.\nHIV product sales increased 6% to $15.0 billion for the nine months ended September 30, 2025, compared to the same period in 2024, primarily due to higher demand, with average realized price being relatively flat despite the U.S. Medicare Part D program redesign impact. In particular:\nBiktarvy sales increased 7% primarily due to higher demand, including patients switching from Genvoya and other Gilead HIV products, partially offset by lower average realized price; and\nDescovy sales increased 30% primarily due to higher demand and higher average realized price.\nLiver Disease product sales increased 12% to $819 million for the three months ended September 30, 2025, compared to the same period in 2024, primarily due to higher demand for Livdelzi and chronic hepatitis B virus (“HBV”) products, partially offset by lower average realized price for chronic hepatitis C virus (“HCV”) products, inclusive of the U.S. Medicare Part D program re"
}