{
  "source_file": "gild-20241231.htm",
  "form_type": "10-K",
  "item1_clean": "anitocabtagene autoleucel, a CAR T-cell therapy, is being evaluated in patients with relapsed and/or refractory multiple myeloma who have received one to three prior lines of therapy.\nSacituzumab govitecan-hziy\nIn breast cancer, sacituzumab govitecan-hziy is being evaluated as (i) a first-line treatment for PD-L1 negative metastatic TNBC and (ii) HR+/HER2- chemo-naive metastatic breast cancer. In collaboration with Merck, it is also being evaluated in combination with Merck’s pembrolizumab as (i) a first-line treatment for PD-L1 positive metastatic TNBC and (ii) an adjuvant treatment for early TNBC.\nIn lung and thoracic cancer, sacituzumab govitecan-hziy is being evaluated in combination with Merck’s pembrolizumab as a first-line treatment for PD-L1 positive non-small cell lung cancer (“NSCLC”).\nIn gynecology, sacituzumab govitecan-hziy is being evaluated as a second-line treatment for metastatic endometrial cancer.\nDomvanalimab and zimberelimab\nIn collaboration with Arcus Biosciences, Inc. (“Arcus”)\n, the combination of zimberelimab, an anti-PD-1 monoclonal antibody, and domvanalimab, an Fc-silent anti-TIGIT antibody, with chemotherapy is being evaluated as (i) a first-line treatment for NSCLC and (ii) a first-line treatment for upper gastrointestinal tract cancer.\n_______________________________\nIn 2024, we also received regulatory approvals or authorizations from FDA for new products and expanded indications of our products, including:\nRegulatory Approval or Authorization\nFDA granted accelerated approval of Livdelzi for the treatment of PBC in combination with UDCA in adults who have an inadequate response to UDCA, or as monotherapy in patients unable to tolerate UDCA. Accelerated approval was based primarily on data from the Phase 3 RESPONSE study, which achieved a reduction of alkaline phosphatase values, a cholestatic marker that is a predictor of risk for liver transplant and death.\nFDA granted Breakthrough Therapy designation to Trodelvy for the treatment of adult patients with extensive-stage small cell lung cancer whose disease has progressed on or after platinum-based chemotherapy. Breakthrough Therapy designation is designed to expedite the development and regulatory review of investigational treatments for serious or life-threatening conditions that, based on preliminary clinical evidence, have the potential to substantially improve clinical outcomes compared to available therapy. This is the second Breakthrough Therapy designation for Trodelvy.\nFDA approved an expanded indication for Biktarvy to treat people with HIV who have suppressed viral loads with known or suspected M184V/I resistance, a common form of treatment resistance. FDA also approved an updated label with additional data reinforcing the safety and efficacy profile of Biktarvy to treat pregnant people with HIV-1 with suppressed viral loads.\nFDA approved an expanded indication for Vemlidy as a once-daily treatment for chronic HBV infection in pediatric patients six years of age and older and weighing at least 25 kg with compensated liver disease.\nOur strategic business development activity reflects our commitment to focus on transformative science, build a sustainable and diverse portfolio and position ourselves for the near-, medium- and long-term growth of our business.\nPatents and Proprietary Rights\nU.S. and EU Patent Expiration\nWe have a number of U.S. and foreign patents, patent applications and rights to patents related to our compounds, products and technology. The following table shows the estimated expiration dates (including patent term extensions, supplementary protection certificates and/or pediatric exclusivity where granted) in the U.S. and the European Union (“EU”) for the primary (typically compound) patents for our key product candidates as described above. For our product candidates that are fixed-dose combinations of single-tablet regimens, the estimated patent expiration date provided corresponds to the latest expiring compound patent for one of the active ingredients in the single-tablet regimen.\nKey Product Candidates\nU.S.\nEU\nAxicabtagene ciloleucel\nAnitocabtagene autoleucel\nSacituzumab govitecan-hziy\n_______________________________\nThe composition of matter patent has expired in the EU. In the EU and the U.S., patent applications are pending relating to our proprietary manufacturing processes.\nIn collaboration with Arcellx.\nRegulatory exclusivity in the U.S. expires in 2032.\nIn collaboration with Arcus.\nDates in parentheses reflect the estimated expiration date of patents that may be issued from currently pending applications.\nThe following table shows the actual or estimated expiration dates (including patent term extensions, supplementary protection certificates and/or pediatric exclusivity where granted) in the U.S. and the EU for the primary (typically compound) patents for our principal products. For our products that are fixed-dose combinations or single-tablet regimens, the estimated patent expiration dates provided correspond to the latest expiring compound patent for one of the active ingredients in the single-tablet regimen.\nU.S.\nEU\n_______________________________\nWhere applicable, settlement and license agreements with generic manufacturers relating to the patents that protect our principal products are noted. The nature and timing of loss of exclusivity for these products depends on a multitude of factors, and loss of exclusivity may be earlier under certain circumstances. For more information, see Item 1A. Risk Factors “Our success depends to a significant degree on our ability to obtain and defend our patents and other intellectual property rights both domestically and internationally, and to operate without infringing upon the patents or other proprietary rights of third parties.”\nIn September 2022, Gilead and five generic manufacturers (Lupin Ltd., Apotex Inc., Macleods Pharma Ltd., Hetero Labs Ltd., and Cipla Ltd.) reached agreements to settle the U.S. patent litigation concerning patents that protect TAF in our Descovy, Vemlidy and Odefsey products.\nThe composition of matter patent has expired in the EU. In the EU and the U.S., patent applications are pending relating to our proprietary manufacturing processes.\nIn 2018, Gilead and Mylan Pharmaceuticals reached an agreement to settle the patent litigation concerning patents that protect cobicistat in our Stribild and Genvoya products.\nIn February 2025, Gilead reached an agreement with one generic manufacturer (Apotex, Inc., together with Apotex Corp., and its manufacturer of cobicistat, MSN Laboratories Private Limited, MSN Life Sciences Private Ltd., and MSN Pharmaceuticals Inc.) to settle the patent litigation concerning certain patents that protect cobicistat on silicon dioxide and TAF in our Genvoya product. The Apotex/MSN agreement provides a non-exclusive license to those patents beginning on August 6, 2032, or earlier in certain circumstances.\nIn January 2024, FDA granted pediatric exclusivity for Veklury, which extends all non-expired exclusivities by six months, and which is reflected in the presently reported date.\nRegulatory exclusivity in the U.S. expires in 2032.\nOrphan exclusivity expires in 2031.\nTen years of regulatory/market exclusivity expected on approval.\nPatent and Trade Secret Strategy\nFor a discussion of risks and challenges associated with our patent and trade secret strategy described below, see Item 1A. Risk Factors “Our success depends to a significant degree on our ability to obtain and defend our patents and other intellectual property rights both domestically and internationally, and to operate without infringing upon the patents or other proprietary rights of third parties.”\nPatents and other proprietary rights are very important to our business. If we have a properly drafted and enforceable patent, it can be more difficult for our competitors to use our technology to create competitive products and more difficult for our competitors to obtain a patent that prevents us from using technology we create. As part of our business strategy, we actively seek patent protection both in the U.S. and internationally and file additional patent applications, when appropriate, to cover improvements in our compounds, products and technology.\nPatents covering certain of the active pharmaceutical ingredients (“API”) of some of our products are held by third parties. We acquired exclusive rights to these patents in the agreements we have with these parties.\nWe often obtain patents for certain products many years before marketing approval is obtained. As a result, the commercial value of the patent may be limited because the patent term is based on the date the patent application was filed, which may be prior to the regulatory approval and commercial sale of the related product. However, we also apply for patent term extensions or supplementary protection certificates in some countries. For example, extensions for the patents or supplementary protection certificates on many of our products have been granted in the U.S. and in a number of European countries, compensating in part for delays in obtaining marketing approval.\nWe also rely on unpatented trade secrets and improvements, unpatented internal know-how and technological innovation. For products manufactured by our third-party contract manufacturers, we have disclosed all necessary aspects of these technologies to enable them to manufacture the products for us. We protect these rights mainly through confidentiality agreements with third-party manufacturers, corporate partners, employees, consultants and vendors. These agreements provide that all confidential information developed or made known to an individual during the course of their relationship with us will be kept confidential and will not be used or disclosed to third parties except in specified circumstances. In the case of employees, the agreements provide that all inventions made by an individual while employed by us will be our exclusive property.\nRaw Materials and Manufacturing\nWe need access to certain raw materials to conduct our clinical trials and manufacture our products. These raw materials are generally available from multiple sources and normally available in quantities adequate to meet the needs of our business. We attempt to manage the risks associated with our supply chain through inventory management, relationship management and the evaluation of alternative sources when feasible.\nWe own or lease manufacturing facilities to manufacture and distribute certain products and API for clinical and/or commercial uses. As of the end of 2024, these facilities include:\nFoster City, California: We conduct process chemistry research, analytical method development and formulation and device development activities, and manufacture API and drug product for our clinical trials.\nLa Verne, California: We manufacture AmBisome and also package and label the majority of our commercial products for distribution to the Americas and the Pacific Rim. We also utilize the La Verne facility for clinical manufacturing of our sterile drug products.\nOceanside, California: We utilize the facility for commercial retroviral vector manufacturing and clinical manufacturing and process development of our biologics candidates.\nEl Segundo, California: We utilize the facility for clinical and commercial manufacturing and processing of our cell therapy products.\nSanta Monica, California: We utilize the facility for clinical manufacturing and processing of our cell therapy products.\nFrederick, Maryland: We utilize the facility for clinical and commercial manufacturing and processing of our cell therapy products.\nCork and Dublin, Ireland: We utilize the Cork facility for commercial manufacturing, packaging and labeling of our products. We also perform quality control testing, labeling, packaging and final release of many of our products at the Cork facility, which are distributed to the EU and other internat",
  "item7_clean": "Includes Atripla, Complera/Eviplera, Emtriva, Stribild, Sunlenca, Truvada and Tybost.\nIncludes Epclusa and the authorized generic version of Epclusa sold by Gilead’s separate subsidiary, Asegua Therapeutics LLC (“Asegua”).\nIncludes ledipasvir/sofosbuvir (Harvoni and the authorized generic version of Harvoni sold by Asegua), Hepcludex, Hepsera, Livdelzi, Sovaldi, Viread and Vosevi.\nIncludes Cayston, Jyseleca, Letairis, Ranexa and Zydelig.\nHIV\nHIV product sales increased 8% to $19.6 billion in 2024, compared to 2023, primarily due to higher demand and higher average realized price. In particular:\nBiktarvy sales increased primarily due to higher demand, including patients switching from Genvoya and other Gilead HIV products. To a lesser extent, the increase was also due to higher average realized price.\nDescovy sales increased primarily due to higher demand, partially offset by lower average realized price.\nLiver Disease product sales increased 9% to $3.0 billion in 2024, compared to 2023, primarily due to higher demand in products for chronic hepatitis C virus, HBV and, in Europe, chronic hepatitis delta virus, as well as the launch of Livdelzi for treatment of PBC.\nVeklury product sales decreased 18% to $1.8 billion in 2024, compared to 2023, primarily due to decreased rates of COVID-19-related hospitalizations.\nCell Therapy product sales increased 6% to $2.0 billion in 2024, compared to 2023, primarily due to increased demand outside the U.S. for Yescarta and Tecartus and higher average realized price, partially offset by lower demand in the U.S.\nTrodelvy product sales increased 24% to $1.3 billion in 2024, compared to 2023, primarily due to higher demand across all regions.\nGross-to-Net Deductions\nA substantial portion of our product sales is subject to significant discounts from list price, including government and commercial rebates and chargebacks, as well as other deductions, including patient co-pay assistance, cash discounts for prompt payment, distributor fees, and sales return provisions. These deductions to product sales are generally referred to as gross-to-net deductions and are primarily a function of product sales volume, product mix, contractual or statutory discounts and estimated payer mix.\nRebates and chargebacks are based on contractual arrangements or statutory requirements and include amounts due to payers and healthcare providers under various programs. These amounts may vary by product, payer and individual plans. Providers qualified under certain programs can purchase our products through wholesalers or other distributors at a discount. The wholesalers or distributors then charge the discount back to us.\nOther gross-to-net deductions include patient co-pay assistance, cash discounts for prompt payment, distributor fees that we pay under our inventory management agreements with our significant U.S. wholesalers and are based on contractually-determined fixed percentage of sales, and sales return provisions.\nOur gross-to-net deductions totaled $17.8 billion, or 38%, of gross product sales in 2024, compared to $16.4 billion, or 38%, of gross product sales in 2023. Of the $17.8 billion in 2024, $15.5 billion, or 33%, of gross product sales was related to rebates and chargebacks, and $2.3 billion, or 5%, was related to other gross-to-net deductions. Of the $16.4 billion in 2023, $14.3 billion, or 33%, of gross product sales was related to rebates and chargebacks, and $2.2 billion, or 5%, was related to other gross-to-net deductions.\nCurrent year gross-to-net deductions as a percent of gross product sales may not be indicative of future results.\nForeign Currency Exchange Impact\nWe generally face exposure to movements in foreign currency exchange rates, primarily in the Euro. We use foreign currency exchange contracts to hedge a portion of our foreign currency exposures.\nApproximately 27% and 26% of our product sales were denominated in foreign currencies during 2024 and 2023, respectively. Foreign currency exchange, net of hedges, had an unfavorable impact on our total product sales of $163 million in 2024, based on a comparison using foreign currency exchange rates from 2023.\nThe following table summarizes our costs and expenses and period-over-period changes:\nYear Ended December 31,\n(in millions, except percentages)\nProduct gross margin\nResearch and development expenses\nAcquired in-process research and development expenses\nNM\nIn-process research and development impairments\nNM\nSelling, general and administrative expenses\n_______________________________\nProduct Gross Margin\nProduct gross margin increased to 78.2% in 2024, compared to 2023, primarily due to prior year restructuring expenses related to changes in our manufacturing strategy, which resulted in write-offs of certain manufacturing facilities, related inventories and other costs totaling $479 million.\nResearch and Development Expenses\nResearch and development expenses consist primarily of personnel costs including salaries, benefits and stock-based compensation expense, infrastructure, materials and supplies and other support costs, research and clinical studies performed by contract research organizations and our collaboration partners and other outside services.\nWe manage our R&D expenses by identifying the R&D activities we expect to be performed during a given period and then prioritizing efforts based on scientific data, probability of successful technical development and regulatory approval, market potential, available human and capital resources and other considerations. We regularly review our R&D activities based on unmet medical need and, as necessary, reallocate resources among our internal R&D portfolio and external opportunities that we believe will best support the long-term growth of our business. We do not track total R&D expenses by product candidate, therapeutic area or development phase.\nThe following table provides a breakout of expenses by major cost type:\nYear Ended December 31,\nPersonnel, infrastructure and other support costs\nClinical studies and other costs\nResearch and development expenses increased 3% to $5.9 billion in 2024, compared to 2023.\nPersonnel, infrastructure and other support costs increased mainly due to higher compensation expenses, increases in restructuring costs, and stock-based compensation expenses and other integration costs related to the acquisition of CymaBay.\nClinical studies and other costs decreased mainly due to timing of clinical activities, including the wind-down of studies for magrolimab and obeldesivir for treatment of COVID-19, and higher R&D reimbursements, partially offset by increases related to the progression of other studies.\nAcquired In-Process Research and Development Expenses\nAcquired in-process research and development expenses are recorded when incurred and reflect costs of externally-developed IPR&D projects, acquired directly in a transaction other than a business combination, that do not have an alternative future use, including upfront and pre-commercialization milestone payments related to various collaborations and the costs of rights to IPR&D projects.\nAcquired in-process research and development expenses were $4.7 billion in 2024, primarily related to the following transactions:\n$3.8 billion CymaBay acquisition;\n$320 million Janssen Pharmaceutica NV future royalty obligation extinguishment related to seladelpar;\n$100 million Arcus Biosciences, Inc. collaboration continuation fee;\n$68 million Arcellx, Inc. (“Arcellx”) collaboration milestones met; and\n$47 million Tmunity Therapeutics, Inc. (“Tmunity”) acquisition milestones met.\nAcquired in-process research and development expenses were $1.2 billion in 2023, primarily related to the following transactions:\n$313 million Arcellx collaboration;\n$269 million Tmunity acquisition;\n$218 million XinThera, Inc. acquisition;\n$97 million Assembly Biosciences, Inc. collaboration; and\n$60 million Compugen Ltd. licensing agreement.\nIn-Process Research and Development Impairments\nAs of December 31, 2023, our indefinite-lived IPR&D intangible asset related to Trodelvy for metastatic NSCLC was approximately $5.9 billion. In addition to NSCLC, Trodelvy is being explored for potential investigational use in a range of tumor types where Trop-2 is highly expressed. Gilead’s clinical development program in metastatic NSCLC includes ongoing Phase 2 and registrational Phase 3 studies for Trodelvy as a first- or second-line indication.\nIn January 2024, we received data from our Phase 3 EVOKE-01 study of Trodelvy evaluating sacituzumab govitecan-hziy (“SG”) indicating that the study did not meet its primary endpoint of overall survival in previously treated metastatic NSCLC, thus triggering a review for potential impairment of the NSCLC IPR&D intangible asset. Based on our evaluation of the study results and all other data currently available, and in connection with the preparation of the financial statements for the first quarter, we performed an interim impairment test and determined that the revised estimated fair value of the NSCLC IPR&D intangible asset was below its carrying value. As a result, we recognized a partial impairment charge of $2.4 billion in In-process research and development impairments on our Consolidated Statements of Operations during the first quarter of 2024.\nIn September 2024, based on discussions with regulators and external opinion leaders and the completed evaluation of the Phase 3 EVOKE-01 study data, we made a strategic decision to discontinue our clinical development program in metastatic NSCLC for Trodelvy in the second-line indication. This decision triggered a review for potential impairment of the NSCLC IPR&D intangible asset. Based on our evaluation, and in connection with the preparation of the financial statements for the third quarter, we performed an interim impairment test and determined that the revised estimated fair value of the NSCLC IPR&D intangible asset was below its carrying value. As a result, we recognized a partial impairment charge of $1.8 billion in In-process research and development impairments on our Consolidated Statements of Operations during the third quarter of 2024.\nTo arrive at the revised estimated fair value, we used a probability-weighted income approach that discounts expected future cash flows to present value, which requires the use of Level 3 fair value measurements and inputs, including critical estimated inputs, such as: revenues and operating profits related to the planned utilization of SG in NSCLC, which, include inputs such as addressable patient population, projected market share, treatment duration, and the life of the potential commercialized product; the probability of technical and regulatory success; the time and resources needed to complete the development and approval of SG in NSCLC; an appropriate discount rate based on the estimated weighted-average cost of capital for companies with profiles similar to our profile; and risks related to the viability of and potential alternative treatments in any future target markets. Our revised discounted cash flows for the March 31, 2024 fair value estimation primarily reflected the smaller addressable market that Trodelvy could serve among metastatic NSCLC patients and a delay in expected launch timing for second-line plus patients. Our revised discounted cash flows for the September 30, 2024 fair value estimation primarily reflected the removal of cash flows associated with second-line plus patients.\nThere were no IPR&D impairment charges in the three months ended December 31, 2024. Therefore, total In-process research and development impairments on our Consolidated Statements of Operations were $4.2 billion in 2024, and the revised estimated fair value of the NSCLC IPR&D intangible asset was $1.8 billion as of December 31, 2024, which reflects Trodelvy’s opportunity as a combination therapy in first-line metastatic NSCLC patients supported by its ongoing Phase 3 clinical trial in this patient population.\nIn 2023, In-process research and development impairments included $50 million related to a partial impairment charge on our bulevirtide IPR&D intangible asset due to a change in assumptions primarily around probability and timing of regulatory approval.\nIf future events result in adverse changes in the key assumptions used in determining fair value, including the timing of product launches, information on the competitive landscape of treatments in this indication, changes to the probability of technical or regulatory success, failure to obtain anticipated regulatory approval or discount rate, among others, additional impairments may be recorded and could be material to our financial statements.\nSelling, General and Administrative Expenses\nSelling, general and administrative expenses are recorded when incurred and consist primarily of personnel costs, facilities and overhead costs, and selling, marketing and advertising expenses, as well as other general and administrative costs related to finance, human resources, legal and other administrative activities.\nThe following table summarizes our Selling, general and administrative expenses and period-over-period changes:\nYear Ended December 31,\n(in millions, except percentages)\nSelling and marketing expenses\nGeneral and administrative expenses\nSelling, general and administrative expenses\nSelling, general and administrative expenses were $6.1 billion and remained relatively flat in 2024, compared to 2023.\nSelling and marketing expenses increased mainly due to:\nmedia spend across multiple therapeutic areas, including launch preparation activities for lenacapavir for the investigational use of HIV PrEP as well as for Livdelzi;\nintegration costs related to the acquisition of CymaBay; and\nhigher restructuring costs; partially offset by\na decrease in our allocation of the branded prescription drug fee.\nGeneral and administrative expenses decreased mainly due to lower expenses related to legal matters, partially offset by stock-based compensation expenses and other integration costs related to the acquisition of CymaBay, and higher restructuring costs.\nInterest Expense and Other (Income) Expense, Net\nThe following table summarizes our Interest expense and Other (income) expense, net and period-over-period changes:\nYear Ended December 31,\n(in millions, except percentages)\nOther (income) expense, net\nLoss from equity securities, net\nUnfavorable movements in Other (income) expense, net in 2024, compared to 2023, primarily related to higher net losses from equity securities and lower interest income due to lower average cash balances.\nThe following table summarizes our Income tax expense and period-over-period changes:\nYear Ended December 31,\n(in millions, except percentages)\nIncome before income taxes\nOur effective tax rate increased in 2024, compared to 2023, primarily due to:\nThe non-deductible acquired IPR&D expense recorded in connection with our first quarter 2024 acquisition of CymaBay;\nA decrease in unrecognized tax benefits as a result of reaching agreement with a tax authority on certain tax positions in 2023; partially offset by\nA non-recurring tax benefit associated with a legal entity restructuring;\nA decrease in state deferred tax liabilities associated with the $4.2 billion NSCLC IPR&D intangible asset impairment charge;\nSettlements with tax authorities in 2024; and\nRemeasurement of certain deferred tax liabilities related to acquired intangible assets.\nThe Organisation for Economic Co-operation and Development has a framework to implement a global minimum corporate tax of 15% for companies with global revenues and profits above certain thresholds (referred to as Pillar Two), with certain aspects effective January 1, 2024 and other aspects effective January 1, 2025. Certain countries in which we operate have adopted Pillar Two legislation and other countries are in the process of introducing legislation to implement Pillar Two. We do not e",
  "item2_clean": null
}