{
  "source_file": "gl-20241231.htm",
  "form_type": "10-K",
  "item1_clean": "The following table presents Globe Life's business by primary marketing distribution channel. Additional information concerning industry segments may be found in\nManagement’s Discussion and Analysis\nNote 15—Business Segments\nNotes to the Consolidated Financial Statements\nPrimary Distribution Method\nUnderwriting Company\nProducts and Target Markets\nDirect to Consumer Division\nGlobe Life And Accident Insurance Company\nIndividual life and supplemental health limited-benefit insurance including juvenile and senior life coverage and Medicare Supplement to lower middle-income to middle-income Americans.\nNationwide distribution through direct to consumer channels: including direct mail, electronic media, and insert media.\nAmerican Income Life Division\nAmerican Income Life Insurance Company\nIndividual life and supplemental health limited-benefit insurance marketed to working families.\n11,741 average producing agents in the U.S., Canada, and New Zealand.\nLiberty National Division\nLiberty National Life Insurance Company\nLife and supplemental health limited-benefit insurance distributed through in-home and worksite channels.\n3,664 average producing agents in the U.S.\nFamily Heritage Division\nFamily Heritage Life Insurance Company of America\nSupplemental limited-benefit health insurance to lower middle-income to middle-income families.\n1,399 average producing agents in the U.S.\nUnited American Division\nUnited American Insurance Company\nSupplemental health Medicare coverage to beneficiaries and, to a lesser extent, supplemental limited-benefit coverage to people under age 65.\n3,355 independent producing agents in the U.S.\n—The distribution channels for life insurance products include direct to consumer, exclusive agents, and independent agents. These methods are described in greater detail within the primary marketing distribution channel chart as shown above. The following table presents annualized premium in force for the three years ended December 31, 2024 by distribution method:\n\nand this starts with our employees and agents. Beyond providing insurance protection for millions of individuals, serving our policyholders and generating financial results for our shareholders, we focus on cultivating a healthy, positive culture and a thriving community within and among our campuses that is inclusive of and attractive for all. Globe Life promotes a diverse and inclusive work force to better enable our employees to consistently achieve outstanding individual and collective results. Our commitment to diversity starts at the top; of the 9 independent Board members, 56% are women and 33% are racial/ethnic minorities as of December 31, 2024.\nAs of December 31, 2024 and 2023, the Globe Life employees, (excluding independently-contracted agents) identify as follows:\nBaby Boomers (1946-1964)\nBlack or African American\nMillennials (1978-1995)\nAmerican Indian or Alaskan Native\nNative Hawaiian or Pacific Islander\nOther or Not Specified\nPer the Globe Life Employee Handbook, the Globe Life mission statement is \"We help families\nMake Tomorrow Better\nby working to protect their financial future.\"\nBaby Boomers (1946-1964)\nBlack or African American\nMillennials (1978-1995)\nAmerican Indian or Alaskan Native\nNative Hawaiian or Pacific Islander\nOther or Not Specified\nWe conduct a confidential survey biennially to give our employees the opportunity to provide candid feedback about their experiences at the Company, including but not limited to, confidence in the Company and leadership, competitiveness of our compensation and benefit package, and departmental relationships. The results are shared with our employees, reviewed by senior leadership, and used to identify areas for improvement and create action plans based on the employee feedback received.\nr, in part by giving financial and service contributions to programs that provide hands-on assistance in the communities where we live, work, serve, and visit. We focus our charitable giving on organizations that support children, families, veterans, and seniors, as well as those that work to ensure people are able to live full, healthy lives. These categories align with our mission to help families\nMake Tomorrow Better\nby working to protect their financial future. In 2024, we provided financial support of more than $7 million to organizations within that focus, including charities that support underserved communities, provide scholarships to youth, and advance equity and diversity efforts.\nAt Globe Life, we believe investing in our employees through training and development is paramount to their success. We have developed a learning ecosystem that includes a multitude of professional development opportunities, including online, self-directed, and instructor-led courses on a variety of topics. An education assistance program is also offered to facilitate growth in an area related to one's current position with the Company.\nHealth, Safety, and Wellness\nWe strive to provide a safe and healthy work environment for every employee. We furnish employees with numerous tools and trainings throughout the year to help ensure they have, at their fingertips, the best information to safely engage with co-workers, customers, and third parties. In furtherance of our commitment to our employees, we offer a comprehensive employee benefits package that includes competitive monetary benefits, retirement benefits through a Section 401(k) plan and a qualified pension to eligible employees, fitness center reimbursement, paid-time-off (based on years of service), health insurance, dental and vision insurance, employee resource program, health savings and flexible spending accounts, family leave, and tuition assistance.\nThe Company remains committed to the well-being and safety of its employees, agents, customers, guests, vendors, and shareholders in our resolve to maintain a stable and secure business environment.\n\nfor more information.\n—The nature, quality, and percentage mix of insurance company investments are regulated by state laws. The investments of Globe Life insurance subsidiaries consist predominantly of high-quality, investment-grade securities. Approximately 88% of our invested assets, at fair value, are fixed maturities at December 31, 2024 (see\nManagement’s Discussion and Analysis\n—Globe Life competes with other life and health insurance carriers through policyholder service, price, product design, and sales efforts. While there are insurance companies competing with Globe Life, no individual company dominates any of Globe Life's life or health insurance markets.\n\nCollections for certain life products are not recognized as revenues, but are added to policyholder account values. Revenues from these products are derived from charges to the account balances for insurance risk and administrative costs. Profits are earned to the extent these revenues exceed actual costs. Profits are also earned from investment income in excess of the amounts required for policy reserves.\n—The underwriting standards of Globe Life's insurance subsidiaries are established by management. Each subsidiary uses information obtained from the application, and in some cases additional information such as, telephone interviews with applicants, inspection reports, pharmacy data, motor vehicle records, responses to both medical and non-medical questions, doctors’ statements and/or medical records and examinations. This information is used to determine whether a policy should be issued in accordance with the application, with a different rating, with a rider, with reduced coverage, or rejected.\n—The life insurance policy reserves reflected in Globe Life's consolidated financial statements as future policy benefits are calculated based on accounting principles generally accepted in the United States of America (GAAP). These reserves, with future premiums and the associated interest compounded at assumed rates, are expected to be sufficient to cover policy and contract obligations as they mature. Generally, the mortality and lapse\nassumptions used in the calculations of reserves are based on Company experience. Similar reserves are held on most of the health insurance policies written by Globe Life's insurance subsidiaries, since these policies generally are issued on a guaranteed-renewable basis. The assumptions used in the calculation of Globe Life's reserves are reported in\nNote 1—Significant Accounting Policies\nReserves for certain life products consist of the policyholders’ account values and are increased by policyholder deposits and interest credited and are decreased by policy charges and benefit payments.\n—Globe Life has historically participated in third-party reinsurance. See\nNote 1—Significant Accounting Policies\nNote 5—Commitments and Contingencies\nNote 6—Policy Liabilities\n\nAnnualized Premium in Force\n(Dollar amounts in thousands)\nLimited-benefit plans\n—Premium rates for life and health insurance products are established using assumptions as to future mortality, morbidity, persistency, investment income, expenses, and target profit margins. These assumptions are based on Company experience and projected investment earnings rates. Revenues for individual life and health insurance products are primarily derived from premium income, and, to a lesser extent, through policy charges to the policyholder account values on annuity products and certain individual life products. Profitability is affected by actual experience deviations from the established assumptions and to the extent investment income varies from that required for policy reserves.\n\nGlobe Life offers Medicare Supplement and limited-benefit supplemental health insurance products that include accident, cancer, critical illness, heart, intensive care, and other health products. These products are designed to supplement health coverage that applicants already own. Medicare Supplements are offered to enrollees in the traditional fee-for-service Medicare program. Medicare Supplement plans are standardized by federal regulation and are designed to pay deductibles and co-payments not paid by Medicare.\nThe following table presents supplemental health annualized premium in force information for the three years ended December 31, 2024 by product category.\n\nThe Company effectively competes with other carriers, in part, due to its ability to operate at lower policy acquisition and administrative expense levels than peer companies. This allows Globe Life to have competitive rates while maintaining higher underwriting margins.\n—Insurance companies are subject to regulation and supervision in the states in which they do business. The laws of the various states establish agencies with broad administrative and supervisory powers which include, among other things, granting and revoking licenses to transact business, regulating trade practices, licensing agents, approving policy forms, approving certain premium rates, setting minimum reserve and loss ratio requirements, determining the form and content of required financial statements, and prescribing the type and amount of investments permitted. Insurance companies are also required to file detailed annual reports with supervisory agencies, and records of their business are subject to examination at any time. Under the rules of the National Association of Insurance Commissioners (NAIC), insurance companies are examined periodically by one or more of the supervisory agencies.\nRisk-Based Capital (RBC)\n—The NAIC requires that a risk-based capital formula be applied to all life and health insurers. The risk-based capital formula is a threshold formula rather than a target capital formula. It is designed only to identify companies that require regulatory attention and is not to be used to rate or rank companies that are adequately capitalized. All Globe Life's insurance subsidiaries are more than adequately capitalized under the risk-based capital formula. See further discussion of RBC in\n—States have enacted le",
  "item7_clean": "For more information concerning litigation, please refer to\nNote 5—Commitments and Contingencies\nCRITICAL ACCOUNTING ESTIMATES\nApplication of Critical Accounting Estimates.\nCritical accounting estimates are those estimates made in accordance with GAAP that involve a significant level of estimation uncertainty and have had or are reasonably likely to have a material impact on the financial condition or results of operations. The preparation of financial statements in conformity with GAAP requires the application of accounting estimates that often involve a significant degree of judgment. Management reviews these key estimates and assumptions used in the preparation of financial statements on a timely basis. If management determines that modifications are necessary due to current facts and circumstances, the Company’s results of operations and financial position as reported in the consolidated financial statements could possibly change significantly. Information on our accounting policies is disclosed in\nNote 1—Significant Accounting Policies\nFuture Policy Benefits.\nConsiderable information concerning the policies, procedures, and other relevant data related to the valuation of our liability for future policy benefits is presented in\nNote 1—Significant Accounting Policies\nNote 6—Policy Liabilities\nThe liability for future policy benefits for traditional and limited-payment long duration life and health products comprises the vast majority of the total liability for future policy benefits for the Company. The liability is determined each reporting period based on the net level premium method. This method requires the liability for future policy benefits to be calculated as the present value of estimated future policyholder benefits and the related termination expenses, less the present value of estimated future net premiums to be collected from policyholders.\nThe Company reviews, and updates as necessary, its cash flow assumptions (mortality, morbidity, and lapses) used to calculate the change in the liability for future policy benefits at least annually. These cash flow assumptions are reviewed at the same time every year, or more frequently, if suggested by experience. If cash flow assumptions are\nGLOBE LIFE INC.\nManagement's Discussion & Analysis\nchanged, the net premium ratio is recalculated from the original issue date, or the Transition Date, using actual experience and projected future cash flows. As cash flow assumptions are changed, the liability for future policy benefits is adjusted with changes recognized in policyholder benefits on the\nConsolidated Statements of Operations\nThe following table illustrates the sensitivity of our liability for future policy benefits, including the corresponding pre-tax impact on OCI, and net income, as of December 31, 2024, to changes in cash flow assumptions. This information is useful in understanding the potential financial impact on our financial statements from changes in these items and the expected impact to our liability for future policy benefits. We could experience impacts that are more or less significant than noted in the following analysis; however the sensitivities provide insight regarding the direction and magnitude of those potential impacts.\nAt December 31, 2024\n(Dollar amounts in thousands)\nFuture policy benefits\nOCI\nRepresents the associated impact to OCI from updating the net premium ratio based upon the cash flow assumptions and the remeasurement of the liability for future policy benefits using the current discount rate.\nThe liability for future policy benefits is discounted using a current upper-medium grade fixed-income instrument yield that reflects the duration characteristics of the liability for future policy benefits. Accordingly, the discount rate assumption is key in determining the change in the value of the liability for future benefits for long duration life and health contracts. Since the liability for future policy benefits for traditional and limited-payment long duration life and health products comprises approximately 93% of the total liability for future policy benefits, it is subject to interest rate risk. A decrease in discount rates will cause an increase in the obligation with a corresponding change in AOCI.\nThe following table illustrates the interest rate sensitivity of our liability for future policy benefits as of December 31, 2024. This table measures the effect of a parallel shift in discount rates on the liability. The data measures the change in reported value arising from an immediate change in rates in increments of 50 and 100 basis points, which would be recorded as a component of OCI.\nValue of Liability for Future Policy Benefits\n(Dollar amounts in thousands)\nChange in Discount Rates\n(1) In basis points.\nGLOBE LIFE INC.\nManagement's Discussion & Analysis\nDeferred Acquisition Costs.\nCertain costs of acquiring new insurance business are deferred and recorded as an asset. These costs are capitalized on a grouped contract basis and amortized over the expected term of the related contracts, and are essential for the acquisition of new insurance business.\nDeferred Acquisition Costs (DAC) are amortized on a constant-level basis over the expected term of the grouped contracts, with the related expense included in amortization of deferred acquisition costs on the\nConsolidated Statements of Operations\n. The in-force metric used to compute the DAC amortization rate is annualized premium in force. The assumptions used to amortize acquisition costs include mortality, morbidity, and lapses, and are consistent with those used in calculating the liability for future policy benefits.\nValue of business acquired (VOBA) is amortized on a basis that is consistent with DAC, as described above, and is subject to periodic recoverability and loss recognition testing to determine if there is a premium deficiency. These tests evaluate whether the present value of future contract-related cash flows will support the capitalized VOBA asset. These cash flows consist primarily of premium income, less benefits and expenses. The present value of these cash flows, less the reserve liability, is then compared with the unamortized balance. In the event the estimated present value of net cash flows is less, the deficiency would be recognized by a charge to earnings and either a reduction of unamortized acquisition costs or an increase in the liability for future benefits.\n\nNet income increased 10% to $1.07 billion in 2024, compared with $971 million in 2023. In 2023, net income increased 9% from $894 million in 2022. On a diluted per common share basis, net income per common share for 2024 increased from $10.07 to $11.94. In 2023, net income per common share, on a diluted per common share basis, increased 11% from $9.04 in 2022.\nNet operating income increased 8% to $1.11 billion in 2024, compared with $1.03 billion in 2023, due to a 26% increase in excess investment income as well as a 13% increase in life underwriting margin. In 2023, net operating income increased 7% from $961 million in 2022. On a diluted per common share basis, net operating income per common share for 2024 increased from $10.65 to $12.37, an increase of 16%. In 2023, net income per common share, on a diluted per common share basis, increased 10% from $9.71 in 2022. Net operating income is primarily comprised of insurance underwriting margin plus excess investment income and annuity and other income, offset by operating expenses, after tax and, as such, is considered a non-GAAP measure. Net income is the most directly comparable GAAP measure. We do not consider realized gains and losses to be a component of our core insurance operations or operating segments. Additionally, net income in 2024, 2023, and 2022 was affected by certain non-operating items. We do not view these items as components of core operating results because they are not indicative of past performance or future prospects of the insurance operations. We remove items such as these that relate to prior periods or are non-operating items when evaluating the results of current operations, and therefore exclude such items from our segment analysis for current periods.\nAs previously noted, a component of insurance underwriting margin is policy obligations, which includes for each reporting period the change in the liability for future policy benefits (LFPB). The LFPB is determined each reporting period based on the net level premium method. Net level premiums reflect a recomputed net premium ratio using actual experience since the issue date, and expected future experience based on future cash-flow assumptions. See\nNote 6—Policy Liabilities\nfor additional information. The policy liability is accrued as premium revenue is recognized and adjusted for differences between actual and expected experience in the form of remeasurement gains and losses during the period. If actual mortality, morbidity, and lapse experience equals our expected assumptions used in the development of our liability for future policy benefits, there would be no impact to our financial results. Actual experience can have a material impact on financial results to the extent it significantly deviates from the expected assumptions which are used to develop our estimates of the liability for future policy benefits and amortization of the deferred acquisition cost asset (DAC). For example, deviations in actual versus expected lapses in the early policy years tend to have a larger impact on DAC amortization than LFPB change in reserves. Conversely, deviations in actual versus expected lapses in the later policy years typically have a larger impact on LFPB change in reserves than DAC amortization. This is due to the release of DAC and LFPB where DAC capitalization in earlier years is amortizing over time and the LFPB is increasing over time as the policy stays inforce. Disaggregated rollforwards of our present value of expected future net premiums and our expected future policy benefits are presented within\nNote 6—Policy Liabilities\n, which include disclosure of remeasurement gain (loss) for the effect of actual variances from expected experience and the changes in assumptions (mortality, morbidity, and lapses) on future cash flows.\nThe Company performed an annual review of its assumptions in the third quarter of 2024 that resulted in favorable changes to its mortality and lapse assumptions on life and unfavorable changes to morbidity assumptions on health. In our life segment mortality assumptions generally decreased across most channels in line with recent experience consistent with decreasing levels of excess deaths. Lapse rate assumptions in the life segment were slightly increased across all channels. For the health segment, morbidity assumptions were increased, causing higher future policy benefit reserves. The assumption review process of the life and health segments resulted in a $46.3 million net remeasurement gain for the period ended December 31, 2024 as compared to a $3.2 million net remeasurement gain for the period ended December 31, 2023 and a $36.5 million net remeasurement loss for the period ended December 31, 2022.\nExcluding the impact of assumption changes, the Company's results for actual variances from expected experience for both life and health produced a $57.4 million net remeasurement gain for the period ended December 31, 2024, as compared to a $38.0 million net remeasurement gain for the period ended December 31, 2023 and a $4.6 million net remeasurement gain for the period ended December 31, 2022.\nOverall, the Company continues to see positive signs in its core operations, including sales and premium growth, and continues to achieve an operating ROE (excluding accumulated other comprehensive income) generally in the mid-teens.\nGLOBE LIFE INC.\nManagement's Discussion & Analysis\nGlobe Life's operations on a segment-by-segment basis are discussed in depth below. Net operating income has been used consistently by management for many years to evaluate the operating performance of the Company and is a measure commonly used in the life insurance industry. It differs from GAAP net income primarily because it excludes certain non-operating items such as realized gains and losses and other significant and unusual items included in net income. Management believes an analysis of net operating income is important in understanding the profitability and operating trends of the Company’s business. Net income is the most directly comparable GAAP measure.\nAnalysis of Profitability by Segment\n(Dollar amounts in thousands)\nLife insurance underwriting margin\nHealth insurance underwriting margin\nExcess investment income\nSegment profit or (loss)\nAnnuity and other income\nAdministrative expense\nOther corporate expense\nNet operating income\n\nTotal insurance administrative expenses increase (decrease) over prior year\nTotal operating expenses increase (decrease) over prior year\nTotal operating expenses for December 31, 2024 increased in comparison with the prior year primarily due to increases in insurance administrative expenses as well as stock compensation and legal proceedings. Insurance administrative expenses increased $41.3 million primarily due to higher information technology costs, legal costs including compliance and security and employee costs, which includes salaries and other. Insurance administrative expenses as a percent of premium were 7.3% for the year ended December 31, 2024 compared to 6.8% for the same period in 2023.\nGLOBE LIFE INC.\nManagement's Discussion & Analysis\nSHARE REPURCHASES\nGlobe Life has an ongoing share repurchase program that began in 1986. The share repurchase program is reviewed with the Board of Directors by management quarterly, and continues indefinitely unless and until the Board of Directors decides to suspend, terminate or modify the program. On November 18, 2024, the Board of Directors authorized the repurchase of up to $1.8 billion under the Company's existing share repurchase program. Management generally determines the amount of repurchases based on the amount of the excess cash flows and other available sources after the payment of dividends to the Parent Company shareholders, general market conditions, and other alternative uses. Since implementing our share repurchase program in 1986, we have used $10.3 billion to repurchase Globe Life Inc. common shares after determining that the repurchases provide a greater risk-adjusted after-tax return than other investment alternatives.\nExcess cash flow at the Parent Company is primarily comprised of dividends received from the insurance subsidiaries less interest expense paid on its debt and other limited operating activities. Additionally, when stock options are exercised, proceeds from these exercises and the resulting tax benefit are used to repurchase additional shares on the open market to minimize dilution as a result of the option exercises.\nThe following table summarizes share repurchases for each of the last three years.\n\nThe life insurance segment is our primary segment and is the largest contributor to earnings in each year presented. In 2024, the life insurance segment underwriting margin increased $160 million compared with 2023. This was primarily a result of increased premiums and favorable policy obligations as a percent of premium due to a remeasurement gain resulting from the assumption updates in 2024. In 2023, the life insurance segment underwriting margin increased $63 million when compared with 2022. The increase was due to increased premiums, favorable policy obligations as a percent of premium, and a lower remeasurement loss resulting from assumption updates in 2023. Excess investment income increased $34 million in 2024 compared with 2023, resulting from growth in our invested assets and increased yields due to higher interest rates. In 2023, excess investment income increased $26 million compared with 2022. In 2024, underwr",
  "item2_clean": null
}