{
  "source_file": "glw-20250930.htm",
  "form_type": "10-Q",
  "item1_clean": null,
  "item7_clean": null,
  "item2_clean": "LIQUIDITY AND CAPITAL RESOURCES\nOur financial condition and liquidity are strong. We are not aware of any known trends, demands, commitments, events or uncertainties that will result in or that are reasonably likely to result in a material decrease in our liquidity. In addition, other than items discussed, there are no known material trends, favorable or unfavorable, in our capital resources and no expected material changes in the mix of such resources.\nOur major sources of funding for 2025 and beyond will be our operating cash flow, our existing balances of cash and cash equivalents and proceeds from any issuances of debt. We believe we have sufficient liquidity to fund operations and meet our obligations for the foreseeable future. Such obligations may include requirements for acquisitions, capital expenditures, debt repayments, dividend payments and share repurchases. We will continue to generate cash from operations and maintain access to our revolving credit facilities and commercial paper programs as discussed in more detail below.\nKey Balance Sheet Data\nWe fund our working capital with cash from operations and, periodically, short-term and long-term borrowings. In addition, from time to time, we receive upfront cash from customers relating to long-term supply agreements, as well as cash incentives from government entities generally for capital expansion and related expenses.\nThe following table presents balance sheet and working capital measures (in millions):\nTrade accounts receivable, net of doubtful accounts\nDays sales outstanding\nDays payable outstanding\nTotal debt to total capital\nIncludes trade payables only.\nWe perform comprehensive reviews of our significant customers and their creditworthiness by analyzing their financial strength at least annually or more frequently for customers where we have identified a measure of increased risk. We closely monitor payments and developments to identify potential customer credit issues. We are not aware of any customer credit issues that could have a material impact on our liquidity.\nWe participate in accounts receivable management programs, including factoring arrangements to sell certain accounts receivable to third-party financial institutions or accelerate collections through our customer’s supply chain financing arrangements. Sales of accounts receivable are reflected as a reduction of accounts receivable in the consolidated balance sheets and the proceeds are included in cash flows from operating activities in the consolidated statements of cash flows. By utilizing these types of programs, we accelerated the collection of $403 million, $399 million and $277 million in accounts receivable during the three months ended March 31, 2025, June 30, 2025 and September 30, 2025, respectively, which would have been collected during the normal course of business in the following quarter.\n\nFORWARD-LOOKING STATEMENTS\nAlthough the Company believes that these forward-looking statements are based upon reasonable assumptions regarding, among other things, current estimates and forecasts, general economic conditions, its knowledge of its business and key performance indicators that impact the Company, there can be no assurance that these forward-looking statements will prove to be accurate, as actual results and future events could differ materially from those anticipated in such statements. The Company undertakes no obligation to update forward-looking statements if circumstances or management’s estimates or opinions should change except as required by applicable securities laws.\nSome of the risks, uncertainties and other factors that could cause actual results to differ materially from those expressed in or implied by the forward-looking statements include, but are not limited to:\nglobal economic trends, competition and geopolitical risks, or an escalation of sanctions, tariffs or other trade tensions between the U.S. and other countries, and related impacts on our businesses’ global supply chains and strategies;\nchanges in macroeconomic and market conditions and market volatility, including developments and volatility arising from health crisis events, inflation, interest rates, the value of securities and other financial assets, precious metals, oil, natural gas, raw materials and other commodity prices and exchange rates (particularly between the U.S. dollar and the Japanese yen, South Korean won, Chinese yuan, New Taiwan dollar, Mexican peso and euro), decreases or sudden increases of consumer demand, and the impact of such changes and volatility on our financial position and businesses;\nthe availability of or adverse changes relating to government grants, tax credits or other government incentives;\nthe duration and severity of health crisis events, such as an epidemic or pandemic, and its impact across our businesses on demand, personnel, operations, our global supply chains and stock price;\npossible disruption in commercial activities or our supply chain due to terrorist activity, cyber-attack, armed conflict, political or financial instability, natural disasters, international trade disputes or major health concerns;\nloss of intellectual property due to theft, cyber-attack, or disruption to our information technology infrastructure;\nability to enforce patents and protect intellectual property and trade secrets;\ndisruption to Corning’s, our suppliers’ and manufacturers’ supply chain, equipment, facilities, IT systems or operations;\nproduct demand and industry capacity;\ncompetitive products and pricing;\navailability and costs of critical components, materials, equipment, natural resources and utilities;\nnew product development and commercialization;\norder activity and demand from major customers;\nthe amount and timing of our cash flows and earnings and other conditions, which may affect our ability to pay our quarterly dividend at the planned level or to repurchase shares at planned levels;\nthe amount and timing of any future dividends;\nthe effects of acquisitions, dispositions and other similar transactions;\nthe effect of regulatory and legal developments;\nability to pace capital spending to anticipated levels of customer demand;\nour ability to increase margins through implementation of operational changes, pricing actions and cost reduction measures;\nrate of technology change;\nproduct and component performance issues;\nretention of key personnel;\ncustomer ability to maintain profitable operations and obtain financing to fund ongoing operations and manufacturing expansions and pay receivables when due;\nloss of significant customers;\nchanges in tax laws, regulations and international tax standards;\nthe impacts of audits by taxing authorities; and\nthe potential impact of legislation, government regulations, and other government action and investigations.\n\nItem 2. Management’s Discussion and Analysis of Financial Condition and Results of Operations\nCorning Incorporated and its consolidated subsidiaries are hereinafter sometimes referred to as the “Company,” the “Registrant,” “Corning,” “we,” “our,” or “us.”\nThis report contains forward-looking statements that involve a number of risks and uncertainties. These statements relate to plans, objectives, expectations and estimates and may contain words such as “will,” “believe,” “anticipate,” “expect,” “intend,” “plan,” “seek,” “see,” “would,” “target,” “estimate,” “forecast,” or similar expressions. Actual results could differ materially from what is expressed or forecasted in forward-looking statements. Some of the factors that could contribute to these differences include those discussed under “Forward-Looking Statements,” “Risk Factors,” “Management’s Discussion and Analysis of Financial Condition and Results of Operations,” and elsewhere in this report.\nORGANIZATION OF INFORMATION\nOur MD&A is organized as follows:\nResults of Operations\nCore Performance Measures\nLiquidity and Capital Resources\nCritical Accounting Estimates\nForward-Looking Statements\nOVERVIEW\nCorning is vital to progress – in the industries we help advance and in the world we share. For more than 170 years, Corning has combined its unparalleled expertise in glass science, ceramic science and optical physics with deep manufacturing and engineering capabilities to develop category-defining products that transform industries and enhance people’s lives. Our materials science and manufacturing expertise, boundless curiosity and commitment to purposeful invention place us at the center of the way the world works, learns and lives. In addition, our sustained investment in research, development and engineering capabilities means we are always ready to solve the toughest challenges – alongside our customers.\nOur capabilities are versatile and synergistic, allowing Corning to evolve to meet changing market needs, while also helping customers capture new opportunities in dynamic industries. Corning strives to be a catalyst for positive change and to help move the world forward. The Company drives profitable multiyear growth by inventing, making and selling life-changing products – all of which is based on a set of vital capabilities that are increasingly relevant to profound transformations that touch many facets of daily life. Today, Corning’s markets include optical communications, mobile consumer electronics, display, automotive, solar, semiconductor and life sciences.\n2025 Corporate Outlook\nWe expect core net sales of approximately $4.35 billion for the fourth quarter of 2025.\n\nReconciliation of Non-GAAP Measures\nWe utilize certain financial measures and key performance indicators that are not calculated in accordance with GAAP to assess our financial and operating performance. A non-GAAP financial measure is defined as a numerical measure of a company’s financial performance that (i) excludes amounts, or is subject to adjustments that have the effect of excluding amounts, that are included in the comparable measure calculated and presented in accordance wit"
}