{
  "source_file": "gm-20250930.htm",
  "form_type": "10-Q",
  "item1_clean": null,
  "item7_clean": null,
  "item2_clean": "Item 2. Management’s Discussion and Analysis of Financial Condition and Results of Operations\nBasis of Presentation\nOur vision for the future is a world with zero crashes, zero emissions and zero congestion. We will adapt to customer preferences while executing our growth-focused strategy to invest in EVs, hybrids, personal AV technology, software-enabled services and other new business opportunities. To support strong margins and cash flow during this transition, we continue to strengthen our market position in profitable ICE vehicles, such as trucks and SUVs. We plan to execute our strategy with a steadfast commitment to good corporate citizenship through more sustainable operations and a leading health and safety culture.\nOur financial performance continues to be driven by the strength of our vehicle portfolio, including high margin full-size pickup trucks and SUVs, strong consumer demand for our products and the execution of our core business strategy. We remain focused on maintaining an efficient cost structure and pricing discipline. We continue to prioritize driving down costs to improve profitability and are aligning EV capacity to expected consumer demand. In February 2025, we completed the acquisition of the noncontrolling interests in Cruise and are prioritizing the development of ADAS on a path to fully autonomous personal vehicles. We are monitoring industry pricing pressures, changing interest rates, inflation, warranty claims, consumer demand trends, changes to the regulatory environment, including with respect to fuel economy standards, GHG emissions regulations, corporate taxes and EV incentives.\nIn the first quarter of 2025, the U.S. Government announced new tariffs, inclusive of vehicles and parts imported into the U.S. The tariff environment continues to remain highly dynamic and the specific tariffs applicable to goods imported by GM and its suppliers into the U.S., including under the U.S.-Mexico-Canada Agreement, continue to evolve, as do import tariffs charged by other countries. In October 2025, the U.S. Government announced certain modifications to tariffs relevant to the automotive industry, including tariffs related to imports of heavy-duty trucks and, separately, to parts for passenger vehicles and light-duty trucks. With respect to tariffs on imports of heavy-duty trucks, we do not anticipate that such tariffs will have a material impact on our business results. With respect to the expansion and extension of the import adjustment offset program established pursuant to Presidential Proclamation 10925, and due in part to increased competitiveness of our U.S. produced vehicles, GM anticipates that the recently announced changes will result in a material positive benefit to our fourth quarter 2025 business results, as well as in future quarters. Based on the current tariff environment, we estimate that impacts to EBIT-adjusted could range from $3.5 billion to $4.5 billion for the year ending December 31, 2025. Refer to Part II, Item 1A. Risk Factors for a full discussion of the risks associated with the U.S. tariff environment.\nOn July 4, 2025, the Act was signed into law that includes the extension and modification of certain key provisions of the U.S. Tax Cuts and Jobs Act of 2017, modification of certain Inflation Reduction Act incentives, acceleration of the phase-out of clean vehicle and other clean energy credits and sets the civil penalties to zero for noncompliance with CAFE standards. The Act also introduces a new auto loan interest deductibility provision that allows some individuals to deduct up to $10,000 per year in interest on new, U.S.-assembled personal vehicles purchased between 2025 and 2028. There are a variety of effective dates in the Act and only certain key provisions with financial reporting implications are expected to affect our financial statements for the year ending December 31, 2025. In July 2025, the EPA proposed to remove GHG regulations for light-, medium- and heavy-duty on-highway vehicles on a retrospective and prospective basis. Should the EPA remove GHG regulations, the majority of the carrying amount of our acquired credits of $1.2 billion may be subject to impairment in the near term and our ongoing cost of compliance to the GHG regulations would be favorably impacted.\nFollowing these recent U.S. Government policy changes, including the termination of consumer tax incentives for EV purchases and the reduction in stringency of emissions regulations, we expect the adoption rate of EVs to slow. These developments have caused us to reassess our EV capacity and manufacturing footprint to align with expected consumer demand. Based on a planned strategic realignment of our EV capacity and manufacturing footprint to expected consumer demand, we recorded charges of $1.6 billion in GMNA in the three months ended September 30, 2025. The reassessment of our EV capacity and manufacturing footprint, including our investments in our battery component manufacturing, is ongoing and it\nGENERAL MOTORS COMPANY AND SUBSIDIARIES\nis reasonably possible that we will recognize additional future material cash and non-cash charges that may adversely affect our results of operations and cash flows in the period in which they are recognized. These amounts will be recognized in our results as decisions are made and will be reflected as adjustments in our non-GAAP financial measures. Refer to the \"Non-GAAP Measures\" section of this MD&A for additional information. Our strategic realignment of EV capacity does not impact today's retail portfolio of Chevrolet, GMC, and Cadillac EVs currently in production, and we expect these models to remain available to consumers.\nAs we continue to assess our performance and the needs of our evolving business, additional restructuring and rationalization actions could be required. These actions could give rise to future asset impairments or other charges, which may have a material impact on our operating results. Refer to the \"Consolidated Results\" and regional sections of this MD&A for additional information.\nFor the year ending December 31, 2025, we expect Net income attributable to stockholders of between $7.7 billion and $8.3 billion, EBIT-adjusted of between $12.0 billion and $13.0 billion, EPS-diluted of between $8.30 and $9.05 and EPS-diluted-adjusted of between $9.75 and $10.50. Refer to the \"Non-GAAP Measures\" section of this MD&A for additional information.\nThe following table reconciles expected Net income attributable to stockholders to expected EBIT-adjusted (dollars in billions):\nYear Ending December 31, 2025\nNet income attributable to stockholders\nAutomotive interest income, net\nRefer to the reconciliation of Net income (loss) attributable to stockholders to EBIT-adjusted within this MD&A for adjustment details. These expected financial results do not include the potential impact of future adjustments related to special items.\nThe following table reconciles expected EPS-diluted to expected EPS-diluted-adjusted\nYear Ending December 31, 2025\nDiluted earnings per common share\nEPS-diluted-adjusted\nRefer to the reconciliation of diluted earnings per common share to EPS-diluted-adjusted within this MD&A for adjustment details. These expected financial results do not include the potential impact of future adjustments related to special items.\nGMNA\nIndustry sales in North America were 15.5 million units in the nine months ended September 30, 2025, representing an increase of 4.1% compared to the corresponding period in 2024. U.S. industry sales were 12.5 million units in the nine months ended September 30, 2025, representing an increase of 4.1% compared to the corresponding period in 2024.\nOur total vehicle sales in the U.S., our largest market in North America, were 2.2 million units for market share of 17.2% in the nine months ended September 30, 2025, representing an increase of 1.0 percentage points compared to the corresponding period in 2024.\nWe achieved solid margins in the nine months ended September 30, 2025 driven by the strength of our product portfolio and ongoing cost discipline. However, the evolving tariff and policy landscape could have a material impact on our profitability\nGENERAL MOTORS COMPANY AND SUBSIDIARIES\ngoing forward. We remain focused on improving our EV profitability while maintaining our focus on cost. In addition, our outlook is dependent on continued supply chain availability, the resiliency of the U.S. economy and overall economic conditions, including the imposition of tariffs, less available offsets and deductions, or other trade restrictions by the U.S. or its trading partners. Looking ahead, our top priority is returning GMNA to its historical 8.0-10.0% EBIT-adjusted margins as quickly as possible.\nGMI\nIndustry sales in China were 19.3 million units in the nine months ended September 30, 2025, representing an increase of 6.5% compared to the corresponding period in 2024. Our total vehicle sales in China were 1.4 million units for market share of 7.0% in the nine months ended September 30, 2025, representing an increase of 0.2 percentage points compared to the corresponding period in 2024. Our Automotive China JVs generated equity income of $0.2 billion in the nine months ended September 30, 2025. We continue to focus on enhancing the competitiveness of our products in the Chinese market and executing restructuring plans. Additional restructuring charges may be incurred going forward.\nOutside of China, industry sales were 19.8 million units in the nine months ended September 30, 2025, representing an increase of 3.2% compared to the corresponding period in 2024. Our total vehicle sales outside of China were 0.7 million units for market share of 3.3% in the nine months ended September 30, 2025, representing a decrease of 0.3 percentage points compared to the corresponding period in 2024.\nThe principal factors that determine consumer vehicle preferences in the markets in which we operate include overal"
}