{
  "source_file": "gnrc20241231_10k.htm",
  "form_type": "10-K",
  "item1_clean": "We have a long history of providing power generation products across a variety of applications, and we maintain one of the leading positions in the North American market for power equipment with an expanding presence internationally. We believe we have one of the widest ranges of products in the power generation marketplace, including residential, commercial, and industrial standby generators, as well as portable and mobile generators used in a variety of applications. The Company is evolving its product portfolio by building out ecosystems of energy technology products, solutions, and services for homes and businesses, enabling end users to better manage their energy costs and needs. As part of this evolution, we have made significant investments into developing markets such as residential and commercial & industrial (C&I) energy storage, solar power inverters, energy monitoring & management devices, and electric vehicle (EV) charging. Central to these ecosystems are the Company’s advanced connectivity devices, controls capabilities, and software platforms that facilitate the integration of our products into grid services programs. In addition, we have been leveraging our leading position in the growing market for natural gas fueled generators, which we believe represents a cleaner fuel compared to diesel, to expand into applications beyond standby power, allowing us to participate in multi-purpose microgrid projects for C&I customers. As the traditional centralized utility model evolves over time, we believe that a more decarbonized, digitized, and decentralized grid infrastructure will develop, and our energy technology solutions are uniquely and strategically positioned to participate in this next-generation grid.\n\nEmerging applications and business models utilizing our solutions open new market opportunities\n. We expect the evolution of the traditional electrical utility model toward decarbonized, digitized, and decentralized solutions will create new market opportunities for our products. We believe that we can participate in this future electrical grid in a bigger way by utilizing our products and solutions as DERs by grid operators. This will require intelligent software platforms that are able to optimize an increasingly complex supply and demand equation at both the individual site and grid level, such as our Concerto DERMS software. Our residential and C&I connectivity, controls, and energy management capabilities will also enable new recurring revenue opportunities as grid services programs continue to build out over time. Additionally, we believe that growing interest in our C&I generator and BESS solutions that can be deployed in multi-asset microgrid and “beyond standby” applications will continue to emerge and create incremental market opportunities in the future. The significant advancements made in recent years in the connectivity of our products are core to these newer capabilities, which have played a key role in the evolution of Generac into an energy technology solutions company.\n\nSolar, storage, and energy management markets continue to develop\n. We believe the electric utility landscape will undergo significant changes in the decade ahead due to accelerating demand growth, grid instability and power quality issues, environmental concerns, and the continuing performance and cost improvements in renewable energy and energy storage technologies. Importantly, we expect that a confluence of factors will continue to drive meaningful increases in power prices for end users in the future. As a result, on-site power generation from renewable sources and cleaner-burning natural gas generators are projected to become more prevalent as will the need to monitor, manage, and store this power – potentially developing into a significant market opportunity as utility customers seek alternative solutions to combat rising power prices. In addition, battery storage provides customers another source of power resiliency for shorter duration outages. Additionally, these markets are currently being supported by significant subsidies and investment tax credits for consumers and businesses to help advance the adoption of clean energy technologies. Further, production tax credits are being offered to businesses that meet certain domestic manufacturing requirements in the production of renewable energy products. While the expected duration of these subsidies and tax credits may change, we believe the overall mega-trends that are driving the solar, storage, and energy management markets currently provide sufficient incentive for long-term, value-creating investments for market participants in this space. Given the significant market opportunity ahead of us, we expect to further advance our capabilities in energy technology by increasing our product development, sourcing, distribution, and marketing efforts. In addition, we plan to leverage our significant competencies in the residential standby generator market to build our market position in the emerging residential solar, storage, and energy management markets.\n\nWe have the industry's largest network of factory direct independent generator dealers in North America. Our residential dealer network is made up of electrical and HVAC contractors across the US and Canada. These dealers sell, install and service our residential and light commercial generators to end users. Over the years, we have made significant investments to grow this dealer network, and we will continue to make those investments in the future given the importance of this channel. We continue to focus on a variety of initiatives to more effectively market and sell our home standby products and better align our dealer network with Generac. We will continue our efforts to improve customer lead quality, nurture those leads, and develop our dealers, all with a goal of increasing close rates and lowering our cost per lead over time. Over the years, we have made significant investments in our proprietary in-home selling system for residential dealers that we call “Power Play”. We are continuously making enhancements to this platform, again with the objective of improving the customer experience and overall close rates. Additionally, our remote monitoring platform allows our residential generator dealers to monitor their installed base of customers through a feature that we call “Fleet”, enabling them to offer a more proactive experience to service a customer’s generator. By offering the best product line, pricing, marketing, tools, programs, and customer support, we believe we have built the strongest dealer network in the home standby generator industry.\n\nAs the product category leader, we believe we have the broadest line of home standby generators in the marketplace. Every home standby generator that we offer is equipped with Mobile Link™. This remote monitoring capability is a standard feature that allows our customers to check the status of their generator remotely from their smart phone or tablet and also provides the capability to similarly receive maintenance and service alerts. This remote monitoring information can also be accessed by our dealers to help them monitor their installed base of products and proactively support their customers. The data that is provided by this remote monitoring functionality also allows us to better understand our products in the field, while optimizing both product quality and customer satisfaction. We also offer propane tank monitoring solutions, a technology that we acquired in 2021 via Tank Utility Inc. (Tank Utility), an IoT propane tank monitoring solutions company. This additional monitoring capability drives further incremental value to our dealers and peace of mind to owners of our home standby generators that use propane as a fuel source.\n\nOur “Other products and services” category primarily consists of aftermarket service parts and product accessories sold to our customers, installation and maintenance services, extended warranty revenue, grid services and other software-related subscription revenue, remote monitoring subscription revenue, and other project management service offerings provided by our owned industrial distributors.\n\nWe also sell direct to certain customers that are the end users of our products covering a variety of end market verticals both domestically and around the world. This includes telecommunication, retail, data centers, banking, energy, healthcare, convenience stores, grocery stores, restaurants, governments, and other commercial applications. We have developed a diverse, global sales force that calls on these opportunities directly and helps customize solutions to each customer’s needs in their local markets. Additionally, certain of our residential products are sold direct to individual consumers, who are the end users of the product. In the grid services space, we sell software and equipment direct to utilities and grid operators.\n\nWe have been providing power generation and resiliency solutions for homes and businesses for decades. Leveraging that expertise in power generation, Generac has made significant investments in recent years to expand its capabilities into energy technology solutions, beginning with the March 2019 acquisition of Neurio Technology Inc., a leading energy data company focused on monitoring technology and sophisticated analytics to optimize energy use within a home or business. This was followed by the April 2019 acquisition of Pika Energy Inc. (Pika Energy), a designer and manufacturer of battery storage technologies that capture and store solar or other power sources for homeowners and businesses. In October 2020, the Company acquired Enbala Power Networks Inc., one of the leading providers of distributed energy optimization and control software that helps support the operational stability of the world’s power grids. In July 2021, Generac added to its residential clean energy portfolio with the acquisition of Chilicon Power LLC (Chilicon), a designer and provider of grid-interactive rooftop power inversion devices and monitoring solutions for the solar market. Although we do not believe battery storage applications will displace traditional engine driven backup generators used for power resiliency in the short or medium term, our strategy and continued investment in such energy technology solutions will help ensure Generac maintains its leadership as an energy solutions provider as battery technology evolves over time. With these acquisitions, Generac has established a presence in the rapidly developing residential clean energy market, focused on solar and battery storage solutions, as well as grid services platforms and grid-connected solutions. With these investments, we are able to provide another source of power resiliency that complements our traditional backup power business.\n\nGenerac’s efforts in expanding its energy technology solutions extend to C&I and international markets as well. In June 2021, the Company acquired Deep Sea Electronics Limited (Deep Sea), a UK-based designer and manufacturer of advanced controls for a range of power generation and other applications used around the world. In September 2021, Generac acquired Off Grid Energy Ltd., a designer and manufacturer of industrial-grade mobile energy storage systems serving predominantly rental markets. The Company advanced its C&I connectivity strategy with the October 2022 acquisition of Blue Pillar, an industrial internet of things (IoT) platform developer that designs, deploys, and manages industrial IoT solutions. Blue Pillar provides a foundation to connect, monitor, and manage our C&I products to further enable their use in grid services programs. In February 2023, Generac acquired REFU Storage Systems GmbH (REFU), a German-based developer and supplier of battery storage and inverter hardware products, advanced software, and platform services for the commercial and industrial markets. RE",
  "item7_clean": "Effect of commodity, currency, component price fluctuations, and resource availability.\nIndustry-wide price fluctuations of key commodities, such as steel, copper and aluminum, along with other components we use in our products, as well as changes in labor costs required to produce our products, can have a material impact on our results of operations. Acquisitions in recent years have increased our use of advanced electronic components and battery cells, as well as further expanded our commercial and operational presence outside of the United States. Our international acquisitions, along with our existing global supply chain, expose us to fluctuations in foreign currency exchange rates and regulatory tariffs that can also have a material impact on our results of operations.\n\nOur research and development expenses include mechanical engineering, electronics engineering, and software development costs and support numerous projects covering all of our product lines. They also support our connectivity, grid services, remote monitoring, and energy management initiatives. We operate engineering facilities with extensive capabilities at many locations around the world with a focus on new product development, existing product improvement and cost containment. We are committed to innovation, research and development and rely on a combination of patents and trademarks to establish and protect our proprietary rights. Our research and development costs are expensed as incurred.\n\nOur operating expenses consist of costs incurred to support our sales, marketing, distribution, service parts, warranty, engineering, information systems, human resources, accounting, finance, risk management, legal and tax functions, among others. These expenses include, among others, personnel costs such as salaries, bonuses, employee benefit costs, payroll taxes, and share-based compensation cost, and are classified into three categories: selling and service, research and development, and general and administrative. Additionally, the amortization expense related to our finite-lived intangible assets is included within operating expenses.\n\nTo supplement our consolidated financial statements presented in accordance with U.S. GAAP, the Company provides the computation of Adjusted EBITDA attributable to the Company, which is defined as net income before noncontrolling interests adjusted for the following items: interest expense, depreciation expense, amortization of intangible assets, income tax expense, certain non-cash gains and losses including certain purchase accounting adjustments and contingent consideration adjustments, share-based compensation expense, certain transaction costs and credit facility fees, business optimization expenses, provision for certain legal and regulatory charges, certain other specific provisions, mark-to-market gains and losses on a minority investment, and Adjusted EBITDA attributable to noncontrolling interests. The provision for legal and regulatory charges adjusts for matters that are significant and not part of the ordinary routine litigation or regulatory matters incidental to the Company’s business, such as large suits and settlements, class action lawsuits, government inquiries, and certain intellectual property litigation. The adjustments to net income in computing Adjusted EBITDA are set forth in the reconciliation table below. The computation of Adjusted EBITDA is based primarily on the definition included in our Amended Credit Agreement.\n\nIn preparing the financial statements, management is required to make estimates and assumptions that have an impact on the asset, liability, revenue and expense amounts reported. These estimates can also affect our supplemental information disclosures, including information about contingencies, risk and financial condition. We believe, given current facts and circumstances, that our estimates and assumptions are reasonable, adhere to U.S. GAAP, and are consistently applied. Inherent in the nature of an estimate or assumption is the fact that actual results may differ from estimates and estimates may vary as new facts and circumstances arise. We make routine estimates and judgments in determining net realizable value of accounts receivable, inventories, property and equipment, prepaid expenses, product warranties and other reserves. Management believes our most critical accounting estimates and assumptions are in the following areas: goodwill and other indefinite-lived intangible asset impairment assessment; and income taxes. The following is a discussion of critical accounting estimates in each of these areas.\n\nSelling and service.\nOur selling and service expenses consist primarily of personnel costs, marketing expense, standard assurance warranty expense, bad debt provisions, and other sales expenses. Our personnel costs recorded in selling and services expenses include the expense of our sales force, customer support teams, outbound shipping and distribution functions, and other personnel involved in the marketing, sales and service of our products. Standard warranty expense is estimated based on historical trends or based on specific warranty matters as they become known and reasonably estimable. Our marketing expenses include media advertising, promotional expenses, co-op advertising costs, direct mail costs, printed material costs, product display costs, market research expenses, and trade show expenses. Marketing expenses are generally related to the launch of new product offerings, opportunities to create market awareness for our products, and general brand awareness marketing efforts. Our marketing campaigns are an important source for lead generation.\n\nGross profit margin for the year ended December 31, 2024, was 38.8% compared to 33.9% for the year ended December 31, 2023. The increase in gross profit margin was primarily driven by favorable sales mix, including higher home standby generator sales, the realization of lower input costs, and plant efficiencies.\n\n• A provision for judgments, settlements, and legal expenses related to certain patent lawsuits - $9.2 million in 2024; $27.3 million in 2023.\n• Legal expenses related to certain class action lawsuits - $1.3 million in 2024; $1.0 million in 2023.\n• A bad debt provision and additional customer support costs related to a clean energy product customer that filed for bankruptcy in 2022 – $0.4 million additional customer support costs in 2024; $4.4 million additional customer support costs in 2023; $17.9 million bad debt provision in 2022.\n• A provision for a matter with the CPSC concerning the imposition of civil fines for allegedly failing to timely submit a report under the Consumer Product Safety Act (CPSA) in relation to certain portable generators that were subject to a voluntary recall previously announced on July 29, 2021 - $5.8 million in 2023; $10.0 million in 2022.\n\nTo further supplement our consolidated financial statements in accordance with U.S. GAAP, we provide the computation of Adjusted Net Income attributable to the Company, which is defined as net income before noncontrolling interests adjusted for the following items: amortization of intangible assets, amortization of deferred financing costs and original issue discount related to the Company's debt, intangible impairment charges, certain transaction costs and other purchase accounting adjustments, business optimization expenses, provision for certain legal and regulatory charges, certain other specific provisions, mark-to-market gains and losses on a minority investment, other non-cash gains and losses, and adjusted net income attributable to non-controlling interests, as set forth in the reconciliation table below.\n\nThe principal sourced raw materials used in the manufacturing process are steel, copper and aluminum. We are susceptible to fluctuations in the cost of these commodities, impacting our costs of goods sold. We seek to mitigate the impact of commodity price changes on our business through a continued focus on global sourcing, product design improvements, manufacturing efficiencies, price increases and select hedging transactions. We are also impacted by foreign currency fluctuations given our global supply chain. There is typically a lag between raw material price fluctuations and their effect on our costs of goods sold.\n\nIn July 2022, our Board approved a stock repurchase program, which commenced on August 5, 2022, and allowed for the repurchase of up to $500.0 million of our common stock over a 24-month period. Additionally, on February 12, 2024, our Board approved a new stock repurchase program that allows for the repurchase of up to $500.0 million of our common stock over the next twenty-four months. The new program replaced the prior share repurchase program, which had approximately $26.3 million remaining available for repurchase when the new program was approved. Pursuant to the approved program, we may repurchase our common stock from time to time, in amounts and at prices we deem appropriate, subject to market conditions and other considerations. The repurchases may be executed using a combination of Rule 10b5-1 trading plans, open market purchases, privately negotiated agreements, or other transactions. The actual timing, number and value of shares repurchased under the program will be determined by management at its discretion and in compliance with the terms of our credit agreements. The repurchases may be funded with cash on hand, available borrowings, or proceeds from potential debt or other capital markets sources. The stock repurchase program may be suspended or discontinued at any time without prior notice. As of December 31, 2024, the remaining unused buyback authorization was $347,257.\n\nWe believe Adjusted EBITDA is used by securities analysts, investors and other interested parties in the evaluation of the Company. Management believes the disclosure of Adjusted EBITDA offers an additional financial metric that, when coupled with results prepared in accordance with U.S. generally accepted accounting principles (U.S. GAAP) and the reconciliation to U.S. GAAP results, provides a more complete understanding of our results of operations and the factors and trends affecting our business. We believe Adjusted EBITDA is useful to investors for the following reasons:\n\nThe principal elements of costs of goods sold are component parts, raw materials, inbound and outbound freight, factory overhead and labor. The principal component parts are engines, alternators, batteries, electronic controls, and steel enclosures. We design and manufacture air-cooled engines for certain of our generators up to 26kW, along with certain liquid-cooled, natural gas engines. We source engines for certain of our smaller products and all of our diesel products. For certain natural gas engines, we source the base engine block, and then add a significant amount of value engineering, sub-systems and other content to the point that we are recognized as the original equipment manufacturer (OEM) of those engines. We design and manufacture many of the alternators for our generators. We also manufacture other generator components where we believe we have a design and cost advantage. We source component parts from an extensive global network of reliable, high-quality suppliers. In some cases, these relationships are proprietary. For certain energy technology products, we source these products complete from certain contract manufacturers using our designs.\n\nFurthermore, as noted above, one of our uses of Adjusted EBITDA is as a target for determining elements of compensation for our senior executives. At the same time, some or all of these senior executives have responsibility for monitoring our financial results, generally including the adjustments in calculating Adjusted EBITDA (subject ultimately to review by our Board in the context of the Board's review of our financial statements). While many of the adjustments (for example, transaction costs and credit facility fees), involve mathematical application of items reflected in our financial statements, others involve a degree of judgment and discretion. While we believe all of these adjustments are appropriate, and while the calculations are subject to review by our Board in the context of the Board's review of our financial statements, and certification by our Chief Financial Officer in a compliance certificate provided to the lenders under our Amended Credit Agreement, this discretion may be viewed as an additional limitation on the use of Adjusted EBITDA as an analytical tool.\n\nThe increase in other expense, net in 2024 was driven primarily by a $38.0 million expense for the change in fair value of our investment in warrants and equity securities of Wallbox N.V., and a $4.9 million loss on extinguishment of debt. This was partially offset by a $3.3 million increase in investment income driven by higher cash on hand and a $7.9 million decrease in interest expense driven by decreased borrowings and interest rates compared to the prior year comparable period.\n\nWe believe Adjusted Net Income is used by securities analysts, investors and other interested parties in the evaluation of our company’s operations. Management believes the disclosure of Adjusted Net Income offers an additional financial metric that, when used in conjunction with U.S. GAAP results and the reconciliation to U.S. GAAP results, provides a more complete understanding of our ongoing results of operations, and the factors and trends affecting our business.\n\nThe balance of cost of goods sold include our manufacturing and warehousing facilities, factory overhead, labor and shipping costs. Factory overhead includes utilities, insurance, support personnel, depreciation, general supplies, and maintenance. Although we attempt to maintain a flexible manufacturing cost structure, our margins can be impacted if we cannot timely adjust labor and manufacturing costs to match fluctuations in net sales.\n\nGeneral and administrative.\nOur general and administrative expenses include personnel costs for accounting, information technology, human resources, legal, general and administrative employees; legal and professional services fees; information technology costs; insurance; travel and entertainment expense; adjustments to contingent acquisition consideration; share-based compensation costs; and other corporate expenses.\n\nwe do not consider indicative of our ongoing operating performance, such as non-cash write-downs and other charges, non-cash gains, write-offs relating to the retirement of debt, severance costs and other restructuring-related business optimization expenses, provision for certain legal and regulatory charges, certain other specific provisions, and mark-to-market gains and losses on a minority investment;\n\nOur primary cash requirements include payment for raw materials and components, salaries and benefits, facility and lease costs, operating expenses, interest and principal payments on debt, and capital expenditures. We finance our operations primarily from cash flow generated from operations and, if necessary, borrowings under our revolving credit facility.\n\nAdjusted EBITDA margins for the international segment, before deducting for non-controlling interests, for the year ended December 31, 2024, were 13.2% of international segment total sales compared to 13.7% in the prior year. This margin decrease was primarily due to reduced operating leverage on lower shipments during the year.\n\nNet income attributable to Generac Holdings Inc.\nNet income attributable to Generac Holdings Inc. was $316.3 million as compared to $214.6 million in the prior year period. The increase was primarily driven by higher sales and gross margin, as noted above.\n\nThe increase in net cash provided by operating activities was primarily driven by higher operating earnings coupled with a larger decrease in working capital in the current year p",
  "item2_clean": null
}