{
  "source_file": "gnrc20250930_10q.htm",
  "form_type": "10-Q",
  "item1_clean": null,
  "item7_clean": null,
  "item2_clean": "The forward-looking statements contained in this quarterly report are based on assumptions that we have made in light of our industry experience and on our perceptions of historical trends, current conditions, expected future developments and other factors we believe are appropriate under the circumstances. As you read and consider this report, you should understand that these statements are not guarantees of performance or results. They involve risks, uncertainties (some of which are beyond our control) and assumptions. Although we believe that these forward-looking statements are based on reasonable assumptions, you should be aware that many factors could affect our actual financial results and cause them to differ materially from those anticipated in the forward-looking statements. The forward-looking statements contained in this quarterly report include estimates and comments regarding:\n\nThis quarterly report contains forward-looking statements that are subject to risks and uncertainties. Forward-looking statements give our current expectations and projections relating to our financial condition, results of operations, plans, objectives, future performance and business. You can identify forward-looking statements by the fact that they do not relate strictly to historical or current facts. These statements may include words such as “anticipate,” “estimate,” “expect,” “forecast,” “project,” “plan,” “intend,” “believe,” “confident,” “may,” “should,” “can have,” “likely,” “future,” “optimistic” and other words and terms of similar meaning in connection with any discussion of the timing or nature of future operating or financial performance or other events.\n\nPower quality issues continue to increase\n. Power disruptions are an important driver of consumer awareness for backup power and have historically influenced demand for generators both in the United States and internationally. Increased frequency and duration of major power outage events, that have a broader impact beyond a localized level, increases product awareness and may drive consumers to accelerate their purchase of a standby or portable generator during the immediate and subsequent period, which we believe may last for six to twelve months following a major outage event. Energy storage systems offer similar resiliency advantages to consumers and can benefit from these same awareness drivers, at least for short duration power outages. The optional standby market for C&I power generation is also driven by power quality issues and the related need for backup power. The impact of climate change has received increased global focus in recent years, and an aging and underinvested electrical grid infrastructure remains highly vulnerable to the expectation of more severe and volatile weather. Additionally, rapid growth in renewable power sources such as solar and wind is resulting in increased intermittency of supply as more traditional thermal generation assets are retired, further impairing the reliable supply of electricity. At the same time, power demand is expected to meaningfully accelerate as a result of the rapid adoption of artificial intelligence and related data center energy requirements, the re-industrialization of North America, and the electrification of a wide range of consumer and commercial products, including transportation, HVAC systems, and other major appliances. These developments are causing growing supply/demand imbalances for grid operators across North America, which has led to high-profile examples of rolling blackouts and calls for utility customers to reduce consumption to maintain grid integrity. In fact, the North American Electric Reliability Corporation has labeled significant portions of the United States and Canada as being at high or elevated risk of resource adequacy shortfalls in the 2025-2029 period due in part to these supply/demand dynamics. We believe utility supply shortfalls and related warnings may continue in the future, resulting in continued deterioration of power quality in North America. Finally, certain utilities are adopting preventative power shutoff policies to reduce the risk of wildfires caused by their electrical distribution equipment, predominately in the western half of the country. Taken together, we expect these factors to continue driving increased awareness of the need for backup power and demand for Generac’s products within multiple categories.\n\nSolar, storage, and energy management marke\n. We believe the electric utility landscape will undergo significant changes in the decade ahead due to accelerating demand growth, grid instability and power quality issues, environmental concerns, and the continuing performance and cost improvements in renewable energy and energy storage technologies. Importantly, we expect that a confluence of factors will continue to drive meaningful increases in power prices for end users in the future. As a result, on-site power generation from renewable sources and cleaner-burning natural gas generators are projected to become more prevalent as will the need to monitor, manage, and store this power – potentially developing into a significant market opportunity as utility customers seek alternative solutions to combat rising power prices. In addition, battery storage provides customers another source of power resiliency for shorter duration outages. These markets have historically been supported by subsidies and investment tax credits for consumers and businesses to help advance the adoption of clean energy technologies. Further, production tax credits are being offered to businesses that meet certain domestic manufacturing requirements in the production of renewable energy products.\nOn July 4, 2025, the United States signed into law the OBBBA. The OBBBA accelerates the phase-out of tax incentives for the solar market and includes certain supply chain requirements to qualify for these incentives. While the change in the availability and duration of tax incentives will negatively impact the solar and storage markets in the near term,\nwe believe the overall mega-trends that are driving the solar, storage, and energy management markets currently provide sufficient incentive for long-term, value-creating investments for market participants in this space. Given the significant long-term market opportunity, we expect to further improve our capabilities in energy technology product development, sourcing, distribution, and marketing. In addition, we plan to leverage our significant competencies in the residential standby generator market to increase our market position in the residential solar, storage, and energy management markets as we continue to build out our residential ecosystem of products and solutions.\n\nOn July 1, 2025, we amended our Original Tranche A Term Loan Facility a\nnd Original Revolving Facility, extending the maturity of both to July 1, 2030, revising the Original Tranche A Term Loan Facility outstanding principal balance to $700 million, reducing the Original Revolving Facility borrowing capacity to $1 billion and redefining the Term Benchmark (as defined in the Prior Amended Credit Agreement) to replace the Adjusted Term SOFR Rate (as defined in the Prior Amended Credit Agreement) with the Term SOFR Rate (as defined in the New Credit agreement), resulting in an interest rate reduction of 0.10%. The New Tranche A Term Loan Facility is repayable in increasing quarterly installments over time, equal to 0.625% to 2.50% of the original principal amount, beginning on October 1, 2026. The New Tranche A Term Loan Facility and the New Revolving Facility bear interest at a rate based on SOFR plus an applicable margin between 1.25% and 1.75%, both based on our total leverage ratio and subject to a SOFR floor of 0.0%.\nAs of September 30, 2025, the interest rate for the New Tranche A Term Loan Facility and the New Revolving Faci\n\nImpact of business capital investment and other economic cycles.\nThe global market for our C&I products is affected by different capital investment cycles, which can vary widely across the different regions and markets that we serve. These cycles include non-residential building construction, durable goods and infrastructure spending, as well as investments in the build out of data centers, as businesses or organizations either add new locations or make investments to upgrade existing locations or equipment. These trends and market conditions can have a material impact on demand for our C&I products. The capital investment cycle may differ for the various C&I end markets that we serve, including light commercial, retail, office, telecommunications, rental, industrial, data centers, healthcare, construction, oil & gas, and municipal infrastructure, among others. The market for these products is also affected by general economic conditions, fluctuations in interest rates, and geopolitical matters in the various countries where we serve, as well as credit availability in those regions.\n\nHome standby penetration opportunity is significant\n. Many potential customers are still not aware of the costs and benefits of automatic backup power solutions. With only approximately 6.5% penetration of the addressable market of homes in the United States (which we define as single-family detached, owner-occupied households with a home value of over $175,000, as defined by the U.S. Census Bureau's 2023 American Housing Survey for the United States), we believe there are significant opportunities to further penetrate the residential standby generator market both domestically and internationally. In addition to the mega-trends supporting growth of the category, we believe by expanding and developing our distribution network, continuing to invest in our product lines and technologies, and targeting our marketing efforts, we can continue to build awareness and increase penetration for our home standby generators.\n\nImpact of residential investment cycle.\nThe marke"
}