{
  "source_file": "goog-20241231.htm",
  "form_type": "10-K",
  "item1_clean": "Google Cloud helps customers solve today’s business challenges, improve productivity, reduce costs, and unlock new growth engines. We are continually innovating and building new products and features to help our users, partners, customers, and communities and have invested more than $150 billion in research and development in the last five years in support of these efforts.\nMaking AI Helpful for Everyone\nWe believe AI is a profound platform shift, one that can bring meaningful and positive change to people and societies across the world, and to our business. At Google, we have been bringing AI into our products and services for more than a decade and making them available to our users.\nIn 2023, we took a significant step on our journey to make AI more helpful for everyone with the introduction of Gemini, our natively multimodal AI model. In 2024, we launched Gemini 2.0, our most capable model yet. Gemini can generalize and seamlessly understand, operate across, and combine different types of information including text, code, audio, image, and video. Gemini is powering AI features across our products and services that are helping people everyday. Today, all seven of our two billion-user products — Android, Chrome, Gmail, Maps, Play Store, Search, and YouTube — are using Gemini.\nOur Google Cloud products, including Google Cloud Platform and Google Workspace, help organizations stay at the forefront of innovation with our AI-optimized infrastructure, AI development platform, world-class models, as well as assistive agents and applications.\nWe believe AI has the potential to solve important societal, scientific, and engineering challenges. For example, in 2020, Google DeepMind’s AlphaFold system solved a 50-year-old protein folding challenge, and in 2024, we introduced AlphaFold 3, built on the previous models, to predict the structure and interactions of all the molecules in life's processes.\nWe are focused on transforming our products to provide the most helpful tools to our users and customers as we deliver on our mission to organize the world’s information and make it universally accessible and useful.\nDeliver the Most Advanced, Safe, and Responsible AI\nWe aim to build the most advanced, safe, and responsible AI through a full stack of robust AI-optimized infrastructure, including data centers, chips, and a global fiber network; world class research teams; and a broad global reach through products and platforms that touch billions of people and customers around the world.\nWe are driving efficiencies in our data centers, while making significant hardware and model improvements. For example, since we started serving AI Overviews to our users, we have significantly lowered machine costs and latency through hardware, engineering, and technical breakthroughs. Our AI-optimized infrastructure allows us to use, and offer our customers, a range of AI accelerator options, including our own custom-built Tensor Processing Units (TPUs).\nOur teams across Alphabet leverage Gemini, as well as other AI models we have previously developed and announced, to deliver the best product and service experiences for our users, advertisers, partners, customers, and developers. We are using Gemini 2.0 in new research prototypes, including Project Astra, which explores the future capabilities of a universal AI assistant and Project Mariner, an early prototype capable of taking actions in Chrome as an experimental extension.\nWe believe our approach to AI must be both bold and responsible. That means developing AI in a way that maximizes the positive benefits to society while addressing its potential challenges, guided by our AI Principles.\nEnable Organizations and Developers to Innovate on Google Cloud\nAI is a major technology shift for enterprises. Globally, businesses from startups to large enterprises, and the public sector are thinking about how to drive transformation. That is why we are focused on making it easy and scalable for others to innovate, and grow, with AI. That means providing advanced computing infrastructure and expanding access to Google’s latest AI models. Our Vertex AI platform gives developers the ability to train, tune, augment, test, and deploy applications using Gemini, Imagen, Veo, and other generative AI models. Gemini for Google Cloud provides pre-packaged AI agents that can assist developers to write, document, test, and operate software as well as assist cybersecurity teams to analyze, detect, protect, and respond to threats.\nImprove Knowledge, Learning, Creativity, and Productivity\nAs AI continues to improve rapidly, we are focused on transforming our products to provide our users the most helpful tools. Examples include AI Overviews, which allow users to ask their most complex questions, break down concepts in a format that is useful for them, or take a video and ask a question out loud, and NotebookLM, which helps users understand complex information by summarizing sources and providing relevant quotes. We are embedding the power of generative AI to continue helping our users express themselves and get things done. For example, the Gemini app allows users to collaborate with new AI features that include image generation capabilities, coding support, and app integration. Gemini for Google Workspace helps users write, organize, visualize, accelerate workflows, and have richer meetings. Additionally, we are using Gemini to improve recommendations on YouTube. We also know businesses of all sizes around the world rely on Google Ads to find customers and grow their businesses — and we\nmake that even easier with AI. For example, advertisers are able to use our updated image generation in Google Ads to produce high-quality imagery for their campaigns, and Demand Gen helps them reach their target audiences.\nBuild the Most Helpful Personal Computing Platforms and Devices\nOver the years, our Pixel phones have incorporated AI compute directly into the device and built experiences on top of it. Our latest Pixel devices were built with Gemini Nano, bringing the best AI-assistive experiences to our users, such as Gemini on Pixel, Pixel Screenshots, and Pixel Studio. Our Android and Chrome operating systems enable users to access Gemini, and other Google AI features throughout their day. For example, with Circle to Search built directly into the Android experience, users can search anything they see on their phone using a simple gesture.\nMany companies get comfortable doing what they have always done, making only incremental changes. This incrementalism leads to irrelevance over time, especially in technology, where change tends to be revolutionary, not evolutionary. Our acquisitions of YouTube and Android and subsequent launch of Chrome have matured into major platforms for digital video and mobile devices and a safer, popular browser. In Other Bets, our fully autonomous driving technology company, Waymo, is now providing fully autonomous, paid ride-hailing services to customers in multiple cities.\nOur early investments in AI started out as moonshots but are now incorporated into our core products and central to future developments. We continue to look toward the future and to invest for the long term, most notably for the application of AI to our products and services, as well as other frontier technologies such as quantum computing.\nAs we said in the original founders' letter, we will not shy away from high-risk, high-reward projects that we believe in, as they are the key to our long-term success.\nPrivacy and Security\nWe make it a priority to protect the privacy and security of our products, users, and customers, even if there are near-term financial consequences. We do this by continuously investing in building products that are secure by default; strictly upholding responsible data practices that emphasize privacy by design; and building easy-to-use settings that put people in control. We are continually enhancing these efforts over time, whether by enabling users to auto-delete their data, applying privacy technologies like on-device processing, giving people tools to control their experience, or advancing anti-malware, anti-phishing, and password security features.\nFor reporting purposes Google comprises two segments: Google Services and Google Cloud.\nWe have always been committed to building helpful products that can improve the lives of millions of people worldwide. Our product innovations are what make our services widely used, and our brand one of the most recognized in the world. Google Services' core products and platforms include ads, Android, Chrome, devices, Gmail, Google Drive, Google Maps, Google Photos, Google Play, Search, and YouTube, with broad and growing adoption by users around the world.\nOur products and services have come a long way since the company was founded more than 25 years ago. While Google Search started as a way to find web pages, organized into ten blue links, we have driven technical advancements and product innovations that have transformed Google Search into a dynamic, multimodal experience. We first expanded from traditional desktop browsers into mobile web search, making it easier to navigate on smaller screens. As new types of content surfaced on the internet, Universal Search made it possible to search multiple content types, like news, images, videos, and more, to deliver rich, relevant results. The introduction of new search modalities, like voice and visual search, made it easier for people to express their curiosity in natural and intuitive ways. We took that a step further with multisearch, which lets people search with text and images at the same time. Large language models have made it possible to express more natural language queries, vastly improving the types of questions users can ask, and the quality of results. Each advancement has made it easier and more natural for people to find what they are looking for. We are now using Gemini customized for Google Search to provide our users an improved Search experience, and AI Overviews has been released in more than one hundred countries, reaching more than one billion users.\nThis drive to make information more accessible and helpful has led us over the years to improve the discovery and creation of digital content both on the web and through platforms like Google Play and YouTube. People are consuming many forms of digital content, including watching videos, streaming TV, playing games, listening to music,\nreading books, and using apps. Working with content creators and partners, we continue to build new ways for people around the world to create and find great digital content.\nFueling all of these great digital experiences are extraordinary platforms and devices. That is why we continue to invest in platforms like our Android mobile operating system, Chrome browser, and Chrome operating system, as well as our family of devices. We see tremendous potential for devices to be helpful and make people's lives easier by combining the best of our AI, software, and hardware. This potential is reflected in our latest generation of devices, such as the new Pixel 9 series and the Pixel Watch 3. Creating products and services that people rely on every day is a journey that we are investing in for the long-term.\nWe have built world-class advertising technologies for advertisers, agencies, and publishers to power their digital marketing businesses. Our advertising solutions help millions of companies grow their businesses through our wide range of products across devices and formats, and we aim to ensure positive user experiences by serving the right ads at the right time and by building deep partnerships with brands and agencies. AI has been foundational to our advertising business for more than a decade. Products like Demand Gen, Performance Max, and Product Studio use the full power of our AI to help advertisers find untapped and incremental conversion opportunities.\nGoogle Services generat",
  "item7_clean": "ITEM 7.\nMANAGEMENT’S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS\nUnderstanding Alphabet’s Financial Results\nAlphabet is a collection of businesses — the largest of which is Google. We report Google in two segments, Google Services and Google Cloud; we also report all non-Google businesses collectively as Other Bets. For further details on our segments, see Part I, Item 1 Business and\nTrends in Our Business and Financial Effect\nThe following long-term trends have contributed to the results of our consolidated operations, and we anticipate that they will continue to affect our future results:\nUsers' behaviors and advertising continue to shift online as the digital economy evolves.\nThe continuing evolution of the online world has contributed to the growth of our business and our revenues since inception. We expect that this evolution will continue to benefit our business and our revenues, although at a slower pace than we have experienced historically. In addition, we face increasing competition for user engagement and advertisers, including from other developers and providers of AI products and services, which may affect our revenues.\nUsers continue to access our products and services using diverse devices and modalities, which allows for new advertising formats that may benefit our revenues but adversely affect our margins.\nOur users are accessing our products and services via diverse devices and modalities beyond traditional desktop, such as smartphones, wearables, connected TVs, and smart home devices, and want to be able to be connected no matter where they are or what they are doing. We are focused on expanding our products and services to stay in front of these trends in order to maintain and grow our business.\nWe benefit from advertising revenues generated from different channels, including mobile, and newer advertising formats. The margins from these channels and newer products have generally been lower than those from traditional desktop search. Additionally, as the market for a particular device type or modality matures, our advertising revenues may be affected. For example, changing dynamics within the global smartphone market, such as increased market saturation in developed countries, can affect our mobile advertising revenues.\nWe expect TAC paid to our distribution partners and Google Network partners to increase as our revenues grow and TAC as a percentage of our advertising revenues (\"TAC rate\") to be affected by changes in device mix; geographic mix; partner agreement terms; partner mix; the percentage of queries channeled through paid access points; product mix; the relative revenue growth rates of advertising revenues from different channels; and revenue share terms.\nWe expect these trends to continue to affect our revenues and put pressure on our margins.\nAs online advertising evolves, we continue to expand our product offerings, which may affect our monetization.\nAs interactions between users and advertisers change, and as online user behavior evolves, for example with AI, we continue to expand our product offerings to serve these changing needs, which may affect monetization of our products and services. We expect to continue to incorporate AI innovations into our products, such as AI in Search, that could affect our monetization trends. When developing new products and services we generally focus first on user experience and then on monetization.\nAs users in developing economies increasingly come online, our revenues from international markets continue to increase, and may require continued investments. In addition, movements in foreign exchange rates affect such revenues.\nThe shift to online, as well as the advent of the multi-device world, has brought opportunities outside of the U.S., including in emerging markets, such as India. We continue to invest heavily and develop localized versions of our products and advertising programs relevant to our users in these markets. This has led to a trend of increased\nrevenues from emerging markets. We expect that our results will continue to be affected by our performance in these markets, particularly as low-cost mobile devices become more available. This trend could affect our revenues as developing markets initially monetize at a lower rate than more mature markets.\nInternational revenues represent a significant portion of our revenues and are subject to fluctuations in foreign currency exchange rates relative to the U.S. dollar. While we have a foreign exchange risk management program designed to reduce our exposure to these fluctuations, this program does not fully offset their effect on our revenues and earnings.\nThe revenues that we derive beyond advertising are increasing and may adversely affect our margins.\nRevenues from cloud, consumer subscriptions, platforms, and devices, which may have differing characteristics than our advertising revenues, have grown over time, and we expect this trend to continue as we focus on expanding our products and services. The margins on these revenues vary significantly and are generally lower than the margins on our advertising revenues. For example, sales of our devices adversely affect our consolidated margins due to pressures on pricing and higher cost of sales.\nAs we continue to serve our users and expand our businesses, we will invest heavily in operating and capital expenditures.\nWe continue to make significant research and development investments in areas of strategic focus as we seek to develop new, innovative offerings, improve our existing offerings, and rapidly and responsibly deploy AI across our businesse\ns. We also expect to increase, relative to 2024, our i\nnvestment in our technical infrastructure, including servers, network equipment, and data centers, to support the growth of our business and our long-term initiatives, in particular in support of AI products and services. In addition, acquisitions and strategic investments remain important elements in our use of capital and contribute to the breadth and depth of our offerings, expand our expertise in engineering and other functional areas, and build strong partnerships around strategic initiatives.\nWe continue to face an evolving regulatory environment, and we are subject to claims, lawsuits, investigations, and other forms of potential legal liability, which could affect our business practices and financial results.\nOur employees are critical to our success and we expect to continue investing in them.\nRevenues and Monetization Metrics\nIn addition to the long-term trends and their financial effect on our business discussed above, fluctuations in our revenues have been and may continue to be affected by a combination of factors, including:\nchanges in foreign currency exchange rates;\nchanges in pricing, such as those resulting from changes in fee structures, discounts, and customer incentives;\ngeneral economic conditions and various external dynamics, including geopolitical events, regulations, and other measures and their effect on advertiser, consumer, and enterprise spending;\nnew product, service, and market launches; and\nAdditionally, fluctuations in our revenues generated from advertising (\"Google advertising\"), other sources (\"Google subscriptions, platforms, and devices\"), Google Cloud, and Other Bets have been, and may continue to be, affected by other factors unique to each set of revenues, as described below.\nGoogle Services revenues consist of Google advertising as well as Google subscriptions, platforms, and devices revenues.\nGoogle advertising revenues are comprised of the following:\nGoogle Search & other, which includes revenues generated on Google search properties (including revenues from traffic generated by search distribution partners who use Google.com as their default search in browsers, toolbars, etc.), and other Google owned and operated properties like Gmail, Google Maps, and Google Play;\nYouTube ads, which includes revenues generated on YouTube properties; and\nGoogle Network, which includes revenues generated on Google Network properties participating in AdMob, AdSense, and Google Ad Manager.\nWe use certain metrics to track how well traffic across various properties is monetized as it relates to our advertising revenues: paid clicks and cost-per-click pertain to traffic on Google Search & other properties, while impressions and cost-per-impression pertain to traffic on our Google Network properties.\nPaid clicks represent engagement by users and include clicks on advertisements by end-users on Google search properties and other Google owned and operated properties including Gmail, Google Maps, and Google Play. Cost-per-click is defined as click-driven revenues divided by our total number of paid clicks and represents the average amount we charge advertisers for each engagement by users.\nImpressions include impressions displayed to users on Google Network properties participating primarily in AdMob, AdSense, and Google Ad Manager. Cost-per-impression is defined as impression-based and click-based revenues divided by our total number of impressions, and represents the average amount we charge advertisers for each impression displayed to users.\nAs our business evolves, we periodically review, refine, and update our methodologies for monitoring, gathering, and counting the number of paid clicks and the number of impressions, and for identifying the revenues generated by the corresponding click and impression activity.\nFluctuations in our advertising revenues, as well as the change in paid clicks and cost-per-click on Google Search & other properties and the change in impressions and cost-per-impression on Google Network properties and the correlation between these items have been, and may continue to be, affected by factors in addition to the general factors described above, such as:\nadvertiser competition for keywords;\nchanges in advertising quality, formats, delivery or policy;\nchanges in device mix;\nseasonal fluctuations in internet usage, advertising expenditures, and underlying business trends, such as traditional retail seasonality; and\ntraffic growth in emerging markets compared to more mature markets and across various verticals and channels.\nGoogle subscriptions, platforms, and devices\nGoogle subscriptions, platforms, and devices revenues are comprised of the following:\nconsumer subscriptions, which primarily include revenues from YouTube services, such as YouTube TV, YouTube Music and Premium, and NFL Sunday Ticket, as well as Google One;\nplatforms, which primarily include revenues from Google Play sales of apps and in-app purchases;\ndevices, which primarily include sales of the Pixel family of devices; and\nother products and services.\nFluctuations in our Google subscriptions, platforms, and devices revenues have been, and may continue to be, affected by factors in addition to the general factors described above, such as changes in customer usage and demand, number of subscribers, and the timing of product launches.\nGoogle Cloud revenues are comprised of the following:\nGoogle Cloud Platform, which generates consumption-based fees and subscriptions for infrastructure, platform, and other services. These services provide access to solutions such as AI offerings including our AI infrastructure, Vertex AI platform, and Gemini for Google Cloud; cybersecurity; and data and analytics;\nGoogle Workspace, which includes subscriptions for cloud-based communication and collaboration tools for enterprises, such as Calendar, Gmail, Docs, Drive, and Meet, with integrated features like Gemini for Google Workspace; and\nother enterprise services.\nFluctuations in our Google Cloud revenues have been, and may continue to be, affected by factors in addition to the general factors described above, such as changes in customer usage and demand.\nRevenues from Other Bets are generated primarily from the sale of healthcare-related services, and internet services.\nOur cost structure has two components: cost of revenues and operating expenses. Our operating expenses include costs related to R&D, sales and marketing, and general and administrative functions. Certain of our costs and expenses, including those associated with the operation of our technical infrastructure as well as components of our operating expenses, are generally less variable in nature and may not correlate to changes in revenue. Additionally, fluctuations in employee compensation expenses may not directly correlate with changes in headcount, due to factors such as annual stock-based compensation (SBC) awards that generally vest over four years.\nCost of revenues is comprised of TAC and other costs of revenues.\namounts paid to our distribution partners who make available our search access points and services. Our distribution partners include browser providers, mobile carriers, original equipment manufacturers, and software developers; and\namounts paid to Google Network partners primarily for ads displayed on their properties.\nOther cost of revenues primarily includes:\ncontent acquisition costs, which are payments to content providers from whom we license video and other content for distribution, primarily related to YouTube (we pay fees to these content providers based on revenues generated, subscriber counts, or a flat fee);\ndepreciation expense related to our technical infrastructure;\nemployee compensation expenses related to our technical infrastructure and other operations such as content review and customer and product support;\ninventory and other costs related to the devices we sell; and\nother technical infrastructure operations costs, including network capacity, energy, and equipment costs.\nTAC as a percentage of revenues generated from ads placed on Google Network properties are significantly higher than TAC as a percentage of revenues generated from ads placed on Google Search & other properties, because most of the advertiser revenues from ads served on Google Network properties are paid as TAC to our Google Network partners.\nOperating expenses are generally incurred during our normal course of business, which we categorize as either R&D, sales and marketing, or general and administrative.\nThe main components of our R&D expenses are:\nemployee compensation expenses for engineering and technical employees responsible for R&D related to our existing and new products and services; and\nthird-party services fees primarily relating to consulting and outsourced services in support of our engineering and product development efforts.\nThe main components of our sales and marketing expenses are:\nemployee compensation expenses for employees engaged in sales and marketing, sales support, and certain customer service functions; and\nspend relating to our advertising and promotional activities in support of our products and services.\nThe main components of our general and administrative expenses are:\nemployee compensation expenses for employees in finance, human resources, information technology, legal, and other administrative support functions;\nexpenses relating to legal and other matters, including certain fines and settlements; and\nthird-party services fees, including audit, consulting, outside legal, and other outsourced administrative services.\nOther Income (Expense), Net\nOI&E, net primarily consists of interest income (expense), the effect of foreign currency exchange gains (losses), net gains (losses) and impairment on our marketable and non-marketable securities, performance fees, and income (loss) and impairment from our equity method investments.\nProvision for Income Taxes\n\nProvision for income taxes represents the estimated amount of federal, state, and foreign income taxes incurred in the U.S. and the many jurisdictions in which we operate. The provision includes the effect of reserve provisions and changes to reserves that are considered appropriate as well as the related net interest and penalties.\nThe following tabl",
  "item2_clean": null
}