{
  "source_file": "gpc-20250930.htm",
  "form_type": "10-Q",
  "item1_clean": null,
  "item7_clean": null,
  "item2_clean": "Nine Months Ended September 30,\nSelling, administrative and other expenses\nDepreciation and amortization\nProvision for doubtful accounts\nRestructuring and other costs\nTotal operating expense\nNon-operating (income) expense:\nInterest expense, net\nTotal non-operating (income) expense\nIncome before income taxes\nNine Months Ended September 30,\n(in thousands, except per share data)\nAdjusted diluted EPS\nAutomotive segment EBITDA\nIndustrial segment EBITDA\nTotal adjusted EBITDA\nAutomotive segment EBITDA margin\nIndustrial segment EBITDA margin\nCorporate EBITDA margin\nTotal adjusted EBITDA margin\nFor the three months ended September 30, 2025, net sales increased 4.9% compared to 2024. The increase was driven by a 2.3% increase in comparable sales, a 1.8% benefit from acquisitions and a favorable impact of foreign currency and other of 0.8%.\nFor the nine months ended September 30, 2025, net sales increased 3.2% compared to 2024. The increase was driven by a 2.5% benefit from acquisitions, a 0.6% increase in comparable sales and a favorable impact of foreign currency and other of 0.1%.\nDespite the challenging macroeconomic environment, our net sales for the three and nine months ended September 30, 2025, increased primarily due to growth in comparable sales and contributions from acquisitions. Additionally, net sales for the nine month period were affected by one fewer selling day in the U.S. compared to the prior year period.\nNet sales for the three months ended September 30, 2025 for Automotive were $4.0 billion, an increase of 5.0% from 2024. The increase is attributable to a 2.3% benefit from acquisitions, a 1.6% increase in comparable sales and a 1.1% favorable impact of foreign currency and other.\nNet sales for the nine months ended September 30, 2025 for Automotive were $11.6 billion, an increase of 4.2% from 2024. The increase is attributable to a 3.2% benefit from acquisitions and a 0.6% favorable impact of foreign currency and other. Comparable sales were essentially flat when compared to 2024.\nOur sales growth was driven by the contribution from our stores that were acquired over the last twelve months, which enhanced our ability to reach and serve our customers, and the favorable impact resulting from the strength of the Euro relative to the U.S. Dollar.\nNet sales for the three months ended September 30, 2025 for Industrial were $2.3 billion, an increase of 4.6% compared to 2024. The increase in sales reflects a 3.7% increase in comparable sales and 1.1% benefit from acquisitions, partially offset by a 0.2% unfavorable impact of foreign currency.\nNet sales for the nine months ended September 30, 2025 for Industrial were $6.7 billion, an increase of 1.6% compared to 2024. The increase in sales reflects a 1.2% benefit from acquisitions and a 0.9% increase in comparable sales, partially offset by a 0.5% unfavorable impact of foreign currency.\nThis sales growth was achieved despite the Purchasing Managers’ Index (\"PMI\") continuing to signal contraction and an overall soft industrial backdrop throughout the quarter.\nGross Profit and Gross Margin\nGross profit increased $143 million, or 6.5%, during the three months ended September 30, 2025 and gross margin increased 60 basis points to 37.4% compared to the prior year period. Gross profit increased $386 million, or 6.0%, during the nine months ended September 30, 2025 and gross margin increased 100 basis points to 37.4% compared to the prior year period. These increases primarily reflect the benefit of successful execution of our ongoing strategic pricing and sourcing initiatives and acquisitions completed in the prior year.\nSelling, Administrative and Other (\"SG&A\") Expenses\nSG&A expenses increased $84 million, or 4.8%, during the three months ended September 30, 2025 compared to the prior year period. The 4.8% increase comprised 2.4% from acquisitions and 2.4% from other cost increases.\nSG&A expenses increased $342 million, or 6.9%, during the nine months ended September 30, 2025 compared to the prior year period. The 6.9% increase comprised 4.0% from acquisitions and 2.9% from other cost increases.\nWe continued to experience higher SG&A expenses primarily due to higher salaries and wages, rising healthcare costs, and increased rent from lease renewals in a higher interest rate environment. We are managing the impact of the inflationary environment through our global restructuring initiatives, which we estimate had a $96 million benefit to SG&A for the nine months ended September 30, 2025.\nSG&A expenses as a percentage of sales remained flat at 28.8% compared to the prior year period. SG&A expenses as a percentage of sales increased 100 basis points to 28.9% of sales in the nine months ended September 30, 2025 compared to 27.9% last year. The increase for the nine months ended September 30, 2025 was primarily driven by the items discussed above.\nRestructuring and Other Costs\nWe incurred $67 million and $167 million of restructuring and other costs during the three months and nine months ended September 30, 2025, respectively, as part of our global restructuring plan which was approved and initiated in February 2024 and remains on track to better align our assets and further improve the efficiency of the business. Restructuring and other costs increased by $26 million compared to the prior period, reflecting costs associated with facility closures and additional severance costs. For additional details, refer to the Restructuring Footnote in the Notes to Condensed Consolidated Financial Statements.\nDepreciation and Amortization\nDepreciation and amortization expenses increased $21 million and $70 million for the three and nine months ended September 30, 2025, respectively, related to planned investments in technology and supply chain initiatives.\nNon-Operating Expenses and Income\nThis category primarily includes net interest expense, pension and investment income, foreign currency gains and losses, and fees associated with our Accounts Receivable Sales Agreement (\"A/R Sales Agreement\").\nWe incurred $43 million in net non-operating expenses for the three months ended September 30, 2025, a $18 million change from $24 million in net non-operating expense in the prior year period. The $18 million expense increase primarily includes the effects of a $13 million increase in net interest expense in 2025, due to increased borrowings, as well as a $13 million decrease in pension income as a result of changes in expected returns due to the planned termination of our U.S. pension plan.\nFor the nine months ended September 30, 2025, we incurred $117 million in net non-operating expenses, a $86 million change from the prior year period. The $86 million expense increase primarily includes the effects of a $50 million increase in net interest expense in 2025, due to increased borrowings, and a $40 million decrease in pension income as a result of changes in expected returns due to the planned termination of our U.S. pension plan.\nOur effective income tax rates decreased to 22.5% for the three months ended September 30, 2025 compared to 23.9% for the three months ended September 30, 2024. Our effective income tax rates were 23.4% and 23.6% for nine months ended September 30, 2025 and 2024, respectively. The rate decrease for the three and nine month period is primarily due to comparative restructuring costs and expanded investments, which was partially offset by routine tax position adjustments.\nThe effective tax rates for the three and nine months ended September 30, 2025 consider the enactment of One Big Beautiful Bill Act (\"OBBBA\") on July 4, 2025, which did not have a material impact to income tax expense. OBBBA is not expected to materially impact our 2025 annual effective tax rate.\nNet Income and Adjusted Net Income\nNet income was $226 million for the three months ended September 30, 2025, a decrease of 0.2% compared to net income of $227 million for the prior year period. On a per share diluted basis, net income was $1.62 for both periods. For the nine months ended September 30, 2025 net income was $675 million, a decrease of 12.4% compared to net income of $771 million for the prior year period. On a per share diluted basis, net income was $4.85, a decrease of 12.0% compared to $5.51 in the prior year period.\nAdjusted net income was $276 million for the three months ended September 30, 2025, an increase of 4.8% compared to the prior year period. On a per share basis, the three months ended September 30, 2025 adjusted net income was $1.98, an increase of 5.3% compared to $1.88 in the prior year period. Adjusted net income was $810 million for the nine months ended September 30, 2025, a decrease of 11.5% compared to the prior year period. On a per share basis, the nine months ended September 30, 2025 adjusted net income was $5.82, a decrease of 11.1% compared to $6.55 in the prior year period.\nFor the three months ended September 30, 2025, net income remained flat with the prior year period despite a 4.9% increase in net sales compared to 2024. This increase in net sales was largely offset by planned investments in the business generating higher depreciation and interest costs, lower pension income due to a change in our investing strategy related to our planned U.S. pension plan termination, increased personnel and healthcare costs, and increased rent expenses.\nFor the nine months ended September 30, 2025, net income declined due to these same factors described above.\nThe period was further impacted by lost profit from one less selling day in the U.S. compared to the prior year period.\nThese factors were partially mitigated by a 60 basis point gross margin improvement driven by the continued execution of ongoing strategic pricing and sourcing initiatives and acquisitions completed in the prior year.\nAutomotive net sales increased 5.0% in the three months ended September 30, 2025, driven by both acquisitions and comparable sales growth in our North America, Australasia and Canad"
}