{
  "source_file": "gpc-20241231.htm",
  "form_type": "10-K",
  "item1_clean": "ITEM 1\nBUSINESS.\nIncorporated in the State of Georgia in 1928, Genuine Parts Company is a global service organization engaged in the distribution of automotive and industrial replacement parts. We serve our customers from more than 10,700 locations, primarily in North America, Europe, as well as Australia and New Zealand (\"Australasia\"). We offer outstanding service, an industry-leading assortment of replacement parts, extensive supply chain and distribution capabilities, and enhanced technology solutions.\nAs used in this report, \"we,\" \"us,\" \"our,\" \"GPC,\" and the “company” refers to GPC and its subsidiaries, except as otherwise indicated by the context; and the terms “automotive parts” and “industrial parts” refer to replacement parts in each respective category.\nOUR BUSINESS\nWe are one global team unified by our mission to be an employer of choice, supplier of choice, valued customer, responsible corporate citizen and investment of choice for our shareholders. In order to execute this mission, we focus our businesses on delivering excellent customer service, profitable growth, operational efficiencies and strong cash flow. In 2024, we had net sales of $23.5 billion and our revenue mix was 74% in North America, 16% in Europe and 10% in Australasia.\nWe are organized into two business segments: our Automotive Parts Group (“Automotive”) and our Industrial Parts Group (“Industrial”). Our main Automotive customers are repair and maintenance shops, and our main Industrial customers are businesses operating distribution, manufacturing and production equipment.\nIn Automotive, we see long-term growth opportunities across each of the markets we serve which are supported by an increasing number of miles driven, a growing and aging car parc, increasing vehicle complexity, and an emerging opportunity with electric vehicles. In Industrial, growth drivers include disruptions in the global supply chain creating opportunities with nearshoring, a strong outlook for automation and robotics solutions, the need for industrial expertise due to an aging technical workforce and diversified end market opportunities. Together, our business segments create a competitive differentiation in two distinct and growing markets with compelling shareholder value.\nWe believe our primary competitive advantages are our: (1) global presence and brand strength; (2) industry-leading positions in each of the markets we serve; (3) extensive supply chain and distribution capabilities; and (4) enhanced technology solutions.\nOur strategic financial objectives complement our mission and drive value for all our stakeholders. These financial objectives include: (1) revenue growth in excess of market growth; (2) continuously improving operating margins; (3) maintaining a strong balance sheet and cash flows; and (4) effective capital allocation.\nAs we look to the future, our strategy is built to position us for long-term, profitable growth. By staying true to our purpose, leveraging our strengths, and executing on our strategic priorities, we are confident in our ability to deliver sustainable growth and create lasting value for our shareholders, customers, employees, and communities.\nOUR SEGMENTS\nAUTOMOTIVE\nOur Automotive segment, which represents 63% of total GPC net sales, is the largest global automotive network of parts and autocare. We distribute automotive parts, accessories and solutions in North America, Europe and Australasia. Our Automotive businesses offer extensive inventory depth and assortment, cataloging, marketing, training and other programs to the aftermarket in each of these regions, distinguishing our business from the competition.\nOur global Automotive network sells to customers in both commercial do-it-for-me (“DIFM”) and retail do-it-yourself (“DIY”) segments of the market and covers substantially all global motor vehicle models. Our DIFM customers include local, regional and national repair centers, auto dealers, service stations and both private and public sector accounts. Our DIY customers are primarily served over-the-counter at our global stores or digitally. Our DIFM and DIY customers represent approximately 80% and 20% of total Automotive sales, respectively, and channel mix varies by geography.\nOur Automotive network consists of over one million customer locations. We have diversity amongst our commercial customer base with no specific customer type representing an outsized concentration of our overall business. Our Automotive segment operates in large and fragmented markets with a combined total addressable\nmarket of over $200 billion. The majority of the automotive aftermarket is comprised of small, local competitors and our scale, advanced technology, and supply chain efficiency differentiates us from competitors.\nOur Automotive distribution network provides access to hundreds of thousands of replacement parts (other than collision parts and tires) and accessory items for substantially all motor vehicle makes and models, including hybrid and electric vehicles, trucks, and SUVs, as well as for buses, motorcycles, farm equipment, and heavy duty equipment. We supply certain equipment parts and technologies used by repair shops, service stations, fleet operators, automobile and truck dealers, leasing companies, farms, and individuals who perform their own maintenance and parts installation.\nInventory availability is critical to the success of our business and our teams utilize data and analytics to have the right parts, in the right place and at the right time. The majority of products distributed in North America utilize the NAPA brand, which we believe is a competitive differentiator. In Australasia and Europe, products are distributed under several brand names, including many of the national brands, as well as the NAPA brand. Our U.S. Automotive business offers approximately 800,000 different parts and related supply items. These items are purchased from hundreds of different suppliers, with approximately 55% of 2024 automotive parts inventories purchased from 10 major suppliers.\nRegional Operations & Products.\n\nIn North America, our U.S. operations are headquartered in Atlanta, Georgia and our Canadian operations are headquartered in Montreal, Quebec. We are differentiated from many of our North American competitors because our revenues are primarily generated with commercial DIFM customers. We service the U.S. and Canadian markets primarily through company-owned and independent auto part stores, heavy vehicle stores, and specialty paint and equipment stores. Our North American auto parts stores sell a comprehensive range of automotive parts, including brakes, batteries, filters, engine components, tools, accessories, and fluids. Some locations offer custom services such as paint mixing, hydraulic hose assembly, battery testing, and key cutting. Our heavy vehicle stores sell parts, accessories, and tools and equipment for servicing heavy duty and diesel vehicles, and we operate service and mechanical repair centers for heavy vehicles. We serve the heavy vehicle market under the banners Traction, TruckPro, TW, and Cadel. In Canada, our specialty stores operate paint and body care equipment and supply under the banner NAPA/CMAX and high-quality replacement parts and lubricants for imported vehicles under the banners Altrom and Auto‑Camping.\nSeparately, we provide a unique NAPA Auto Care program available to independent repair shops and auto care centers across the U.S. and Canada where they can leverage the NAPA brand to increase visibility as well as receive part discounts and other product and technology benefits. We also offer technical expertise by training and employing knowledgeable staff who can provide technical assistance, product recommendations, and guidance on automotive repairs and maintenance, and we organize DIY workshops and training sessions to educate customers on automotive repair and maintenance tasks. Our online platform in North America is NAPA online, which provides our customers an option to browse, purchase, and have automotive products bought online and picked up in store or delivered to their homes or businesses. Through NAPA Online, customers can also locate nearby participating NAPA Auto Care locations.\nWe believe that the quality and the range of products and services provided to our North American customers constitute a significant advantage for our automotive parts distribution system. Our goal is to properly stock our locations with the right parts to ensure we provide quick and quality service to our customers whose orders are often filled and shipped the same day they are received. Our services also include up to date parts cataloging (including the use of electronic NAPA Auto Parts catalogs) and stock adjustments through a continuous parts classification system which, as initiated by us, allows independently-owned stores to return certain merchandise on a scheduled basis. We offer our NAPA Auto Parts stores various management aids, marketing aids and service on topics such as selling and promotional tools, inventory control, pricing and cost analysis, as well as marketing conferences and seminars, sales and advertising manuals and training programs. We have developed and refined an inventory classification system to determine the most advantageous distribution center and auto parts store inventory levels for automotive parts stocking based on automotive registrations, usage rates, production statistics, technological advances, including predictive analytics, and other similar factors. This system, which undergoes continuous analytical review, is an integral part of our inventory control procedures and comprises an important feature of the inventory management services that we make available to our NAPA Auto Parts stores. Losses from inventory obsolescence have not been significant historically which we attribute to the successful operation of our classification system, including product return privileges with most of our suppliers.\nIn Europe, we operate Alliance Automotive Group (“AAG”), headquartered in London, England. Europe is predominantly a DIFM market, with very few over-the-counter sales. We serve thousands of vehicle repairers, collision shops and auto-centers from over 2,500 distributor outlets across Europe, supported by a logistics infrastructure of national and regional distribution centers. Our distributor outlets include company-owned and independent auto part stores and outlets, heavy vehicle outlets, and online and specialty outlets. Our European\nbanners include Groupauto, Precisium and Pièces Auto in France; Coler, Busch, Hennig and Knoll in Germany; Groupauto, UAN, FPS Distribution, APEC Braking, BTN Turbo, Platinum International, Alliance Automotive U.K. Subsidiaries, and J&S Automotive Distributors in the U.K. and Republic of Ireland; PartsPoint in Belgium and the Netherlands; Lausan, Soulima and Gaudi in Spain and Portugal; and GroupAuto in Poland. In France, we also provide parts and services for heavy duty and diesel vehicles under the Todd banner and we operate Back2Car, which distributes recycled car parts. In the Netherlands and Belgium, we offer programs for repair shops that want to join our installer network to increase their visibility and brand awareness while remaining independent. Separately in Europe, we operate WinParts, an online platform for customers to browse, purchase, and have automotive products delivered to their homes or businesses.\nIn Australia and New Zealand, we operate GPC Asia Pacific – the region’s largest automotive aftermarket parts supplier. We resell and distribute automotive replacement parts, accessories and related tools and equipment through a network of company-owned retail stores and advanced distribution centers. In our Australasian operations, we go to market solely with a company-owned store model. GPC Asia Pacific operates three main lines of business: Automotive Australia, Automotive New",
  "item7_clean": "We expect to continue to have access to the capital markets on both short-term and long-term bases when needed for liquidity purposes by issuing commercial paper or new long-term debt. The availability and the borrowing costs of these funds could be adversely affected, however, by a downgrade of our debt ratings or a deterioration of certain financial ratios. The table below reflects our debt ratings by Standard & Poor’s (\"S&P\") and Moody’s as of December 31, 2024, which provide an enhanced understanding of our sources of liquidity and the effect of our ratings on our cost of debt. A debt rating is not a recommendation by the rating agency to buy, sell, or\nhold and each rating should be evaluated independently of any other rating. Credit rating agencies review their ratings periodically and, therefore, the credit ratings assigned to us by each agency may be subject to revision at any time.\nS&P\nA-2\nP-2\nBBB\nCRITICAL ACCOUNTING POLICIES\nManagement’s Discussion and Analysis of Financial Condition and Results of Operations is based upon our consolidated financial statements, which have been prepared in accordance with U.S. GAAP. The preparation of our consolidated financial statements requires management to make estimates, assumptions and judgments that affect the reported amounts of assets, liabilities, net sales and expenses and related disclosure of contingent assets and liabilities. Management bases its estimates on historical experience and on various other assumptions that are believed to be reasonable under the circumstances, the results of which form the basis for making judgments about the carrying values of assets and liabilities that are not readily apparent from other sources. Actual results may differ from these estimates under different assumptions or conditions.\nWe describe in this section certain critical accounting policies that require us to make significant estimates, assumptions and judgments. An accounting policy is deemed to be critical if it requires an accounting estimate to be made based on assumptions about matters that are uncertain at the time the estimate is made and if different estimates that reasonably could have been used, or changes in the accounting estimates that are reasonably likely to occur periodically, could materially impact the consolidated financial statements. Management believes the following critical accounting policies reflect its most significant estimates and assumptions used in the preparation of the consolidated financial statements. For further information on the critical accounting policies, see the Summary of Significant Accounting Policies Footnote in the Notes to Consolidated Financial Statements.\nConsideration Received from Vendors\nWe frequently enter into agreements with our vendors that provide for inventory purchase incentives. Generally, we earn inventory purchase incentives upon achieving specified volume purchasing levels or other similar criteria. We accrue for the receipt of these incentives as a deduction from our inventory carrying cost based on cumulative purchases of inventory to date and projected inventory purchases through the end of the year. We recognize these incentives in earnings as a reduction of costs of goods sold as the corresponding inventory is sold to our customers. While management believes we will continue to receive consideration from vendors in 2025 and beyond, there can be no assurance that vendors will continue to provide comparable amounts of incentives in the future or that we will be able to achieve the specified volumes necessary to take advantage of such incentives. Consideration receivable from vendors, generally reflected in prepaid expenses and other current assets, was $973 million and $928 million as of December 31, 2024 and December 31, 2023, respectively.\nImpairment of Goodwill and Other Intangible Assets\nAt least annually, we evaluate goodwill and other intangible assets for potential impairment indicators. Our judgments regarding the existence of impairment indicators are based on market conditions and operational performance, among other factors. Future events could cause us to conclude that impairment indicators exist and that assets associated with a particular operation are impaired. Evaluating for impairment also requires us to estimate future operating results and cash flows which requires judgment by management. Any resulting impairment loss could have a material adverse impact on our financial condition and results of operations. Refer to the Goodwill and Other Intangible Assets Footnote of the Notes to Consolidated Financial Statements for further information on the results of our annual goodwill impairment testing.\nEmployee Benefit Plans\nEffective December 31, 2013, our U.S. pension plan was amended to freeze benefit plan accruals for participants and provide for immediate vesting of accrued benefits. On April 29, 2024, our Board of Directors approved the termination of the frozen U.S. plan, effective September 30, 2024. Refer to the Employee Benefit Plans Footnote of the Notes to Consolidated Financial Statements for further information on the termination of the frozen U.S. plan.\nOur benefit plan committees in the U.S. and Canada establish investment policies and strategies and regularly monitors the performance of our pension plan assets. Our U.S. plan, our largest pension plan, is well-funded, with a funded status of 128% at December 31, 2024. The plans in Europe are unfunded and therefore there are no plan assets.\nBeginning in 2024, the U.S. pension plan strategy implemented by our management is to minimize funded status volatility through the plan termination process.\nOur investment strategy with respect to U.S. pension plan assets is to fully hedge plan obligations on a termination basis. In connection with the planned U.S. pension plan termination process, we acquired certain annuity contracts from an insurance company using existing plan assets to fund on-going obligations under the U.S. pension plan prior to termination.\nThe Canadian pension plan investment strategy implemented by our management is to achieve long-term objectives and invest the pension assets in accordance with the applicable pension legislation in Canada, as well as fiduciary standards. The long-term primary objectives for the Canadian pension plan is to provide for a reasonable amount of long-term growth of capital without undue exposure to risk, protect the assets from erosion of purchasing power and provide investment results that meet or exceed the pension plans’ actuarially assumed long-term rates of return. The Company's Investment Strategy with respect to Canadian pension plan assets is to generate a return in excess of the passive portfolio benchmark (50% Equity, 40% Fixed Income, 10% Other).\nWe make several assumptions in determining our pension plan assets and liabilities and related pension income. We believe the most critical of these assumptions are the expected rate of return on plan assets and the discount rate. Other assumptions we make relate to employee demographic factors such as rate of compensation increases, mortality rates, retirement patterns and turnover rates. Refer to the Employee Benefit Plans Footnote of the Notes to Consolidated Financial Statements for more information regarding these assumptions.\nBased on the investment policy for the pension plans, as well as an asset study that was performed based on our asset allocations and future expectations, our expected rate of return on plan assets for measuring 2025 pension income is 5.33% for the plans. The asset study forecasted expected rates of return for the approximate duration of our benefit obligations, using capital market data and historical relationships.\nThe discount rate is chosen as the rate at which pension obligations could be effectively settled and is based on capital market conditions as of the measurement date. Prior to December 31, 2024, the discount rate for the U.S. pension plan was calculated using a bond matching approach to select specific bonds that would satisfy the projected benefit payments. As a result of the of the decision to terminate the U.S. pension plan, as of December 31, 2024, the benefit obligation for the U.S. pension plan was determined based on the amount expected to be required to settle the obligations. Assumptions utilized included the portion of the obligations expected to be settled through elections of lump sum payments or annuities and the cost to purchase annuities, which are subject to change upon actual plan settlement. We have matched the timing and duration of the expected cash flows of our pension obligations to a yield curve generated from a broad portfolio of high-quality fixed income debt instruments to select our discount rate. Based upon this cash flow matching analysis, we selected a weighted average discount rate for the plans of 5.15% at December 31, 2024.\nOur pension income for 2024 is determined at the December 31, 2023 measurement date. A\n25 basis point increase in discount rate would result in an approximate $38 million decrease on our projected benefit obligation. A 25 basis point decrease in discount rate would result in approximate $40 million increase on our projected benefit obligation. A 25 basis point change in discount rate would have an immaterial impact on our pension income. A\n25 basis point change in expected return on asset would have an approximate $6 million impact on our pension income. These sensitivities reflect the effect of changing one assumption at a time and assume no changes to the design of the pension plans.\nNet periodic benefit income for our defined benefit pension plans was $54 million, $44 million, and $27 million for the years ended December 31, 2024, 2023 and 2022, respectively. The income associated with the pension in 2024, 2023 and 2022 reflects the impact of the U.S. plan freeze. The termination of our U.S. plan will significantly reduce pension income prospectively.\nRefer to the Employee Benefit Plans Footnote of the Notes to Consolidated Financial Statements for more information regarding employee benefit plans.\nBusiness Combinations\nWhen we acquire businesses, we apply the acquisition method of accounting and recognize the identifiable assets acquired, the liabilities assumed, and any noncontrolling interests in an acquiree at their fair values on the acquisition date, which requires significant estimates and assumptions. Goodwill is measured as the excess of the fair value of the consideration transferred over the net of the acquisition date fair values of the identifiable assets acquired and liabilities assumed. The acquisition method requires us to record provisional amounts for any items for which the accounting is not complete at the end of a reporting period. We must complete the accounting during the measurement period, which cannot exceed one year. Adjustments made during the measurement period could have a material impact on our financial condition and results of operations.\nWe typically measure customer relationships and other intangible assets using an income approach. Significant estimates and assumptions used in this approach include discount rates and certain assumptions that form the basis of the forecasted cash flows expected to be generated from the asset (e.g., future revenue growth rates and EBITDA margins). If the subsequent actual results and updated projections of the underlying business activity change compared with the assumptions and projections used to develop these values, we could record impairment charges. In addition, we have estimated the economic lives of certain acquired tangible and intangible assets and these lives are used to calculate depreciation and amortization expense. If our estimates of the economic lives change, depreciation or amortization expenses could be increased or decreased, or the acquired asset could be impaired.\nLegal and Asbestos Liabilities\nWe accrue for potential losses related to legal disputes, litigation, asbestos liability, and regulatory matters when it is probable (the future event or events are likely to occur) that we have incurred a loss and the amount of the loss can be reasonably estimated.\nTo calculate our asbestos liability, we estimate potential losses relating to pending claims and also estimate the likelihood of additional, similar claims being filed against us in the future. To estimate potential losses on claims that could be filed in the future, we consider claims pending against us, claim filing rates, the number of codefendants and the extent to which they share in settlements, and the amount of loss by claim type. The estimated losses for pending and potential future claims are calculated on a discounted basis using risk-free interest rates derived from market data about monetary assets with maturities comparable to those of the projected asbestos liability. We use an actuarial specialist to assist with measuring our asbestos liability.\nWhile we believe our legal and asbestos liability estimates are reasonable in light of all available information, if one or more legal claims were to greatly exceed our estimates, our results of operations and cash flows could be materially and adversely affected. Refer to the Commitments and Contingencies Footnote of the Notes to Consolidated Financial Statements for additional information regarding our asbestos liability.\nRECENT ACCOUNTING PRONOUNCEMENTS\nChanges to U.S. GAAP are established by the Financial Accounting Standards Board (“FASB”) in the form of Accounting Standards Updates (“ASU”) to the FASB Accounting Standards Codification (“ASC”). We consider the applicability and impact of all ASUs and any not listed below were assessed and determined to not be applicable or are expected to have an immaterial impact on our Condensed Consolidated Financial Statements.\nIncome Statement—Reporting Comprehensive Income—Expense Disaggregation Disclosures (Subtopic 220-40): Disaggregation of Income Statement Expenses\n\nITEM 7\nMANAGEMENT’S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS.\nOVERVIEW\nGenuine Parts Company (\"GPC\") is a global service organization with a long history of growth and innovation dating back to our founding in Atlanta, Georgia, in 1928. Over nearly a century, we’ve built a reputation for delivering excellent customer service, profitable growth, leading distribution capabilities and strong cash flow.\nIn 2024, we conducted business in North America, Europe and Australasia from more than 10,700 locations. Our Automotive business operated in the U.S., Canada, Mexico, France, the U.K., Ireland, Germany, Poland, the Netherlands, Belgium, Spain, Portugal, Australia and New Zealand and accounted for 63% of total revenues for the year. Our Industrial business operated in the U.S., Canada, Mexico, Australia, New Zealand, Indonesia and Singapore and accounted for 37% of total revenues.\nOur mission is to be the employer, supplier, and investment of choice, while also being a valued corporate citizen in the communities we serve. This mission drives our strategic financial objectives: outpacing market revenue growth, improving operating margins, maintaining a strong balance sheet and cash flows, and allocating capital effectively. As we look to the future, we are leaning into modernizing our supply chain and technology through digital innovation, and data-driven strategies to enhance our competitive edge. By leveraging technology and optimizing supply chains, we are empowering our teams with cutting-edge tools to focus on delivering exceptional customer service and driving sustainable growth. At the heart of it all is our commitment to excellence, supported by a culture of continuous improvement and a legacy of strong leadership that has guided us for nearly 100 years.\nKEY PERFORMANCE INDICATORS\nWe consider a variety of performance and financial measures in assessing our business, and the k",
  "item2_clean": null
}