{
  "source_file": "gpn-20250930.htm",
  "form_type": "10-Q",
  "item1_clean": null,
  "item7_clean": null,
  "item2_clean": "We are a leading payments technology company delivering innovative software and services to our customers globally. Our technologies, services and team member expertise allow us to provide a broad range of solutions that enable our customers to operate their businesses more efficiently across a variety of channels around the world.\nWe have grown organically, as well as through acquisitions, and continue to invest in new technology solutions, infrastructure to support our growing business and the ongoing consolidation and enhancement of our operating platforms. These investments include new product development and innovation to further enhance and differentiate our suite of technology and solutions available to customers, along with migration of certain underlying technology platforms to cloud environments to enhance performance, improve speed to market and drive cost efficiencies. We also continue to execute on integration and business transformation activities, such as combining business operations, streamlining technology infrastructure, eliminating duplicative corporate and operational support structures and realizing scale efficiencies.\nWe also furthered our business strategy through the following key transactions:\nOn April 17, 2025, we entered into definitive agreements to acquire 100% of Worldpay Holdco, LLC (“Worldpay”) from\nFidelity National Information Services, Inc. (“FIS”)\nand affiliates of GTCR LLC (“GTCR”) and divest our Issuer Solutions business to FIS. Worldpay is an industry leading payments technology and solutions company. Consideration expected to be paid to GTCR for an ownership interest in Worldpay consists of (1) approximately $6.1 billion in cash and (2) 43.3 million shares of Global Payments common stock. Consideration expected to be received for the divestiture of our Issuer Solutions business consists of (1) approximately\nin cash and (2) FIS’ ownership interest in Worldpay as described above. Our Issuer Solutions business met the criteria to be classified as a discontinued operation in the second quarter of 2025. Accordingly, the operating results of the Issuer Solutions business have been presented as discontinued operations in our consolidated statements of income for the three and nine months ended September 30, 2025 and 2024.\nThe proposed acquisition of Worldpay and divestiture of our Issuer Solutions business will occur simultaneously. In connection with the agreements, we initially obtained $7.7 billion in committed bridge financing. Upon the effectiveness of the revolving credit agreement entered into on May 15, 2025 as described in \"Note 5—Long-Term Debt and Lines of Credit,\" we reduced the commitments related to the bridge financing to $6.2 billion. Both transactions are expected to close in the\nfirst quarter of 2026.\nOn September 30, 2025, we completed the sale of Heartland Payroll Solutions, Inc. (\"Payroll Solutions\"), our payroll business included in our Merchant Solutions segment, to Acrisure, LLC for approximately $1.1 billion, subject to certain closing adjustments, including up to\nof contingent consideration. We recognized a gain on the sale of $343.9 million during the three and nine months ended September 30, 2025 in connection with the sale.\nHighlights related to our results of continuing operations for the three and nine months ended September 30, 2025 include the following:\nConsolidated revenues were essentially flat at $2,007.6 million and $5,773.1 million for the three and nine months ended September 30, 2025, respectively, compared to $1,997.7 million and $5,802.8 million for the three and nine months ended September 30, 2024, respectively.\nMerchant Solutions segment operating income and operating margin for the three and nine months ended September 30, 2025 increased compared to the prior year primarily due to the favorable effect of cost reduction activities.\nConsolidated operating income for the three and nine months ended September 30, 2025 includes the gain recognized on the sale of the Payroll Sol\nStrategy and Business Transformation\nIn 2024, we launched a holistic review of our business to examine our strategy, operations and ability to deliver sustainable performance. We have refreshed our strategy and are focusing our resources, efforts and investments on the areas of the business that will drive the best opportunities for growth.\nThese strategic, organizational and operational transformation activities are expected to continue over the next few years. As we focus on executing and delivering transformation initiatives, we have incurred and anticipate incurring incremental expenses related to the transformation through early 2027, including but not limited to changes to the recoverability of assets and our estimates of remaining useful lives. We continue to assess our business portfolio to evaluate potential assets for disposition to further streamline our business and create value for shareholders.\nWe currently expect our transformation initiatives to generate more than $650 million of annual run-rate operating income benefit by the first half of 2027.\nMacroeconomic Effects and Other Global Conditions\nWe are exposed to general economic conditions, including the effects of currency fluctuations, inflation, rising interest rates, tariff increases, global trade relations, international tensions, higher rates of unemployment, and other conditions that affect the overall level of consumer, business and government spending, which could negatively affect our financial performance. When adverse macroeconomic conditions arise, we evaluate where we may be able to implement cost-saving measures, including those related to headcount and discretionary expenses. We may also experience the effects of heightened geopolitical and economic instability or increased difficulty of conducting business in a country or region due to actual or potential political or military conflict or action. We recognize the uncertainty of the macroeconomic environment and cannot predict what impacts the current uncertainty or any developments will have on the economy and our customers.\nCertain of our operations are conducted in foreign currencies. Consequently, a portion of our revenues and expenses has been and may continue to be affected by fluctuations in foreign currency exchange rates. A strengthening of the U.S. dollar or other significant fluctuations in foreign currency exchange rates could result in an adverse effect on our future financial results; however, we are unable to predict the extent of the potential effect on our financial results.\nWe have sought to reduce our interest rate risk through the issuance of fixed rate debt in place of variable rate debt and through interest rate swap hedging arrangements that convert a significant portion of the eligible variable rate borrowings under our revolving credit facility to a fixed rate. However, inflationary pressure or interest rate fluctuations could adversely affect our business and financial performance as a result of higher costs and/or lower consumer spending. In addition, continued inflation or a rise in interest rates could have an adverse effect on our future financial results and the recoverability of assets. However, as the future magnitude, duration and effects of these conditions are difficult to predict, we are unable to project the extent of the potential effect on our financial results.\nWe regularly maintain cash balances with financial institutions in excess of the Federal Deposit Insurance Corporation insurance limit or the equivalent outside the U.S. A disruption in financial markets could impair our banking partners, which could affect our ability to access our cash or cash equivalents, our ability to provide settlement services or our customers' ability to access their existing cash to fulfill their payment obligations to us. The occurrence of these events could negatively affect our business, financial condition and results of operations.\nResults of Operations\nBeginning in the second quarter of 2025, we present the historical operations of our Issuer Solutions reportable segment as a discontinued operation. Accordingly, our continuing operations consists of our Merchant Solutions business and corporate functions.\nSee “Note 2—Business Dispositions and Discontinued Operations” in the notes to the accompanying unaudited consolidated financial statements for further information.\nContinuing Operations\nThe following table sets forth key selected financial data for the three months ended September 30, 2025 and 2024, certain data as a percentage of total revenues and the changes between periods in dollars and as a percentage of the prior period amount. The income statement data for the three months ended September 30, 2025 and 2024 is derived from the accompanying unaudited consolidated financial statements.\n(dollar amounts in thousands)\nSelling, general and administrative:\nConsolidated selling, general and administrative\nGain on business disposition\nNM\nConsolidated operating expenses\nOperating income (loss)\nGain on business disposition\nNM\nConsolidated operating income\nPercentage amounts may not sum to the total due to rounding.\nRevenues, operating expenses, operating income and operating margin reflect the effects of our disposed businesses through the respective disposal dates. See “Note 2—Business Dispositions and Discontinued Operations” for further discussion.\nOperating income included acquisition and transformation expens\nthe three months ended September 30, 2025 and 2024, respectively, which were primarily included within Corporate selling, general and administrative expenses.\nDuring the three months ended September 30, 2024, Corporate expenses also included charges for employee termination benefits of $56.4 million.\nThe following table sets forth key selected financial data for the nine months ended September 30, 2025 and 2024, certain data as a percentage of total revenues and the changes between periods in"
}