{
  "source_file": "gpn-20241231.htm",
  "form_type": "10-K",
  "item1_clean": "ITEM 1 - BUSINESS\nGlobal Payments Inc. and its consolidated subsidiaries are referred to collectively as \"Global Payments,\" the \"Company,\" \"we,\" \"our\" or \"us,\" unless the context requires otherwise.\nWe are a leading payments technology company delivering innovative software and services to our customers globally, with worldwide reach spanning North America, Europe, Asia-Pacific and Latin America. The payments technology industry provides financial institutions, businesses and consumers with payment processing services, merchant acceptance solutions and related information and other value-added services. Our technologies, services and team member expertise allow us to provide a broad range of solutions that enable our customers to operate their businesses more efficiently across a variety of channels around the world. Headquartered in Georgia with approximately 27,000 team members worldwide, Global Payments is a Fortune 500 company and is a member of the S&P 500. Our common stock is traded on the New York Stock Exchange under the symbol \"GPN.\"\nWe operate in two reportable segments: Merchant Solutions and Issuer Solutions. During the second quarter of 2023, we completed the sale of the consumer portion of our Netspend business, which comprised our former Consumer Solutions segment. See \"Note 18—Segment Information\" in the notes to the accompanying consolidated financial statements for additional information about our segments, including revenues, operating expenses, operating income and depreciation and amortization by segment, as well as financial information about geographic areas in which we operate.\nBusiness Transformation\nEarly in 2024, we launched a holistic review of our business to examine our strategy, operations and ability to deliver sustainable performance. We have refreshed our strategy and are focusing our resources, efforts and investments on the areas of the business that will drive the best opportunities for growth.\nWe are in the process of streamlining and simplifying our organization and operating environments through our transformation program to deliver a global, unified operating company. We are aligning the Global Payments brand identity across our assets and solidifying go-to-market activities under a common platform. In our Merchant Solutions segment, we are harmonizing capabilities and prioritizing small-and-medium sized businesses to deliver our full suite of differentiated software and commerce enablement solutions. In our Issuer Solutions segment, we are capitalizing on growth opportunities through our cloud modernization and cross-selling initiatives, while also leveraging the strategic value of this business to extend our capabilities across the payments value chain.\nWe have consolidated our technology organizations and teams under common leadership to enhance speed and quality of product development with a customer-centric, solutions-led mindset. We have also centralized our operations functions to enhance our servicing model and focus on improving the customer journey, leveraging best-in-class technology and providing differentiated service experiences for our clients.\nThese strategic, organizational and operational transformation activities are expected to be largely completed by the first half of 2027. We are also undertaking a strategic review of our business portfolio to evaluate potential assets for disposition to further streamline our business and create value for shareholders.\nRecent Business Acquisitions and Dispositions\nAcquisition of EVO Payments, Inc.\nIn March 2023, we completed the acquisition of EVO Payments, Inc. (“EVO”) for approximately $4 billion. EVO is a payment technology and services provider, offering payment solutions to merchants ranging from small and middle market enterprises to multinational companies and organizations across the Americas and Europe. The acquisition expands our geographic presence in attractive markets and augments our business-to-business (\"B2B\") software and payment solutions business and is included in our Merchant Solutions segment.\nDisposition of AdvancedMD, Inc.\nIn December 2024, we completed the sale of AdvancedMD, Inc. (\"AdvancedMD\") for approximately $1 billion, subject to certain closing adjustments, and up to $125 million contingent upon the purchaser achieving certain specified returns. Prior to disposition, AdvancedMD provided software-as-a-service solutions to small-to-medium sized ambulatory physician practices in the United States and was included in our Merchant Solutions segment.\nDisposition of Consumer Business\nIn April 2023, we completed the sale of the consumer portion of our Netspend business for approximately $1 billion. Prior to disposition, the consumer business comprised our former Consumer Solutions segment and provided general purpose reloadable (\"GPR\") prepaid debit and payroll cards, demand deposit accounts and other financial service solutions to the underbanked and other consumers and businesses in the United States.\nDisposition of Gaming Business\nIn April 2023, we completed the sale of our gaming business for approximately $400 million. Prior to disposition, the gaming business offered a comprehensive suite of solutions, including credit and debit card cash advance, cashless advance, iGaming solutions, traditional and digital check processing and other services specific to the gaming market in North America and was included in our Merchant Solutions segment.\nSee \"Note 2—Acquisitions\" and “Note 3—Business Dispositions” in the notes to the accompanying consolidated financial statements for further discussion of these and other recent transactions.\nMerchant Solutions Segment\nThrough our Merchant Solutions segment, we provide payments technology and software solutions globally to primarily small- and-medium sized businesses and select mid-market and enterprise customers. Our payment technology solutions are similar around the world in that we enable our customers to accept card, check and digital-based payments. Our comprehensive offerings include, but are not limited to, authorization, settlement and funding services, customer support, chargeback resolution, reconciliation and dispute management services, terminal rental, sales and deployment, payment security services, consolidated billing and reporting.\nIn addition, we offer a wide array of business management software solutions that streamline business operations to customers in numerous vertical markets. We also provide a variety of commerce enablement solutions and services, including specialty point-of-sale (\"POS\") software, data analytics and customer engagement, human capital management and payroll, accounts receivable automation, inventory management and reporting that assist our customers with driving demand and operating their businesses more efficiently.\nOur value proposition is to provide distinctive high-quality, responsive and secure services to all of our customers. We go to market in Merchant Solutions globally across three lines of business, including Point-of-Sale and Software Solutions, Integrated and Embedded Solutions and Core Payments Solutions. This allows us to fully leverage our capabilities across vertical markets and geographies. We focus on providing differentiated customer service from the sales process, to onboarding, to ongoing support across our business. The majority of our revenue is generated by services priced as a percentage of transaction value or a specified fee per transaction, depending on the payment type or the market. We also earn software subscription and licensing fees, as well as other fees for specific value-added services, which may be unrelated to the number or value of transactions.\nDistribution Channels\nIn the Merchant Solutions segment, we actively market and provide our payment services, enterprise software solutions and other value-added services directly to our customers and through a variety of partner distribution channels across three business pillars: Point-of-Sale and Software Solutions, Integrated and Embedded Solutions and Core Payments Solutions. We have a wide array of distribution channels led by one of the premiere direct sales teams in the industry. Additionally, we go to market through our broad-based financial institution partnerships, joint ventures and wholesale and indirect relationships.\nMany of our payment solutions are technology-enabled in that they incorporate or are incorporated into innovative, technology-driven solutions, including software solutions, designed to enable merchants to better manage their businesses. Our technology-enabled solutions represent a substantial component of our revenues.\nPoint-of-Sale and Software Solutions\n. Our Point-of-Sale and Software Solutions business provide advanced payments technology that is integrated into point-of-sale systems and business management software solutions that we own. We have capabilities in cloud-based point-of-sale for restaurant and retail and leading software in other verticals including education (serving colleges, universities, and kindergarten through 12th grade level institutions), real estate (primarily property management), and communities (serving event organizers largely in the health and fitness market). Our Point-of-Sale and Software Solutions business offers a range of features which are being combined under our Global Payments brand identity across all of our assets. This includes unifying our POS businesses under a common brand, Genius, and leveraging our vast distribution channels to extend it globally. We expect to complete the rollout of our Genius POS solutions by the end of 2025.\nIntegrated and Embedded Solutions.\nOur Integrated and Embedded Solutions business provides advanced payments technology that is embedded into business management software solutions owned by our technology partners who operate in numerous vertical markets and countries. Further, we also integrate our capabilities with shopping carts, ordering platforms, marketplaces and other digitally-oriented businesses through the same embedded payment stack we leverage with more traditional, vertically-specific independent software vendors. We deliver these capabilities in physical and digital environments seamlessly.\nCore Payments Solutions.\nWe offer our core payments solutions through our direct sales forces worldwide, as well as referral partnerships. We offer our payments technology services, software and other commerce enablement solutions directly to customers across numerous verticals in the markets we serve. Although our primary focus is on building durable, direct relationships with merchants, we also provide our services to merchants referred by independent sales organizations (\"ISOs\") and financial institutions.\nCredit and Debit Card Transaction Processing\nCredit and debit card transaction processing includes processing the world's major international card brands, including, among others, American Express, Discover Card (\"Discover\"), JCB, Mastercard, UnionPay International and Visa, as well as certain domestic debit networks, such as Interac in Canada. Credit and debit networks establish uniform regulations that govern much of the payment card industry. During a typical payment transaction, the merchant and the card issuer do not interface directly with each other, but instead rely on payments technology companies, such as Global Payments, to facilitate transaction processing services, including authorization, electronic draft capture, file transfers to facilitate funds settlement and certain exception-based, back-office support services such as chargeback resolution.\nWe process funds settlement under two models: a sponsorship model and a direct membership model. Under the sponsorship model, member clearing financial institutions (\"Members\") sponsor us and require our adherence to the standards of the networks. In these markets, we have sponsorship or depository and clearing agreements wit",
  "item7_clean": "expansion of ecommerce, omnichannel and contactless payment solutions has accelerated. We believe that the number of digital payment transactions will continue to grow and that an increasing percentage of these will be facilitated through emerging technologies. As a result, we expect an increasing portion of our future capital investment will be allocated to support the development of new and emerging technologies, including technology modernization, innovation and integration through strategic partnerships.\nWe also believe new markets will continue to develop and expand in areas that have been previously dominated by paper-based transactions. We expect industries such as education, government and healthcare, as well as recurring payments and business-to-business (\"B2B\") payments, to continue to see transactions migrate to digital-based solutions. We anticipate that the continued development of new services and technologies, the emergence of new vertical markets and continued expansion of technology-enabled ecommerce and omnichannel solutions, including expanded scale and market reach through new innovative cloud-based capabilities and strategic partnerships, will be a factor in the growth of our business and our revenues in the future. Furthermore, due to its benefits and growth potential, we anticipate the increased exploration of use of AI in the payments industry.\nMacroeconomic Effects and Other Global Conditions\nWe are exposed to general economic conditions, including currency fluctuations, inflation, rising interest rates and other conditions that affect the overall level of consumer, business and government spending, which could negatively affect our financial performance. When adverse macroeconomic conditions arise, we evaluate where we may be able to implement cost-saving measures, including those related to headcount and discretionary expenses. We may also experience the effects of heightened geopolitical and economic instability or increased difficulty of conducting business in a country or region due to actual or potential political or military conflict or action.\nCertain of our operations are conducted in foreign currencies. Consequently, a portion of our revenues and expenses has been and may continue to be affected by fluctuations in foreign currency exchange rates. A strengthening of the U.S. dollar or other significant fluctuations in foreign currency exchange rates could result in an adverse effect on our future financial results; however, we are unable to predict the extent of the potential effect on our financial results.\nWe have sought to reduce our interest rate risk through the issuance of fixed rate debt in place of variable rate debt and through interest rate swap hedging arrangements that convert a significant portion of the eligible variable rate borrowings under our revolving credit facility to a fixed rate. However, inflationary pressure or interest rate fluctuations could adversely affect our business and financial performance as a result of higher costs and/or lower consumer spending. In addition, continued inflation or a rise in interest rates could have an adverse effect on our future financial results and the recoverability of assets. However, as the future magnitude, duration and effects of these conditions are difficult to predict, we are unable to project the extent of the potential effect on our financial results.\nWe regularly maintain cash balances with financial institutions in excess of the Federal Deposit Insurance Corporation insurance limit or the equivalent outside the U.S. A disruption in financial markets could harm our banking partners, which could affect our ability to access our cash or cash equivalents, our ability to provide settlement services or our customers' ability to access their existing cash to fulfill their payment obligations to us. The occurrence of these events could negatively affect our business, financial condition and results of operations.\nResults of Operations\nKey Drivers of our Results of Operations\nOur revenues for both of our segments are dependent upon the volume of payment transactions we process, cardholder accounts on file and other factors (referred to herein as \"transaction volume\"). As the majority of our services are priced as a percentage of transaction value or specified fee per unit or transaction, many under multi-year customer arrangements, our revenues generally grow period-over-period in line with the rate of increase in transaction volume.\nOur operating expenses consist primarily of amortization of intangible assets, the cost of the technology to provide services to our customers and our people costs to support the operations. Many of those costs do not vary directly with the level of payment transactions we process for our customers, generating operating leverage. As revenues increase, operating income and operating margin (operating income as a percentage of revenues) generally increase.\nWe also grow our business through strategic acquisitions of similar businesses. Our revenues increase from the transaction volume from the customers of the acquired businesses. As we integrate the businesses, we also are able to improve operating income and operating margin by generating synergies to lower the cost base of those businesses.\nThe majority of our Merchant Solutions segment revenues is generated by services priced as a percentage of transaction value or a specified fee per transaction, depending on card type or industry vertical. We also earn software subscription and licensing fees, as well as other fees for specific value-added services that may be unrelated to the number or value of transactions. Merchant Solutions segment revenues depend upon a number of factors, such as demand for and price of our services, the technological competitiveness of our offerings, our reputation for providing timely and reliable service, competition within our industry and general economic conditions.\nWe provide payment technology and software solutions to customers and fund settlement either directly, in markets where we have direct membership with the payment networks, or through our relationship with a member financial institution in markets where we are sponsored. Revenues are generally recognized as billed to the customer, net of interchange fees and payment network fees. We market our services through a variety of distribution channels, including a direct sales force, trade associations, agent and enterprise software providers and referral arrangements with value-added resellers (\"VARs\"). We also provide services to merchants referred by ISOs, payment facilitators and financial institutions. In certain of these arrangements, the external partner receives a share of the customer profitability in the form of a monthly residual payment, which is reflected as a component of selling, general and administrative expenses in the accompanying consolidated statements of income.\nIssuer Solutions segment revenues are primarily derived from long-term processing contracts with financial institutions and other financial services providers. Payment processing services revenues are generated primarily from charges based on the number of accounts on file, transactions and authorizations processed, statements generated and/or mailed, managed services, cards embossed and mailed and other processing services for cardholder accounts on file. Most of these customer contracts have prescribed annual minimums, penalties for early termination and service level agreements that may affect contractual fees if specific service levels are not achieved. Issuer Solutions revenues also include loyalty redemption services, professional services, and fees from B2B payments services and other financial service solutions marketed to businesses, including software-as-a-service (“SaaS”) offerings that automate key procurement processes, provide invoice capture, coding and approval, and enable virtual cards and integrated payments options across a variety of key vertical markets.\nDuring the second quarter of 2023, we completed the sale of the consumer portion of our Netspend business, which comprised our former Consumer Solutions segment. For the periods prior to disposition, our Consumer Solutions arrangements included a stand-ready performance obligation to provide account access and facilitate purchase transactions. Revenues principally consisted of fees collected from cardholders and fees generated by cardholder activity in connection with the programs that we managed. Customers were typically charged a fee for each purchase transaction made using their cards, unless the customer was on a monthly or annual service plan, in which case the customer was instead charged a monthly or annual subscription fee, as applicable. Customers were also charged a monthly maintenance fee after a specified period of inactivity. We also charged fees associated with additional services offered in connection with our accounts, including the use of overdraft features, a variety of bill payment options, card replacement, foreign exchange and card-to-card transfers of funds initiated through our call centers.\n\nRevenues were recognized net of fees charged by the payment networks for services they provided in processing transactions routed through them.\nCost of service consists primarily of salaries, wages and related expenses paid to operations and technology-related personnel, including those who monitor our transaction processing systems and settlement functions; the cost of transaction processing systems, including third-party services; the cost of network telecommunications capability; depreciation and occupancy costs associated with the facilities supporting these functions; amortization of intangible assets; costs to fulfill customer contracts; provisions for operating losses; and, when applicable, integration costs. In our Issuer Solutions segment, cost of service also includes out-of-pocket reimbursable costs, such as postage and other production items.\nSelling, General and Administrative Expenses.\nSelling, general and administrative expenses consist primarily of salaries, wages, commissions and related expenses paid to sales personnel, customer support functions other than those supporting revenues, administrative employees and management; share-based compensation; costs to obtain customer contracts; residuals paid to ISOs; fees paid to VARs, independent contractors and other third parties; other selling expenses; depreciation and occupancy costs of leased space directly related to these functions; advertising costs; and, when applicable, acquisition and integration costs and business transformation costs.\nOperating Income and Operating Margin\nFor the purpose of discussing segment operations, we refer to \"operating income,\" which is calculated by subtracting segment direct expenses, including both cost of service and selling, general and administrative expenses, from segment revenues. Overhead and shared expenses, including share-based compensation, are not allocated to segment operations; they are reported in the caption \"Corporate.\" Impairment of goodwill and gains or losses on business dispositions are also not included in determining segment operating income. In addition, in discussing segment operations we refer to \"operating margin,\" which is calculated by dividing segment operating income by segment revenues.\nEquity in Income of Equity Method Investments\nWe have equity method investments, including a 45% interest in China UnionPay Data Co., Ltd., which we account for using the equity method of accounting. Equity in income of equity method investments reflects our proportional share of earnings from these investments.\nYear Ended December 31, 2024 Compared to Year Ended December 31, 2023\nYear Ended December 31,\nYear Ended December 31,\n(dollar amounts in thousands)\nIntersegment eliminations\nConsolidated revenues\nIntersegment eliminations\nConsolidated cost of service\nSelling, general and administrative:\nIntersegment eliminations\nConsolidated selling, general and administrative\nNet (gain) loss on business dispositions\nNM\nConsolidated operating expenses\nOperating income (loss)\nNet gain (loss) on business dispositions\nNM\nConsolidated operating income\nNM\nPercentage amounts may not sum to the total due to rounding.\nRevenues, operating expenses, operating income and operating margin reflect the effects of acquired businesses from the respective acquisition dates and the effects of disposed businesses through the respective disposal dates. See “Note 2—Acquisitions” and “Note 3—Business Dispositions” for further discussion.\nOperating income included acquisition and integration expenses of $211.6 million and $341.9 million for the years ended December 31, 2024 and 2023, respectively, which were primarily included within Corporate selling, general and administrative expenses. For the years ended December 31, 2024 and 2023, operating loss for Corporate also included $13.4 million and $18.5 million, respectively, of other charges related to facilities exit activities.\nDuring the year ended December 31, 2024, Corporate expenses also reflected costs of $99.1 million associated with our business transformation initiative, employee termination benefits of $99.6 million, which included $19.4 million of share-based compensation expense, and charges of $55.8 million for technology assets that will no longer be utilized under a revised technology architecture development strategy.\nConsolidated revenues for the year ended December 31, 2024 increased by $451.5 million, or 4.7%, to $10,105.9 million from $9,654.4 million in the prior year.\nMerchant Solutions Segment.\nRevenues from our Merchant Solutions segment for the year ended December 31, 2024 increased by $536.9 million, or 7.5%, to $7,688.7 million from $7,151.8 million in the prior year.\nThe increase in segment revenues was primarily due to the $479.5 million effect of higher transaction volume. In addition, our acquisition of EVO in March 2023 contributed $189.3 million to segment revenue growth during the year ended December 31, 2024, as the year ended December 31, 2023 only included the acquisition for a portion of the period. The revenues of the EVO business include the cross-selling of our service offerings into the acquired EVO customer base and other benefits to revenues from initiatives of the combined organization. There were no other material factors contributing to the change in segment revenues.\nIssuer Solutions Segment.\nRevenues from our Issuer Solutions segment for the year ended December 31, 2024 increased by $84.8 million, or 3.5%, to $2,483.7 million from $2,398.9 million in the prior year. The increase in revenues was primarily due to an increase in transaction volume of $74.3 million driven by cardholder activity.\nConsumer Solutions Segment.\nThe year ended December 31, 2023 included revenues of $182.7 million related to the consumer business disposed of in April 2023.\nCost of service for the year ended December 31, 2024 increased by $32.6 million, or 0.9%, to $3,760.1 million from $3,727.5 million in the prior year. Cost of service as a percentage of revenues decreased to 37.2% for the year ended December 31, 2024 from 38.6% in the prior year.\nMerchant Solutions Segment.\nCost of service from our Merchant Solutions segment for the year ended December 31, 2024 increased by $82.2 million, or 4.3%, to $2,008.1 million from $1,925.9 million in the prior year. Cost of service as a percentage of segment revenues decreased to 26.1% for the year ended December 31, 2024 from 26.9% in the prior year. The effects of the acquired EVO business on cost of service was an increase of $73.0 million in the year ended December 31, 2024 compared to the prior year, and an unfavorable impact on cost of service as a percentage of segment revenues of 0.3%. Cost of service as a percentage of revenue was lower due to improved operating lever",
  "item2_clean": null
}