{
  "source_file": "grmn-20250927.htm",
  "form_type": "10-Q",
  "item1_clean": null,
  "item7_clean": null,
  "item2_clean": "Global economic and geopolitical conditions impact our operations and financial results, although we believe our vertically integrated and diversified business model enables us to be resilient and flexible in a dynamic business environment. Foreign currency fluctuations and rapidly changing global trade policies, particularly those affecting the United States, increase the economic and operational uncertainties that could significantly harm our business and results of operations. Refer to Part II, Item 1A, “Risk Factors” of this Quarterly Report for further discussion of the risks and uncertainties facing our Company.\n\nAs of September 27, 2025, we had approximately $3.9 billion of cash, cash equivalents and marketable securities. Management invests idle or surplus cash in accordance with the Company's investment policy, which has been approved by the Company’s Board of Directors. The investment policy’s primary objectives are to preserve capital, maintain an acceptable degree of liquidity, and maximize yield within the constraint of low credit risk. Garmin’s average interest rate returns on cash and investments during the first three quarters of 2025 and 2024 were 3.2% and 3.3%, respectively. The fair value of our securities varies from period to period due to changes in interest rates, the performance of the underlying collateral, and the credit performance of the underlying issuer, among other factors. See Note 4 – Marketable Securities in the Notes to the Condensed Consolidated Financial Statements for additional information regarding marketable securities.\n\nThe $20.3 million currency gain recognized in the third quarter of 2025 was primarily due to the U.S. Dollar strengthening against the Taiwan Dollar, partially offset by the U.S. Dollar strengthening against the Euro, Polish Zloty, and British Pound Sterling, within the 13-week period ended September 27, 2025. During this period, the U.S. Dollar strengthened 4.5% against the Taiwan Dollar, resulting in a gain of $26.5 million, while the U.S. Dollar strengthened 0.2% against the Euro, 1.0% against the Polish Zloty, and 2.3% against the British Pound Sterling, resulting in losses of $2.6 million, $2.2 million, and $1.6 million, respectively. The remaining net currency gain of $0.2 million was related to the impacts of other currencies, each of which was individually immaterial.\n\nThe $18.1 million currency gain recognized in the third quarter of 2024 was primarily due to the U.S. Dollar weakening against the British Pound Sterling, Euro, and Polish Zloty, partially offset by the U.S. Dollar weakening against the Taiwan Dollar, within the 13-week period ended September 28, 2024. During this period, the U.S. Dollar weakened 3.7% against the British Pound Sterling, 4.2% against the Euro, and 5.3% against the Polish Zloty, resulting in gains of $3.2 million, $8.9 million, and $9.3 million, respectively, while the U.S. Dollar weakened 2.9% against the Taiwan Dollar, resulting in a loss of $10.4 million. The remaining net currency gain of $7.1 million was related to the impacts of other currencies, each of which was individually immaterial.\n\nTotal operating expense in the first three quarters of 2025 increased 13% in absolute dollars and was relatively flat as a percent of revenue when compared to the year-ago period. Operating expense, as a percent of segment net sales, decreased in the fitness, aviation, and auto OEM segments when compared to the year-ago period by 230 basis points, 110 basis points, and 110 basis points, respectively, due to the increase in sales and greater leverage of expenses. Operating expense, as a percent of segment net sales, increased in the outdoor and marine segments by 110 basis points and 140 basis points, respectively, when compared to the year-ago period due to expenses growing more than sales.\n\nTotal operating expense in the third quarter of 2025 increased 15% in absolute dollars and was relatively flat as a percent of revenue when compared to the year-ago quarter. Operating expense, as a percent of segment net sales, decreased in the fitness, aviation, and marine segments by 110 basis points, 380 basis points, and 100 basis points, respectively, when compared to the year-ago quarter due to increased sales and greater leverage of expenses. Operating expense, as a percent of segment net sales, increased in the outdoor and auto OEM segments by 370 basis points and 490 basis points, respectively, when compared to the year-ago quarter due to decreased sales while expenses increased.\n\nThe Company recorded income tax expense of $108.2 million in the 13-week period ended September 27, 2025, compared to income tax expense of $87.1 million in the 13-week period ended September 28, 2024. The effective tax rate was 21.2% in the third quarter of 2025, compared to 17.9% in the third quarter of 2024. The increase in the effective tax rate in the current quarter was primarily driven by the U.S. tax legislation enacted during the current quarter, which, among other things, changed capitalization requirements of certain research and development costs, resulting in a year-to-date adjustment due to a decrease in certain expected U.S. tax deductions and credits.\n\nThe Company recorded income tax expense of $243.9 million in the first three quarters of 2025, compared to income tax expense of $203.6 million in the first three quarters of 2024. The effective tax rate was 17.7% in the first three quarters of 2025, compared to 17.3% in the first three quarters of 2024. The increase in the effective tax rate in the current period was primarily driven by the U.S. tax legislation enacted during the current quarter, which, among other things, changed capitalization requirements of certain research and development costs, resulting in a decrease in certain expected U.S. tax deductions and credits.\n\nNet sales increased 14% for the 39-week period ended September 27, 2025 when compared to the year-ago period. Total unit sales in the first three quarters of 2025 increased by approximately 10% to 14,547 when compared to total unit sales of 13,165 in the first three quarters of 2024, which differs from the percent increase in revenue primarily due to shifts in segment and product mix. Fitness was the largest portion of our revenue mix in the first three quarters of 2025 at 31%, while outdoor was the largest portion of our revenue mix in the first three quarters of 2024 at 30%.\n\nNet sales increased 12% for the 13-week period ended September 27, 2025 when compared to the year-ago quarter. Total unit sales in the third quarter of 2025 increased by approximately 8% to 4,982 when compared to total unit sales of 4,620 in the third quarter of 2024, which differs from the percent increase in revenue primarily due to shifts in segment and product mix. Fitness was the largest portion of our revenue mix in the third quarter of 2025 at 34%, while outdoor was the largest portion of our revenue mix in the third quarter of 2024 at 33%.\n\nOur discussion and analysis of financial condition and results of operations are based upon the Company’s condensed consolidated financial statements, which have been prepared in accordance with accounting principles generally accepted in the United States. The presentation of these financial statements requires management to make estimates and judgments that affect the reported amounts of assets, liabilities, revenues and expenses, and related disclosure of contingent assets and liabilities. On an on-going basis, we evaluate our estimates, including those related to customer sales programs and incentives, product returns, bad debts, inventories, investments, intangible assets, income taxes, warranty obligations, and contingencies and litigation. We base our estimates on historical experience and various other assumptions that are believed to be reasonable under the circumstances, the results of which form the basis for making judgments about the carrying value of assets and liabilities that are not readily apparent from other sources. Actual results may differ from these estimates under different assumptions or conditions.\n\nCash provided by operating activities totaled $1,079.6 million for the first three quarters of 2025, compared to $948.6 million for the first three quarters of 2024. The increase was primarily due to an increase in cash received from customers primarily driven by higher net sales, partially offset by increases in cash paid for cost of goods sold and operating expenses and a strategic increase in inventory in the first three quarters of 2025 compared to the first three quarters of 2024.\n\nCash used in financing activities totaled $625.5 million for the first three quarters of 2025, compared to $449.4 million for the first three quarters of 2024. This increase was primarily due to higher purchases of treasury shares under the share repurchase plan, higher cash dividend payments, and an increase in the purchase of treasury shares related to equity awards in the first three quarters of 2025 compared to the first three quarters of 2024.\n\nThe Company is a leading worldwide provider of wireless devices, many of which feature location technology such as Global Positioning System (GPS), and applications that are designed for people who live an active lifestyle. We are organized in the five operating segments of fitness, outdoor, aviation, marine, and auto OEM, which represent the primary markets served by the Company. We design, develop, manufacture, market, and distribute a diverse family of GPS-enabled products and other navigation, communications, sensor-based and information products for these markets, as well as products installed by original equipment manufacturers (OEMs) and for aftermarket applications. Our products are sold through a variety of indirect distribution channels, including a large worldwide network of independent retailers, dealers, distributors, installation and repair shops, and OEMs. We also sell our products a"
}