{
  "source_file": "gs-20241231.htm",
  "form_type": "10-K",
  "item1_clean": "FHCs generally can engage in a broader range of financial and related activities than are otherwise permissible for BHCs as long as they continue to meet the eligibility requirements for FHCs. The broader range of permissible activities for FHCs includes underwriting, dealing and making markets in securities and making investments in non-FHCs (merchant banking activities). In addition, certain FHCs, including us, are permitted to engage in certain commodities activities in the U.S. that may otherwise be impermissible for BHCs, so long as the assets held pursuant to these activities do not equal 5% or more of their consolidated assets.\nThe FRB, however, has the authority to limit an FHC’s ability to conduct activities that would otherwise be permissible, and will likely do so if the FHC does not satisfactorily meet certain requirements of the FRB. For example, if an FHC or any of its U.S. depository institution subsidiaries ceases to maintain its status as well-capitalized or well-managed, the FRB may impose corrective capital and/or managerial requirements, as well as additional limitations or conditions. If the deficiencies persist, the FHC may be required to divest its U.S. depository institution subsidiaries or to cease engaging in activities other than the business of banking and certain closely related activities.\nIn addition, we are required to obtain prior FRB approval before certain acquisitions and before engaging in certain banking and other financial activities both within and outside the U.S.\nU.S. G-SIBs, like us, are also required to comply with a rule regarding single counterparty credit limits, which imposes more stringent requirements for credit exposures to major financial institutions.\nThe New York State banking law imposes lending limits (which take into account credit exposure from derivative transactions) and other requirements that have in the past impacted and could in the future impact the manner and scope of GS Bank USA’s activities.\nTHE GOLDMAN SACHS GROUP, INC. AND SUBSIDIARIES\nThe U.S. federal bank regulatory agencies have issued guidance that focuses on transaction structures and risk management frameworks and that outlines high-level principles for safe-and-sound leveraged lending, including underwriting standards, valuation and stress testing. This guidance has, among other things, limited the percentage amount of debt that can be included in certain transactions.\nAs a German credit institution, GSBE is subject to Volcker Rule-type prohibitions under German banking law and regulations because its financial assets exceed certain thresholds. Prohibited activities include (i) proprietary trading, (ii) high-frequency trading at a German trading venue, and (iii) lending and guarantee businesses with German hedge funds, German funds of hedge funds or any non-German substantially leveraged alternative investment funds, unless an exclusion or an exemption applies.\nAs part of its implementation of the Basel III Revisions, the E.U. introduced new restrictions on the provision of certain “core” banking services (i.e., deposit-taking, lending and the provision of commitments and guarantees) cross-border into the E.U. Contracts in place before June 2026 will be subject to a “grandfathering” provision and new core banking services will need to be executed out of our subsidiaries established in the E.U., including GSBE.\nU.K. banks that have over £35 billion of core retail deposits are required to separate their retail banking services from their investment and international banking activities, commonly known as “ring-fencing.” GSIB is not currently subject to the ring-fencing requirement.\nCRA.\nIn 2023, GS Bank USA ceased to be assessed as a “wholesale bank” for CRA and New York Community Reinvestment Act (NYCRA) compliance purposes. GS Bank USA instead adopted a strategic plan that was approved by the FRB and NYDFS. The 2023 strategic plan will be in effect through 2028. While the plan is in effect, its terms will not be impacted by the revised federal CRA regulations, jointly published by the FDIC, FRB, and OCC in 2023. The revised federal CRA regulations tailor CRA evaluations to bank size and type, with many of the changes applying only to banks with over $2 billion in assets and several applying only to banks with over $10 billion in assets, including GS Bank USA. A court has issued a preliminary injunction enjoining the U.S. federal bank regulatory agencies from enforcing the revised regulations pending resolution of the lawsuit challenging the regulations.\nThe CRA does not establish specific lending requirements or programs for financial institutions nor does it limit an institution’s discretion to develop the types of products and services that it believes are best suited to its particular community, but depository institutions may only receive CRA credit for certain types of lending and for lending, investments and services that support community development, as defined in the CRA regulations. The CRA and its regulations require each appropriate federal bank regulatory agency, in connection with its examination of a depository institution, to assess such institution’s record of meeting the credit needs of the communities served by that institution, including the needs of low- and moderate-income borrowers and neighborhoods, and to make such assessment available to the public.\nThe assessment also is part of the FRB’s consideration of applications to acquire, merge or consolidate with another banking institution or its holding company, to assume deposits of or acquire assets from another depository institution, to establish a new domestic branch office that will raise deposits, or to relocate an office. In the case of a BHC applying for approval to acquire a bank or another BHC, the FRB will assess the records of performance under the CRA of the IDIs involved in the transaction, and such records may be the basis for denying the application.\nIf GS Bank USA fails to maintain at least a “satisfactory” rating under the CRA, we would be subject to restrictions on certain new activities and acquisitions.\nWe are also subject to provisions of the New York Banking Law that impose continuing and affirmative obligations upon New York State-chartered banks, such as GS Bank USA, to serve the credit needs of its local community (NYCRA). Such obligations are substantially similar to those imposed by the CRA. The NYCRA requires the NYDFS to make a periodic written assessment of an institution’s compliance with the NYCRA, and to make such assessment available to the public. The NYCRA also requires the NYDFS to consider the NYCRA rating when reviewing an application to engage in certain transactions, including mergers, asset purchases and the establishment of domestic branch offices, and provides that such assessment may serve as a basis for the denial of any such application.\nTHE GOLDMAN SACHS GROUP, INC. AND SUBSIDIARIES\nBroker-Dealer and Securities Regulation\nOur broker-dealer subsidiaries, including GS&Co., are subject to regulations that cover all aspects of the securities business, including sales methods, trade practices, the use and safekeeping of clients’ funds and securities, capital structure, record-keeping, the financing of clients’ purchases, and the conduct of directors, officers and employees. In the U.S., the SEC is the federal agency responsible for the administration of the federal securities laws.\nThe SEC requires lenders of securities to provide the material terms of securities lending transactions to FINRA and for FINRA to make certain terms publicly available. Reporting under this requirement will begin in January 2026.\nThe SEC requires broker-dealers to act in the best interest of their retail customers. SEC rules require broker-dealers to provide a standardized, short-form disclosure highlighting services offered, applicable standards of conduct, fees and costs, the differences between brokerage and advisory services, and any conflicts of interest. In addition, several states have adopted or proposed adopting uniform fiduciary duty standards applicable to broker-dealers.\nThe SEC has proposed four rules to reform the U.S. equity market structure, two of which have been adopted. In 2024, the SEC adopted a rule, effective December 2025, to revise and expand reporting and disclosure requirements relating to execution quality. In 2024, the SEC also adopted a rule to update the minimum pricing increments, with variable price increments based on the trading characteristics of stocks. In December 2024, the SEC stayed the implementation of this rule, which would apply starting in November 2025, pending the outcome of litigation challenging the rule.\nThe SEC, FINRA and regulators in various non-U.S. jurisdictions have imposed both conduct-based and disclosure-based requirements with respect to research reports and research analysts and may impose additional regulations.\nThe SEC prohibits participants involved in the creation of asset-backed securities, including any underwriter, placement agent, initial purchaser or sponsor of an asset-backed security (or any affiliate or subsidiary), from engaging in any transaction that involves or results in a material conflict of interest between the securitization participant and an investor in an asset-backed security, including reducing its exposure to the asset-backed securities, subject to certain exceptions.\nThe SEC requires that SEC-registered clearing agencies set up policies and procedures that would, among other things, require many market participants to clear cash and repurchase transactions involving U.S. Treasury securities through such a clearing agency by December 2025 for cash transactions and by June 2026 for repurchase transactions.\nGS&Co. and other U.S. subsidiaries are also subject to rules adopted by U.S. federal agencies pursuant to the Dodd-Frank Act that require any person who organizes or initiates certain asset-backed securities transactions to retain a portion (generally, at least five percent) of any credit risk that the person conveys to a third party. For certain securitization transactions, retention by third-party purchasers may satisfy this requirement.\nIn Europe, we provide broker-dealer services, including through GSBE, GSPIC and GSI, that are subject to oversight by European and national regulators. These services are regulated in accordance with E.U., U.K. and other national laws and regulations. These laws require, among other things, compliance with certain capital adequacy and liquidity standards, customer protection requirements and market conduct and trade reporting rules. Certain of our European subsidiaries are also regulated by the securities, derivatives and commodities exchanges of which they are members.\nTHE GOLDMAN SACHS GROUP, INC. AND SUBSIDIARIES\nIn the E.U. and the U.K., the Markets in Financial Instruments Directives (MiFID II) and the Markets in Financial Instruments Regulations (MiFIR) (as amended from time to time, including the proposed amendments to MiFID II and MiFIR), have established trading venue categories for the purposes of discharging the obligation to trade OTC derivatives on a trading platform, established enhanced pre- and post-trade transparency covering a wide range of financial instruments, placed volume caps on non-transparent liquidity trading for equities trading venues, limited the use of broker-dealer equities crossing networks and created a regime for systematic internalizers in certain financial instruments (which are investment firms that execute transactions outside a trading venue). Additional control requirements apply to algorithmic trading, high frequency trading and direct electronic access. Commodities trading firms are required to calculate their positions and adhere to specific position limits. MiFID II and MiFIR also require transaction reporting, transparency on costs and charges to clients for portfolio management and inv",
  "item7_clean": null,
  "item2_clean": null
}