{
  "source_file": "gww-20250930.htm",
  "form_type": "10-Q",
  "item1_clean": null,
  "item7_clean": null,
  "item2_clean": "Item 2: Management's Discussion and Analysis of Financial Condition and Results of Operations\nThe following Management’s Discussion and Analysis (MD&A) of Financial Condition and Results of Operations is intended to help the reader understand the results of operations and financial condition of W.W. Grainger, Inc. (Grainger or Company) as it is viewed by management of the Company. The following discussion should be read in conjunction\nPercentage figures included in this section have not been calculated on the basis of such rounded figures but on the basis of such amounts prior to rounding. For this reason, percentage amounts in this section may vary slightly from those obtained by performing the same calculations using the figures in the Company's Condensed Consolidated Financial Statements or in the associated text.\nGrainger is a broad line, business-to-business distributor of maintenance, repair and operating (MRO) products and services with operations primarily in North America, Japan and the U.K. Grainger uses a combination of its high-touch solutions and endless assortment businesses to serve its customers worldwide, which rely on Grainger for products and services that enable them to run safe, sustainable and productive operations.\nStrategic Priorities\nMacroeconomic Conditions\nThe global economy continues to experience elevated levels of volatility and uncertainty, including within the commodity, labor, and transportation markets, driven by a combination of geopolitical developments and macroeconomic factors. Recent imposition of new and fluctuating tariffs have further contributed to disruptions in global capital markets and global supply chains. These developments may impact the Company’s operations, financial condition, and results of operations.\nThe Company is actively monitoring economic conditions in the U.S. and internationally, including the potential ramifications of evolving trade policies, changes in interest rates, foreign currency exchange rate fluctuations, inflationary pressures, and the risk of a global or regional economic recession. In response to these factors, the Company has implemented various strategies designed to mitigate certain adverse effects of changing inflationary conditions and supply chain challenges, while continuing to maintain market price competitiveness to the extent possible.\nHistorically, the Company's broad and diverse customer base and the generally nondiscretionary nature of its products have provided a degree of resilience during periods of economic contraction in the industrial MRO market. However, the ultimate impact of ongoing macroeconomic conditions, including recent, unprecedented tariff-related developments and shifting government budget policies and priorities at the municipal, state, and national levels, remains uncertain and cannot be predicted at this time, but may impact the Company’s operations, financial condition, and results of operations.\nW.W. Grainger, Inc. and Subsidiaries\nMANAGEMENT’S DISCUSSION AND ANALYSIS OF FINANCIAL\nCONDITION AND RESULTS OF OPERATIONS\nResults of Operations –Three Months Ended September 30, 2025\nIn this section, Grainger utilizes non-GAAP measures where it believes it will assist users of its financial statements in understanding its business. As discussed in the \"Non-GAAP Measures\" section, we have adjusted the current year results to exclude one-time losses recorded in SG&A expenses of\nwithin Endless Assortment, related to the intention to exit the U.K. market. For further information regarding the Company's non-GAAP measures, including reconciliations to the most directly comparable GAAP measures, see below \"Non-GAAP Measures.\"\nThe following table is included as an aid to understanding the changes in Grainger’s Condensed Consolidated Statements of Earnings for the three months ended September 30, 2025 and 2024 (in millions of dollars except per share amounts):\nThree Months Ended September 30,\nSelling, general and administrative expenses\nIncome tax provision\nNoncontrolling interest\nNet earnings attributable to W.W. Grainger, Inc.\nDiluted earnings per share\nThe following table is included as an aid to understanding the changes of Grainger's total net sales, daily net sales and daily, constant currency net sales from the prior period for the three months ended September 30, 2025 and 2024 (in millions of dollars):\nThree Months Ended September 30,\nDaily, constant currency net sales\nCalculated on the basis of prior year net sales for the three months ended September 30, 2025 and 2024.\nDaily net sales are adjusted for the difference in U.S. selling days relative to the prior year period. Daily, constant currency net sales are also adjusted to exclude the impact on net sales due to year-over-year foreign currency exchange rate fluctuations. There were 64 sales days in the three months ended September 30, 2025 and 2024.\nFor further information regarding the Company's non-GAAP measures, including reconciliations to the most directly comparable GAAP measures, see below \"Non-GAAP Measures.\"\nW.W. Grainger, Inc. and Subsidiaries\nMANAGEMENT’S DISCUSSION AND ANALYSIS OF FINANCIAL\nCONDITION AND RESULTS OF OPERATIONS\nNet sales of $4,657 million for the three months ended September 30, 2025 increased $269 million, or 6%, and on a daily, constant currency basis, net sales increased 5% compared to the same period in 2024. Both High-Touch Solutions N.A. and the Endless Assortment segment contributed to sales growth in the third quarter of 2025\nFor further discussion on the Company's net sales, see the Segment Analysis section below.\nGross profit of $1,798 million for the three months ended September 30, 2025 increased $78 million, or 5%, and gross profit margin of 38.6% decreased 60 basis points compared to the same period in 2024. For further discussion on the Company's gross profit, see the Segment Analysis section below.\nSelling, general and administrative (SG&A) expenses of $1,287 million for the three months ended September 30, 2025 increased $253 million, or 25%, compared to the same period in 2024. Adjusted SG&A expenses of $1,091 million increased $57 million, or 6%, compared to the same period in 2024. The increase was primarily due to higher marketing expenses in the third quarter of 2025.\nOperating earnings of $511 million for the three months ended September 30, 2025 decreased $175 million, or 26%, compared to the same period in 2024. Adjusted operating earnings of $707 million\n\nReflects the asset impairment loss and other expenses recorded in the third quarter of 2025 related to the Company's intention to exit the U.K. market, including the planned divestiture of the Cromwell business, which was held for sale as of September 30, 2025, and restructuring costs incurred in the second quarter of 2024.\nCompared to the reported and adjusted results of the prior year period.\nGrainger's businesses reported in Other do not meet the criteria of a reportable segment.\nGrainger's reported and adjusted effective tax rates were 26.6% and 24.0% for the nine months ended September 30, 2025, respectively. The nine months ended September 30, 2024 reflect a tax benefit related to the restructuring costs incurred in the second quarter.\nW.W. Grainger, Inc. and Subsidiaries\nMANAGEMENT’S DISCUSSION AND ANALYSIS OF FINANCIAL\nCONDITION AND RESULTS OF OPERATIONS\nLiquidity and Capital Resources\nGrainger believes its current balances of cash and cash equivalents, marketable securities, and availability under its revolving credit facility will be sufficient to meet its liquidity needs for the next twelve months. The Company expects to continue to invest in its business and return excess cash to shareholders through cash dividends and share repurchases, which it plans to fund through cash flows generated from operations. Grainger also maintains access to capital markets and may issue debt or equity securities from time to time, which may provide an additional source of liquidity.\nCash and Cash Equivalents\nAs of September 30, 2025 and December 31, 2024, Grainger had cash and cash equivalents of $535 million and $1,036 million, respectively. The Company had approximately $1.8 billion in available liquidity as of September 30, 2025.\nThe following table shows the Company's cash flow activity for the periods presented (in millions of dollars):\nNine Months Ended September 30,\nTotal cash provided by (used in):\nOperating activities\nInvesting activities\nFinancing activities\nEffect of exchange rate changes on cash and cash equivalents\nIncrease (decrease) in cash and cash equivalents\nNet cash provided by operating activities was $1,620 million and $1,683 million for the nine months ended September 30, 2025 and 2024, respectively. The decrease was driven by unfavorable changes in working capital primarily due to inventory inflation partially offset by timing of cash payments compared to the prior year period.\nNet cash used in investing activities was $543 million and $262 million for the nine months ended September 30, 2025 and 2024, respectively. The increase was due to capital expenditures driven by continued U.S. and MonotaRO supply chain investments in the first nine months of 2025.\nNet cash used in financing activities was $1,599 million and $615 million for the nine months ended September 30, 2025 and 2024, respectively. The increase in cash used in financing activities was primarily due to the repayment of the 1.85% Senior Notes in the amount of $500 million.\nWorking capital as of September 30, 2025 was $3,347 million, an increase of $65 million compared to $3,282 million as of December 31, 2024. As of September 30, 2025 and December 31, 2024, the ratio of current assets to current liabilities was 2.8 and 2.9, respectively.\nGrainger maintains a debt ratio and liquidity position that provides flexibility in funding working capital needs and long-term cash requirements. Grainger has various sources of financing available.\nTotal debt as a percent of total capitali"
}