{
  "source_file": "hal-20250930.htm",
  "form_type": "10-Q",
  "item1_clean": null,
  "item7_clean": null,
  "item2_clean": "operations can be affected by inaccurate assumptions we make or by known or unknown risks and uncertainties. In addition,\n\ninformation involves risks and uncertainties and reflects our best judgment based on current information. Our results of\n\non 2024 share repurchases\nof dividends to our shareholders.\nrelated to a purchase of an equity investment.\nto acquire businesses.\non the purchase of investment securities.\nFuture sources and uses of cash\nWe manufacture most of our own equipment, which provides us with some flexibility to increase or decrease our\ncapital expenditures based on market conditions. We currently expect capital spending for\nHowever, we intend to reduce our capital expenditures in 2026 by 30%, to approximately $1.0 billion, in response to\nthe market conditions we expect to encounter. Despite this reduction, we believe this level of spending will enable continued\ninvestment in our core strategic technologies and businesses, including the international expansion of\nintervention, unconventionals, and drilling technologies.\nWhile we maintain focus on liquidity and debt reduction, we are also focused on providing cash returns to our\n\nthird quarter of 2024, we made a strategic decision to market for sale a portion of our chemical business.\nDrilling and Evaluation provides field and reservoir modeling, drilling, fluids, evaluation, and precise wellbore\n\nglobal economic activity and cautious consumer spending, which tempered expectation for near-term demand.\nIn the United States, the active rig count declined modestly in the third quarter of 2025 compared to the second\n\ncountries around the world, and our corporate headquarters is in Houston, Texas.\nOur value proposition is to collaborate and engineer solutions to maximize asset value for our customers. We work to\n\nin Saudi Arabia were offset by rig additions elsewhere in the Middle East.\nSince the end of the third quarter of 2025, the macro environment for oil and natural gas has remained volatile. Trade\n\nconsolidated statements of operations.\nEgypt Currency Impact.\nIn the first quarter of\n, the Egyptian pound devalued by approximately 35% relative to\n\nall-time high in the third quarter of 2025. Internationally, rig count increased modestly in the third quarter of 2025, as declines\n\nrate for the quarter was primarily impacted by the additional $125 million valuation allowance recorded against our deferred tax\n\nquarter of 2025, with activity in oil basins continuing to soften while gas basins remained relatively stable. However, despite\n\nRussia-Ukraine conflict remain persistent sources of volatility, the more pronounced influence this quarter came from weaker\n\nto participate in the energy mix transition at relatively low risk by investing our expertise, resources, and team without a\n\nprices had decreased by approximately 12% since the end of the second quarter of 2025.\nIn response to these factors, we have\n\nsupply chain organization continuously monitors market trends and works to mitigate those and other cost increases through\n\nextension of the project, we currently expect the estimated total cost will be approximately $40 million per quarter going\n\nsoftness in the market, in the third quarter of 2025, we reduced our variable and fixed cash costs to size our business\n\nExchange Commission. We also suggest that you listen to our quarterly earnings release conference calls with financial\n\naccordingly, which we expect will save us approximately $100 million per quarter going forward. Furthermore, we will\n\nOil prices declined further in the third quarter of 2025 compared to the second quarter of 2025, as ongoing supply\n\n, resulting in an effective tax rate of\nfor the quarter. We recorded a tax benefit of $41 million during the\n\nBy operating segment:\nCompletion and Production\nDrilling and Evaluation\nBy geographic region:\nBy operating segment:\nCompletion and Production\nDrilling and Evaluation\nSAP S4 upgrade expense\nImpairments and other charges\nTotal operating income\nn/m = not meaningful\nCompletion and Production\nCompletion and Production revenue in\nthe first nine months of 2025\n\nHistorical average rig counts shown are based on data provided by Baker Hughes, which included retroactive\nchanges to international rig counts previously reported.\nHAL\nQ3 2025\nFORM\n10-Q\n| Business Environment and Results of Operations\nGeopolitical tensions in the Middle East and the Russia-Ukraine conflict continue to cause high volatility in oil\n\nBy operating segment:\nCompletion and Production\nDrilling and Evaluation\nBy geographic region:\nBy operating segment:\nCompletion and Production\nDrilling and Evaluation\nSAP S4 upgrade expense\nImpairments and other charges\nTotal operating income\nn/m = not meaningful\nCompletion and Production\nCompletion and Production revenue in the\n\noil, and Henry Hub natural gas.\nNatural Gas Price - Henry Hub\nOil prices measured in dollars per barrel.\nNatural gas price measured in dollars per million British thermal units (Btu), or MMBtu.\nThe historical average rig counts based on the weekly Baker Hughes rig count data w\n\nconjunction with the\ncondensed consolidated\nfinancial statements included in “Item 1. Financial Statements” contained herein.\nEXECUTIVE OVERVIEW\nWe are one of the world’s largest providers of products and services to the energy industry. We help our customers\n\nactivities, which has caused us to lower our expectations of activity over the short to medium term.\nWe expect our full year 2025 international revenue to decrease year over year primarily driven by further activity\n\nliabilities and were not required to make any material cash distributions to our unconsolidated subsidiaries.\nWe have entered into CDSs with third-party financial institutions that have an aggregate notional amount\n\neffective solutions to minimize their operational impact.\nHAL\nQ3 2025\nFORM\n10-Q\n| Executive Overview\nThe following graph illustrates our revenue and operating margins for each operating segment for the\n\nand support Halliburton Labs early-stage company participants.\nHAL\nQ3 2025\nFORM\n10-Q\n| Executive Overview\ndepict the revenue split between our two operating segments and our four primary geographic\n\nHAL\nQ3 2025\nFORM\n10-Q\n| Forward-Looking Information\nFORWARD-LOOKING INFORMATION\nThe Private Securities Litigation Reform Act of 1995 provides safe harbor provisions for forward-looking information.\n\nHAL\nQ3 2025\nFORM\n10-Q\n| Business Environment and Results of Operations\nBUSINESS ENVIRONMENT AND RESULTS OF OPERATIONS\nthroughout the world to provide a comprehensive range of services and products\n\nand Africa. Partially offsetting these declines were increased completion tool sales in Europe and Canada.\nDrilling and Evaluation\nDrilling and Evaluation revenue in\nthe first nine months of 2025\n\nguaranteed. Actual events and the results of our operations may vary materially.\nWe do not assume any responsibility to publicly update any of our forward-looking statements regardless of whether\n\nOur credit ratings with Standard & Poor’s\nremain BBB+ for our long-term debt and A-2 f\nterm debt, with a stable outlook. Our credit ratings with Moody's Investors Service remain A3 for our long\n\nServices, Sperry Drilling, Testing and Subsea, and Wireline and Perforating.\nThe business operations of our segments are organized around four primary geographic regions: North America, Latin\n\ntargeted process improvements to enhance the effectiveness and efficiency of our utilization of capital.\n: Return over 50% of annual free cash flow to shareholders through dividends and share\n\nManagement's Discussion and Analysis of Financial Condition and Results of Operations\nManagement's Discussion and Analysis of Financial Condition and Results of Operations should be read in\n\nEmirates and higher pressure pumping services in India.\nOther Operating Items\nSAP S4 Upgrade Expense.\nAs previously mentioned, during 2023 we began our migration to SAP S4, which we expect\n\nsegments, the Completion and Production segment and the Drilling and Evaluation segment.\nCompletion and Production delivers cementing, stimulation,\n, intervention, pressure control,\n\nNo other country accounted for more than 10% of our revenue\nActivity within our business segments is significantly impacted by spending on upstream exploration, development, and\n\nproduction requirements will in turn create demand for our products and services.\nHAL\nQ3 2025\nFORM\n10-Q\n| Results of Operations in\n(QTD)\nRESULTS OF OPERATIONS IN\nCOMPARED TO\n\nand accounts payable, had\non the sale of an equity investment.\non the sale of investment securities.\nshares of our common stock for\n, which includes excise tax payment due\n\nhigher completion tool sales and increased fluid services in the Gulf of America and higher drilling activity in US Land.\nHAL\nQ3 2025\nFORM\n10-Q\n| Results of Operations in\n\nHAL\nQ3 2025\nFORM\n10-Q\n| Liquidity and Capital Resources\nGuarantee agreements\nIn the normal course of business, we have agreements with financial institutions under which\n\noperations and their access to the credit markets, as well as unsettled political conditions.\nReceivables from our primary customer in Mexico accounted for approximately\n\nfree cash flow and returns, and capital discipline.\nDespite the softening market described above, we believe the combination of long-cycle international investment and\n\n“Business Environment and Results of Operations.”\nIn 2021, we announced our target to achieve a 40% reduction in our Scope 1 and 2 emissions by 2035 from the 2018\n\nparticipating companies and alumni.\nHAL\nQ3 2025\nFORM\n10-Q\n| Liquidity and Capital Resources\nL\nIQUIDITY AND CAPITAL RESOURCES\nof cash and equivalents, compared to\n\nrtificial lift activity in Kuwait.\nOther Operating Items\nSAP S4 Upgrade Expense.\nAs previously mentioned, during 2023, we began our migration to SAP S4, which we\n\nfor our short-term debt, with a stable outlook.\nCustomer receivables\nIn line with industry practice, we bill our customers for our services in arrears and are,\n\nfor further discussion of these charge"
}