{
  "source_file": "has-20241229.htm",
  "form_type": "10-K",
  "item1_clean": "Our global marketing function establishes brand direction and messaging and assists the selling entities in establishing local marketing programs. The global marketing group works with the global development function to deliver unified, brand-specific consumer experiences. In addition to the global marketing function, our local selling entities employ sales and marketing functions responsible for local market activities and execution.\nOur products are sold globally to a broad spectrum of customers, including mass-market retailers, distributors, wholesalers, discount stores, specialty hobby stores, drug stores, mail order houses, catalog stores, department stores and other traditional retailers, large and small, as well as ecommerce retailers and direct-to-customer through our fan-focused Hasbro Direct business. Our own sales forces account for the majority of sales of our products with remaining sales generated by independent distributors who, for the most part, sell our products in areas of the world where we do not otherwise maintain a direct presence. The majority of our product sales are to large chain stores, distributors, e-retailers and wholesalers.\nCustomer Concentration\nDuring 2024, net revenues from our top five customers accounted for approximately 36% of our consolidated global net revenues, including our largest customers, Wal-Mart, Inc. and Amazon.com, Inc. who together represented 23% of consolidated global net revenues, with each accounting for 12% and 11%, respectively. Please see Part I, Item 1A.\nWe advertise many of our products and brands through digital marketing, social media and on television. Products are strategically cross-promoted by spotlighting specific products alongside related offerings in a manner that promotes the sale of not only the selected item, but also those complementary products.\nPart of our strategy includes focusing on reinforcing storylines associated with our brands through several mediums, including digital and tabletop gaming, consumer products, television, film and live action experiences. Our brands obtain marketing and advertising support through entertainment appearing on major networks globally, theatrical releases as well as on various other digital platforms.\nMany of our new products are introduced to major customers within one to two years leading up to their year of retail introduction. Our advertising expenditures are impacted by our product mix in any given year. For example, brands based on major motion picture releases generally require less advertising as a result of the promotional activities around the motion picture release, whereas leading into a major digital gaming launch, our Wizards of the Coast business will have substantial increases to advertising, marketing and promotional expenses to acquire players and promote gaming releases.\nSupply Chain and Manufacturing\nBeginning in late 2022, we launched a multi-year initiative aimed at transforming our global supply chain into a best-in-class network that delivers competitive advantages through performance efficiency, operating model integration and organizational accountability. We are continuing to refine our integrated supply chain from planning and designing to sourcing and delivering, with our multi-year plan to deliver improved capabilities and provide a productivity pipeline to fuel growth at Hasbro.\nThe majority of our toy and game products are manufactured in third-party facilities principally in the U.S. and the Far East, primarily China, Vietnam, India and Japan. We continually look to diversify our manufacturing footprint.\nMost of our toys and games are manufactured from basic raw materials such as plastic, paper and cardboard, although certain products also use electronic components. All of these materials are readily available but may be subject to significant fluctuations in price. There are certain chemicals (including phthalates and BPA) that national, state and local governments have restricted or are seeking to restrict or limit the use of; however, we do not believe these restrictions have or will materially impact our business. We generally enter into agreements with suppliers at the beginning of a fiscal year that establish prices for that year. However, significant volatility in the prices of any of these materials may require renegotiation with our suppliers during the year.\nWe are a worldwide leader in the development, design, sale and marketing of games and toys, operating in a highly competitive business environment. We believe our diversified portfolio together with the strength of our extensive intellectual property portfolio provides us with a competitive advantage and allows us to adapt to changes in the competitive landscape, consumer trends and economic conditions.\nThe play industry is highly competitive. We view our primary competition as coming from game and toy companies, digital gaming companies and digital gaming developers. We compete with several large companies in our product categories, as well as with many smaller United States and international game and toy designers, manufacturers and marketers. In certain instances, we also compete with large retailers, who offer such products under their own private labels, often at lower prices. Competition is based primarily on meeting consumer preferences and on the quality and play value of our products and experiences. To a lesser extent, competition is also based on product pricing. We expect that as artificial intelligence becomes more prevalent, we will see increased competition from those using such technology to develop games, toys and content.\nWe also contend with the expanding variety of digital gaming and digital entertainment offerings available for children, while product life cycles of traditional toys and games have shortened. As a result, our products not only compete with those offerings produced by other toy and game manufacturers and companies offering branded family play and entertainment, we also compete, particularly in meeting the demands of older children, with entertainment offerings of many technology companies, such as makers of tablets, mobile devices, video games and other digital gaming products and screens, and social media companies.\nOur Wizards and entertainment businesses are subject to variations in sales based on the timing of release of card sets, games, and content releases. Release dates are determined by several factors, including the timing of holiday periods, geographical release dates and competition in the market.\nFor our Consumer Products segment, our customer order patterns may vary from year to year largely due to fluctuations in the degree of consumer acceptance of product lines, supply and product availability, marketing strategies and inventory policies of retailers, TV and film content releases, including the dates of theatrical releases of major motion pictures for which we offer products, and changes in overall economic conditions. As a result, a disproportionate volume of our net revenues from our consumer products business has historically been earned during the third and fourth quarters leading up to the retail industry’s holiday selling season, including Christmas.\nIn 2024 and 2023, the second half of the year accounted for approxima\nand 56% of full year revenues, respectively, with the third and fourth quarters accounting for approximately 31% and 27%, respectively, of full year net revenues in 2024 and 30% and 26%, respectively, of full year revenues in each of the third and fourth quarters of 2023.\nEnvironmental, Social and Governance\nThe following discusses our governance and focus areas of our Environmental, Social and Governance (ESG) efforts.\nESG governance starts with our Board of Directors (\"Board\"), with specific oversight by our Nominating, Governance and Social Responsibility Committee of the Board (\"Governance Committee\"). ESG topics, such as climate and sustainability, human rights and ethical sourcing, are regular agenda items at Governance Committee meetings. The Governance Committee analyzes these issues and makes recommendations to the full Board. In\naddition, the Audit Committee of our Board oversees SEC and public disclosures in specific matters, such as conflict minerals, and enterprise risk. The full Board receives regular updates regarding our ESG progress.\nIn addition to Board-level governance, our CEO and the Executive Leadership Team (\"ELT\") regularly review our ESG performance, progress and opportunities. Our ELT and members of our global corporate sustainability team meet several times a year to ensure management oversight of the Company’s ESG strategy, impact and performance. This group sets the direction for our global ESG strategy and ensures the integration of ESG throughout the organization and supply chain.\nClimate and Sustainability\nWe recognize the impact our business can have on the environment and are working to reduce our footprint. We view sustainability challenges as opportunities to innovate and to continuously improve our product design and operational efficiencies.\nThe Science-Based Targets Initiative (\"SBTi\") has validated our greenhouse gas (\"GHG\") emission reductions targets.\nWe continue our industry-first toy recycling program in partnership with TerraCycle, a leader in product recycling outside of municipal recycling.\nWe continue to work to integrate the climate risk identification and mitigation into our overall enterprise risk management process and into our preparation work for the EU Corporate Sustainability Reporting Directive (CSRD).\nHuman Rights and Ethical Sourcing\n\nHasbro, Inc. (“Hasbro”) is a leading game, intellectual property (\"IP\"), and toy company whose mission is to create joy and community through the magic of play. With over 100 years of expertise, we deliver play experiences to kids, families, and fans around the world, through physical and digital games, video games, toys, licensed consumer products, location-based entertainment, film, TV and more.\nThrough our franchise-first approach, we unlock value from both new and legacy IP, including MAGIC: THE GATHERING, DUNGEONS & DRAGONS, MONOPOLY, HASBRO GAMES, NERF, TRANSFORMERS, PLAY-DOH and PEPPA PIG, as well as premier partner brands. Powered by our portfolio of iconic brands and a diversified network of partners and subsidiary studios, we bring fans together wherever they are, from tabletop to screen.\nFor more than a decade, Hasbro has been consistently recognized for its corporate citizenship, including being named one of the 100 Best Corporate Citizens by 3BL Media, a 2025 JUST Capital Industry Leader, one of the 50 Most Community-Minded Companies in the U.S. by the Civic 50, and a Brand that Matters by Fast Company.\nFiscal year 2024 was a year of continued transformation for our business and we began to see tangible results from our initiatives. Specifically, we focused our efforts on strategic investments in our most valuable and profitable franchises across games, licensing, toys and entertainment. We also made significant progress in our cost-savings initiatives, and further strengthened our leadership team with industry veterans and turnaround experts.\n2024 Business Results\nWe finished 2024 with momentum, led by another record year in our Wizards of the Coast and Digital Games segment, continued success in licensing, and operating profit improvement across the Company.\nMAGIC: THE GATHERING had a solid year, nearly matching 2023’s record despite fewer set releases. Modern Horizons 3, Bloomburrow, and Duskmourn led performance in tentpole sets with backlist and Secret Lair demand also exceeding expectations.\nDigital licensing growth was led by Monopoly Go! from our partners at Scopely, Inc., closing the year with a successful TV campaign and the launch of Tycoon Club. We also continued to see sales from Baldur's Gate 3 after its successful release in 2023 by our partners at Larian Studios.\nFor DUNGE",
  "item7_clean": "Income tax expense totaled $102.6 million on pre-tax income of $497.0 million during 2024 compared to an income tax benefit of $221.3 million on pre-tax loss of $1,709.1 million during 2023. During 2024, the Company incurred a $37.4 million unfavorable adjustment to the 2023 Loss on sale of the Film & TV reporting unit with no corresponding tax benefit. Absent the unfavorable adjustment to the loss on sale with no corresponding tax benefit, the Company recorded a net discrete tax benefit of $13.1 million, primarily associated with a benefit from the release of uncertain tax positions for certain statute of limitation expirations, and favorable return to provision adjustments. Fiscal year 2023 includes discrete items related to an impairment of goodwill in our Family Brands reporting unit of $960.0 million with no tax benefit and an impairment of goodwill in the Film and TV reporting unit of $231.2 million with no tax benefit. Exclusive of the goodwill impairments, the Company recorded a net discrete tax benefit of $278.7 million. This benefit is primarily related to two items: (i) the Company recognized tax benefits of $124.0 million associated with the impairment of trade names in our Film and TV reporting unit, as well as loss on assets held for sale, and (ii) during 2023, the Company concluded its discussions with the tax authorities in Switzerland as to the application of the grandfathering rules related to 2020 Swiss Tax Reform. This resulted in the recording of a deferred tax asset of $135.6 million related to tax intangibles that will be amortized over time and result in a future cash tax benefit. This treatment applies starting in 2021.\nSubsequent to the United States passing the Tax Cuts and Jobs Act (the \"Tax Act\"), the Company has greater flexibility to manage cash globally. The Company intends to repatriate the accumulated foreign earnings as needed from time to time. The Company still has significant cash needs outside the United States and continues to consistently monitor and analyze its global working capital and cash requirements. As of 2024, we have recorded $4.6 million of foreign withholding and U.S. state income tax liability. The Company will continue to record additional tax effects, if any, in the period that the on-going distribution analysis is completed and is able to make reasonable estimates.\nTax laws are regularly being re-examined and evaluated globally. The Organization for Economic Co-operation and Development (\"OECD\") has a framework to implement a global minimum corporate tax of 15% for companies with global revenues and profits above certain thresholds (referred to as \"Pillar 2\"). Certain aspects of Pillar 2 were effective in 2024, which were not material to the Company’s financial statements, and other aspects are effective January 1, 2025. Many non-US tax jurisdictions have either (i) enacted legislation to adopt certain components of Pillar 2 beginning in 2024 (including the European Union Member States) with delayed adoption of other components; or (ii) announced their plans to enact legislation in future years. We continue to evaluate the impacts of enacted and pending legislation related to Pillar 2 in our non-US tax jurisdictions.\nSEGMENT RESULTS\nThe summary that follows provides a discussion of the results of operations of our segments: Consumer Products, Wizards of the Coast & Digital Gaming and Entertainment. Corporate and Other, which does not meet the criteria to be an operating segment, provides management and administrative services to the Company's principal reporting segments and consists of unallocated corporate expenses and administrative costs and activities not considered when evaluating segment performance as well as certain assets benefiting more than one segment.\nThe following table presents net external revenues and operating profit (loss) for the Company's reportable segments for 2024 and 2023:\nWizards of the Coast and Digital Gaming\nOperating profit (loss):\nWizards of the Coast and Digital Gaming\nTotal Operating profit (loss)\nConsumer Products Segment\nThe following table presents the Consumer Products segment net revenues by major geographic region for 2024 and 2023:\nConsumer Products segment net revenues decreased 12% in 2024 compared to 2023 primarily driven by exited businesses, including out-licensing certain brands, shifts in product mix, reduced closeout sales as a result of last year's inventory clean up initiatives, and broader industry trends, . The net revenue decrease primarily reflects lower net revenues from NERF, STAR WARS and MARVEL products, POWER RANGERS, Hasbro Gaming, and TRANSFORMERS. The net revenue decrease from lower net revenues from the Company's products for STAR WARS and MARVEL benefited from a slate of entertainment releases in prior years without a more recent release entertainment release to support revenue in 2024. Additionally, net revenues from TRANSFORMERS products in 2023 were supported by the June 2023 theatrical release of\nTRANSFORMERS: Rise of the Beasts\ncompared to the late September 2024 theatrical release of\n. These revenue decreases were partially offset by revenue contributions from FURBY products following the Company's reintroduction of the brand and refreshed product line during the second quarter of 2023, BEYBLADE products following the Company's refreshed product line in 2024, and licensing revenue for MY LITTLE PONY trading cards.\nConsumer Products segment operating results increased $180.0 million to an operating income of $115.3 million in 2024, compared to an operating loss of $64.7 million in 2023. Operating profit margin increase to 4.5% of net revenues in 2024 from an operating loss margin of 2.2% of net revenues in 2023. The increase in operating profit in 2024 was driven by favorable licensing product mix, supply chain productivity, and cost savings realized from cost savings initiatives, partially offset by the lower sale volumes contributions.\nWizards of the Coast and Digital Gaming Segment\nThe following table presents Wizards of the Coast and Digital Gaming segment net revenues by category for 2024 and 2023:\nDigital and Licensed Gaming\nWizards of the Coast and Digital Gaming segment net revenues increased 4% in 2024 compared to 2023. Tabletop Gaming revenue decreased 3% primarily attributable to timing releases for MAGIC: THE GATHERING sets resulting in few releases in 2024 as compared to 2023. Digital and Licensed Gaming increased 22% due to strong demand for MONOPOLY GO!, partially offset by the decrease in net revenue recognized from the digital licensing of\n, the DUNGEONS & DRAGONS-based role-playing video game that was released during the third quarter 2023.\nWizards of the Coast and Digital Gaming segment operating profit increased $106.3 million to $632.0 million in 2024, compared to $525.7 million in 2023. Operating profit margin increased to 41.8% in 2024 from 36.1% in 2023. The increase in operating profit was primarily driven by increased net revenues, contributions from higher digital licensing revenue mix, lower royalty expense, and cost savings initiatives.\nEntertainment Segment\nThe following table presents Entertainment segment net revenues by category for 2024 and 2023:\nEntertainment segment net revenues decreased 88% in 2024 compared to 2023 driven by lower net revenues as a result of the sale of the eOne Film and TV business during the fourth quarter of 2023.\nThe Entertainment segment operating loss increased to an operating loss of $1.6 million, compared to an operating loss of $1,911.5 million in 2023. The increase in Entertainment segment operating results in 2024 was driven by non-cash impairment charges in 2023 comprised of a goodwill impairment charge of $1,191.2 million primarily associated Company's eOne Film and TV business; a loss on disposal of business of $539.0 million related to the sale of the eOne Film and TV business; and intangible asset impairment charges of $65.0 million and $51.0 million related to definite-lived intangible assets for the eOne Trademark and PJ MASKS, respectively.\nIn Corporate and Other, the operating losses were $55.7 million in 2024 compared to operating losses of $88.3 million in 2023. Improved operating results in 2024 reflects cost savings realized from cost savings initiatives and a benefit from the net impact of the three non-recurring prior period adjustments recorded during 2024. Refer to Note 1, Summary of Significant Accounting Policies, in our consolidated financial statements for further information on these non-recurring adjustments.\nCritical Accounting Policies and Significant Estimates\nThe Company prepares its consolidated financial statements in accordance with accounting principles generally accepted in the United States of America. As such, management is required to make certain estimates, judgments and assumptions that it believes are reasonable based on information available. These estimates and assumptions affect the reported amounts of assets and liabilities at the date of the consolidated financial statements and the reported amounts of revenues and expenses for the periods presented. The critical accounting policies which management believes are the most critical to aid in fully understanding and evaluating the Company’s reported financial results include the recoverability of goodwill and intangible assets and income taxes.\nRecoverability of Goodwill and Intangible Assets\nGoodwill and other intangible assets include the cost of the acquired business in excess of the fair value of the tangible net assets recorded in connection with each acquisition. We assess goodwill and other intangible assets with indefinite lives for impairment each year, or more frequently if events or changes in circumstances indicate an asset may be impaired. For goodwill and indefinite-lived intangible assets, our policy is to assess for impairment as of the beginning of each fiscal fourth quarter. The Company may perform a qualitative assessment and bypass the quantitative impairment testing process, if it is not more likely than not that the carrying value of a reporting unit exceeds its fair value. For other intangible assets with definite lives, we assess for impairment only if events occur that indicate that the carrying amount of an asset may not be recoverable.\nOur fiscal year 2024 assessment for impairment of goodwill, with respect to each of its reporting units, was performed using a qualitative approach to determine, as of the date of the assessment, whether it was more likely than not that the fair value of goodwill was less than its carrying value. In performing the qualitative assessment, we identified and considered the significance of relevant key factors, events, and circumstances that affect the fair value of goodwill. These factors include external factors such as macroeconomic, industry, and market conditions, as well as entity-specific factors, such as actual and planned financial performance. Based on our qualitative fiscal year 2024 annual impairment analysis for goodwill, we concluded that it is more likely than not that the fair value of goodwill exceeded its carrying value. See Note 7, Goodwill and Intangible Assets, in our consolidated financial statements for more information on the Company's goodwill.\nOur fiscal year 2024 assessment for impairment of indefinite-lived intangible assets was based on a relief from royalty method, including key assumptions such as the long-term growth rates of future revenues, the royalty rate for such revenues, and a discount rate. The fair value of each intangible asset is determined for comparison to the corresponding carrying value. If the carrying value of the asset exceeds its fair value, an impairment loss is recognized in an amount equal to the excess. Based on our fiscal year 2024 annual impairment analysis for indefinite-lived intangible assets, we concluded that the fair value of our indefinite-lived intangible asset exceeded their respective carrying values by substantial margins.\nIntangible assets, other than those with indefinite lives, are reviewed for indications of impairment whenever events or changes in circumstances indicate the carrying value may not be recoverable. During 2024, there were no triggering events which would indicate the Company's intangible assets were impaired.\nThe Company’s annual income tax rate is based on its income, statutory tax rates, changes in prior tax positions and tax planning opportunities available in the various jurisdictions in which it operates. Significant judgment and estimates are required to determine the Company’s annual tax rate and evaluate its tax positions. Despite the Company’s belief that its tax return positions are fully supportable, these positions are subject to challenge and estimated liabilities are established to account for events in which these positions are challenged, and the Company is not successful in defending those challenges. These estimated liabilities, as well as the related interest, are adjusted in light of changing facts and circumstances such as the progress of a tax audit.\nIn certain cases, tax law requires items to be included in the Company’s income tax returns at a different time than when these items are recognized in the consolidated financial statements or at a different amount than that which is recognized in the consolidated financial statements. Some of these differences are permanent, such as expenses that are not deductible on the Company’s tax returns, while other differences are temporary and will reverse over time, such as depreciation expense. The differences that will reverse over time are recorded as deferred tax assets and liabilities on the consolidated balance sheets. Deferred tax assets represent deductions that have been reflected in the consolidated financial statements but have not yet been reflected in the Company’s income tax returns. Valuation allowances are established against deferred tax assets to the extent that it is determined that the Company will have insufficient future taxable income, including capital gains, to fully realize the future deductions or capital losses. Deferred tax liabilities represent expenses recognized on the Company’s income tax return that have not yet been recognized in the Company’s consolidated financial statements or income recognized in the consolidated financial statements that has not yet been recognized in the Company’s income tax return.\nNEW ACCOUNTING PRONOUNCEMENTS\nFor a discussion of recent accounting pronouncements and a discussion of the Company's significant accounting policies see Note 1, Summary of Significant Accounting Policies, in our consolidated financial statements.\nLIQUIDITY AND CAPITAL RESOURCES\nThe Company has historically generated a significant amount of cash from operations. The Company has primarily funded its operations and liquidity needs through cash on hand and from cash flows from operations, and when needed, used commercial paper and borrowings under its available lines of credit. As of December 29, 2024, the Company had $695.0 million of Cash and cash equivalents and $3,401.8 million of Long-term debt.\nThe Company may issue debt or equity securities from time to time, to provide additional sources of liquidity when pursuing opportunities to enhance its long-term competitive position, while maintaining a strong balance sheet. However, unexpected events or circumstances such as material operating losses or increased capital or other expenditures, or the inability to otherwise access the commercial paper market, may reduce or eliminate the availability of external financial resources. In addition, significant disruptions to credit markets may also reduce or eliminate the availability of external financial resources. Although the Company believes the risk of nonperformance by the counterparties to its financial facilities is not significant, in times of severe economic downturn in the c",
  "item2_clean": null
}