{
  "source_file": "hban-20250930.htm",
  "form_type": "10-Q",
  "item1_clean": null,
  "item7_clean": null,
  "item2_clean": "Item 2: Management’s Discussion and Analysis of Financial Condition and Results of Operations\nINTRODUCTION\nWe are a multi-state diversified regional bank holding company organized under Maryland law in 1966 and headquartered in Columbus, Ohio. Through the Bank, we are committed to making people’s lives better, helping businesses thrive, and strengthening the communities we serve, and we have been servicing the financial needs of our customers since 1866. Through our subsidiaries, we provide full-service commercial and consumer deposit, lending, and other banking and financial services. These include, but are not limited to, payments, mortgage banking, direct and indirect consumer financing, investment banking, capital markets, advisory, equipment financing, distribution finance, investment management, trust, brokerage, insurance, and other financial products and services. As of September 30, 2025, our 972 full-service branches and private client group offices are located in Ohio, Colorado, Florida, Illinois, Indiana, Kentucky, Michigan, Minnesota, North Carolina, Pennsylvania, South Carolina, West Virginia, and Wisconsin. We also maintain a local banking presence in Texas and conduct select financial services and other activities in other states.\nIn this MD&A we refer to FTE net interest income and FTE total revenue. These financial measures are not required by, or calculated in accordance with GAAP and may not be calculated the same as similarly titled measures used by other companies. These financial measures should thus be considered as supplemental in nature and not considered in isolation or as a substitute for the related financial information prepared in accordance with GAAP. For a further description of these non-GAAP financial measures, see the \"Non-GAAP Financial Measures\" section below.\nHuntington Bancshares Incorporated\nEXECUTIVE OVERVIEW\nEffective October 20, 2025, Huntington completed its previously announced acquisition of Veritex Holdings, Inc. (“Veritex”), a bank holding company headquartered in Dallas, Texas, whereby Veritex merged with and into Huntington, with Huntington as the surviving entity. Upon completion of the merger, Huntington issued 107 million shares of its common stock to Veritex shareholders of record as of the merger date, in addition to 1 million shares issued upon the conversion of certain Veritex equity awards, resulting in total consideration from the transaction of approximately $1.7 billion. As of September 30, 2025, Veritex had $12.8 billion in assets, including $9.6 billion in loans, and $10.8 billion in deposits.\nPending Acquisition of Cadence\nOn October 27, 2025, Huntington announced entry into a definitive merger agreement with The Huntington National Bank, Huntington’s wholly owned subsidiary bank, and Cadence Bank (“Cadence”), a regional bank headquartered in Houston, Texas and Tupelo, Mississippi, whereby Cadence will merge with and into The Huntington National Bank, with The Huntington National Bank as the surviving bank. Under the terms of the agreement, Huntington will issue 2.475 shares for each outstanding share of Cadence in a 100% stock transaction. Based on Huntington’s closing price of $16.07 as of October 24, 2025, the consideration is valued at approximately $7.4 billion. Each outstanding share of 5.50% Series A Non-Cumulative Perpetual Preferred Stock of Cadence will be converted into the right to receive 1/1000 of a share of a newly created series of preferred stock of Huntington. As of September 30, 2025, Cadence had $53 billion in assets, including $37 billion in loans, and $44 billion in deposits. The merger is expected to close in the first quarter of 2026, subject to satisfaction of closing conditions, including receipt of customary required regulatory approvals and the approval of the definitive merger agreement by the Huntington and Cadence shareholders.\nDuring the fourth quarter of 2024, we updated the presentation of our reported deposit categories to align more closely with how we strategically manage our business. As a result, we now report our deposit composition in the following categories: (1) demand deposits - noninterest bearing, (2) demand deposits - interest bearing, (3) money market, (4) savings, and (5) time deposits. Prior period results have been adjusted to conform to the current presentation.\nFinancial Performance Review\nSelected Financial Data\nTable 1 - Selected Quarterly and Year-to-Date Income Statement Data\n(amounts in millions, except per share data)\nProvision for credit losses\nNet interest income after provision for credit losses\nIncome before income taxes\nProvision for income taxes\nIncome after income taxes\nIncome attributable to non-controlling interest\nNet income attributable to Huntington\nDividends on preferred shares\nNet income applicable to common shares\nAverage common shares—basic\nAverage common shares—diluted\nNet income per common share—basic\nNet income per common share—diluted\nCash dividends declared per common share\nReturn on average total assets\nReturn on average common shareholders’ equity\nReturn on average tangible common shareholders’ equity (1)\nNet interest margin (2)\nEfficiency ratio (3)\nRevenue and Net Interest Income—FTE (non-GAAP)\nNet interest income, FTE (non-GAAP) (2)\nTotal revenue, FTE (non-GAAP) (2)\nNet income applicable to common shares excluding expense for amortization of intangibles for the period divided by average tangible common shareholders’ equity. Average tangible common shareholders’ equity equals average total common shareholders’ equity less average intangible assets and goodwill. Expense for amortization of intangibles and average intangible assets are net of deferred taxes and calculated assuming a 21% tax rate.\nOn an FTE basis assuming a 21% tax rate.\nNoninterest expense less amortization of intangibles divided by the sum of FTE net interest income and noninterest income excluding securities gains.\nHuntington Bancshares Incorporated\nSummary of 2025 Third Quarter Results Compared to 2024 Third Quarter\nFor the third quarter of 2025, we reported net income of $629 million, or $0.41 per diluted common share, compared with $517 million, or $0.33 per diluted common share, in the year-ago quarter.\nNet interest income was $1.5 billion for the third quarter of 2025, an increase of $155 million, or 11%, from the year-ago quarter. FTE net interest income, a non-GAAP financial measure, increased $159 million, or 12%, from the year-ago quarter. The increase in FTE net interest income primarily reflected a 15 basis point increase in the FTE NIM to 3.13% and a $10.8 billion, or 6%, increase in average earning assets, partially offset by a $10.1 billion, or 7%, increase in average interest-bearing liabilities. The NIM increase was primarily due to a decrease in cost of funding, partially offset by a decrease in yields on earning assets and net hedging activity.\nThe provision for credit losses increased $16 million, or 15%, from the year-ago quarter to $122 million in the third quarter of 2025. The ACL increased $126 million from the year-ago quarter to $2.6 billion, or 1.86% of total loans and leases, in the third quarter of 2025, compared to $2.4 billion, or 1.93% of total loans and leases, for the year-ago quarter.\nNoninterest income was $628 million, an increase of $105 million, or 20%, from the year-ago quarter, driven by a $24 million gain on the sale of a portion of our trust and custody business, included within other noninterest income, and increases in payments and cash management revenue, capital markets and advisory fees, customer deposit and loan fees, and wealth and asset management revenue. Noninterest expense was $1.2 billion, an increase of $116 million, or 10%, from the year-ago quarter, primarily due to higher personnel costs and outside data processing and other services, in addition to $14 million of Veritex acquisition-related expenses recognized during the current year quarter.\nConsolidated Balance Sheet and Capital Ratios as of September 30, 2025 Compared to Prior Year End\nTotal assets at September 30, 2025 were $210.2 billion, an increase of $6.0 billion, or 3%, compared to December 31, 2024. The increase in total assets was primarily driven by increases in loans and leases of $7.9 billion, or 6%, partially offset by a decrease in investment securities of $1.9 billion, or 4%. Total liabilities at September 30, 2025 were $187.9 billion, an increase of $3.5 billion, or 2%, compared to December 31, 2024. The increase in total liabilities was primarily driven by increases in total deposits of $2.8 billion, or 2%, and long-term debt of $941 million, or 6%.\ncommon equity to tangible assets ratio increased to 6.8% at September 30, 2025, compared to 6.1% at December 31, 2024, primarily due to an increase in tangible common equity from year-to-date earnings, net of dividends, and an improvement in AOCI, partially offset by an increase in tangible assets. The CET1 risk-based capital ratio was 10.6% at September 30, 2025, compared to 10.5% at December 31, 2024, with an increase in regulatory capital from year-to-date earnings, net of dividends, partially offset by an increase in risk-weighted assets.\nOur general business objectives are to:\nDeliver our Culture, Purpose, and Vision through a Differentiated Operating Model;\nBuild on our vision to be the leading People-First, Customer-Centered bank in the country;\nDeliver top quartile performance through sustainable long-term profitable growth;\nDifferentiate our culture, brand, and customer experience through expanded product offerings to drive digital acquisition, deepening, and retention, and leveraging partnerships and technology to grow customers and market share;\nLeverage our regional banking model and national franchise to drive scale, growth, and expansion;\nAnticipate evolving customer needs to drive profitable growth;\nMaintain positive operating leverage and execute disciplined capital management; and\nProvide stability and resili"
}