{
  "source_file": "hban-20241231.htm",
  "form_type": "10-K",
  "item1_clean": "General Business Description\nWe are a multi-state diversified regional bank holding company organized under Maryland law in 1966 and headquartered in Columbus, Ohio. Through the Bank, we are committed to making people’s lives better, helping businesses thrive, and strengthening the communities we serve, and we have been servicing the financial needs of our customers since 1866. Through our subsidiaries, we provide full-service commercial and consumer deposit, lending, and other banking services. These include, but are not limited to, payments, mortgage banking, direct and indirect consumer financing, investment banking, capital markets, advisory, equipment financing, distribution finance, investment management, trust, brokerage, insurance, and other financial products and services. As of December 31, 2024, our 978 full-service branches and private client group offices are located in Ohio, Colorado, Florida, Illinois, Indiana, Kentucky, Michigan, Minnesota, North Carolina, Pennsylvania, West Virginia, and Wisconsin. We also maintain a local banking presence in South Carolina and Texas, along with conducting select financial services and other activities in other states.\nOur business segments are based on our internally-aligned segment leadership structure, which is how we monitor results and assess performance. For each business segment, we expect the combination of our business model, investment in products and capabilities, and exceptional service to provide a competitive advantage that supports revenue and earnings growth. Our business model emphasizes the delivery of a complete set of banking products and services offered by larger banks, but distinguished by local delivery and customer service.\nA key strategic emphasis has been for our business segments to operate in cooperation to provide products and services to our customers and to build stronger and more profitable relationships using our OCR sales and service process, which aligns to our vision to be the leading people-first, customer-centered bank in the country. The objectives of OCR are to:\nUse a consultative and advisory sales approach to provide solutions that are specific to each customer;\nLeverage each business segment in terms of its products and expertise to benefit customers; and\nDevelop prospects who may want to have multiple products and services as part of their relationship with us.\nFollowing is a description of our two business segments, Consumer & Regional Banking and Commercial Banking, along with the Treasury / Other function:\nConsumer & Regional Banking:\nThe Consumer & Regional Banking segment provides a wide array of financial products and services to consumer and business customers including, but not limited to, deposits, lending, payments, mortgage banking, dealer financing, investment management, trust, brokerage, insurance, and other financial products and services. We serve our customers through our network of regional banking and national specialty finance channels, including branches and ATMs, online and mobile banking, our customer call centers, and strategic national partnerships.\nWe have a “Fair Play” banking philosophy: providing differentiated products and services, built on a strong foundation of customer friendly products and advocacy. Our brand resonates with consumers and businesses, helping us acquire new customers and deepen relationships with current customers. Our Fair Play banking suite of products includes 24-Hour Grace®, Asterisk-Free Checking®, Money Scout®, $50 Safety Zone®, Standby Cash®, Early Pay, Instant Access, Savings Goal Getter® and Huntington Heads Up®.\nHuntington Bancshares Incorporated\nConsumer & Regional Banking offers a comprehensive set of digitally powered consumer and business financial solutions to Consumer Finance, Regional Banking, Branch Banking, and Wealth Management customers.\nConsumer Finance provides direct and indirect consumer loans, as well as dealer finance loans and deposits. Direct consumer loan products, including mortgage and home equity, are originated through branch, online, and third-party channels. Indirect consumer loans are originated through deep relationships with dealerships to finance consumer purchases of automobiles, recreational vehicles, marine craft, and powersports. We also provide dealer finance loans (including floorplan loans), deposits, and other financial products to these dealerships and their owners.\nRegional Banking, along with our business and specialty banking offerings, is a dynamic part of our business. Regional Banking is defined as serving small to mid-sized businesses. Beyond conventional lending solutions, Huntington offers access to capital markets, practice finance, and SBA lending capabilities. In addition, our payments business provides credit and debit cards and treasury management services to our customers. Huntington continues to develop products and services that are designed specifically to meet the needs of business customers and looks for ways to help companies find solutions to their financing needs.\nBranch Banking provides a full range of financial products and services to consumer and business customers through our extensive branch and ATM network. The branch network offers full-service branches that are located in Ohio, Colorado, Illinois, Indiana, Kentucky, Michigan, Minnesota, North Carolina, Pennsylvania, West Virginia, and Wisconsin.\nWealth Management has a comprehensive product offering, including private banking, wealth management, and legacy planning through investment and portfolio management, fiduciary administration and trust services, institutional custody services, and full-service retail brokerage investments.\nIn addition, we offer our customers a wide variety of financial solutions, ranging from payment instruments, such as consumer and small business credit and debit cards, payables solutions, including ACH processing and account reconciliation, and receivables solutions, including remote deposit capture, billing services, and lockbox services. We offer merchant services to our business and commercial customers. We also offer our customers with money movement services through payment platforms such as Real-Time Payments (RTP®) and Zelle®.\nThe Commercial Banking segment provides expertise through bankers, capabilities, and digital channels, which includes a comprehensive set of product offerings. Our target clients span from mid-market to large corporates across a national footprint. The Commercial Banking segment leverages internal partnerships for wealth management, trust, insurance, payments, and treasury management capabilities. In particular, our payments capabilities continue to expand as we develop unique solutions for our diverse client segments, including Huntington ChoicePay. The Commercial Banking segment includes customers in Middle Market Banking, Corporate, Specialty, and Government Banking, Asset Finance, Commercial Real Estate Banking, and Capital Markets.\nMiddle Market Banking serves the banking needs of mid-sized clients, leveraging our local presence to serve our clients, and extending our full suite of banking products including lending, liquidity, treasury management and other payment services, and capital markets.\nCorporate, Specialty, and Government Banking serves medium to large enterprises. We focus on specific industry verticals such as government and non-profits, healthcare, technology and telecommunications, franchises, financial sponsors, Native American financial services, mortgage financial services, fund finance, and global services. Our expertise in these markets allows us to uniquely serve our clients’ sophisticated banking, capital markets, and payments requirements.\nAsset Finance serves our clients’ capital expenditure and working capital needs through equipment financing, asset-based lending, distribution finance, structured lending, and municipal financing solutions. Our relationship with large manufacturers is bolstered by a strong commitment to their dealers and financing needs.\nCommercial Real Estate Banking provides banking solutions to commercial real estate developers and institutional sponsors across the nation. Within this group, Huntington Community Development improves the quality of life for our communities and the residents of low-to-moderate income neighborhoods by developing and delivering innovative products and services to support affordable housing and neighborhood stabilization, including tax credit investments.\nCapital Markets delivers corporate risk management, institutional sales and trading, debt and equity issuance, and additional advisory services.\nThe Treasury / Other function includes all other items not included within our two business segments, including technology and operations, and other unallocated assets, liabilities, revenue, and expense.\nThe financial results for each of our business segments are included in Note 24 - “\n” of Notes to Consolidated Financial Statements and are discussed in the “\nBusiness Segment Discussion\nWe compete with other banks and financial services companies such as savings and loans, credit unions, and finance and trust companies, as well as mortgage banking companies, equipment and automobile financing companies (including captive automobile finance companies), insurance companies, mutual funds, investment advisors, brokerage firms, and non-bank lenders both within and outside of our primary market areas. Financial Technology Companies, or FinTechs, are also providing nontraditional, but increasingly strong, competition for our borrowers, depositors, and other customers.\nWe compete for loans primarily on the basis of value and service by building customer relationships through addressing our customers’ entire suite of banking needs, demonstrating expertise, and providing convenience. We also consider the competitive pricing levels in each of our markets.\nWe compete for deposits similarly on the basis of value and service and by providing convenience through a banking network of branches and ATMs within our markets and our website at www.huntington.com. We employ customer friendly practices, such as a $50 Safety Zone®, which prevents customers from being charged an overdraft fee if they overdraw by $50 or less, 24-Hour Grace® account feature for both commercial and consumer accounts, which gives customers an additional business day to cover overdrafts to their account without being charged overdraft fees, Early Pay, which allows customers with direct deposit availability to their paycheck up to two days early, Instant Access, which allows up to $500 of a check deposit available to customers immediately, and Asterisk-Free Checking where there is no cost to open and no monthly maintenance fees. In addition, customers can qualify for Standby Cash®\n\nbased primarily on their checking deposit history, not their credit score, which provides a $100 to $500 short-term line of credit free with automatic payments, or a 1% monthly interest charge without automatic payments. Huntington also has created a feature called Money Scout®, which is a tool that analyzes a customer’s spending habits and moves money that is not being used into that customer’s savings account and have introduced tools including The Hub and Huntington Heads Up® to provide customers greater visibility and control over their financial future. These measures fall under our approach of “Fair Play Banking.”\nHuntington Bancshares Incorporated\nThe table below shows our competitive ranking and market share based on deposits of FDIC-insured institutions as of June 30, 2024, in the top 10 MSAs in which we compete.\nMSA\nMinneapolis-St. Paul, MN\nSource: FDIC.gov, based on June 30, 2024 survey.\nMany of our nonfinancial institution competitors have fewer regulatory constraints, broader geographic service areas, access to a larger pool of capital to deploy, and, in some cases, lower cost structures. In addition, competition for quality c",
  "item7_clean": "Year Ended December 31,\nYear Ended December 31,\n(dollar amounts in millions unless otherwise noted)\nNoninterest expense:\nDirect personnel costs\nOther noninterest expense, including corporate allocations\nTotal noninterest expense\n(Loss) income before income taxes\nBenefit for income taxes\nIncome attributable to non-controlling interest\nNet (loss) income attributable to Huntington\nNumber of employees (average full-time equivalent)\nTotal average assets\nTreasury / Other reported a net loss of $725 million in 2024, an increase in net loss of $182 million, compared to the year-ago period, driven by a decrease in net interest income, partially offset by a decrease in noninterest expense. Net interest income decreased $408 million primarily due to a higher cost of funds and the impact from derivatives. Noninterest expense decreased $205 million primarily due to an increase in corporate allocations.\nADDITIONAL DISCLOSURES\nForward-Looking Statements\nThis report, including MD&A, contains certain forward-looking statements, including, but not limited to, certain plans, expectations, goals, projections, and statements, which are not historical facts and are subject to numerous assumptions, risks, and uncertainties. Statements that do not describe historical or current facts, including statements about beliefs and expectations, are forward-looking statements. Forward-looking statements may be identified by words such as expect, anticipate, believe, intend, estimate, plan, target, goal, or similar expressions, or future or conditional verbs such as will, may, might, should, would, could, or similar variations. The forward-looking statements are intended to be subject to the safe harbor provided by Section 27A of the Securities Act of 1933, Section 21E of the Securities Exchange Act of 1934, and the Private Securities Litigation Reform Act of 1995.\nHuntington Bancshares Incorporated\nWhile there is no assurance that any list of risks and uncertainties or risk factors is complete, below are certain factors which could cause actual results to differ materially from those contained or implied in the forward-looking statements: changes in general economic, political, or industry conditions; deterioration in business and economic conditions, including persistent inflation, supply chain issues or labor shortages, instability in global economic conditions and geopolitical matters, as well as volatility in financial markets; changes in U.S. trade policies, including the imposition of tariffs and retaliatory tariffs\nthe impact of pandemics and other catastrophic events or disasters on the global economy and financial market conditions and our business, results of operations, and financial condition; the impacts related to or resulting from bank failures and other volatility, including potential increased regulatory requirements and costs, such as FDIC special assessments, long-term debt requirements and heightened capital requirements, and potential impacts to macroeconomic conditions, which could affect the ability of depository institutions, including us, to attract and retain depositors and to borrow or raise capital; unexpected outflows of uninsured deposits which may require us to sell investment securities at a loss; changing interest rates which could negatively impact the value of our portfolio of investment securities; the loss of value of our investment portfolio which could negatively impact market perceptions of us and could lead to deposit withdrawals; the effects of social media on market perceptions of us and banks generally; cybersecurity risks; uncertainty in U.S. fiscal and monetary policy, including the interest rate policies of the Federal Reserve; volatility and disruptions in global capital and credit markets; movements in interest rates; competitive pressures on product pricing and services; success, impact, and timing of our business strategies, including market acceptance of any new products or services including those implementing our “Fair Play” banking philosophy; changes in policies and standards for regulatory review of bank mergers; the nature, extent, timing, and results of governmental actions, examinations, reviews, reforms, regulations, and interpretations, including those related to the Dodd-Frank Wall Street Reform and Consumer Protection Act and the Basel III regulatory capital reforms, as well as those involving the OCC, Federal Reserve, FDIC, and CFPB; and other factors that may affect the future results of Huntington.\nAll forward-looking statements speak only as of the date they are made and are based on information available at that time. Huntington does not assume any obligation to update forward-looking statements to reflect circumstances or events that occur after the date the forward-looking statements were made or to reflect the occurrence of unanticipated events except as required by federal securities laws. As forward-looking statements involve significant risks and uncertainties, caution should be exercised against placing undue reliance on such statements.\nNon-GAAP Financial Measures\nThis document contains GAAP financial measures and non-GAAP financial measures where management believes it to be helpful in understanding our results of operations or financial position. Where non-GAAP financial measures are used, the comparable GAAP financial measure, as well as the reconciliation to the comparable GAAP financial measure, can be found herein.\nFully-Taxable Equivalent Basis\nInterest income, yields, and ratios on an FTE basis are considered non-GAAP financial measures. Management believes net interest income on an FTE basis provides an insightful picture of the interest margin for comparison purposes. The FTE basis also allows management to assess the comparability of revenue arising from both taxable and tax-exempt sources. The FTE basis assumes a federal statutory tax rate of 21%. We encourage readers to consider the\nConsolidated Financial Statements\nNon-Regulatory Capital Ratios\nIn addition to capital ratios defined by banking regulators, the Company considers various other measures when evaluating capital utilization and adequacy, including tangible common equity to tangible assets.\nNon-regulatory capital ratios are viewed by management as useful additional methods of reflecting the level of capital available to withstand unexpected market conditions. Additionally, presentation of these ratios allows readers to compare our capitalization to other financial services companies. These ratios differ from capital ratios defined by banking regulators principally in that the numerator excludes goodwill and other intangible assets, the nature and extent of which varies among different financial services companies. These ratios are not defined in GAAP or federal banking regulations. As a result, these non-regulatory capital ratios disclosed by the Company are considered non-GAAP financial measures.\nMore information on risk is discussed in the Risk Factors section included in Item 1A: “\n” of this report. Additional information regarding risk factors can also be found in the Risk Management and Capital discussion of this report, as well as the “\n” section included in Item 1: Business of this report.\nCritical Accounting Policies and Use of Significant Estimates\nOur Consolidated Financial Statements are prepared in accordance with GAAP. The preparation of financial statements in conformity with GAAP requires us to establish accounting policies and make estimates that affect amounts reported in our Consolidated Financial Statements. Note 1 - “\nSignificant Accounting Policies\n” of the Notes to Consolidated Financial Statements, which is incorporated by reference into this MD&A, describes the significant accounting policies we used in our Consolidated Financial Statements.\nAn accounting estimate requires assumptions and judgments about uncertain matters that could have a material effect on the Consolidated Financial Statements. Estimates are made under facts and circumstances at a point in time, and changes in those facts and circumstances could produce results substantially different from those estimates. Our most significant accounting policies and estimates and their related application are discussed below.\nAllowance for Credit Losses\nOur ACL at December 31, 2024 represents our current estimate of the lifetime credit losses expected from our loan and lease portfolio and our unfunded lending commitments. Management estimates the ACL by projecting probability of default, loss given default, and exposure at default, conditional on economic parameters, for the remaining contractual term. Internal factors that impact the quarterly allowance estimate include the level of outstanding balances, the portfolio performance and assigned risk ratings. We utilize statistically-based models that employ assumptions about current and future economic conditions throughout the contractual life of our loan portfolio. As part of our model risk oversight, we perform ongoing monitoring of model performance to assess modeling approaches and identify potential model enhancements, which may result in updates to our statistically based models from time-to-time.\nOne of the most significant judgments influencing the ACL estimate is the macroeconomic forecasts. Key external economic parameters that directly impact our loss modeling framework include forecasted unemployment rates and GDP. Changes in the economic forecasts could significantly affect the estimated credit losses, which could potentially lead to materially different allowance levels from one reporting period to the next.\nGiven the dynamic relationship between macroeconomic variables within our modeling framework, it is difficult to estimate the impact of a change in any one individual variable on the allowance. As a result, management uses a probability-weighted approach that incorporates a baseline, an adverse, and a more favorable economic scenario when formulating the quantitative estimate.\nHuntington Bancshares Incorporated\nTo illustrate a hypothetical sensitivity analysis, management calculated a quantitative allowance using a 100% weighting applied to an adverse scenario. This scenario contemplates elevated interest rates weakening credit-sensitive consumer spending and confidence, growing concerns about the impact of potential tariffs reducing consumer and business sentiment, and deepening fiscal disputes in Congress causing further sentiment decline. Concerns about the banking industry also impact consumer confidence, causing banks to tighten lending standards. Increased geopolitical tensions between China and Taiwan briefly impact the supply chain for semiconductors and the threat of a wider conflict causes consumer confidence to fall. Additionally, the Russian invasion of Ukraine lasts longer than in the baseline scenario and concerns increase around the current conflict in the Middle East leading to a broader war in the region. The combination of still elevated interest rates, political tensions, and tightening lending standards cause the stock market to fall. The economy falls into a recession in the first quarter of 2025. In response to the recession, the Federal Reserve cuts the federal funds rate more aggressively with rates significantly below the baseline forecast starting in the first quarter of 2025. Under this scenario, as an example, the unemployment rate increases from baseline levels and remains elevated for a prolonged period. The rate in this adverse scenario is projected at 8.2% at the end of 2025, approximately 4.1% higher than the baseline scenario projection.\nTo demonstrate the sensitivity to key economic parameters used in the calculation of our ACL at December 31, 2024, management calculated the difference between our quantitative ACL and this 100% adverse scenario. Excluding consideration of qualitative adjustments, this sensitivity analysis would result in a hypothetical increase in our ACL of approximately $0.8 billion at December 31, 2024.\nThe resulting difference is not intended to represent an expected increase in allowance levels for a number of reasons including the following:\nManagement uses a weighted approach applied to multiple economic scenarios for its allowance estimation process;\nThe highly uncertain economic environment;\nThe difficulty in predicting the inter-relationships between the economic parameters used in the various economic scenarios; and\nThe sensitivity estimate does not account for any general reserve components and associated risk profile adjustments incorporated by management as part of its overall allowance framework.\nWe regularly review our ACL for appropriateness by performing on-going evaluations of the loan and lease portfolio. In doing so, we consider factors such as the differing economic risks associated with each loan category, the financial condition of specific borrowers, the level of delinquent loans, the value of any collateral and, where applicable, the existence of any guarantees or other documented support. We also evaluate the impact of changes in key economic parameters and overall economic conditions on the ability of borrowers to meet their financial obligations when quantifying our exposure to credit losses and assessing the appropriateness of our ACL at each reporting date. Large loan exposures may be addressed through a portfolio heterogeneity reserve. We also consider how significant changes in underwriting policies and procedures could impact the ACL, including consideration of material changes in portfolio growth rates or credit terms. Any changes to management and staffing that could impact lending, collections, or other relevant departments that could increase risk within the allowance process are also contemplated. Observed changes in the quality of the credit review process identified by the second and third line reviews are also given appropriate consideration.\nThere is no certainty that our ACL will be appropriate over time to cover losses in our portfolio as economic and market conditions may ultimately differ from our reasonable and supportable forecast. Additionally, events adversely affecting specific customers, industries, or our markets such as geopolitical instability, or risks of elevated interest rates for longer including a near-term recession, could severely impact our current expectations. If the credit quality of our customer base materially deteriorates or the risk profile of a market, industry, or group of customers changes materially, our net income and capital could be materially adversely affected which, in turn, could have a material adverse effect on our financial condition and results of operations. The extent to which the geopolitical instability and risks of elevated interest rates for longer will continue to negatively impact our businesses, financial condition, liquidity, and results will depend on future developments, which are highly uncertain and cannot be forecasted with precision at this time.\nThe acquisition method of accounting requires that assets and liabilities acquired in a business combination are recorded at fair value as of the acquisition date. The valuation of assets and liabilities often involves estimates based on third party valuations or internal valuations based on discounted cash flow analyses or other valuation techniques, all of which are inherently subjective. This typically results in goodwill, the amount by which the cost of net assets acquired in a business combination exceeds their fair value, which is subject to impairment testing at least annually.\nManagement reviews the goodwill of each reporting unit for impairment on an annual basis as of October 1 or more often if events or circumstances indicate that it is more-likely-than-not that the fair value of a reporting unit is below its carrying value.\nBased on our annual impairment analysis of goodwill as of October 1, 2024, it was determined that the fa",
  "item2_clean": null
}