{
  "source_file": "hca-20250930.htm",
  "form_type": "10-Q",
  "item1_clean": null,
  "item7_clean": null,
  "item2_clean": "Consolidated and same facility revenue per equivalent admission increased 6.1% and 6.6%, respectively, in the third quarter of 2025, compared to the third quarter of 2024. Consolidated and same facility equivalent admissions increased 3.2% and 2.4%, respectively, in the third quarter of 2025, compared to the third quarter of 2024. Consolidated and same facility outpatient surgeries increased 1.6% and 1.1%, respectively, in the third quarter of 2025, compared to the third quarter of 2024. Consolidated and same facility inpatient surgeries increased 2.0% and 1.4%, respectively, in the third quarter of 2025, compared to the third quarter of 2024. Consolidated and same facility emergency department visits increased 1.2% and 1.3%, respectively, in the third quarter of 2025, compared to the third quarter of 2024.\nTo quantify the total impact of the trends related to uninsured patient accounts, we believe it is beneficial to view total uncompensated care, which is comprised of charity care, uninsured discounts and implicit price concessions. A summary of the estimated cost of total uncompensated care for the quarters and nine months ended September 30, 2025 and 2024 follows (dollars in millions):\n\nRevenues increased to $19.161 billion in the third quarter of 2025 from $17.487 billion in the third quarter of 2024. Net income attributable to HCA Healthcare, Inc. totaled $1.643 billion, or $6.96 per diluted share, for the quarter ended September 30, 2025, compared to $1.270 billion, or $4.88 per diluted share, for the quarter ended September 30, 2024. Third quarter results for 2024 included losses on sales of facilities of $4 million, or $0.02 per diluted share, and additional expenses and loss of revenues estimated at approximately $50 million, or $0.15 per diluted share, associated with the impact of Hurricane Helene on our Florida, Georgia and North Carolina facilities. The additional expenses associated with the impact of Hurricane Helene do not reflect any insurance recoveries. All “per diluted share” disclosures are based upon amounts net of the applicable income taxes. Shares used for diluted earnings per share were 236.181 million shares for the quarter ended September 30, 2025 and 259.917 million shares for the quarter ended September 30, 2024. During 2024 and the first nine months of 2025, we repurchased 17.798 million shares and 21.307 million shares, respectively, of our common stock.\n\nRevenues increased 9.6% from $17.487 billion in the third quarter of 2024 to $19.161 billion in the third quarter of 2025. Our revenues are based upon the estimated amounts we expect to be entitled to receive from patients and third-party payers. Estimates of contractual adjustments under managed care and commercial insurance plans are based upon the payment terms specified in the related contractual agreements. Revenues related to uninsured patients and uninsured copayment and deductible amounts for patients who have health care coverage may have discounts applied (uninsured and other discounts). We also record estimated implicit price concessions (based primarily on historical collection experience) related to uninsured accounts to record self-pay revenues at the estimated amounts we expect to collect. Patients treated at our hospitals for non-elective care, who have income at or below 400% of the federal poverty level, are eligible for charity care. Because we do not pursue collection of amounts determined to qualify as charity care, they are not reported in revenues. Our revenues by primary third-party payer classification and other (including uninsured patients) for the quarters and nine months ended September 30, 2025 and 2024 are summarized in the following table (dollars in millions):\n\nAt September 30, 2025, we had 102 hospitals in the states of Texas and Florida. During the quarter ended September 30, 2025, 59% of our admissions and 51% of our revenues were generated by these hospitals. Uninsured admissions in Texas and Florida represented 73% of our uninsured admissions during the quarter ended September 30, 2025.\nWe receive a significant portion of our revenues from government health programs, principally Medicare and Medicaid, which are highly regulated and subject to frequent and substantial changes. Some states make additional payments to providers through the Medicaid program that are separate from base payments. These payments may be in the form of payments, such as upper payment limit payments, that are intended to address the difference between Medicaid fee-for-service payments and Medicare reimbursement rates, or payments under other programs that vary by state under Section 1115 waivers. In addition, many states have implemented\nSDP\narrangements to direct certain Medicaid managed care plan expenditures. These payments are generally authorized by the Centers for Medicare & Medicaid Services (“CMS”) and subject to periodic extension or reapproval. Most states in which we receive payment have adopted statewide or local provider taxes to fund the non-federal share of Medicaid programs. These additional payments supplement Medicaid base rates that, when taken together, are insufficient to cover the cost of care provided to Medicaid beneficiaries combined with the state or local provider taxes levied.\nWe are aware these payment programs are currently being reviewed by certain government agencies, and some states requested modifications of their existing supplemental payment programs during the annual renewal process with CMS. It is possible these reviews and requests will result in the restructuring of such supplemental payment programs and could result in the payment programs being reduced or eliminated. Further, the OBBBA makes significant changes to Medicaid financing mechanisms, including limitations on provider taxes and SDP arrangements. However, the OBBBA grandfathers certain SDP arrangements, including those for which an application form was submitted to CMS prior to July 4, 2025, for the rating period occurring within 180 days of July 4, 2025, and those that received approval or made a good faith effort to receive approval from CMS prior to May 1, 2025. Certain states in which we operate have submitted application forms to CMS for approval where the grandfathered payments we receive could be impacted, and in some instances, increased. Beginning with the rating period on or after January 1, 2028, grandfathered payments will be reduced by 10 percentage points annually until they reach the allowable payment limits. Some states have received approval of grandfathered applications, but we are unable to predict the timing or extent of any additional approvals by CMS and the resulting recognition of the related revenues. Because these payment programs and arrangements continue to evolve, we are unable to estimate the financial impact that program structure modifications, if any, may have on our results of operations.\n\nRevenues increased to $19.161 billion in the third quarter of 2025 from $17.487 billion in the third quarter of 2024. Net income attributable to HCA Healthcare, Inc. totaled $1.643 billion, or $6.96 per diluted share, for the quarter ended September 30, 2025, compared to $1.270 billion, or $4.88 per diluted share, for the quarter ended September 30, 2024. Third quarter results for 2024 included losses on sales of facilities of $4 million, or $0.02 per diluted share, and additional expenses and loss of revenues estimated at approximately $50 million, or $0.15 per diluted share, associated with the impact of Hurricane Helene on our Florida, Georgia and North Carolina facilities. The additional expenses associated with the impact of Hurricane Helene do not reflect any insurance recoveries. All “per diluted share” disclosures are based upon amounts net of the applicable income taxes. Shares used for diluted earnings per share were 236.181 million shares for the quarter ended September 30, 2025 and 259.917 million shares for the quarter ended September 30, 2024. During 2024 and the first nine months of 2025, we repurchased 17.798 million shares and 21.307 million shares, respectively, of our common stock.\nRevenues increased 9.6% on a consolidated basis and 9.2% on a same facility basis for the quarter ended September 30, 2025, compared to the quarter ended September 30, 2024. The increase in consolidated revenues can be primarily attributed to the combined impact of a 6.1% increase in revenue per equivalent admission and a 3.2% increase in equivalent admissions. The same facility revenues increase primarily resulted from the combined impact of a 6.6% increase in same facility revenue per equivalent admission and a 2.4% increase in same facility equivalent admissions. The increases in consolidated and same facility revenue per equivalent admission were favorably impacted by an increase in state supplemental Medicaid revenue during the quarter related to recently approved programs.\nSalaries and benefits, as a percentage of revenues, were 43.6% in the third quarter of 2025 and 45.0% in the third quarter of 2024. The decrease in salaries and benefits, as a percentage of revenues, is primarily related to continued improvements in salaries and contract labor growth resulting from our labor management initiatives combined with the increase in revenues for the quarter ended September 30, 2025. Salaries and benefits per equivalent admission increased 3.0% in the third quarter of 2025, compared to the third quarter of 2024. Same facility salaries and benefits per full time equivalent increased 4.0% for the third quarter of 2025, compared to the third quarter of 2024.\n\nSupplies, as a percentage of revenues, were 14.5% in the third quarter of 2025 and 15.2% in the third quarter of 2024. Supply costs per equivalent admission increased 1.4% in the third quarter of 2025, compared to the third quarter of 2024. Supply costs per equivalent admission increased 7.0% for medical devices and declined 8.7% for pharmacy supp"
}