{
  "source_file": "hd-20251102.htm",
  "form_type": "10-Q",
  "item1_clean": null,
  "item7_clean": null,
  "item2_clean": "Online sales, which consist of sales of products generated through websites and mobile applications, represented 15.2% of net sales during the third quarter of fiscal 2025 and increased by 11.4% compared to the third quarter of fiscal 2024. Calculated on a comparable week basis relative to fiscal 2024, online sales increased by 11.0%.\nA stronger U.S. dollar compared to the third quarter of fiscal 2024 negatively impacted net sales by $18 million during the third quarter of fiscal 2025.\nComparable sales is a measure that highlights the performance of our existing locations and websites by measuring the change in net sales for a period over the comparable prior period of equivalent length. Comparable sales includes sales at locations, physical and online, open greater than 52 weeks (including remodels and relocations) and excludes closed stores. Acquisitions are typically included in comparable sales after they have been owned for more than 52 weeks. Fiscal 2025 includes 52 weeks and fiscal 2024 included 53 weeks. For our calculation of comparable sales in fiscal 2025, we will compare weeks 1 through 52 in fiscal 2025 against weeks 2 through 53 in fiscal 2024. Comparable sales is intended only as supplemental information and is not a substitute for net sales presented in accordance with GAAP. The method of calculating comparable sales varies across the retail industry. As a result, our method of calculating comparable sales may not be the same as similarly titled measures reported by other companies.\nTotal comparable sales for the third quarter of fiscal 2025 increased 0.2%, primarily reflecting a 1.8% increase in comparable average ticket, partially offset by a 1.6% decrease in comparable customer transactions compared to the third quarter of fiscal 2024. Our comparable sales results reflect customer engagement with smaller home improvement projects, which was offset by the lack of severe weather events occurring during the third quarter of fiscal 2025, while lapping hurricane-related demand in the third quarter of fiscal 2024. Our comparable sales performance for the third quarter of fiscal 2025 also reflects the impact of continued macroeconomic uncertainties and other macroeconomic factors, including a persisting high interest rate environment pressuring large home improvement project demand.\nDuring the third quarter of fiscal 2025, our Kitchen & Blinds, Bath, Outdoor Garden, Storage & Organization, Electrical, Plumbing, Millwork, Hardware, and Appliances merchandising departments within our Primary segment posted positive comparable sales compared to the third quarter of fiscal 2024.\nGross profit for the third quarter of fiscal 2025 increased 2.9% to $13.8 billion from $13.4 billion for the third quarter of fiscal 2024. Gross profit as a percentage of net sales, or gross profit margin, was 33.4% for both the third quarters of fiscal 2025 and fiscal 2024, and reflects lower shrink and certain supply chain benefits within our Primary segment, offset by the inclusion of GMS in our consolidated results.\nOur operating expenses are composed of SG&A and depreciation and amortization.\nSelling, General & Administrative.\nSG&A for the third quarter of fiscal 2025 increased $424 million, or 5.9%, to $7.6 billion from $7.2 billion for the third quarter of fiscal 2024. As a percentage of net sales, SG&A was 18.5% for the third quarter of fiscal 2025 compared to 17.9% for the third quarter of fiscal 2024, primarily reflecting the impact of higher payroll and related costs in the third quarter of fiscal 2025 within our Primary segment, along with transaction costs related to the GMS acquisition.\nDepreciation and Amortization.\nDepreciation and amortization for the third quarter of fiscal 2025 increased $31 million, or 3.9%, to $826 million from $795 million for the third quarter of fiscal 2024. As a percentage of net sales, depreciation and amortization was 2.0% for both the third quarter of fiscal 2025 and fiscal 2024.\nInterest and Other, net\nInterest and other, net was $596 million for the third quarter of fiscal 2025 compared to $595 million for the third quarter of fiscal 2024. As a percentage of net sales, interest and other, net was 1.4% for the third quarter of fiscal 2025 compared to 1.5% for the third quarter of fiscal 2024.\nProvision for Income Taxes\nOur combined effective income tax rate was 24.3% for the third quarter of fiscal 2025 compared to 24.4% for the third quarter of fiscal 2024.\n\nEXECUTIVE SUMMARY\nWe reported net sales of $41.4 billion in the third quarter of fiscal 2025. Net earnings were $3.6 billion, or $3.62 per diluted share. For the first nine months of fiscal 2025, net sales were $126.5 billion and net earnings were $11.6 billion, or $11.65 per diluted share.\nDuring the third quarter of fiscal 2025, we opened three new stores in the U.S., resulting in a total store count of 2,356 at November 2, 2025. A total of 322 stores, or 13.7%, were located in Canada and Mexico. Our inventory turnover ratio was 4.5 times at the end of the third quarter of fiscal 2025, compared to 4.8 times at the end of the third quarter of fiscal 2024. The decrease in our inventory turnover ratio was primarily driven by higher average inventory levels during the first nine months of fiscal 2025.\nDuring the first nine months of fiscal 2025, we generated $13.0 billion of cash flow from operations, received $2.9 billion of proceeds from commercial paper borrowings, net of repayments, and received $2.1 billion of proceeds from the issuance of long-term debt, net of discounts. This cash flow, together with cash on hand, was used to fund $6.9 billion in cash dividends, repay $3.4 billion of long-term debt, and fund $2.6 billion in capital expenditures. We also completed the GMS acquisition, including the repayment of certain of its outstanding debt, for aggregate cash consideration totaling approximately $5.5 billion. In February 2025, we announced a 2.2% increase in our quarterly cash dividend to $2.30 per share.\nOur ROIC for the trailing twelve-month period was 26.3% at the end of the third quarter of fiscal 2025 and 31.5% at the end of the third quarter of fiscal 2024. The decrease in ROIC was primarily driven by higher average long-term debt and higher average equity largely due to the financing of the SRS acquisition. See the\nNon-GAAP Financial Measures\nsection below for our definition and calculation of ROIC.\nOn June 29, 2025, we entered into a definitive agreement to acquire GMS, a leading distributor of specialty building products, including drywall, ceilings, steel framing and other complementary construction products, through branches located across the U.S. and Canada. Under the terms of the merger agreement, we, through a wholly owned subsidiary, made a cash tender offer to purchase all outstanding shares of GMS common stock for $110 per share. All conditions of the offer were satisfied, including receipt of the requisite regulatory approvals, and the merger was completed on September 4, 2025. As a result of the merger, GMS became a direct subsidiary of SRS and an indirect, wholly owned subsidiary of the Company. We believe the GMS acquisition will enhance SRS's position as a leading multi-category building materials distributor, bringing differentiated capabilities, product categories and customer relationships that are highly complementary to SRS's existing business. Refer to\nto our consolidated financial statements for further discussion on the merger.\nTariffs and Other Trade Policy Matters\nWe continue to monitor developments with respect to tariffs and other trade policy matters closely. We have worked, and continue to work, diligently to diversify our global supply chain and to implement other cost mitigation initiatives. While we have experienced increased costs as a result of tariffs, our actions, including diversification efforts and modest price increases, along with our scale, vendor relationships, experienced internal teams, and other initiatives have allowed us to effectively mitigate the impact on our results of operations. We plan to continue to assess our sourcing and other mitigation strategies to maintain a strong value proposition for our customers and believe we remain well positioned to manage the impact that tariffs in effect as of the date of this filing are expected to have on our business.\n\nRESULTS OF OPERATIONS\nThe following table presents the percentage relationship between net sales and major categories in our consolidated statements of earnings.\nFISCAL 2025 AND FISCAL 2024 THREE MONTH COMPARISONS\nSelling, general and administrative\nDepreciation and amortization\nTotal operating expenses\nInterest and other (income) expense:\nInterest income and other, net\nInterest and other, net\nEarnings before provision for income taxes\nProvision for income taxes\nNote: Certain percentages may not sum to totals due to rounding.\nSelected financial and sales data:\nComparable sales (% change)\nN/A\nComparable customer transactions (% change)\nN/A\nComparable average ticket (% change)\nN/A\nCustomer transactions (in millions)\nDiluted earnings per share\nCustomer transactions and average ticket measures do not include results from HD Supply or SRS (including GMS).\nAverage ticket represents the average price paid per transaction and is used by management to monitor the performance of the Company, as it represents a primary driver in measuring sales performance.\nWe assess our sales performance by evaluating both net sales and comparable sales. In fiscal 2025, there is a one-week calendar shift as a result of the 53rd week in fiscal 2024. For purposes of the following discussion, comparable sales, comparable customer transactions, and comparable average ticket are based upon the comparable 13-week period from fiscal 2024.\nNet sales for the third quarter of fiscal 2025 were $41.4 billion, an increase of 2.8% from $40.2 billion for the third quarter of fiscal 2024. The increase in net sales for the third quarter of fiscal 202"
}