{
  "source_file": "hig-20250930.htm",
  "form_type": "10-Q",
  "item1_clean": null,
  "item7_clean": null,
  "item2_clean": "Part I - Item 2. Management's Discussion and Analysis of Financial Condition and Results of Operations\nFor middle & large business, represents the ratio of prior period premiums that were successfully renewed divided by premiums associated with policies available for renewal in the current period. Premium retention excludes premium amounts from annual audits, renewal written price increases and changes in exposure, including amount of insurance. Premium retention statistics are subject to change from period to period based on a number of factors, including the effect of subsequent cancellations and non-renewals\nPrior Accident Year Loss and Loss Adjustment Expense Ratio-\nRepresents the increase (decrease) in the estimated cost of settling catastrophe and non-catastrophe claims incurred in prior accident years as recorded in the current calendar year divided by earned premiums.\nReinstatement Premiums-\nRepresents additional ceded premium paid for the reinstatement of the amount of reinsurance coverage that was reduced as a result of the Company ceding losses to reinsurers.\nRenewal Earned Price Increase (Decrease)-\nWritten premiums are earned over the policy term, which is six months for certain personal automobile business and twelve months for substantially all of the remainder of the Company’s Property and Casualty (\"P&C\") business. Since the Company earns premiums over the six to twelve month term of the policies, renewal earned price increases (decreases) lag renewal written price increases (decreases) by six to twelve months.\nRenewal Written Price Increase (Decrease)-\nFor Business Insurance, represents the combined effect of rate changes, and individual risk pricing decisions per unit of exposure on policies that renewed and includes amount of insurance. For Personal Insurance, renewal written price increases represent the total change in premium per policy since the prior year on those policies that renewed and includes the combined effect of rate changes, amount of insurance and other changes in exposure. For Personal Insurance, other changes in exposure include, but are not limited to, the effect of changes in number of drivers, vehicles and incidents, as well as changes in customer policy elections, such as deductibles and limits. The rate component represents the change in rate impacting renewal policies as previously filed with and approved by state regulators during the period. Amount of insurance represents the change in the value of the rating base, such as model year/vehicle symbol for automobiles, building replacement costs for property and wage inflation for workers’ compensation. A number of factors affect renewal written price increases (decreases) including expected loss costs as projected by the Company’s pricing actuaries, rate filings approved by state regulators, risk selection decisions made by the Company’s underwriters and marketplace competition. Renewal written price changes reflect the property and casualty insurance market cycle. Prices tend to increase for a particular line of business when insurance carriers have incurred significant losses in that line of business in the recent past or the industry as a whole commits less of its capital to writing exposures in that line of business. Prices tend to decrease when recent loss experience has been favorable or when competition among insurance carriers increases. Renewal written price\nstatistics are subject to change from period to period, based on a number of factors, including changes in actuarial estimates and the effect of subsequent cancellations and non-renewals, and modifications made to better reflect ultimate pricing achieved.\nReturn on Assets (“ROA”), Core Earnings-\nThe Company uses this non-GAAP financial measure to evaluate, and believes is an important measure of, the Hartford Funds segment’s operating performance. ROA, core earnings is calculated by dividing annualized core earnings by a daily average AUM. ROA is the most directly comparable U.S. GAAP measure. The Company believes that ROA, core earnings, provides investors with a valuable measure of the performance of the Hartford Funds segment because it reveals trends in our business that may be obscured by the effect of items excluded in the calculation of core earnings. ROA, core earnings, should not be considered as a substitute for ROA and does not reflect the overall profitability of our Hartford Funds business. Therefore, the Company believes it is important for investors to evaluate both ROA, and ROA, core earnings when reviewing the Hartford Funds segment performance. A reconciliation of ROA to ROA, core earnings is set forth in the Results of Operations section within MD&A - Hartford Funds.\nUnderlying Combined Ratio-\nThis non-GAAP financial measure of underwriting results represents the combined ratio before catastrophes, prior accident year development and current accident year change in loss reserves upon acquisition of a business. Combined ratio is the most directly comparable U.S. GAAP measure. The Company believes this ratio is an important measure of the trend in profitability since it removes the impact of volatile and unpredictable catastrophe losses and prior accident year loss and loss adjustment expense reserve development. The changes to loss reserves upon acquisition of a business are excluded from underlying combined ratio because such changes could obscure the ability to compare results in periods after the acquisition to results of periods prior to the acquisition as such trends are valuable to our investors' ability to assess the Company's financial performance.\nA reconciliation of combined ratio to underlying combined ratio is set forth in the Results of Operations section within MD&A - Business Insurance and Personal Insurance.\nUnderwriting Gain (Loss)-\nThis non-GAAP financial measure is a before tax measure that represents earned premiums less incurred losses, loss adjustment expenses and underwriting expenses. Net income (loss) is the most directly comparable U.S. GAAP measure. The Hartford's management evaluates profitability of the Business and Personal Insurance segments primarily on the basis of underwriting gain or loss. Underwriting gain (loss) is influenced significantly by earned premium growth and the adequacy of The Hartford's pricing. Underwriting profitability over time is also greatly influenced by The Hartford's underwriting discipline, as management strives to manage exposure to loss through favorable risk selection and diversification, effective management of claims, use of reinsurance and its ability to manage its expenses. The Hartford believes that underwriting gain (loss) provides investors with a valuable measure of profitability, before tax, derived from underwriting activities, which are managed separately from the Company's investing activities.\n\nCredit Losses on Fixed Maturities, AFS and Intent-to-Sell Impairments\nThree and nine months ended September 30, 2025\nFor the three months ended September 30, 2025, the Company recorded no credit losses. For the nine months ended September 30, 2025, the Company recorded a net credit loss reversal of $2, primarily attributable to a decrease in the ACL of $3 on one below investment grade corporate issuer, partially offset by a credit loss of $1 related to a CMBS. For the three and nine months ended September 30, 2025, there were no unrealized losses on securities with an ACL recognized in other comprehensive income (\"OCI\"). For further information, refer to Note 5 - Investments of Notes to Condensed Consolidated Financial Statements.\nThere were no intent-to-sell impairments.\nThe Company incorporates its best estimate of future performance using internal assumptions and judgments that are informed by economic and industry specific trends, as well as our expectations with respect to security specific developments.\nFuture intent-to-sell impairments or credit losses may develop as the result of changes in our intent to sell specific securities that are in an unrealized loss position or if modeling assumptions, such as macroeconomic factors or security specific developments, change unfavorably from our current modeling assumptions, resulting in lower cash flow expectations.\nThree and nine months ended September 30, 2024\nFor the three and nine months ended September 30, 2024, the Company recorded net credit losses of $0 and $2, respectively. Net credit losses were primarily attributable to increases in the ACL of $1 on CMBS and $1 on a below investment grade corporate issuer. For the three and nine months ended September 30, 2024 unrealized losses on securities with an ACL recognized in OCI were $0 and less than $1, respectively.\nThere were no intent-to-sell impairments.\nACL on Mortgage Loans\nThree and nine months ended September 30, 2025\nThe Company reviews mortgage loans on a quarterly basis to estimate the ACL with changes in the ACL recorded in net realized gains and losses. Apart from an ACL recorded on individual mortgage loans where the borrower is experiencing financial difficulties, the Company records an ACL on the pool of mortgage loans based on lifetime expected credit losses. For further information, refer to Note 5 - Investments of Notes to Condensed Consolidated Financial Statements.\nFor both the three and nine months ended September 30, 2025, the Company recorded an increase in the ACL on mortgage loans of $6. The increase in the allowance is primarily attributable to weaker real estate fundamentals, property specific declines, and net additions of new loans.\nThree and nine months ended September 30, 2024\nFor the three months ended September 30, 2024, there were no credit loss adjustments on mortgage loans. For the nine months ended September 30, 2024, the Company recorded a credit loss reversal of $3 primarily attributable to improved economic scenario forecasts and property specific improvements, partially offset by net additions of new loans.\n\nremained relatively"
}