{
  "source_file": "hii-20250930.htm",
  "form_type": "10-Q",
  "item1_clean": null,
  "item7_clean": null,
  "item2_clean": "Management's Discussion and Analysis of Financial Condition and Results of Operations\nOVERVIEW\nHuntington Ingalls Industries, Inc. (\"HII\", \"we\", \"us\", or \"our\") is a global, all-domain defense partner, building and delivering the world’s most powerful, survivable naval ships and technologies that safeguard America’s seas, sky, land, space, and cyber. For more than a century, our Ingalls Shipbuilding segment (\"Ingalls\") in Mississippi and Newport News Shipbuilding segment (\"Newport News\") in Virginia have built more ships in more ship classes than any other U.S. naval shipbuilder, making us America's largest shipbuilder. Our Mission Technologies segment develops integrated technology solutions and products that enable today's connected, all-domain force. Headquartered in Newport News, Virginia, we employ approximately 44,000 people domestically and internationally.\nWe conduct most of our business with the U.S. Government, primarily the Department of War (the \"Department\"). As prime contractor, principal subcontractor, team member, or partner, we participate in many high-priority U.S. defense programs. Ingalls includes our non-nuclear ship design, construction, repair, and maintenance businesses. Newport News includes all of our nuclear ship design, construction, overhaul, refueling, and repair and maintenance businesses. Our Mission Technologies segment is organized into four groups, All-Domain Operations, Warfare Systems, Global Security, and Uncrewed Systems, and specializes in a wide range of services and products across our capabilities, which include command, control, computers, communications, cyber, intelligence, surveillance, and reconnaissance (\"C5ISR\") systems and operations; the application of artificial intelligence and machine learning to battlefield decisions; defensive and offensive cyber, electronic warfare & space; unmanned systems; live, virtual, and constructive training solutions; fleet sustainment; and critical nuclear operations.\nBusiness Environment\nThe federal budget environment remains a significant long-term risk, and we continue to see uncertainty in the economy, our industry, and our company. Our customers and suppliers continue to face challenges, and we believe continued budget pressures could have serious implications for defense discretionary spending, the defense industrial base, including HII, and the customers, employees, suppliers, subcontractors, investors, and communities that rely on companies in the defense industrial base. We cannot clearly predict how long these challenges will\n\nWe consider operating income an important measure for evaluating our operating performance, and, consistent with industry practice, we define operating income as revenues less the related costs of producing the revenues and general and administrative expenses.\nSegment Operating Income\nWe internally manage our operations by reference to \"segment operating income,\" which is a non-GAAP measure and is defined as operating income before the Operating FAS/CAS Adjustment and non-current state income taxes, neither of which affects contract performance. Segment operating income is a measure we use to evaluate our core operating performance as it reflects the aggregate performance results of contracts within a segment. When analyzing our operating performance, investors should use segment operating income in addition to, and not as an alternative for, operating income or any other performance measure presented in accordance with GAAP. We believe segment operating income reflects an additional way of viewing aspects of our operations that, when viewed with our GAAP results, provides a more complete understanding of factors and trends affecting our business. We believe the measure is used by investors and is a useful indicator to measure our performance. Because not all companies use identical calculations, our presentation of segment operating income may not be comparable to similarly titled measures of other companies.\nChanges in segment operating income are typically expressed in terms of volume, as discussed in “Sales and Service Revenues” above, or performance. Performance refers to changes in contract profit margin rates. These changes typically relate to profit recognition associated with revisions to estimated costs at completion (\"EAC\"), which reflect improved or deteriorated operating performance on that contract. Operating income changes are accounted for on a cumulative to date basis at the time an EAC change is recorded. Segment operating income may also be affected by, among other things, contract performance, inflationary pressures on our supply chain, the effects of workforce stoppages and other labor-related shortfalls, the availability of raw materials, the effects of natural disasters such as hurricanes, resolution of disputed items with the customer, recovery of insurance proceeds, and other discrete events. At the completion of a long-term contract, any originally estimated costs not incurred or reserves not fully utilized, such as warranty reserves, could also impact contract earnings. Where such items have occurred and the effects are material, a separate description is provided. Refer to \"Segment Operating Results\" in this section for activity within each segment.\nThe following table reconciles operating income to segment operating income:\nThree Months Ended September 30\nNine Months Ended September 30\n\nThe Company’s Newport News segment continues to experience performance challenges in the construction of aircraft carriers and the\nclass (SSN 774) submarine program.\nSales and Service Revenues\nNewport News revenues, including intersegment sales, for the three months ended September 30, 2025, increased $205 million, or 15%, from the same period in 2024, primarily driven by higher volumes in submarines and aircraft carriers.\nNewport News revenues, including intersegment sales, for the nine months ended September 30, 2025, increased $235 million, or 5%, from the same period in 2024, primarily driven by higher volumes in submarines.\nSegment Operating Income\nNewport News segment operating income for the three months ended September 30, 2025, was $80 million, compared to segment operating income of $15 million for the same period in 2024. The increase was primarily driven by unfavorable cumulative catch-up adjustments in the\nclass (SSN 774) submarine program and aircraft carriers in 2024.\nNewport News segment operating income for the nine months ended September 30, 2025, was $247 million, compared to segment operating income of $208 million for the same period in 2024. The increase was primarily driven by risk retirement in the\nclass (SSBN 826) submarine program and contract adjustments in the\nclass (SSN 774) submarine program, partially offset by contract adjustments and incentives in 2024 in the RCOH program.\n\nNon-operating retirement benefit\nOperating FAS/CAS Adjustment expense\nThe Operating FAS/CAS Adjustment was a net expense of $9 million and $16 million for the three months ended September 30, 2025 and 2024, respectively. The Operating FAS/CAS Adjustment was a net expense of $25 million and $48 million for the nine months ended September 30, 2025 and 2024, respectively. The favorable change in the Operating FAS/CAS Adjustment for each period was primarily driven by higher interest rates under FAS.\nNon-current State Income Taxes\nNon-current state income taxes include deferred state income taxes, which reflect the change in deferred state tax assets and liabilities, and the tax expense or benefit associated with changes in state unrecognized tax benefits in the relevant period. These amounts are recorded within operating income. Current period state income taxes are charged to contract costs and included in cost of sales and service revenues in segment operating income.\nNon-current state income tax expense was $9 million for the three months ended September 30, 2025, compared to a non-current state income tax benefit of $1 million for the three months ended September 30, 2024. Non-current state income tax expense was $12 million for the nine months ended September 30, 2025, compared to a non-current state income tax benefit of $3 million for the nine months ended September 30, 2024. The unfavorable changes in non-current state income taxes for the three and nine months ended September 30, 2025 were driven by an increase in deferred state income tax expense, primarily attributable to a change in net capitalized research and development expenditures.\nSEGMENT OPERATING RESULTS\nOur discussion of business segment performance focuses on sales and service revenues and operating income, consistent with our approach for managing our business. We are aligned into three reportable segments: Ingalls, Newport News, and Mission Technologies.\n\nOperating FAS/CAS Adjustment is excluded from segment cost of product sales and service revenues.\nProduct Sales and Segment Cost of Product Sales\nProduct sales for the three months ended September 30, 2025, increased $311 million, or 18%, from the same period in 2024, primarily due to higher volumes in submarines and aircraft carriers at Newport News, and surface combatants at Ingalls.\nSegment cost of product sales for the three months ended September 30, 2025, increased $264 million, or 17%, compared with the same period in 2024, primarily due to the higher volumes described above.\nProduct sales for the nine months ended September 30, 2025, increased $268 million, or 5%, from the same period in 2024, primarily due to higher volumes in submarines at Newport News and surface combatants at Ingalls, partially offset by lower volumes in amphibious assault ships at Ingalls.\nSegment cost of product sales for the nine months ended September 30, 2025, increased $261 million, or 6%, compared with the same period in 2024, primarily due to the changes in volume described above.\nService Revenues and Segment Cost of Service Revenues\nService revenues for the three months en"
}