{
  "source_file": "hlt-20241231.htm",
  "form_type": "10-K",
  "item1_clean": "Hilton is one of the largest global hospitality companies, with 8,447\nproperties comprising\n140 countries and territories as of December 31, 2024. Founded in 1919, Hilton has been an innovator in the industry for over 105 years, driven by the vision of founder Conrad Hilton \"to fill the earth with the light and warmth of hospitality.\" Our premier brand portfolio includes luxury, lifestyle, full service, focused service and all-suites hotel brands, as well as timeshare brands. As of December 31, 2024, we had 211 million members in our award-winning guest loyalty program, Hilton Honors, an increase of 17 percent from December 31, 2023; refer to \"—Our Brand Portfolio\" and \"—Our Guest Loyalty Program\" below for additional information on our brands, including Hilton Honors.\nWe operate our business through: (i) a management and franchise segment and (ii) an ownership segment, each of which is reported as a segment based on (a) delivering a similar set of products and services and (b) being managed separately given its distinct economic characteristics. The management and franchise segment includes all of the hotels we manage for third-party owners, as well as all properties that license our intellectual property (\"IP\") and/or use our booking channels and related programs, and where we provide other contracted services, but the day-to-day services of the hotels are operated or managed by someone other than us. Revenues from this segment include: (i) management and franchise fees charged to third-party hotel owners; (ii) licensing fees from our strategic partners, including co-branded credit card providers, strategic partner hotels and Hilton Grand Vacations Inc. (\"HGV\"); and (iii) fees for managing hotels in our ownership segment. The ownership segment primarily derives revenues from nightly hotel room sales, food and beverage sales and other services at our consolidated owned and leased hotels. For more information regarding our segments, refer to \"—Our Business—Management and Franchise\" and \"—Our Business—Ownership\" below.\nIn addition to our current hotel portfolio, we are focused on the growth of our business by expanding our global hotel network through our development pipeline, which represents hotels that we expect to add to our system in the future. The following table summarizes our development activity:\nAs of or for the Year Ended December 31, 2024\nDevelopment pipeline\nCount as of period end\nRounded to the nearest hundred.\nOpenings include 411 hotels and approximately 19,500 rooms from strategic partner hotels.\nRepresents room additions, net of rooms removed from our system. During 2024, 409 hotels and approximately 19,400 rooms added were from strategic partner hotels. Net unit growth for the year ended December 31, 2024 was 7.3 percent.\nAdditions include 423 hotels and approximately 20,100 rooms from strategic partner hotels.\nThe hotels in our development pipeline were under development throughout 118 countries and territories, including 25 countries and territories where we had no existing hotels, with nearly half of the rooms under construction and more than half of the rooms located outside of the U.S. Rooms under construction include rooms for hotels under construction or operating hotels that are in the process of conversion to our system. Nearly all of the rooms in our development pipeline will be in our management and franchise segment upon opening. We do not consider any individual development project to be material to us.\nWe continue to drive customer loyalty, including participation in our Hilton Honors guest loyalty program, through: (i) our experience in the hospitality industry, which spans more than a century of customer service and entrepreneurship, and continues to evolve to meet the tastes, preferences and demands of our guests; (ii) our strong, well-defined brands that operate throughout the hospitality industry chain scales; (iii) our dedicated and collaborative workforce, built to focus on providing exceptional customer experiences; and (iv) our commercial service offerings. We believe that satisfied customers will generate additional business at our properties, yielding strong overall hotel performance for us and our hotel owners. Strong results at our existing properties will encourage further development of additional hotels under our brands and conversions of existing hotels to our brands with both (i) owners who currently have properties in our system and (ii) new owners who sign management or franchise contracts with us in the future, which further supports our growth and future financial performance. We believe that our existing hotel system and development pipeline, which will require minimal capital investment from us, positions us to further improve and grow our business, allocate capital effectively and meet our customers' demands and preferences in the future.\nThe goal of each of our brands is to deliver exceptional customer experiences and superior operating performance.\nCountries/ Territories\nPercentage of Total Rooms\nSelected Competitors\nFour Seasons, Mandarin Oriental, Peninsula, Ritz-Carlton,\nRosewood Hotels & Resorts, St. Regis\nJW Marriott, Intercontinental, Sofitel, Grand Hyatt, Shangri-La, Fairmont\nLeading Hotels of the World, Legend Preferred Hotels & Resorts, Belmond, The Luxury Collection\nFirmdale Hotels, EDITION Hotels, Rosewood Hotels, One Aldwych\nJW Marriott, Grand Hyatt, Fairmont, Intercontinental, Omni\nKimpton, Thompson Hotels, W Hotels, Virgin Hotels,\nHyatt Regency, Marriott,\nOmni, Sheraton, Westin\nAutograph Collection, The Unbound Collection, Independent Hotels, MGallery, Kimpton\nLe Meridien, Hyatt Centric, 25h, Hotel Indigo\nMarriott, Crowne Plaza, Delta, Holiday Inn, Radisson, Sheraton, Wyndham\nJoie de Vivre, Tribute Portfolio, Kimpton, Hotel Indigo, Ascend, Trademark\nHyatt Regency, Marriott, Sheraton, Westin\nAC Hotels, Aloft Hotels, Cambria, Hotel Indigo, Hyatt Centric\nMAMA Shelter, CitizenM, Ace Hotels, Yotel, Freehand\nAloft, Courtyard by Marriott, Four Points, Holiday Inn, Hyatt Place\nComfort Suites, Courtyard by Marriott,\nFairfield Inn, Holiday Inn Express, Springhill Suites\nBest Western, Comfort Inn, La Quinta, Sleep Inn, Wingate, Avid\nQuality Inn, Baymont, Travelodge, Howard Johnson, Super 8, Days Inn\nElement, Hyatt House, Residence Inn, Staybridge Suites\nTownePlace Suites, Staybridge Suites, Hyatt Studios\nStudioRes, Candlewood Suites, Stay Apt Suites, ECHO Suites, Extended Stay America Premiere Suites\nDisney Vacation Club, Holiday Inn Club Vacations,\nMarriott Vacations Worldwide,\nTravel & Leisure Co.\nExcludes 17 unbranded properties with 4,392 rooms, representing approximately 0.3% of total rooms and 409 strategic partner hotels with 19,361 rooms, representing approximately 1.5% of total rooms. Hilton Grand Vacations is inclusive of Hilton Club, Hilton Grand Vacations Club and Hilton Vacation Club.\nThese selected competitors exclude lesser-known regional competitors.\nWaldorf Astoria Hotels & Resorts\n: Waldorf Astoria Hotels & Resorts is a luxury brand with an award-winning portfolio of iconic properties with a relentless commitment to elegant service, one-of-a-kind experiences and culinary expertise in landmark destinations around the world. Waldorf Astoria hotels deliver an effortless experience seamlessly, creating a true sense of place for guests through stunning architecture and design, the signature Peacock Alley restaurant, refined art collections, Michelin-starred dining restaurants and chef partnerships and elevated in-room amenities.\nConrad Hotels & Resorts\n: Conrad Hotels & Resorts is a luxury brand that connects bold design, impactful experiences and curated contemporary art to inspire the conscientious traveler. Found in major urban centers and resort destinations, Conrad is a place where guests are empowered to explore through intuitive service and experiences that authentically connect them with local culture.\nLXR Hotels & Resorts:\nLXR Hotels & Resorts is a hand-picked collection of independent and spirited luxury properties celebrating the timeless pursuit of personal adventure. Found in alluring destinations, LXR connects legendary properties into an exclusive network of hotels that are set apart by individual design, an unrivaled commitment to personalized service and elegant, yet locally immersive, experiences for guests.\n: NoMad Hotels is a luxury brand that brings guests sophisticated offerings in some of the world's most sought-after locations. NoMad Hotels are both grand and intimate, creating a unique blend of luxury and lifestyle experiences throughout the stay with special touches like unique local art collections featured in each property.\nSignia by Hilton is a luxury brand with a portfolio of exceptional hotels in gateway cities and resort destinations around the world. Each Signia by Hilton property infuses sophistication into every stay, offering top-tier meetings and event spaces, a vibrant atmosphere, exceptional amenities and personalized service catered to the needs of today's global traveler.\nCanopy by Hilton is an upper upscale brand that delivers elevated, boutique hotel experiences that celebrate the best of the locale. Inviting, sophisticated design, bespoke food and beverage and crafted touchpoints deliver a locally inspired, high-end and welcoming stay.\nHilton Hotels & Resorts\n: As Hilton’s flagship brand, Hilton Hotels & Resorts is the trusted global leader in hospitality. An upper upscale brand with more than 600 hotels and resorts in nearly 100 countries and territories, Hilton Hotels & Resorts continues to set the standard for the industry and upholds Conrad Hilton’s vision to fill the earth with the light and warmth of hospitality by elevating every celebration and event, creating real human connections, and immersing guests in the best of global and local cultures in the world’s most desired destinations.\nCurio Collection by Hilton\n: Curio Collection by Hilton is an upper upscale brand with a global portfolio of individually remarkable hotels hand-picked to immerse guests in one-of-a-kind moments in sought-after destinations. Each hotel in the Curio Collection evokes a bespoke story through distinctive architecture and design, world-class food and beverage and curated experiences.\n: Graduate by Hilton is an upper upscale lifestyle brand of handcrafted hotels in dynamic, university-anchored towns. Each Graduate hotel brings stories and traditions to life and offers the perfect setting for game days, reunions, graduations, campus visits and more.\nDoubleTree by Hilton\n: DoubleTree by Hilton is a fast-growing global upscale brand that continues to be a symbol of comfort for business and leisure travelers around the world, offering contemporary accommodations and amenities. DoubleTree by Hilton is renowned for its warm, caring service, beginning with its signature welcome that includes the hotel’s famous original chocolate chip cookie, now available in an allergy-friendly option. The inclusive service experience offers upscale food and beverage experiences and features a variety of flexible meeting spaces for events of all sizes.\nTapestry Collection by Hilton\n: Tapestry Collection by Hilton is an upper upscale brand with a portfolio of original hotels that offer guests unique style and vibrant personality, encouraging travelers to connect to their destination and enjoy authentic off-the-beaten-path experiences. While each property is unique, every Tapestry Collection by Hilton property is united by the reliability that comes with the Hilton name.\nEmbassy Suites by Hilton\n: Embassy Suites by Hilton offers both leisure and business travelers an approachable, upper upscale experience. As a full-service hotel, every Embassy Suites provides spacious two-room suites with separate bedroom\nand living room spaces, free made-to-order breakfast each morning, complimentary drinks and snacks during evening reception every night, flexible meetings and events spaces and 24-hour fitne",
  "item7_clean": "one of the largest global hospitality companies, with 8,447 properties comprising 1,268,206 rooms in 140 countries and territories as of December 31, 2024. Our premier brand portfolio includes luxury, lifestyle, full service, focused service and all-suites hotel brands, as well as timeshare brands. As of December 31, 2024, we had 211 million members in our award-winning guest loyalty program, Hilton Honors, an increase of 17 percent from December 31, 2023.\nSegments and Regions\nWe analyze our operations and business by both operating segments and geographic regions. Our operations consist of two reportable segments that are based on similar products and services: (i) management and franchise and (ii) ownership. The management and franchise segment provides services, including hotel management and licensing of our IP and/or the use of our booking channels and related programs. Revenues from this segment include: (i) management and franchise fees charged to third-party hotel owners; (ii) licensing fees from our strategic partners, including co-branded credit card providers and strategic partner hotels, and HGV; and (iii) fees for managing the hotels in our ownership segment. As a manager of hotels, we typically are responsible for supervising or operating the hotel in exchange for management fees. As a franchisor of hotels, we charge franchise fees in exchange for the use of one of our brand names and/or related commercial services, such as our reservations system, marketing and information technology services, while a third party manages or operates such franchised hotels. The ownership segment primarily derives revenues from nightly hotel room sales, food and beverage sales and other services at our consolidated owned and leased hotels.\nWe conduct business in three distinct geographic regions: (i) the Americas; (ii) EMEA; and (iii) Asia Pacific. The Americas region includes North America, South America and Central America, including all Caribbean nations. Although the U.S., which represented 65 percent of our system-wide hotel rooms as of December 31, 2024, is included in the Americas region, it is often analyzed separately and apart from the Americas region and, as such, it is presented separately within our hotel operating statistics in \"—Results of Operations.\" The EMEA region includes Europe, which represents the western-most peninsula of Eurasia stretching from Iceland in the west to Russia in the east, and the Middle East and Africa (\"MEA\"), which represents the Middle East region and all African nations, including the Indian Ocean island nations. Europe and MEA are often analyzed separately and, as such, are presented separately within our hotel operating statistics in \"—Results of Operations.\" The Asia Pacific region includes the eastern and southeastern nations of Asia, as well as India, Australia, New Zealand and the Pacific Island nations.\nSystem Growth and Development Pipeline\nOur strategic objectives include the continued expansion of our global hotel network, in particular our fee-based business. As we enter into new management and franchise contracts and enter into strategic agreements to complement our hotel portfolio, we expand our business with limited or no capital investment by us as the manager, franchisor or licensor, since the capital required to build, renovate and maintain hotels is typically provided by the third-party owners with whom we contract to provide management services, license our IP or provide access to our booking channels and related programs. Prior to approving the addition of new hotels to our management and franchise development pipeline, we evaluate the economic viability of the hotel based on its geographic location, the credit quality of the third-party owner and other factors. By increasing the number of management and franchise contracts with third-party owners, over time we expect to increase revenues, overall return on invested capital and free cash flow. See further discussion on our cash management policy in \"—Liquidity and Capital Resources.\" The current economic environment, including elevated levels of inflation and interest rates, has posed certain challenges to the execution of our growth strategy, which in some cases have included and may continue to include delays in openings and new development.\nIn addition to our current hotel portfolio, we are focused on the growth of our business by expanding our global hotel network through our development pipeline, which represents hotels that we expect to add to our system in the future. The following table summarizes our development activity:\nAs of or for the Year Ended December 31, 2024\nDevelopment pipeline\nCount as of period end\nRounded to the nearest hundred.\nOpenings include 411 hotels and approximately 19,500 rooms from strategic partner hotels.\nRepresents room additions, net of rooms removed from our system. During 2024, 409 hotels and approximately 19,400 rooms added were from strategic partner hotels. Net unit growth for the year ended December 31, 2024 was 7.3 percent.\nAdditions include 423 hotels and approximately 20,100 rooms from strategic partner hotels.\nThe hotels in our development pipeline were under development throughout 118 countries and territories, including 25 countries and territories where we had no existing hotels, with nearly half of the rooms under construction and more than half of the rooms located outside of the U.S. Rooms under construction include rooms for hotels under construction or operating hotels that are in the process of conversion to our system. Nearly all of the rooms in our development pipeline will be in our management and franchise segment upon opening. We do not consider any individual development project to be material to us.\nPrincipal Components and Factors Affecting our Results of Operations\nPrincipal Components\nWe primarily derive our revenues from the following sources:\nFranchise and licensing fees\n. Represents fees earned in connection with licensing our IP, including our brands and/or the use of our booking channels and related programs. Under our long-term franchise contracts with hotel owners, franchisees typically pay us franchise fees that include: (i) monthly royalty fees, generally based on a percentage of the hotel's monthly gross room revenue, and, in some cases, may also include a percentage of gross food and beverage revenues and other revenues, as applicable; and (ii) application, initiation and other fees for when new hotels enter the system, when there is a change of ownership of a hotel or when contracts with hotels already in our system are extended. Consideration provided to incentivize hotel owners to enter into franchise contracts with us is amortized over the life of the applicable contract as a reduction to franchise and licensing fees. Our license agreements, for which we receive licensing fees for the use of our IP and/or the use of our booking channels and related programs, are predominantly with strategic partners, including co-branded credit card providers, strategic partner hotels and HGV.\nBase and incentive management fees.\nRepresents fees earned in connection with the management of hotels. Terms of our management contracts vary, but our fees typically consist of a base management fee, which is generally based on a percentage of the hotel's monthly gross operating revenue and, when applicable, an incentive management fee, which is generally based on a percentage of the hotel's operating profits, normally over a one calendar year period, and, in some cases, may be subject to a stated return threshold to the hotel owner. Outside of the U.S., our fees are often more dependent on hotel profitability measures, either because of a single management fee structure where the entire fee is an incentive management fee, or because our two-tier fee structure is more heavily weighted toward the incentive management fee than the base management fee. Consideration provided to incentivize hotel owners to enter into management contracts with us is amortized over the life of the applicable contract as a reduction to base and other management fees.\nOwned and leased hotels.\nRepresents revenues derived from the operations of our consolidated owned and leased hotels, including hotel room sales, accommodations sold in conjunction with other services, food and beverage sales and other ancillary goods and services. These revenues are primarily derived from two categories of customers:\ntransient and group. Transient guests are individual travelers who are traveling for business or leisure. Group guests are travelers who are traveling for group events that reserve rooms for meetings, conferences or social functions, and may be sponsored by corporate, social, military, educational, religious or other organizations or associations. Group business usually includes a block of room accommodations, as well as other ancillary services, such as meeting facilities and catering and banquet services. A majority of our food and beverage sales and other ancillary goods and services are provided to customers who are also occupying rooms at our hotels. As a result, occupancy affects all components of our owned and leased hotels revenues.\nRepresents revenues primarily generated by our purchasing operations.\nOther revenues from managed and franchised properties.\nRepresents amounts that are contractually reimbursed to us by property owners, either directly as costs are incurred or indirectly through monthly program fees related to certain costs and expenses supporting the operations of the related properties. The direct reimbursements by property owners are primarily for payroll and related costs if the managed hotel employees are legally employed by us. We have no legal responsibility for the employee liabilities related to certain of our managed properties, predominately those located outside of the U.S., where we are not the legal employer, as well as the employees or the liabilities associated with operating franchised properties or strategic partner hotels. Revenues and expenses for these direct reimbursements have no net effect on operating income (loss) or net income (loss). For the indirect reimbursements, Hilton collects monthly program fees from our managed and franchised properties, which are based on the underlying hotel's sales or usage. The program fees serve as reimbursement for the costs related to the operation of our marketing, sales and brand programs and shared services. Hilton collects program fees from strategic partner hotels when a stay that was reserved using our booking channels is completed. Indirect reimbursements also include revenues related to our Hilton Honors guest loyalty program, which are primarily derived from payments from hotel franchisees and third-party owners of hotels we manage that participate in the program, as well as strategic partners, including strategic partner hotels. We are contractually required to use these fees that we collect solely for these programs.\nFactors Affecting our Revenues\nThe following factors affect the revenues we derive from our operations:\nConsumer demand and global economic conditions\n. Consumer demand for our products and services, as well as the products and services of the third parties from which we earn licensing fees, is closely linked to the performance of the general economy and is sensitive to business and personal discretionary spending levels. Among other factors, declines in consumer demand due to adverse general economic conditions, risks reducing or otherwise negatively affecting travel patterns, lower consumer confidence and adverse geopolitical conditions can reduce the amount of management and franchise fees we are able to generate and/or reduce the revenues and profitability of the operations of our owned and leased hotels. Further, competition for hotel guests and the supply of hotel services affect our ability to sustain or increase rates charged to customers of our hotels. Also, declines in hotel profitability during an economic downturn directly affect the incentive portion of our management fees, which is based on hotel profitability measures. As a result, changes in consumer demand and general business cycles have historically subjected and could in the future subject our revenues to significant volatility.\nContracts with third-party hotel owners and franchisees and relationships with developers\n. We depend on our long-term management and franchise contracts with third-party hotel owners and hotel franchisees for our management and franchise fee revenues. The success and sustainability of our management and franchise business depends on our ability to perform under our management and franchise contracts and maintain good relationships with third-party hotel owners and franchisees. Our relationships with these third parties allow us to maintain our current presence as contracts mature and also generate new incremental opportunities for property development that can support our growth. Growth and maintenance of our hotel system and earning fees related to hotels in development are dependent on the ability of developers and owners to access capital for the development, maintenance and renovation of properties. We believe that we generally have good relationships with our third-party hotel owners, franchisees and developers and are committed to the continued growth and development of these relationships. These relationships exist with a diverse group of owners, franchisees and developers and are not significantly concentrated with any one particular third party.\nPrincipal Components\nWe primarily incur the following expenses:\nOwned and leased hotels.\nReflects the operating expenses of our consolidated owned and leased hotels, including room expenses, food and beverage costs, other support costs and property expenses. Room expenses include compensation costs for housekeeping, laundry and front desk staff, as well as supply costs for guest room amenities and laundry. Food and beverage costs include costs for wait and kitchen staff and food and beverage inventory. Other support expenses include costs associated with property-level management, utilities, sales and marketing, operating hotel spas, operating telephones, parking and other guest recreation, entertainment and other services. Property expenses include property taxes, repairs and maintenance, rent and insurance.\nDepreciation and amortization.\nThese are non-cash expenses that primarily consist of: (i) amortization of capitalized software costs; (ii) depreciation and amortization of property and equipment, including our finance lease right-of-use (\"ROU\") assets, such as buildings and furniture and equipment that are used in corporate operations or at our consolidated owned and leased hotels; (iii) amortization of management and franchise contracts acquired from third parties and (iv) amortization of intangible assets that were recorded at their fair value at the time of the 2007 transaction whereby we became a wholly owned subsidiary of affiliates of Blackstone Inc. (the \"Merger\"). As of January 1, 2022, the only remaining finite-lived intangible assets resulting from the Merger related to leases, international management contracts and our Hilton Honors guest loyalty program. The assets related to the international management contracts and Hilton Honors, which both had useful lives of 16 years, were fully amortized during the year ended December 31, 2023.\nGeneral and administrative.\nConsists primarily of compensation costs for our corporate employees, including share-based compensation; professional fees, including consulting, audit and legal fees; travel and entertainment expenses; credit losses for estimated uncollectible management, franchise and other fees; and administrative and related expenses.\n. Primarily consists of expenses incurred by our purchasing operations.\nOther expenses from managed and franchised pro",
  "item2_clean": null
}