{
  "source_file": "hlt-20250930.htm",
  "form_type": "10-Q",
  "item1_clean": null,
  "item7_clean": null,
  "item2_clean": "one of the largest global hospitality companies, with 8,995 properties comprising 1,328,821 rooms in 141 countries and territories as of September 30, 2025. Our premier brand portfolio includes luxury, lifestyle, full service, focused service and all-suites hotel brands, as well as timeshare brands. As of September 30, 2025, we had 235 million members in our award-winning guest loyalty program, Hilton Honors, an increase of 16 percent from September 30, 2024.\nSegments and Regions\nWe analyze our operations and business by both operating segments and geographic regions. Our operations consist of two reportable segments that are based on similar products and services: (i) management and franchise and (ii) ownership. The management and franchise segment provides services, including hotel management and licensing of our IP and/or the use of our booking channels and related programs. Revenues from this segment include: (i) management and franchise fees charged to third-party hotel owners; (ii) licensing fees from our strategic partners, including co-branded credit card providers and strategic partner hotels, and HGV; and (iii) fees for managing the hotels in our ownership segment. As a manager of hotels, we typically are responsible for supervising or operating the hotel in exchange for management fees. As a franchisor of hotels, we charge franchise fees in exchange for the use of one of our brand names and/or related commercial services, such as our reservations system, marketing and information technology services, while a third party manages or operates such franchised hotels. The ownership segment primarily derives revenues from nightly hotel room sales, food and beverage sales and other services at our consolidated hotels.\nWe conduct business in three distinct geographic regions: (i) the Americas; (ii) Europe, Middle East and Africa (\"EMEA\"); and (iii) Asia Pacific. The Americas region includes North America, South America and Central America, including all Caribbean nations. Although the U.S., which represented 64 percent of our system-wide hotel rooms as of September 30, 2025, is included in the Americas region, it is often analyzed separately and apart from the Americas region and, as such, it is presented separately within our hotel operating statistics in \"—Results of Operations.\" The EMEA region includes Europe, which represents the western-most peninsula of Eurasia stretching from Iceland in the west to Russia in the east, and the Middle\nEast and Africa (\"MEA\"), which represents the Middle East region and all African nations, including the Indian Ocean island nations. Europe and MEA are often analyzed separately and, as such, are presented separately within our hotel operating statistics in \"—Results of Operations.\" The Asia Pacific region includes the eastern and southeastern nations of Asia, as well as India, Australia, New Zealand and the Pacific Island nations.\nSystem Growth and Development Pipeline\nOur strategic objectives include the continued expansion of our global hotel network, in particular our fee-based business. As we enter into new management and franchise contracts and enter into strategic agreements to complement our hotel portfolio, we expand our business with limited or no capital investment by us as the manager, franchisor or licensor, since the capital required to build, renovate and maintain hotels is typically provided by the third-party owners with whom we contract to provide management services, license our IP or provide access to our booking channels and related programs. Prior to approving the addition of new hotels to our management and franchise development pipeline, we evaluate the economic viability of the hotel based on its geographic location, the credit quality of the third-party owner and other factors. By increasing the number of management and franchise contracts with third-party owners, over time we expect to increase revenues, overall return on invested capital and free cash flow. See further discussion on our cash management policy in \"—Liquidity and Capital Resources.\" The current economic environment, including elevated levels of inflation and interest rates, has posed certain challenges to the execution of our growth strategy, which in some cases have included and may continue to include delays in openings and new development.\nIn addition to our current hotel portfolio, we are focused on the growth of our business by expanding our global hotel network through our development pipeline, which represents hotels that we expect to add to our system in the future. The following table summarizes our development activity:\nDevelopment pipeline\nCount as of period end\nRounded to the nearest hundred.\nRepresents room additions, net of rooms removed from our system. Net unit growth from September 30, 2024 to September 30, 2025 was 6.5 percent.\nThe hotels in our development pipeline were under development throughout 128 countries and territories, including 26 countries and territories where we had no existing hotels, with nearly half of the rooms under construction and more than half of the rooms located outside of the U.S. Rooms under construction include rooms for hotels under construction or operating hotels that are in the process of conversion to our system. Nearly all of the rooms in our development pipeline will be in our management and franchise segment upon opening. We do not consider any individual development project to be material to us.\nKey Business and Financial Metrics Used by Management\nWe define our comparable hotels as those that were active and operating in our system for at least one full calendar year and were open January 1st of the previous year. We exclude hotels that have undergone a change in brand or ownership type or a large-scale capital project during the current or comparable periods or otherwise do not have available comparable results, such as those that have sustained substantial property damage or encountered business interruption. We exclude strategic partner hotels from our comparable hotels. Of the 8,887 hotels in our system as of September 30, 2025, 489 hotels were strategic partner hotels and 6,339 hotels were classified as comparable hotels. Our 2,059 non-comparable hotels as of September 30, 2025 included (i) 1,124 hotels that were added to our system after January 1, 2024 or that have undergone a change in brand or ownership type during the current or comparable periods reported and (ii) 935 hotels that were removed from the comparable group for the current or comparable periods reported because they underwent or are undergoing large-scale capital projects, sustained substantial property damage, encountered business interruption or comparable results were otherwise not available for them.\nOccupancy represents the total number of room nights sold divided by the total number of room nights available at a hotel or group of hotels for a given period. Occupancy measures the utilization of available capacity at a hotel or group of hotels. Management uses occupancy to gauge demand at a specific hotel or group of hotels in a given period. Occupancy levels also help management determine achievable Average Daily Rate (\"ADR\") pricing levels as demand for hotel rooms increases or decreases.\nADR\nADR represents hotel room revenue divided by the total number of room nights sold for a given period. ADR measures the average room price attained by a hotel, and ADR trends provide useful information concerning the pricing environment and the nature of the customer base of a hotel or group of hotels. ADR is a commonly used performance measure in the industry, and we use ADR to assess pricing levels that we are able to generate by type of customer, as changes in rates charged to customers have different effects on overall revenues and incremental profitability than changes in occupancy, as described above.\nRevenue per Available Room (\"RevPAR\")\nRevPAR is calculated by dividing hotel room revenue by the total number of room nights available to guests for a given period. We consider RevPAR to be a meaningful indicator of our performance as it provides a metric correlated to two primary and key drivers of operations at a hotel or group of hotels, as previously described: occupancy and ADR. RevPAR is also a useful indicator in measuring performance over comparable periods for comparable hotels.\nReferences to occupancy, ADR and RevPAR are presented on a comparable basis, based on the comparable hotels as of September 30, 2025, and references to ADR and RevPAR are presented on a currency neutral basis, unless otherwise noted. As such, comparisons of these hotel operating statistics for the three and nine months ended September 30, 2025 and 2024 use foreign currency exchange rates for the three and nine months ended September 30, 2025, respectively.\nAdjusted EBITDA is calculated as net income (loss), excluding interest expense, a provision for income tax benefit (expense) and depreciation and amortization expenses, as well as gains, losses, revenues and expenses earned or incurred in connection with: (i) asset dispositions for both consolidated and unconsolidated investments; (ii) foreign currency transactions; (iii) debt restructurings and retirements; (iv) FF&E replacement reserves required under certain lease agreements; (v) share-based compensation; (vi) reorganization, severance, relocation and other expenses; (vii) non-cash impairment; (viii) amortization of contract acquisition costs; (ix) cost reimbursement revenues and reimbursed expenses; and (x) other items.\nWe believe that Adjusted EBITDA provides useful information to investors about us and our financial condition and results of operations for the following reasons: (i) it is used by our management team to evaluate our operating performance and make day-to-day operating decisions and (ii) it is frequently used by securities analysts, investors and other interested parties as a common performance measu"
}