{
  "source_file": "holx-20250628.htm",
  "form_type": "10-Q",
  "item1_clean": null,
  "item7_clean": null,
  "item2_clean": "Management’s Discussion and Analysis of Financial Condition and Results of Operations\nCAUTIONARY STATEMENT\nSome of the statements contained in this report and documents incorporated by reference herein are forward-looking statements within the meaning of Section 27A of the Securities Act of 1933, as amended (the “Securities Act”), and Section 21E of the Securities Exchange Act of 1934, as amended (the “Exchange Act”). These statements involve known and unknown risks, uncertainties and other factors which may cause our or our industry’s actual results, performance or achievements to be materially different from any future results, performance or achievements expressed or implied by the forward-looking statements. Forward-looking statements may include, but are not limited to, statements regarding:\nthe development of new or improved competitive technologies and products;\nthe anticipated development of markets we sell our products into and the success of our products in these markets;\nour ability to predict accurately the demand for our products, and products under development and to develop strategies to address markets successfully;\nthe anticipated performance and benefits of our products;\nbusiness strategies;\nthe effect of consolidation in the healthcare industry;\nthe ability to execute acquisitions and the impact and anticipated benefits of completed acquisitions and acquisitions we may complete in the future;\nthe coverage and reimbursement decisions of third-party payors;\nthe uncertainty of the impact of cost containment efforts and federal healthcare reform legislation on our business and results of operations;\nthe guidelines, recommendations, and studies published by various organizations relating to the use of our products;\nour ability to obtain and maintain regulatory approvals and clearances for our products, including the implementation of the European Union Medical Device and In Vitro Diagnostic Regulation requirements, and maintain compliance with complex and evolving regulations and quality standards, as well as the uncertainty of costs required to obtain and maintain compliance with such regulatory and quality matters;\nthe possibility of interruptions or delays at our manufacturing facilities, or the failure to secure alternative suppliers if any of our sole source third-party manufacturers fail to supply us;\nthe possibility that products may contain undetected errors or defects or otherwise not perform as anticipated;\nthe ability to successfully manage ongoing organizational and strategic changes, including our ability to attract, motivate and retain key employees and maintain engagement and efficiency in remote work environments;\nthe impact and costs and expenses of investigative and legal proceedings and compliance risks we may be subject to now or in the future;\nthe impact of future tax legislation;\nthe ongoing and possible future effects of global challenges, including macroeconomic uncertainties, such as inflation, bank failures, rising interest rates and availability of capital markets, wars, conflicts, other economic disruptions and U.S. and global recession concerns, on our customers and suppliers and on our business, financial condition, results of operations and cash flows and our ability to draw down our revolver;\nthe effect of the worldwide political and social uncertainty and divisions, including the impact on trade regulations and tariffs, that may adversely impact the cost and sale of our products in certain countries, or increase the costs we may incur to purchase materials, parts and equipment from our suppliers;\nconducting business internationally;\npotential cybersecurity threats and targeted computer crime;\nthe ongoing and possible future effects of supply chain constraints, including the availability of critical raw materials and components, as well as cost inflation in materials, packaging and transportation;\nthe ability to consolidate certain of our manufacturing and other operations on a timely basis and within budget, without disrupting our business and to achieve anticipated cost synergies related to such actions;\npotential negative impacts resulting from climate change or other environmental, social, and governance and sustainability related matters;\nour ability to meet production and delivery schedules for our products;\nthe effect of any future public health pandemic or other crises, including the timing, scope and effect of U.S. and international governmental, regulatory, fiscal, monetary and public health responses to such crises;\nour ability to protect our intellectual property rights;\nanticipated trends relating to our financial condition or results of operations, including the impact of interest rate and foreign currency exchange fluctuations;\nestimated asset and liability values;\nour compliance with covenants contained in our debt agreements; and\nour liquidity, capital resources and the adequacy thereof.\nOVERVIEW\nWe are a developer, manufacturer and supplier of premium diagnostics products, medical imaging systems and surgical products focused on women’s health and well-being through early detection and treatment. We sell and service our products through a combination of direct sales and service personnel and a network of independent distributors and sales representatives. We operate in four segments: Diagnostics, Breast Health, GYN Surgical and Skeletal Health.\nThrough our Diagnostics segment, we offer a wide range of diagnostic products, which are used primarily to aid in the screening and diagnosis of human diseases. Our primary Diagnostics products include our molecular diagnostic assays, which run on our advanced instrumentation systems (Panther and Panther Fusion), our ThinPrep cytology system, including our Genius Digital Diagnostics System, and the Rapid Fetal Fibronectin Test. Our Aptima family of molecular diagnostic assays is used to detect, among other things, the infectious microorganisms that cause common sexually transmitted diseases, or STDs, such as chlamydia and gonorrhea, or CT/NG; certain high-risk strains of human papillomavirus, or HPV;\nTrichomonas vaginalis\n, the parasite that causes trichomoniasis; Mycoplasma genitalium; and Herpes Simplex viruses 1 and 2. We also offer viral load tests for the quantitation of Hepatitis B virus, Hepatitis C virus, human immunodeficiency virus, or HIV-1, and human cytomegalo virus, or CMV, for use on our Panther instrument system. In addition, we offer bacterial vaginosis and candida vaginitis assays for the diagnosis of vaginitis, a common and complex ailment affecting millions of women a year. Our assay portfolio also includes diagnostic tests for a range of acute respiratory infections, including SARS-CoV-2, various strains of influenza and parainfluenza, and respiratory syncytial virus, as well as a test for the detection of Group B Streptococcus, or GBS, that are run on the Panther Fusion system, a field upgradeable instrument addition to the base Panther system. In response to the COVID-19 pandemic, we developed and launched the Aptima SARS-CoV-2 assay and the Aptima SARS-CoV-2/Flu assay (each of which runs on our standard Panther system) and the Panther Fusion SARS-CoV-2 assay and the Panther Fusion SARS-CoV-2/Flu A/B/RSV assay (which run on our Panther Fusion system). In May 2022, we obtained CE-marking for two new molecular assays, Panther Fusion EBV Quant assay for quantitation of Epstein-Barr virus, and the Panther Fusion BKV Quant assay for quantitation of the BK virus. These two assays are the first quantitative real-time PCR assays on the Panther Fusion system, and, together with the Aptima CMV Quant assay, expand our menu of transplant monitoring assays. The ThinPrep System is primarily used in cytology applications, such as cervical cancer screening, and the Rapid Fetal Fibronectin Test assists physicians in assessing the risk of pre-term birth. We also generate service revenues from our CLIA-certified laboratory for testing related to breast cancer and all metastatic cancers.\nOur Breast Health segment offers a broad portfolio of solutions for breast imaging, biopsy, breast surgery and pathology. These solutions include 3D digital mammography systems, image analysis software utilizing artificial intelligence, reading\nworkstations, minimally invasive breast biopsy guidance systems, breast biopsy site markers, localization, and specimen radiology systems. Our most advanced breast imaging platforms, Selenia 3D Dimensions and 3Dimensions systems, utilize tomosynthesis to produce 3D images that show multiple contiguous slice images of the breast.\nOur GYN Surgical products include our MyoSure hysteroscopic tissue removal system, our NovaSure endometrial ablation system, our Fluent fluid management system, our Acessa ProVu laparoscopic radiofrequency ablation system, our Gynesonics Sonata intrauterine imaging and transcervical treatment system as well as our CoolSeal vessel sealing portfolio and our JustRight surgical stapler. The MyoSure suite of devices offers four options to provide incision-less removal of fibroids, polyps, and other pathology within the uterus. The NovaSure portfolio is comprised of the NovaSure ADVANCED device and the NovaSure V5 device for the treatment of abnormal uterine bleeding. The Fluent and Fluent Pro fluid management system provides liquid distention during diagnostic and operative hysteroscopic procedures. The Acessa ProVu system is a fully integrated system that uses laparoscopic ultrasound, guidance mapping and radiofrequency ablation to treat nearly all types of fibroids. The Sonata system uses ultrasound and radiofrequency energy to treat fibroids. The CoolSeal portfolio includes the CoolSeal Trinity, CoolSeal Reveal, and CoolSeal Mini advanced bipolar vessel sealing devices. The JustRight 5 mm stapler features a smaller instrument profile and is used for laparoscopic general and pediatric surgery.\nOur Skeletal Health segment’s products include the Horizon DXA, a"
}