{
  "source_file": "hon-20250930.htm",
  "form_type": "10-Q",
  "item1_clean": null,
  "item7_clean": null,
  "item2_clean": "ITEM 2. MANAGEMENT'S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS\n(Dollars in tables and graphs in millions, except per share amounts)\nBUSINESS UPDATE\nMACROECONOMIC CONDITIONS\nWe continue to monitor macroeconomic and geopolitical developments amid heightened trade tensions, economic and trade policy uncertainty, and inflationary risks. Trade policy volatility during 2025, including new tariffs and, in some cases, subsequent rollbacks or suspensions, could impact global growth and contribute to inflationary pressures. Global conflicts, tariffs, labor disruptions, and regulations continue to generate volatility in global markets and contribute to supply chain vulnerabilities and pricing fluctuations. We remain proactive in our collaboration with suppliers to minimize shortages and mitigate supply chain and pricing volatility.\nMitigation strategies remain crucial to meet customer demand in this evolving environment. Our mitigation strategies include supply chain simplification, continued alignment to local supply sources, pricing actions and dual source strategies, long-term strategies for constrained materials, direct engagement with key suppliers, and new supplier development. Strong relationships with strategic primary and secondary suppliers allow us to collaborate to reliably source key components and raw materials, develop new products, commit our resources to assist certain suppliers, and at times, alter designs of existing products. We believe these mitigation strategies enable us to reduce supply risk, foster new product innovation, and expand our market presence. Additionally, due to the stringent quality controls and product qualification we perform on any new or altered product, these mitigation strategies have not impacted, and we do not expect them to impact, product quality or reliability.\nTo date, our strategies helped minimize our exposure to these conditions. However, if we are not successful in sustaining or executing these strategies, these macroeconomic conditions could have a material adverse effect on our consolidated results of operations, cash flows, or financial condition.\nPORTFOLIO TRANSFORMATION\nWe continually assess the relative strength of each business in our portfolio as to strategic fit, market position, profit, and cash flow contribution in order to identify target investment and acquisition opportunities in order to upgrade our combined portfolio. We also identify businesses that do not fit into our long-term strategic plan based on their market position, relative profitability, or growth potential. During the second quarter of 2025, we completed the divestiture of our PPE business, as well as closed on the acquisition of Sundyne. We also announced our agreement to acquire Johnson Matthey's Catalyst Technologies business segment.\nOn October 8, 2024, we announced our intention to spin off our Advanced Materials business into Solstice Advanced Materials, Inc. (Solstice), an independent, U.S. publicly traded company. The spin-off will be a tax-free spin to Honeywell shareowners for U.S. federal income tax purposes. On October 1, 2025, we announced that our Board approved a record date of October 17, 2025 (Record Date) for the pro rata distribution of all of the issued and outstanding shares of Solstice to the holders of our common stock as of the close of business on the Record Date (Eligible Holders). On October 16, 2025, we announced that the Board approved the spin-off, which will be effective as of 12:01 a.m. (New York City time) on October 30, 2025 (Distribution Date). On the Distribution Date, the Eligible Holders will receive one share of Solstice common stock for every four shares of our common stock they hold as of the close of business on the Record Date. Completion of the Distribution is conditioned upon the satisfaction or waiver of certain conditions, as set forth in the form of Separation and Distribution Agreement filed with the SEC as part of the registration statement on Form 10 filed by Solstice, which was declared effective by the SEC on September 30, 2025.\nHoneywell International Inc.\nOn February 6, 2025, we announced our intention to pursue a separation of our Automation and Aerospace Technologies businesses into independent, U.S. publicly traded companies, which is expected to be completed in the second half of 2026. The planned separation is intended to be a tax-free separation to Honeywell shareowners for U.S. federal income tax purposes. The separation will be subject to the satisfaction of a number of customary conditions, including, among others, the filing and effectiveness of applicable filings (including a Form 10 registration statement that includes required financial statements) with the SEC, assurance that the separation of the businesses will be tax-free to Honeywell’s shareowners, receipt of applicable regulatory approvals, and final approval by our Board. The proposed separation is complex in nature, and may be affected by unanticipated developments, credit and equity markets, or changes in market conditions.\nOn July 8, 2025, we announced we are evaluating strategic alternatives for our Productivity Solutions and Services and Warehouse and Workflow Solutions businesses within the Industrial Automation reportable segment to further simplify Honeywell's portfolio and accelerate shareowner value creation ahead of our planned separation into three independent, U.S. publicly traded companies.\nLIABILITY MANAGEMENT REORGANIZATION\nOn June 23, 2025, we completed our previously announced reorganization (the “Liability Management Reorganization”) in connection with which: (i) certain of our asbestos-related assets and liabilities were allocated to a separate, wholly owned entity, (ii) certain assets and liabilities associated with certain sites for which we had or may have had environmental liabilities were allocated to a separate, wholly owned entity, (iii) certain assets and liabilities associated with certain other sites (not included in clause (ii) above) for which we had or may have had environmental liabilities were allocated to a separate, wholly owned entity, and (iv) all of our remaining assets and liabilities (i.e., all assets and liabilities not included in clauses (i)-(iii) above) were allocated to the Company. The reorganization is intended to provide us flexibility with respect to managing certain asbestos, environmental, and other liabilities, including any future strategic transactions involving such liabilities, and enable us to focus on our operating business, while efficiently managing potential asbestos liabilities, existing or future environmental liabilities and remediation obligations, and certain other liabilities.\nOn September 29, 2025, we permanently divested all of our legacy Bendix asbestos liabilities and certain non-Bendix asbestos liabilities (referenced in clause (i) above). We recorded a pre-tax loss of $148 million in the third quarter of 2025 related to the divested asbestos liabilities. Under the terms of the divestiture agreement, we contributed $1.4 billion in cash and derecognized $1.5 billion in asbestos liabilities and $0.1 billion of related insurance assets on September 29, 2025, which is after our quarter-end close date of September 27, 2025.\nSEGMENT REALIGNMENT\nIn October 2025, we announced a planned realignment, expected to be effective in the first quarter of 2026, of our business units comprising our Industrial Automation and Energy and Sustainability Solutions reportable business segments. This realignment will form a new reportable business segment, Process Automation and Technology, and result in a new composition of our Industrial Automation reportable business segment. Process Automation and Technology will be comprised of UOP, which is currently in Energy and Sustainability Solutions, and the core portion of the Process Solutions business, which is currently in Industrial Automation. The new composition of Industrial Automation will continue to include the smart energy, thermal solutions, and process measurement and control businesses, currently included in the Process Solutions business, as well as the Sensing and Safety Technologies, Warehouse and Workflow Solutions, and Productivity Solutions and Services businesses. Following the realignment, our reportable business segments will be Aerospace Technologies, Building Automation, Process Automation and Technology, and Industrial Automation. The realignment will not impact our historical consolidated financial position, results of operations, or cash flows. We expects to report our financial performance based on this realignment effective with the first quarter of 2026.\nHoneywell International Inc.\nRESULTS OF OPERATIONS\nConsolidated Financial Results\nHoneywell International Inc.\nNet Sales by Segment\n\nOrganic sales % change, presented for all of our reportable business segments, is defined as the change in Net sales, excluding the impact on sales from foreign currency translation and acquisitions, net of divestitures, for the first 12 months following the transaction date. We believe this non-GAAP measure is useful to investors and management in understanding the ongoing operations and analysis of ongoing operating trends.\nQ3 2025 compared to Q3 2024\nSales increased $599 million due to higher organic sales of $327 million in Commercial Aviation Aftermarket and higher organic sales of $147 million in Defense and Space, both driven by higher sales volumes due to increased demand and shipments. Additionally, the acquisitions of CAES and Civitanavi Systems contributed $108 million of inorganic sales in the three months ended September 30, 2025. Beginning September 2025, the results of CAES and Civitanavi Systems are considered organic following the first 12 months after the transaction date.\nHoneywell International Inc.\nSegment profit increased $96 million and segment margin percentage decreased 160 basis points to 26.1% compared "
}