{
  "source_file": "hood-20250930.htm",
  "form_type": "10-Q",
  "item1_clean": null,
  "item7_clean": null,
  "item2_clean": "ITEM 2. MANAGEMENT’S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS\nData as of and for the three and nine months ended September 30, 2024 and 2025 has been derived from our unaudited condensed consolidated financial statements appearing at the beginning of this Quarterly Report. Results for any interim period should not be construed as an inference of what our results would be for any full fiscal year or future period.\nWe refer to our “users” and our “customers” interchangeably throughout this Quarterly Report to refer to individuals who hold accounts on our platforms.\nKey Performance Metrics\nIn addition to the measures presented in our unaudited condensed consolidated financial statements, we use the following key performance metrics to help us evaluate our business, identify trends affecting our business, formulate business plans, and make strategic decisions.\nWe define a Funded Customer as a unique person who has at least one account with a Robinhood entity and, within the past 45 calendar days (a) had an account balance that was greater than zero (excluding amounts that are deposited into a Funded Customer account by the Company with no action taken by the unique person) or (b) completed a transaction using any such account.\nIndividuals who share a funded joint investing account (which launched in July 2024) are each considered to be a Funded Customer. Starting in Q1 2025, individuals who are customers of RIAs that use the TradePMR platform, and, starting in June 2025, customers of Bitstamp, are also considered Funded Customers.\nTotal Platform Assets\nWe define Total Platform Assets as the sum of the fair value of all equities, options, cryptocurrency, futures (including options on futures, swaps, and event contracts), cash held by users in their accounts, net of receivables from users (previously reported as Assets Under Custody), and any such assets managed by RIAs using TradePMR’s platform that are not custodied by Robinhood, as of a stated date or period end on a trade date basis. Net Deposits and net market gains (losses) drive the change in Total Platform Assets in\nany given period. Starting in June 2025, the fair value of all cryptocurrency includes cryptocurrency on Bitstamp.\nWe define Net Deposits as all cash deposits and asset transfers from customers, as well as dividends, interest, and cash or assets earned in connection with Company promotions (such as account transfer and retirement match incentives, free stock bonuses, and lending and staking rewards by Bitstamp) received by customers, net of reversals, customer cash withdrawals, margin interest, Robinhood Gold subscription fees, and assets transferred off of our platforms for a stated period.\nStarting in June 2025, Net Deposits include results from Bitstamp. Due to data limitations, we have not included TradePMR client figures in our Net Deposits\nkey performance metric\nAverage Revenue Per User (“ARPU”)\n: We define ARPU as total revenue for a given period divided by the average number of Funded Customers on the last day of that period and the last day of the immediately preceding period. Figures in this Quarterly Report represent ARPU annualized for each three-month period presented.\nRobinhood Gold Subscribers:\nWe define a Robinhood Gold Subscriber as a unique person who has at least one account with a Robinhood entity and who, as of the end of the relevant period (a) is subscribed to Robinhood Gold and (b) has made at least one Robinhood Gold subscription fee payment.\nAutomated Customer Account Transfer Service (“ACATS”)\n: A system that automates and standardizes procedures for the transfer of assets in a customer account from one brokerage firm and/or bank to another.\n: We define Cash Sweep as the period-end total amount of participating users’ uninvested brokerage cash that has been automatically “swept” or moved from their brokerage accounts into deposits for their benefit at a network of program banks. This is an off-balance-sheet amount. Robinhood earns a net interest spread on Cash Sweep balances based on the interest rate offered by the banks less the interest rate given to users as stated in our program terms.\nThis includes balances from customers of RIAs using TradePMR\nA Funded Customer is considered “Churned” if it was ever a New Funded Customer whose account balance (measured as the fair value of assets in the account less any amount due from the user and excluding amounts that are deposited into a Funded Customer account by the Company with no action taken by the unique person) drops to or below zero and has not completed a transaction using any account with a Robinhood entity for at least 45 consecutive calendar days. Negative balances typically result from Fraudulent Deposit Transactions (which occur when users initiate deposits into their accounts, make trades on our platforms using a short-term extension of credit from us, and then repatriate or reverse the deposits, resulting in a loss to us of the credited amount) and unauthorized debit card use, and less often, from margin loans.\nGrowth Rate and Annualized Growth Rate with respect to Net Deposits:\nGrowth rate is calculated as aggregate Net Deposits over a specified 12-month period, divided by Total Platform Assets for the fiscal quarter that immediately precedes such 12-month period. Annualized growth rate is calculated as Net Deposits for a specified quarter multiplied by 4 and divided by Total Platform Assets for the immediately preceding quarter.\nInvestment Accounts:\nWe define an Investment Account as a funded individual brokerage account, a funded joint investing account, a funded individual retirement account (“IRA”), or an account with an RIA using TradePMR’s platform. As of September 30, 2025, a Funded Customer\ncan have multiple Investment Accounts - one or more individual brokerage accounts, a joint investing account, a traditional IRA, a Roth IRA, and/or an RIA custody account using TradePMR’s platform. Investment Accounts do not include Bitstamp as such accounts are not brokerage or other Investment Accounts.\nWe define Margin Book as our period-end aggregate outstanding margin loan balances receivable (i.e., the period-end total amount we are owed by customers on loans made for the purchase of securities, supported by a pledge of assets in their margin-enabled brokerage accounts).\nThis includes margin loan balances from customers of RIAs using TradePMR\nNew Funded Customers:\nWe define a New Funded Customer as a unique person who became a Funded Customer for the first time during the relevant period.\nNotional Trading Volume:\nWe define Notional Trading Volume, or Notional Volume, for any specified asset class as the aggregate dollar value (purchase price or sale price as applicable) of trades executed in that asset class on our platforms over a specified period of time. Crypto Notional Volume includes both Robinhood App Notional Volume and, starting in June 2025, Bitstamp Notional Volume. Robinhood App Notional Volume represents the dollar value of executed crypto trades on the Robinhood platform over a specified period of time. Bitstamp Notional Volume represents the dollar value of executed crypto trades on the Bitstamp platform over a specified period of time. For example, each $1 of transaction value executed between a buyer and seller is counted as $1 of transaction value in the relevant period, rather than $2 if counted for each of the buyer and seller.\nOptions Contracts Traded:\nWe define Options Contracts Traded as the total number of options contracts bought or sold over a specified period of time. Each contract generally entitles the holder to trade 100 shares of the underlying stock.\nResurrected Customers:\nA Funded Customer is considered “Resurrected” in a stated period if it was a Churned Customer as of the end of the immediately preceding period and its balance (excluding amounts that are deposited into a Funded Customer account by the Company with no action taken by the unique person) rises above zero or it completes a transaction using its account.\nRobinhood was founded on the belief that everyone should be welcome to participate in our financial system. We are creating modern financial services platforms for everyone, regardless of their wealth, income, or background.\nOur mission is to democratize finance for all. We use technology to provide access to the financial system in a way that is simple and convenient for our customers. We believe investing should be familiar and welcoming, with a simple design and an intuitive interface, so that customers are empowered to achieve their goals. We started with a revolutionary, bold brand and design in the Robinhood app which makes investing approachable for millions. Over the last decade, we have disrupted and changed the industry, becoming the first U.S. retail broker to offer commission-free stock trading with no account minimums, which was subsequently adopted by the rest of the industry. In recent years, we have continued to build relationships with our customers by introducing new products and diversifying our services that further expand access to the financial system, including focusing on products and tools for more seasoned investors. Through these efforts, we believe we have made investing culturally relevant and understandable, and that our platforms are enabling our customers to become long-term investors and take greater control of their finances.\nFinancial Results and Performance\nWith respect to the three months ended September 30, 2025, as compared to the three months ended September 30, 2024:\ntotal net revenues increased 100% to $1,274 million compared to $637 million;\nnet income increased 271% to $556 million, compared to $150 million;\ndiluted EPS increased 259% to $0.61 compared to $0.17;\ntotal operating expenses increased 31% to $639 million compared to $486 million;\nSBC expense decreased 1% to\n\nfor the three and nine months ended September 30, 2025 primarily due "
}