{
  "source_file": "hpe-20241031.htm",
  "form_type": "10-K",
  "item1_clean": "Over the last several years, new megatrends around edge, cloud, data, and artificial intelligence (“AI”) have emerged to shape customer expectations for enterprise technology. First, data at the edge is increasing exponentially, driven by the proliferation of devices that require secure connectivity to enable reliable digital experiences. Second, enterprises need a cloud experience everywhere to manage data and workloads wherever they live across a distributed enterprise. Third, data growth is creating countless new opportunities to generate meaningful business insights. Finally, HPE is seeing a significant technology shift as customers realize the fundamental potential of AI technology to deliver business transformation.\nIn concert with these trends, enterprises are consuming their technology differently. Increasingly, customers want to digitally transform while preserving capital and eliminating operating expense by paying only for the information technology (“IT”) they use.\nThe megatrends are ushering in long-lasting changes to IT, including accelerating hybrid multi-cloud adoption. Customers across industry verticals are interested in unifying all the applications and data with a consistent cloud experience.\nCustomers also want to better extract value from their growing stores of rapidly evolving data, knowing that actionable insights from data are critical to deliver business transformations. Data is becoming more unstructured, more time-sensitive, and more distributed. Frequently, data is siloed and spread across different multi-generational IT systems, often trapped in critical legacy architecture. Many organizations cannot adequately gain insights from their data at the edge or face cloud migration challenges because of their legacy applications. Customers need a data-first modernization approach across edge to data center to cloud.\nHPE has deployed an edge-to-cloud strategy that capitalizes on emergent megatrends and delivers a data-first modernization approach for customers. Our vision to be the edge-to-cloud company has led us to innovate our solutions across networking connectivity, cloud, and data, delivered as-a-service (“aaS”) through the HPE GreenLake cloud. We have shifted our mix of products and services, and how we deliver that mix to customers. HPE has evolved to a platform-based model, fueled by a portfolio richer in software and services. In hybrid cloud, we have redefined the cloud space by delivering an experience that is hybrid by design with our HPE GreenLake cloud as the centerpiece of our strategy; it accelerates multi-generation IT transformation through a unified cloud-native and AI-driven experience that empowers customers to access, analyze, and extract value from their data across public clouds, data centers, colocation facilities, and at the edge. The AI market requires a modern and high-performing networking fabric as a core foundation to deliver a more efficient data-center cloud, which we offer through our AI-driven portfolio of networking solutions. Our server business supports both traditional servers and those meant to enable AI workloads with decades of large-scale infrastructure expertise, including technologies like direct liquid cooling that are powering some of our largest AI systems. Our Financial Services (“FS”) business complements our solution offerings by helping customers unlock financial capacity.\nWe recognize the AI market will be driven by computational capability, data-intensive workloads, and the need for specialized architecture; thus, we have been targeting, and continue to target three areas: supercomputing, AI infrastructure, and AI platform software. We seek to seize this AI market opportunity by innovating in networking, hybrid cloud and AI – which are all essential building blocks to deliver a unified technology experience. We believe that we are differentiated from our competition by our unique and compelling value proposition, which positions us to capture significant value from the growing AI market through our intellectual property portfolio, trusted expertise, and long-term sustained market leadership in supercomputing.\nThe pending acquisition of Juniper Networks, Inc. (\"Juniper Networks\") further supports the aforementioned strategies and enables us to execute on them. We believe this acquisition will accelerate our edge-to-cloud vision with a full networking IP stack: from silicon, to infrastructure, to the operating system, to security, to software and services, in a cloud-native and AI-\ndriven approach. Furthermore, through this strategic acquisition, we seek to deliver secure, AI-driven networking solutions, which will be foundational to delivering fully integrated hybrid cloud and AI solutions.\nOur Business Segments, Products and Services\nOur operations are organized into five reportable business segments: Server, Hybrid Cloud, Intelligent Edge, Financial Services, and Corporate Investments and Other. The class of similar product categories within each segment which accounted for more than 10% of our consolidated net revenue in each of the past three years was as follows:\nFiscal 2024 - Server products, Server services, Intelligent Edge products, Hybrid Cloud products\nFiscal 2023 - Server products, Intelligent Edge products, Server services, Hybrid Cloud products\nFiscal 2022 - Server products, Server services, Hybrid Cloud products, Intelligent Edge products\n\nWe utilize a significant number of outsourced and contract manufacturers around the world to manufacture products that we design. The use of outsourced and contract manufacturers is intended to generate cost efficiencies and reduce time to market for our products as well as create manufacturing flexibility in our supply chain and processes. In some circumstances, third-party OEMs produce products that we purchase and resell under our brand. In addition to our use of outsourced and contract manufacturers, we currently manufacture a limited number of finished products from components and subassemblies that we acquire from a wide range of vendors.\nHistorically, we have utilized two primary methods of fulfilling demand for products: building products to order and configuring products to order. We build products to order to maximize manufacturing and logistics efficiencies by producing high volumes of basic product configurations. Alternatively, configuring products to order enables units to match a customer's particular hardware and software customization requirements. Our inventory management and distribution practices in both building products to order and configuring products to order seek to minimize inventory holding periods by taking delivery of the inventory and manufacturing shortly before the sale or distribution of products to our customers.\nWe purchase materials, supplies, and product subassemblies from a substantial number of vendors. For most of our products, we have existing alternate sources of supply or such alternate sources of supply are readily available. However, we do rely on single-source suppliers for certain customized parts (although some of these sources have operations in multiple locations in the event of a disruption) and a disruption or loss of a single-source supplier could delay production of some products. In some instances, our single-source suppliers (e.g., Intel and AMD as suppliers of certain x86 processors) are also the single-source suppliers for the entire market; disruptions with these suppliers would result in industry-wide dislocations and therefore would not disproportionately disadvantage us relative to our competitors.\nWe rely on proactive inventory buffering measures in order to position ourselves well for availability of those components. We intend to take additional inventory actions as appropriate in alignment to the market demand, and plan to continue leveraging strong partnerships and long-term agreements with our suppliers.\nBacklog represents the price of orders related to current or prior periods for which work has not been performed or goods have not been delivered as of the reporting period. Orders reflected in backlog are subject to adjustment, including as a result of re-bookings, cancellations and fulfillment issues, which may impact backlog.\nThe adverse impact of the global pandemic on the supply chain has moderated, resulting in a more balanced supply-and-demand environment and improved component availability. Challenges in global logistics have mostly normalized despite some uncertainty related to regional conflicts and port labor disputes. Our overall demand pipeline has improved since the beginning of fiscal 2024 as customers have been digesting through their inventory. Even though demand across our AI product portfolio, including for high performance graphics and accelerated processing units, continues to be somewhat uneven, due to the lumpiness of deals that can cause fluctuations quarter-to-quarter, AI systems demand in the midst of persisting data center space availability constraints continued to drive significant AI backlog. The supply and demand environment for GPUs continues to remain uneven as the market navigates transition to next generation GPUs. These dynamics have resulted in our inventory levels being elevated as compared to the fiscal year ended October 31, 2023, and we are closely monitoring inventory levels as the market navigates a transition to next-generation GPUs.\nOur products and services are available worldwide. We believe geographic diversity allows us to meet demand on a worldwide basis for our customers, draws on business and technical expertise from a worldwide workforce, provides stability to our operations, provides revenue streams that may offset geographic economic trends, and offers us an opportunity to access new markets for maturing products.\nA summary of our domestic and international results is set forth in Note 2, “Segment Information,” to our Consolidated Financial Statements in Item 8 of Part II. Approximately 64% of our overall net revenue in fiscal 2024 came from sales outside the United States.\nResearch and Development\nInnovation is a key element of our culture and critical to our success. Our research and development efforts (“R&D”) are focused on designing and developing products, services, and solutions that anticipate customers' changing needs and desires and emerging technological trends. Our efforts also are focused on identifying the areas where we believe we can make a unique contribution and where partnering with other leading technology companies will leverage our cost structure and maximize our customers' experiences.\nExpenditures for R&D were $2.2 billion in fiscal 2024, $2.3 billion fiscal 2023, and $2.0 billion in fiscal 2022. We anticipate that we will continue to have significant R&D expenditures in the future to support the design and development of innovative, high-quality products, services, and solutions to maintain and enhance our competitive position.\nIncluded in the R&D work currently taking place at the Company are the following initiatives:\nIn Server, we are developing high-quality next-generation compute solutions that encompass servers, server-attached options, and software, integrating the latest industry technology and aligning with our customers' evolving needs. Furthermore, we are advancing our SaaS capabilities by creating cloud-native, cloud-based server management solutions to enhance our existing portfolio. In the high performance computing and AI sector, our investments are focused on pioneering leadership computing solutions that deliver superior performance and efficiency. These solutions feature leading edge silicon architectures, high-speed interconnects, advanced storage and innovative direct liquid cooling. Our R&D efforts in the realm of AI are particularly robust, with new server solutions designed for AI inference engines and integrated into larger HPE Private Cloud AI for inferencing, retrieval au",
  "item7_clean": "Cost of sales (exclusive of amortization shown separately below)\nResearch and development\nSelling, general and administrative\nAmortization of intangible assets\nImpairment of goodwill\nTransformation costs\nAcquisition, disposition and other related charges\nEarnings from operations\nInterest and other, net\nGain on sale of equity interest\nEarnings from equity interests\nEarnings before provision for taxes\nNet earnings attributable to HPE\nPreferred stock dividends\nNet earnings attributable to common stockholders\nFiscal 2024 compared with fiscal 2023\nIn fiscal 2024, total net revenue of $30.1 billion represented an increase of $992 million, or 3.4% (increased 3.3% on a constant currency basis). U.S. net revenue increased by $521 million, or 5.0% to $10.9 billion, and net revenue from outside of the U.S. increased by $471 million, or 2.5%, to $19.2 billion.\nThe components of the weighted net revenue change by segment were as follows:\nFor the fiscal years ended October 31,\nCorporate Investments and Other\nElimination of intersegment net revenue and other\nHEWLETT PACKARD ENTERPRISE COMPANY AND SUBSIDIARIES\nManagement's Discussion and Analysis of\nFinancial Condition and Results of Operations (Continued)\nFiscal 2024 compared with fiscal 2023\nFrom a segment perspective, the primary factors contributing to the change in total net revenue are summarized as follows:\nServer net revenue increased $1,844 million, or 12.8%, primarily due to higher AUPs\nHybrid Cloud net revenue decreased $107 million, or 1.9%, primarily due to lower AUPs\nIntelligent Edge net revenue decreased $847 million, or 15.7%, primarily due to lower volume and product mix effect\nFinancial Services net revenue increased $32 million, or 0.9%, primarily due to higher finance income\nCorporate Investments and Other net revenue increased $29 million, or 2.9%, primarily due to revenue growth from Advisory and Professional Services (“A & PS”)\nFiscal 2023 compared with fiscal 2022\nFrom a segment perspective, the primary factors contributing to the change in total net revenue are summarized as follows:\nServer net revenue decreased $1,111 million, or 7.2%, primarily due to lower server unit volume and unfavorable currency fluctuations\nHybrid Cloud net revenue increased $260 million, or 5.0%, primarily due to higher unit volume\nIntelligent Edge net revenue increased $1,522 million, or 39.5%, primarily due to increased AUPs and volume and product mix effect\nFinancial Services net revenue increased $141 million, or 4.2%, primarily due to higher rental revenue from higher average operating leases and higher finance income on finance leases due to an increasing interest rate environment\nCorporate Investments and Other net revenue decreased $27 million, or 2.7%, primarily due to unfavorable currency fluctuations\nFiscal 2024 total gross profit margin of 32.8% represents a decrease of 2.3 percentage points as compared to the respective prior year period. The decrease was primarily due to decline in revenue in the Intelligent Edge segment and higher mix of lower margin products in the Server segment.\nResearch and development (“R&D”)\nR&D expense decreased by $103 million, or 4.4%, primarily due to capitalization of software costs, which contributed 4.2 percentage points to the change.\nSelling, general and administrative (“SG&A”)\nSG&A expense decreased by $289 million, or 5.6%, primarily due to lower employee costs, which contributed 3.3 percentage points, lower travel and marketing expenses and lower consulting costs, both of which contributed 1.4 percentage points to the change.\nTransformation programs and costs\nOur transformation programs consist of the Cost Optimization and Prioritization Plan (launched in 2020) and the HPE Next Plan (launched in 2017).\nTransformation costs\ndecreased by $190 million, or 67.1%, due to lower charges incurred in the current period as the primary elements of these plans have been substantially completed by the end of fiscal 2023. Refer to Note 3, “Transformation Programs” to the Consolidated Financial Statements in Item 8 of Part II for further discussion.\nAcquisition, disposition and other related charges\nAcquisition, disposition and other related charges increased by $135 million or 195.7%, primarily due to costs incurred in connection with the pending acquisition of Juniper Networks.\nHEWLETT PACKARD ENTERPRISE COMPANY AND SUBSIDIARIES\nManagement's Discussion and Analysis of\nFinancial Condition and Results of Operations (Continued)\nInterest and other, net\nInterest and other, net expense increased by $13 million or 12.5%, primarily due to lower gain from sale of certain investments and unfavorable currency fluctuations in the current year and the previous year containing tax indemnification income due to an audit settlement. The increase was partially offset by a decrease in net interest expense and lower loss on equity investments in the current year.\nGain on sale of equity interest\nOn September 4, 2024, the Company divested 30% of the total issued share capital of H3C to UNIS. We continue to possess the option to sell the remaining 19% of the total issued share capital of H3C at a later date. In connection with this sale, we recorded a gain on sale of equity interest of $733 million.\nEarnings from equity interests\nIn fiscal 2024, Earnings from equity interests decreased by $98 million or 40%, primarily due to lower net income earned by H3C and the disposition of 30% of the total issued share capital of H3C, partially offset by lower amortization expense from basis difference in the current period.\nFor fiscal 2024 and 2023, we recorded income tax expense of $374 million and $205 million, respectively, which reflect effective tax rates of 12.7% and 9.2%, respectively. Our effective tax rate generally differs from the U.S. federal statutory rate of 21% due to favorable tax rates associated with certain earnings from our operations in lower tax jurisdictions throughout the world but may also be materially impacted by discrete tax adjustments during the fiscal year. The jurisdictions with favorable tax rates that had the most significant impact on our effective tax rate in the periods presented include Puerto Rico and Singapore.\nIn fiscal 2024, we recorded $43 million of net income tax charges related to items discrete to the year. These amounts primarily included:\n$104 million of net income tax charges resulting from the gain on the H3C divestiture, which includes $215 million of U.S. and foreign income tax charges offset by $111 million of income tax benefit for the release of an uncertain tax benefit related to the prior divestiture, partially offset by\n$54 million of income tax benefits related to transformation costs, and acquisition, disposition and other related charges and\n$11 million of net excess tax benefits related to stock-based compensation.\nIn fiscal 2023, we recorded $131 million of net income tax benefits related to items discrete to the year. These amounts primarily included:\n$104 million of income tax benefits related to transformation costs and acquisition, disposition and other related charges and\n$19 million of net excess tax benefits related to stock-based compensation.\nHewlett Packard Enterprise's organizational structure is based on a number of factors that the Chief Operating Decision Maker, who is the CEO, uses to evaluate, view, and run our business operations, which include, but are not limited to, customer base and homogeneity of products and technology. The segments are based on this organizational structure and information reviewed by Hewlett Packard Enterprise's management to evaluate segment results.\nA description of the products and services for each segment, along with other pertinent information related to Segments can be found in Note 2, “Segment Information,” to the Consolidated Financial Statements in Item 8 of Part II.\nHEWLETT PACKARD ENTERPRISE COMPANY AND SUBSIDIARIES\nManagement's Discussion and Analysis of\nFinancial Condition and Results of Operations (Continued)\nThe following provides an overview of our key financial metrics by segment for fiscal 2024 as compared to fiscal 2023:\nHPE\nInvestments and Other\nDollars in millions, except for per share amounts\nYear-over-year change %\nEarnings (loss) from operations\nEarnings (loss) from operations as a % of net revenue\nYear-over-year change percentage points\nHPE consolidated net revenue excludes inter-segment net revenue.\nSegment earnings from operations exclude certain unallocated corporate costs and eliminations, stock-based compensation expense, amortization of intangible assets, impairment of goodwill, transformation costs, disaster charges, divestiture related exit costs, and acquisition, disposition and other related charges.\n\nEarnings from operations\nEarnings from operations as a % of net revenue\nFiscal 2024 compared with fiscal 2023\nServer net revenue increased by $1,844 million, or 12.8% in actual dollars and constant currency, primarily due to a $1,812 million, or 16.7%, increase in product revenue. The increase in product revenue was primarily due to higher AUPs of $1,769 million, or 16.3%.\nServer earnings from operations as a percentage of net revenue decreased 1.5 percentage points primarily due to an increase in costs of products as a percentage of net revenue, moderated by a decrease in operating expenses as a percentage of net revenue. The increase in costs of products as a percentage of net revenue was primarily due to higher mix of lower margin products and competitive pricing pressure. The decrease in operating expenses as a percentage of net revenue was primarily due to lower total operating expenses as a result of cost containment measures.\nFiscal 2023 compared with fiscal\nServer net revenue decreased by $1,111 million, or 7.2% (decreased 3.5% on a constant currency basis), primarily due to a $1,061 million, or 8.9%, decrease in product revenue. The decline in product revenue was primarily due to lower server unit volume of $1,281 million, or 10.7%, and unfavorable currency fluctuations of $458 million, or 3.8%. The product revenue decline was moderated by an increase in AUPs of $683 million, or 5.7%, led by higher sales of server configurations with more complex component architectures in our next generation products.\nServer earnings from operations as a percentage of net revenue remained relatively flat.\nHEWLETT PACKARD ENTERPRISE COMPANY AND SUBSIDIARIES\nManagement's Discussion and Analysis of\nFinancial Condition and Results of Operations (Continued)\n\nEarnings from operations\nEarnings from operations as a % of net revenue\nFiscal 2024 compared with fiscal 2023\nHybrid Cloud net revenue decreased\nby $107 million, or 1.9%\n(decreased 2.0% on a constant currency basis) primarily due to a decrease in AUPs, partially offset by an increase in unit volume. Hybrid Cloud product revenue decreased $267 million, or 8.1%, primarily due to a decrease in AUPs of $831 million, or 25.2%, led by private cloud and storage products, partially offset by a unit volume increase of $543 million or 16.5%, led by private cloud and storage products. Hybrid Cloud services revenue increased by $160 million, or 7.3%, primarily due to a unit volume increase of $275 million, or 12.5%, led by private cloud and infrastructure SaaS. This increase was partially offset by lower AUPs of $107 million, or 4.9%.\nHybrid Cloud earnings from operations as a percentage of net revenue remained relatively flat as compared to the prior-year period.\nFiscal 2023 compared with fiscal 2022\nHybrid Cloud net revenue increased by $260 million, or 5.0% (increased 8.2% on a constant currency basis) primarily due to an increase in unit volume, partially offset by unfavorable currency fluctuations and decrease in AUPs. Hybrid Cloud product revenue increased by $180 million, or 5.8%, primarily due to an increase in unit volume of $371 million or 11.9%, led by private cloud and infrastructure SaaS. The increase in product revenue was moderated by unfavorable currency fluctuations of $130 million or 4.2%, and a decrease in AUPs of $39 million or 1.3%. Hybrid Cloud services revenue increased by $80 million, or 3.8%, primarily due to a unit volume increase of $178 million, or 8.4%, led by private cloud and infrastructure SaaS. The increase in service revenue was partially offset by decrease in AUPs of $43 million or 2.0% and unfavorable currency fluctuations of $40 million or 1.9%.\nHybrid Cloud earnings from operations as a percentage of net revenue decreased 4.7 percentage points due to an increase in cost of products sold as a percentage of net revenue and an increase in operating expenses as a percentage of net revenue. The increase in cost of products and services as a percentage of net revenue was primarily due to lower margin GreenLake Flex Solutions deals and decrease in storage subscription revenue. The increase in operating expenses as a percentage of net revenue was primarily due to the unfavorable currency fluctuations.\nFor the fiscal years ended October 31,\nEarnings from operations\nEarnings from operations as a % of net revenue\nHEWLETT PACKARD ENTERPRISE COMPANY AND SUBSIDIARIES\nManagement's Discussion and Analysis of\nFinancial Condition and Results of Operations (Continued)\nFiscal 2024 compared with fiscal 2023\nIntelligent Edge net revenue decreased by $847 million, or 15.7% (decreased 15.9% on a constant currency basis). Product revenue decreased by $1,050 million, or 23.9%, led by lower volume and product mix effect of $876 million, or 19.9%, and lower AUPs of $183 million, or 4.2%. The product revenue decrease was led by switching products and wireless local area network products due to softened demand. Services net revenue increased $203 million, or 20.6%, primarily led by our aaS and attached support service offerings.\nIntelligent Edge earnings from operations as a percentage of net revenue decreased 0.4 percentage points primarily due to increase in operating expenses as a percentage of net revenue, partially offset by a decrease in cost of products and services as a percentage of net revenue. Operating expenses as a percentage of net revenue increased primarily due to scale of net revenue decline, higher employee costs related to acquisitions and investments to enhance Aruba offerings in GreenLake. The decrease in cost of product and services as a percentage of net revenue was primarily due to favorable revenue mix and cost containment measures.\nFiscal 2023 compared with fiscal 2022\nIntelligent Edge net revenue increased by $1,522 million, or 39.5% (increased 42.5% on a constant currency basis). Product revenue increased by $1,396 million, or 46.5%, led by higher AUPs of $1,284 million, or 42.8%, and a volume and product mix effect of $217 million, or 7.2%, moderated by unfavorable currency fluctuations of $106 million, or 3.5%. The product revenue increase was led by switching and wireless local area network products, which benefited from improvements in the supply availability, and elevated order book levels at the beginning of the period. Services net revenue increased $127 million, or 14.8%, primarily led by our aaS and attached support service offerings.\nIntelligent Edge earnings from operations as a percentage of net revenue increased 10.9 percentage points primarily due to decreases in cost of products and services as a percentage of net revenue and operating expenses as a percentage of net revenue. The decrease in cost of product and services as a percentage of net revenue was primarily due to lower supply chain costs, moderating the decrease was a lower mix of higher-margin support services revenue. Operating expenses as a percentage of net revenue decreased primarily due to our cost containment measures.\n\nWeighted-average interest rate\nWe maintain debt levels that we establish through consideration of several factors, including cash flow expectations, cash requirements for operations, investment plans (including acquisitions), share repurchase activities, o",
  "item2_clean": null
}