{
  "source_file": "hpq-20250731.htm",
  "form_type": "10-Q",
  "item1_clean": null,
  "item7_clean": null,
  "item2_clean": "ITEM 2. Management’s Discussion and Analysis of Financial Condition and Results of Operations.\nHP INC.\nManagement’s Discussion and Analysis of\nFinancial Condition and Results of Operations\nThe discussion of financial condition and results of our operations that follows provides information that will assist the reader in understanding our Condensed Consolidated Financial Statements, the changes in certain key items in those financial statements from year to year, and the primary factors that accounted for those changes, as well as how certain accounting principles, policies and estimates affect our Condensed Consolidated Financial Statements. This discussion should be read in conjunction with our Condensed Consolidated Financial Statements and the related notes that appear elsewhere in this document.\nOVERVIEW\nHP delivers innovative and sustainable devices, services, and subscriptions for personal computing, printing, 3D printing, hybrid work, gaming and other related technologies. We have three reportable segments: Personal Systems, Printing, and Corporate Investments. The Personal Systems segment offers commercial and consumer desktops, notebooks and workstations (including HP’s portfolio of AI PCs and workstations), thin clients, retail POS systems, displays, hybrid systems, software, solutions including endpoint security, and services. The Printing segment provides consumer and commercial printer hardware, supplies, solutions and services. Corporate Investments include certain business incubation and investment projects.\nIn Personal Systems, our long-term strategic focus is on:\nprofitable growth through innovation, market segmentation and simplification of our portfolio;\nenhanced innovation in multi-operating systems, multi-architecture, customer segments and other key attributes;\ninvesting in endpoint services and solutions. We are focused on services, including Device-as-a-Service, as the market shifts to subscription-based solutions, and accelerating in attractive adjacencies such as hybrid systems; and\ndriving innovation to enable productivity and collaboration, with AI PCs and workstations playing a critical role in the transformation of how people live and work.\nIn Printing, our long-term strategic focus is on:\noffering innovative, intelligent printing experiences and subscription-based solutions designed to securely serve consumer and SMB customers through our Instant Ink Services and HP All-In Plan, as well as large enterprises through our Managed Print Services solutions;\nproviding digital printing solutions for industrial graphics segments and applications including commercial publishing, labels, packaging, and textiles; and\nexpanding our footprint in 3D printing across digital manufacturing and strategic applications.\nWe are focused on growing our AI PC, advanced compute solutions, hybrid systems, workforce solutions, consumer subscriptions, industrial graphics and our 3D and personalization businesses collectively at a rate faster than our core business with accretive margins in the longer term. We believe our ability to innovate will help us gain momentum in growth areas like AI PC, advanced compute solutions and hybrid systems, and we see significant opportunities to drive greater recurring revenues across Personal Systems and Printing. Our Workforce Solutions organization drives integration across our commercial services, software and security portfolio. We continue to build on strong portfolios like Instant Ink to grow our Consumer Subscription business. In Industrial Graphics, we are driving the shift from analog to digital in segments like labels and packaging. In 3D and Personalization, we are creating end-to-end solutions that we believe can capture more value with our differentiated technology.\nWe believe we are well positioned to lead the future of work with our competitive product lineup and enhanced portfolio of hybrid systems, remote-computing solutions, and intelligent print solutions. We are driving innovation by accelerating the delivery of AI across our product portfolio and focusing on growth opportunities in commercial, solutions, and premium consumer and gaming markets. We are consolidating all our software resources under the Technology and Innovation Organization to evolve from a transactional hardware company to a more experience-led organization, further strengthening our ability to capture these opportunities.\nWe continue to experience challenges that are representative of the trends and uncertainties that may affect our industry, generally, and our business and financial results, specifically, and we expect these challenges to continue in the short-term. One set of challenges relates to the current macroeconomic environment and the adverse impact on demand for certain of our products. A second set of challenges relates to changes in the competitive landscape. Our primary competitors are exerting competitive pressure in targeted areas and are entering new markets, our emerging competitors are introducing new technologies and business models, and our alliance partners in some businesses are increasingly becoming our competitors in others. A third set of challenges relates to business model changes and our go-to-market execution in an evolving distribution and reseller landscape, with increasing online and omnichannel presence. Specific challenges we face at the segment level are set forth below.\nIn Personal Systems, we face challenges with a competitive pricing environment, variability in commodity costs, and demand softness in certain geographic regions.\nIn Printing, we face challenges from changing customer behaviors as well as competitors with a favorable foreign currency environment and non-original supplies (which includes imitation, refill, or remanufactured alternatives). We also obtain many Printing components from single source suppliers due to technology, availability, price, quality, or other considerations.\nTo address these challenges, we continue to pursue innovation with a view towards developing new products and services aligned with generating market demand and meeting the needs of our customers and partners. In addition, we continue to work on improving our operations and adapting our business models, with a particular focus on enhancing our end-to-end processes, analytics, efficiencies and simplification of our product portfolio. We also continue to work on optimizing our sales coverage models, aligning our sales incentives with our strategic goals, improving channel execution and inventory, production and backlog management, strengthening our capabilities in our areas of strategic focus, effective cost management, strengthening our pricing strategy, and developing and capitalizing on market opportunities.\nMacroeconomic Environment\nOur business and financial performance depend significantly on worldwide economic conditions. We face global macroeconomic challenges such as ongoing geopolitical conflicts (including the military conflict in Ukraine, continued instability in the Middle East, and tensions in the Taiwan Strait and South China Sea), uncertainty in the markets, volatility in exchange rates, inflationary trends and evolving dynamics in the global trade environment. We also experience seasonality in the sale of our products and services which may be affected by general economic conditions.\nSince April 2025, new, substantial tariffs have been imposed on imports to the United States. We continue to evaluate and implement further mitigating actions, including potential supply chain resiliency movements and cost and pricing measures, as the tariff environment evolves. During the nine months ended July 31, 2025, we experienced higher commodity and tariff costs, which were not fully mitigated by pricing and other actions enacted during the period. Should these or other proposed or incremental tariffs, including potential retaliatory actions imposed by other countries, be implemented and sustained for an\nextended period of time, as proposed, enacted or otherwise, they may have a significant adverse impact to our results of operations and cash flows to the extent our efforts do not fully mitigate the effects of such tariffs.\nTransformation Update\n\nIn November 2022, we announced our Future Ready Plan (the “Fiscal 2023 Plan” or “Future Ready”) to become a more digitally enabled company, focus investments on key growth opportunities and simplify our operating model. The Fiscal 2023 Plan, as amended on February 27, 2025, is expected to run through the end of fiscal year 2025. The three key elements of our Fiscal 2023 Plan are digital transformation, portfolio optimization, and operational efficiency. We are on track to achieve our overall program savings.\nSince announcing our Fiscal 2023 Plan, we have enhanced our digital capabilities in Workforce Solutions and continued to leverage AI to positively impact our products, solutions and operations. Additionally, we are reducing portfolio complexity, improving continuity of supply, and increasing our forecast accuracy across our business to drive reduction in our cost of sales and operating expenses. We also continued to reduce our structural cost through headcount reductions and are on track to achieve our overall headcount reduction goal. We expect to continue to invest some of the savings into our growth areas and our people.\nCRITICAL ACCOUNTING ESTIMATES\nACCOUNTING PRONOUNCEMENTS\nFor a summary of recent accounting pronouncements applicable to our Condensed Consolidated Financial Statements see Note 1, “Basis of Presentation”, to the Condensed Consolidated Financial Statements in Item 1 of Part I of this report, which is incorporated herein by reference.\nRESULTS OF OPERATIONS\nRevenue from our international operations has historically represented, and we expect will continue to represent, a majority of our overall net revenue. As a result, our net revenue growth has been impacted, and we expect it will continue "
}