{
  "source_file": "hrl-20250727.htm",
  "form_type": "10-Q",
  "item1_clean": null,
  "item7_clean": null,
  "item2_clean": "products at the Company's facility in Barron, Wisconsin. Other significant projects included investments in data and technology during fiscal 2025 and investment in wastewater infrastructure to support operations in Austin, Minnesota during fiscal 2024.\nProceeds from the sale of business were $13.1 million during the first nine months of fiscal 2025, primarily from the sale of the Company’s equity interest in Mountain Prairie, LLC.\nCash Provided by (Used in) Financing Activities\nCash dividends paid to the Company’s shareholders totaled $474 million during the first nine months of fiscal 2025, compared to $460 million in the comparable period of fiscal 2024.\nProceeds from the exercise of stock options were $24 million in the first nine months of fiscal 2025, compared to $34 million in the first nine months of fiscal 2024.\nThe Company paid $950 million of its senior unsecured notes upon maturity on June 3, 2024.\nProceeds from the issuance of long-term debt were $498 million in fiscal 2024, due to the Company's issuance of senior unsecured notes with an aggregate principal amount of $500 million.\nSources and Uses of Cash\nThe Company believes its balanced business model, with diversification across raw material inputs, channels, and categories, provides stability in ever-changing economic environments. The Company maintains a disciplined capital allocation strategy and uses a waterfall approach, which focuses first on core uses of cash, such as capital expenditures to maintain facilities, dividend\nreturns to investors, mandatory debt repayments, and fulfillment of pension obligations. Next, the Company looks to strategic items in support of growth initiatives, such as other capital projects, acquisitions, additional dividend increases, and working capital investments. Finally, the Company evaluates opportunistic uses, including incremental debt repayment and share repurchases.\nThe Company believes its anticipated income from operations, cash on hand, borrowing capacity under the current unsecured revolving credit facility, and access to capital markets will be adequate to meet all short-term and long-term commitments. The Company continues to look for opportunities to make investments and acquisitions that align with its strategic priorities. The Company has multiple sources of liquidity to complete such investments and acquisitions. For example, the Company’s historic ability to leverage its balance sheet through the issuance of debt has provided the flexibility to pursue strategic opportunities.\nThe Company remains committed to providing returns to investors through cash dividends on its common stock. The Company has paid 388 consecutive quarterly dividends since becoming a public company in 1928. The Board of Directors approved an increased annual dividend rate for fiscal 2025, raising it to $1.16 per share from $1.13 per share, representing the 59th consecutive annual dividend increase.\nCapital Expenditures\nCapital expenditures are allocated to required maintenance and growth opportunities based on the needs of the business. Capital expenditures supporting growth opportunities in fiscal 2025 are expected to focus on projects related to value-added capacity, infrastructure, and new technology. Capital expenditures for fiscal 2025 are estimated to be approximately $300 million.\nAs of July 27, 2025, the Company’s outstanding debt included $2.9 billion of fixed rate unsecured senior notes due in fiscal 2027, 2028, 2030, and 2051 with interest payable semi-annually. During the first nine months of fiscal 2025, the Company made $61 million of interest payments and the Company expects to make an additional $12 million of interest payments during fiscal 2025 on these notes. See Note K - Long-term Debt and Other Borrowing Arrangements of the Notes to the Consolidated Financial Statements for additional information.\nAs a source of short-term financing, the Company maintains a $750 million unsecured revolving credit facility. The maximum commitment under this credit facility may be further increased by $375 million upon the satisfaction of certain conditions. Extensions of credit under the facility may be applied by the Company to refinance existing indebtedness and for working capital and other general corporate purposes, including acquisition funding, and may be made in the form of revolving loans, swing line loans, and letters of credit. The lending commitments under the facility are scheduled to expire on March 25, 2030, at which time the Company will be required to pay in full all obligations then outstanding. As of July 27, 2025, the Company had no outstanding borrowings from this facility.\nThe Company’s debt agreements contain customary terms and conditions including representations, warranties, and covenants. These debt covenants limit the ability of the Company to, among other things, incur debt for borrowed money secured by certain liens, or engage in certain sale and leaseback transactions, and the covenants require the Company to maintain certain consolidated financial ratios. As of July 27, 2025, the Company was in compliance with all covenants in its debt agreements and expects to maintain compliance in the future.\nCash Held by International Subsidiaries\nAs of July 27, 2025, the Company’s international subsidiaries held $185 million of cash and cash equivalents. During the third quarter of fiscal 2025, the Company repatriated $44 million in cash from an international subsidiary and recognized foreign withholding taxes on the one-time distribution. The Company maintains all undistributed earnings as permanently reinvested. The Company evaluates the balance and uses of cash held internationally based on the needs of the business.\nThe Company is authorized to repurchase 3,677,494 shares of common stock as part of an existing plan approved by the Company’s Board of Directors. Under the share repurchase authorization, the Company may repurchase shares periodically, depending on market conditions and other factors, and may do so in open market purchases or privately negotiated transactions. The share repurchase authorization has no expiration date. The Company did not repurchase any shares of stock during the first nine months of fiscal 2025. The Company continues to evaluate share repurchases as part of its capital allocation strategy.\nTRADEMARKS\nReferences to the Company’s brands or products in italics within this report represent valuable trademarks owned or licensed by Hormel Foods, LLC or other subsidiaries of Hormel Foods Corporation.\nCRITICAL ACCOUNTING ESTIMATES\nFORWARD-LOOKING STATEMENTS\nThis report contains “forward-looking” information within the meaning of the federal securities laws. The “forward-looking” information may include statements concerning the Company’s outlook for the future as well as other statements of beliefs, future plans, strategies, or anticipated events and similar expressions concerning matters that are not historical facts.\nThough the Company has attempted to list comprehensively these important cautionary risk factors, the Company cautions that other factors may in the future prove to be important in affecting the Company’s business or results of operations.\nThe Company cautions readers not to place undue reliance on forward-looking statements, which represent current views as of the date made. Forward-looking statements are inherently at risk to changes in the Company’s business as well as the national and worldwide economic environment. The risks and uncertainties that could cause actual results to differ from those anticipated or projected include, among other things, risks related to the deterioration of economic conditions; risks associated with acquisitions, joint ventures, equity investments, and divestitures; risks and uncertainties associated with intangible assets, including any future goodwill or intangible assets impairment charges; the risk of disruption of operations, including at owned facilities, co-manufacturers, suppliers, logistics providers, customers, or other third-party service providers; the risk that the Company may fail to realize anticipated cost savings or operating profit improvements associated with strategic initiatives, including the Transform and Modernize initiative; risk of loss of a significant contract or unfavorable changes in the Company’s relationships with significant customers; risk of the Company’s inability to protect information technology (IT) systems against, or effectively respond to, cyber attacks, security breaches or other IT interruptions, against or involving the Company’s IT systems or those of others with whom it does business; risk of the Company’s failure to timely replace legacy technologies; deterioration of labor relations or labor availability or increases to labor costs; general risks of the food industry, including those related to food safety, such as costs resulting from food contamination, product recalls, the remediation of food safety events at its facilities,\nincluding the production disruption at the Suffolk, Virginia, facility, food-specific laws or regulations, or outbreaks of disease among livestock and poultry flocks; fluctuations in commodity prices and availability of raw materials and other inputs; fluctuations in market demand for the Company’s products, including due to private label products and lower-priced alternatives; risks related to the Company’s ability to respond to changing consumer preferences, diets and eating patterns, and the success of innovation and marketing investments; damage to the Company’s reputation or brand image; risks associated with climate change, or legal, regulatory, or market measures to address climate change; risks of litigation; potential sanctions and compliance costs arising from government regulation; compliance with stringent environmental regulations and potential environmental litigation; and risks arising from the fact that the Company operates globally, with"
}