{
  "source_file": "hsic-20241228.htm",
  "form_type": "10-K",
  "item1_clean": "and our own corporate brand of consumable merchandise.\nIncludes dental chairs, delivery units and lights, digital dental laboratories, X-ray supplies and equipment, equipment repair and\nhigh-tech and digital restoration equipment.\nConsists of financial services on a non-recourse basis, continuing education services for practitioners, consulting and other services.\nIncludes branded and generic pharmaceuticals, vaccines, surgical products, diagnostic tests, infection-control products, X-ray\nproducts, equipment, PPE products and vitamins.\nIncludes manufacturing, marketing and sales of dental implant and biomaterial products; and endodontic, orthodontic and\northopedic products and other health care-related products and services.\nConsists of practice management software, e-services, and other products, which are distributed to health care providers.\n\nproducts and services that may help us better serve our customers.\nDirect sales and marketing expertise.\n\nWe also source or manufacture other medical and dental health care products and services that are\nsold to customers, including handpiece and small equipment, rotary, hand instruments, and repair services,\nrestoratives and preventives, as well as certain other health care-related\n\nfootprint (whether entering a\nnew country, such as emerging markets, or building scale where we have already invested in businesses),\nand finally, those that enable us to access new products and technologies.\n\nbusiness operations, all of\nwhich may materially adversely affect our operations.\nalso sell products and services that health care providers, such as physicians\n\na broad range of products and services to our\ncustomers, at competitive prices, in the following categories:\nGlobal Distribution and Value-Added Services\n\nWe offer our customers solutions in operating their practices more efficiently by\nproviding access to a number of financial services and products\n\nor the perceived or actual\nfailure by us or our customers who use our products or services to comply\n\ncontact with customers and\nstay abreast of market developments and the hundreds of new products,\n\nWe do this through both direct sales and by partnering with local distribution and\nmanufacturing companies.\nFor information on revenues and long-lived assets by geographic area, see\nNote 4 – Segment and Geographic Data\nof “Notes to Consolidated Financial Statements.”\n\nThese customers, and we, are subject to laws, regulations and industry\nstandards, such as HIPAA and the Payment Card Industry Data Security Standards, which require the protection of\nthe privacy and security of those records, and our products may also be\n\nthrough our API program.\nManufacturing and Raw Materials\nWe manufacture certain of our products for our specialty businesses (oral surgery solutions including dental\nimplants, endodontics, and orthopedics) at our 15 company manufacturing\n\n(ii) which was still valid on May 26, 2021,\nand (iii) has not been subsequently withdrawn may, for the moment, continue to be placed on the market or put into\nservice until December 31, 2027 for higher risk devices or December 31, 2028\n\nWith research and development and manufacturing facilities in the United States,\nSwitzerland, Germany, Brazil and France, we serve customers with various global and regional implant\nbrands across a wide range of price segments.\n\nand (iii) Global Technology.\nGlobal Distribution and Value-Added Services includes distribution to the global dental and medical markets of\nnational brand and corporate brand merchandise, as well as equipment and related\n\ncompliance, we cannot predict\nwhether changes in applicable law, or interpretation of laws, or changes in our services or marketing practices in\nresponse to changes in applicable law or interpretation of laws, or failure\n\nrequirements, including regarding a product’s clinical evaluation and a company’s quality systems, and for the\ndistribution, marketing and sale of medical devices, including post-market\n\nor one or more of our businesses to\nsubstantial additional requirements with respect to these products.\nIn addition, our businesses that involve physician and dental practice management\n\nWe believe our offering of a broad range of products, services and support, including\nsoftware solutions that can help drive improved workflow efficiency and patient communications\n\nEach information blocking violation carries up to a $1 million penalty.\nMoreover, in order to satisfy our customers, and comply with evolving legal requirements, our products may\n\nWe develop, manufacture, market and distribute a complete portfolio of endodontic products\nacross multiple brands catering to both endodontic specialists and general\n\nWe continue to expand our social media presence to raise awareness about issues, engage\ncustomers beyond a sale and deliver services and solutions to specialized\n\nWe have 129 equipment sales and service centers worldwide that provide a variety of\nrepair, installation and technical services for our health care customers.\n\nWe distribute consumable products, small equipment, laboratory\nproducts, large equipment, equipment repair services, branded and generic pharmaceuticals,\n\nGlobal Technology includes development and distribution of practice management\nsoftware, e-services, and other products, which are distributed to health\n\nThe majority of our revenue is generated in the United States market,\nwith the remaining revenue coming from Canada and countries in Latin America,\n\nperformance and monitor daily\noperational statistics.\nProducts and Services\nThe following table sets forth the percentage of consolidated net sales\n\nmedical end market manufacturers already\nsell directly to end customers.\nIn North America, we compete with other distributors, as well as several\n\nout through Medicaid administrators,\nas well as through the private sector, which may further alter the marketplace and impact our business.\n\nWe sell practice management, business analytics, patient engagement and patient demand creation software\nsolutions to our dental customers.\n\nSupported by our specialized sales force, we market our\nproducts and solutions in approximately 90 countries, directly to dental practices\n\nWe continue to invest in our e-commerce platform to offer enhanced\ncontent management so customers can more easily find the products\n\nWe are committed to providing customized solutions to our\ncustomers that are driven by our understanding of the end markets we\n\nwe revised our reportable segments to align\nwith how the Chairman and Chief Executive Officer manages the business, assesses\n\nThese consultants complement our direct\nmarketing and telesales efforts and enable us to better market, service and support\n\nThese systems allow us to manage our growth,\ndeliver superior customer service, properly target customers, manage financial\n\nWe also market and sell our own corporate brand portfolio\nof cost-effective, high-quality consumable merchandise products.\n\nWe also face significant competition internationally,\nwhere we compete on the basis of price and customer service against\n\nservices; and to be trusted advisors and\nconsultants to our customers - enabling them to deliver the best quality patient\n\nvariety of new services to address the\nchanging demands of consumers and our customers on a timely basis, particularly\n\nOur philosophy is grounded in our\ncommitment to help customers operate a more efficient and successful business so\n\nby principal categories of products and\nservices offered through our Global Distribution and Value-Added Services,\n\nfavorable long-term macro trends that\nshould help stimulate patient traffic and demand for products and services.\n\nThis trend has benefited distributors capable\nof providing a broad array of products and services at low prices.\n\nproducts, non-recourse practice financing\nfor leasehold improvements, business debt consolidation and commercial\n\nprograms, network and hardware\nservices, e-commerce and electronic marketing services, e-Prescribe medications\n\nregulations as they apply to our customers’\npractices will not have a material adverse effect on our business.\n\nThrough our proprietary, technologically-based suite of products, we offer customers a variety of competitive\n\nIn addition, our competitors could\nobtain exclusive rights from manufacturers to market particular products.\n\nWe have technical representatives supporting customers using our practice\nmanagement solutions and services.\n\nproducts, our specialty home\nmedical supplies business, and our self-insured health plans include electronic\n\nof persons responsible for placing\nmedicinal products on the market, and include or exclude the medicine on\n\nCertain of our businesses\ninvolve the manufacture and sale of such certified EHR systems and other products\n\nInc., eClinicalWorks and Epic Systems\nCorporation. In other software end markets, including revenue cycle\n\nfrequent direct marketing and\ntelesales contact, emphasizing our broad product lines, including exclusive\n\nserve and that reflect the technology-driven\nproducts and services best suited for their practice needs.\n\ncenters and digital services,\nand serve our customers through multiple brands and multiple channels\n\nGlobal Specialty Products, and Global\nTechnology reportable segments:\nGlobal Distribution and Value\n\nIn certain parts of the\ndental end market, such as those related to dental specialty products, and\n\nto support our different sales\nchannels, we are successfully marketing our products and brands\n\nWe also provide staffing services, dental practice valuation and\nGlobal Specialty Products\n\nIndex to Financial Statements\nBroad product and service offerings at competitive prices.\n\noutside China but for the purpose of\nproviding products or services to PRC citizens.\n\ncompanies that can enhance their current product and service offerings or provide\n\nlarge customers in the dental and medical markets, serving more than one million\n\ncare products we sell are available to our customers from a number of suppliers.\n\ntesting from acute care settings to alternate-care\nsites, particularly physicians’ offices and ambulatory surgery centers.\nWe believe that consolidation within the industry will continue to result in a number of distributors, particularly\nthose with limited financial, operating and marketing resources, seeking\n\nfor reasons of quality assurance, regulatory requirements, cost, and availability.\nWe believe that we have a readily available supply of raw materials and components sourced from various\nsuppliers, for our significant products.\nWe may experience shortages of raw materials or purchased components.\n\nimplemented by EU member\nstates (Directive No. 89/105/EC of 21 December 1988\nrelating to the transparency of measures regulating the\npricing of medicinal products for human use and their inclusion in the scope of national health insurance\n\nframework for violations of the\nCCPA, as well as potentially severe statutory damages and private a right of action against businesses that suffer a\ndata security breach due to their violation of a duty to implement reasonable\n\nand Human Services (“HHS”), and\nvarious state boards of pharmacy, state health departments and/or comparable state agencies as well as comparable\nforeign agencies, and certain accrediting bodies, depending on the type of\n\nwell as through the contribution from our strategic acquisitions.\nWe stock a comprehensive selection of more than 300,000 branded products and Henry Schein corporate brand\nproducts through our main distribution centers.\n\nGlobal Specialty Products\nIncludes infection-control products, handpieces, preventatives, impression materials, composites, anesthetics, teeth, dental\nimplants, gypsum, acrylics, articulators, abrasives, PPE products,\n\nto drug product that was introduced in a\ntransaction into commerce by the product’s manufacturer or repackager before November 27, 2024, and for\nsubsequent transactions of such product through the product’s expiry.\n\nto comply with applicable l",
  "item7_clean": "software and an increase in\nrevenue cycle management solutions and our analytical products.\nGross profit and gross margin percentages by segment and in total were as follows:\nIncrease / (Decrease)\nGlobal Distribution and Value\n\nexpenses; depreciation and amortization; and\nrestructuring and integration costs) by segment were as follows:\nIncrease / (Decrease)\nGlobal Distribution and Value\n\nexpenses; depreciation and amortization,\nrestructuring and integration costs) by segment were as follows:\nIncrease / (Decrease)\nGlobal Distribution and Value\n\nincident in the fourth quarter.\nGross profit and gross margin percentages by reportable segment were as follows:\nIncrease / (Decrease)\nGlobal Distribution and Value\n\nGlobal Specialty Products\nTotal operating expenses\nThe increase in operating costs (excluding acquisitions) during the year ended\n\nadjustments (current year vs. prior year) consist of (i) acquisition intangible amortization ($184 million vs. $150 million); (ii)\nrestructuring costs ($110 million vs. $80 million); (iii) changes in contingent consideration ($45 million vs. $0 million); (iv) cyber\nincident third-party advisory expenses, net of insurance proceeds ($31 million net proceeds vs. $11 million net expenses); (v)\nimpairment of capitalized assets ($12 million vs. $27 million); (vi) impairment of intangible assets ($0 million vs. $7 million); (vii)\nlitigation settlements ($6 million vs. $0 million); and (viii) costs associated with shareholder advisory matters ($2 million vs. $0\n\nadjustments (current year vs. prior year) consist of (i) acquisition intangible amortization ($150 million vs. $126 million); (ii)\nrestructuring costs ($80 million vs. $131 million); (iii) cyber incident third-party advisory expenses ($11 million vs. $0 million);\n(iv) impairment of capitalized assets ($27 million vs. $0 million); and (v) impairment of intangible assets ($7 million vs. $34\n\nand our own corporate brand of consumable merchandise.\nIncludes dental chairs, delivery units and lights, digital dental laboratories, X-ray supplies and equipment, equipment repair and\nhigh-tech and digital restoration equipment.\nConsists of financial services on a non-recourse basis, continuing education services for practitioners, consulting and other services.\nIncludes branded and generic pharmaceuticals, vaccines, surgical products, diagnostic tests, infection-control products, X-ray\nproducts, equipment, PPE products and vitamins.\nIncludes manufacturing, marketing and sales of dental implant and biomaterial products; and endodontic, orthodontic and\northopedic products and other health care-related products and services.\nConsists of practice management software, e-services, and other products, which are distributed to health care providers.\nThe components of our sales growth/(decline) were as follows:\nLocal Currency Growth/(Decline)\nGlobal Distribution and Value\n\nand our own corporate brand of consumable merchandise.\nIncludes dental chairs, delivery units and lights, digital dental laboratories, X-ray supplies and equipment, equipment repair and\nhigh-tech and digital restoration equipment.\nConsists of financial services on a non-recourse basis, continuing education services for practitioners, consulting and other services.\nIncludes branded and generic pharmaceuticals, vaccines, surgical products, diagnostic tests, infection-control products, X-ray\nproducts, equipment, PPE products and vitamins.\nIncludes manufacturing, marketing and sales of dental implant and biomaterial products; and endodontic, orthodontic and\northopedic products and other health care-related products and services.\nConsists of practice management software, e-services, and other products, which are distributed to health care providers.\nThe components of our sales growth/(decline) were as follows:\nLocal Currency Growth/(Decline)\nGlobal Distribution and Value\n\nThe components of sales\ngrowth are presented in the table above.\nThe internally generated local currency increase of 2.4% in Global Technology sales was primarily attributable to a\ncontinued increase in the number of cloud-based users of our practice management\n\nThe increase in Global Distribution and Value-Added Services gross profit for the year ended December 28, 2024\ncompared to the prior-year-period is due to acquisitions and margin expansion providing a favorable impact\n\nThe increase in gross margin rates was due to a favorable impact of sales mix.\nThe increase in Global Technology gross profit reflects increased local currency revenues and additional gross\nprofit from acquisitions.\n\nExpense, Net; and Income Taxes are\nbased on actual values and may not recalculate due to rounding.\nNet sales were as follows:\nIncrease / (Decrease)\nGlobal Distribution and Value\n\nGlobal Specialty Products\nTotal operating expenses\nThe components of the net increase in total operating expenses are presented\n\nindustry; risks from expansion of customer\npurchasing power and multi-tiered costing structures; increases in shipping costs\n\nsales increase are presented in the table above.\nThe decrease in internally generated local currency sales was primarily\n\nfor our products or other service\nissues with our third-party shippers, and increases in fuel and energy costs; changes\n\nincreases in labor costs or health care\ncosts, and our relationships with customers, suppliers and manufacturers;\n\nmix of higher-margin products.\nThe increase in Global Specialty Products gross profit reflects increased\n\nThe net increase in operating expenses is attributable to the following:\nGlobal Distribution and Value\n\nThe net increase in operating expenses is attributable to the following:\nGlobal Distribution and Value\n\nDecember 30, 2023 includes\nincreases in payroll and payroll related costs primarily in our Global\n\nadd new customers and sales teams, increase\nour geographic footprint (whether entering a new country, such as emerging markets, or building scale where we\nhave already invested in businesses), and finally, those that enable us to access new products and technologies.\nNet cash provided by operating activities was $848 million for the\n\nand COVID-19 test kits, on a full year\nbasis were flat compared to the prior year.\nGlobal Distribution and Value-Added Services Sales\nGlobal Distribution and Value-Added Services net sales for the year ended December 30, 2023 decreased 3.8%.\n\nestimated increase in the segment’s internally generated local currency sales, excluding PPE products and COVID-\n19 test kits, was 0.3%.\nGlobal Specialty Products\nGlobal Specialty Products net sales for the year ended December\n\nreduction in sales of PPE products and\nCOVID-19 test kits, partially offset by additional gross profit from acquisitions.\nThe increase in Global Specialty Products gross profit is primarily attributable\n\nOn November 22, 2023, we experienced a disruption of our\necommerce platform and related applications, which was remediated.\nDuring the year ended December 28, 2024, we had a sales decrease\n\ntest kits, was 0.3%.\nGlobal Distribution and Value-Added Services Sales\nGlobal Distribution and Value-Added Services net sales for the year ended December 28, 2024 increased 1.9%.\n\nThe decrease in Global Distribution and Value-Added Services gross profit for the year ended December 30, 2023\ncompared to the prior year was due to the 2023 cyber incident and a\n\nGlobal Specialty Products\nTotal operating expenses\nAdjustments represent items excluded from segment operating income to enable comparison of financial results between periods.\n\nGlobal Specialty Products\nTotal operating expenses\nAdjustments represent items excluded from segment operating income to enable comparison of financial results between periods.\n\nWe also initiated the disposal of a non-profitable U.S. business within the Global Specialty\nProducts segment and recorded related costs of $49 million, which primarily\n\nThough inflation impacts both our revenues and costs, the depth\nand breadth of our product portfolio often allows us to offer lower-cost national brand solutions\n\nwhich can enhance the\nefficiency and facilitation of practice management.\nOur operating results in recent years have been significantly affected by strategies\n\nThe increase in Global Technology gross profit is the result of a higher gross profit from internally generated sales\nand gross profit from acquisitions.\n\nWith respect to customer mix, sales to our large-group customers are\ntypically completed at lower gross margins due to the higher volumes sold as opposed\n\nGlobal Technology includes development and distribution of practice management\nsoftware, e-services, and other products, which are distributed to health\n\nGlobal Technology includes development and distribution of practice management\nsoftware, e-services, and other products, which are distributed to health\n\nThe components of our\nsales increase are presented in the table above.\nThe internally generated local currency sales were relatively flat due to implant\n\nThe increase in local currency Global Specialty\nProducts sales was attributable to the acquisitions of TriMed during the year ended December 28, 2024,\n\nWorking capital requirements generally result from increased sales, special\ninventory forward buy-in opportunities and payment terms for receivables\n\ndelays during the fourth quarter of 2023\nafter the cyber incident.\nThe 1.2% decrease in internally generated local currency medical sales reflects\n\n30, 2023 as compared to December 31, 2022\nwas included in Part II, Item 7 “Management’s Discussion and Analysis of Financial Condition and Results\n\nIndex to Financial Statements\nPlans of Restructuring and Integration Costs\nOn August 6, 2024, we committed to a new restructuring plan (the “2024\n\nThe components of sales growth are\npresented in the table above.\nThe 0.4% decrease in our internally generated local currency sales was primarily\n\nWe realize substantially higher gross margin from sales of products that\nwe develop and manufacture within our Global Specialty Products segment\n\nWe realize substantially higher gross margin from sales of products that\nwe develop and manufacture within our Global Specialty Products segment\n\nthat achieve market acceptance with acceptable\nmargins; transitional challenges associated with acquisitions, dispositions and joint ventures,\n\nabsorb price increases, thus positioning us\nto protect our gross profit.\nDuring the fourth quarter of our fiscal year ended December 28, 2024,\n\n-Added Services segment, gross profit margins may vary between the\nperiods as a result of the changes in the mix of products sold as well as\n\n-Added Services segment, gross profit margins may vary between the\nperiods as a result of the changes in the mix of products sold as well as\n\nIndex to Financial Statements\nWe report our results of operations on a 52 or 53 weeks per fiscal year basis ending on the last Saturday of\n\nthe impaired intangible assets, using\na discounted estimate of future cash flows.\nNote 16 – Plans of Restructuring and Integration Costs\n\nDuring the year ended December 30, 2023, the trend for sales of practice\nmanagement software growth remained strong as we continued to\n\nmargins in certain businesses, and a $12\nmillion charge related to the planned exit of a business in connection with our restructuring\n\ncapitalize on this trend, as we believe we\nhave the ability to support increased sales through our existing infrastructure, although\n\nimpact of the 2023 cyber incident.\nThe 11.0% decrease in internally generated local currency medical sales is primarily attributable\n\ncompared to gross margin from sales of\nproducts that we distribute within our Global Distribution and Value-Added Services segment.\n\nincome based on the realigned\nsegments is presented below.\nNote: Percentages for Net Sales; Gross Profit; Operating Expenses; Other\n\ncompared to gross margin from sales of\nproducts that we distribute within our Global Distribution and Value-Added Services segment.\n\nsales is attributable to an increase in our\ndental billing solutions, partially offset by the expiration, during the year ended\n\nIndex to Financial Statements\nResults of Operations\nThe following tables summarize the significant components of our operating\n\nIf additional transactions are entered into or\nconsummated, we would incur merger and/or acquisition-related costs, and there\n\nIndex to Financial Statements\n2024 Compared to 2023\nNote: Percentages for Net Sales; Gross Profit; Operating Expenses; Other\n\nOur management reviewed and\napproved this valuation.\nDuring the fourth quarter of our fiscal year ended December 28, 2024,\n\nincurred $9 million and $11 million of\nexpenses directly related to the cyber incident, mostly consisting of professional\n\nThis impairment is included in the $80\nmillion of restructuring costs discussed above and related to the Global Specialty\n\nIn connection with this acquisition, during the year\nended December 31, 2022, we recorded integration costs of $3 million\n\nAdjusted for the impact of the cyber incident our days sales outstanding\ndecreased to 45.7 days as of December 28, 2024.\n\nrelated to one-time employee and other\ncosts, as well as restructuring charges of $9 million, which are included in the\n\nIndex to Financial Statements\n2023 Compared to 2022\nDiscussion of the results of operations for the year ended December\n\nThe net change of $1,211 million was primarily\ndue to decreased net borrowings from debt to finance our investments,\n\nThe net change of $705 million was primarily\nattributable to decreased payments for equity investments and business\n\ndeflation, recession, unemployment (and\ncorresponding increase in under-insured populations), consumer confidence,\n\nHenry Schein One, our practice management\nsoftware, revenue cycle management and patient relationship management\n\nTechnology segment, higher gross margins result from us being both the developer and seller of software products\n\nTechnology segment, higher gross margins result from us being both the developer and seller of software products\n\naccounts receivable due to improved\ncollection levels and decreased cash flows from accounts payable and accrued\n\nIndex to Financial Statements\nGlobal Technology net sales for the year ended December 28, 2024 increased 4.7%.\n\nIndex to Financial Statements\nGlobal Technology net sales for the year ended December 30, 2023 increased 9.6%.\n\nand the status of litigation matters;\nour dependence on our senior management, employee hiring and retention,\n\nincreased acquisitions of noncontrolling\ninterests in subsidiaries and increased repurchases of common stock.\n\nresulting in an extra week of sales.\nGlobal net sales for the year ended December 30, 2023 decreased 2.4%.\n\nhigher volumes sold as opposed to the gross margin on sales to office-based practitioners, who normally\n\ntransitions business in 2023.\nThe increase in internally generated local currency value-added services\n\nexpenses resulting from previously\nNet cash used in investing activities was $430 million for the year\n\ndue to the aging population,\nincreased health care awareness, the proliferation of medical technology\n\nstrengthening of the U.S. dollar, their impacts\nhave not been material to our results of operations.\n\nIndex to Financial Statements\nGlobal net sales for the year ended December 28, 2024 increased 2.7%.\n\nIndex to Financial Statements\nOperating expenses (consisting of selling, general and administrative\n\nIndex to Financial Statements\nOperating expenses (consisting of selling, general and administrative\n\nPlan”) to integrate recent acquisitions,\nright-size operations and further increase efficiencies.\n\ncapital during the year\nended December 28, 2024 included an increase in operating cash flows from\n\nWe include product costs, labor, and related fixed\nand variable overhead in the cost of inventory\n\nto the gross margin on sales\nto office-based practitioners, who normally purchase lower volumes.\n\nAs a result of different practices of categorizing costs associated with distribution networks\n\nindustry, our gross margins may n",
  "item2_clean": null
}