{
  "source_file": "hsic-20250927.htm",
  "form_type": "10-Q",
  "item1_clean": null,
  "item7_clean": null,
  "item2_clean": "risks, uncertainties and other factors\nthat may cause our actual results, performance and achievements\n\nRisk factors and uncertainties that could cause actual results to differ materially from\n\nAll forward-looking statements made by us are subject to risks and uncertainties\n\nIncludes infection-control products, handpieces, preventatives, impression materials, composites, anesthetics, teeth, gypsum,\nacrylics, articulators, abrasives, PPE products and our own corporate brand of consumable merchandise.\nIncludes dental chairs, delivery units and lights, digital dental laboratories, X-ray supplies and equipment, equipment repair\nservices and high-tech and digital restoration equipment.\nConsists of financial services on a non-recourse basis, continuing education services for practitioners, consulting and other services.\nIncludes branded and generic pharmaceuticals, vaccines, surgical products, diagnostic tests, infection-control products, X-ray\nproducts, equipment, PPE products and vitamins.\nIncludes manufacturing, marketing and sales of dental implant and biomaterial products; and endodontic, orthodontic and\northopedic products and other health care-related products and services.\nConsists of development and distribution of practice management software, e-services and other products, which are distributed to\nhealth care providers.\nThe components of our sales growth were as follows:\nConstant Currency Growth\n\nIncludes infection-control products, handpieces, preventatives, impression materials, composites, anesthetics, teeth, gypsum,\nacrylics, articulators, abrasives, PPE products and our own corporate brand of consumable merchandise.\nIncludes dental chairs, delivery units and lights, digital dental laboratories, X-ray supplies and equipment, equipment repair\nservices and high-tech and digital restoration equipment.\nConsists of financial services on a non-recourse basis, continuing education services for practitioners, consulting and other services.\nIncludes branded and generic pharmaceuticals, vaccines, surgical products, diagnostic tests, infection-control products, X-ray\nproducts, equipment, PPE products and vitamins.\nIncludes manufacturing, marketing and sales of dental implant and biomaterial products; and endodontic, orthodontic and\northopedic products and other health care-related products and services.\nConsists of development and distribution of practice management software, e-services and other products, which are distributed to\nhealth care providers.\nThe components of our sales growth/(decline) were as follows:\n\nand transactions that we\nundertook to expand our business, domestically and internationally, in part to address significant changes in the\nhealth care industry, including consolidation of health care distribution companies, health care reform, trends\ntoward managed care, cuts in Medicare and collective purchasing arrangements.\nIndustry Consolidation\nThe health care products distribution industry, as it relates to office-based health care practitioners, is fragmented\n\nThe components of our sales increase are\npresented in the table above.\nGlobal Distribution and Value-Added Services Sales\nGlobal Distribution and Value-Added Services net sales for the three months ended September 27, 2025 increased\n\ndistributing health care products.\nare headquartered in Melville, New York, employ more than 25,000 people (of which approximately 13,000 are\nbased outside of the United States) and have operations or affiliates in 33 countries and\n\nof certain tax deductions; risks related\nto product liability, intellectual property and other claims; risks associated with customs policies or legislative\nimport restrictions; risks associated with disease outbreaks, epidemics,\n\nThe increase in Global Distribution and Value-Added Services gross profit for the three months ended September\n27, 2025 compared to the prior-year-period was attributable to the growth in internally\n\nThe U.S. merchandise growth\nreflects the positive impact of the targeted promotional programs initiated last quarter.\nThe 3.0% increase in internally generated local currency medical sales was\n\nThese adjustments (current quarter vs. prior\nquarter) consist of (i) acquisition intangible amortization ($46 million vs. $47 million), (ii) restructuring costs ($34 million vs. $48\n\nmanufacturers of these products\ntypically do not utilize a distribution channel to serve customers.\nDuring the fourth quarter of our fiscal year ended December 28, 2024, we\n\nExpense, Net; and Income Taxes are\nbased on actual values and may not recalculate due to rounding.\nDuring the fourth quarter of our fiscal year ended December 28, 2024,\n\nExpense, Net; and Income Taxes are\nbased on actual values and may not recalculate due to rounding.\nDuring the fourth quarter of our fiscal year ended December 28, 2024,\n\nThree Months Ended September 27, 2025 Compared to Three Months Ended September 28, 2024\nNote: Percentages for Net Sales; Gross Profit; Operating Expenses; Other\n\nInterest expense increased primarily due to\nincreased borrowings.\nOur effective tax rate was 21.3% for the three months ended September 27, 2025, compared\n\nFor the three months ended September 27, 2025, the difference was\nfurther impacted by the tax treatment associated with the acquisition of a controlling\n\nabsorb price increases, thus positioning us\nto protect our gross profit.\nDuring the fourth quarter of our fiscal year ended December 28, 2024,\n\nto capitalize on this trend, as we believe we\nhave the ability to support increased sales through our existing infrastructure, although\n\nsecond, or third quarter of this\nfiscal year, although sales of U.S. dental equipment were temporarily impacted by market uncertainty\n\nrequirements, including relating to health care;\nrisks associated with the EU Medical Device Regulation; failure to comply with\n\nanticipated results of restructuring and\nvalue-optimization initiatives; risks related to the Strategic Partnership Agreement\n\nnatural or man-made disasters; risks associated\nwith our global operations; the threat or outbreak of war (including, without\n\none distributor, with one generally serving as the primary supplier.\nThe trend of consolidation extends to our customer base.\n\nindustry; risks from expansion of customer\npurchasing power and multi-tiered costing structures; increases in shipping costs\n\nfor raw materials or purchased components; risks\nrelating to the achievement of our strategic growth objectives, including\n\nto growth in dental implants and\nGlobal Technology net sales for the three months ended September 27, 2025 increased 9.7%.\n\nthe three months ended September 28, 2024,\nrepresenting an estimated decrease of $9 million primarily due to lower sales\n\nsales was attributable primarily to lower\nsales in our practice transitions business, which can fluctuate from quarter\n\nrisks; new or unanticipated litigation\ndevelopments and the status of litigation matters; our dependence on\n\nto impact that the cyber incident had on\nthe cash collections during the three months ended March 30, 2024.\n\nin supplier rebates or other\npurchasing incentives; risks related to the sale of corporate brand products;\n\nrisks related to activist investors;\nsecurity risks associated with our information systems and technology\n\nThis trend has benefited\ndistributors capable of providing a broad array of products and services at low\n\nGlobal Specialty Products\nGlobal Specialty Products net sales for the three months ended September\n\nyears beginning on or after\nJanuary 1, 2025 and on or after January 1, 2026.\nRegulation (EU) 2025/327 of February 11, 2025 on the European Health Data Space and amending\nDirective 2011/24/EU and Regulation (EU) 2024/2847 establishes the European Health Data Space\n(EHDS) by providing for common rules, standards and infrastructures and\n\nadd new customers and sales teams, increase\nour geographic footprint (whether entering a new country, such as emerging markets, or building scale where we\nhave already invested in businesses), and finally, those that enable us to access new products and technologies.\nNet cash provided by operating activities was $331 million for the\n\nproceeds), (vi) impairment of intangible assets ($1 million vs. $0 million), and (vii) costs associated with shareholder advisory matters\nand select value creation consulting costs ($24 million vs. $0 million).\nThe net decrease in operating expenses was attributable to the following:\nGlobal Distribution and Value\n\n(iv) cyber incident-insurance proceeds, net of third-party\nadvisory expenses (no activity) vs. $(9) million net proceeds), (v) litigation settlements ($2 million vs. $0 million), and (vi) costs\nassociated with shareholder advisory matters and select value creation consulting costs ($10 million vs. $0 million).\n\nrelatively small offices to group practices\nor service organizations ranging in size from a few practitioners to a large number of practitioners who have\ncombined or otherwise associated their practices.\nDue in part to the inability of office-based health care practitioners to store and manage\n\nIncludes $492 million and $241 million of certain accounts receivable, which serve as security for U.S. trade accounts receivable\nsecuritization at September 27, 2025 and December 28, 2024, respectively.\nOur cash and cash equivalents consist of bank balances and investments\n\nConsequently, we may change\nour funding structure to reflect any new requirements.\nWe believe that our cash and cash equivalents, our ability to access private debt markets and public equity markets,\nand our available funds under existing credit facilities provide us with\n\n-Added Services; (ii)\nGlobal Specialty Products; and (iii) Global Technology.\nGlobal Distribution and Value-Added Services includes distribution to the global dental and medical markets of\nnational brand and corporate brand merchandise, as well as equipment and related\n\n-Added Services; (ii)\nGlobal Specialty Products; and (iii) Global Technology.\nGlobal Distribution and Value"
}