{
  "source_file": "hst-20250930.htm",
  "form_type": "10-Q",
  "item1_clean": null,
  "item7_clean": null,
  "item2_clean": "Comparable hotel revenues⁽¹⁾\nComparable hotel EBITDA⁽¹⁾\nComparable hotel EBITDA margin⁽¹⁾\nComparable hotel Total RevPAR⁽¹⁾\nComparable hotel RevPAR⁽¹⁾\nEBITDA\n, NAREIT FFO per diluted share and Adjusted FFO per diluted share and comparable hotel operating results (including hotel revenues and hotel EBITDA and margins) are non-GAAP financial measures within the meaning of the rules of the SEC. See “Non-GAAP Financial Measures” and \"Comparable Hotel Operating Statistics and Results\" for more information on these measures, including why we believe these supplemental measures are useful, reconciliations to the most directly comparable GAAP measure, and the limitations on the use of these supplemental measures. Additionally, comparable hotel results and statistics are based on 76 comparable hotels as of September 30, 2025 and include adjustments for non-comparable hotels, dispositions and acquisitions. See Comparable Hotel RevPAR Overview for results of the portfolio based on our ownership period, without these adjustments.\nTotal revenues increased $12 million, or 0.9%, and $255 million, or 6.0%, for the third quarter and year-to-date 2025, respectively, as compared to 2024. For the quarter, growth was moderate as continued strength in transient rates was mostly offset by weakness in group demand. Year-to-date, strong short-term transient demand has driven the RevPAR gains, while we continue to see increased out-of-room spend driving food and beverage and other revenues. The third quarter and year-to-date total revenues also benefited from the 2024 acquisitions of the 1 Hotel Nashville and Embassy Suites by Hilton Nashville Downtown, 1 Hotel Central Park and The Ritz-Carlton O'ahu, Turtle Bay (collectively, the \"2024 Acquisitions\"), partially offset by the 2025 dispositions of The Westin Cincinnati and Washington Marriott at Metro Center (collectively, the \"2025 Dispositions\"). Comparable hotel RevPAR increased 0.2% and 3.5% for the quarter and year-to-date 2025, respectively, primarily due to the increase in room rates and strong transient demand, along with the continuing recovery in Maui, which collectively offset a decline in group demand due to difficult comparisons to prior year due to the timing of holidays and planned renovation disruption.\nComparable hotel Total RevPAR increased 0.8% and 3.7% for the third quarter and year-to-date of 2025, respectively, compared to 2024. For the quarter, the growth was led by our Atlanta, Maui and Oahu markets, with increases of 20.1%, 18.6% and 10.4%, respectively, compared to the third quarter of 2024. The outperformance in Atlanta compared to last year is primarily due to the completion of planned renovations that impacted the results in 2024, while Oahu saw increases in both rate and occupancy driven by strong group bookings, and Maui continued its recovery from the wildfires. These strong performances were partially offset by comparable hotel Total RevPAR declines in our Austin and New Orleans markets of 30.5% and 16.4%, respectively. Both markets were impacted by large-scale renovation projects at certain properties, while Austin was further impacted by the multi-year closure of the city's convention center that started earlier in 2025. At some of our larger markets, comparable hotel Total RevPAR increases in New York and San Francisco of 9.1% and 8.6%, respectively, due to strong citywides and transient demand, offset decreases in our Washington, D.C. and San Diego markets, of 12.9% and 9.9%, respectively, with both markets affected by large-scale renovation projects at certain properties.\nFor the third quarter and year-to-date 2025, operating profit margin under GAAP was 7.6% and 14.7%, respectively, a decline of 260 basis points and 220 basis points compared to the same periods in 2024, primarily due to a $24 million and $92 million decrease in net gains on insurance settlements recognized during the quarter and year-to-date, respectively. Comparable hotel EBITDA margin was 23.9% and 29.2%, for the third quarter and year-to-date 2025, respectively, a decline of 50 basis points and 40 basis points. Both the third quarter and year-to-date 2025 were affected by an increase in wages expense. Year-to-date growth in room rates was able to offset those increases, but was further affected by a decrease in net gains on insurance settlements for comparable hotels of $21 million.\nNet income, Adjusted EBITDAre and Adjusted FFO per share\nNet income increased $79 million and $41 million for the quarter and year-to-date 2025, respectively, as recent acquisitions, improvements in operating results and a $122 million gain on asset sales in the third quarter offset the declines in net gains on insurance settlements noted above and increases in interest expense and income taxes. These changes led to an increase in diluted earnings per share of $0.11, or 91.7%, and $0.07, or 8.3%, for the quarter and year-to-date, respectively. Adjusted EBITDA\n, which excludes gain on property insurance, gain on asset sale, depreciation, interest expense and taxes, decreased $11 million for the third quarter and increased $29 million year-to-date. For the quarter, improvements in revenues were offset by wage increases, while year-to-date exceeded 2024 as stronger improvements in room rates and earnings from the 2024 Acquisitions more than offset the decline in business interruption proceeds and wage increases. Adjusted FFO per diluted share decreased $0.01, or 2.8%, for the quarter and increased $0.01, or 0.6%, year-to-date, reflecting the changes in Adjusted EBITDA\nfurther reduced by increases in interest expense and income taxes, which are included in Adjusted FFO per diluted share but not Adjusted EBITDA\nDuring year-to-date 2025, strong leisure transient demand has led to year-over-year comparable hotel RevPAR improvement of 3.5%. Results reflect the improving leisure demand on Maui and an increase in transient revenue driven by higher average rates, particularly at our resorts. Overall, year-to-date results have not reflected material impacts from recent economic policy changes, including heightened tariffs; however, as anticipated, group demand declined in the third quarter primarily due to renovation disruption and a shift in the timing of holidays.\nFor the fourth quarter, we expect that demand will continue to be driven by transient business, as we anticipate continued softness in short-term group bookings due to persistent uncertainty surrounding trade and U.S. economic policy. Additionally, international inbound travel continues to face headwinds from shifting global travel patterns, as evolving trade and immigration policy tempers inbound demand, while outbound travel remains elevated. Broader risks to economic growth remain, including the economic effects of the ongoing government shutdown that began on October 1, 2025, high interest rates, geopolitical instability, and a labor market that, while not deteriorating sharply, appears increasingly stagnant as both labor participation and hiring momentum plateau. Despite these pressures, U.S. GDP growth consensus expectations for 2025 have been revised up to 1.9%, reflecting resilience in consumer spending and tech-driven investment. Nonetheless, this still represents a slowdown from 2.8% growth in 2024, and the outlook for the final quarter of 2025 remains cautious.\nHotel supply growth expectations remain below the historical average, although we expect to see above-average growth in a few markets where our hotels are located. Supply chain challenges, which may be exacerbated by current tariffs and trade policies, have resulted in project delays across the U.S., and a prolonged tight lending environment has created construction financing challenges for future projects. We anticipate that the construction pipeline will remain modest until macroeconomic uncertainty moderates and interest rates decline further.\nBased on the trends noted, we expect comparable hotel RevPAR growth for the full year 2025 will be approximately 3.0%, reflecting modest growth in the fourth quarter and the assumption of limited impacts from the government shutdown, which are comparable to what was experienced in October. In addition, we continue to expect margins to decline in comparison to 2024, driven by higher wages and benefits, including increases driven by new union contracts in certain cities.\nAs discussed above, the current outlook for the lodging industry remains uncertain, reflecting varying analyst assumptions surrounding the impact of trade policy, financial market volatility, reductions in government employment and escalating geopolitical conflicts. Therefore, there can be no assurances as to lodging demand performance for any number of reasons, including, but not limited to, deteriorating macroeconomic conditions.\nStrategic Initiatives\n\nItem 2. Management’s Discussion and Analysis of Financial Condition and Results of Operations\nThe following discussion and analysis should be read in conjunction with the unaudited condensed consolidated financial statements and related notes included elsewhere in this report. Host Inc. operates as a self-managed and self-administered REIT. Host Inc. is the sole general partner of Host L.P. and holds approximately 99% of its partnership interests. Host L.P. is a limited partnership operating through an umbrella partnership structure. The remaining common OP units are owned by various unaffiliated limited partners.\nForward-Looking Statements\nThe following factors, among others, could cause actual results and future events to differ materially from those set forth or contemplated in the forward-looking statements:\nthe effect on lodging demand of (i) changes in national and local economic and business conditions, including concerns about U.S. economic growth and the potential for an economic recession in the United States or globally, or as a result of recent economic uncertainty due to trade disputes, tariffs and other protecti"
}