{
  "source_file": "hsy-20250928.htm",
  "form_type": "10-Q",
  "item1_clean": null,
  "item7_clean": null,
  "item2_clean": "Item 2. MANAGEMENT’S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS\nThe MD&A is organized in the following sections:\nTrends Affecting Our Business\nConsolidated Results of Operations\nLiquidity and Capital Resources\nSafe Harbor Statement\nOVERVIEW\nHershey is a global confectionery leader known for making more moments of goodness through chocolate, sweets, mints and other great tasting snacks. We are the largest producer of quality chocolate in North America, a leading snack maker in the United States (“U.S.”) and a global leader in chocolate and non-chocolate confectionery. We market, sell and distribute our products under more than 90 brand names in approximately 70 countries worldwide.\nOur principal product offerings include chocolate and non-chocolate confectionery products; gum and mint refreshment products and protein bars; pantry items, such as baking ingredients, toppings and beverages; and snack items such as spreads, bars, and snack bites and mixes, popcorn and pretzels.\nBusiness Acquisitions\nOn March 31, 2025, we entered into a Merger Agreement to acquire LesserEvil, LLC, a privately held company that produces and sells organic popcorn and puffed snack products to retailers and distributors in the United States and Canada, which complements Hershey’s existing product portfolio. The Company expects the acquisition to close by the end of 2025, pending the expiration or termination of the applicable waiting period under the Hart-Scott-Rodino Antitrust Improvements Act of 1976 and satisfaction of other customary closing conditions.\nOn November 8, 2024, we completed the acquisition of the Sour Strips brand from Actual Candy, LLC. Sour Strips is an emerging sour candy brand and is available in a wide range of food distribution channels in the United States.\nTRENDS AFFECTING OUR BUSINESS\nThroughout the first\nnine months of 2025, we experienced net sales growth, positive changes in consumer behavior, and price inelasticity despite the persistent dynamic macroeconomic environment. However, increasing inflationary pressures, including ongoing price volatility for select commodities and higher manufacturing costs, continued to challenge the business and led to a decrease in net income. Despite a strategic pricing action in the third quarter combined with other specific actions taken to mitigate the gross margin pressures, our direct product inputs continue to be the primary incremental cost to our business (see\nConsolidated Results of Operations\nincluded in this MD&A). We utilize many exchange traded commodities for our business that are subject to price volatility, specifically cocoa products, which continued to experience elevated market prices compared to historical levels (see\nPart I, Item 3 - Quantitative and Qualitative Disclosures about Market Risk\nFurthermore, changes in global trade policies, including tariffs on U.S. imports, continue to increase global economic and political uncertainty. We are continuing to monitor the ongoing negotiations related to tariffs, specifically, goods imported into the U.S. from Canada, Mexico and other countries, as well as export markets, in which we have significant business operations, all of which may result in material adverse effects on our results of operations. The scope and length of tariffs, including their effects on the broader economy and our business, remain uncertain. These outcomes may be influenced by factors such as continued U.S. negotiations with impacted countries, retaliatory measures from other nations, possible tariff exemptions, public sentiment toward U.S. products and companies, and the domestic availability of lower-cost alternatives. We expect tariff expense to negatively impact our full year results.\nAdditionally, leadership changes at the U.S. Department of Health and Human Services and the U.S. Food and Drug Administration (“FDA”) earlier in 2025, as well as the Make America Healthy Again movement, subject the food industry to increasing laws and regulations, including nutrition, food date labeling and traceability recordkeeping requirements, as well as changes in consumer expectations and behavior. For example, in April 2025 the FDA announced that it would be phasing out the approved use of petroleum-based synthetic dyes in food products. Therefore, in an effort to be responsive to the evolving regulatory environment and to ensure consumers have options to fit their lifestyle while maintaining trust and confidence in our products, we announced our decision to remove all certified Food, Drug & Cosmetic colors from our great tasting snacks by the end of 2027. The estimated costs associated with this removal are not expected to have a material impact on our financial position, results of operations or liquidity.\nAs of September 28, 2025, we believe we have sufficient liquidity to satisfy our key strategic initiatives and other material cash requirements in both the short-term and in the long-term; however, we continue to evaluate and take action, as necessary, to preserve adequate liquidity and ensure that our business can operate effectively during the current economic environment. We continue to monitor our discretionary spending across the organization (see\nLiquidity and Capital Resources\nincluded in this MD&A).\nBased on the length and severity of the fluctuating macroeconomic environment, including price volatility for our commodities, the possibility of a recession, changes in consumer shopping and consumption behavior, and changes in geopolitical events, including the imposition of tariffs and retaliatory tariffs, we may continue to experience increasing supply chain costs, higher inflation and other impacts to our business. We will continue to evaluate the nature and extent of these evolving impacts on our business, consolidated results of operations, segment results, liquidity and capital resources.\nCONSOLIDATED RESULTS OF OPERATIONS\nIn millions of dollars except per share amounts\nSelling, marketing & administrative (“SM&A”) expenses\nSM&A expense as a percent of net sales\nBusiness realignment activities\nOperating profit margin\nInterest expense, net\nOther (income) expense, net\nProvision for income taxes\nEffective income tax rate\nNet income per share—diluted\nNOTE: Percentage changes may not compute directly as shown due to rounding of amounts presented above.\nResults of Operations - Third Quarter 2025 vs. Third Quarter 2024\nNet sales were $3,181.4 million in the third quarter of 2025 compared to $2,987.5 million in the same period of 2024, an increase of $193.9 million, or 6.5%. The net sales increase reflects a favorable price realization of approximately 6% primarily related to pricing actions within the North America Confectionery and International segments. Volume was slightly positive, driven by strong results in North America Salty Snacks and the timing of shipments in the International segment, partially offset by price elasticity impacts within the North America Confectionery segment. Additionally, the 2024 acquisition of Sour Strips contributed a minimal benefit and there was no impact from foreign currency exchange rates.\nKey U.S. Marketplace Metrics\nThe U.S. candy, mint and gum (“CMG”) consumer takeaway and market share information reflects measured channels of distribution accounting for approximately 90% of our U.S. confectionery retail business. These channels of distribution primarily include food, drug, mass merchandisers, and convenience store channels, plus Wal-Mart Stores, Inc., partial dollar, club and military channels. These metrics are based on measured market scanned purchases as reported by Circana, the Company’s market insights and analytics provider, and provide a means to assess our retail takeaway and market position relative to the overall category.\nFor the third quarter of 2025, our total U.S. retail takeaway increased 6.3% in the expanded multi-outlet combined plus convenience store channels (Circana MULO + C-Stores), which includes candy, mint, gum, salty snacks and grocery items. Our CMG consumer takeaway increased 5.4%, despite a CMG market share decrease of 4 basis points. Our Salty consumer takeaway increased 14.2% in the third quarter of 2025 and experienced a Salty market share increase of 48 basis points.\nCost of Sales and Gross Margin\nCost of sales were $2,144.1 million in the third quarter 2025 compared to $1,754.8 million in the same period of 2024, an increase of $389.3 million, or 22.2%. The increase was driven by higher costs, primarily due to unfavorable commodity costs from cocoa and tariffs. Mark-to-market activity on our commodity derivative instruments intended to economically hedge future years’ commodity purchases contributed a minimal impact (See\nPart I, Item 3 - Quantitative and Qualitative Disclosures About Market Risk\nGross margin was 32.6% in the third quarter of 2025\ncompared to 41.3% in the same period of 2024, a decrease of 870 basis points. The decrease was driven by unfavorable commodity and tariff costs and unfavorable mix, partially offset by net price realization, supply chain productivity and\nnet savings related to our AAA Initiative\nSM&A expenses were $600.5 million in the third quarter of 2025 compared to $591.9 million in the same period of 2024, an increase of $8.6 million, or 1.5%. Total advertising and related consumer marketing expenses decreased 5.0%, driven primarily by efficiencies in the North America Confectionery segment. SM&A expenses, excluding advertising and related consumer marketing, increased 5.0% in the third quarter of 2025, driven by higher compensation and consulting costs, partially offset by net savings related to our AAA Initiative.\nBusiness Realignment Activities\nWe periodically undertake business realignment activities designed to increase our efficiency and focus our business in support of our key growth strategies. Excluding the portion recorded within Cost of Sales and SM&A expenses (as noted above), we recorded bu"
}