{
  "source_file": "hubb-20250930.htm",
  "form_type": "10-Q",
  "item1_clean": null,
  "item7_clean": null,
  "item2_clean": "Selling & administrative (“S&A”) expense\nLess: Net income attributable to non-controlling interest\nNet income attributable to Hubbell Incorporated\nLess: Earnings allocated to participating securities\nNet income available to common shareholders\nAverage number of diluted shares outstanding\nDILUTED EARNINGS PER SHARE\nIn the following discussion of results of operations, we refer to “adjusted\noperating measures. We believe those adjusted measures, which exclude the impact of certain costs, gains and losses, may provide investors with useful information regarding our underlying performance from period to period and allow investors to understand our results of operations without regard to items that, in management's judgement, significantly affect the comparability of operating results, or are not considered to be components of our core operating performance.\nHUBBELL INCORPORATED\nSignificant items impacting comparability comprise the following:\nTransaction, integration and separation costs\nThe effect that acquisitions and divestitures may have on our results can fluctuate significantly based on the timing, size and number of transactions, and therefore result in significant volatility in the costs to complete transactions and to integrate or separate the businesses.\nTransaction costs are primarily professional services and other fees incurred to complete the transactions. Integration and separation costs are the internal and external incremental costs directly relating to these activities for the acquired or divested business.\nThe acquisition and integration of DMC Power will result in significant transaction and integration costs, and the acquisitions and dispositions completed by the company in the fourth quarter of 2023 resulted in a significant increase in transaction, integration and separation costs. As a result, we believe excluding such costs relating to these transactions provides useful and more comparable information for investors to better assess our operating performance from period to period.\nGains or losses on disposition of a business\nCertain of the Company's adjusted measures exclude these gains or losses because we believe they enhance management's and investors' ability to analyze underlying business performance and facilitate comparisons of our financial results over multiple periods. In the first quarter of 2024 the Company recognized a\npre-tax loss on the disposition of the residential lighting business and also recognized $6.8 million of income tax expense relating to that transaction, primarily driven by differences between book and tax basis in goodwill. In the second quarter of 2025 the Company recognized a\npre-tax loss on the disposition of a product line in the Electrical Solutions segment. Those losses and the related income tax expense are excluded from our adjusted operating measures.\nAmortization of intangible assets\nThe Company believes that the exclusion of these non-cash expenses (i) enhances management’s and investors’ ability to analyze underlying business performance, (ii) facilitates comparisons of our financial results over multiple periods, and (iii) provides more relevant comparisons of our results with the results of other companies as the amortization expense associated with these assets may fluctuate significantly from period to period based on the timing, size, nature, and number of acquisitions. Although we exclude amortization of these acquired intangible assets and inventory step-up from our non-GAAP results, we believe that it is important for investors to understand that revenue generated, in part, from such intangibles is included within revenue in determining adjusted net income attributable to Hubbell Incorporated.\nAdjusted results also excluded the income tax effects of the above adjustments which are calculated using the statutory tax rate, taking into consideration the nature of the item and the relevant taxing jurisdiction, unless otherwise noted.\nOrganic net sales (or organic net sales growth), a non-GAAP measure, represents Net sales according to U.S. GAAP, less Net sales from acquisitions and divestitures during the first twelve months of ownership or divestiture, respectively, less the effect of fluctuations in Net sales from foreign currency exchange. The period-over-period effect of fluctuations in Net sales from foreign currency exchange is calculated as the difference between local currency Net sales of the prior period translated at the current period exchange rate as compared to the same local currency Net sales translated at the prior period exchange rate. We believe this measure provides management and investors with a more complete understanding of the underlying operating results and trends of established, ongoing operations by excluding the effect of acquisitions, dispositions and foreign currency as these activities can obscure underlying trends. When comparing Net sales growth between periods, excluding the effects of acquisitions, business dispositions and currency exchange rates, those effects are different when comparing results for different periods. For example, because Net sales from acquisitions are considered inorganic from the date we complete an acquisition through the end of the first year following the acquisition, Net sales from such acquisitions are reflected as organic net sales thereafter.\nHUBBELL INCORPORATED\nThere are limitations to the use of non-GAAP measures. Non-GAAP measures do not present complete financial results. We compensate for this limitation by providing a reconciliation between our non-GAAP financial measures and the respective most directly comparable financial measure calculated and presented in accordance with GAAP. Because non-GAAP financial measures are not standardized, it may not be possible to compare these financial measures with other companies’ non-GAAP financial measures having the same or similar names. These financial measures should not be considered in isolation from, as substitutes for, or alternative measures of, reported GAAP financial results, and should be viewed in conjunction with the most comparable GAAP financial measures and the provided reconciliations thereto. We believe, however, that these non-GAAP financial measures, when viewed together with our GAAP results and related reconciliations, provide a more complete understanding of our business. We strongly encourage investors to review our consolidated financial statements and publicly filed reports in their entirety and not rely on any single financial measure.\nThe following table reconciles Adjusted operating income, a non-GAAP measure, to Operating income, the directly comparable GAAP financial measure (in millions):\n\nAdjusted net income attributable to Hubbell Incorporated (non-GAAP measure)\nLess: Earnings allocated to participating securities\nAdjusted net income available to common shareholders (non-GAAP measure)\nThe income tax effects are calculated using the statutory tax rate, taking into consideration the nature of the item and the relevant taxing jurisdiction, unless otherwise noted.\nThe following table reconciles our organic net sales to the directly comparable GAAP financial measure (in millions and percentage change):\nThree Months Ended September 30,\nNet sales growth (GAAP measure)\nImpact of acquisitions\nImpact of divestitures\nForeign currency exchange\nOrganic net sales growth (non-GAAP measure)\nHUBBELL INCORPORATED\nNet sales of $1,502.4 million in the third quarter of 2025 increased by $59.8 million compared to the third quarter of 2024.\nOrganic net sales increased by 3.2% driven by a mid single digit percentage increase in price realization, while volumes were down low single digits. Acquisitions contributed an 0.8% increase to Net sales, while foreign exchange resulted in a 0.1% increase in Net sales. These changes are discussed in more detail in the Segment Results section below.\nCost of Goods Sold and Gross Profit\nAs a percentage of Net sales, cost of goods sold decreased by 110 basis points to 63.8% in the third quarter of 2025, resulting in gross profit margin expanding to 36.2%.\nApproximately five percentage points of gross profit margin expansion was driven by favorable price realization, improved operational productivity, and lower acquisition-related intangible asset amortization, partially offset by approximately four percentage points of gross profit margin contraction due to material and other cost inflation, including tariff expense.\nSelling & Administrative Expenses\nS&A expense in the third quarter of 2025 was $213.7 million and increased by $20.4 million or 10.6% compared to the prior year period.\nThis increase was primarily driven by higher acquisition-related intangible asset amortization, higher professional service costs and higher restructuring costs in the current year compared to the prior year.\nS&A expense as a percentage of Net sales was 14.2% in the\n\nThe following table reconciles our Utility Solutions segment organic net sales to the directly comparable GAAP financial measure (in millions and percentage change):\nThree Months Ended September 30,\nNet sales growth (GAAP measure)\nImpact of acquisitions\nImpact of divestitures\nForeign currency exchange\nOrganic net sales growth (decline) (non-GAAP measure)\nNet sales in the Utility Solutions segment in the third quarter of 2025 were $943.8 million, and increased by $10.7 million, or 1.2%, as compared to the third quarter of 2024\n. That increase was driven by a 0.5% increase in organic net sale\ns, and a 0.6% increase due to acquisitions. The increase in organic net sales was driven by a low single digit increase in price realization, partially offset by a low single digit decrease due to volume. The decrease in volume reflects strength in transmission, distribution and sub station markets, which was more than offset by a decline in G\nrid Automation due to weak AMI and meter project activity.\nOperating income in the Utility Solutions segment for the t"
}