{
  "source_file": "hubb-20241231.htm",
  "form_type": "10-K",
  "item1_clean": "Utility Solutions Segment\nHubbell Utility Solutions has leading positions In Front of the Meter and on The Edge. The Utility Solutions segment (64% of consolidated revenues in 2024, 61% in 2023 and 58% in 2022) consists of businesses that design, manufacture, and sell a wide variety of electrical distribution, transmission, substation, and telecommunications products, which support applications In Front of the Meter. This includes utility transmission & distribution (T&D) components such as arresters, insulators, connectors, anchors, bushings, enclosures, cutouts and switches. The Utility Solutions segment also offers solutions that serve The Edge of the utility infrastructure, including smart meters, communications systems, and protection and control devices. Hubbell Utility Solutions supports the electrical distribution, electrical transmission, water, gas distribution, telecommunications, and solar and wind markets. While Hubbell believes its sales in this area are not materially dependent upon any customer or group of customers, a substantial variability in purchases by electrical utilities would affect this segment.\nProducts of the Utility Solutions segment are sold under various brands and/or trademarks into the electrical distribution, substation and transmission markets as well as, markets for grid protection and controls, utility meters and advanced metering infrastructure and telcom and gas distribution markets. The products are sold into these markets primarily through distributors, or directly to utilities. Brands and/or trademarks of products of the Utility Solutions segment include:\nUSCO™\nCDR™\nPCORE®\nEMC™\nAEC™\nElectro Industries / Gauge Tech™\nHUBBELL INCORPORATED\nElectrical Solutions Segment\nHubbell Electrical Solutions is positioned Behind the Meter, providing key components to building operators and industrial customers that enable them to manage their energy and operate critical infrastructure more efficiently and effectively. The Electrical Solutions segment (36% of consolidated revenues in 2024, 39% in 2023 and 42% in 2022) comprises businesses that sell stock and custom products including standard and special application wiring device products, rough-in electrical products, and connector and grounding products, as well as other electrical equipment.\nProducts of the Electrical Solutions segment have applications in the light industrial, non-residential, wireless communications, transportation, data center, and heavy industrial markets. Electrical Solutions segment products are typically used in and around industrial, commercial and institutional facilities by electrical contractors, maintenance personnel, electricians, utilities, and telecommunications companies. In addition, certain of our businesses design and manufacture industrial controls and communication systems used in the non-residential and industrial markets. Many of these products are designed such that they can also be used in harsh and hazardous locations where a potential for fire and explosion exists due to the presence of flammable gasses and vapors. Harsh and hazardous products are primarily used in the oil and gas (onshore and offshore) and mining industries. We also offer a variety of wiring devices and electrical products that have residential and utility applications.\nIn December 2023, the Company entered into a definitive agreement to sell its residential lighting business for a cash purchase price of $131 million, subject to customary adjustments. The residential lighting business sells indoor and outdoor lighting solutions. The business generated $187.1 million in sales in 2023. The assets and liabilities of this business are recorded in assets and liabilities held for sale in the Consolidated Balance Sheet as of December 31, 2023.\nThe transaction closed in the first quarter of 2024 and the Company recorded a pre-tax loss on the sale of $5.3 million, which is recorded within Total other expense in the Company\ns Consolidated Statement of Income.\n\nHubbell experiences substantial competition in all categories of its business, but does not compete with the same companies in all of its product categories. The number and size of competitors vary considerably depending on the product line. Hubbell cannot specify with precision the number of competitors in each product category or their relative market position. However, some of its competitors are larger companies with substantial financial and other resources. Hubbell considers product performance, reliability, quality and technological innovation to be important factors relevant to all areas of its business and considers its reputation as a manufacturer of quality products to be an important factor in its business. In addition, product price, service levels and other factors can affect Hubbell’s ability to compete.\nHUBBELL INCORPORATED\n\nSee Note 21 — Industry Segments and Geographic Area Information in the Notes to Consolidated Financial Statements and Item 1A. Risk Factors relating to manufacturing in and sourcing from foreign countries.\nWe have an extensive customer base of distributors, wholesalers, electric utilities, OEMs, electrical contractors, telecommunications companies and retail and hardware outlets. We are not dependent on a single customer, however, our top ten customers account for approximately 41% of our Net sales.\nRaw materials used in the manufacture of Hubbell products primarily include steel, aluminum, brass, copper, bronze, zinc, nickel, plastics, elastomers and petrochemicals. Hubbell also purchases certain electrical and electronic components, including solenoids, printed circuit boards, integrated circuit chips and cord sets, from a number of suppliers. Hubbell is not materially dependent upon any one supplier for raw materials used in the manufacture of its products and equipment however the cost and supply of these materials may be affected by disruptions in availability of raw materials, components or sourced finished goods. See also Item 7A. Quantitative and Qualitative Disclosures about Market Risk.\n\nLike other companies engaged in similar businesses, the Company has incurred or acquired through business combinations, remedial response and voluntary cleanup costs for site contamination, and is a party to product liability and other lawsuits and claims associated with environmental matters, including past production of products containing toxic substances. Additional lawsuits, claims and costs involving environmental matters are likely to continue to arise in the future. However, considering past experience and reserves, the Company does not anticipate that these matters will have a material adverse effect on earnings, capital expenditures, financial condition or competitive position. See also Item 1A. Risk Factors and Note 16 — Commitments and Contingencies in the Notes to Consolidated Financial Statements.\nOur commitment to developing our employees is one of four pillars that guide Hubbell as a company. We recruit, hire, and develop talent that meets and anticipates the ever-changing needs of our enterprise and our stakeholders. Hubbell provides market-competitive compensation, health and well-being programs, and retirement benefits based on the countries and markets in which we operate to motivate market-leading performance.\nAs of December 31, 2024, Hubbell had approximately 17,700 salaried and hourly employees of whom approximately 10,600, or 60% are located in the United States. Approximately 2,470 of these U.S. employees are represented by 8 labor unions. Hubbell considers its labor relations to be satisfactory and regularly engages with its labor unions.\nHubbell is committed to fostering an environment that respects and encourages individual differences, diversity of thought, and talent. We strive to create a workplace where employees feel that their contributions are welcomed and valued, allowing them to fully engage their talents and training in their work, while generating personal satisfaction in their role within Hubbell.\nAcross the enterprise, there are a variety of ways we invest in our people to learn - on the job, in the classroom, through self-directed learning, or through leadership programs. We have expanded our learning management system (known as Hubbell University) to make new content and training available to our employees. The Company has also expanded leadership development programs to provide career development to employees at all levels and continues to expand its Campus Programs to foster a pipeline of early career talent at Hubbell.\nThe Company also encourages its employees to give back to their communities. The Company supports employees’ spirit of volunteerism in their communities throughout the year with its Volunteer Paid Time Off policy, which provides all employees with up to 8 hours of paid time off a year to volunteer with an eligible 501(c)(3) charity of their choice.\nAs a manufacturing company, we focus on protecting the health and safety of our employees and educate employees on how to Think Safe, Work Safe and Go Home Safe. We dedicate resources to track and monitor safety and recordable incidents using an enterprise-wide data management system. Through the Company’s myLife program, the Company also provides comprehensive, competitive benefits that retain and support our employees’ health, wealth and peace of mind.\nThe Elevate Employee Experience Survey (Elevate) is conducted annually across Hubbell. It is our employees’ opportunity to share perspectives on topics important to them. In 2024, the third year of the survey, Hubbell saw continued strong engagement with over 88% of Hubbell’s employees participating worldwide. The feedback provided through Elevate is then used to create action plans at all of Hubbell’s locations. In 2024, employees shared that they wanted to better understand Hubbell’s long term strategies and how their roles contribute. Hubbell launched “Align 2027” for all employees in mid-2024. This was an interactive learning experience where cross-functional teams locally or virtually worked through an exercise that brought to life Hubbell’s refreshed brand, Vision, Mission, Core Values, key markets, products, history and strategic objectives. Employees were afforded time to connect and better understand how each of their roles fit together to better help Hubbell achieve a common purpose. This experience was a demonstration of how Hubbell implements employee feedback from the Elevate survey into action.\nHUBBELL INCORPORATED\nInformation about our Executive Officers\nChairman of the Board, President and Chief Executive Officer\nPresent position since May 2021; previously President and Chief Executive Officer since October 2020; President and Chief Operating Officer June 2019 to October 2020; Group President, Power Systems February 2014 to June 2019; various other positions at Hubbell 1988 to 2014.\nExecutive Vice President,\nChief Financial Officer\nPresent position since May 2020; previously, Executive Vice President, Chief Financial Officer and Treasurer June 2019 to May 2020; Senior Vice President and Chief Financial Officer 2012 to 2019; Vice President, Corporate Strategy and Development August 2008 to June 2012; also a member of the board of directors of MSA Safety Incorporated since February 2019.\nJonathan M. Del Nero\nVice President, Controller\nPresent position since January 2021; previously, Assistant Controller 2014 to January 2021.\nChief Human Resources Officer\nPresent position since February 2022; previously Vice President, Compensation, Benefits & HR Systems from 2014 to February 2022; Chief of Staff to the Chief Executive Officer from June 2021 to February 2022.\nPresident, Utility Solutions Segment\nPresent position since July 2023; previously President and CEO, Bosch Rexroth, September 2020 to June 2023; Vice President & General Manager Electrical Energy Automation Solutions Business, Eaton Corporation 2015 to May 2020.\nSenior Vice President,",
  "item7_clean": "Adjusted net income from continuing operations attributable to Hubbell Incorporated (non-GAAP measure)\nLess: Earnings allocated to participating securities\nAdjusted net income from continuing operations available to common shareholders (non-GAAP measure)\nAverage number of diluted shares outstanding\nAdjusted diluted earnings per share from continuing operations\nThe income tax effects are calculated using the statutory tax rate, taking into consideration the nature of the item and the relevant taxing jurisdiction, unless otherwise noted.\nHUBBELL INCORPORATED\nThe following table reconciles our Organic Net sales growth to the directly comparable GAAP financial measure (in millions and percentage change):\nFor the Year Ended December 31,\nNet sales growth (GAAP measure)\nImpact of acquisitions\nImpact of divestitures\nForeign currency exchange\nOrganic Net sales growth (non-GAAP measure)\n2024 Compared to 2023\nNet sales of $5,628.5 million in 2024 increased by $255.6 million, or 4.7%, compared to 2023. Organic net sales were flat driven by a low single digit percentage increase in price realization, partially offset by a low single digit percentage decrease in unit volume. Acquisitions net of divestitures contributed 4.8% to net sales growth. These changes are discussed in more detail in the Segment Results section below.\nCost of Goods Sold and Gross Profit\nAs a percentage of net sales, cost of goods sold increased by 130 basis points to 66.2% and gross profit margin declined to 33.8% in 2024. The decline in gross profit margin includes approximately four percentage points of margin contraction due to higher intangible amortization expense, material and other cost inflation and lower volume, which was partially offset by approximately three percentage points of margin expansion driven by favorable price realization, productivity and cost management.\nSelling & Administrative Expenses\nS&A expense in 2024 was $812.5 million and decreased by $37.1 million compared to the prior year. This decrease was driven by lower employee incentive costs and lower professional services in the current year, transaction costs in 2023 that did not repeat in 2024, partially offset by the addition of S&A expense including intangible amortization expense related to our 2023 acquisitions. S&A expense as a percentage of Net sales decreased by 140 basis points to 14.4% in 2024.\nTotal other expense increased by $31.1 million in 2024 to $86.3 million compared to the prior year, primarily due to a $37.1 million increase in net interest expense and a $5.3 million loss recognized on the disposition of the residential lighting business in 2024, partially offset by $7.2 million in 2024 of TSA income related to the disposal of the residential lighting business and lower non service pension cost. The increase in interest expense was primarily attributable to debt incurred in connection with the acquisition of Systems Control.\nThe effective tax rate was 22.1% in both 2024 and 2023 as the income tax expense related to the sale of the residential lighting business in the first quarter of 2024, was largely offset by the tax benefit of an international restructuring completed in the third quarter of the year.\nNet Income Attributable to Hubbell Incorporated and Earnings Per Diluted Share\nNet income attributable to Hubbell Incorporated was $777.8 million in 2024 and increased 2.4% as compared to 2023\n. As a result, earnings per diluted share in 2024 increased 2.3% compared to 2023. Adjusted net income attributable to Hubbell Incorporated, which excluded amortization of acquisition-related intangibles and transaction, integration & separation costs in both periods, and a loss on disposition of a business in 2024 was $896.8 million in 2024 and increased 8.1% as compared to 2023.\nHUBBELL INCORPORATED\n\nHUBBELL INCORPORATED\nAdjusted Operating Measures\nIn the following discussion of results of operations, we refer to\noperating measures. We believe those adjusted measures, which exclude the impact of certain costs, gains and losses, may provide investors with useful information regarding our underlying performance from period to period and allow investors to understand our results of operations without regard to items that, in management\ns judgment, significantly affect the comparability of operating results, or we do not consider a component of our core operating performance.\nSignificant items impacting comparability:\nTransaction, integration and separation costs\nThe effect that acquisitions and divestitures may have on our results can fluctuate significantly based on the timing, size and number of transactions, and therefore result in significant volatility in the costs to complete transactions and to integrate or separate the businesses.\nThe size of acquisition and divestiture actions taken by the Company in the fourth quarter of 2023 has resulted in a significant increase in these costs. As a result, we believe excluding costs relating to these fourth quarter transactions provides useful and more comparable information to investors to better assess our operating performance.\nTransaction costs are primarily professional services and other fees incurred to complete the transactions. Integration and separation costs are the internal and external incremental costs directly relating to these activities for the acquired or divested business.\nGains or losses on disposition of a business\nOur adjusted operating measures exclude these gains or losses because we believe excluding them enhances management’s and investors’ ability to analyze underlying business performance and facilitates comparisons of our financial results over multiple periods. In the first quarter of 2024 the Company recognized a $5.3 million pre-tax loss on the disposition of the residential lighting business and also recognized $6.8 million of income tax expense on the sale of the residential lighting business, primarily driven by differences between book and tax basis in goodwill. That loss and the related income tax expense are excluded from our adjusted operating measures.\nAmortization of intangible assets\nAdjusted operating measures also exclude non-cash amortization of all intangible assets associated with our business acquisitions, including inventory step-up amortization associated with those acquisitions. The intangible assets associated with our business acquisitions arise from the allocation of the purchase price using the acquisition method of accounting in accordance with Accounting Standards Codification 805, “Business Combinations.” These assets consist primarily of customer relationships, developed technology, trademarks and tradenames, and patents, as reported in Note 7 – Goodwill and Other Intangible Assets, under the heading “Total Definite-Lived Intangibles\nwithin the Notes to Consolidated Financial Statements.\nThe Company believes that the exclusion of these non-cash expenses (i) enhances management’s and investors’ ability to analyze underlying business performance, (ii) facilitates comparisons of our financial results over multiple periods, and (iii) provides more relevant comparisons of our results with the results of other companies as the amortization expense associated with these assets may fluctuate significantly from period to period based on the timing, size, nature, and number of acquisitions. Although we exclude amortization of these acquired intangible assets and inventory step-up from our non-GAAP results, we believe that it is important for investors to understand that revenue generated, in part, from such intangibles is included within revenue in determining adjusted net income attributable to Hubbell Incorporated.\nAdjusted results also exclude the income tax effects of the above adjustments which are calculated using the statutory tax rate, taking into consideration the nature of the item and the relevant taxing jurisdiction, unless otherwise noted.\nThe Company excludes these non-core items because we believe it enhances management\nability to analyze underlying business performance and facilitates comparisons of our financial results over multiple periods. Refer to the reconciliation of non-GAAP measures presented below, Note 4 – Business Acquisitions and Dispositions, for additional information.\nHUBBELL INCORPORATED\n\nThe following table reconciles our Utility Solutions segment adjusted operating income and adjusted operating margin to the directly comparable GAAP financial measure (in millions and percentage change):\nFor the Year Ended December 31,\nOperating income (GAAP measure)\nAmortization of acquisition-related intangible assets\nTransaction, integration & separation costs\nAdjusted operating income\nOperating margin (GAAP measure)\nAdjusted operating margin\nThe following table reconciles our Utility Solutions segment Organic Net sales growth to the directly comparable GAAP financial measure (in millions and percentage change):\nFor the Year Ended December 31,\nNet sales growth (GAAP measure)\nImpact of acquisitions\nImpact of divestitures\nForeign currency exchange\nOrganic Net sales (decline) growth (non-GAAP measure)\nNet sales in the Utility Solutions segment in 2024 were approximately $3.6 billion, an increase of 10.4% as compared to 2023. This increase was driven by a 12.9% increase in net sales from acquisitions, partially offset by a 2.4% decrease in organic net sales driven by a mid single digit percentage decrease in unit volumes partially offset by a low single digit increase in price realization. The decrease in unit volume resulted largely from volume declines in enclosures products primarily driven by weakness in the telcom market, as well as customer inventory management in distribution markets. These factors were partially offset by strong growth in transmission and substation markets and in grid automation projects.\nOperating income in the Utility Solutions segment in 2024 was $729.8 million an increase of 3.3% compared to 2023. Operating margin declined by 140 basis points to 20.3% in 2024. Excluding amortization of acquisition-related intangibles and transaction, integration & separation costs, the adjusted operating margin declined by 40 basis points to 23.5% as compared to the prior year. The decrease in operating margin and adjusted operating margin includes approximately three percentage points of margin expansion from favorable price realization, improved productivity and cost management, but that expansion was more than offset by approximately three percentage points of margin contraction due to material and other cost inflation and lower unit volume. The impact of lower unit volume includes approximately 130 basis points from enclosures products, driven primarily by weakness in the telcom market.\nHUBBELL INCORPORATED\nElectrical Solutions\nThe following table reconciles our Electrical Solutions segment adjusted operating income and adjusted operating margin to the directly comparable GAAP measure (in million and percentage change):\nFor the Year Ended December 31,\nOperating income (GAAP measure)\nAmortization of acquisition-related intangible assets\nTransaction, integration & separation costs\nAdjusted operating income\nOperating margin (GAAP measure)\nAdjusted operating margin\nThe following table reconciles our Electrical Solutions segment Organic Net sales growth to the directly comparable GAAP financial measure (in millions and percentage change):\nFor the Year Ended December 31,\nElectrical Solutions\nNet sales (decline) growth (GAAP measure)\nImpact of acquisitions\nImpact of divestitures\nForeign currency exchange\nOrganic Net sales growth (decline) (non-GAAP measure)\nNet sales of the Electrical Solutions segment in 2024 were approximately $2.0 billion, a decrease of $83.4 million, or 3.9% as compared to 2023. The decrease includes 3.8% growth in organic net sales, that was more than offset by a 7.7% decline in net sales resulting from the disposition of the residential lighting business during the first quarter of 2024. The increase in organic net sales was driven by a low single digit percentage increase in unit volumes and a low single digit percentage increase in price realization. Volume growth was driven primarily by strength in renewables markets and datacenter balance-of-system products, while industrial markets were solid and non residential markets were soft.\nOperating income of the Electrical Solutions segment in 2024 was $361.8 million and increased approximately 9.0% compared to 2023, while operating margin in 2024 increased by 210 basis points to 17.8%. Excluding amortization of acquisition-related intangibles and transaction, integration & separation costs, the adjusted operating margin increased by 240 basis points to 19.0% in 2024. The increase in the operating margin and adjusted operating margin in 2024 was primarily due to approximately five percentage points of margin expansion from favorable price realization, improved productivity and higher volume. The disposition of the residential lighting business also contributed to the expansion. Those factors were partially offset by approximately three percentage points of margin contraction driven by higher material and other cost inflation.\nHUBBELL INCORPORATED\n\nThe general impact of inflation on our business, including the impact on raw materials costs, elevated interest rates and increased energy costs and our ability to implement and maintain pricing actions that we have taken to cover higher costs and protect our margin profile.\nEconomic and business conditions in particular industries, markets or geographic regions, as well the potential for macro-economic effects of the U.S. government federal deficit, and continued inflation, a significant economic slowdown, stagflation or recession.\nEffects of unfavorable foreign currency exchange rates and the potential use of hedging instruments to hedge the exposure to fluctuating rates of foreign currency exchange on inventory purchases.\nSupply chain disruptions and availability, costs\nand quantity of raw materials, purchased components, energy and freight.\nChanges in demand for our products, market conditions, product quality, or product availability adversely affecting sales levels.\nAbility to effectively develop and introduce new products.\nChanges in markets or competition adversely affecting realization of price increases.\nContinued softness in the telecommunication markets and residential market of Electrical Solutions.\nContinued softness in the residential market.\nFailure to achieve projected levels of efficiencies, and maintain cost savings and cost reduction measures, including those expected as a result of our lean initiatives and strategic sourcing plans.\nImpacts of increased trade tariffs, import quotas or other trade restrictions or measures taken by the United States, United Kingdom and other countries, including the recent and potential changes in U.S. trade policies that may be made by the new presidential administration.\nFailure to comply with import and export laws.\nChanges relating to impairment of our goodwill and other intangible assets.\nInability to access capital markets or failure to maintain our credit ratings.\nChanges in expected or future levels of operating cash flow, indebtedness and capital spending.\nRegulatory issues, changes in tax laws and policies, including changes in current U.S. income tax rates multijurisdictional implementation of the OECD’s comprehensive base erosion and profit shifting plan, or changes in geographic profit mix affecting tax rates and availability of tax incentives.\nA major disruption in one or more of our manufacturing or distribution facilities or headquarters, including the impact of plant consolidations and relocations.\nChanges in our relationships with, or the financial condition or performance of, key distributors and other customers, agents or business partners which could adversely affect our results of operations.\nImpact of productivity improvements on lead times, qu",
  "item2_clean": null
}