{
  "source_file": "hum-20241231.htm",
  "form_type": "10-K",
  "item1_clean": "(dollars in millions)\nIntersegment revenues:\nTotal intersegment revenues\nExternal services revenue:\nTotal external services revenue\nn/a – not applicable\nOur pharmacy solutions business includes the operations of CenterWell Pharmacy (our mail-order pharmacy business), CenterWell Specialty Pharmacy, and other retail pharmacies located within CenterWell Primary Care clinics for brand, generic, specialty drugs, over the counter medications and supplies, as well as hospice pharmacy drugs.\nWe operate full-service, value-based senior focused primary care centers in a number of states, including Georgia, Florida, Indiana, Kansas, Kentucky, Louisiana, Mississippi, Missouri, Nevada, North Carolina, South Carolina, Tennessee, Texas, and Virginia staffed by primary care providers and medical specialists with a primary focus on the senior population under our Primary Care Organization, or PCO. PCO operates these clinics primarily under the Conviva Senior Primary Care and CenterWell Senior Primary Care brands. Our primary care subsidiaries operate our medical center business through both employed physicians and care providers, and through third-party management service organizations with whom we contract to arrange for and manage certain clinical services. PCO currently operates 344 primary care clinics and employs approximately 1,000 primary care providers. PCO serves approximately 390,500 patients, primarily under risk sharing arrangements with Humana Medicare Advantage health plans, third-party Medicare Advantage health plans and CMS administered risk sharing arrangements for Original Medicare.\nPCO also operates a Medical Services Organization, or MSO, through Conviva and CenterWell that coordinates medical care for Medicare Advantage beneficiaries across multiple states. This MSO provides resources in care coordination, financial risk management, clinical integration and patient engagement that help physicians improve the patient experience as well as care outcomes. PCO’s MSO collaborates with physicians, medical groups and integrated delivery systems to successfully transition to value-based care by engaging, partnering and offering practical services and solutions.\nCenterWell Home Health\nWe operate CenterWell Home Health, one of the nation's largest home health providers, through which we are actively involved in the care management of our customers with the greatest needs via in-home care. CenterWell Home Health has locations in 40 states, providing extensive geographic coverage with approximately 65% overlap with our individual Medicare Advantage membership. Our home solutions geographic scale and clinical breadth provides the opportunity to offer care beyond our health plan members. Through the integration of these home health operations, we are focused on accelerating clinical innovation and the development and roll out of a value-based operating model at scale, more closely aligning incentives to focus on improving patient outcomes and reducing the total cost of care. This is critical to deploying a value-based, advanced home health model at scale that makes it easier for patients and providers to benefit from our full continuum of home-based capabilities, leveraging the best channel to deliver the right care needed at the right time.\nOneHome serves as the convener for the value-based model meeting the needs of health plans by serving their members through a full-risk model for integrated home-based services. OneHome manages a full range of post-acute patient needs, integrating and coordinating with physicians, hospitals and health plans for the provision of home health and infusion services as well as the distribution of durable medical equipment, or DME, at patients’ homes.\nInsurance Medical Membership\nThe following table summarizes total insurance medical membership (in thousands) at December 31, 2024, by market and product:\nInsurance Medical Membership\nCommercial fully-insured\nTRICARE\nProvider Arrangements\nWe provide our members with access to health care services through our networks of health care providers whom we employ or with whom we have contracted, including hospitals and other independent facilities such as outpatient surgery centers, primary care providers, specialist physicians, dentists, and providers of ancillary health care services and facilities. These ancillary services and facilities include laboratories, ambulance services, medical\nequipment services, home health agencies, mental health providers, rehabilitation facilities, nursing homes, optical services, and pharmacies. Our membership base and the ability to influence where our members seek care generally enable us to obtain contractual discounts with providers.\nWe use a variety of techniques to provide access to effective and efficient use of health care services for our members. These techniques include the coordination of care for our members, product and benefit designs, hospital inpatient management systems, the use of sophisticated analytics, and enrolling members into various care management programs. The focal point for health care services in many of our HMO networks is the primary care provider who, under contract with us, provides services to our members, and may control utilization of appropriate services by directing or approving hospitalization and referrals to specialists and other providers. Some physicians may have arrangements under which they can earn bonuses when certain target goals relating to the provision of quality patient care are met. We have available care management programs related to complex chronic conditions such as congestive heart failure and coronary artery disease. We also have programs for prenatal and premature infant care, asthma related illness, end stage renal disease, diabetes, cancer, and certain other conditions.\nWe typically contract with hospitals on either (1) a per diem rate, which is an all-inclusive rate per day, (2) a case rate for diagnosis-related groups (DRG), which is an all-inclusive rate per admission, or (3) a discounted charge for inpatient hospital services. Outpatient hospital services generally are contracted at a flat rate by type of service, ambulatory payment classifications, or APCs, or at a discounted charge. APCs are similar to flat rates except multiple services and procedures may be aggregated into one fixed payment. These contracts are often multi-year agreements. Outpatient surgery centers and other ancillary providers typically are contracted at flat rates per service provided or are reimbursed based upon a nationally recognized fee schedule such as the Medicare allowable fee schedule.\nOur contracts with physicians typically are renewed automatically each year, unless either party gives written notice, generally ranging from 90 to 120 days, to the other party of its intent to terminate the arrangement. Most of the physicians in our PPO networks and some of our physicians in our HMO networks are reimbursed based upon a fixed fee schedule, which typically provides for reimbursement based upon a percentage of the standard Medicare allowable fee schedule.\nThe terms of our contracts with hospitals and physicians may also vary between Medicare and Medicaid business. A significant portion of our Medicare network contracts, including those with both hospitals and physicians, are tied to Medicare reimbursement levels and methodologies.\nWe offer providers a continuum of opportunities to increase the integration of care and offer assistance to providers in transitioning from a fee-for-service to a value-based arrangement. These include performance bonuses, shared savings and shared risk relationships. For some of our medical membership, we share risk with providers under capitation contracts where physicians and hospitals accept varying levels of financial risk for a defined set of membership. Under the typical capitation arrangement, we prepay these providers a monthly fixed-fee per member, known as a capitation (per capita) payment, to cover all or a defined portion of the benefits provided to the capitated member.\nWe believe these value-based arrangements represent a key element of our integrated care delivery model at the core of our strategy. Our health plan subsidiaries may enter into these value-based arrangements with third-party providers or our owned provider subsidiaries.\nAt December 31, 2024, approximately 2,361,500 members, or 14.4%, of our medical membership, were covered under shared risk value-based arrangements, which provide all member benefits, including 2,114,900 individual Medicare Advantage members, or 38.0%, of our total individual Medicare Advantage membership.\nPhysicians under capitation arrangements typically have stop loss coverage so that a physician’s financial risk for any single member is limited to a maximum amount on an annual basis. We typically process all claims and measure the financial performance of our capitated providers and require guarantees in certain instances. However,\nwe delegated claim processing functions under capitation arrangements covering approximately 304,400 members, including 303,500 individual Medicare Advantage members, or 14.4%, of the 2,114,900 individual Medicare Advantage members covered under shared risk value-based contracts at December 31, 2024, with the provider assuming substantially all the risk of coordinating the members’ health care benefits. Capitation expense under delegated arrangements for which we have a limited view of the underlying claims experience was approximately $3.6 billion, or 3.6%, of total benefits expense, for the year ended December 31, 2024. We remain financially responsible for health care services to our members in the event our providers fail to provide such services.\nAccreditation Assessment\nOur accreditation assessment program consists of several internal programs, including those that credential providers and those designed to meet the audit standards of federal and state agencies as well as external accreditation standards. We also offer quality and outcome measurement and improvement programs such as the Health Care Effectiveness Data and Information Set, or HEDIS, which is used by employers, government purchasers and the National Committee for Quality Assurance (NCQA) to evaluate health plans based on various criteria, including effectiveness of care and member satisfaction.\nProviders participating in our networks must satisfy specific criteria, including licensing, patient access, office standards, after-hours coverage, and other factors. Most participating hospitals also meet accreditation criteria established by CMS and/or The Joint Commission.\nRecredentialing of participating providers occurs every three years, unless otherwise required by state or federal regulations. Recredentialing of participating providers includes verification of their medical licenses, review of their malpractice liability claims histories, review of their board certifications, if applicable, and review of applicable quality information. A committee composed of a peer group of providers reviews the applications of providers being considered for credentialing and recredentialing.\nWe maintain accreditation for certain of our health plans and/or departments from NCQA, the Accreditation Association for Ambulatory Health Care (AAAHC), and/or URAC.\nNCQA reviews our compliance based on standards for quality improvement, population health management, credentialing, utilization management, network management, and member experience. We have achieved and maintained NCQA health plan accreditation in many of our Medicare and Medicaid markets. Humana’s pharmacy organization is accredited by URAC.\nWe use various methods to market our products, including television, radio, the Internet, telemarketing, wholesale distributors (general agencies)\n\n(dollars in millions)\nIndividual Medicare Advantage\nGroup Medicare Advantage\nMedicare stand-alone PDP\nCommercial fully-insured\nState-b",
  "item7_clean": "U.S. Treasury and other U.S. government\ncorporations and agencies:\nU.S. Treasury and agency obligations\nMortgage-backed securities\nTax-exempt municipal securities\nMortgage-backed securities:\nAsset-backed securities\nCorporate debt securities\nTotal debt securities\nUnder the current expected credit losses model, or CECL, expected losses on available for sale debt securities are recognized through an allowance for credit losses rather than as reductions in the amortized cost of the securities. For debt securities whose fair value is less than their amortized cost which we do not intend to sell or are not required to sell, we evaluate the expected cash flows to be received as compared to amortized cost and determine if an expected credit loss has occurred. In the event of an expected credit loss, only the amount of the impairment associated with the expected credit loss is recognized in income with the remainder, if any, of the loss recognized in other comprehensive income. To the extent we have the intent to sell the debt security or it is more likely than not we will be required to sell the debt security before recovery of our amortized cost basis, we recognize an impairment loss in income in an amount equal to the full difference between the amortized cost basis and the fair value.\nPotential expected credit loss impairment is considered using a variety of factors, including the extent to which the fair value has been less than cost; adverse conditions specifically related to the industry, geographic area or financial condition of the issuer or underlying collateral of a debt security; changes in the quality of the debt security's credit enhancement; payment structure of the debt security; changes in credit rating of the debt security by the rating agencies; failure of the issuer to make scheduled principal or interest payments on the debt security and changes in prepayment speeds. For debt securities, we take into account expectations of relevant market and economic data. For example, with respect to mortgage and asset-backed securities, such data includes underlying loan level data and structural features such as seniority and other forms of credit enhancements. We estimate the amount of the expected credit loss component of a debt security as the difference between the amortized cost and the present value of the expected cash flows of the security. The present value is determined using the best estimate of future cash flows discounted at the implicit interest rate at the date of purchase. The expected credit loss cannot exceed the full difference between the amortized cost basis and the fair value.\nWe participate in a securities lending program to optimize investment income. We loan certain investment securities for short periods of time in exchange for collateral initially equal to at least 102% of the fair value of the investment securities on loan. The fair value of the loaned investment securities is monitored on a daily basis, with additional collateral obtained or refunded as the fair value of the loaned investment securities fluctuates. The collateral, which may be in the form of cash or U.S. Government securities, is deposited by the borrower with an independent lending agent. Any cash collateral, which is reinvested by the lending agent primarily in short-term, highly liquid investments, is recorded as a securities lending collateral asset within other current assets on our\nconsolidated balance sheet at the end of the reporting period. We record a corresponding liability to reflect our obligation to return the collateral within trade accounts payable and accrued expenses on our consolidated balance sheet at the end of the reporting period. Collateral received in the form of securities is not recorded in our consolidated balance sheets because, absent default by the borrower, we do not have the right to sell, pledge or otherwise reinvest securities collateral. Loaned securities continue to be carried as investment securities on the consolidated balance sheet at the end of the reporting period. Earnings on the invested cash collateral, net of expense, associated with the securities lending payable are recorded as investment income.\nThe risks inherent in assessing the impairment of an investment include the risk that market factors may differ from our expectations, facts and circumstances factored into our assessment may change with the passage of time, or we may decide to subsequently sell the investment. The determination of whether a decline in the value of an investment is related to a credit event requires us to exercise significant diligence and judgment. The discovery of new information and the passage of time can significantly change these judgments. The status of the general economic environment and significant changes in the national securities markets influence the determination of fair value and the assessment of investment impairment. There is a continuing risk that declines in fair value may occur and additional material realized losses from sales or expected credit loss impairments may be recorded in future periods.\nAll issuers of debt securities we own that were trading at an unrealized loss at December 31, 2024 remain current on all contractual payments. After taking into account these and other factors previously described, we believe these unrealized losses primarily were caused by an increase in market interest rates in the current markets since the time the debt securities were purchased. At December 31, 2024, we did not intend to sell any debt securities with an unrealized loss position in accumulated other comprehensive income, and it is not likely that we will be required to sell these debt securities before recovery of their amortized cost basis. Additionally, we did not record any material credit allowances for debt securities that were in an unrealized loss position at December 31, 2024, 2023 or 2022.\nGoodwill, Indefinite-lived and Long-lived Assets\nAt December 31, 2024, goodwill, indefinite-lived and other long-lived assets represented 29% of total assets and 83% of total stockholders’ equity, compared to 30% and 87%, respectively, at December 31, 2023. The decrease in goodwill, indefinite-lived and other long-lived assets as a percentage of total assets is primarily attributable to the increase in investment securities.\nFor goodwill, we are required to test at least annually for impairment at a level of reporting referred to as the reporting unit, and more frequently if adverse events or changes in circumstances indicate that the asset may be impaired. A reporting unit either is our operating segments or one level below the operating segments, referred to as a component, which comprise our reportable segments. A component is considered a reporting unit if the component constitutes a business for which discrete financial information is available that is regularly reviewed by management. We are required to aggregate the components of an operating segment into one reporting unit if they have similar economic characteristics. Goodwill is assigned to the reporting unit that is expected to benefit from a specific acquisition.\nWe perform a quantitative assessment to review goodwill for impairment to determine both the existence and amount of goodwill impairment, if any. Our strategy, long-range business plan, and annual planning process support our goodwill impairment tests. These tests are performed, at a minimum, annually in the fourth quarter, and are based on an evaluation of future discounted cash flows. We rely on this discounted cash flow analysis to determine fair value. However, outcomes from the discounted cash flow analysis are compared to other market approach valuation methodologies for reasonableness. We use discount rates that correspond to a market-based weighted-average cost of capital and terminal growth rates that correspond to long-term growth prospects, consistent with the long-term inflation rate. Key assumptions in our cash flow projections, including changes in membership, premium yields, medical and operating cost trends, and certain government contract extensions, are consistent with those utilized in our long-range business plan and annual planning process. If these assumptions differ from actual, including the impact of the Health Care Reform Law or changes in government reimbursement rates, the estimates underlying our goodwill impairment tests could be adversely affected. The fair value of our reporting units with\nsignificant goodwill exceeded carrying amounts by a substantial margin. However, unfavorable changes in key assumptions or combinations of assumptions including a significant increase in the discount rate, decrease in the long-term growth rate or substantial reduction in our underlying cash flow assumptions, including revenue growth rates, operating cost trends, and projected operating income could have a significant negative impact on the estimated fair value of our home solutions reporting unit, which accounted for $4.4 billion of goodwill. Impairment tests completed for 2024, 2023, and 2022 did not result in an impairment loss.\nIndefinite-lived intangible assets relate to Certificate of Needs (CON) and Medicare licenses acquired in connection with our CenterWell Home Health (formerly Kindred at Home) acquisition with a carrying value of $1.2 billion at December 31, 2024. Like goodwill, we are required to test at least annually for impairment and more frequently if adverse events or changes in circumstances indicate that the asset may be impaired. These tests are performed, at a minimum, annually in the fourth quarter. If the carrying amount of an indefinite-lived intangible asset exceeds its fair value, an impairment loss is recognized. Fair values of indefinite-lived intangible assets are determined based on the income approach. For our CON intangible assets, unfavorable changes in key assumptions or combinations of assumptions, including a significant increase in the discount rate, decrease in the long-term growth rate or substantial reduction in the underlying cash flow assumptions, including revenue growth rates, operating cost trends, and projected operating income could have a significant negative impact on the estimated fair value of our CON intangible assets, which account for $910 million of our intangible assets. Impairment tests completed for 2024 and 2023 resulted in impairment charges of $200 million and $55 million, respectively. Impairment test completed for 2022 did not result in a material impairment charge. These charges reflect the amount by which the carrying value exceeded its estimated fair value. The fair values of the assets were measured using Level 3 inputs, such as projected revenues and operating cash flows.\n\nITEM 7. MANAGEMENT’S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS\nHumana Inc., headquartered in Louisville, Kentucky, is committed to putting health first – for our teammates, our customers, and our company. Through our Humana insurance services, and our CenterWell health care services, we make it easier for the millions of people we serve to achieve their best health – delivering the care and service they need, when they need it. These efforts are leading to a better quality of life for people with Medicare, Medicaid, families, individuals, military service personnel, and communities at large.\nOur industry relies on two key statistics to measure performance. The benefit ratio, which is computed by taking total benefits expense as a percentage of premiums revenue, represents a statistic used to measure underwriting profitability. The operating cost ratio, which is computed by taking total operating costs, excluding depreciation and amortization, as a percentage of total revenue less investment income, represents a statistic used to measure administrative spending efficiency.\nEmployer Group Commercial Medical Products Business Exit\nIn February 2023, we announced our planned exit from the Employer Group Commercial Medical Products business, which includes all fully insured, self-funded and Federal Employee Health Benefit medical plans, as well as associated wellness and rewards programs. No other Humana health plan offerings are materially affected. Following a strategic review, we determined the Employer Group Commercial Medical Products business was no longer positioned to sustainably meet the needs of commercial members over the long term or support our long-term strategic plans. We anticipate the exit of this line of business to be finalized in the first half of 2025.\nValue Creation Initiatives and Impairment Charges\nIn order to create capacity to fund growth and investment in our Medicare Advantage business and further expansion of our healthcare services capabilities beginning in 2022, we committed to drive additional value for the enterprise through cost saving, productivity initiatives, and value acceleration from previous investments. As a result of these initiatives, we recorded charges of $281 million and $436 million in 2024 and 2023, respectively, primarily within operating costs in the consolidated statements of income.\nThe value creation initiative charges primarily relate to $256 million and $237 million in asset impairments in 2024 and 2023, respectively, as well as $25 million and $199 million in severance charges in connection with workforce optimization in 2024 and 2023, respectively.\nIn addition, we recorded impairment charges of $200 million, relating to indefinite-lived intangible assets, in 2024 and $91 million, including $55 million relating to indefinite-lived intangible assets, in 2023. The indefinite-lived intangible asset impairment charges were included within operating costs in our consolidated statements of income with the remaining impairment charges included within investment income.\nFurther, we recorded severance charges of $70 million in 2023 within operating costs in our consolidated statement of income as a result of our exit from the Employer Group Commercial Medical Products business.\nCOVID-19\nThe emergence and spread of the novel coronavirus, or COVID-19, beginning in the first quarter of 2020 has impacted our business. Initially during periods of increased incidences of COVID-19, a reduction in non-COVID-19 hospital admissions for non-emergent and elective medical care resulted in lower overall healthcare system utilization. At the same time, COVID-19 treatment and testing costs increased utilization. During 2022, we experienced lower overall utilization of the healthcare system than anticipated, as the reduction in COVID-19 utilization following the increased incidence associated with the Omicron variant outpaced the increase in non-COVID-19 utilization.\nThe COVID-19 National Emergency declared in 2020 was terminated on April 10, 2023 and the Public Health Emergency expired on May 11, 2023.\n\nThe Insurance segment consists of Medicare benefits, marketed to individuals or directly via group Medicare accounts, as well as our contract with CMS to administer the Limited Income Newly Eligible Transition, or LI-NET, prescription drug plan program and contracts with various states to provide Medicaid, dual eligible demonstration, and Long-Term Support Services benefits, which we refer to collectively as our state-based contracts. This segment also includes products consisting of employer group commercial fully-insured medical and specialty health insurance benefits marketed to individuals and employer groups, including dental, vision, and other supplemental health benefits, as well as administrative services only, or ASO. In addition, our Insurance segment includes our Military services business, primarily our T-2017 East Region contract, as well as the operations of our PBM business.\nThe CenterWell segment includes our pharmacy, primary care, and home solutions operations. The segment also includes our strategic partnerships wit",
  "item2_clean": null
}