{
  "source_file": "hum-20250930.htm",
  "form_type": "10-Q",
  "item1_clean": null,
  "item7_clean": null,
  "item2_clean": "enacted significant reforms to various aspects of the U.S. health insurance industry, including, among others, mandated coverage requirements, mandated benefits and guarantee issuance associated with insurance products, rebates to policyholders based on minimum benefit ratios, adjustments to Medicare Advantage premiums, the establishment of federally facilitated or state-based exchanges coupled with programs designed to spread risk among insurers, and the introduction of plan designs based on set actuarial values, and changes to the Part D prescription drug benefit design\nIt is reasonably possible that these laws and regulations, as well as other current or future legislative, judicial or regulatory changes including restrictions on our ability to manage our provider network, manage and sell our products, or otherwise operate our business, or restrictions on profitability, including reviews by regulatory bodies that may compare our Medicare Advantage profitability to our non-Medicare Advantage business profitability, or compare the profitability of various products within our Medicare Advantage business, and require that they remain within certain ranges of each other, increases in member benefits or changes to member eligibility criteria without corresponding increases in premium payments to us, further restrictions on service arrangements and fee payments between intercompany or vertically-integrated assets, increases in regulation of our prescription drug benefit businesses, reductions in reimbursement rates, or changes to the Part D prescription drug benefit design (and uncertainty arising from the implementation of these changes) in the aggregate may have a material adverse effect on our results of operations (including restricting revenue, enrollment and premium growth in certain products and market segments, restricting our ability to expand into new markets, increasing our medical and operating costs, further lowering our Medicare payment rates and increasing our expenses associated with assessments); our financial position (including our ability to maintain the value of our goodwill); and our cash flows.\nWe intend for the discussion of our financial condition and results of operations that follows to assist in the understanding of our financial statements and related changes in certain key items in those financial statements from year to year, including the primary factors that accounted for those changes. Transactions between reportable segments primarily consist of sales of products and services rendered by our CenterWell segment, primarily pharmacy, primary care, and home solutions, to our Insurance segment customers and are described in Note 14 to the condensed consolidated financial statements included in this report.\nComparison of Results of Operations for 2025 and 2024\nThe following discussion primarily deals with our results of operations for the three months ended September 30, 2025, or the 2025 quarter, the three months ended September 30, 2024, or the 2024 quarter, the nine months ended September 30, 2025, or the 2025 period, and the nine months ended September 30, 2024, or the 2024 period.\nThree months ended September 30,\nNine months ended September 30,\nThree months ended September 30, 2025 vs 2024\nNine months ended September 30, 2025 vs 2024\n($ in millions, except per common share results)\nTotal services revenue\nDepreciation and amortization\nTotal operating expenses\nIncome from operations\nLoss on sale of business\nOther expense (income), net\nIncome before income taxes and equity in net losses\n(Benefit) provision for income taxes\nEquity in net losses\nDiluted earnings per common share\nOperating cost ratio (b)\nRepresents benefits expense as a percentage of premiums revenue.\nRepresents operating costs, excluding depreciation and amortization, as a percentage of total revenues less investment income.\nConsolidated premiums revenue increased $2.8 billion, or 9.9%, from $28.0 billion in the 2024 quarter to $30.7 billion in the 2025 quarter and increased $7.6 billion, or 9.0%, from $84.4 billion in the 2024 period to $91.9 billion in the 2025 period primarily due to higher per member Medicare premiums, largely driven by an increased direct subsidy due to the IRA, and higher per member state-based contracts premiums, as well as membership growth in the state-based contracts and stand-alone PDP businesses. These factors were partially offset by the membership decline within the individual Medicare Advantage business, inclusive of the decision to exit certain unprofitable plans and counties.\nConsolidated services revenue increased $0.5 billion, or 45.1%, from $1.1 billion in the 2024 quarter to $1.6 billion in the 2025 quarter and increased $1.1 billion, or 32.7%, from $3.3 billion in the 2024 period to $4.3 billion in the 2025 period primarily due to higher revenues associated with growth in the primary care and pharmacy solutions businesses, partially offset by the impact of the v28 risk model revision impacting the Primary Care business.\nInvestment income decreased $5 million, or 1.5%, from $343 million in the 2024 quarter to $338 million in the 2025 quarter and decreased $55 million, or 5.9%, from $929 million in the 2024 period to $874 million in the 2025 period primarily due to lower interest income on debt securities.\nConsolidated benefits expense increased $2.9 billion, or 11.4%, from $25.1 billion in the 2024 quarter to $28.0 billion in the 2025 quarter and increased $6.8 billion, or 9.0%, from $75.3 billion in the 2024 period to $82.1 billion in the 2025 period. The consolidated benefit ratio increased 120 basis points from 89.9% for the 2024 quarter to 91.1% for the 2025 quarter and increased 10 basis points from 89.2% for the 2024 period to 89.3% for the 2025 period primarily reflecting a shift in line of business mix resulting growth in the state-based contracts and stand-alone PDP businesses that carry a higher benefit ratio, combined with a reduction in individual Medicare Advantage membership, as well as incremental investments to improve member and patient outcomes and support operational excellence. These factors were partially offset by individual Medicare Advantage pricing inclusive of plan exits and benefit design changes that more than offset claims trend and the funding environment, as well as higher favorable prior-period medical claims development in the 2025 quarter and period. Further, the quarter comparison was negatively impacted in the 2025 quarter as a result of the change in Medicare Part D seasonality due to the IRA and the period comparison was affected by the favorable workday impact in the 2025 period combined with the favorability associated with the change in Medicare Part D seasonality due to the IRA.\nConsolidated benefits expense included $275 million of favorable prior-period medical claims reserve development in the 2025 quarter and $24 million of favorable prior-period medical claims development in the 2024 quarter. Consolidated benefits expense included $913 million of favorable prior-period medical claims reserve development in the 2025 period and $693 million of favorable prior-period medical claims reserve development in the 2024 period. Prior-period medical claims reserve development decreased the consolidated benefit ratio by approximately 90 basis points in the 2025 quarter and decreased the consolidated benefit ratio by approximately 10 basis points in the 2024 quarter. Prior-period medical claims reserve development decreased the consolidated benefit ratio by approximately 100 basis points in the 2025 period and decreased the consolidated benefit ratio by approximately 80 basis points in the 2024 period.\nOur segments incur both direct and shared indirect operating costs. We allocate the indirect costs shared by the segments primarily as a function of revenues. As a result, the profitability of each segment is interdependent.\nConsolidated operating costs increased $0.7 billion, or 22.3%, from $3.3 billion in the 2024 quarter to $4.1 billion in the 2025 quarter and increased $1.5 billion, or 15.6%, from $9.5 billion in the 2024 period to $11.0 billion in the 2025 period. The consolidated operating cost ratio increased 110 basis points from 11.5% for the 2024 quarter to 12.6% for the 2025 quarter\n\nIndividual Medicare Advantage\nGroup Medicare Advantage\nMedicare stand-alone PDP\nState-based contracts and other\nCommercial fully-insured\nTotal Medical Membership\nTotal Specialty Membership\nMembers may not be unique to each product since members have the ability to enroll in more than one product.\nThree months ended September 30,\nNine months ended September 30,\nThree months ended September 30, 2025 vs 2024\nNine months ended September 30, 2025 vs 2024\nPremiums and Services Revenue:\nIndividual Medicare Advantage\nGroup Medicare Advantage\nMedicare stand-alone PDP\nState-based contracts and other\nCommercial fully-insured\nMilitary services and other\nTotal external revenues\nIncome from operations\nOperating cost ratio\nIncome from operations\nInsurance segment income from operations decreased $23 million, or 8.4%, from $274 million in the 2024 quarter to $251 million in the 2025 quarter and increased $0.7 billion, or 33.9%, from $1.9 billion in the 2024 period to $2.6 billion in the 2025 period primarily due to the same factors impacting the Insurance segment's benefit and operating cost ratios as more fully described below.\nIndividual Medicare Advantage membership decreased 421,900 members, or 7.5%, from September 30, 2024 to September 30, 2025, inclusive of the decision to exit certain unprofitable plans and counties. Individual Medicare Advantage membership includes 765,800 D-SNP members as of September 30, 2025, a net decrease of 173,800 D-SNP members, or 18.5%, from 939,600 D-SNP members as of September 30, 2024.\nGroup Medicare Advantage membership increased 23,100 members, or 4.2%, from September 30, 2024 to September 30, 2025, consistent with expectations as we ma"
}