{
  "source_file": "hwm-20241231.htm",
  "form_type": "10-K",
  "item1_clean": "Description of the Business\nThe Company produces products that are used primarily in the aerospace (commercial and defense), commercial transportation, and industrial and other markets. Howmet seeks to provide its customers with innovative solutions through offering differentiated products such as airfoils with advanced cooling and coatings for extreme temperature applications; specially-designed fasteners for lightweight composite airframe construction, reduced assembly costs, and lightning strike protection; and lightweight aluminum commercial wheels. Its products and solutions include investment castings for jet engines and industrial gas turbines (nickel superalloys, titanium, and aluminum), including airfoils and structural parts; seamless rolled rings for jet engines (mostly nickel superalloys); fastening systems for aerospace, industrial and commercial transportation applications (titanium, steel, and nickel superalloys); forged jet engine components (e.g., jet engine disks); machined and forged aircraft parts (titanium and aluminum); and forged aluminum commercial vehicle wheels, all of which are sold directly to customers or through distributors.\nAerospace (Commercial and Defense) Market.\nHowmet’s largest market is aerospace, which represented approximately 68% of the Company’s revenue in 2024. The Company produces a range of high performance multi-materials, highly engineered products, and vertically integrated machined solutions for aero engines and airframe structures, ranging from investment castings, advanced coatings, seamless rings, forgings, titanium extrusions, and titanium mill products, to fasteners that hold aircraft together. Wingtip to wingtip, nose to tail, Howmet can produce more than 90% of all structural and rotating aero engine components. Modernization of the commercial and defense platforms is driven by an array of challenging performance requirements. With its precision engineering, materials science expertise, and advanced manufacturing processes, Howmet aims to help its customers achieve greater fuel economies, reduced emissions, passenger comfort, and maintenance efficiencies.\nCommercial Transportation Market\n. The commercial transportation market represented approximately 17% of the Company’s revenue in 2024. The Company invented the forged aluminum truck wheel in 1948, and continues to advance technology to deliver breakthrough solutions that make trucks and buses lighter, more fuel efficient and sharper-looking. Howmet’s forged aluminum wheels are a leading choice for commercial trucks and mass transportation vehicles because they can reduce weight and save fuel. The strength of the Company’s rivets, bolts and fasteners offers another light-weighting solution that delivers performance.\nIndustrial and Other Markets.\nIndustrial and other markets include industrial gas turbines, oil and gas, and other industrials, which represented approximately 15% of the Company’s revenue in 2024.\nHowmet has four reportable segments, which are organized by product on a worldwide basis: Engine Products, Fastening Systems, Engineered Structures and Forged Wheels.\nEngine Products utilizes advanced designs and techniques to support next-generation engine programs and produces components primarily for aircraft engines and industrial gas turbines, including airfoils and seamless rolled rings. Engine Products produces rotating parts as well as structural parts. Engine Products principally serves the commercial and defense aerospace, industrial gas turbine, and oil and gas markets.\nFastening Systems produces\naerospace and industrial fastening systems as well as commercial transportation fasteners and installation tools\n. In addition to highly engineered aerospace fasteners with a broad range of fastening systems, the segment also supplies the commercial transportation, renewable, and material handling industries. The business’s high-tech, multi-material fastening systems are found nose to tail on\ncommercial and military aircraft, as well as on jet engines, industrial gas turbines, commercial transportation vehicles, wind turbines, solar power systems, and construction and industrial equipment\nEngineered Structures\nEngineered Structures produces titanium ingots and mill products for aerospace and defense applications and is vertically integrated to produce titanium forgings, titanium extrusions, and machining services for airframe, wing, aero-engine, and landing gear components. Engineered Structures also produces aluminum forgings, nickel forgings, and aluminum machined components, and assemblies for aerospace and defense applications. The principal markets served by Engineered Structures are commercial aerospace, defense aerospace, and land and sea defense.\n\nSources and Availability of Raw Materials\nImportant raw materials purchased in 2024 for each of the Company’s reportable segments are listed below.\nEngineered Structures\nNickel Alloys and Stainless Steels\nSuperalloy materials\nGenerally, raw materials are purchased from third-party suppliers under competitively priced supply contracts or bidding arrangements. The Company believes that the raw materials necessary to its business are and will continue to be available.\nPatents, Trade Secrets, and Trademarks\nThe Company believes that its domestic and international patent, trade secret and trademark assets provide it with a significant competitive advantage. The Company’s rights under its patents, as well as the products made and sold under them, are important to the Company as a whole and, to varying degrees, important to each business segment. The patents owned by Howmet generally concern particular products, manufacturing equipment, or techniques. Howmet’s business as a whole is not, however, materially dependent on any single patent, trade secret, or trademark. As a result of product development and technological advancement, the Company continues to pursue patent protection in jurisdictions throughout the world. As of the end of 2024, the Company’s worldwide patent portfolio consisted of approximately 950 granted patents and 220 pending patent applications.\nThe Company also has a significant number of trade secrets, mostly regarding manufacturing processes and material compositions that give many of its businesses important advantages in their markets. The Company continues to strive to improve those processes and generate new material compositions that provide additional benefits. With respect to domestic and international registered trademarks, the Company has many that have significant recognition within the markets that are served. Examples include the name Howmet\nmetal castings, Huck\nfasteners, and Dura-Bright\nwheels with easy-clean surface treatments. As of the end of 2024, the Company’s worldwide trademark portfolio consisted of approximately 1,570 registered trademarks and 50 pending trademark applications. Following the Alcoa Inc. Separation Transaction, the Company retained the Alcoa Wheels® business and, pursuant to a Trademark License Agreement, is the exclusive licensee of the “Alcoa” name and logo for use with the wheels, hubs, and related products that we manufacture. The Company’s rights under its trademarks are important to the Company as a whole and, to varying degrees, important to each business segment.\nCompetitive Conditions\nThe Company’s segments - Engine Products, Fastening Systems, Engineered Structures, and Forged Wheels - are subject to substantial and intense competition in the markets they serve. Although Howmet believes its advanced technology, manufacturing processes, and experience provide advantages to Howmet’s customers, such as high quality and superior mechanical properties that meet the Company’s customers’ most stringent requirements, many of the products Howmet makes can be produced by competitors using similar types of manufacturing processes as well as alternative forms of manufacturing. Despite intense competition, Howmet continues as a market leader in most of its principal markets. We believe that factors such as Howmet’s technological expertise, state-of-the-art capabilities, capacity, quality, engaged employees, and long-standing customer relationships enable the Company to maintain its competitive position.\nPrincipal competitors include Berkshire Hathaway Inc., through its 2016 acquisition of Precision Castparts Corporation and subsidiaries, for titanium and titanium-based alloys, precision forgings, seamless rolled rings, investment castings, including airfoils, and aerospace fasteners; VSMPO (Russia) for titanium and titanium-based alloys and precision forgings; Allegheny Technologies, Inc.’s High-Performance Materials & Components segment for titanium and titanium-based alloys and precision forgings; Lisi Aerospace (France) for aerospace fasteners; and Aubert & Duval (part of Eramet Group in France) for precision forgings. Other competitors include Doncasters Group Ltd. (U.K.) and Consolidated Precision Products Corp. (owned by Warburg Pincus and Berkshire Partners) for investment castings; Weber Metals (part of Otto Fuchs) for precision forgings; and Forgital and Frisa (Mexico) for seamless rings.\nForged Wheels competes against aluminum and steel wheel suppliers in the commercial transportation industry under the product brand name Alcoa\nWheels for the major regions that it serves (North America, Europe, Japan, China, South America, and Australia). Its larger aluminum wheel competitors are Accuride Corporation, Speedline (member of the Ronal Group), Nippon Steel Corporation, Dicastal, Alux, and Wheels India Limited.\n\nApproximately 3,500 employees, or 25% of the U.S. workforce, are represented by labor unions in the United States. Within the United States, there are eight collective bargaining agreements with varying expiration dates between Howmet and various labor unions. Of these eight, the largest workforce covered under a collective bargaining agreement is between Howmet and the United Autoworkers (“UAW”) at our Engine Products facility in Whitehall, Michigan. The current agreement, which covers approximately 1,450 employees, expires on April 1, 2028. The second largest workforce of approximately 700 employees within our Engineered Structures and Forged Wheels segments is covered under a five-year collective bargaining agreement reached in March 2024 between Howmet and the UAW at our Cleveland, Ohio location, which expires in February 2029. The Company’s next significant plant collective bargaining agreement in the U.S. expires in 2027. On a regional basis, collective bargaining agreements with varying expiration dates cover employees in Europe, North America, South America, and Asia. The Company believes that it has positive relationships with its employees and any respective labor union representatives.\nExecutive Officers of the Registrant\nThe names, ages, positions, and areas of responsibility of the executive officers of the Company as of February 13, 2025 are listed below. The Company’s executive officers are annually appointed to serve until the next annual meeting of the Board of Directors (held in conjunction with the annual meeting of shareholders), except in the case of earlier death, retirement, resignation or removal.\n, 64, Vice President and Chief Commercial Officer. Mr. Chanatry was initially elected Vice President and Chief Commercial Officer of Howmet effective May 16, 2018. Prior to joining Howmet, from 2015 to April 2018, he was Vice President of Supply Chain for General Electric’s Power Division. Mr. Chanatry served as General Manager of Supply Chain for General Electric Appliances from 2013 to 2015; and General Electric Aviation Systems from 2009 to 2013. Prior to his leadership roles at General Electric Power, General Electric Appliances and General Electric Aviation Systems, Mr. Chanatry held numerous positions within the General Electric Aviation & Aerospace divisions, as well as at Lockheed Martin from 1983 to 2009.\n, 59, Execut",
  "item7_clean": "Total debt of $3,315, a net decrease of $391 from 2023, reflecting repurchases and redemption of $600 aggregate principal amount of the 6.875% Notes due May 2025 (the “2025 Notes”), redemption of $205 aggregate principal amount of the 5.125% Notes due October 2024 (the “\nearly partial prepayment of $60 aggregate principal amount of its USD term loan, partially offset by the\nissuance of $500 aggregate principal amount of the 4.850% Notes due October 2031 (the “2031 Notes”), net of the cross-currency swap that synthetically converted the 2031 Notes into a lower fixed-interest-rate Euro liability; and\nThe Company’s common stock had a closing price of $109.37 per share as of December 31, 2024, an increase of $96.17 per share, or 729%, since the Arconic Inc. Separation Transaction on April 1, 2020, compared to an increase of 138% for the S&P 500\nIndex and 99% for the S&P 500\nAerospace & Defense Index over the same period.\nSee below in Results of Operations for the reconciliation of Total Segment Adjusted EBITDA to Income before income taxes.\nIn 2025, management projects sales to increase as we expect solid growth in the commercial aerospace market, and the Company’s strong position in that market is expected to continue, including engines spares. Earnings per share is expected to grow as management continues to focus on revenue growth and operational performance. Cash provided from operations is expected to increase for the full year in 2025 compared with 2024, resulting from a continued focus on operating performance and on capital efficiency. Capital expenditures are expected to increase with additional investments in capacity expansions. Governmental policies, laws and regulations, and other economic factors, including inflation, customer requirements, tariffs, and fluctuations in foreign currency exchange rates and interest rates, may affect future results of operations and cash flow.\nResults of Operations\nSales for 2024 were $7,430 compared with $6,640 in 2023, an increase of $790, or 12%. The increase was primarily due to higher sales in the commercial aerospace, defense aerospace, and industrial and other markets, including engine spares, and favorable product pricing, partially offset by lower volumes in the commercial transportation market. Product price increases are in excess of inflationary cost pass through to our customers.\nSales for 2023 were $6,640 compared with $5,663 in 2022, an increase of $977, or 17%. The increase was primarily due to higher sales in the commercial aerospace, defense aerospace, commercial transportation, and industrial and other markets, favorable product pricing, and an increase in material cost pass through. Product price increases are in excess of inflationary pass through to our customers.\nCost of goods sold (“COGS”).\nCOGS as a percentage of Sales was 68.9% in 2024 compared with 71.9% in 2023. The decrease was primarily due to higher volumes and favorable product pricing, partially offset by increased net headcount, primarily in the Engine Products segment, in support of expected revenue increases. The Company had total COGS net reimbursements of $18 in 2024 due to the final settlement of the insurance claim related to a mechanical failure that occurred in 2022 resulting in substantial heat and fire-related damage to equipment at the Forged Wheels’ cast house in Barberton, Ohio (the “Barberton Cast House Incident”) in the second quarter of 2024 and the final settlement of the insurance claim related to the fires that occurred in 2019 at a Fastening Systems plant in France (the “France Plant Fire”) in the fourth quarter of 2024, compared to total COGS insurance claims reimbursements of $19 in 2023, partially offset by charges of $7 in 2023, related to the France Plant Fire and Barberton Cast House Incident. The insurance claims related to the Barberton Cast House Incident and the France Plant Fire have now been completed. All cash related to the insurance claims has been collected as of January 2025.\nCOGS as a percentage of Sales was 71.9% in 2023 compared with 72.5% in 2022. The decrease was primarily due to higher volumes, favorable product pricing, and lower costs related to three plant fires, partially offset by material cost pass through and increased net headcount, primarily in the Engine Products and Fastening Systems segments, in support of expected revenue increases. The Company had total COGS insurance claims reimbursements of $19 in 2023, partially offset by charges of $7, related the France Plant Fire and the Barberton Cast House Incident, compared to total COGS charges of $59 in 2022, offset by partial insurance claims reimbursements of $23, related to a fire at a Forged Wheels plant in Barberton, Ohio in mid-February 2020 (the “Barberton Plant Fire”) and the France Plant Fire. The insurance claims related to these three plant fires were in excess of the insurance deductible. During the fourth quarter of 2022, the Company settled the insurance claim related to the Barberton Plant Fire.\nSelling, general administrative, and other expenses (“SG&A”).\nSG&A expenses were $347, or 4.7% of Sales, in 2024 compared with $333, or 5.0% of Sales, in 2023. The increase in SG&A of $14, or 4%, was primarily due to higher employment costs.\nSG&A expenses were $333, or 5.0% of Sales, in 2023 compared with $288, or 5.1% of Sales, in 2022. The increase in SG&A of $45, or 16%, was primarily due to higher employment costs and legal fees.\n\nwas $1,155, or $2.81 per diluted share, for 2024 compared to $765, or $1.83 per diluted share, in 2023. The increase in results of $390, or 51%, was primarily due to higher volumes in the commercial aerospace, defense aerospace, and industrial and other markets, including engines spares, favorable product pricing, a reduction in interest expense due to lower long-term debt levels, and a lower tax rate due to the completion of an R&D study, partially offset by lower volumes in the commercial transportation market and net impacts of foreign currency.\nNet income was $765, or $1.83 per diluted share, for 2023 compared to $469, or $1.11 per diluted share, in 2022. The increase in results of $296, or 63%, was primarily due to higher sales in the commercial aerospace market, favorable product pricing, a change of $90 due to the reversal of $25 of the $65 pre-tax charge taken in the third quarter of 2022 related to the LBIE legal proceeding (See\nto the Consolidated Financial Statements in\n), a decrease in Restructuring and other charges of $33, and a decrease in Interest expense, net of $11, partially offset by an increase in the Provision for income taxes primarily driven by an increase in income before income taxes.\nThe Company’s operations consist of four worldwide reportable segments: Engine Products, Fastening Systems, Engineered Structures and Forged Wheels. Segment performance under Howmet’s management reporting system is evaluated based on Segment Adjusted EBITDA. The Company’s Chief Executive Officer, who has been determined to be our Chief Operating Decision Maker (“CODM”), believes that Segment Adjusted EBITDA provides information with respect to the Company’s operating performance and the Company’s ability to meet its financial obligations. Howmet’s definition of Segment Adjusted EBITDA (Earnings before interest, taxes, depreciation, and amortization) is net margin plus an add-back for depreciation and amortization. Net margin is equivalent to Sales minus the following items: Cost of goods sold; Selling, general administrative, and other expenses; Research and development (“R&D”) expenses; and Provision for depreciation and amortization. Special items, including Restructuring and other charges, are excluded from net margin and Segment Adjusted EBITDA. The Company’s CODM considers forecast-to-actual variances for Segment Adjusted EBITDA when allocating resources across the Company’s reportable segments. Segment Adjusted EBITDA may not be comparable to similarly titled measures of other companies. Differences between the total segment and consolidated totals are in Corporate. (See\nto the Consolidated Financial Statements in\nThe Company has aligned its operations consistent with how the CEO assesses operating performance and allocates capital.\nIncome before income taxes totaled $1,383 in 2024, $975 in 2023, and $606 in 2022. Segment Adjusted EBITDA for all reportable segments totaled $2,009 in 2024, $1,587 in 2023, and $1,352 in 2022. See below for the reconciliation of Total Segment Adjusted EBITDA to Income before income taxes.\nThe following information provides Sales, Segment Adjusted EBITDA, and Segment Adjusted EBITDA Margin for each reportable segment for each of the three years in the period ended December 31, 2024.\nSegment Adjusted EBITDA\nSegment Adjusted EBITDA Margin\nEngine Products produces investment castings, including airfoils, and seamless rolled rings primarily for aircraft engines (aerospace commercial and defense) and industrial gas turbine applications. Engine Products produces rotating parts as well as structural parts, which are sold directly to customers. Generally, the sales and costs and expenses of this segment are transacted in the local currency of the respective operations, which are mostly the U.S. dollar, British pound, euro, and Japanese yen.\nThird-party sales for the Engine Products segment increased $469, or 14%, in 2024 compared with 2023, primarily due to growth in the commercial aerospace, defense aerospace, oil and gas, and industrial gas turbine markets, including spares growth.\nThird-party sales for the Engine Products segment increased $568, or 21%, in 2023 compared with 2022, primarily due to higher volumes in the commercial aerospace, defense aerospace, industrial gas turbine, and oil and gas markets.\nSegment Adjusted EBITDA for the Engine Products segment increased $263, or 30%, in 2024 compared with 2023, primarily due to growth in the commercial aerospace, defense aerospace, oil and gas, and industrial gas turbine markets. The segment absorbed approximately 1,205 net headcount since the end of 2023 in support of expected revenue increases, resulting in unfavorable near-term recruiting, training, and operational costs.\n\nSegment Adjusted EBITDA for the Engine Products segment increased $158, or 22%, in 2023 compared with 2022, primarily due to higher volumes in the commercial aerospace, defense aerospace, industrial gas turbine, and oil and gas markets. The segment absorbed approximately 1,030 net headcount since the end of 2022 in support of expected revenue increases, resulting in unfavorable near-term recruiting, training, and operational costs.\nSegment Adjusted EBITDA Margin for the Engine Products segment increased approximately 360 basis points in 2024 compared with 2023, primarily due to growth in the commercial aerospace, defense aerospace, oil and gas, and industrial gas turbine markets.\nSegment Adjusted EBITDA Margin for the Engine Products segment increased approximately 20 basis points in 2023 compared with 2022, primarily due to higher volumes in the commercial aerospace, defense aerospace, industrial gas turbine, and oil and gas markets, partially offset by an increase in headcount and inflationary costs.\nIn 2025, as compared to 2024, demand in the commercial aerospace, defense aerospace, industrial gas turbine, and oil and gas markets is expected to increase. Governmental policies, laws and regulations, and other economic factors, including inflation, customer requirements, tariffs, and fluctuations in foreign currency exchange rates and interest rates, may affect future results of operations and cash flow.\nSegment Adjusted EBITDA\nSegment Adjusted EBITDA Margin\nFastening Systems produces aerospace and industrial fastening systems, as well as commercial transportation fasteners. The business’s high-tech, multi-material fastening systems are found nose to tail on aircraft and aero engines. The business’s products are also critical components of commercial transportation vehicles and construction and industrial equipment. Fastening Systems are sold directly to customers and through distributors. Generally, the sales and costs and expenses of this segment are transacted in the local currency of the respective operations, which are mostly the U.S. dollar, British pound, and euro.\nThird-party sales for the Fastening Systems segment increased $227, or 17%, in 2024 compared with 2023, primarily due to growth in the commercial aerospace market, including wide body recovery.\nThird-party sales for the Fastening Systems segment increased $232, or 21%, in 2023 compared with 2022, primarily due to higher volumes in the commercial aerospace, including the emerging wide body recovery, commercial transportation, defense aerospace, and industrial markets.\nSegment Adjusted EBITDA for the Fastening Systems segment increased $128, or 46%, in 2024 compared with 2023, primarily due to growth in the commercial aerospace market, productivity gains which included reduced net headcount of approximately 135, and impacts of foreign currency.\nSegment Adjusted EBITDA for the Fastening Systems segment increased $44, or 19%, in 2023 compared with 2022, primarily due to higher volumes in the commercial aerospace, commercial transportation, defense aerospace, and industrial markets. The segment absorbed approximately 435 net headcount since the end of 2022 in support of expected revenue increases, resulting in unfavorable near-term recruiting, training, and operational costs.\nSegment Adjusted EBITDA Margin for the Fastening Systems segment increased approximately 520 basis points in 2024 compared with 2023, primarily due to growth in the commercial aerospace market as well as productivity gains.\nSegment Adjusted EBITDA Margin for the Fastening Systems segment decreased approximately 30 basis points in 2023 compared with 2022, primarily due to an increase in headcount and inflationary costs, partially offset by higher volumes in the commercial aerospace, commercial transportation, defense aerospace, and industrial markets.\nIn 2025, as compared to 2024, demand in the commercial aerospace market is expected to increase. Demand in the commercial transportation market is not expected to recover before mid year of 2025 with some growth starting in the second half of 2025. Governmental policies, laws and regulations, and other economic factors, including inflation, customer requirements, tariffs, and fluctuations in foreign currency exchange rates and interest rates, may affect future results of operations and cash flow.\n\nsegment decreased approximately 120 basis points in 2023 compared with 2022, primarily due to lower volumes in the defense aerospace market, material and inflationary cost pass through, additional operating costs from production rate increases not realized due to production bottlenecks at a plant, and an increase in headcount, partially offset by higher volumes in the commercial aerospace market.\nIn 2025, as compared to 2024, demand in the defense aerospace and commercial aerospace markets is expected to increase. Governmental policies, laws and regulations, and other economic factors, including inflation, customer requirements, tariffs, and fluctuations in foreign currency exchange rates and interest rates, may affect future results of operations and cash flow.\nSegment Adjusted EBITDA\nSegment Adjusted EBITDA Margin\nForged Wheels produces forged aluminum wheels and related products globally for heavy-duty trucks, trailers, and buses. Forged Wheels’ products are sold directly to OEMs and through distributors. Generally, the sales and costs and expenses of this segment are transacted in the local currency of the respective operations, which are mostly the U.S. dollar and euro.\nThird-party sales for the Forged Wheels segment decreased $93, or 8%, in 2024 compared with 2023, primarily due to lower volumes in the commercial transportation market as well as a decrease in aluminum and other inflationary ",
  "item2_clean": null
}