{
  "source_file": "ibkr-20241231x10k.htm",
  "form_type": "10-K",
  "item1_clean": null,
  "item7_clean": "The calculation of our tax liabilities involves dealing with uncertainties in the application of complex tax laws and regulations in a multitude of jurisdictions across our global operations. Changes in tax laws and rates could also affect recorded deferred tax assets and liabilities in the future. For example, on December 15, 2022, the EU formally adopted the EU’s Pillar Two Directive, effective January 1, 2024, which provides for a minimum effective tax rate of 15%, as established by the Organization for Economic Cooperation and Development (“OECD”) Pillar Two Framework. A significant number of other countries have either already or are expected to implement similar legislation with varying effective dates. We record tax liabilities in accordance with Financial Accounting Standards Board (“FASB”) ASC Topic 740 and adjust these liabilities when management’s judgment changes as a result of the evaluation of new information not previously available. Because of the complexity of some of these uncertainties, the ultimate resolution may result in payments that are different from the current estimates of these tax liabilities. These differences will be reflected as increases or decreases to income tax expense in the period in which new information becomes available.\n\nAlthough we cannot accurately anticipate the effects of inflation on our operations, we believe that for the past several years inflation may have indirectly had a material impact on our results of operations. Inflation has been one of the factors driving our employee compensation and benefits expenses higher during the current period, although as a percentage of net revenues these expenses remain stable. In an effort to stem inflation, central banks have increased benchmark interest rates in most currencies, which has contributed to our net interest income. Inflation may also be a contributing factor to general uncertainty in the markets in the foreseeable future. Statements about future inflation are subject to the risk that actual inflation and its effects may differ, possibly materially, due to, among other things, changes in economic growth, impact of supply chain disruptions, unemployment and consumer demand.\n\nIn the current year, average securities borrowed balances increased 11%, to $5.9 billion, and average securities loaned balances increased 44%, to $13.7 billion, compared to the prior year. Net interest earned from securities lending is affected by the level of demand for securities positions held by our customers that investors are looking to sell short. During the current year, net interest earned from securities lending transactions decreased $184 million, or 67%, compared to the prior year, driven by lower demand for selling stocks short, as the stock market rose steadily in the current year, and by fewer so-called “hard to borrow” stocks industry wide. However, as noted above, the rise in benchmark interest rates has shifted a portion of the interest reported as generated by lending securities to interest income on segregated cash (see further explanation above). It should be noted that securities lending transactions entered into to support customer activity may produce interest income (expense) that is offset by interest expense (income) related to customer balances.\n\nOur cash flows from operating activities are largely a reflection of the changes in customer credit and margin loan balances. We raised $8.7 billion in net cash from operating activities mainly driven by customer credit balances which increased $14.3 billion, investments in securities segregated for regulatory purposes which decreased $7.5 billion, and securities loaned which increased $4.9 billion; partially offset by customer margin loans which increased $20.0 billion.\n\nA securities lending transaction generates (1) net interest earned on lending a security, which is based on supply and demand for that security, and (2) interest earned on the cash collateral deposited for the loan of that security, which is based on benchmark interest rates. Interest on this collateral is reported as net interest on segregated cash, since cash collateral from securities lending is held in specially-designated bank accounts for the benefit of customers, in accordance with U.S. customer protection rules. Generally, as benchmark interest rates rise, while the overall revenue generated from a securities lending transaction may not change, the portion derived from interest earned on the cash collateral, which is classified as net interest income on “Segregated cash and securities, net” increases, while the portion classified as “Securities borrowed and loaned, net” decreases.\n\nas of December 31, 2024, approximately 23% of our equity was denominated in currencies other than the U.S. dollar. In the current year, our currency diversification strategy decreased our comprehensive earnings by $222 million (compared to an increase of $42 million in the prior year), as the U.S. dollar value of the GLOBAL decreased by approximately 1.45%, compared to its value as of December 31, 2023. The effects of our currency diversification strategy are reported as (1) a component of “Other Income” (loss of $15 million) in the consolidated statements of comprehensive income and (2)\nother comprehensive income\n\nCommissions for the current year increased $337 million, or 25%, compared to the prior year, to $1,697 million, driven by higher customer trading volumes in options, stocks and futures. Total customer options and futures contract and stock share volumes increased 32%, 4% and 22%, respectively, from the prior year. Total DARTs for cleared and execution-only customers, for the current year, increased 36% to 2.6 million, compared to 1.9 million for the prior year. Average commission per commissionable order for cleared customers, for the current year, decreased 9% to $2.86, compared to $3.14\n\nNet interest income on customer balances, for the current year, increased $497 million, compared to the prior year, driven by a $12.3 billion increase in average customer margin loans, a $9.8 billion increase in average customer credit balances, and an increase in the average federal funds effective rate to 5.14% from 5.02% in the prior year and. See the “Business Environment” section above in this Item 7 for a further discussion about the change in interest rates in the current year.\n\nnew FINRA Consolidated Audit Trail (“CAT”) fee initiated in October 2024, and\nhigher customer trading volumes\n; and (2) a $20 million increase in clearing and depository fees due to\nhigher customer trading volumes\n; partially offset by (3) a $19 million decrease in exchange fees due to greater capture of liquidity rebates from certain exchanges. As a percentage of total net revenues, execution, clearing and distribution fees were 9% for both the current year and the prior year.\n\nYields are generally a reflection of benchmark interest rates in each currency in which the Company and its customers hold cash balances. Because a meaningful portion of customer cash and margin loans are denominated in currencies other than the U.S. dollar, changes in U.S. benchmark interest rates do not impact the total amount of segregated cash and securities, customer margin loans and customer credit balances. Furthermore, because interest, when benchmark rates are at sufficiently high levels, is paid only on eligible cash credit balances (i.e., balances over $10 thousand or equivalent, in securities accounts with over $100 thousand in equity, and in smaller accounts at reduced rates), changes in benchmark interest rates are not passed through to the total amount of customer credit balances. Finally, the Company’s policies with respect to currencies with near zero or negative interest rates impact the overall yields on segregated cash and customer credit balances as effective interest rates in those currencies move above or below zero.\n\nNon-interest expenses, for the current year, increased $219 million, or 17%, compared to the prior year, to $1,490 million, mainly due to a $103 million increase in general and administrative expenses; a $61 million increase in execution, clearing and distribution fees; and a $47 million increase in employee compensation and benefits. As a percentage of total net revenues, non-interest expenses were 29% for both the current year and the prior year.\n\nOur capital expenditures are comprised of compensation costs of our software engineering staff for development of software for internal use and expenditures for computer, networking and communications hardware, and leasehold improvements. These expenditure items are reported as property, equipment, and intangible assets. Capital expenditures for property, equipment, and intangible assets were approximately $49\n, $49 million and $69 million for the three years ended December 31, 2024, 2023, and 2022, respectively. In the future, we plan to meet capital expenditure needs with cash from operations and cash on hand, as we continue our focus on technology infrastructure initiatives to further enhance our competitive position. In response to changing economic conditions, we believe we have the flexibility to modify our capital expenditures by adjusting them (either upward or downward) to match our actual performance. If we pursue any additional strategic acquisitions, we may incur additional capital expenditures.\n\nDaily monitoring of liquidity needs and available collateral levels is undertaken to help ensure that an appropriate liquidity cushion, in the form of cash and unpledged collateral, is maintained at all times. We actively manage our excess liquidity and maintain significant borrowing capabilities through the securities lending markets and in the form of credit facilities with banks. As a general practice, we maintain sufficient levels of cash on hand to provide us with a buffer should we need immediately available funds for any reason. In addition, pursuant to our liquidity risk management plan we perform periodic liquidity stress tests, which are designed to identify and reserve liquid assets that would be available under market or idiosyncratic stress events. Based on our current level of operations, we believe our cash flows from operations, available cash and available borrowings will be adequate to meet our future liquidity needs for more than the next twelve months.\n\nOccupancy expenses consist primarily of rental payments on office and data center leases and related occupancy costs, such as utilities. Depreciation and amortization expenses result from the depreciation of fixed assets, such as computing and communications hardware, as well as amortization of leasehold improvements and capitalized in\nhouse software development.\n\nmillion, primarily due to\na $57 million increase related to legal and regulatory matters, a $20 million increase in advertising expenses, and a one-time charge of $12 million related to the consolidation of our European subsidiaries.\nAs a percentage of total net revenues, general and administrative expenses were 6% for the current year and 5% for the prior year.\n\nNet interest income (interest income less interest expense), for the current year, increased $354 million, or 13%, compared to the prior year, to $3,148 million. The increase in net interest income was driven by higher customer margin loans and customer credit balances, and higher benchmark interest rates.\n\nDecisions on the allocation of capital are based upon, among other things, prudent risk management guidelines, potential liquidity and cash flow needs for current and future business activities, regulatory capital requirements, and projected profitability. Our Treasury department, Market Risk Committee, Enterprise Risk Management department and other management control groups assist in evaluating, monitoring and controlling the impact that our business activities have on our financial condition, liquidity and capital structure. The objective of these policies is to support our business strategies while ensuring ongoing and sufficient liquidity. Our significant capital comprises an aggregate across our many regulated subsidiaries, and in addition to supporting our current business and future expansion plans we believe this financial strength provides our customers with a source of confidence.\n\nNet interest income on margin loan balances rose compared to the prior year. This increase was due to the average federal funds effective rate increasing to 5.14% in the current year from 5.02% in the prior year, and the growth in margin loan balances in the current active market environment.\n\nOther income, for the current year, increased $71 million, compared to the prior year, to a gain of $60 million. This increase was mainly comprised of $65 million related to our currency diversification strategy; $48 million\nfrom our principal trading and investment activities; and $23 million related to million related to our strategic investment in Up Fintech Holding Limited (“Tiger Brokers”)\n; partially offset by a $48 million loss on positions taken over as customer accommodation due to a technical issue at the New York Stock Exchange that occurred on the morning of June 3, 2024, as previously disclosed; and $16 million related to the remeasurement of our Tax Receivable Agreement liability, payable to Holdings,\nwhich went from a gain of $7 million in the prior year to a loss of $9 million in the current year, primarily due to changes in the Company’s effective tax rates\n\nmillion, mainly due to higher costs related to the expansion of our physical space for both offices and data centers. As a percentage of total net revenues, occupancy, depreciation and amortization expenses were 2%\n\nIncome before income taxes, for the current year, increased $626 million, or 20%, compared to the prior year, to $3,695 million. Pretax profit margin was 71% for both the current year and the prior year.\n\nLower U.S. benchmark rates reduce the interest we earn on our segregated cash, the majority of which is invested in short-term U.S. government securities and related instruments. Higher short-term rates, and uncertainty over future U.S. Federal Reserve rate policy, have led us to maintain a short duration portfolio, substantially all of which matured within three months at December 31, 2024, to more closely match our asset and liability maturities on our interest-sensitive assets. Further, our margin balances are tied to benchmark rates, so lower rates also limit the interest we earn on margin lending to our customers. We continue to offer among the lowest rates in the industry on margin lending, and we believe our low rates are an important feature that attracts customers to our platform.\n\nCommunications expenses, for the current year, decreased $2 million, or 5%, compared to the prior year, to $39 million. As a percentage of total net revenues, communications expenses were 1%\n\nGlobal trading volumes\n. Worldwide, equities volumes at most major trading venues increased in the current year, while major market indices reached all-time highs in the U.S., Canada, Europe, U.K., Germany, Japan, and Australia. In the U.S., according to industry data, average daily volume in exchange-listed equity-based options increased by 10%, listed cash equities volume by 10%, and futures by 9%, compared to 2023. Options trading volumes have risen with the growing popularity of shorter-dated options contracts. In futures markets, volumes increased across all product segments, particularly in commodities such as the metals, energy and agriculture sectors, as investors sought to mitigate their exposure to ongoing economic and geopolitical uncertainties.\n\nExecution, clearing and distribution fees expenses increased 16% to $447 million, driven by higher customer trading volume in options, stocks and futures.\n\nNet interest income increased 13% from the prior year to $3,148 million, driven by higher average customer margin loans and cus",
  "item2_clean": null
}