{
  "source_file": "ibkr-20250930x10q.htm",
  "form_type": "10-Q",
  "item1_clean": null,
  "item7_clean": null,
  "item2_clean": "We continue to be exposed to the risks and uncertainties of doing business in international markets, particularly in the heavily regulated brokerage industry. Such risks and uncertainties include political, economic and financial instability, and foreign policy changes. For example, tensions between the U.S. and China have escalated in recent years, and changes in Chinese governmental oversight of the Chinese and Hong Kong capital markets could result in adverse effects on our business and loss of assets we hold in the region. Additionally, although our direct and indirect exposures to Russia and Ukraine are not material, the war in Ukraine and related sanctions have created substantial uncertainty in the global economy and financial markets.\n\nCurrency fluctuations\n. As a global electronic broker trading on exchanges around the world in multiple currencies, we are exposed to foreign currency risk. We actively manage this exposure by keeping our equity in proportion to a defined basket of 10 currencies we call the ‘‘GLOBAL’’ to diversify our risk and to align our hedging strategy with the currencies that we use in our business. Because we report our financial results in U.S. dollars, the change in the value of the GLOBAL versus the U.S. dollar affects our earnings. During the current quarter, the value of the GLOBAL, as measured in U.S. dollars, decreased 0.25% compared to its value at June 30, 2025, which had a negative impact on our comprehensive earnings for the current quarter.\n\nThe following discussion should be read in conjunction with the unaudited condensed consolidated financial statements and the related notes in Item 1, included elsewhere in this report. In addition to historical information, the following discussion also contains forward\nlooking statements that include risks and uncertainties. Our actual results may differ materially from those anticipated in these forward\nlooking statements as a result of certain factors, including those set forth under the heading “Risk Factors” in our Annual Report on Form 10\nK filed with the Securities Exchange Commission (“SEC”) on February 27, 2025, and elsewhere in this report.\n\nThe calculation of our tax liabilities involves dealing with uncertainties in the application of complex tax laws and regulations in a multitude of jurisdictions across our global operations. Changes in tax laws and rates could also affect recorded deferred tax assets and liabilities in the future. For example,\non December 15, 2022, the EU formally adopted the EU’s Pillar Two Directive, effective January 1, 2024, which provides for a minimum effective tax rate of 15%, as established by the Organization for Economic Cooperation and Development (“OECD”) Pillar Two Framework. A significant number of other countries have either already or are expected to implement similar legislation with varying effective dates.\nWe record tax liabilities in accordance with Financial Accounting Standards Board (“FASB”) ASC Topic 740 and adjust these liabilities when management’s judgment changes as a result of the evaluation of new information not previously available. Because of the complexity of some of these uncertainties, the ultimate resolution may result in payments that are different from the current estimates of these tax liabilities. These differences will be reflected as increases or decreases to income tax expense in the period in which new information becomes available.\n\nIn the current quarter, average securities borrowed balances increased 45%, to $9.0 billion, and average securities loaned balances increased 45%, to $20.7 billion, compared to the prior-year quarter. Net interest earned from securities lending is affected by the level of demand for securities positions held by our customers that investors are looking to sell short. During the current quarter, net interest earned from securities lending transactions increased $117 million, or 731%, compared to the prior-year quarter, driven by a higher level of short sale activity and a significant rise in the notional value of the securities we lent. However, as noted above, the rise in benchmark interest rates from near zero in 2022 has shifted a portion of the interest reported as generated by lending securities to interest income on segregated cash (see further explanation above). It should be noted that securities lending transactions entered into to support customer activity may produce interest income (expense) that is offset by interest expense (income) related to customer balances.\n\nDaily monitoring of liquidity needs and available collateral levels is undertaken to help ensure that an appropriate liquidity cushion, in the form of cash and unpledged collateral, is maintained at all times. We actively manage our excess liquidity and maintain significant borrowing capabilities through the securities lending markets and in the form of credit facilities with banks. As a general practice, we maintain sufficient levels of cash on hand to provide us with a buffer should we need immediately available funds for any reason. In addition, pursuant to our liquidity risk management plan we perform periodic liquidity stress tests, which are designed to identify and reserve liquid assets that would be available under market or idiosyncratic stress events. Based on our current level of operations, we believe our cash flows from operations, available cash and available borrowings will be adequate to meet our future liquidity needs for more than the next twelve months.\n\nOur businesses are subject to seasonal fluctuations, reflecting varying numbers of market participants at times during the year, varying numbers of trading days from quarter\nquarter, and declines in trading activity due to holidays. Typical seasonal trends may be superseded by market or world events, which can have a significant impact on prices and trading volume.\n\nCommissions, for the current quarter, increased $102 million, or 23%, compared to the prior-year quarter, to $537 million, driven by higher customer volume in stocks and options; partially offset by lower customer trading volumes in futures. Total customer stock share and options contract volumes increased 67% and 27%, respectively, while futures contract volume decreased 7%. Total DARTs for the current quarter increased 34% to 3.6 million, compared to 2.7 million for the prior-year quarter. Average commission per commissionable order for cleared customers decreased 5% to $2.70 for the current quarter compared to $2.83 for the prior-year quarter, due to lower average commissions per contract in stocks and options, primarily due to the SEC Section 31 transaction fee rate which was reduced to zero on May 14, 2025, and to greater capture of liquidity rebates, which, as pass-throughs, serve to lower both our commission revenues and our execution costs.\n\nOther fees and services, for the current quarter, decreased $6 million, or 8%, compared to the prior-year quarter, to $66 million, driven by a $12 million decrease in risk exposure fees as customers exhibited more cautious risk-taking behavior, partially offset by a $3 million increase in FDIC sweep fees and a $2 million increase in market data fees.\n\nDecisions on the allocation of capital are based upon, among other things, prudent risk management guidelines, potential liquidity and cash flow needs for current and future business activities, regulatory capital requirements, and projected profitability. Our Treasury department, Market Risk Committee, Enterprise Risk Management department and other management control groups assist in evaluating, monitoring and controlling the impact that our business activities have on our financial condition, liquidity and capital structure. The objective of these policies is to support our business strategies while ensuring ongoing and sufficient liquidity. Our significant capital comprises an aggregate across our many regulated subsidiaries, and in addition to supporting our current business and future expansion plans, we believe this financial strength provides our customers with a source of confidence.\n\nLower U.S. benchmark rates reduce the interest rate we earn on our segregated cash, the majority of which is invested in short-term U.S. government securities and related instruments. Lower medium-term rates, and uncertainty over future U.S. Federal Reserve rate policy, have led us to maintain a short duration portfolio, all of which matured within three months at September 30, 2025, to more closely match our asset and liability maturities on our interest-sensitive assets. Further, our margin balances are tied to benchmark rates, so lower rates also limit the interest we earn on margin lending to our customers. Higher balances can mitigate the impact of rate reductions. We continue to offer among the lowest rates in the industry on margin lending, and we believe our low rates are an important feature that attracts customers to our platform.\n\nWe believe that our current operations may be favorably or unfavorably impacted by the following trends and uncertainties that may affect our financial condition and results of operations:\n\nAlthough we cannot accurately anticipate the effects of inflation on our operations, we believe that, for the past several years, inflation may have indirectly had a material impact on our results of operations. Inflation has been one of the factors driving our employee compensation and benefits expenses higher during the current period, although as a percentage of net revenues these expenses remain stable. Inflation may also be a contributing factor to general uncertainty in the markets in the foreseeable future. Statements about future inflation are subject to the risk that actual inflation and its effects may differ, possibly materially, due to, among other things, changes in economic growth, impact of supply chain disruptions, unemployment and consumer demand.\n\nGlobal trading volumes.\nWorldwide, equities volumes at "
}