{
  "source_file": "ibm-20250930.htm",
  "form_type": "10-Q",
  "item1_clean": null,
  "item7_clean": null,
  "item2_clean": "We remain focused on accelerating innovation speed and impact, and we continue to invest in emerging technologies, including Quantum, bringing new innovations to market. To complement our portfolio, we completed six acquisitions in the first nine months of 2025, including the acquisition of HashiCorp in the first quarter, which brought leading automation and security tools that integrate with our hybrid cloud.\nOur performance over the first nine months of 2025 reflects the continued success of our focused strategy around hybrid cloud and AI and underscores the strength and diversity of our business model and portfolio. We remain focused on consistent execution, delivering long-term growth aligned with our financial model.\nWhile the operating environment continues to remain dynamic, we believe our focused portfolio, disciplined investments in innovation, diverse set of businesses and clients, relentless focus on productivity, and strong liquidity position drive the durability of our performance.\nRetirement-Related Plans\nOur pension plans are well funded. Contributions for all retirement-related plans are expected to be approximately $1.3 billion in 2025, essentially flat compared to 2024, of which $0.1 billion generally relates to legally required contributions to non-U.S. defined benefit and multi-employer plans. We expect 2025 pre-tax retirement-related plan cost to be approximately $1.1 billion. This estimate reflects current pension plan assumptions at December 31, 2024. Within total retirement-related plan cost, operating retirement-related plan cost is expected to be approximately $1.0 billion in 2025, essentially flat compared to 2024. Non-operating retirement-related plan cost is expected to be approximately $0.1 billion, a decrease of approximately $3.3 billion compared to 2024, primarily driven by the $3.1 billion of pension settlement charges resulting from the U.S. and Canada pension transfers in the second half of 2024, and lower recognized actuarial losses. Refer to note U, “Retirement-Related Benefits,” in our 2024 Annual Report for additional information.\nCurrency Rate Fluctuations\nChanges in the relative values of non-U.S. currencies to the U.S. dollar affect our financial results and financial position. Movements in currency, and the fact that we do not hedge 100 percent of our currency exposures, will result in a currency impact to our revenues, profit and cash flows throughout 2025. We execute a hedging program which defers, versus eliminates, the volatility of currency impacts on our financial results. During periods of sustained movements in currency, the marketplace and competition adjust to the changing rates over time.\nReferences to “adjusted for currency” or “constant currency” reflect adjustments based upon a simple mathematical formula. However, this constant currency methodology that we utilize to disclose this information does not incorporate any operational actions that management could take to mitigate fluctuating currency rates. Based on the currency rate movements in the third quarter of 2025, revenue from continuing operations increased 9.1 percent as reported and 7.3 percent at constant currency compared to the prior year. In the first nine months of 2025, revenue from continuing operations increased 5.9 percent as reported and 5.0 percent at constant currency, compared to the same period in 2024.\nAt September 30, 2025, currency changes resulted in assets and liabilities denominated in most local currencies being translated into more dollars than at year-end 2024. We use financial hedging instruments to limit specific currency risks related to foreign currency-based transactions.\nWe translate revenue, cost and expense in our non-U.S. operations at current exchange rates in the reported period. In the third quarter of 2025 and first nine months of 2025, the impact from currency translation and hedging to year-to-year pre-tax income, operating (non-GAAP) pre-tax income and segments profit margin growth was immaterial. Hedging and certain underlying foreign currency transaction gains and losses are allocated to our segment results. Considering the operational responses mentioned above, movements of exchange rates, and the nature and timing of hedging instruments, it is difficult to predict future currency impacts on any particular period.\nManagement Discussion – (continued)\nFor non-U.S. subsidiaries and branches that operate in U.S. dollars or whose economic environment is highly inflationary, translation adjustments are reflected in results of operations. Generally, we manage currency risk in these entities by linking prices and contracts to\nLiquidity and Capital Resources\nIn our 2024 Annual Report, on pages 34 to 37, there is a discussion of our liquidity including two tables that present three years of data. The table presented on page 34 includes net cash from operating activities, cash and cash equivalents, restricted cash and short-term marketable securities, and the size of our global credit facilities for each of the past three years. For the nine months ended, or at, as applicable, September 30, 2025, those amounts are $9.2 billion of net cash from operating activities, $14.9 billion of cash and cash equivalents, restricted cash and short-term marketable securities and $10.0 billion in global credit facilities, respectively. While we have no current plans to draw on these credit facilities, they are available as back-up liquidity.\nThe major rating agencies' ratings on our debt securities at September 30, 2025 appear in the following table and remain unchanged from June 30, 2025.\nSenior long-term debt\nA-\nA3\nA-\nA-2\nF1\nWe have financial flexibility, supported by our strong liquidity position and cash flows, to operate at a single A credit rating. Debt levels have increased $8.1 billion ($6.2 billion adjusted for currency) from December 31, 2024 driven by debt issuances; partially offset by maturities. In the first quarter of 2025, we issued $8.4 billion of debt for general corporate purposes, including our future debt maturity obligations, as well as capital allocation priorities. Refer to note 12, “Borrowings,” for additional information.\nWe do not have “ratings trigger” provisions in our debt covenants or documentation, which would allow the holders to declare an event of default and seek to accelerate payments thereunder in the event of a change in credit rating. Our debt covenants are well within the required levels. Our contractual agreements governing derivative instruments contain standard market clauses which can trigger the termination of the agreement if our credit rating were to fall below investment grade. At September 30, 2025, the fair value of those instruments that were in a liability position was $608 million, before any applicable netting, and this position is subject to fluctuations in fair value period to period based on the level of our outstanding instruments and market conditions. We have no other contractual arrangements that, in the event of a change in credit rating, would result in a material adverse effect on our financial position or liquidity.\nWe prepare our Consolidated Statement of Cash Flows in accordance with applicable accounting standards for cash flow presentation on page\n. For the purpose of running its business, IBM manages, monitors and analyzes cash flows in a different manner.\nfree cash flow as a measure to evaluate its operating results, strategic investments, plan shareholder return levels and assess its ability and need to incur and service debt. The entire free cash flow amount is not necessarily available for discretionary expenditures. We define free cash flow as net cash from operating activities less the change in Financing receivables and net capital expenditures, including the investment in software and other asset sales. A key objective of the Financing business is to generate strong returns on equity, and our Financing receivables are the basis for that growth. Accordingly, management considers Financing receivables as a profit-generating investment, not as working capital that should be minimized for efficiency. Therefore, management includes presentations of both free cash flow and net cash from operating activities that exclude the effect of Financing receivables.\nManagement Discussion – (continued)\nmanagement’s view of cash flows for the first nine months of 2025 and 2024 prepared in a manner consistent with the description above.\n(Dollars in millions)\nFor the nine months ended September 30:\nNet cash from operating activities per GAAP\nLess: change in Financing receivables\nNet cash from operating activities, excluding Financing receivables\nCapital expenditures, net\nChange in Financing receivables\nChange in total debt\nEffect of exchange rate changes on cash, cash equivalents and restricted cash\nChange in cash, cash equivalents, restricted cash and short-term marketable securities\nPrior-year amounts have been reclassified to conform to the change in 2025 presentation.\nIn the first nine months of 2025, we generated $7.2 billion in free cash flow, an increase of $0.6 billion versus the prior-year period. The increase was primarily driven by performance-related improvements within net income; partially offset by higher net capital expenditures as the prior year was reduced by the cash proceeds from the sale of certain QRadar SaaS assets, and working capital dynamics. In the first nine months of 2025, we invested $7.9 billion in acquisitions, including the acquisition of HashiCorp, and we continued to return value to shareholders with $4.7 billion in dividends.\nOur cash flows are sufficient to fund our current operations and obligations, including investing and financing activities such as dividends and debt service. When additional requirements arise, we have several liquidity options available. These options may include the ability to borrow additional funds at reasonable interest rates and utilizing our committed globa"
}