{
  "source_file": "ice-20241231.htm",
  "form_type": "10-K",
  "item1_clean": "BUSINESS\nIntercontinental Exchange, Inc. is a leading global provider of technology and data to a broad range of customers including financial institutions, corporations and government entities. Our products, which span major asset classes including futures, equities, fixed income and U.S. residential mortgages, provide our customers with access to mission critical tools that are designed to increase asset class transparency and workflow efficiency. Although we report our results in three reportable business segments, we operate as one business, leveraging the collective expertise, particularly in data services and technology, that exists across our platforms to inform and enhance our operations. Our segments are as follows:\nWe operate regulated marketplace technology for the listing, trading and clearing of a broad array of derivatives contracts and financial securities as well as data and connectivity services related to our exchanges and clearing houses.\nFixed Income and Data Services:\nWe provide fixed income pricing, reference data, indices, analytics and execution services as well as global credit default swaps, or CDS, clearing and multi-asset class data delivery technology.\nMortgage Technology:\nWe provide a technology platform that offers customers comprehensive, digital workflow tools that aim to address inefficiencies and mitigate risks that exist in the U.S. residential mortgage market life cycle, from application through closing, servicing and the secondary market.\nIn 2000, ICE was founded with the idea of transforming energy markets by creating a network that removed barriers and provided greater transparency, efficiency and access. By staying close to our customers, we have expanded into new asset classes and services, while retaining a core mission of reducing friction in markets, bringing efficiency to our customers’ workflows and, ultimately, connecting our customers to opportunity.\nToday, we are a Fortune 500 company, providing our customers with an array of technology solutions and data services that span a diverse set of asset classes.\nOur Business Segments\nOur business is conducted through three reportable business segments:\nFixed Income and Data Services; and\nMortgage Technology.\nThe majority of our identifiable assets are located in the U.S. and the U.K. For a summary of our revenues, net assets and net property and equipment by geographic region, see Note 19 to our consolidated financial statements included in this Annual Report.\nWe operate regulated marketplaces for the listing, trading and clearing of a broad array of derivatives contracts and financial securities, such as commodities, interest rates, foreign exchange and equities as well as corporate and exchange-traded funds, or ETFs. We operate multiple trading venues, including 13 regulated exchanges and 6 clearing houses, which are strategically positioned in major market centers around the world, including the U.S., U.K., European Union, or EU, Canada, Asia Pacific and the Middle East.\nOur Exchanges segment includes trading and listings revenue from our global futures network and the New York Stock Exchange and other registered securities exchanges, or collectively, the NYSE, and various data and connectivity services that are directly related to those exchange platforms. Revenues reflect a mix of both diversified transaction revenues and recurring data and listings revenues. Our Exchanges segment generated revenues, less transaction-based expenses of $5.0 billion and accounted for 53% of our consolidated revenues, less transaction-based expenses in 2024. Key asset classes include:\nEnergy Futures and Options:\nWe offer a range of futures and options products that are designed to enable our customers to manage their risk across global energy markets. Our flagship Brent crude oil contract serves as the cornerstone of a global oil network that today includes over 800 related crude and refined oil products including locational and refined spreads. In addition, as natural gas and Liquefied Natural Gas, or LNG, continue to globalize, we offer one of the broadest footprints of regional and global natural gas benchmarks, which spans North America, Europe and Asia. Our leading environmental and power markets round out our diverse global energy network. For over two decades, our environmental markets have provided customers risk management tools to meet carbon cap and trade program requirements and renewable fuel standards. Increasingly, market\nparticipants are turning to our global environmental markets to help navigate and manage risk related to climate change, the energy transition and the move to net zero emissions.\nAgricultural & Metals Futures and Options:\nWe offer futures and options on the leading global soft commodity markets including coffee, cocoa, cotton and sugar. Our benchmark contracts offer one of the most globally relevant price markers for these agricultural markets and provide our customers with the tools to manage price and counterparty risk and facilitate price discovery.\nFinancial Futures and Options:\nWe offer a diverse suite of equity futures and options contracts based on our own indices as well as those created by MSCI® and FTSE®. These contracts range from established global benchmarks, such as the MSCI® Emerging Market Index, to newer products, such as MSCI®’s suite of Environmental, Social and Governance, or ESG, indices and the NYSE FAANG+ Index. Our global interest rate complex spans geographies, currencies and tenors, providing participants around the world with tools to manage risk in a capital efficient manner. Key products include: Euribor, Gilts, Sterling Overnight Index Average, or SONIA, and Secured Overnight Financing Rates, or SOFR, among others.\nCash Equities and Equity Options:\nWe offer securities trading services through our five registered securities exchanges, including the NYSE. Our securities exchanges are leading providers of transparent, efficient, and high quality markets for the securities issued by large and small companies, ETFs and equity options. These markets serve issuers, investors and other market participants across five cash equity and two options markets.\nOur over-the-counter, or OTC, markets include bilateral energy markets that offer electronic trading of contracts based on physically-settled natural gas, power and refined oil contracts and other trade confirmation services. Our other revenues primarily include interest income on certain clearing margin deposits related to our futures business, regulatory penalties and fines, fees for use of our facilities, regulatory fees charged to member organizations of our U.S. securities exchanges, designated market maker service fees, exchange membership fees and agricultural grading and certification fees.\nData and Connectivity Services:\nOur exchange data services include, among other offerings, proprietary real-time and historical pricing data, as well as order book and transaction information related to our global futures markets and the NYSE exchanges. In addition, we receive a share of revenue from the sale of consolidated U.S. equity and options market data by the National Market System Plans, or NMS Plans. Separately, we also provide connectivity services directly related to our futures, cash equity and options exchanges and clearing houses. Revenues from data and connectivity services fees are largely recurring in nature.\nThe NYSE has been the venue of choice for innovators, visionaries and leaders for over 230 years. The NYSE offers a unique hybrid market model that combines leading technology with an accountable market maker to provide human judgment, a community of the world’s greatest companies and premium brand visibility. With over 70% of S&P 500 companies listed on the NYSE as of December 31, 2024, we are a leading listing venue across a range of sectors from technology and healthcare, to financials and energy. In addition to corporate listings, the NYSE is a global leader in ETF listings with 75%, or roughly $7.8 trillion, of ETF assets under management, or AUM, as of December 31, 2024. Revenues from listing fees are largely recurring in nature.\nWe operate 6 clearing houses, each of which acts as a central counterparty, or CCP, that, for its clearing members, becomes the buyer to every seller and the seller to every buyer. Through this CCP function, our clearing houses provide financial security for each transaction, for the duration of the position, by limiting counterparty credit risk. Our clearing houses are responsible for providing clearing services to each of our futures exchanges, and in some cases, to third-party execution venues.\nMechanisms have been created, called guaranty funds, to provide partial protection in the event of a clearing member default. Except for ICE NGX Canada Inc., or ICE NGX, each of the ICE Clearing Houses (as defined below) requires that each clearing member make deposits into a guaranty fund maintained by the relevant ICE Clearing House. In addition, we have contributed $370 million of our own cash to the guaranty funds which is one component of the table below, and such amounts are at risk and could be used in the event of a clearing member default. We also maintain default insurance as an additional layer of clearing member default protection, which is also reflected in the table below. The default insurance was renewed in September 2022 and has a three-year term for the following clearing houses in the following amounts: ICE Clear Europe - $100 million; ICE Clear U.S. - $25 million; and ICE Clear Credit - $75 million. In addition, the table below includes a guaranty fund of $215 million maintained by ICE NGX funded by the following: (1) a $200 million letter of credit issued by a major Canadian chartered bank, and backed by default insurance underwritten by Export Development Canada, a Crown corporation operated at arm’s length from the Canadian government, and (2) $15 million held as restricted cash to fund the first loss amount that ICE NGX is responsible for under the default insurance policy. Separately, ICE NGX has also set aside $30 million of its own capital that could be used for liquidity purposes in the event that a direct participant of the ICE NGX clearing house, or Contracting Party, defaults.\nOur contributions to each clearing house as of December 31, 2024 are listed below and our clearing houses are referred to herein collectively as “the ICE Clearing Houses”:\nExchange where Executed\nEnergy, agricultural, interest rates and equity index futures and options contracts\nU.K.\nICE Futures Europe, ICE Futures U.S., ICE Endex and ICE Futures Abu Dhabi\nAgricultural, metals, foreign exchange, or FX, interest rate, and equity index futures and options contracts\nU.S.\nOTC North American, European, Asian-Pacific and Emerging Market CDS instruments\nU.S.\nCreditex and third-party venues\nFixed Income and Data Services\nICE Clear Netherlands\nDerivatives on equities and equity indices traded on regulated markets\nEnergy, metals and financial futures products\nICE Futures Singapore\nICE NGX\nPhysical North American natural gas, environmental commodities and physical and financial electricity\nICE NGX\n(1) Although ICE Clear Credit is included in the Fixed Income and Data Services reporting segment, it is included in the table as a part of our suite of global clearing houses.\nFixed Income and Data Services Segment\nOur Fixed Income and Data Services segment includes our fixed income execution, or ICE Bonds, CDS clearing, our fixed income data and analytics offerings, and other multi-asset class data and network services. Our leading fixed income pricing and reference data offerings serve as the foundation for a broader fixed income network that provides our customers solutions that span the full workflow including pre- and post-trade analytics, a range of execution protocols and indices. In addition, our multi-asset class connectivity, feeds and desktop solution",
  "item7_clean": "ITEM 7. MANAGEMENT’S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS\nThe following discussion contains forward-looking statements that involve risks and uncertainties. Our actual results could differ materially from those anticipated in these forward-looking statements for many reasons. See the factors set forth under the heading\nWe are a leading global provider of technology and data to a broad range of customers including financial institutions, corporations and government entities. Our products, which span major asset classes including futures, equities, fixed income and U.S. residential mortgages, provide our customers with access to mission critical tools that are designed to increase asset class transparency and workflow efficiency. The majority of our identifiable assets are located in the U.S. and U.K. We report our results in the following three segments:\nWe operate regulated marketplace technology for the listing, trading and clearing of a broad array of derivatives contracts and financial securities as well as data and connectivity services related to our exchanges and clearing houses.\nFixed Income and Data Services:\nWe provide fixed income pricing, reference data, indices, analytics and execution services as well as global CDS clearing and multi-asset class data delivery technology.\nMortgage Technology:\nWe provide a technology platform that offers customers comprehensive, digital workflow tools that aim to address inefficiencies and mitigate risks that exist in the U.S. residential mortgage market life cycle from application through closing, servicing and the secondary market.\nGlobal Market Conditions\nOur results of operations are affected by global economic conditions, including macroeconomic conditions and geopolitical events and conflicts. Since 2022, macroeconomic conditions, including changes in interest rates, inflation and significant market volatility, along with geopolitical concerns, have created ongoing uncertainty and volatility in the global economy and resulted in a dynamic operating environment.\nOur business has been impacted positively and negatively by these global economic conditions. For instance, due to market and interest rate volatility, we have seen increased trading across a number of our products, such as interest rate and equity futures, credit default swaps and bonds. Conversely, increases in mortgage interest rates in 2023 and to a\nlesser extent, 2024, have resulted in reduced consumer and investor demand for mortgages and adversely impacted the transaction-based revenues in our Mortgage Technology segment. If mortgage rates remain high or further increase, or if mortgage lending practices change, our Mortgage Technology segment revenues may be further impacted. In addition, higher interest rates have resulted, and may continue to result, in higher interest rates for our debt instruments as we refinance our existing indebtedness.\nFrom an operational perspective, our businesses, including our exchanges, clearing houses, listings venues, data services businesses and mortgage platforms, have not suffered a material negative impact as a result of the events in Ukraine and the Middle East and surrounding regions.\nWe expect the macroeconomic environment to remain dynamic in the near-term, and we continue to monitor macroeconomic conditions, including interest rates, inflation rates, geopolitical events and military conflicts, including repercussions from the conflicts in Ukraine and the Middle East, and the impact that any of the foregoing may have on the global economy and on our business. We also continue to closely monitor credit worthiness of our counterparties, clearing members and our financial service providers and take risk management measures in line with established risk management frameworks.\nConsolidated Financial Highlights\nThe following summarizes our results and significant changes in our consolidated financial performance for the periods presented (dollars in millions, except per share amounts):\n(1) Operating income/(loss) from our Mortgage Technology segment was $(170) million, $(276) million and $57 million in 2024, 2023 and 2022, respectively.\n(2) The adjusted figures exclude items that are not reflective of our ongoing core operations and business performance. Adjusted net income attributable to ICE is presented net of taxes. These adjusted numbers are not calculated in accordance with U.S. Generally Accepted Accounting Principles, or U.S. GAAP. See “—Non-GAAP Financial Measures” below.\nYear Ended December 31,\nYear Ended December 31,\nRevenues, less transaction-based expenses\nTransaction revenues, net\nAdjusted operating expenses\nAdjusted operating income\nAdjusted operating margin\nOther income/(expense), net\nNet income attributable to ICE\nAdjusted net income attributable to ICE\nDiluted earnings per share attributable to ICE common stockholders\nAdjusted diluted earnings per share attributable to ICE common stockholders\nCash flows from operating activities\nAdjusted free cash flow\n(1) We define recurring revenues as the portion of our revenues that are generally predictable, stable, and can be expected to occur at regular intervals in the future with a relatively high degree of certainty and visibility. We define transaction revenues as those associated with a more specific point-in-time service, such as a trade execution.\n(2) The adjusted figures exclude items that are not reflective of our ongoing core operations and business performance. Adjusted net income attributable to ICE and adjusted diluted earnings per share attributable to ICE common stockholders are presented net of taxes. These adjusted figures are not calculated in accordance with U.S. GAAP. See “- Non-GAAP Financial Measures” below.\n(3) We believe these non-GAAP liquidity measures provide useful information to management and investors to analyze cash resources generated from our operations. We believe that free cash flow is useful as one of the bases for comparing our performance with our competitors and demonstrates our ability to convert the reinvestment of capital expenditures and capitalized software development costs required to maintain and grow our business. We believe that adjusted free cash flow eliminates the impact of timing differences related to the payment of Section 31 fees. These figures are not calculated in accordance with U.S. GAAP. See “—Non-GAAP Liquidity Measures” below.\nRevenues, less transaction-based expenses, increased $1.3 billion in 2024 from 2023. The increase in revenues includes $18 million in favorable foreign exchange effects arising from fluctuations in the U.S. dollar in 2024 as compared to 2023.\nRevenues, less transaction-based expenses, increased $696 million in 2023 from 2022. The increase in revenues includes $17 million in favorable foreign exchange effects arising from fluctuations in the U.S. dollar in 2023 as compared to 2022.\nOperating expenses increased $676 million in 2024 from 2023. The increase in operating expenses includes $8 million in unfavorable foreign exchange effects arising from fluctuations in the U.S. dollar in 2024 as compared to 2023.\nOperating expenses increased $640 million in 2023 from 2022. The increase in operating expenses includes $4 million in unfavorable foreign exchange effects arising from fluctuations in the U.S. dollar in 2023 as compared to 2022.\nOther income/(expense), net, in 2024 primarily includes interest income of $141 million, interest expense of $910 million, our equity earnings in OCC of $25 million, estimated equity losses in our investment in Bakkt of $83 million, a gain of $160 million related to the PennyMac arbitration final award payment, a gain of $6 million related to the sale of certain fixed assets and FX remeasurement losses of $15 million.\nOther income/(expense), net, in 2023 primarily includes interest income of $319 million, interest expense of $808 million, our equity earnings in OCC of $16 million, estimated equity losses in our investment in Bakkt of $135 million, a fair value loss of $160 million related to the Black Knight Promissory Note, an impairment related to our CAT loan receivable of $16 million, FX remeasurement losses of $12 million, and a loss on the sale of the Dun & Bradstreet investment of $3 million, net of dividends received, that we acquired through the acquisition of Black Knight.\nThe 23% effective tax rate in 2024 was above the statutory federal income tax rate primarily due to state and local income taxes, including the impacts of recording valuation allowances on certain state deferred tax assets, partially offset by favorable state apportionment changes and statutes of limitations expirations.\nThe 16% effective tax rate in 2023 was below the statutory federal income tax rate primarily driven by the following factors: favorable audit settlements for historical years, favorable state apportionment changes, and the application of the high-tax exception to Global Intangible Low-Taxed Income. These benefits were partially offset by the impact of the U.K. corporate income tax increase from 19% to 25% effective April 1, 2023, and the tax impact of certain non-deductible Black Knight acquisition costs.\nThe 17% effective tax rate in 2022 was below the statutory federal income tax rate primarily driven by the deferred income tax benefit from the impairment of our equity investment in Bakkt.\nBusiness Environment and Market Trends\nOur business environment has been characterized by:\nglobalization of marketplaces, customers and competitors;\ngrowing customer demand for workflow efficiency and automation;\ncommodity, interest rate, inflation rate and financial markets volatility and uncertainty;\ngrowing demand for data to inform customers' risk management and investment decisions;\nevolving, increasing and disparate regulation across multiple jurisdictions;\nprice volatility increasing customers' demand for risk management services;\nincreasing focus on capital and cost efficiencies;\ncustomers' preference to manage risk in markets demonstrating the greatest depth of liquidity and product diversity;\nthe evolution of existing products and new product innovation to serve emerging customer needs and changing industry agreements;\nemerging technology initiatives and offerings in our markets, including the use of artificial intelligence and machine learning;\nrising demand for speed, data, data capacity and connectivity by market participants, necessitating increased investment in technology; and\nconsolidation and increasing competition among global markets for trading, clearing and listings.\nRecent changes with regard to global financial reform have emphasized the importance of transparent markets, centralized clearing and access to data, all of which are important aspects of our product offering. However, some of the proposed rules have yet to be implemented and some rules that have already been partially implemented are being reconsidered, have been stayed or are subject to challenges in court. In addition, some of the global regulations have not been fully harmonized and several non-U.S. regulations are inconsistent with U.S. rules. As the evolution continues, legislative and regulatory actions may change the way we conduct our business and may create uncertainty for market participants, which could affect trading volumes or demand for market data. As a result, it is difficult to predict all of the effects that the legislation and its implementing regulations will have on us. As discussed more fully in Item 1 “- Business - Regulation” included in this Annual Report, Brexit, MiFID II and other regulations have resulted in operational, regulatory and/or business risk.\nWe have diversified our business so that we are not dependent on volatility or transaction activity in any one asset class. In addition, we have increased our portion of recurring revenues from 34% in 2014 to 52% in 2024. These recurring revenues include data services, listings and various mortgage technology solutions.\nMany of the data products we sell and services we provide are required for our clients’ business operations regardless of market volatility or shifts in business profitability levels. We anticipate that there will continue to be growth in the financial information services sector driven by a number of global trends, including the following:\nincreasing or evolving global regulatory demands;\ngreater use of fair value accounting standards and reliance on independent valuations;\ngreater emphasis on risk management;\nmarket fragmentation driven by regulatory changes;\nthe move to passive investing and indexation;\nongoing growth in the size and diversity of financial markets;\nincreased automation of fixed income, mortgage and other less automated markets;\nthe development of new data products;\ngreater use of emerging technologies, including artificial intelligence and machine learning;\nthe demand for greater data capacity and connectivity;\nincreasing demand for outsourced services by financial institutions.\nWe continue to focus on our strategy to grow each of our revenue streams, and prudently manage expenses, in order to mitigate these uncertainties and to build on our growth opportunities by leveraging our proprietary data, clearing, markets and technology solutions.\nOur business is conducted through three reportable business segments: Exchanges, Fixed Income and Data Services and Mortgage Technology. Segments are discussed more in detail in \"Item 1- Business\". While revenues are recorded specifically in the segment in which they are earned or to which they relate, a significant portion of our operating expenses are not solely related to a specific segment because the expenses serve functions that are necessary for the operation of more than one segment. We directly allocate expenses when reasonably possible to do so. Otherwise, we use a pro-rata revenue approach as the allocation method for the expenses that do not relate solely to one segment and serve functions that are necessary for the operation of all segments. Our segments do not engage in intersegment transactions.\nThe following presents selected statements of income data for our Exchanges segment (dollars in millions):\n(1) The adjusted figures in the charts above are calculated by excluding items that are not reflective of our cash operations and core business performance. As a result, these adjusted figures are not calculated in accordance with U.S. GAAP. See “- Non-GAAP Financial Measures” below.\nYear Ended December 31,\nYear Ended December 31,\nEnergy futures and options\nAgricultural and metals futures and options\nFinancial futures and options\nCash equities and equity options\nTransaction and clearing, net\nData and connectivity services\nTransaction-based expenses\nRevenues, less transaction-based expenses\nOther operating expenses\nDepreciation and amortization\nAcquisition-related transaction and integration costs\nTransaction revenues, net\n*Percentage changes in the table above deemed \"n/a\" are not meaningful.\n(1) Transaction-based expenses are largely attributable to our cash equities and options business.\nOur Exchanges segment includes transaction and clearing revenues from our futures and NYSE exchanges, related data and connectivity services, and our listings business. Transaction and clearing revenues consist of fees collected from derivatives, cash equities and equity options trading and derivatives clearing, and are reported on a net basis, except for the NYSE transaction-based expenses discussed below. Rates per-contract, or RPC, are driven by the number of contracts or securities traded and the fees charged per contract, net of certain rebates. Our per-contract transaction and clearing revenues will depend upon many factors, including, but not limited to, market conditions, transaction and clearing volume, product mix, pricing, applicable revenue sharing and market making agreements, and new product introductions.\nTrans",
  "item2_clean": null
}