{
  "source_file": "idxx-20250930.htm",
  "form_type": "10-Q",
  "item1_clean": null,
  "item7_clean": null,
  "item2_clean": "We develop, manufacture, and distribute products and provide services primarily for the companion animal veterinary, livestock, poultry and dairy, and water testing sectors. We also provide human medical point-of-care diagnostics. Our primary products and services are:\nPoint-of-care veterinary diagnostic products, comprised of instruments, consumables, and rapid assay test kits;\nVeterinary reference laboratory diagnostic and consulting services;\nPractice management and diagnostic imaging systems and services used by veterinarians;\nHealth monitoring, biological materials testing, laboratory diagnostic instruments, and services used by the biomedical research community;\nDiagnostic and health-monitoring products for livestock, poultry, and dairy;\nProducts that test water for certain microbiological contaminants; and\nPoint-of-care electrolytes and blood gas analyzers for the human medical diagnostics sector.\nDescription of Operating Segments\n. We operate primarily through three operating segments: diagnostic and information management-based products and services for the companion animal veterinary industry, which we refer to as the Companion Animal Group (“CAG”); water quality products (“Water”); and diagnostic tests, services, and related instrumentation that are used to manage the health status of livestock and poultry, to improve producer efficiency, and to ensure the quality and safety of milk, which we refer to as Livestock, Poultry and Dairy (“LPD”). Other information combines and presents our human medical diagnostic products business (“OPTI Medical”) with our out-licensing arrangements because they do not meet the quantitative or qualitative thresholds for reportable segments. Foreign currency transaction gains and losses for all operating segments are also reported within Other.\nCurrency Impact, Tariff and Trade Policies, U.S. Tax Law Changes, and Other Items\nChanges in Tariff and Trade Policies\n. Although we manufacture many of our companion animal and water quality products, as well as certain of our LPD testing products, in the United States, we rely on third-party suppliers located in the United States and other regions (such as Europe and Asia Pacific) for certain components, raw materials, and consumables used in or with our products. In addition, as a global business, our products and services are sold in more than 175 countries. For the year ended December 31, 2024, approximately 35% of our overall revenues were attributable to sales of products and services to customers outside the United States, with less than 1% of our overall revenues attributable to sales of products and services to customers domiciled in China. Accordingly, changes in tariff and trade policies may adversely affect our business, financial condition, and operating results.\nThe U.S. government has periodically announced changes to its trade policy, including increasing tariffs on imports, in some cases significantly, and potentially renegotiating or terminating its existing trade agreements. Imposition of certain country-specific tariffs are uncertain and subject to negotiations, and these actions, as well as retaliatory tariffs imposed by other countries on U.S. exports and continuing uncertainty regarding tariff and trade policies have led to volatility and uncertainty in global markets. Continuing tariff and trade policy uncertainty may lead to sustained volatility and uncertainty in U.S. and global financial and economic conditions, increased inflation, diminished expectations for economic growth, and actual or perceived economic weakness, which could result in reduced demand for our products and services.\nWhile we are working to optimize operations and inventory management to the extent feasible, to help mitigate and reduce the potential impact from changes in tariff and trade policies, any imposed tariffs (including retaliatory tariffs) and our mitigation activities may cause our cost of goods to increase, our profit margins to decrease, or our products to become less competitive or less available in the applicable region. We are continuing to monitor the dynamic trade environment and evaluate these developments and our ability to offset some portion of these costs and otherwise mitigate the impact on our business, financial condition, and operating results.\nU.S. Tax Law Changes\n. On July 4, 2025, H.R. 1 of the 119th Congress, also referred to as the “One Big Beautiful Bill Act” (“OBBBA”), was signed into law. The OBBBA includes significant changes to federal tax law, such as the permanent extension of certain expiring provisions of the Tax Cuts and Jobs Act of 2017, as well as modifications to the international tax framework and other regulatory provisions. The OBBBA also reinstates the ability to immediately expense domestic research and development costs for tax years beginning after December 31, 2024, and allows previously capitalized research and development costs not amortized to be deducted in the current period. During the third quarter we recognized the impact of accelerating the research and development deductions, and the resulting reduction of our Foreign-Derived Intangible Income benefit, which resulted in an increase to income tax expense. The acceleration of our research and development deductions is expected to reduce our projected taxes due for the current year by approximately $105 million.\n. Refer to “Part I, Item 1. Business - Patents and Licenses” and “Part II. Item 7. Management’s Discussion and Analysis of Financial Condition and Results of Operations” included in our 2024 Annual Report for additional information regarding trends in companion animal healthcare, distributor purchasing and inventories, economic conditions, geopolitical conflict effects and patent expiration.\nCritical Accounting Estimates and Assumptions\nThe discussion and analysis of our financial condition and results of operations is based upon our unaudited condensed consolidated financial statements, which have been prepared in accordance with U.S. GAAP. The preparation of these financial statements requires us to make estimates and judgments that affect the reported amounts of assets, liabilities, revenues, and expenses, and related disclosure of contingent assets and liabilities. We evaluate our estimates on an ongoing basis. We base our estimates on historical experience and on various assumptions that we believe to be reasonable under the circumstances, the results of which form the basis for making judgments about the carrying values of assets and liabilities that are not readily apparent from other sources. Actual results may differ from these estimates. The critical accounting policies and the significant judgments and estimates used in the preparation of our unaudited condensed consolidated financial statements for the three and nine months ended September 30, 2025, are consistent with those discussed in our 2024 Annual Report in the section under the heading “Part II. Item 7. Management’s Discussion and Analysis of Financial Condition and Results of Operations - Critical Accounting Estimates and Assumptions.”\nRecent Accounting Pronouncements\n\nNon-GAAP Financial Measures\nOrganic Revenue Growth\n. The following revenue analysis and discussion focuses on organic revenue growth, and references in this analysis and discussion to “revenue,” “revenues,” or “revenue growth” are references to “organic revenue growth.” Organic revenue growth is a non-GAAP financial measure and represents the percentage change in revenue during the three and nine months ended September 30, 2025, compared to the same period for the prior year, net of the effect of changes in foreign currency exchange rates, certain business acquisitions, and divestitures. Organic revenue growth should be considered in addition to, and not as a replacement for, or as a superior measure to, revenue growth reported in accordance with U.S. GAAP, and may not be comparable to similarly titled measures reported by other companies. Management believes that reporting organic revenue growth provides useful information to investors by facilitating easier comparisons of our revenue performance with prior and future periods and to the performance of our peers.\nWe exclude from organic revenue growth the effect of changes in foreign currency exchange rates because changes in foreign currency exchange rates are not under management’s control, are subject to volatility, and can obscure underlying business trends. We calculate the impact on revenue resulting from changes in foreign currency exchange rates by applying the difference between the weighted average exchange rates during the current-year period and the comparable prior-year period to foreign currency denominated revenues for the prior-year period.\nWe also exclude from organic revenue growth the effect of certain business acquisitions and divestitures because the nature, size, and number of these transactions can vary dramatically from period to period, and because they either require or generate cash as an inherent consequence of the transaction, and therefore can also obscure underlying business and operating trends. We consider acquisitions to be a business when all three elements of inputs, processes, and outputs are present, consistent with ASU 2017-01, “\nBusiness Combinations: (Topic 805) Clarifying the Definition of a Business\n.” If substantially all the fair value of the assets acquired is concentrated in a single identifiable asset or group of similar identifiable assets, we do not consider these assets to be a business. A typical acquisition that we do not consider a business is a customer relationships asset acquisition, which does not have all elements necessary to operate a business, such as employees or infrastructure. We believe the efforts required to convert and retain these acquired customers are similar in nature to our existing customer base and therefore are included in organic revenue growth. The percen"
}