{
  "source_file": "iff-20250930.htm",
  "form_type": "10-Q",
  "item1_clean": null,
  "item7_clean": null,
  "item2_clean": "Nine Months Ended September 30,\n(DOLLARS IN MILLIONS)\nSegment Comparable Currency Neutral Adjusted Operating EBITDA\nHealth & Biosciences\nImpact of Business Divestitures\nImpact of Currency Fluctuation\nDepreciation & Amortization\nRestructuring and Other Charges\nImpairment of Goodwill\nGains (Losses) on Business Disposals\nLoss on Assets Classified as Held for Sale\nDivestiture and Integration Costs\nStrategic Initiatives Costs\nGain on Debt Extinguishment\nEntity Realignment Costs\nIncome (Loss) Before Taxes\nSegment Comparable Currency Neutral Adjusted Operating EBITDA Margin:\nHealth & Biosciences\n_____________________\nRefer to Note 6 for a reconciliation of Adjusted Operating EBITDA to Income (Loss) Before Taxes.\nComparable portfolio results for 2024 exclude the impact of divestitures. Impact of business divestitures includes the results of the F&E UK business that was divested on September 1, 2024 (for September 2024), and the Pharma Solutions disposal group and Nitrocellulose business that were divested on May 1, 2025 and May 9, 2025, respectively (for May 1, 2024 to September 30, 2024 and May 9, 2024 to September 30, 2024, respectively).\nCurrency neutral amounts are calculated by translating current year transaction amounts at the exchange rates for the corresponding prior year period.\nFollowing the completed divestitures of the Pharma Solutions disposal group on May 1, 2025 and the Nitrocellulose business on May 9, 2025, the Company reallocated certain corporate costs previously attributed to the Pharma Solutions segment. These costs have been redistributed across the Taste, Food Ingredients, Health & Biosciences, and Scent segments for comparability purposes.\nNine Months Ended September 30, 2024\nSelling & Administrative Expenses\nResearch & Development Expenses\nHealth & Biosciences\nTaste Segment Adjusted Operating EBITDA\nTaste Segment Adjusted Operating EBITDA increased $11 million, or 3% on a reported basis, to $384 million in the first nine months of 2025 (20.3% of segment sales) from $373 million (20.1% of segment sales) in the comparable 2024 period. On a comparable currency neutral basis, Taste Segment Adjusted Operating EBITDA increased 8% in 2025 compared to the prior year period, primarily driven by volume increases and favorable net pricing.\nFood Ingredients Segment Adjusted Operating EBITDA\nFood Ingredients Segment Adjusted Operating EBITDA increased $33 million, or 11% on a reported basis, to $341 million in the first nine months of 2025 (13.8% of segment sales) from $308 million (12.1% of segment sales) in the comparable 2024 period. On a comparable currency neutral basis, Food Ingredients Segment Adjusted Operating EBITDA increased 17% in 2025 compared to the prior year period, primarily driven by productivity gains offset by unfavorable net pricing and volume decreases.\nHealth & Biosciences Segment Adjusted Operating EBITDA\nHealth & Biosciences Segment Adjusted Operating EBITDA remained flat on a reported basis, at $439 million in the first nine months of 2025 (25.9% of segment sales) and $441 million in the comparable 2024 period (26.7% of segment sales). On a comparable currency neutral basis, Health & Biosciences Segment Adjusted Operating EBITDA increased 3% in 2025 compared to the prior year period, primarily driven by productivity gains and volume increases.\nScent Segment Adjusted Operating EBITDA\nScent Segment Adjusted Operating EBITDA decreased $30 million, or 7% on a reported basis, to $409 million in the first nine months of 2025 (21.9% of segment sales) from $439 million (23.6% of segment sales) in the comparable 2024 period. On a comparable currency neutral basis, Scent Segment Adjusted Operating EBITDA increased 2% in 2025 compared to the prior year period, primarily driven by strong performances in Fine Fragrances, partially offset by volume declines in Fragrance Ingredients. Comparable portfolio results exclude the impact of the divestiture of the Cosmetic Ingredients business with an Adjusted Operating EBITDA impact of approximately $14 million.\nPharma Solutions Segment Adjusted Operating EBITDA\nPharma Solutions Segment Adjusted Operating EBITDA decreased $97 million, or 56% on a reported basis, to $76 million in the first nine months of 2025 (20.6% of segment sales) from $173 million (21.6% of segment sales) in the comparable 2024 period. On a comparable currency neutral basis, Pharma Solutions Segment Adjusted Operating EBITDA increased 16% in 2025 compared to the prior period. The divestitures of the Pharma Solutions disposal group and Nitrocellulose business had an impact on Adjusted Operating EBITDA of approximately $105 million. This comparison reflects three full quarters of contributions from both businesses in 2024, whereas 2025 includes only four months of activity prior to the divestitures, contributing significantly to the year-over-year decline.\nCash and Cash Equivalents\nWe had cash and cash equivalents of $621 million on the Consolidated Balance Sheets at September 30, 2025 compared to\n, inclusive of $2 million in Assets held for sale on the Consolidated Balance Sheets, at December 31, 2024. A portion of this balance was held outside the United States. Cash balances held in foreign jurisdictions are, in most circumstances, available to be repatriated to the United States.\nEffective utilization of the cash generated by our international operations is a critical component of our strategy. We regularly repatriate cash from our non-U.S. subsidiaries to fund financial obligations in the U.S. As we repatriate these funds tothe U.S., there will be required income taxes payable in certain U.S. states and applicable foreign withholding taxes during the period when such repatriation occurs. Accordingly, as of September 30, 2025, we had a deferred tax liability of approximately $144 million for the effect of repatriating the funds to the U.S., attributable to various non-U.S. subsidiaries. There is no deferred tax liability associated with non-U.S. subsidiaries where we intend to indefinitely reinvest the earnings to fund local operations and/or capital projects.\nCash Flows Provided By Operating Activities\nCash flows provided by operating activities for the nine months ended September 30, 2025 were $532 million, or 6.4% of sales, compared to $681 million, or 7.8% of sales, for the nine months ended September 30, 2024. The decrease in cash flows from operating activities during 2025 was primarily driven by the increase in working capital, largely related to inventories, accruals for incentive compensation, offset in part by accounts receivables and accounts payable, excluding the impact of non-cash adjustments.\nCash Flows Provided By Investing Activities\nCash flows provided by investing activities for the nine months ended September 30, 2025 were $2.426 billion compared to $607 million in the prior year period. The increase in cash flows provided by investing activities during 2025 was primarily driven by higher net proceeds received from the divestitures of the Pharma Solutions disposal group, Nitrocellulose business and the Tobacco Flavoring business in North America, compared to the net proceeds received during 2024 primarily from the divestiture of the Cosmetic Ingredients business. This increase was offset in part by higher spending on property, plant and equipment during 2025 compared to 2024.\nWe expect that capital spending in 2025 will be approximately 5.5% of sales, up from approximately 4.0% in 2024.\nCash Flows Used In Financing Activities\nCash flows used in financing activities for the nine months ended September 30, 2025 were $2.891 billion compared to $1.444 billion in the prior year period. The increase in cash flows used in financing activities was primarily driven by Company’s purchase for cash of certain of its outstanding series of Senior Notes for an aggregate purchase price of $2.0 billion, excluding accrued and unpaid interest. The Company also repaid the remaining borrowings under both the 2026 Term Loan Facility and the 2025 Notes during the period. These outflows were partially offset by an increase in commercial paper borrowings during the nine months ended September 30, 2025.\nWe paid dividends totaling $306 million in the 2025 period. We declared a cash dividend per share of $0.40 in the third quarter of 2025 that was paid on October 10, 2025 to all shareholders of record as of September 29, 2025.\nOur capital allocation strategy seeks to maintain investment grade ratings while investing in the business, continuing to pay dividends, repurchasing shares outstanding and repaying debt. The Company does not have any rating downgrade triggers that would accelerate the maturity dates of its senior unsecured debt. However, any downgrade in our credit rating may, depending on the extent of such downgrade, negatively impact our ability to raise additional debt capital, our liquidity and capital position, and may increase our cost of borrowing for new capital raises. In addition, our existing Revolving Credit Facility has pricing grids that are based on credit rating, such that our cost of borrowing may increase as our credit rating decreases. We make capital investments in our businesses to support our operational needs and strategic long-term plans. We are committed to maintaining our history of paying a dividend to investors which is determined by our Board of Directors at its discretion based on various factors.\nOperating cash flow provides the primary source of funds for capital investment needs, dividends paid to shareholders and debt service repayments. We anticipate that cash flows from operations, cash proceeds generated from planned business divestitures and availability under our existing credit facilities will be sufficient to meet our investing and financing needs, including our debt service requirements for the foreseeable future. We regularly assess our capital structure, including both current and long-term debt instruments, as compared to our cash ge"
}