{
  "source_file": "incy-20250930.htm",
  "form_type": "10-Q",
  "item1_clean": null,
  "item7_clean": null,
  "item2_clean": "/ MINJUVI\n(tafasitamab), OPZELURA\n(ruxolitinib) cream, ZYNYZ\n(retifanlimab-dlwr) and NIKTIMVO\nTM\nour collaboration and strategic relationship strategy, and anticipated benefits and disadvantages of entering into collaboration agreements;\nour licensing, investment and commercialization strategies, including our plans to commercialize our drug products and drug candidates;\nthe regulatory approval process, including obtaining U.S. Food and Drug Administration and other international regulatory authorities’ approval for our products in the United States and abroad;\nthe safety, effectiveness and potential benefits and indications of our drug candidates and other compounds under development;\nthe timing, structure and size of our clinical trials; the compounds expected to enter clinical trials; the timing of clinical trial results;\nour ability to manage expansion of our drug discovery and development operations;\nfuture required expertise relating to clinical trials, manufacturing, sales and marketing;\nobtaining and terminating licenses to products, drug candidates or technology, or other intellectual property rights;\nthe receipt from or payments pursuant to collaboration or license agreements resulting from milestones or royalties;\nplans to develop and commercialize products on our own;\nplans for our manufacturing operations, including plans to use third-party manufacturers;\nexpected expenses and expenditure levels; expected uses of cash; expectations with respect to the need or ability to raise additional capital; expected revenues and sources of revenues; expectations with respect to inventory;\nexpectations with respect to reimbursement for our products;\nthe expected impact of recent accounting pronouncements and changes in tax laws;\nexpected losses; fluctuation of losses; currency translation impact associated with non-U.S. operations and collaboration royalties;\nour profitability; the adequacy of our capital resources to continue operations;\nthe costs and other financial impacts associated with resolving matters in litigation and governmental proceedings;\nour expectations regarding competition;\nour investments, including anticipated expenditures, losses and expenses; and\nour patent prosecution and maintenance efforts.\nThese forward-looking statements reflect our current views with respect to future events, are based on assumptions and are subject to risks and uncertainties. These risks and uncertainties could cause actual results to differ materially from those projected and include, but are not limited to:\nour ability to discover, develop, formulate, manufacture and successfully commercialize our drug products and drug candidates;\nour ability to obtain, or maintain at anticipated levels, coverage and reimbursement for our products from government health administration authorities, private health insurers and other organizations;\nrisks relating to changes in pricing and reimbursement in the markets in which we compete;\nour ability to establish and maintain effective sales, marketing and distribution capabilities;\nour ability to obtain and maintain regulatory approvals to market our products;\nour ability to achieve a significant market share in order to achieve or maintain profitability;\nthe risk of civil or criminal penalties if we market our products in a manner that violates health care fraud and abuse and other applicable laws, rules and regulations;\nthe risk of unanticipated delays in, or discontinuations of, research and development efforts;\nthe risk that previous preclinical testing or clinical trial results are not necessarily indicative of future clinical trial results;\nrisks relating to the conduct of our clinical trials, including geopolitical risks;\nchanging regulatory requirements;\nthe risk of adverse safety findings;\nthe risk that results of our clinical trials do not support submission of a marketing approval application for our drug candidates;\nrisks relating to our reliance on third-party manufacturers, collaborators, and clinical research organizations;\nrisks relating to the development of new products and their use by us and our current and potential collaborators;\nour ability to maintain or obtain adequate product liability and other insurance coverage;\nthe impact of technological advances and competition to develop and commercialize similar drug products, including potential generic competition;\nour ability to obtain and maintain patent protection and freedom to operate for our discoveries and to continue to be effective in prosecuting, maintaining, defending and enforcing patent claims and other intellectual property rights;\nthe impact of changing laws on our patent portfolio;\ndevelopments in, and expenses relating to, litigation and governmental proceedings;\nour ability to in-license drug candidates or other technology;\nunanticipated delays or changes in plans or regulatory agency interactions or other issues relating to our large molecule production facility;\nthe impact of tariffs and trade conflicts and the effects of any economic slowdown;\nour ability to integrate successfully acquired businesses, development programs or technology;\nour ability to obtain additional capital when needed;\nfluctuations in net cash provided and used by operating, financing and investing activities;\nchanges in tax laws and regulations and our ability to analyze the effects of new accounting pronouncements and apply new accounting rules;\nrisks relating to our ability to sustain profitability;\nrisks related to public health pandemics such as the COVID-19 pandemic, natural disasters, or geopolitical events such as the Russian invasion of Ukraine and conflicts in the Middle East; and\nGiven these risks and uncertainties, you should not place undue reliance on these forward-looking statements. Except as required by federal securities laws, we undertake no obligation to update any forward-looking statements for any reason, even if new information becomes available or other events occur in the future.\nIn this report all references to “Incyte,” “we,” “us,” “our” or the “Company” mean Incyte Corporation and our subsidiaries, except where it is made clear that the term means only the parent company.\nSummary Risk Factors\nOur business is subject to numerous risks and uncertainties that could affect our ability to successfully implement our business strategy and affect our financial results. You should carefully consider all of the information in this report and, in particular, the following principal risks and all of the other specific factors described in Item 1A. “Risk Factors” of this report before deciding whether to invest in our company.\nWe depend heavily on JAKAFI/JAKAVI (ruxolitinib), and if we are not able to maintain revenues from JAKAFI/JAKAVI or those revenues decrease, our business may be materially harmed.\nIf we or our collaborators are unable to obtain, or maintain at anticipated levels, coverage and reimbursement for our products from government and other third-party payors, our results of operations and financial condition could be harmed.\nA limited number of specialty pharmacies and wholesalers represent a significant portion of revenues from JAKAFI and most of our other products, and the loss of, or significant reduction in sales to, any one of these specialty pharmacies or wholesalers could harm our operations and financial condition.\nIf we are unable to establish and maintain effective sales, marketing and distribution capabilities, or to enter into agreements with third parties to do so, we will not be able to successfully commercialize our products.\nIf we fail to comply with applicable laws and regulations, we could lose our approval to market our products or be subject to other governmental enforcement activity.\nIf the use of our products harms or is perceived to harm patients, our regulatory approvals could be revoked or otherwise negatively impacted or we could be subject to costly product liability claims.\nIf we market our products in a manner that violates various laws and regulations, we may be subject to civil or criminal penalties.\nCompetition for our products could harm our business and result in a decrease in our revenue.\nWe or our collaborators may be unsuccessful in discovering and developing drug candidates, and we may spend significant time and money attempting to do so, in particular with our later stage drug candidates.\nIf we or our collaborators are unable to obtain regulatory approval in and outside of the United States for drug candidates, we and our collaborators will be unable to commercialize those drug candidates.\nHealth care reform measures could impact the pricing and profitability of pharmaceuticals, and adversely affect the commercial viability of our or our collaborators’ products and drug candidates.\nConflicts between us and our collaborators or termination of our collaboration agreements could limit future development and commercialization of our drug candidates and harm our business.\nIf we are unable to establish collaborations to fully exploit our drug discovery and development capabilities or if future collaborations are unsuccessful, our future revenue prospects could be diminished.\nIf we fail to enter into additional in-licensing agreements or if these arrangements are unsuccessful, we may be unable to increase our number of successfully marketed products and our revenues.\nBusiness disruptions, including those resulting from public health pandemics, natural disasters, and other geopolitical events, could adversely affect our business and results of operations.\nEven if one of our drug candidates receives regulatory approval, we may determine that commercialization would not be worth the investment.\nWe have limited capacity to conduct preclinical testing and clinical trials, and our resulting dependence on other parties could result in delays in and additional costs for our drug development efforts.\nOur reliance on others to manufacture our drug products and drug cand"
}