{
  "source_file": "incy-20241231.htm",
  "form_type": "10-K",
  "item1_clean": "— Risks Relating to Commercialization of Our Products — Competition for our products could harm our business and result in a decrease in revenue.”\nWith respect to proprietary information that is not patentable, and for inventions for which patents are difficult to enforce, we rely on trade secret protection and confidentiality agreements to protect our interests. While, as a general matter, we seek to protect our interests by entering into confidentiality agreements with our employees, consultants and potential business partners, we may not be able to adequately protect our trade secrets or other proprietary information. Others may independently develop substantially equivalent proprietary information and techniques or otherwise gain access to our trade secrets.\nOur drug discovery, development and commercialization activities face, and will continue to face, intense competition from organizations such as pharmaceutical and biotechnology companies, as well as academic and research institutions and government agencies. We face significant competition from organizations, particularly fully integrated pharmaceutical companies, that are pursuing pharmaceuticals that are competitive with JAKAFI, ICLUSIG, PEMAZYRE, MONJUVI/MINJUVI, OPZELURA, ZYNYZ, NIKTIMVO and our drug candidates.\nMany companies and institutions, either alone or together with their collaborative partners, have substantially greater financial resources, larger drug discovery, development and commercial staffs and significantly greater experience than we do in:\ndeveloping products;\nundertaking preclinical testing and clinical trials;\nobtaining FDA and other regulatory approvals of products; and\nmanufacturing, marketing, distributing and selling products.\n\nPatents extend for varying periods according to the date of patent filing or grant and the legal term of patents in the various countries where patent protection is obtained. The actual protection afforded by a patent, which can vary from country to country, depends on the type of patent, the scope of its coverage and the availability of legal remedies in the country.\nWe may seek to license rights relating to technologies, drug candidates or drug products in connection with our drug discovery and development programs and commercialization activities. Under these licenses, such as our licenses from Agenus, ARIAD/Takeda, MacroGenics, Merus Xencor and Syndax, we may be required to pay up-front fees, license fees, milestone payments and royalties on sales of future products.\nAlthough we believe our rights under patents and patent applications provide a competitive advantage, the patent positions of pharmaceutical and biotechnology companies are highly uncertain and involve complex legal and factual questions. We may not be able to develop patentable products or processes and may not be able to obtain patents in the United States or elsewhere from pending applications. Even if patent claims are allowed, the claims may not issue, or in the event of issuance, may not be valid or enforceable or may not be sufficient to protect the technology owned by or licensed to us or provide us with a competitive advantage. Any patent or other intellectual property rights that we own or obtain may be circumvented, challenged or invalidated by our competitors. Others may have patents that relate to our business or technology and that may prevent us from marketing our drug candidates unless we are able to obtain a license to those patents. In addition, litigation or other proceedings may be necessary to defend against claims of infringement, to enforce patents, to protect our other intellectual property rights, to determine the scope and validity of the proprietary rights of third parties or to defend ourselves in patent or other intellectual property right suits brought by third parties. We could incur substantial costs in such litigation or other proceedings. An adverse outcome in any such litigation or proceeding could subject us to significant liability or increased competition. A discussion of certain risks and uncertainties that may affect our patents, regulatory exclusivities or other proprietary rights is set forth in Item 1A. “Risk Factors\n\nAccordingly, our competitors may succeed in obtaining patent protection, receiving FDA and other regulatory approval or commercializing products that compete with JAKAFI, ICLUSIG, PEMAZYRE, MONJUVI/MINJUVI, OPZELURA, ZYNYZ, NIKTIMVO or our drug candidates.\nIn addition, any drug candidate that we successfully develop may compete with existing therapies that have long histories of safe and effective use. Competition may also arise from:\nother drug development technologies and methods of preventing or reducing the incidence of disease;\nother classes of therapeutic agents.\nWe face and will continue to face intense competition from other companies for collaborative arrangements with pharmaceutical and biotechnology companies, for establishing relationships with academic and research institutions and for licenses to drug candidates or proprietary technology. These competitors, either alone or with their collaborative partners, may succeed in developing products that are more effective or commercially successful than ours.\nOur ability to compete successfully will depend, in part, on our ability to:\ndevelop proprietary products;\ndevelop and maintain products that reach the market first, are technologically superior to and/or are of lower cost than other products in the market;\nattract and retain scientific, product development and sales and marketing personnel;\nobtain patent or other proprietary protection for our products and technologies;\nobtain required regulatory approvals; and\nmanufacture, market, distribute and sell any products that we develop.\nIn a number of countries, including in particular, developing countries, government officials and other groups have suggested that pharmaceutical companies should make drugs available at a low cost. In some cases, governmental authorities have indicated that where pharmaceutical companies do not do so, their patents might not be enforceable to prevent generic competition. Some major pharmaceutical companies have greatly reduced prices for their drugs in certain developing countries. If certain countries do not permit enforcement of any of our patents, sales of our products in those countries, and in other countries by importation from low-price countries, could be reduced by generic competition or by parallel importation of our product. Alternatively, governments in those countries could require that we grant compulsory licenses to allow competitors to manufacture and sell their own versions of our products in those countries, thereby reducing our product sales, or we could respond to governmental concerns by reducing prices for our products. In all of these situations, our results of operations could be adversely affected.\nGovernment Regulation\nOur ongoing research and development activities and any manufacturing and marketing of our approved drug products and our drug candidates are subject to extensive regulation by numerous governmental authorities in the United States and other countries. Before marketing in the United States, any drug developed by us must undergo rigorous preclinical testing, clinical trials, and an extensive regulatory clearance process implemented by the FDA under the United States Food, Drug and Cosmetic Act and its implementing regulations and, in the case of biologics, the Public Health Service Act. The FDA regulates, among other things, the research, development, testing, manufacture, safety, efficacy, record-keeping, labeling, storage, approval, advertising, promotion, sale and distribution and import and export, of these products.\n\nWe also rely on third-party contract manufacturers to tablet or capsulate all of our active pharmaceutical ingredients for clinical and commercial uses. For JAKAFI and ICLUSIG, we have two qualified third-party manufacturers from which we can source commercial drug product. Secondary packaging of ICLUSIG is performed by a qualified third-party manufacturer. Primary packaged product for ICLUSIG can be used for clinical and commercial purposes. For PEMAZYRE, we have one qualified third-party manufacturer from which we can source commercial drug product. For OPZELURA, we have two qualified third-party manufacturer from which we can source commercial drug product for the United States market, and one qualified third-party manufacture from which we can source commercial drug product for markets outside of the United States.\nWe may not be able to obtain sufficient quantities of any of our raw materials, drug candidates, API, or finished goods if our designated manufacturers do not have the capacity or capability to manufacture our products according to our schedule and specifications. If any of these single source suppliers were to become unable or unwilling to supply us with API or finished product that complies with applicable regulatory requirements, we could incur significant delays in our clinical trials or interruption of commercial supply which could have a material adverse effect on our business.\nWe have established a quality assurance program intended to ensure that our third-party manufacturers and service providers produce materials and provide services, as applicable, in accordance with the FDA and EMA’s current Good Manufacturing Practices and other applicable regulations. Our quality assurance program extends to our licensed facilities that oversee the manufacturing and distribution activities.\nFor our future products, we intend to continue to establish third-party suppliers to manufacture sufficient quantities of our drug candidates to undertake clinical trials and to manufacture sufficient quantities of any product that is approved for commercial sale. If we are unable to contract for large scale manufacturing with third parties on acceptable terms for our future products or develop manufacturing capabilities internally, our ability to conduct large scale clinical trials and meet customer demand for commercial products will be adversely affected.\nThird-party Manufacturers\nOur third-party manufacturers are independent entities, under contract with us, who are subject to their own unique operational and financial risks which are out of our control. If we or any of our third-party manufacturers fail to perform as required, this could impair our ability to deliver our products on a timely basis or cause delays in our clinical trials and applications for regulatory approval. To the extent these risks materialize and affect their performance obligations to us, our financial results may be adversely affected.\nFor products manufactured by our third-party manufacturers, we have licensed the necessary aspects of this manufacturing technology that we believe is proprietary to us to enable them to manufacture the products for us. We have agreements with these third-party manufacturers that are intended to restrict these manufacturers from using or revealing our technology, but we cannot be certain that these third-party manufacturers will comply with these restrictions.\nWhile we believe there are multiple third parties capable of providing most of the materials and services we need in order to manufacture API and distribute finished goods, and that supply of materials that cannot be second sourced can be managed with inventory planning, there is always a risk that we may underestimate demand, and that our manufacturing capacity through third-party manufacturers may not be sufficient. In addition, because of the significant lead times involved in our supply chain for ruxolitinib phosphate, we may have less flexibility to adjust our supply in response to changes in demand than if we had shorter lead times. Our strategy is to maintain 18 to 24 months of safety stock of API to be able to respond to changes in demand to provide on-time supply of d",
  "item7_clean": "Our milestone and contract revenues were $43.0 million and $7.0 million for the years ended December 31, 2024 and 2023, respectively. During the year ended December 31, 2024, our milestone and contract revenues were derived from a $25.0 million upfront payment received during the first quarter of 2024 upon our transfer of functional intellectual property to China Medical Systems Holdings Limited, and we recognized $18.0 million of upfront and milestone payments from two of our collaboration partners during the third quarter of 2024. During the year ended December 31, 2023, our milestone and contract revenues were primarily derived from a regulatory milestone under the Novartis collaboration and license agreement.\nCost of Product Revenues\nFor the Year Ended December 31,\nSalary and benefits related\nAmortization of definite-lived intangible assets\nTotal cost of product revenues\nCost of product revenues includes all product related costs, reserves for obsolescence, employee personnel costs, including stock compensation, for those employees dedicated to the production of our commercial products, royalties owed under our collaborative agreements and amortization of our licensed intellectual property rights for ICLUSIG and the amortization of capitalized milestone payments. The increase in cost of product revenues from 2023 to 2024 was primarily due to growth in net product revenues, increased royalty expense and increased manufacturing related costs.\nResearch and development expenses\nFor the Year Ended December 31,\nSalary and benefits related\nEscient acquisition related compensation expense\nEscient IPR&D expense\nClinical research and outside services\nOccupancy and all other costs\nTotal research and development expenses\nWe account for research and development costs by natural expense line and not costs by project. Salary and benefits related expense increased from 2023 to 2024 due primarily to increased headcount to sustain our development pipeline. Stock compensation expense may fluctuate from period to period based on the number of awards granted, stock price volatility and expected award lives, as well as expected award forfeiture rates which are used to value equity-based compensation. Additionally, as described in Note 5 of the Notes to the Consolidated Financial Statements, as part of the Escient acquisition, we recognized compensation expense in research and development of $11.3 million associated with the accelerated vesting for certain Escient stock awards in connection with the acquisition on our consolidated statements of operations. Research and development expenses for the year ended December 31, 2024 also include the $679.4 million of expense related to the acquired in-process research and development assets as part of the Escient acquisition.\n\nThe increase in clinical research and outside services expense from 2023 to 2024 was primarily due to continued investment in our late-stage development assets, additional expenses resulting from the Escient acquisition and timing of certain expenses. Research and development expenses include upfront and milestone expenses related to our collaborative agreements, which were $104.4 million and $36.7 million for the years ended December 31, 2024 and 2023, respectively. Research and development expenses for the years ended December 31, 2024 and 2023 were net of $29.9 million and $49.1 million, respectively, of costs reimbursed by our collaborative partners.\nIn addition to one-time expenses resulting from upfront fees in connection with the entry into any new or amended collaboration agreements and payment of milestones under those agreements, research and development expenses may fluctuate from period to period depending upon the stage of certain projects and the level of pre-clinical and clinical trial related activities. Many factors can affect the cost and timing of our clinical trials, including requests by regulatory agencies for more information, inconclusive results requiring additional clinical trials, slow patient enrollment, adverse side effects among patients, insufficient supplies for our clinical trials, timing of drug supply, including API, and real or perceived lack of effectiveness or safety of our investigational drugs in our clinical trials. In addition, the development of all of our products will be subject to extensive governmental regulation. These factors make it difficult for us to predict the timing and costs of the further development and approval of our products.\nSelling, general and administrative expenses\nFor the Year Ended December 31,\nSalary and benefits related\nEscient acquisition related compensation expense\nOther contract services and outside costs\nTotal selling, general and administrative expenses\nSalary and benefits related expense increased from 2023 to 2024 due primarily to increased headcount. This increased headcount was due primarily to the establishment of our dermatology commercial organization. Stock compensation expense may fluctuate from period to period based on the number of awards granted, stock price volatility and expected award lives, as well as expected award forfeiture rates which are used to value equity-based compensation. Additionally, as described in Note 5 of the Notes to the Consolidated Financial Statements, as part of the Escient acquisition, we recognized compensation expense in selling, general and administrative expenses of $20.2 million associated with the accelerated vesting for certain Escient stock awards in connection with the acquisition on our consolidated statements of operations.\nLoss on change in fair value of acquisition-related contingent consideration\nAcquisition-related contingent consideration, which consists of our future royalty obligations to ARIAD/Takeda, was recorded on the acquisition date, June 1, 2016, at the estimated fair value of the obligation, in accordance with the acquisition method of accounting. The fair value of the acquisition-related contingent consideration is remeasured quarterly. The change in fair value of the acquisition-related contingent consideration for the years ended December 31, 2024 and 2023 was expense of $19.8 million and $29.2 million, respectively, which is recorded in loss on change in fair value of acquisition-related contingent consideration on the consolidated statements of operations. The loss on change in fair value of the contingent consideration during the years ended December 31, 2024 and 2023 was due primarily to fluctuations in foreign currency exchange rates impacting future revenue projections of ICLUSIG and the passage of time.\n\nProfit sharing from co-commercialization activities\nUnder the former collaboration and license agreement with MorphoSys, which was executed in March 2020 and continued through February 5, 2024 as described further in Note 5 of the Notes to the Consolidated Financial Statements, we and MorphoSys were both responsible for the commercialization efforts of tafasitamab in the United States and shared equally the profits and losses from the co-commercialization efforts. For the period from January 1, 2024 through February 5, 2024, our 50% share of the profits for tafasitamab was $1.0 million, as recorded in (profit) and loss sharing under collaboration agreements on the consolidated statement of operations. For the year ended December 31, 2023, our 50% share of the costs for tafasitamab was $2.0 million, as recorded in (profit) and loss sharing under collaboration agreements on the consolidated statement of operations.\nUnder the collaboration agreement with Syndax, as described further in Note 7 of the Notes to the Consolidated Financial Statements, we and Syndax are both responsible for the co-commercialization of axatilimab in the United States and share equally in the profits and losses from those efforts. We are the principal in the U.S. axatilimab co-commercialization efforts and will record 100% of all product revenues and associated costs in accordance with our profit sharing from co-commercialization activities accounting policy outlined in Note 1 of the Notes to the Consolidated Financial Statements. For the year ended December 31, 2024, there were no revenues from sales of axatilimab, however, there was $22.4 million of expense incurred in connection with the co-commercialization efforts, 50% of which is recorded as selling, marketing and administrative expense in our consolidated statement of operations.\nNon-operating Income and Expenses\nInterest income for the years ended December 31, 2024 and 2023 was $128.7 million and $158.4 million, respectively. The decrease in Interest income for the year ended December 31, 2024 primarily relates to a decrease in interest earned on our cash equivalents and marketable securities generally due to lower cash equivalent and marketable securities balance in the second half of 2024 as compared to the corresponding period in 2023.\nRealized and unrealized gain (loss) on equity investments\nRealized and unrealized gains and losses on equity investments will fluctuate from period to period, based on sales of securities and the change in fair value of the securities we hold in our publicly held collaboration partners. The following table provides a summary of those realized and unrealized gains and (losses):\nFor the Years Ended,\nTotal realized and unrealized gain on equity investments\nDuring the year ended December 31, 2024, we sold all remaining investments in Agenus Inc., Merus and MorphoSys AG as described further in in Note 7 of the Notes to the Consolidated Financial Statements.\nProvision for income taxes\nThe provision for income taxes for the years ended December 31, 2024 and 2023 was $284.0 million and $236.6 million, respectively.\n\nIn August 2021, we entered into a $500.0 million, senior unsecured revolving credit facility, which was subsequently amended in May 2023 and June 2024 (as amended, the “Credit Agreement”). The June 2024 amendment to the Credit Agreement extended the maturity date of the revolving credit facility from August 2024 to June 2027. We may increase the maximum revolving commitments or add one or more incremental term loan facilities, subject to obtaining commitments from any participating lenders and certain other conditions, in an amount not to exceed $250.0 million plus a contingent additional amount that is dependent on our pro forma consolidated leverage ratio. As of December 31, 2024, we had no outstanding borrowings and were in compliance with all covenants under this facility. The Credit Agreement is described further in Note 16 of Notes to the Consolidated Financial Statements.\nDue to the full utilization of our research and development and orphan drug tax credit carryforwards generated in prior years, our U.S. tax liabilities continue to reflect the adverse impacts of the mandatory capitalization and amortization of research and development expenses as required under the Tax Cuts and Jobs Act of 2017, which eliminated the immediate expensing of such expenses.\nWe believe that our cash flow from operations, together with our cash, cash equivalents and marketable securities and funds available under our revolving credit facility, will be adequate to satisfy our capital needs for the foreseeable future. Our cash requirements depend on numerous factors, including our expenditures in connection with our drug discovery and development programs and commercialization operations; expenditures in connection with litigation or other legal proceedings; costs for future facility requirements; and expenditures for future strategic equity investments or potential acquisitions. We have entered into and may in the future seek to license additional rights relating to technologies or drug development candidates in connection with our drug discovery and development programs. Under these licenses, we may be required to pay upfront fees, milestone payments, and royalties on sales of future products. These contingent future payments are discussed in detail in Note 7 of Notes to the Consolidated Financial Statements.\nTo the extent we seek to augment our existing cash resources and cash flow from operations to satisfy our cash requirements for future acquisitions or other strategic purposes, we expect that additional funding can be obtained through equity or debt financings or from other sources. The sale of equity or convertible debt securities in the future may be dilutive to our stockholders, and may provide for rights, preferences or privileges senior to those of our holders of common stock. Debt financing arrangements may require us to pledge certain assets or enter into covenants that could restrict our operations or our ability to incur further indebtedness.\n\nManagement’s Discussion and Analysis of Financial Condition and Results of Operations\nThe following discussion and analysis of our financial condition and results of operations should be read in conjunction with “Selected Consolidated Financial Data” and the Consolidated Financial Statements and related Notes included elsewhere in this Report.\nand our Investor Relations website at\ninvestor.incyte.com/financial-information/annual-reports\n. These website addresses are intended to be inactive, textual references only. None of the materials on, or accessible through, these websites are part of this report or are incorporated by reference herein.\nIncyte is a global biopharmaceutical company engaged in the discovery, development and commercialization of proprietary therapeutics. Our global headquarters is located in Wilmington, Delaware, where we conduct discovery, clinical development and commercial operations. We also conduct clinical development and commercial operations from our European headquarters in Morges, Switzerland and our other offices across Europe, as well as our Japanese office in Tokyo and our Canadian headquarters in Montreal.\nThrough the discovery, development and commercialization of proprietary therapeutics, Incyte has established a portfolio of first-in-class and best-in-class medicines for patients and a strong pipeline of products focused in three core therapeutic areas: Oncology, Inflammation & Autoimmunity, and Myeloproliferative Neoplasms (MPNs) & Graft-Versus-Host Disease (GVHD). We are also eligible to receive milestones and royalties on molecules discovered by us and licensed to third parties.\nOur portfolio focuses on areas of high unmet medical need and includes compounds in various stages, ranging from preclinical to late-stage development, and commercialized products JAKAFI (ruxolitinib), ICLUSIG (ponatinib), PEMAZYRE (pemigatinib), OPZELURA (ruxolitinib cream), MINJUVI (tafasitamab), MONJUVI (tafasitamab-cxix) and ZYNYZ (retifanlimab-dlwr), as well as NIKTIMVO (axatilimab-csfr), which was approved for medical use in the United States in August 2024 and will be co-commercialized.\nOur revenues depend on continued sales of our products, and we depend substantially on product revenues from JAKAFI. We must develop and commercialize new products to achieve revenue growth and to offset revenue losses from when products lose their exclusivity or when competing products are launched. For additional information, including information on the expirations of patents for various products, see Part I, Item 1 of this report, “Business—Patents and Other Intellectual Property” and “Business—Competition.” We devote substantial resources to research and development activities and to acquire rights to new product candidates and technologies, but successful product development in the biopharmaceutical industry is highly uncertain.\nOur product revenues also face challenges from economic conditions and drug pricing initiatives driven by governments and private payors. See Part I, Item 1A of this report, “Risk Factors” for a further discussion of certain factors that could impact our future product revenues.\n\nOur effective tax rate of 89.7% for the year ended December 31, 2024 increase",
  "item2_clean": null
}