{
  "source_file": "intu-20250731.htm",
  "form_type": "10-K",
  "item1_clean": "Designed for complex mid-market companies seeking to streamline operations, enhance productivity, and support growth, this solution builds upon the familiar QuickBooks Online interface. It integrates advanced financial management solutions, such as multi-entity accounting and multi-dimensional reporting, along with human resource and marketing tools in a unified solution.\nQuickBooks Desktop Software\nOur QuickBooks financial management solutions are also available as desktop versions for businesses on a subscription basis. QuickBooks Desktop Plus is designed for small businesses. QuickBooks Enterprise is designed for mid-market businesses with more complex needs and is available for download or as a hosted solution. This offering provides industry-specific reports and features for a range of industries, including Contractor, Manufacturing, Wholesale and Distribution, Retail, Nonprofit, Professional Services, and Accountants.\nWe offer a range of financial supplies designed for individuals and businesses that use our QuickBooks offerings. These include standard paper checks, Secure Plus checks with CheckLock fraud protection features, a variety of stationery, tax forms, and related supplies.\nOur Consumer segment includes our TurboTax products and services that are designed to enable consumers and businesses to prepare and file their federal and state income tax returns quickly and accurately. These offerings are available either online or as desktop versions in the U.S. and Canada. They are designed to be easy to use yet sophisticated enough for complex tax returns, serving the varied needs of our customers, from those who file simple returns to those who itemize deductions, own investments or rental property, and manage small and mid-market businesses.\nOur do-it-yourself tax products and services are designed for customers who choose to independently prepare and file their tax returns. Our assisted tax products and services, such as TurboTax Live and TurboTax Live Full Service, are designed for customers who seek professional tax advice or who want their returns prepared by an expert. We also offer complementary services, including electronic filing of federal and state income tax returns, faster access to tax refunds, audit defense, and audit support.\nOur online tax preparation, filing, and other services are offered through the websites and mobile apps of thousands of financial institutions, electronic retailers, and other online merchants. Financial institutions can offer our online tax preparation and filing services to their customers through a link to TurboTax Online.\nOur Credit Karma segment provides consumers with a financial platform that propels them forward wherever they are on their financial journey, enabling them to understand their financial picture, make smart financial decisions, and stick to their financial plan. The platform offers a number of services to our members: access to their credit scores and reports, credit and identity monitoring, credit building, credit report dispute, tools to help understand net worth and make financial progress, personalized recommendations of credit card, loan, and insurance products, and access to our TurboTax offerings, including tax preparation software and early tax refunds. Credit Karma Money offers members online savings and checking accounts through an FDIC-member bank partner. To provide services to our members, Credit Karma works with a variety of partners, including credit bureaus, banks, credit card issuers, insurance carriers, and other financial institutions and lending partners. Additionally, Credit Karma leverages Lightbox, a first-of-its-kind enterprise platform which allows lenders to leverage thousands of de-identified data points from Credit Karma members to help provide our members with greater certainty that they will be approved if they apply for a financial product.\nOur ProTax segment includes our professional tax offerings and serves professional accountants in the U.S. and Canada, who are essential to both small business success and tax preparation and filing. Our professional tax offerings consist of Lacerte, ProSeries, and ProConnect Tax Online in the U.S., and ProFile and ProTax Online in Canada. These offerings enable accountants to accurately and efficiently complete and electronically file a full range of federal and state tax returns for individuals and businesses. Lacerte is designed for full-service, year-round accounting firms who handle more complex returns. ProSeries is designed for year-round tax practices handling moderately complex tax returns. ProConnect Tax Online is our\ncloud-based solution, designed for full-service, year-round practices that prepare all types of individual and business returns and integrates with our QuickBooks Online offerings. ProFile is our Canadian desktop tax offering, which serves year-round, full-service accounting firms for both individual and business tax returns. ProTax Online is our Canadian cloud-based tax solution, designed for full-service, year-round practices who prepare all forms of individual and business tax returns. It is integrated into QuickBooks Online Accountant to provide seamless integration of data across books and tax through our Workpapers solution. We also offer a variety of tax-related services that complement the tax return preparation process, including advisory services, year-round document storage, bank products, e-signature, and collaboration services, as well as additional capabilities such as desktop hosting, fixed asset management, and third-party solutions for practice management for some of our U.S. tax offerings.\nPRODUCT DEVELOPMENT\nThe markets for software and related services are characterized by rapid technological change, shifting customer needs, and frequent new product introductions and enhancements. To succeed in these markets, continuous investment is required to innovate, develop new products and services, and enhance existing offerings. Our product development efforts are more important than ever as we pursue our growth strategy.\nWe develop many of our products and services internally, and we have a number of U.S. and foreign patents and pending applications that relate to various aspects of our products and technology. We supplement our internal development efforts by acquiring businesses and technologies. We also purchase or license products and technology from third parties and establish other relationships that enable us to enhance or expand our offerings more rapidly. We expect to expand our third-party technology relationships as we continue to pursue our growth strategy.\nOur offerings have rapid development cycles. In addition, developing consumer and professional tax software and services presents unique challenges because of the demanding development cycle required to accurately incorporate federal and state tax law and tax form changes within a rigid timetable. The development timing for our small business payroll and merchant payment processing services offerings varies with business needs and regulatory requirements, and the length of the development cycle depends on the scope and complexity of each project.\nWe continue to make substantial investments in research and development. We expect to focus our future research and development efforts on enhancing existing products and services with done-for-you experiences, financial recommendations, personalization, and ease of use enabled by AI and other advanced technologies. We continue to focus on developing new products and services, including global offerings, and undertaking significant research and development for ongoing projects to update the technology platforms for several of our offerings.\nSEASONALITY\nOur Consumer and ProTax offerings have a significant and distinct seasonal pattern as sales and revenue from our income tax preparation products and services are typically heavily concentrated in the period from November through April. This seasonal pattern typically results in higher net revenues during our second and third quarters ending January 31 and April 30, respectively.\nWe expect the seasonality of our Consumer and ProTax businesses to continue to have a material impact on our quarterly financial results in the future.\nMARKETING, SALES, AND DISTRIBUTION CHANNELS\nOur primary customers are consumers and small and mid-market businesses. We also provide specialized tax and accounting products to professional accountants. We partner with financial institutions and other partners, who we connect with consumers on our platform. The markets in which we compete have always been characterized by rapid technological change, shifting customer needs, and frequent new product introductions and enhancements by competitors. The widespread usage of mobile devices and social media, along with the evolution of AI, has accelerated the pace of change and revolutionized how customers learn about, evaluate, and purchase products and services.\nReal-time, personalized online shopping experiences are the standard. In addition, many customers now begin shopping in one channel and ultimately purchase in another. This has created a need for integrated, multi-channel, shop-and-buy experiences. Market and industry changes quickly make existing products and services obsolete. Our success depends on our ability to respond rapidly to these changes with new business models, updated competitive strategies, new or enhanced products and services, and other changes in the way we do business.\nWe use a variety of marketing programs to generate direct sales, develop leads, increase general awareness of the Intuit brand and our product portfolio, and drive sales in retail. These programs include offline marketing, such as TV and radio advertising; digital marketing, such as display and pay-per-click advertising, search and generative engine optimization, and social and affiliate marketing; email marketing; in-product marketing to drive awareness of related products and services; public relations;\nsponsorships; podcast marketing; mobile marketing; and retail marketing of our consumer tax offerings. Our campaigns are designed to attract new users, retain existing users, and cross-sell additional offerings.\nSales and Distribution Channels\n. We offer our products and services directly through our websites, apps, and call centers. Direct online offerings are an effective channel for customers who can make purchase and other decisions regarding our and our partners’ offerings based on content provided on our websites, or via other online content and word-of-mouth recommendations. For many of our products, assisted sales continues to be an effective channel for serving customers who want live help to select the products and services that are right for their needs. We also have a direct sales force that calls on accountants, bookkeepers, and marketing professionals, and seeks to increase their awareness, usage, and recommendation of our business and professional tax solutions. We market certain products directly to mid-market businesses through our direct sales force.\nMulti-Channel Shop-and-Buy Experiences\nOur customers primarily research products and services online. Many customers buy and use our products and services entirely online. Some research online but make their purchase at a retail location. Because many customers shop across multiple channels, we continue to coordinate our online, offline, and retail presence and promotions to support an integrated, multi-channel shop-and-buy model. We also focus on cross-selling complementary Intuit and third-party offerings online and in-product.\nWe distribute many of our offerings for mobile devices through proprietary online stores that provide applications for specific devices.\nPartner and Other Channels\n. We offer many of our products and services through partners and other channels, including value-added resellers, technology partners",
  "item7_clean": "Liquidity and Capital Resources\nDiscussion of key aspects of our consolidated statements of cash flows, changes in our consolidated balance sheets, and our financial commitments.\nYou should note that this MD&A contains forward-looking statements that involve risks and uncertainties. Please see the section entitled\n“Forward-Looking Statements”\nimmediately preceding Part I of this Annual Report for important information to consider when evaluating such statements.\nYou should read this MD&A in conjunction with the consolidated financial statements and related notes in Item 8 of this Annual Report.\nIn the Results of Operations sections of this MD&A, where we describe two or more factors that contributed to changes in revenue and operating income, we have, where possible, quantified the impact of those factors. Where a change is the result of multiple factors that are interrelated and cannot be separately quantified, we have identified the interrelated factors without quantifying them.\nIn July 2024, our management approved, committed to, and initiated a plan of reorganization (the Plan) focused on reallocating resources to our key growth areas. The Plan included the exit of employees and the closing of real estate sites in certain markets to support growing technology teams and capabilities in strategic locations. The actions associated with the Plan were substantially complete in the first quarter of fiscal 2025. Total restructuring costs associated with the Plan were $238 million. During the twelve months ended July 31, 2025 and 2024, we recorded charges in connection with the Plan of $15 million and $223 million, respectively. These charges are primarily related to severance and employee benefits and are recorded to restructuring in our consolidated statements of operations. See Note 15 to the consolidated financial statements in Item 8 of this Annual Report for more information.\nOn August 1, 2024, we renamed our Small Business & Self-Employed segment as the Global Business Solutions segment. This new name better aligns with the global reach of the Mailchimp and QuickBooks platform, our focus on serving both small and mid-market businesses, and our vision to become the all-in-one platform that customers use to grow and run their business.\nOn August 1, 2024, we reorganized certain technology and customer success functions in our Global Business Solutions, Consumer, and ProTax segments that support and benefit our overall platform and are managed at the corporate level rather than at the segment level. As a result of these reorganizations, costs associated with these functions are no longer included in segment operating income and are now included in other corporate expenses. For the twelve months ended July 31, 2024 and 2023, we reclassified $1.4 billion and $1.3 billion from Global Business Solutions, $573 million and $475 million from Consumer, and $33 million and $34 million from ProTax to other corporate expenses, respectively, to conform to the current presentation. See Note 14 to the consolidated financial statements in Item 8 of this Annual Report for more information.\nConsistent with our vision to deliver one consumer platform, effective August 1, 2025, we combined the Consumer, Credit Karma, and ProTax businesses into a single Consumer business. We will reflect this new organization in our fiscal 2026 segment reporting.\nEXECUTIVE OVERVIEW\nIndustry Trends and Seasonality\nAI, including GenAI, predictive AI, and agentic AI, is transforming multiple industries, in particular financial technology. Disruptive start-ups, emerging ecosystems, and mega-platforms are harnessing new technology to create personalized experiences, deliver data-driven insights, and increase speed of service. These shifts are creating a more dynamic and highly competitive environment where customer expectations are shifting around the world as more services become digitized and the array of choices continues to increase.\nOur Consumer and ProTax offerings have a significant and distinct seasonal pattern as sales and revenue from our income tax preparation products and services are typically heavily concentrated in the period from November through April. This seasonal pattern typically results in higher net revenues during our second and third quarters ending January 31 and April 30, respectively.\nWe expect the seasonality of our Consumer and ProTax businesses to continue to have a material impact on our quarterly financial results in the future.\nKey Challenges and Risks\nOur growth strategy depends upon our ability to innovate, develop, and introduce emerging technologies, including AI and GenAI, to drive broad adoption of our products and services and enter new markets. Our future growth also increasingly depends on the strength of our third-party business relationships and our ability to continue to develop, maintain, and strengthen new and existing relationships. To remain competitive and continue to grow, we are investing significant resources in our product development, marketing, and sales capabilities, and we expect to continue to do so in the future. Much of our future success also depends on our ability to continue to attract, retain, and develop highly skilled employees, including those in technical and leadership roles who are critical to our strategic growth, in a highly competitive talent environment.\nAs we offer more online services, the ongoing operation and availability of our platforms and systems and those of our external service providers is becoming increasingly important. Because we help customers manage their financial lives, we face risks associated with the hosting, collection, use, and retention of personal customer information and data. We are investing significant management attention and resources in our information technology infrastructure and in our privacy and security capabilities, and we expect to continue to do so in the future.\nWe operate in industries that are experiencing an increasing amount of fraudulent activities by malicious third parties, and those fraudulent activities are becoming increasingly sophisticated, including through the use of AI. We implement additional security measures, and we continue to work with state and federal governments to implement industry-wide security and anti-fraud measures, including sharing information regarding suspicious activity. We continue to invest in security measures and to work with the broader industry and government to protect our customers against this type of fraud.\nOur operations are impacted by a rapidly-evolving regulatory environment and face increasingly heightened scrutiny. We are subject to numerous federal, state, and local, as well as foreign laws and regulations covering a broad and increasing range of subjects, both in the United States (U.S.) and internationally.\nFor a complete discussion of the most significant risks and uncertainties affecting our business, please see\n“Forward-Looking Statements”\nimmediately preceding Part I and\nin Item 1A of Part I of this Annual Report.\nOverview of Financial Results\nThe most important financial indicators that we use to assess our business are revenue growth for the company as a whole and for each reportable segment; operating income growth for the company as a whole; earnings per share; and cash flow from operations. We also track certain non-financial drivers of revenue growth and, when material, identify them in the applicable discussions of segment results below. Service offerings are a significant part of our business. Our total service revenue was $16.4 billion, or 87% of our total revenue in fiscal 2025, and we expect our total service revenue as a percentage of our total revenue to grow over the long term.\nKey highlights for fiscal 2025 include the following:\nGlobal Business Solutions revenue of\n$18.8 B\n$11.1 B\n$4.9 B\nup 16% from fiscal 2024\nup 16% from fiscal 2024\nup 10% from fiscal 2024\nCredit Karma revenue of\n$2.3 B\n$621 M\n$4.9 B\nup 32% from fiscal 2024\nup 4% from fiscal 2024\nup 36% from fiscal 2024\nDiluted net income per share of\nCash flow from operations of\n$3.9 B\n$6.2 B\nup 31% from fiscal 2024\nup 31% from fiscal 2024\nup 27% from fiscal 2024\nCRITICAL ACCOUNTING ESTIMATES\nIn preparing our consolidated financial statements in accordance with U.S. generally accepted accounting principles (GAAP), we are required to make estimates, assumptions, and judgments that can have a material impact on our net revenue, operating income or loss, and net income or loss, as well as on the value of certain assets and liabilities on our consolidated balance sheets. Actual results could differ materially from our estimates. Critical accounting estimates are those estimates that involve a significant level of estimations and uncertainty and have had, or are reasonably likely to have, a material impact on our financial condition or results of operations. We believe that the estimates, assumptions, and judgments involved in the following accounting policies have the greatest potential impact on our consolidated financial statements, so we consider these to be our critical accounting estimates:\nGoodwill, Acquired Intangible Assets, and Other Long-Lived Assets – Impairment Assessments\nAccounting for Income Taxes\n\n– Estimates of Deferred Taxes, Valuation Allowances, and Uncertain Tax Positions\nDescription of Business and Summary of Significant Accounting Policies\n” to the consolidated financial statements in Item 8 of this Annual Report.\nWe derive our revenue primarily from the sale of online services such as tax, accounting, payroll, merchant payment processing services, delivery of qualified links, marketing automation, live expert advice, financing for small and mid-market businesses, and desktop software products, desktop software subscriptions, and financial supplies. Our contracts with customers often include promises to transfer multiple products and services, which are primarily recognized ratably over the relevant period or when the customer consumes the related service. In determining how revenue should be recognized, a five-step process is used, which requires judgment and estimates within the revenue recognition process. The primary judgments include identifying the performance obligations in the contract and determining whether the performance obligations are distinct. If any of these judgments were to change, it could cause a material increase or decrease in the amount of revenue we report in a particular period. For additional information, see\n“Description of Business and Summary of Significant Accounting Policies – Revenue Recognition”\nin Note 1 to the consolidated financial statements in Item 8 of this Annual Report.\nGoodwill, Acquired Intangible Assets, and Other Long-Lived Assets – Impairment Assessments\nWe estimate the fair value of acquired intangible assets and other long-lived assets that have finite useful lives whenever an event or change in circumstances indicates that the carrying value of the asset may not be recoverable. We test for potential impairment of goodwill annually in our fourth fiscal quarter or whenever indicators of impairment arise. The timing of the annual test may result in charges to our consolidated statements of operations in our fourth fiscal quarter that could not have been reasonably foreseen in prior periods.\n“Description of Business and Summary of Significant Accounting Policies – Goodwill, Acquired Intangible Assets and Other Long-Lived Assets”\nin Note 1 to the consolidated financial statements in Item 8 of this Annual Report, in order to estimate the fair value of goodwill, we use a weighted combination of a discounted cash flow model (known as the income approach) and comparisons to publicly traded companies engaged in similar businesses (known as the market approach). The income approach requires us to use a number of assumptions, including market factors specific to the business, the amount and timing of estimated future cash flows to be generated by the business over an extended period of time, long-term growth rates for the business, and a rate of return that considers the relative risk of achieving the cash flows and the time value of money. We evaluate cash flows at the reporting unit level. Although the assumptions we use in our discounted cash flow model are consistent with the assumptions we use to generate our internal strategic plans and forecasts, significant judgment is required to estimate the amount and timing of future cash flows from each reporting unit and the relative risk of achieving those cash flows. When using the market approach, we make judgments about the comparability of publicly traded companies engaged in similar businesses. We base our judgments on factors such as size, growth rates, profitability, risk, and return on investment. We also make judgments when adjusting market multiples of revenue, operating income, and earnings for these companies to reflect their relative similarity to our own businesses. See Note 6 to the consolidated financial statements in Item 8 of this Annual Report for a summary of goodwill by reportable segment.\nWe estimate the recoverability of acquired intangible assets and other long-lived assets that have finite useful lives by comparing the carrying amount of the asset to the future undiscounted cash flows that we expect the asset to generate. In order to estimate the fair value of those assets, we estimate the present value of future cash flows from those assets. The key assumptions that we use in our discounted cash flow model are the amount and timing of estimated future cash flows to be generated by the asset over an extended period of time and a rate of return that considers the relative risk of achieving the cash flows and the time value of money. Significant judgment is required to estimate the amount and timing of future cash flows and the relative risk of achieving those cash flows. We also make judgments about the remaining useful lives of acquired intangible assets and other long-lived assets that have finite lives. See Note 6 to the consolidated financial statements in Item 8 of this Annual Report for a summary of cost, accumulated amortization, and weighted-average life in years for our acquired intangible assets.\nAssumptions and estimates about future values and remaining useful lives are complex and often subjective. They can be affected by a variety of factors, including external factors such as industry and economic trends, and internal factors such as changes in our business strategy and our internal forecasts. For example, if our future operating results do not meet current forecasts or if we experience a sustained decline in our market capitalization that is determined to be indicative of a reduction in fair value of one or more of our reporting units, we may be required to record future impairment charges for goodwill and acquired intangible assets. Impairment charges could materially decrease our future net income and result in lower asset values on our consolidated balance sheets.\nDuring the fourth quarters of fiscal 2025, fiscal 2024, and fiscal 2023, we performed our annual goodwill impairment tests. Using the methodology described in\n“Description of Business and Summary of Significant Accounting Policies – Goodwill, Acquired Intangible Assets and Other Long-Lived Assets,”\nin Note 1 to the consolidated financial statements in Item 8 of this Annual Report, we determined that the estimated fair values of all of our reporting units substantially exceeded their carrying values and that they were not impaired.\nWe are subject to certain legal proceedings, as well as demands, claims, and threatened litigation that arise in the normal course of our business. We review the status of each significant matter quarterly and assess our potential financial exposure. If the potential loss from any claim or legal proceeding is considered probable and the amount can be reasonably ",
  "item2_clean": null
}