{
  "source_file": "invh-20241231.htm",
  "form_type": "10-K",
  "item1_clean": "ITEM 1. BUSINESS\nInvitation Homes is a leading owner and operator of single-family homes for lease, offering residents high-quality homes in sought-after neighborhoods across the United States. As of December 31, 2024, we wholly own 85,138 homes for lease, jointly own 7,622 homes for lease, and provide professional third-party property and asset management services for an additional 17,678 homes, all of which are primarily located in 16 core markets across the country. These homes help meet the needs of a growing share of Americans who prefer the ease of a leasing lifestyle over the burden of owning a home. We provide our residents access to updated homes with features they value, as well as close proximity to jobs and access to good schools. The continued demand for our product proves that the choice and flexibility we offer are attractive to many people.\nWe operate in markets with strong demand drivers, high barriers to entry, and high rent growth potential, primarily in the Western United States, Florida, and the Southeast United States. Through disciplined market and asset selection, as well as through strategic mergers and acquisitions, we designed our wholly and jointly owned portfolios to capture the operating benefits of local density as well as economies of scale that we believe cannot be readily replicated. Since our founding in 2012, we have built a proven, vertically integrated operating platform that enables us to effectively and efficiently acquire, renovate, lease, maintain, and manage both the homes we own and those we manage on behalf of others.\nThe portfolio of homes we own average approximately 1,880 square feet with three to four bedrooms and two bathrooms, appealing to a resident base that we believe is less transitory than a typical multifamily resident. We invest in the upfront renovation of homes in our portfolio in order to address capital needs, reduce ongoing maintenance costs, and drive resident demand.\nAt Invitation Homes, we are committed to creating a better way to live and to being a force for positive change, while at the same time advancing efforts that make our company more innovative and our processes more sustainable. Sustainability is an important part of our strategic business objectives and is critical to our long-term success.\nOur commitment to high-touch customer service continuously enhances residents’ living experiences and provides homes where individuals and families can thrive. Each aspect of our operations — whether in our corporate headquarters or field offices located in our 16 core markets — is driven by a resident-centric model. Our associates take our values seriously and work hard every day to honor the trust our residents have placed in us to provide clean, safe, and functional homes for them and their loved ones. In turn, we focus on ensuring that our associates are fairly compensated and that we provide a culture that values respect, opportunity, and belonging. We also place a strong emphasis on the impact we have in our communities and to the environment in general, and we continue to develop programs that demonstrate those commitments. In addition, we ensure that we operate under strong, well-defined governance practices and adhere to the highest ethical standards at all times.\nThrough certain of the six holding entities that owned our business prior to our initial public offering (the “IH Holding Entities”), we commenced operations in 2012. On January 31, 2017, we effected certain reorganization transactions that resulted in INVH LP holding, directly or indirectly, all of the assets, liabilities, and results of operations of the Manager and the full portfolio of homes owned by the IH Holding Entities. As a result of the reorganization transactions, INVH LP became a consolidated subsidiary of INVH. A wholly owned subsidiary of INVH, Invitation Homes OP GP LLC (the “General Partner”), serves as INVH LP’s sole general partner.\nInvitation Homes Inc., a Maryland corporation, was incorporated in Delaware on October 4, 2016. On February 6, 2017, Invitation Homes Inc. changed its jurisdiction of incorporation to Maryland and completed an initial public offering of its shares of common stock (the “IPO”).\nAs of December 31, 2024, INVH owns a 99.7% partnership interest in INVH LP and has the full, exclusive, and complete responsibility for and discretion over the day-to-day management and control of INVH LP.\nOur principal executive offices are located at 5420 LBJ Freeway, Suite 600, Dallas, Texas 75240, and our telephone number is (972) 421-3600.\nOur vertically integrated, scalable platform allows greater influence over the experience of our residents while enabling us to better control operating costs and continuously share best practices across functional areas of the business. Our differentiated platform is built upon:\nResident-centric focus\n. Our high-touch business model enables us to continuously solicit and integrate resident feedback into our operations and tailor our approach to address their preferences, providing a superior living experience and fostering customer loyalty. We believe this, in turn, drives rent growth, occupancy, and low turnover rates and will enable us to develop significant brand equity in the longer term.\nLocal presence and expertise\n. In-market managers oversee the operations of local leasing, property management, and maintenance teams, enabling us to provide outstanding resident service, leverage local expertise in managing rental, occupancy, and turnover rates, and improve cost and oversight of renovations and ongoing maintenance of our homes. As a result of our concentrated footprint within our core markets, our regional managers and in-market teams are able to realize local-operator advantages, while still benefiting from significant economies of scale.\nScalable, centralized infrastructure\n. We support local market operations with national strategy, infrastructure, workflows enabled by technology, and standards to drive efficiency, consistency, and cost savings. We utilize our extensive scale and investments in technology to ensure the consistent quality of our resident experience and maximize cost efficiencies and purchasing power. On a national level we are also able to standardize resident leases, employ a consistent approach to resident screening and leasing operations, and utilize a tailored pricing tool that analyzes publicly available data to reflect local market conditions.\nOur approach to investment and asset management similarly combines local presence and expertise with national oversight. Our investment and asset management teams are primarily located in-market and apply their local market knowledge within the framework of a proprietary and consistent underwriting methodology, with support from national leadership focused on investment and asset management strategy based in our corporate headquarters. Through the integration of investment, property management, and asset management functions, our platform enables our teams to incorporate real-time information regarding leasing activity, property operations, maintenance, and capital spending into asset selection and asset management. We believe the advantages of our integrated acquisition platform and local market expertise drive the performance of our existing total portfolio of 85,138 owned homes as of December 31, 2024, as well as the portfolio of homes we jointly own with or manage on behalf of others. We similarly believe that employing experienced, in-house acquisitions teams at the local level gives us a competitive advantage in selectively acquiring homes that will maximize risk-adjusted total return.\nOur Business Activities\nSince our founding in 2012, we have built a proven, vertically integrated operating platform that allows us to effectively and efficiently acquire, renovate, lease, maintain, and manage both the homes we own as well as those we manage on behalf of others, including our joint venture partners and third parties. Our differentiated approach, which combines a resident-centric focus, local market presence and expertise, and national strategy, infrastructure, technology-enabled workflows, and standards, informs all areas of our operations.\nProperty operations encompasses the in-house local market management and execution of marketing, leasing, resident relations, and maintenance functions. We have developed and employ a highly scalable, vertically integrated, and resident-centric property management service platform, referred to as “ProCare.” All of our property management functions have been internally managed since our founding in 2012, and we have implemented an extensive property management infrastructure, including an online resident portal, smart home technology, a mobile app for residents to schedule and track maintenance requests, a technology suite to manage work orders and associate schedules, dedicated in-market associates, and local offices in each of our core markets.\nWe have organized our property management associates and operating structure such that Vice Presidents of Operations in each of our core markets are responsible for the operations of local leasing, property management, and maintenance teams. We believe our operating model differentiates our approach to local market operations and enables us to provide superior, high-touch resident service, maximize the effectiveness of our in-market associates in managing rental, occupancy, and turnover rates and improve our cost management and oversight over both upfront renovations and ongoing maintenance.\nAll of our local market associates are supported by our centralized national infrastructure, which allows us to deploy best practices and standardized processes where appropriate. The combination of our local market presence and national infrastructure enables us to exercise greater control over our property management service platform, allowing us to enhance the experience of our residents, better manage operating costs, and share best practices across various functional areas of our business.\nMarketing and Leasing\nOur associates are responsible for establishing rental rates, marketing and leasing properties, and collecting and processing rent. We establish and manage rental rates based on a tailored pricing tool that analyzes publicly available data to reflect local market conditions, including a competitive analysis of market rents for institutional single-family rental properties, as well as the size, fit and finish, and location of the home, the number of applications received, and the number of days a home has been available on the market. We also consider a number of qualitative factors, such as neighborhood characteristics, community amenities, and proximity to employment centers, desirable schools, transportation corridors, and local services.\nWe typically begin pre-marketing properties 30 to 45 days in advance of their becoming vacant to maintain high occupancy rates and reduce vacancy losses. We advertise available properties through multiple channels, including our proprietary website, internet listing services (such as Zillow, Trulia, HotPads, and Realtor.com), Multiple Listing Service (“MLS”), yard signs, search engine marketing, digital media, and local brokers. We offer flexible showing options for convenience, including virtual tours and floor plans, self-showings that leverage smart home technology, and in-person showings. We own internal brokerages to serve the states in which we operate and utilize in-market leasing experience specialists to drive an end-to-end resident experience that achieves our occupancy, revenue, and retention goals while facilitating enjoyment of a worry-free leasing lifestyle.\nProspective residents may submit an application through our proprietary mobile app or on our website. To maintain brand consistency and better track compliance with leasing requirements, we utilize standardized online applic",
  "item7_clean": "to $935.3 million from $880.3 million for the year ended December 31, 2023. In addition to a 996 home\nincrease between periods in the average number of homes owned, increases in property taxes, utilities, and property maintenance, resulted in the overall 6.2% net increase in property operating and maintenance expense.\nProperty management expense and general and administrative expense increased\nfor the years ended December 31, 2024 and 2023, respectively, primarily due to increased personnel and other costs related to expansion of our property and asset management platform, including costs incurred to manage\n25,300 and 3,848 homes as of December 31, 2024 and 2023, respectively.\nInterest expense increased to $366.1 million for the year ended December 31, 2024 from $333.5 million for the year ended December 31, 2023.\nThe increase in interest expense was primarily due to an\n11 bps increase in our weighted average interest rate and an approximate $500.0 million increase in the average debt balance outstanding during the year ended December 31, 2024 as compared to the year ended December 31, 2023.\nDepreciation and amortization expense increased\nto $714.3 million for the year ended December 31, 2024 from $674.3 million for the year ended December 31, 2023 due to a\n$529.6 million year over year\nincrease in building and improvements related to an\nincrease of 571 homes in the number of homes owned as of December 31, 2024 and 2023\nCasualty losses, impairment, and other expenses were $82.9 million and $8.6 million for the years ended December 31, 2024 and 2023, respectively. During the year ended December 31, 2024, casualty losses, impairment, and other expenses were comprised of net casualty losses of $82.4 million,\nincluding the recognition of\nfor estimated losses and damages related to\nHurricanes Milton, Beryl, Debby, and Helene\n, net of estimated insurance proceeds,\nadditional storm activity unrelated to hurricanes during the year, and impairment losses of $0.5 million on our single-family residential properties. During the year ended December 31, 2023, impairment and other expenses were comprised of $8.2 million of net casualty losses and $0.4 million of impairment losses on our single-family residential properties.\nGains (Losses) on Investments in Equity and Other Securities, net\nFor the year ended December 31, 2024, $1.0 million of gains on investments in equity and other securities, net was comprised of a\n$1.6 million net realized gain from exercised warrants, partially offset by\n$0.6 million of net unrealized losses recognized since December 31, 2023 on investments held as of December 31, 2024. For the year ended December 31, 2023, $0.4 million gains on investments in equity and other securities, net was comprised of net unrealized gains recognized on investments held as of December 31, 2023.\nOther, net increased to $54.0 million of expense for the year ended December 31, 2024 from $2.4 million of expense for the year ended December 31, 2023,\nprimarily due to settlement and other costs incurred in connection with the resolution of an inquiry from the FTC and the legal dispute entitled\nCity of San Diego et al v. Invitation Homes, Inc.\nGain on Sale of Property, net of tax\nGain on sale of property, net of tax was $244.6 million and $183.5 million for the years ended December 31, 2024 and 2023, respectively. An increase of 78 sold homes and an increase in the net proceeds per home sold for the year ended December 31, 2023 compared to the year ended December 31, 2024 were the drivers of the increase.\nLosses from Investments in Unconsolidated Joint Ventures\nOur share of equity in earnings and/or losses from unconsolidated joint ventures was a net loss of $28.4 million and $17.9 million for the years ended December 31, 2024 and 2023, respectively. The increase in loss is primarily driven by a $8.1 million increase in our share of interest expense and a $2.9 million increase in our share of depreciation expense between the respective periods. These changes are a result of the formation of and commencement of operations in new joint ventures, cumulative capital expenditures, and an increase in the number of homes within our joint venture investments.\nLiquidity and Capital Resources\nOur liquidity and capital resources as of December 31, 2024 and 2023 include unrestricted cash and cash equivalents of $174.5 million and $700.6 million, respectively, a 75.1%\nprimarily due to a $325.7 million net decrease in outstanding indebtedness between periods and $54.2 million of costs to acquire new financing.\nOn September 9, 2024, we entered into an amended and restated senior unsecured credit facility (the “Credit Facility”). The Credit Facility provides $3,500.0 million of borrowing capacity and consists of a $1,750.0 million revolving facility (the “Revolving Facility”) and a $1,750.0 million term loan facility (the “2024 Term Loan Facility”), both of which mature on September 9, 2028, with two six month extension options available. The Credit Facility replaced a credit facility that consisted of a $1,000.0 million revolving credit facility (the “2020 Revolving Facility”) and a $2,500.0 million term loan facility (the “2020 Term Loan Facility,” and together with the 2020 Revolving Facility, the “2020 Credit Facility”). Proceeds from the 2024 Term Loan Facility, a $750.0 million borrowing on the Revolving Facility on the date of effectiveness of the Credit Facility, and excess cash on hand were used to fully repay the 2020 Term Loan Facility and to pay costs associated with the transaction. For both the Revolving Facility and the 2024 Term Loan Facility, spreads at closing, based on our total leverage ratio, were 5 bps lower than the spreads most recently in effect for the 2020 Credit Facility.\nAs of December 31, 2024, $1,180.0 million of our Revolving Facility is undrawn, and there are no restrictions on our ability to draw funds thereunder provided we remain in compliance with all covenants. We have no debt reaching final maturity until June 2027.\nOn September 26, 2024, in a public offering under our existing shelf registration statement, we issued $500.0 million aggregate principal amount of 4.88% Senior Notes which mature on February 1, 2035 (the “2035 Unsecured Notes”).\nMortgage Loan Repayment\nIn November 2024, we used unrestricted cash from the 2035 Unsecured Notes and cash on hand to make a voluntary prepayment of the then-outstanding balance of IH 2018-4, which resulted in a release of the loan’s collateral.\nInterest Rate Swap Transactions\nIn September 2024, we amended certain interest rate swap agreements and entered into $1,400.0 million of new interest rate swap agreements which became active on December 31, 2024. As of December 31, 2024, our active swaps have a weighted average strike rate of 2.93%. We also have one forward starting swap which will become active July 9, 2025 and has a strike rate of 2.99%.\nInvestment in Joint Venture and New Property and Asset Management Agreements\nAs of December 31, 2024, we provided property and asset management services for 25,300 homes, of which 7,622 homes were owned by our unconsolidated joint ventures.\nIn November 2024, we entered into a new joint venture agreement pursuant to which we committed to make a $50.0 million investment to form a joint venture that will acquire newly-constructed homes and communities in high-growth markets.\nOn April 29, 2024, we entered into a new joint venture agreement pursuant to which we\n$37.5 million investment, representing a 7.2% ownership interest, in a portfolio of approximately 3,700 single-family residential properties. During the third quarter of 2024, we also began providing property and asset management services to those homes and approximately 700 additional homes owned by our joint venture partners.\nIn March 2024, we entered into a third-party agreement to provide property and asset management services to a portfolio of approximately 3,000 single-family homes for lease. Our direct management responsibilities for these homes commenced on May 15, 2024.\nOur ability to access capital as well as to use cash from operations to continue to meet our liquidity needs, all of which are highly uncertain and cannot be predicted, could be affected by various risks and uncertainties, including, but not limited to, the effects of general economic conditions, including inflation and interest rates, as detailed in Part I. Item 1A. “Risk Factors.”\nLong-Term Debt Strategy\nThe following table summarizes certain information about our debt obligations as of December 31, 2024 ($ in thousands):\n(Gross of Retained Certificates and Unamortized Discounts)\n(Net of Retained Certificates)\nWeighted Average Interest Rate\nWeighted Average Years to Maturity\nAmount Freely Prepayable (Gross)\nIH 2017-1\n2024 Term Loan Facility\n2022 Term Loan Facility\nUnsecured Notes — May 2028\nUnsecured Notes — November 2028\nUnsecured Notes — August 2030\nUnsecured Notes — August 2031\nUnsecured Notes — April 2032\nUnsecured Notes — August 2033\nUnsecured Notes — January 2034\nUnsecured Notes — February 2035\nUnsecured Notes — May 2036\nUnamortized discounts\nDeferred financing costs, net\nTotal debt per balance sheet\nRetained certificates\nCash and restricted cash, excluding security deposits and letters of credit\nDeferred financing costs, net\nUnamortized discounts\nFor detailed information about and definition of each of our financing arrangements see Part IV. Item 15. “Financial Statements — Note 7 of Notes to Consolidated Financial Statements.” For information about our derivative instruments that hedge floating rate debt, see Part IV. Item 15. “Financial Statements — Note 8 of Notes to Consolidated Financial Statements.”\nVariable interest rate loans are indexed to a Secured Overnight Financing Rate (“SOFR”) index rate determined by reference to a published forward-looking SOFR rate for the interest period relevant to such borrowing (“Term SOFR”), including any credit spread adjustments provided for in the terms of the underlying agreement (“Adjusted SOFR”), reflected as “S” in the table above.\nWeighted average years to maturity assumes all extension options are exercised, which are subject to certain conditions being met.\nIH 2017-1 bears interest at a fixed rate of 4.23% per annum, equal to the market determined pass-through rate payable on the certificates including applicable servicing fees.\nThe Secured Term Loan bears interest at a fixed rate of 3.59% per annum including applicable servicing fees for the first 11 years and for the twelfth year bears interest at a floating rate based on a spread of 147 bps over a comparable or successor rate to one month LIBOR as provided for in our loan agreement, including applicable servicing fees, subject to certain adjustments as outlined in the loan agreement.\nAs of December 31, 2024, interest rate is based on Term SOFR of 4.33% plus the applicable margin and a 0.10% credit spread adjustment.\nFor unsecured debt and total debt, the weighted average interest rate is calculated based on December 31, 2024, Term SOFR of 4.33% adjusted for a 0.10% credit spread adjustment (Adjusted SOFR), as appropriate, and includes the impact of interest rate swap agreements effective as of that date.\nAs part of our long-term debt strategy, our goal is to maintain or improve our credit ratings, and, over time, we generally intend to be a predominantly unsecured borrower with a target net debt of approximately 5.5 to 6.0 times trailing twelve months Adjusted EBITDA\n(see “— Non-GAAP Measures — EBITDA, EBITDA\n, and Adjusted EBITDA\n”). To facilitate our long-term debt strategy we expect to seek to, among other things, (a) refinance a significant portion of our secured debt maturing in 2027 with unsecured debt, including potential unsecured bond issuances and/or (b) repay a portion of such debt. There can be no assurance that we will be successful in implementing our long-term debt strategy, improving our credit ratings, or adhering to our targets in the short or medium term or at all, or that we will not change our strategy or targets in the future. We may from time to time fall outside of our target ranges. In addition, we cannot assure you that we will be able to access the capital and credit markets to obtain additional unsecured debt financing or that we will be able to obtain financing on terms favorable to us. For further discussion of risks related to our indebtedness, see Part I. Item 1A. “Risk Factors — Risks Related to Our Indebtedness,” including “Risk Factors — Risks Related to Our Indebtedness —\nWe may be unable to obtain financing through the debt and equity markets, which would have a material adverse effect on our growth strategy and our financial condition and results of operations.\nShort-Term and Long-Term Liquidity Needs\nLiquidity is a measure of our ability to meet potential cash requirements, maintain our assets, fund our operations, make dividend payments to our stockholders, and meet other general requirements of our business. Our liquidity, to a certain extent, is subject to general economic, financial, competitive, and other factors beyond our control. Our near-term liquidity requirements consist primarily of:\nacquisition of homes currently under contract, including commitments to homebuilders;\nrenovation of newly-acquired homes;\nHOA fees (as applicable), property taxes, insurance premiums, and the ongoing maintenance of our homes;\nproperty management, general and administrative, and other entity-level commitments and expenses;\ndividend payments to our stockholders; and\nrequired contributions to our joint ventures.\nWe believe our rental income, net of total expenses, will generally provide cash flow sufficient to fund operations and dividend payments on a near-term basis. Additionally, we have guaranteed the funding of certain tax, insurance, and non-conforming property reserves related to the financing of one of our joint ventures. We do not expect these guarantees to have a material current or future effect on our liquidity. See Part IV. Item 15. “Exhibits and Financial Statements of — Note 5 of Notes to Consolidated Financial Statements” for additional information about our investments in unconsolidated joint ventures.\nGeneral economic conditions in the United States have fluctuated in recent quarters, and concerns persist regarding adverse macroeconomic conditions, such as inflation, elevated interest rates, political dissension, and labor shortfalls. Fluctuating economic conditions and uncertainty in financial markets may negatively impact our operating cash flow such that we are unable to make required debt service payments, which would result in an event of default for any debt instrument under whose loan agreement such payments were not made. Specifically, the collateral within individual borrower entities may underperform, resulting in cash flow shortfalls for debt service while consolidated cash flows are sufficient to fund our operations. If an event of default occurs for our mortgage loan or for our secured term loan, our loan agreements provide\ncertain remedies, including our ability to fund shortfalls from consolidated cash flow; and such an event of default would not result in an immediate acceleration of the loan.\nOur real estate assets are illiquid in nature. A timely liquidation of assets may not be a viable source of short-term liquidity should a cash flow shortfall arise, and we may need to source liquidity from other financing sources, such as the Revolving Facility which had an undrawn balance of $1,180.0 million as of December 31, 2024.\nOur long-term liquidity requirements consist primarily of funds necessary to pay for the acquisition of, and non-recurring capital expenditures for, our homes, and principal and interest payments of our indebtedness. We intend to satisfy our long-term liquidity needs through cash provided by operations, long-term secured and unsecured borrowings, the issuance of debt and equity securit",
  "item2_clean": null
}