{
  "source_file": "invh-20250930.htm",
  "form_type": "10-Q",
  "item1_clean": null,
  "item7_clean": null,
  "item2_clean": "Our results are impacted by housing market fundamentals and supply and demand conditions in our markets, particularly in the Western United States and Florida, which represented 71.0% of our rental revenues and other property income during the three months ended September 30, 2025. We actively monitor the impact of macroeconomic conditions on market fundamentals and quickly implement changes in pricing as market fundamentals shift.\nRental Rates and Occupancy Levels:\nRental rates and occupancy levels are primary drivers of rental revenues and other property income. Our rental rates and occupancy levels are affected by macroeconomic factors and local and property-level factors, including market conditions, seasonality, resident defaults, and the amount of time it takes to prepare a home for its next resident and re-lease homes when residents vacate. An important driver of rental rate growth is our ability to increase monthly rents from expiring leases, which typically have a term of one to two years.\nOur rental revenues and other property income are impacted by the rate at which we collect such revenues from our residents. Despite our efforts to assist residents facing financial hardships who need flexibility to fulfill their lease obligations, a portion of amounts receivable may not ultimately be collected. We may also be constrained in our ability to collect resident receivables due to local ordinances restricting residential lease compliance options. Any amounts billed to residents that have been deemed uncollectible along with our estimate of amounts that may ultimately be uncollectible decrease our rental revenues and other property income.\nTurnover Rates and Days to Re-Resident:\nOther drivers of rental revenues and property operating and maintenance expense include the length of stay of our residents, resident turnover rates, and the number of days a home is unoccupied between residents. Our operating results are also impacted by the amount of time it takes to market and lease a property, which is a component of the number of days a home is unoccupied between residents. The period of time to market and lease a property can vary greatly and is impacted by local demand, our marketing techniques, the size of our available inventory, the ability of our suppliers and other business partners to carry out their assigned tasks and/or source labor or supply materials at ordinary levels of performance relative to the conduct of our business, and both current economic conditions and future economic outlook, including the impact of inflation, elevated interest rates, political dissension, and labor shortfalls which could adversely affect demand for our properties.\nProperty Improvements and Maintenance:\nProperty improvements and maintenance impact capital expenditures, property operating and maintenance expense, and rental revenues. We actively manage our homes on a total portfolio basis to determine what capital and maintenance needs may be required and what opportunities we may have to generate additional revenues or expense savings from such expenditures. As a result of inflationary trends and/or imposition of or increases in tariffs, we may experience, as we have in the past, increased costs for certain materials and services necessary to improve and maintain our homes. We continue to actively manage the impact of these factors on these costs, and we believe we are able to purchase goods and services at favorable prices compared to other purchasers due to our size and scale both nationally and locally.\nProperty Acquisitions and Renovations:\nFuture growth in rental revenues and other property income may be impacted by our ability to identify and acquire homes, our pace of property acquisitions, and the time and cost required to renovate and lease a newly acquired home. Our ability to identify and acquire single-family homes that meet our investment criteria is impacted by home prices in targeted acquisition locations, the inventory of homes available for sale through our acquisition channels, and competition for our target assets. All of these factors may be negatively impacted by current inflationary trends and elevated interest rates, potentially reducing the number of homes we acquire.\nThe acquisition of homes involves expenditures in addition to payment of the purchase price, including payments for acquisition fees, property inspections, closing costs, title insurance, transfer taxes, recording fees, broker commissions, property taxes, and HOA fees (when applicable). Additionally, we incur costs to renovate a home to prepare it for rental. The scope of renovation work varies, but may include paint, flooring, carpeting, cabinetry, appliances, plumbing hardware, roof replacement, HVAC replacement, and other items required to prepare the home for rental. The time and cost involved in accessing our homes and preparing them for rental can significantly impact our financial performance. The time to renovate a newly acquired property can vary significantly among homes for several reasons, including the property’s acquisition channel, the condition of the property, whether the property was vacant when acquired, and whether there are any state or local restrictions on our ability to complete renovations as an essential business function. Additionally, the ability of our suppliers and other business partners to carry out their assigned tasks and/or source labor or supply materials at ordinary levels of performance relative to the conduct of our business have increased the time required to renovate our homes. As a result of inflationary trends and/or imposition of or increases in tariffs, we may experience, as we have in the past, increased costs for certain materials and services necessary to renovate our homes. We continue to actively manage these factors on the cost of renovations, and we believe we are able to purchase goods and services at favorable prices compared to other purchasers due to our size and scale both nationally and locally.\nFinancing Arrangements:\nFinancing arrangements directly impact our interest expense, our various debt instruments, and our ability to acquire and renovate homes. We have historically utilized indebtedness to fund the acquisition and renovation of new homes. Our current financing arrangements contain financial covenants and other terms and conditions, including variable interest rates in some cases, that are impacted by market conditions. Current macroeconomic conditions may continue to negatively affect volatility, availability of funds, and transaction costs (including interest rates) within financial markets. These factors may also negatively affect our ability to access financial markets as well as our business, results of operations, and financial condition. See Part I. Item 3. “Quantitative and Qualitative Disclosures about Market Risk” for further discussion regarding interest rate risk. Our future financing arrangements may not have similar terms with respect to amounts, interest rates, financial covenants, and durations.\nMacroeconomics Conditions:\nInflation, elevated interest rates, political dissension, labor shortfalls, and adverse global economic conditions could negatively affect our business and financial condition. Imposition of, increases in, and changing policies around tariffs by the United States on imports from certain countries and potential counter-tariffs in response could lead to increased costs and supply chain disruptions. If we are not able to navigate any such changes, they could have a material adverse effect on our business and results of operations, as well as on the price of our common stock.\nComponents of Revenues and Expenses\nThe following is a description of the components of our revenues and expenses.\nRental Revenues and Other Property Income\nRental revenues, net of any concessions and bad debt (including write-offs, credit reserves, and uncollectible amounts), consist of rents collected under lease agreements related to our single-family homes for lease. We enter into leases directly with our residents, and the leases typically have a term of one to two years.\nOther property income is comprised of: (i) resident reimbursements for utilities, HOA fines, and other charge-backs; (ii) rent and non-refundable deposits associated with pets; (iii) revenues from value-add services such as smart homes, internet and media packages, home liability insurance, and HVAC replacement filters; and (iv) various other fees, including late fees and lease termination fees, among others.\nManagement Fee Revenues\nManagement fee revenues consist of fees from property and asset management services provided to portfolio owners of single-family homes for lease, including investments in our unconsolidated joint ventures.\nProperty Operating and Maintenance\nOnce a property is available for its initial lease, which we refer to as “rent-ready,” we incur ongoing property-related expenses, which consist primarily of property taxes, insurance, HOA fees (when applicable), market-level personnel expenses, utility expenses, repairs and maintenance, and property administration. Prior to a property being “rent-ready,” certain of these expenses are capitalized as building and improvements. Once a property is “rent-ready,” expenditures for ordinary repairs and maintenance thereafter are expensed as incurred, and we capitalize expenditures that improve or extend the life of a home.\nProperty Management Expense\nProperty management expense represents personnel and other costs associated with the oversight and management of our portfolio of homes, including those for which we provide property and asset management services on behalf of others through our internal property manager.\nGeneral and Administrative\nGeneral and administrative expense represents personnel costs, professional fees, and other costs associated with our day-to-day activities. General and administrative expense may also include"
}