{
  "source_file": "ip-20241231.htm",
  "form_type": "10-K",
  "item1_clean": "ITEM 1. BUSINESS\nGENERAL\nInternational Paper Company (the \"Company,\" \"International Paper\" or \"IP\", which may also be referred to as \"we\" or \"us\") is a global leader in sustainable packaging solutions. We produce renewable fiber-based packaging and pulp products with manufacturing operations in North America, Latin America, Europe and North Africa. We are a New York corporation, incorporated in 1941 as the successor to the New York corporation of the same name organized in 1898. You can learn more about us by visiting our website at www.internationalpaper.com.\nIn the United States, at December 31, 2024, the Company operated 22 pulp and packaging mills, 157 converting and packaging plants, 16 recycling plants and three bag facilities. Production facilities at December 31, 2024 in Canada, Europe, North Africa and Latin America included four pulp and packaging mills, 36 converting and packaging plants, and two recycling plants. We operate a packaging products distribution business principally through six branches in Asia. Substantially all of our businesses have experienced, and are likely to continue to experience, cycles relating to industry capacity and general economic conditions.\nWe are guided by our core values. We do the right things, in the right ways, for the right reasons, all of the time – this is The IP Way. Our overarching values are safety, ethics, and excellence.\nSafety – Above all else, we care about people. We look out for each other to ensure everyone returns home safely each day.\nEthics – We act honestly and operate with integrity and respect. We promote a culture of openness and accountability.\nExcellence – We set high expectations and aim to deliver outstanding results for each other, our customers and our shareholders.\nFor management and financial reporting purposes, our businesses are separated into two segments: Industrial Packaging and Global Cellulose Fibers. A description of these business segments can be found on page 42 of\nItem 7. Management’s Discussion and Analysis of Financial Condition and Results of Operations\nIn 2024, International Paper made significant strides to further enhance our performance-driven culture that we believe will enable us to create significant\nvalue for our employees, customers and share owners. In April 2024, International Paper announced a proposed business combination with DS Smith Plc (\"DS Smith\"), a global packaging, paper and recycling company and leading provider of sustainable fiber-based packaging headquartered in England in an all-stock transaction. This highly complementary business combination is designed to create a truly sustainable packaging solutions leader that can serve a broad set of customers across a wide range of attractive and growing end-markets to generate significant shareholder value. Shareholders of DS Smith and International Paper overwhelmingly approved the business combination at separate meetings in October 2024. On January 24, 2025, the Company announced plans to divest plants located in Mortagne, Saint-Amand, and Cabourg (France), Ovar (Portugal) and Bilbao (Spain) in connection with the European Commission’s clearance of the business combination. The business combination closed on January 31, 2025. Thereafter, the Company obtained a secondary listing of International Paper common stock on the London Stock Exchange (LSE: IPC) and established a Europe, Middle East and Africa (\"EMEA\") headquarters in DS Smith's existing main office in London. DS Smith re-registered as DS Smith Limited, a private limited company effective on February 5, 2025.\nIn the third quarter of 2024, the Company also began implementing an 80/20 strategic approach to drive transformational performance. The 80/20 approach suggests that 80% of our results come from 20% of efforts. As applied to our business, the approach is used to determine the most impactful areas to focus on. Through the 80/20 strategic approach, we intend to deliver profitable market share growth by striving to be the lowest-cost producer and the most reliable and innovative sustainable packaging solutions provider to our customers across North America and EMEA. As part of the Company’s 80/20 strategic approach, the Company intends to guide investments and align resources to win with our most strategic customers, while reducing complexity and cost across the Company.\nTo that end, the Company initiated a corporate overhead restructuring plan in the third quarter of 2024 aimed at better aligning our workforce with the needs of the business and our customers, optimizing our organizational structure and reducing operating costs. Additionally, we committed to investing to strengthen our most competitive and strategic assets and closed facilities to structurally reduce operating costs. Further, in October 2024, we announced that we are exploring strategic options for our Global Cellulose Fibers business.\nThese significant undertakings follow the September 2023 completion of the sale of our 50% equity interest in Ilim S.A. (\"Ilim\"), the sale of all of our Ilim Group shares (constituting a 2.39% stake) and divestment of other non-material residual interests associated with Ilim. Ilim was a joint venture that operated a pulp and paper business in Russia and has subsidiaries including Ilim Group. Following the completed sales, we no longer have an interest in Ilim or any of its subsidiaries, and no longer have any investments in Russia. As a result, all current and historical results of the Ilim investment reportable segment are presented as Discontinued Operations, net of taxes. See discussion in\nNote 10 - Equity Method Investments\nItem 8. Financial Statements and Supplementary Data\nWe remain confident that the initiatives undertaken as part of our transformational journey in 2024 will unlock substantial value at IP and strengthen the Company for our employees, customers and shareholders.\nFrom 2020 through 2024, International Paper’s capital spending approximated $4.3 billion, excluding mergers and acquisitions. These expenditures reflect our continuing efforts to use our capital strategically to improve product quality and environmental performance, as well as lower costs, maintain reliability of operations and deploy strategic capital for capacity expansion. Capital spending in 2024 was approximately $921 million and is expected to be approximately $1.2 billion in 2025. You can find more information about capital spending on page 46 of\nItem 7. Management’s Discussion and Analysis of Financial Condition and Results of Operations\nDiscussions of acquisitions can be found in\nItem 8. Financial Statements and Supplementary Data\nYou can find discussions of restructuring charges and other special items on page 37 of\nItem 7. Management’s Discussion and Analysis of Financial Condition and Results of Operations\nwith, or furnish it to, the SEC. We encourage you to refer to such information.\nHUMAN CAPITAL\n\nEMPLOYEES\nAs of December 31, 2024, we have approximately 37,000 employees, nearly 31,000 of whom are located in the United States. Of our U.S. employees, 21,000 are hourly, with unions representing approximately 13,000 employees. Of this number, 9,600 are represented by the United Steelworkers union (\"USW\").\nInternational Paper, the USW, and several other unions have entered into five master agreements covering various U.S. mills and converting facilities. Four of the master agreements are with the USW and include members from the International Association of Machinists and Aerospace Workers, International Brotherhood of Electrical Workers, United Food and Commercial Workers International Union and Workers Unite at certain U.S. mills and converting facilities. The Company also has a master agreement with District Counsel 2, which is affiliated with the Printing Packaging & Production Workers Union of North America that covers additional converting facilities. Individual facilities continue to have local agreements for subjects not covered by the master agreements. If local facility agreements are not successfully negotiated at the time of expiration, under the terms of the master agreements, the local agreements will automatically renew with the same terms in effect.\nSAFETY AND WELLBEING\nAt International Paper, we prioritize the safety and well-being of every employee and contractor. Safety is core to who we are and how we operate – at IP we strive to put safety above all else. To achieve this, we are cultivating a resilient safety culture where every team member is empowered to stop work they\nbelieve is unsafe. We work tirelessly to anticipate and address unexpected events by incorporating layers of protection, continuously enhancing our systems and engaging all team members in learning events to prevent injuries before they take place. In 2024, we engaged an independent safety consultant firm to help the Company improve workplace safety performance through risk assessments, safety culture development and programs designed to reduce accidents and injuries. We launched a Company-wide safety culture survey in 2024 to all U.S.-based employees. Results of the survey will be analyzed in 2025 with the goal of learning, growing and aspiring to achieve our Vision 2030 goal to create a 100% injury-free workplace for our team members and contractors.\nWe believe workplace safety includes psychological and emotional safety. At International Paper we also care deeply about the mental, emotional, physical and professional wellbeing of our employees by providing an Employee Assistance Program (“EAP”) at no cost to employees and family members. Our EAP offers coaching and counseling sessions aimed at problem solving, achieving goals, and dealing with stress and anxiety management through resilience. We embrace a holistic wellness approach providing employees with resources on incorporating wellness habits into their daily lives.\nHUMAN CAPITAL MANAGEMENT\nThe attraction, retention and development of our employees is critical to our success. We create a positive employee experience that begins at onboarding. Our Human Resources Talent Management Team hosts online Global New Employee Orientation for employees and each business conducts onsite new hire integration training unique to its business and/or facility. This experience continues through our continuous learning, development and performance management programs. We provide continuing education courses that are relevant to our industry and job functions within the Company, including both instructor-led and online training through our Learning Management System (“LMS”) MyLearning platform. Across the enterprise in 2024, employees completed 2.7 million learning activities through our platform.\nIn addition, we have created learning paths for specific positions that are designed to encourage an employee’s advancement and growth within our organization, such as our REACH (Recruit, Engage, Align College Hires) program and Global Manufacturing Training Initiative programs. Through REACH we recruit and develop early-career engineers and safety professionals for our U.S. mills, preparing them to become future leaders. We invest\nin the growth and development of our employees by providing a multi-dimensional approach to learning that empowers, intellectually grows and professionally develops our employees. Our Global Manufacturing Training Initiative provides training services to hourly operations and maintenance employees in our mills in a standardized and structured manner. On the converting side of our business, more than 200 front line and future leaders participated in our multi-day in-person Leadership Application and Professional Development and Manufacturing Management Associate Programs during 2024.\nWe develop leaders through our IP Leadership Institute offering a broad range of LMS virtual and in person resources, courses and workshops for individual contributors, people leaders and teams. We also offer peer mentoring and leadership",
  "item7_clean": "ITEM 7.\nMANAGEMENT’S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS.\nResults of Operations\nDescription of Business Segments\nBusiness Segment Results\nLiquidity and Capital Resources\nCritical Accounting Policies and Significant Accounting Estimates\nRecent Accounting Developments\nForeign Currency Effects\nINTERNATIONAL PAPER COMPANY\nFOR THE YEAR ENDED DECEMBER 31, 2024",
  "item2_clean": null
}