{
  "source_file": "ip-20250930.htm",
  "form_type": "10-Q",
  "item1_clean": null,
  "item7_clean": null,
  "item2_clean": "Income taxes - Non-operating pension and special items (a)\nAdjusted operating earnings (loss)\n(a) For the three months ended September 30, 2025, this amount includes a tax benefit of $62 million related to capital losses associated with the announced agreement to sell our Global Cellulose Fibers business. This amount also includes tax expense of $1 million on the non-operating pension income and a tax benefit of $87 million associated with special items. The three months ended September 30, 2024 include a tax benefit of $78 million related to internal legal entity restructuring. This amount also includes tax expense of $3 million on the non-operating pension income and a tax benefit of $24 million associated with special items. The three months ended June 30, 2025 includes tax expense of $1 million on the non-operating pension income and tax expense of $3 million associated with special items.\nReconciliation of Earnings (loss) from Continuing Operations to Adjusted EBITDA from Continuing Operations\nAdjusted EBITDA from continuing operations is a non-GAAP financial measure defined as earnings (loss) from continuing operations before income taxes and equity earnings (loss), interest expense, net, net special items, non-operating pension expense (income) and depreciation and amortization. Earnings (loss) from continuing operations before income taxes and equity earnings (loss) is the most directly comparable GAAP measure. Beginning with the third quarter of 2025, management is using this measure to focus on on-going operations and believes this measure is useful to investors. This change reflects investor feedback and management's view that Adjusted EBITDA provides a more meaningful measure of the operating performance of the Company and helps enable investors to perform meaningful comparisons of past and present consolidated operating results from continuing operations.\nThe following is a reconciliation of Earnings (loss) from continuing operations before income taxes and equity earnings (loss) to Adjusted EBITDA from continuing operations on a total basis. Additional detail is provided below regarding the special items referenced in the charts below.\n\nNon-operating pension expense (income)\nEarnings (loss) from continuing operations before income taxes and equity earnings (loss)\nIncome tax provision (benefit)\nEquity earnings (loss), net of taxes\nEarnings (loss) from continuing operations\nDiscontinued operations, net of tax\nDiluted earnings (loss) per share\n(a) Refer to special items discussion on page\nThree Months Ended September 30, 2025 Compared to the Three Months Ended June 30, 2025 and the Three Months Ended September 30, 2024\nRefer to the Effects of Net Special Items Expense (Income) section on page\nfor details of net special items expense (income) discussed below.\nThe increase in the third quarter of 2025 compared to the second quarter of 2025 and the third quarter of 2024 was primarily driven by higher sales prices. DS Smith accounted for $2.2 billion of net sales in the third quarter of 2025. Additional details on net sales are provided in the\nBusiness Segment Operating Results\nCost of products sold\nCost of products sold decreased by $135 million compared to the second quarter of 2025 and increased by $1.4 billion compared to the third quarter of 2024. The decrease compared to the second quarter of 2025 was driven by lower raw materials ($409 million) and maintenance/labor costs ($25 million), partially offset by increases in fuel and other expenses ($334 million). For IP legacy, cost of products sold was impacted by decreases in raw materials and operating materials ($194 million) and increases in maintenance and fuel expense ($11 million) compared to the third quarter of 2024. Net special items of $34 million were included in the third quarter of 2025 compared to $7 million in the third quarter of 2024 and DS Smith accounted for $1.6 billion of total cost of products sold in the third quarter of 2025.\nSelling and administrative expenses\nSelling and administrative expenses decreased by $32 million compared to the second quarter of 2025 and increased by $20 million compared to the third quarter of 2024. The decrease compared to the second quarter of 2025 was driven by lower incentive compensation and other costs ($20 million), partially offset by increased medical benefit costs ($11 million). For IP legacy, selling and administrative expenses were impacted by decreases in incentive compensation ($17 million) and increases in other costs ($12 million) compared to the third quarter of 2024. Net special items charges of $15 million, $51 million and $32 million in the third quarter of 2025 and 2024 and the second quarter of 2025, respectively, are included and DS Smith accounted for $119 million of total selling and administrative expenses in the third quarter of 2025.\nDepreciation and amortization\nDepreciation and amortization increased by $668 million compared to the second quarter of 2025 and increased by $891 million compared to the third quarter of 2024. The increase compared to the second quarter of 2025 and the third quarter of 2024 was primarily due to $675 million of accelerated depreciation related to mill strategic actions in the third quarter of 2025. Additionally, for IP legacy, the increase in the third quarter of 2025 compared to the third quarter of 2024 includes higher depreciation recognized on the units of production method at mills with higher production. DS accounted for $540 million of depreciation and amortization in the third quarter of 2025.\nDistribution expenses\nDistribution expenses increased by $8 million compared to the second quarter of 2025 and increased by $236 million compared to the third quarter of 2024. The increase compared to the second quarter of 2025 was driven by higher warehousing expense. For IP legacy, distribution expenses were impacted by higher freight and warehousing expenses compared to the third quarter of 2024. DS accounted for $233 million of distribution expenses in the third quarter of 2025.\nTaxes other than payroll and income taxes\nTaxes other than payroll and income taxes decreased by $1 million compared to the second quarter of 2025 and increased by $10 million compared to the third quarter of 2024. DS accounted for $10 million of taxes other than payroll and income taxes in the third quarter of 2025.\nInterest expense, net\nInterest expense, net decreased by $23 million compared to the second quarter of 2025 and increased by $33 million compared to the third quarter of 2024. The decrease compared to the second quarter of 2025 was driven by higher interest income. DS accounted for $37 million of interest expense, net in the third quarter of 2025.\nIncome tax provision (benefit)\nAn income tax benefit of $250 million was recorded for the third quarter of 2025 and the reported effective income tax rate was 37%. Excluding a benefit of $149 million related to the tax effects of net special items and an expense of $1 million related to the tax effects of non-operating pension income, the operational effective income tax rate was 31% for the third quarter of 2025.\nAn income tax provision of $40 million was recorded for the second quarter of 2025 and the reported effective income tax rate was 34%. Excluding expense of $3 million related to the tax effects of net special items and expense of $1 million related to the tax effects of non-operating pension income, the operational effective income tax rate was 27% for the second quarter of 2025.\nAn income tax benefit of $107 million was recorded for the third quarter of 2024 and the reported effective income tax rate was (2,140)%. Excluding a benefit of $102 million related to the tax effects of net special items and expense of $3 million related to the tax effects of non-operating pension income, the operational effective income tax rate was (8)% for the third quarter of 2024.\nThe following is a reconciliation of the net income tax provision (benefit) to the operational income tax provision (a non-GAAP financial measure) and the reported effective income tax rate to the operational effective income tax rate (a non-GAAP financial measure):\nIn millions (except rates)\nIncome tax provision (benefit) and reported effective income tax rate\n\nBusiness Segment Operating Profit (Loss)\nPS EMEA\nsales were higher driven by higher sales prices reflecting prior price increases, partially offset by lower volumes driven by a soft demand environment. Cost of products sold increased $22 million and was impacted by higher operating costs, including planned maintenance downtime costs, partially offset by lower fiber costs. Selling and administrative expenses decreased $20 million driven by lower overhead costs. Depreciation and amortization expense in the third quarter of 2025 increased $72 million due to $50 million of accelerated depreciation associated with Belisce, Croatia mill closure.\nPS EMEA results include sales of $2.0 billion and business segment operating profit (loss) of $(65) million for the legacy DS Smith EMEA business in the third quarter of 2025. Compared with the third quarter of 2024, legacy IP PS EMEA sales in the third quarter of 2025 were lower driven by lower sales prices for boxes and paper. Cost of products sold were lower, reflecting lower input costs. Selling and administrative expenses were lower compared to the third quarter of 2024 driven by lower overhead costs.\nLooking ahead to the fourth quarter of 2025, sales are expected to be higher. Operating costs are expected to be higher. Input costs are expected to be lower, driven by fiber costs. Planned maintenance downtime costs are expected to be lower in the fourth quarter of 2025.\nLIQUIDITY AND CAPITAL RESOURCES\nCash provided by (used for) operations, including discontinued operations, totaled $793 million and $1.3 billion for the first nine months of 2025 and 2024, respectively. Cash provided by (used for) working capital components (accounts receivable, "
}