{
  "source_file": "iqv-20241231.htm",
  "form_type": "10-K",
  "item1_clean": "IQVIA is a leading global provider of clinical research services, commercial insights and healthcare intelligence to the life sciences and healthcare industries. IQVIA’s portfolio of solutions are powered by IQVIA Connected Intelligence™ to deliver actionable insights and services built on high-quality health data, Healthcare-grade AI™, advanced analytics, the latest technologies and extensive domain expertise. We are committed to using artificial intelligence (\"AI\") responsibly, ensuring that our AI-powered capabilities are grounded in privacy, regulatory compliance, and patient safety. With approximately\ncountries, including experts in healthcare, life sciences, data science, technology and operational excellence, we are dedicated to accelerating the development and commercialization of innovative medical treatments to help improve patient outcomes and population health worldwide.\nWe are a global leader in protecting individual patient privacy. We use a wide variety of privacy-enhancing technologies and safeguards to protect individual privacy while generating and analyzing information on a scale that helps healthcare stakeholders identify disease patterns and correlate with the precise treatment path and therapy needed for better outcomes. Our insights and execution capabilities help biotech, medical device and pharmaceutical companies, medical researchers, government agencies, payers and other healthcare stakeholders tap into a deeper understanding of diseases, human behaviors and scientific advances, in an effort to advance their path toward cures.\nWe have one of the largest and most comprehensive collections of healthcare information in the world, which includes more than 1.2 billion comprehensive, longitudinal, non-identified patient records spanning sales, prescription and promotional data, medical claims, electronic medical records, genomics, and social media. Our scaled and growing information set contains approximately 64 petabytes of unique proprietary data sourced from approximately 150,000 data suppliers and covering over one million data feeds globally. Based on this data, we deliver information and insights on approximately 90% of the world’s pharmaceuticals, as measured by 2023 sales. We standardize, curate, structure and integrate this information by applying our sophisticated analytics and leveraging our global technology infrastructure. This helps our clients run their organizations more efficiently and make better decisions to improve their clinical, commercial and financial performance. We have developed a comprehensive portfolio of intelligent, actionable information offerings over a period of many years through innovation, expertise and hard work that differentiates our capabilities to support customers throughout the world.\nWe combine our proprietary information assets with advanced analytics, transformative technology and domain expertise to develop clinical and commercial capabilities that enable us to grow our relationships with healthcare stakeholders throughout the life science’s value chain. This set of capabilities includes:\nA leading healthcare-specific global IT infrastructure,\nrepresenting what we believe is one of the largest and most sophisticated information technology (“IT”) infrastructures in healthcare. We receive approximately 120 billion healthcare records annually, and our infrastructure then connects complex healthcare data while applying a wide range of privacy, security, operational, legal and contractual protections for data in response to local law, supplier requirements and industry leading practices;\nAnalytics-driven clinical development,\nwhich improves clinical trial design, site identification and patient recruitment by empowering therapeutic, scientific, and domain experts with expansive levels of information, including product level tracking in 95 markets, and information about treatments and outcomes on more than 1.2 billion unique non-identified patient records globally;\nRobust real world solutions ecosystem,\nwith sophisticated retrospective database analytics, prospective real world data collection technology platforms and scientific expertise, which enables us to address critical healthcare issues of cost, value and patient outcomes;\nA growing set of proprietary clinical and commercial applications,\nwhich helps our clients increase their clinical operations performance, supports their regulatory and compliance needs and orchestrates their sales operations, sales management, multi-channel marketing and performance management;\nIntegration of information, analytics, technology, and domain expertise through IQVIA Connected Intelligence\nwhich enables us to provide our clients with more effective options to address their needs from research and development through commercialization as well as truly innovative breakthroughs such as decentralized trials and global real-world evidence networks; and\nA staff of approximately\nemployees across the globe\n, including over 29,000 Technology & Analytics Solutions employees, approximately 49,000 Research & Development Solutions employees and approximately 6,000 Contract Sales & Medical Solutions employees.\nOur Market Opportunity\nWe compete in a market of approximately $330 billion consisting of outsourced research and development, real-world evidence and connected health and technology enabled clinical and commercial operations markets for life sciences companies and the broader healthcare industry. The following sets forth our estimates for the size of our principal markets:\nOutsourced research and development:\nBiopharmaceutical spending on drug development totaled approximately $194 billion in 2024. Of that amount, we estimate that our addressable opportunity (clinical development spending excluding preclinical spending) was approximately $155 billion. The portion of this addressable opportunity that was outsourced in 2024, based on our estimates, was approximately $73 billion.\nReal-World Evidence and connected health:\nTotal addressable market of approximately $85 billion in 2024 that consists of tightly coupled life sciences and healthcare markets. First, the life sciences market for Real-World Evidence of approximately $30 billion includes post-launch evidence generation, market access, and medical affairs. Second, the addressable opportunity for connected healthcare is approximately $55 billion, and includes areas such as revenue cycle management, payer & provider analytics and clinical decision support services.\nTechnology enabled commercial operations:\nTotal addressable market of approximately $82 billion in 2024 that includes information, data warehousing, IT outsourcing, software applications and other services in the broader market for IT services. This addressable opportunity also includes commercial services such as recruiting, training, deploying and managing global sales forces, channel management, patient engagement services, market access consulting, brand communication, advisory services, and health information analytics and technology consulting.\nIn deriving estimates of the size of the various markets described above, we review third-party sources, which include estimates and forecasts of spending in various segments, in combination with internal IQVIA research and analysis informed by our experience serving these segments, as well as projected growth rates for each of these segments. See “Industry and Market Data” above.\nWe believe there are six key trends affecting our end markets that will create increasing demand for research and development services, technology & analytics solutions and contract sales and medical solutions:\nGrowth and innovation in the life sciences industry.\nThe life sciences industry is a large and critical part of the global healthcare system and, according to the latest information available from the IQVIA Market Prognosis service, is estimated to have generated approximately $1.73 trillion in revenues in 2024. According to the IQVIA Institute, it is estimated that spending on pharmaceuticals in emerging markets will expand at a 5% to 8% compound annual growth rate (“CAGR”) through 2029. The growth of emerging markets demonstrates their strategic importance to global life sciences organizations along with the emergence of local and regional companies with similar operational and informational needs. We expect all of these organizations to apply a high degree of sophistication to their commercial operations in these countries, especially as some begin to emerge as sources of original innovative products. For global companies, this requires highly localized knowledge and information assets, the development of market access strategies and performance benchmarking. In addition, local players are learning that they need to compete on the basis of improved information and analytics.\nGrowth in Research and Development.\nSpending trends in research and development are impacted as a result of several factors, including major biopharmaceutical companies’ efforts to replenish revenues lost from the so-called “patent cliff,” increased access to capital by the small and midcap biotechnology industry, and recent increases in pharmaceutical approvals by regulatory authorities. The IQVIA Institute also estimates that approximately 350 new molecular entities (“NMEs”) are expected to be approved between 2025 and 2029, or 70 per year compared to 61 per year on average during the past decade. We believe that further research and development spending, combined with the continued need for cost efficiency across the healthcare landscape, will continue to create opportunities for biopharmaceutical services companies, particularly those with a global reach and broad service offerings, to help biopharmaceutical companies with their pre- and post-launch solutions development and commercialization needs. The impact of recent legislative changes on product launch and industry innovation continues to be evaluated. IQVIA is involved with many stakeholders throughout the industry as we help navigate changes over the coming decade.\nIncreased Complexity in Research and Development.\nBiopharmaceutical companies face environments in which it has become increasingly difficult to operate. Improved standards of care in many therapeutic areas and the emergence of new types of therapies, such as biologics, genetically targeted therapies, gene and stem cell therapies, and other treatment modalities have led to more complex development and regulatory pathways. We believe that our global clinical development capabilities, including our expertise in biomarkers and genomics and our global laboratory network, position us well to help biopharmaceutical companies manage the complexities inherent in an environment where this type of expertise is important. For example, IQVIA Connected Intelligence helps us validate protocols to ensure studies in new disease areas have greater accuracy and also enables us, through innovations such as predictive analytics, to find patients who may not have been diagnosed.\nRegulators require clinical trials to involve local populations as part of the process for approving new pharmaceutical products, especially in certain Asian and emerging markets. Understanding the epidemiological and physiological differences in different ethnic populations and being able to conduct clinical trials locally in certain geographies will be important to pharmaceutical product growth strategies, both for multinational and local/regional biopharmaceutical companies. We believe that our global clinical development capabilities and unmatched presence in Asia and other emerging markets make us a strong partner for biopharmaceutical companies managing the complexities of international drug development.\nFinancial pressures driving the need for increased efficiency.\nDespite expected accelerating growth in the global life sciences market, we believe our clients will face increased o",
  "item7_clean": "Item 7. Management’s Discussion and Analysis of Financial Condition and Results of Operations\nIQVIA is a leading global provider of clinical research services, commercial insights and healthcare intelligence to the life sciences and healthcare industries. IQVIA’s portfolio of solutions are powered by IQVIA Connected Intelligence™ to deliver actionable insights and services built on high-quality health data, Healthcare-grade AI™, advanced analytics, the latest technologies and extensive domain expertise. We are committed to using AI responsibly, ensuring that our AI-powered capabilities are grounded in privacy, regulatory compliance, and patient safety. With approximately 88,000 employees in over 100 countries, including experts in healthcare, life sciences, data science, technology and operational excellence, IQVIA is dedicated to accelerating the development and commercialization of innovative medical treatments to help improve patient outcomes and population health worldwide.\nWe are managed through three reportable segments: Technology & Analytics Solutions, Research & Development Solutions and Contract Sales & Medical Solutions. Technology & Analytics Solutions provides mission critical information, technology solutions and real world insights and services to our life science clients. Research & Development Solutions, which primarily serves biopharmaceutical clients, provides outsourced clinical research and clinical trial services. Contract Sales & Medical Solutions provides health care provider (including contract sales) and patient engagement services to both biopharmaceutical clients and the broader healthcare market.\nFor a description of our service offerings within our segments, refer to Part I, Item 1, “Business.”\nWe delivered another year of strong operating results in 2024 with our income from operations increasing over 11 percent and our cash flow from operating activities increasing over 26 percent from 2023. Our Technology & Analytics Solutions segment revenues and profit growth improved in the second half of the year as we captured opportunities relating to our clients increasing their spending. Our Research & Development Solutions segment also produced revenues and segment profit growth in 2024. Although we faced some challenges in our Research & Development Solutions segment in the latter half of 2024, and while we anticipate some of these challenges will persist into 2025, we consider these to be more short-term in nature. This segment overall is a long-cycle business.\nWe ended the year with our highest ever total company remaining performance obligations of approximately $33.5 billion as of December 31, 2024.\nWhile we experienced a decline in COVID-19 related work in 2024 versus 2023, overall COVID-19 related work was not material to operations. As of December 31, 2024, COVID-19 related work did not represent a material amount of our remaining performance obligations.\nWe continue to maintain strong liquidity. As of December 31, 2024, cash and cash equivalents were $1,702 million and we had $825 million drawn under our $2,000 million revolving credit facility. As of December 31, 2024, we were in compliance with the financial covenants under our debt agreements in all material respects and do not have material uncertainty about ongoing ability to meet the covenants of our credit arrangements.\nFor information about the industry outlook and markets that we operate in, refer to Part I, Item I, “Our Market Opportunity.”\nBusiness Combinations\nTotal revenues are comprised of revenues from the provision of our services. We do not have any material product revenues.\nOur costs and expenses are comprised primarily of our cost of revenues including reimbursed expenses and selling, general and administrative expenses. Cost of revenues includes compensation and benefits for billable employees and personnel involved in production, trial monitoring, data management and delivery, and the costs of acquiring and processing data for our information offerings; costs of staff directly involved with delivering technology-related services offerings and engagements, related accommodations and the costs of data purchased specifically for technology services engagements; and other expenses directly related to service contracts such as courier fees, laboratory supplies, professional services and travel expenses. Reimbursed expenses, which are included in cost of revenues, are comprised principally of payments to investigators who oversee clinical trials and travel expenses for our clinical monitors and sales representatives. Selling, general and administrative expenses include costs related to sales, marketing and administrative functions (including human resources, legal, finance, quality assurance, compliance and general management) for compensation and benefits, travel, professional services, training and expenses for information technology and facilities. We also incur costs and expenses associated with depreciation and amortization.\nForeign Currency Translation\nIn 2024, approximately 30% of our revenues were denominated in currencies other than the United States dollar, which represents approximately 60 currencies. Because a large portion of our revenues and expenses are denominated in foreign currencies and our financial statements are reported in United States dollars, changes in foreign currency exchange rates can significantly affect our results of operations. The revenues and expenses of our foreign operations are generally denominated in local currencies and translated into United States dollars for financial reporting purposes. Accordingly, exchange rate fluctuations will affect the translation of foreign results into United States dollars for purposes of reporting our consolidated results. As a result, we believe that reporting results of operations that exclude the effects of foreign currency rate fluctuations on certain financial results can facilitate analysis of period to period comparisons. This constant currency information assumes the same foreign currency exchange rates that were in effect for the comparable prior-year period were used in translation of the current period results. As such, the differences noted below between reported results of operations and constant currency information is wholly attributable to the effects of foreign currency rate fluctuations.\nConsolidated Results of Operations\nFor information regarding our results of operations for our Technology & Analytics Solutions, Research & Development Solutions and Contract Sales & Medical Solutions segments, refer to “Segment Results of Operations” later in this section.\nYear Ended December 31,\n(dollars in millions)\n2024 compared to 2023\nIn 2024, our revenues increased $421 million, or 2.8%, as compared to 2023. This increase was comprised of constant currency revenue growth of approximately $510 million, or 3.4%, reflecting a $333 million increase in Technology & Analytics Solutions, a $167 million increase in Research & Development Solutions, and a $10 million increase in Contract Sales & Medical Solutions.\nCost of Revenues, exclusive of Depreciation and Amortization\nYear Ended December 31,\n(dollars in millions)\nCost of revenues, exclusive of depreciation and amortization\n2024 compared to 2023\nWhen compared to 2023, cost of revenues, exclusive of depreciation and amortization increased $285 million in 2024, or 2.9%. This increase included a constant currency increase of approximately $643 million, or 6.6%, comprised of a $261 million increase in Technology & Analytics Solutions, a $374 million increase in Research & Development Solutions, and an $8 million increase in Contract Sales & Medical Solutions.\nAs a percentage of revenues, cost of revenues, exclusive of depreciation and amortization in 2024 remained relatively consistent with 2023.\nSelling, General and Administrative Expenses\nYear Ended December 31,\n(dollars in millions)\nSelling, general and administrative expenses\n2024 compared to 2023\nThe $61 million decrease in selling, general and administrative expenses in 2024 as compared to 2023 included a constant currency decrease of approximately $33 million, or 1.6%, comprised of a $52 million increase in Technology & Analytics Solutions, a $42 million increase in Research & Development Solutions, and a $2 million increase in Contract Sales & Medical Solutions, offset by a $129 million decrease in general corporate and unallocated expenses.\nDepreciation and Amortization\nYear Ended December 31,\n(dollars in millions)\nDepreciation and amortization\nThe $11 million decrease in depreciation and amortization in 2024 as compared to 2023 was primarily the result of less amortization of certain intangible assets from the merger between Quintiles and IMS Health, offset by an increase in amortization of capitalized software and of intangible assets from acquisitions occurring in 2023 and 2024.\nYear Ended December 31,\nThe restructuring costs incurred were due to ongoing efforts to streamline our global operations and reduce overcapacity to adapt to changing market conditions and integrate acquisitions. These restructuring actions are expected to occur throughout\nand are expected to consist of consolidating functional activities, eliminating redundant positions, and aligning resources with customer requirements.\nInterest Income and Interest Expense\nYear Ended December 31,\nInterest income included interest received primarily from bank balances and investments. The increase in 2024 as compared to 2023 is primarily a result of higher deposit rates.\nInterest expense during 2024 was lower than 2023 due primarily to lower base rate interest costs across the floating rate debt portfolio.\nLoss on Extinguishment of Debt\nYear Ended December 31,\nLoss on extinguishment of debt\nIn 2023 we recognized a loss on extinguishment of debt of\nfor fees and expenses incurred related to the refinancing of our Credit Agreement. No such activity occurred in 2024.\nOther (income) expense, net\nYear Ended December 31,\nOther (income) expense, net\nOther (income) expense, net for 2024 decreased compared to 2023 primarily due to less foreign currency gain on transactions.\nYear Ended December 31,\n(dollars in millions)\nEffective income tax rate\nOur effective income tax rate was favorably impacted in 2023, due to the completion of an internal legal entity restructuring that resulted in a benefit of $125 million. Historically, we recorded deferred tax assets related to certain foreign tax credits, and a full valuation allowance in relation to these foreign tax credits was established as it was not expected the credits would be utilized prior to expiration. We now believe it is reasonably possible that these foreign tax credits will be utilized and therefore we recorded a tax benefit of $64 million related to the valuation allowance release and establishing related uncertain tax positions. Additionally, due to the restructuring we also reversed a deferred tax liability of $61 million due to a basis difference that was recovered in a tax-free manner. The effective tax rate was also favorably impacted by a reversal of uncertain tax positions relating to tax credit carryforwards in the amount of $21 million due to an audit settlement.\nEquity in Earnings (Losses) of Unconsolidated Affiliates\nYear Ended December 31,\nEquity in earnings (losses) of unconsolidated affiliates\nEquity in earnings (losses) of unconsolidated affiliates increased in 2024 compared to 2023 due to the results in the operations of our unconsolidated affiliates.\nSegment Results of Operations\nRevenues and profit by segment are as follows:\nTechnology & Analytics Solutions\nResearch & Development Solutions\nContract Sales & Medical Solutions\nGeneral corporate and unallocated expenses\nDepreciation and amortization\nCertain costs are not allocated to our segments and are reported as general corporate and unallocated expenses. These costs primarily consist of stock-based compensation and expenses related to integration activities and acquisitions, as well as certain general corporate and unallocated expenses. We also do not allocate restructuring costs, depreciation and amortization, or impairment charges, if any, to our segments.\nTechnology & Analytics Solutions\nYear Ended December 31,\n(dollars in millions)\nCost of revenues, exclusive of depreciation and amortization\nSelling, general and administrative expenses\n2024 compared to 2023\nTechnology & Analytics Solutions’ revenues were $6,160 million in 2024, an increase of $298 million, or 5.1%, over 2023. This increase was comprised of constant currency revenue growth of approximately $333 million, or 5.7%, reflecting revenue growth primarily in the Europe and Africa region and to a lesser extent in the Americas region. The constant currency revenue growth was primarily driven by an increase in real world services and to a lesser extent by information and technology services. The constant currency revenue growth for the year was impacted by a decrease in COVID-19 related work.\nCost of Revenues, exclusive of Depreciation and Amortization\n2024 compared to 2023\nTechnology & Analytics Solutions’ cost of revenues, exclusive of depreciation and amortization, increased $225 million, or 6.4%, in 2024 as compared to 2023. This increase included a constant currency increase of approximately $261 million, or 7.5%, reflecting primarily an increase in compensation and related expenses, and to a lesser extent increases in reimbursed expenses and costs of acquiring and processing data, all to support revenue growth.\nSelling, General and Administrative Expenses\n2024 compared to 2023\nTechnology & Analytics Solutions’ selling, general and administrative expenses increased $41 million, or 4.7%, in 2024 as compared to 2023. This increase included a constant currency increase of approximately $52 million, or 5.9%, reflecting an increase in compensation and related expenses.\nResearch & Development Solutions\nYear Ended December 31,\n(dollars in millions)\nCost of revenues, exclusive of depreciation and amortization\nSelling, general and administrative expenses\nResearch & Development Solutions' contracted backlog increased from $29.7 billion as of December 31, 2023 to $31.1 billion as of December 31, 2024 and we expect approximately $7.9 billion of this backlog to convert to revenues in the next 12 months. Contracted backlog was $27.2 billion as of December 31, 2022.\nBacklog represents, at a particular point in time, future revenues from work not yet completed or performed under signed contracts. Once work begins on a project, revenues are recognized over the duration of the project.\nWe believe that backlog is an indicator of future revenues but the timing of revenues will be affected by a number of factors, including the variable size and duration of projects, many of which are performed over several years, cancellations, and changes to the scope of work during the course of projects. Projects that have been delayed remain in backlog, but the timing of the revenues generated may differ from the timing originally expected. Additionally, projects may be terminated or delayed by the customer or delayed by regulatory authorities. In the event that a client cancels a contract, we typically would be entitled to receive payment for all services performed up to the cancellation date and subsequent client-authorized services related to winding down the canceled project. For more details regarding risks related to our backlog, see Part I, Item IA, “Risk Factors—Risks Related to our Business—The relationship of backlog to revenues varies over time.”\n2024 compared to 2023\nResearch & Development Solutions’ revenues were $8,527 million in 2024, an increase of $132 million, or 1.6%, over 2023. This increase was comprised of constant currency revenue growth of approximately $167 million, or 2.0%, reflecting revenue growth in the Asia-Pacific and Europe and Africa regions. The constant currency revenue ",
  "item2_clean": null
}