{
  "source_file": "irm-20250930.htm",
  "form_type": "10-Q",
  "item1_clean": null,
  "item7_clean": null,
  "item2_clean": "ITEM 2. MANAGEMENT'S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS\nFORWARD-LOOKING STATEMENTS\nWe have made statements in this Quarterly Report that constitute \"forward-looking statements\" as that term is defined in the Private Securities Litigation Reform Act of 1995 and other securities laws. These forward-looking statements concern our current expectations regarding our future results from operations, economic performance, financial condition, goals, strategies, investment objectives, plans and achievements. These forward-looking statements are subject to various known and unknown risks, uncertainties and other factors, and you should not rely upon them except as statements of our present intentions and of our present expectations, which may or may not occur. When we use words such as \"believes\", \"expects\", \"anticipates\", \"estimates\", \"plans\", \"intends\", \"pursue\", \"commits\", \"will\" or similar expressions, we are making forward-looking statements. Although we believe that our forward-looking statements are based on reasonable assumptions, our expected results may not be achieved, and actual results may differ materially from our expectations. In addition, important factors that could cause actual results to differ from expectations include, among others:\nour ability or inability to execute our strategic growth plan, including our ability to invest according to plan, grow our businesses (including through joint ventures or other co-investment vehicles), incorporate alternative technologies (including artificial intelligence) into our offerings, achieve satisfactory returns on new product offerings, continue our revenue management, expand and manage our global operations, complete acquisitions on satisfactory terms, integrate acquired companies efficiently and transition to more sustainable sources of energy;\nchanges in customer preferences and demand for our storage and information management services, including as a result of the shift from paper and tape storage to alternative technologies that require less physical space or services activity;\nthe costs of complying with and our ability to comply with laws, regulations and customer requirements, including those relating to data privacy and cybersecurity issues, as well as fire and safety and environmental standards;\nthe impact of attacks on our internal information technology (\"IT\") systems, including the impact of such incidents on our reputation and ability to compete and any litigation or disputes that may arise in connection with such incidents;\nour ability to fund capital expenditures;\nthe impact of our distribution requirements on our ability to execute our business plan;\nour ability to remain qualified for taxation as a real estate investment trust for United States federal income tax purposes (\"REIT\");\nchanges in the political and economic environments in the countries in which we operate and changes in the global political climate;\nour ability to raise debt or equity capital and changes in the cost of our debt;\nour ability to comply with our existing debt obligations and restrictions in our debt instruments;\nthe impact of service interruptions or equipment damage and the cost of power on our data center operations;\nthe cost or potential liabilities associated with real estate necessary for our business;\nunexpected events, including those resulting from climate change or geopolitical events, could disrupt our operations and adversely affect our reputation and results of operations;\nfailures to implement and manage new IT systems;\nother trends in competitive or economic conditions affecting our financial condition or results of operations not presently contemplated; and\nthe other risks described in our periodic reports filed with the SEC, including under the caption \"Risk Factors\" in Part I, Item 1A of our Annual Report.\nExcept as required by law, we undertake no obligation to update any forward-looking statements appearing in this report.\nPart I. Financial Information\nOVERVIEW\nThe following discussions set forth, for the periods indicated, management's discussion and analysis of financial condition and results of operations. Significant trends and changes are discussed for the three and nine months ended September 30, 2025 within each section. Trends and changes that are consistent for both the three and nine month periods are not repeated and are discussed on a year to date basis only.\nPROJECT MATTERHORN\nIn September 2022, we announced a global program designed to accelerate the growth of our business (\"Project Matterhorn\"). Project Matterhorn investments focus on transforming our operating model to a global operating model. Project Matterhorn focuses on the formation of a solution-based sales approach that is designed to allow us to optimize our shared services and best practices to better serve our customers' needs. We are investing to accelerate growth and to capture a greater share of the large, global addressable markets in which we operate. We expect Project Matterhorn to be completed by December 31, 2025. We have incurred approximately $530.9 million in Restructuring and other transformation costs from the inception of Project Matterhorn through September 30, 2025. Costs are comprised of (1) restructuring costs, which include (i) site consolidation and other related exit costs, (ii) employee severance costs and (iii) certain professional fees associated with these activities, and (2) other transformation costs, which include professional fees such as project management costs and costs for third party consultants who are assisting in the enablement of our growth initiatives.\nSee Note 10 to Notes to Condensed Consolidated Financial Statements included in this Quarterly Report for more information on Restructuring and other transformation costs.\nGENERAL\nRESULTS OF OPERATIONS—KEY TRENDS\nOur organic storage rental revenue growth is primarily driven by revenue management in our Global RIM Business segment, where we expect volume to be relatively stable in the near term, as well as by growth in our Global Data Center Business segment, primarily driven by lease commencements.\nOur organic service revenue growth is primarily due to increases in our service activity. We expect organic service revenue growth for the remainder of 2025 and into 2026 to benefit from our new and existing digital offerings and asset lifecycle management (\"ALM\") business, as well as our traditional services\nWe expect continued total revenue and Adjusted EBITDA (as defined below) growth for the remainder of 2025 and into 2026 as a result of our focus on new product and service offerings, innovation, customer solutions and market expansion in line with our Project Matterhorn objectives and growth strategies.\nCost of sales (excluding depreciation and amortization) and Selling, general and administrative expenses for the nine months ended September 30, 2025 consists of the following:\nCOST OF SALES\nSELLING, GENERAL AND ADMINISTRATIVE EXPENSES\nPart I. Financial Information\nNON-GAAP MEASURES\nADJUSTED EBITDA\nWe define Adjusted EBITDA as net income (loss) before interest expense, net, provision (benefit) for income taxes, depreciation and amortization (inclusive of our share of Adjusted EBITDA from our unconsolidated joint ventures), and excluding certain items we do not believe to be indicative of our core operating results, specifically:\nEXCLUDED\nAcquisition and Integration Costs (as defined below)\nRestructuring and other transformation\nLoss (gain) on disposal/write-down of property, plant and equipment, net (including real estate)\nOther (income) expense, net\nStock-based compensation expense\nIntangible impairments\nAdjusted EBITDA Margin is calculated by dividing Adjusted EBITDA by total revenues. We also show Adjusted EBITDA and Adjusted EBITDA Margin for each of our reportable segments under \"Results of Operations—Segment Analysis\" below.\nAdjusted EBITDA excludes both interest expense, net and the provision (benefit) for income taxes. These expenses are associated with our capitalization and tax structures, which we do not consider when evaluating the operating profitability of our core operations. Adjusted EBITDA does not include depreciation and amortization expenses, in order to eliminate the impact of capital investments, which we evaluate by comparing capital expenditures to incremental revenue generated and as a percentage of total revenues. Adjusted EBITDA and Adjusted EBITDA Margin should be considered in addition to, but not as a substitute for, other measures of financial performance reported in accordance with accounting principles generally accepted in the United States of America (\"GAAP\"), such as operating income (loss), net income (loss) or cash flows from operating activities.\nRECONCILIATION OF NET INCOME (LOSS) TO ADJUSTED EBITDA (IN THOUSANDS):\nTHREE MONTHS ENDED SEPTEMBER 30,\nNINE MONTHS ENDED SEPTEMBER 30,\nInterest expense, net\nProvision (benefit) for income taxes\nDepreciation and amortization\nAcquisition and Integration Costs\nRestructuring and other transformation\nLoss (gain) on disposal/write-down of property, plant and equipment, net (including real estate)\nOther (income) expense, net, excluding our share of losses (gains) from our unconsolidated joint ventures\nStock-based compensation expense\nOur share of Adjusted EBITDA reconciling items from our unconsolidated joint ventures\nRepresents operating expenditures directly associated with the closing and integration activities of our business acquisitions that have closed, or are highly probable of closing, and include (i) advisory, legal and professional fees to complete business acquisitions and (ii) costs to integrate acquired businesses into our existing operations, including move, severance and system integration costs (collectively, \"Acquisition and Integration Costs\").\nPart I. Financial Information\nADJUSTED EPS\nWe define Adjusted EPS as reported earnings per share fully diluted "
}