{
  "source_file": "isrg-20241231.htm",
  "form_type": "10-K",
  "item1_clean": "benefits provided by the da Vinci surgical system and the Ion endoluminal system. Our clinical sales team provides current clinical information on robotic-assisted surgery or bronchoscopy practices and new product applications to the hospital teams. Our clinical sales team has grown with the expanded installed bases of da Vinci surgical systems and Ion endoluminal systems as well as the total number of procedures performed. We expect this organization to continue to grow as our business expands.\nOur customers place orders to replenish their supplies of instruments and accessories on a regular basis. Orders received are typically shipped within one business day. New direct customers who purchase a system typically place an initial stocking order of instruments and accessories soon after they receive their system.\nOur business is subject to seasonal fluctuations. Historically, placements of our da Vinci surgical systems have tended to be heavier in the fourth quarter and lighter in the first quarter, as hospital budgets are reset. In addition, we have historically experienced lower procedure volume in the first and third quarters and higher procedure volume in the second and fourth quarters. More than half of da Vinci procedures performed are for benign conditions. These benign procedures and other short-term elective procedures tend to be more seasonal than cancer procedures and surgeries for other life-threatening conditions. In the U.S., volumes for procedures associated with benign conditions are typically seasonally higher in the fourth quarter when more patients have met annual deductibles and lower in the first quarter when deductibles are reset. Seasonality outside of the U.S. varies and is more pronounced around local holidays and vacation periods, which have lower procedure volume. The\ntiming of procedures and changes in procedure volume impact the timing of instruments and accessories and capital purchases. As a result of factors outlined in “Item 7. Management’s Discussion and Analysis of Financial Condition and Results of Operations—COVID-19 Pandemic” below, including the past and potential future recommendations of authorities to defer elective procedures, historical procedure patterns have been and may continue to be disrupted.\nWe have a network of field service and technical support engineers across the U.S., Canada, Europe, and Asia and maintain relationships with various distributors around the globe. This infrastructure of service and support specialists, along with advanced service tools and solutions, offers a full complement of services for our customers, including installation, repair, maintenance, 24/7 technical support, and proactive system health monitoring. We generate service revenue by providing these services to our customers through comprehensive service contracts and time and material programs.\nResearch and Development\nWe focus our research and development efforts on innovation and improvement for products and services that align with our mission: We believe that minimally invasive care is life-enhancing care. Through ingenuity and intelligent technology, we believe that we can expand the potential of physicians to heal without constraints. We employ engineering and research and development staff to focus on delivering future innovations and sustaining improvements that advance our mission. In certain instances, we complement our research and development effort through collaborations with other companies, such as our Integrated Table Motion product offering developed with Hillrom (now a part of Baxter International Inc.).\nWe manufacture our systems at our facilities in Sunnyvale, California, and Peachtree Corners, Georgia, as well as at our Joint Venture’s facility in Shanghai, China. Our instruments and accessories are produced at our facilities in Sunnyvale, California, and Mexicali, Mexico. Additionally, we have Ion-related manufacturing in Blacksburg, Virginia, and Shanghai, China, and endoscope-related manufacturing at multiple sites in Germany. We are also planning to open a new manufacturing facility in Bulgaria.\nWe purchase both custom and off-the-shelf components from a large number of suppliers and subject them to stringent quality specifications and processes. Some of the components necessary for the assembly of our products are currently provided to us by sole-sourced suppliers (the only recognized supply source available to us) or single-sourced suppliers (the only approved supply source for us among other sources). We purchase the majority of our components and major assemblies through purchase orders rather than long-term supply agreements and generally do not maintain large volumes of finished goods relative to our anticipated demand.\nWe face competition in the forms of existing open surgery, conventional MIS, drug therapies, radiation treatment, and other emerging diagnostic and interventional surgical approaches. Some of these procedures are widely accepted in the medical community and, in many cases, have a long history of use. Our success depends on continued clinical and technical innovation, quality, and reliability, as well as educating hospitals, surgeons, and patients on the demonstrated results associated with robotic-assisted medical procedures using da Vinci surgical systems or Ion endoluminal systems and their value relative to other techniques. We also face competition from several companies that have introduced or are developing new approaches and products for the MIS market. We believe that the entrance or emergence of competition validates MIS and robotic-assisted surgery or robotic-assisted bronchoscopy.\nMoreover, as we add new robotically controlled products (e.g., da Vinci stapling and da Vinci energy products) that compete with product offerings traditionally within the domains of open surgery and/or conventional MIS, we face greater competition from larger and well-established companies, such as Johnson & Johnson and Medtronic plc.\nAdditionally, we currently face, or anticipate facing, competition from companies with products used in open or MIS surgeries, including laparoscopy and alternative multi-port, single-port, or endoluminal systems. We also compete with companies providing other therapeutic approaches for addressing target clinical conditions, as well as companies developing diagnostic solutions that could serve as alternatives to current or planned Intuitive offerings. Companies that have introduced products in the field of robotic-assisted medical procedures, or have made explicit statements about their efforts to enter the field, include, but are not limited to, the following: Beijing Surgerii Robotics Company Limited; CMR Surgical Ltd.; Distalmotion SA; Harbin Sizhe Rui Intelligent Medical Equipment Co., Ltd.; Johnson & Johnson; Karl Storz SE & Co. KG; Medicaroid Corporation; Medtronic plc; meerecompany Inc.; Noah Medical; Shandong Weigao Group Medical Polymer Company Ltd.; Shanghai Microport Medbot (Group) Co., Ltd.; Shenzhen Edge Medical Co., Ltd.; and SS Innovations International, Inc. Other companies with substantial experience in industrial robotics could potentially expand into the field of medical robotics and become a competitor. In addition, research efforts utilizing computers and robotics for medical procedures\nare underway at various companies and research institutions. Our revenues may be adversely impacted as our competitors announce their intent to enter our markets and as our customers anticipate the availability of competing products. We may not be able to maintain or improve our competitive position against current or potential competitors, especially those with greater resources.\nIntellectual Property\nWe place considerable importance on obtaining and maintaining patent, copyright, trademark, and trade secret protection for significant new technologies, products, and processes.\nWe generally rely upon a combination of intellectual property laws, confidentiality procedures, and contractual provisions to protect our proprietary technology. For example, we have trademarks, both registered and unregistered, that provide distinctive identification of our products in the marketplace. We also have exclusive and non-exclusive patent licenses with various third parties to supplement our own robust patent portfolio.\nAs of December 31, 2024, we owned more than 5,300 patents granted and still in force and more than 2,400 patents pending worldwide. We intend to continue filing new patent applications in the U.S. and foreign jurisdictions to seek protection for our technology. Patents have finite terms. The expiration of a patent ends the exclusive rights accorded by the patent for the invention claimed.\nGovernment Regulation\nOur products and operations are subject to regulation in the U.S. by the FDA and the State of California as well as by other countries and regions in which we market and promote our products. In addition, our products must meet the requirements of a large and growing body of international regulations and standards, which govern the design, manufacture, materials content and sourcing, testing, certification, packaging, installation, use, and disposal of our products. We must continually keep abreast of these regulations, standards, and requirements and integrate our compliance into the development and regulatory documentation for our products. Failure to meet these requirements could limit our ability to market our products in those regions that require compliance with such regulations and standards. Examples of standards to which we are subject include electrical safety standards, such as those of the International Electrotechnical Commission (e.g., IEC 60601-ss series of standards), and composition regulations, such as the Reduction of Hazardous Substances (“RoHS”) and the Waste Electrical and Electronic Equipment (“WEEE”) Directives applicable in the European Union (“EU”).\nFDA\nOur products are subject to regulation as medical devices in the United States under the Federal Food, Drug, and Cosmetic Act (“FFDCA”), as implemented and enforced by the FDA. The FDA regulates the development, design, non-clinical and clinical research, manufacturing, safety, efficacy, labeling, packaging, storage, installation, recordkeeping, complaint and adverse event reporting, clearance, approval, certification, promotion, marketing, export, import distribution, and service of medical devices in the U.S. to ensure that medical devices distributed domestically are safe and effective for their intended uses.\nUnder the FFDCA, medical devices are classified into one of three classes—Class I, Class II, or Class III—depending on the degree of risk associated with each medical device and the extent of control needed to ensure safety and effectiveness. Our current products are Class II medical devices.\nClass II medical devices are those that are subject to general controls, and most require premarket demonstration of adherence to certain performance standards or other special controls, as specified by the FDA, and special controls as deemed necessary by the FDA to ensure the safety and effectiveness of the device. These special controls can include performance standards, post-market surveillance, patient registries, and FDA guidance documents.\nManufacturers of most Class II devices are required to submit to the FDA a premarket notification under Section 510(k) of the FFDCA requesting authorization to commercially distribute the device. The FDA’s authorization to commercially distribute a device subject to a 510(k) premarket notification is generally known as 510(k) clearance. Our current products are subject to premarket notification and clearance under section 510(k) of the FFDCA. To obtain 510(k) clearance, we must submit to the FDA a premarket notification submission demonstrating that the proposed device is “substantially equivalent” to a legally marketed predicate device.\nThe FDA may req",
  "item7_clean": "ITEM 7. MANAGEMENT’S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS\nOpen surgery remains a prevalent form of surgery and is used in almost every area of the body. However, the large incisions required for open surgery create trauma to patients, typically resulting in longer hospitalization and recovery times, increased hospitalization costs, and additional pain and suffering relative to minimally invasive surgery, where MIS is available. For over four decades, MIS has reduced trauma to patients by allowing selected surgeries to be performed through small ports rather than large incisions. MIS has been widely adopted for certain surgical procedures.\nDa Vinci surgical systems enable surgeons to extend the benefits of MIS to many patients who would otherwise undergo a more invasive surgery by using computational, robotic, and imaging technologies to overcome many of the limitations of traditional open surgery or conventional MIS. Surgeons using a da Vinci surgical system operate while seated comfortably at a console viewing a 3D, high-definition image of the surgical field. This immersive console connects surgeons to the surgical field and their instruments. While seated at the console, the surgeon manipulates instrument controls in a natural manner, similar to open surgical technique. Our technology is designed to provide surgeons with a range of articulation of the surgical instruments used in the surgical field analogous to the motions of a human wrist, while filtering out the tremor inherent in a surgeon’s hand. In designing our products, we focus on making our technology easy and safe to use.\nOur da Vinci products fall into five broad categories: da Vinci surgical systems, da Vinci instruments and accessories, da Vinci stapling, da Vinci energy, and da Vinci vision, including Firefly fluorescence imaging systems and da Vinci endoscopes. We provide a comprehensive suite of systems, learning, and services offerings. Digitally enabled for nearly three decades, these three offerings aim to decrease variability by providing dependable, consistent functionality and an integrated user experience. Our systems category includes robotic platforms, software, vision, energy, and instruments and accessories. Our learning category includes learning and enabling technology, such as simulation and telepresence, as well as technical training programs and personalized peer-to-peer learning opportunities. We have a global network of field service engineers and distributors through which we deliver a suite of services, including installation, repair, maintenance, around-the-clock technical support, and system monitoring. We also offer customized analytics and consultation to hospitals for program optimization.\nWe have commercialized the following da Vinci surgical systems: the da Vinci standard surgical system in 1999, the da Vinci S surgical system in 2006, the da Vinci Si surgical system in 2009, the fourth-generation da Vinci Xi surgical system in 2014, and the fifth-generation da Vinci 5 surgical system in 2024. We extended our fourth-generation platform by adding the da Vinci X surgical system, commercialized in 2017, and the da Vinci SP surgical system, commercialized in 2018. The da Vinci SP surgical system accesses the body through a single incision, while the other da Vinci surgical systems access the body through multiple incisions. All da Vinci systems include a surgeon’s console (or consoles), imaging electronics, a patient-side cart, and computational hardware and software.\nWe are in the early stages of launching our da Vinci SP surgical system, and we have an installed base of 273 da Vinci SP surgical systems as of December 31, 2024. We have received FDA clearance for the da Vinci SP surgical system for urologic, colorectal, general thoracoscopic, and certain transoral procedures. Additionally, the da Vinci SP surgical system has received regulatory clearance in South Korea for a broad set of procedures. The da Vinci SP surgical system has also received regulatory clearance in Japan for the same set of procedures that are currently allowed with the da Vinci Xi surgical system in Japan. In January 2024, the da Vinci SP surgical system received European certification in accordance with Regulation (EU) 2017/745 of the European Parliament and of the Council of 5 April 2017 on medical devices (the “EU MDR”) for use in endoscopic abdominopelvic, thoracoscopic, transoral otolaryngology, transanal colorectal, and breast surgical procedures, and we are commercializing the da Vinci SP surgical system in select major European countries as part of a measured rollout strategy. In August 2024, we obtained regulatory clearance in Taiwan for our da Vinci SP surgical system for use in endoscopic abdominopelvic, thoracoscopic, transoral otolaryngology, transanal colorectal, transanal total mesorectal excision, and breast surgical procedures. We plan to seek FDA clearances for additional indications for the da Vinci SP surgical system and expand the system’s regulatory approvals (including for additional indications) in other OUS markets over time. The success of the da Vinci SP surgical system is dependent on positive experiences and improved clinical outcomes for the procedures for which it has been cleared as well as securing additional clinical clearances.\nIn March 2024, we obtained FDA clearance for our da Vinci 5 surgical system, our next-generation multi-port robotic system, for use in all surgical specialties and procedures indicated for da Vinci Xi, except for cardiac and pediatric indications. In October 2024, we obtained regulatory clearance in South Korea for the da Vinci 5 surgical system for use in urologic, general, gynecologic, thoracoscopic, thoracoscopically-assisted cardiotomy, and transoral otolaryngology surgical procedures. We are in the early stages of launching da Vinci 5, and we have an installed base of 362 da Vinci 5 surgical systems as of December 31, 2024. We are in the midst of a phased launch over several quarters, giving us time to mature our supply and manufacturing processes for the new system. Additionally, we are in the regulatory process in Japan and Europe for da Vinci 5.\nWe offer approximately 70 different multi-port da Vinci instruments to provide surgeons with flexibility in choosing the types of tools needed to perform a particular surgery. These multi-port instruments are generally robotically controlled and provide end effectors (tips) that are similar to those used in either open or laparoscopic surgery. We offer advanced instrumentation for the da Vinci 5, da Vinci X, and da Vinci Xi surgical systems, including da Vinci energy and da Vinci stapler products, to provide surgeons with sophisticated, computer-aided tools to precisely and efficiently interact with tissue. The da Vinci 5, da Vinci X, and da Vinci Xi surgical systems generally share the same instruments, whereas the da Vinci Si surgical system uses instruments that are not compatible with the da Vinci 5, da Vinci X, and da Vinci Xi systems. Additionally, we have introduced a unique set of force feedback instruments that are only compatible with our da Vinci 5 surgical system. We also currently offer nine core instruments on our da Vinci SP surgical system. We plan to expand our da Vinci SP instrument offering over time.\nOur learning and enabling technology offerings facilitate access to education and training on our products. Our enabling technologies include telepresence and Advanced Insights Suite (which includes Case Insights and Insights Engine), and our learning technology solutions include Intuitive Learning, SimNow, customized training models, remote case observations, and remote proctoring.\nIn 2019, we commercialized our Ion endoluminal system, which is a flexible, robotic-assisted, catheter-based platform that utilizes instruments and accessories for which the first cleared indication is minimally invasive biopsies in the lung. Our Ion system extends our commercial offering beyond surgery into diagnostic, endoluminal procedures. The system features an ultra-thin, ultra-maneuverable catheter that can articulate 180 degrees in all directions and allows navigation far into the peripheral lung and provides the stability necessary for precision in a biopsy. Many suspicious lesions found in the lung may be small and difficult to access, which can make diagnosis challenging, and Ion helps physicians obtain tissue samples from deep within the lung, which could help enable earlier diagnosis. Our Ion endoluminal system has received FDA clearance, and OUS regulatory clearances include European certification in accordance with the EU MDR, regulatory clearance in South Korea, and NMPA regulatory clearance in China. We plan to seek additional clearances, approvals, and certifications for our Ion endoluminal system in OUS markets over time.\nThe success of new product introductions depends on a number of factors including, but not limited to, pricing, competition, geographic market and consumer acceptance, the effective forecasting and management of product demand, inventory levels, the management of manufacturing and supply costs, and the risk that new products may have quality or other defects in the early stages of introduction.\nMacroeconomic Environment\nOur future results of operations and liquidity could be materially adversely affected by uncertainty surrounding macroeconomic and geopolitical factors in the U.S. and globally characterized by the supply chain environment, inflationary pressure, elevated interest rates, disruptions in the commodities’ markets as a result of the conflict between Russia and Ukraine and conflicts in the Middle East, including Israel and Iran, and the introduction of or changes in tariffs or trade barriers.\nSupply chain constraints have generally improved to pre-COVID-19 pandemic levels, with some isolated residual stresses, particularly for engineered raw materials and at certain subcontract suppliers that are operationally challenged to meet our production requirements. These isolated instances did not have a material impact during 2024. Additionally, material and labor prices to produce some components remain elevated from historical levels due to market dynamics, demand mix, or general cost inflation within the supply chain. With elevated interest rates, access to credit is more difficult, and any insolvency of certain suppliers, including sole- and single-sourced suppliers, may have heightened continuity risks. Incidents of cybersecurity breaches, which have not significantly impacted our supply chain to date, also remain an active threat to sustained supply continuity. We are actively engaged in activities that seek to mitigate the impact of any supply chain risks and disruptions on our operations.\nSome hospitals continue to experience challenges with staffing and cost pressures that could affect their ability to provide patient care. Additionally, certain hospitals are facing significant financial pressure as supply chain constraints and inflation have driven up operating costs and elevated interest rates have made access to credit more expensive. Hospitals may also be adversely affected by the liquidity concerns as a result of the broader macroeconomic environment. Any or all of these factors could negatively impact the number of da Vinci procedures performed or surgical systems placed and have a material adverse effect on our business, financial condition, or results of operations.\nCOVID-19 has had a negative impact on our procedure volumes during periods with COVID-19 outbreaks due to patient delays in both the diagnosis and treatment of diseases. While such delays have negatively impacted our procedure volumes in periods with COVID-19 outbreaks, we believe that these delays have also resulted in increased procedure volumes during those periods following such outbreaks, due to the treatment of patients in backlogs that were created during the COVID-19 outbreak.\nIn the first fiscal quarter of 2023, COVID-19 resurgences in China negatively impacted our procedure volumes in the region. However, as infections and hospitalization decreased, our procedure volumes recovered. We did not experience significant procedure volume disruptions due to COVID-19 outbreaks in any of our geographic markets during the remainder of 2023. Instead, throughout 2023, we saw a positive impact on procedure volumes and believe that such positive impacts were partially attributable to patients who had deferred treatment returning for diagnosis and treatment.\nDuring 2024, we did not experience noticeable procedure volume disruptions due to COVID-19. We also believe that a large portion of the patients in the backlog that required treatment during the COVID-19 pandemic have now been treated. Therefore, we believe that the impact of patient backlogs was less significant on procedure volumes in 2024 than what was experienced in 2023.\nWe generate up-front revenue from the placement of da Vinci surgical systems through sales or sales-type lease arrangements and recurring revenue over time through fixed-payment or usage-based operating lease arrangements. We also earn recurring revenue from the sales of instruments, accessories, and services.\nThe da Vinci surgical system generally sells for between $0.7 million and $3.1 million, depending on the model, configuration, and geography, and represents a significant capital equipment investment for our customers when purchased. Our instruments and accessories have limited lives and will either expire or wear out as they are used in surgery, at which point they need to be replaced. We generally earn between $800 and $3,600 of instruments and accessories revenue per surgical procedure performed, depending on the type and complexity of the specific procedures performed and the number and type of instruments used. We typically enter into service contracts at the time systems are sold or leased at an annual fee between $100,000 and $225,000, depending on the configuration of the underlying system and the composition of the services offered under the contract. Our system sale arrangements generally include a five-year period of service, with the first year of service provided for free. These service contracts have generally been renewed at the end of the initial contractual service periods.\nWe generate revenue from our Ion endoluminal system in a business model consistent with the da Vinci surgical system model described above. We generate up-front revenue from the placement of Ion systems through sales or sales-type lease arrangements and recurring revenue over time through fixed-payment or usage-based operating lease arrangements. We also earn recurring revenue from the sales of instruments, accessories, and services. The Ion endoluminal system generally sells for between $500,000 and $815,000. Our instruments and accessories have limited lives and will either expire or wear out as they are used in procedures, at which point they need to be replaced. We typically enter into service contracts at the time systems are sold or leased at an annual fee between $55,000 and $80,000.\nAdditionally, as part of our ecosystem of products and services, we provide a portfolio of learning offerings and digital solutions. We do not currently generate material revenue from these offerings.\nRecurring revenue consists of instruments and accessories revenue, service revenue, and operating lease revenue. Recurring revenue increased to $7.04 billion, or 84% of total revenue in 2024, compared to $5.94 billion, or 83% of total revenue in 2023, and $4.92 billion, or 79% of total revenue in 2022.\nInstruments and accessories revenue has grown at a faster rate than systems revenue over time. Instruments and accessories revenue increased to $5.08 billion in 2024, compared to $4.28 billion in 2023 and $3.52 billion in 2022. The increase in instruments and accessories reven",
  "item2_clean": null
}