{
  "source_file": "it-20250930.htm",
  "form_type": "10-Q",
  "item1_clean": null,
  "item7_clean": null,
  "item2_clean": "ITEM 2. MANAGEMENT’S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS\nFORWARD-LOOKING STATEMENTS\nIn addition to historical inf\nBUSINESS OVERVIEW\nGartner, Inc. (NYSE: IT)\ndelivers actionable, objective business and technology insights that drive smarter decisions and stronger performance on an organization’s mission-critical priorities.\nWe deliver our products and services globally through three reportable segments – Business and Technology Insights, Conferences and Consulting, as described below. In the second quarter of 2025, we renamed our segment previously referred to as Research to Business and Technology Insights (or “Insights”) to reflect the nature of the value we provide to clients. In the third quarter of 2025, we changed the structure of our internal organization and concluded that Gartner Digital Markets (\"Digital Markets\") was an operating segment but does not meet the criteria of a reportable segment. Accordingly, Digital Markets results are now included in \"Other\" where segment information is provided. Digital Markets was previously included in our Insights segment. Prior periods have been recast to conform to current period presentation.\nequips executives and their teams from every function and across all industries with actionable, objective business and technology insights, guidance and tools. Our experienced experts deliver all this value informed by an unmatched combination of practitioner-sourced and data-driven research to help our clients address their mission critical priorities.\nprovides executives and teams across an organization the opportunity to learn, share and network. From our Gartner Symposium/Xpo series, to industry-leading conferences focused on specific business roles and topics, to peer-driven sessions, our offerings enable attendees to experience the best of Gartner insights and guidance.\nserves senior executives leading technology-driven strategic initiatives leveraging the power of Gartner’s actionable, objective insights. Through custom analysis and on-the-ground support we enable optimized technology investments and stronger performance on our clients’ mission critical priorities.\nAs of September 30, 2025, we had 20,854 employees globally, a decrease of 0.6% from September 30, 2024.\nOur Insights contract value with the US federal government was approximately $165.0 million at September 30, 2025. Over 85% of our US federal contracts have transacted in the first three quarters of 2025, and slightly less than half of that contract value was retained. In addition to the non-renewals, we have received notices of termination-for-convenience from various US government agencies for approximately $8.0 million of contracts that are primarily scheduled to expire in the fourth quarter of 2025.\nAs the current geopolitical environment remains unpredictable, we continue to monitor and evaluate the impact, both direct and indirect, of government actions that could adversely impact our business operations and financial performance.\nOn July 4, 2025, the One Big Beautiful Bill Act (the “OBBBA”) was enacted in the U.S. The OBBBA includes significant provisions, such as the permanent extension of certain expiring provisions of the Tax Cuts and Jobs Act, modifications to the international tax framework and the restoration of favorable tax treatment for certain business provisions. The legislation has multiple effective dates, with certain provisions effective in 2025 and others implemented through 2027. OBBBA did not have a material impact on our consolidated financial results in the current period. We are currently assessing and will continue to assess and reflect the impact of OBBBA on its future consolidated financial statements as appropriate.\nOur most recent annual impairment test of goodwill was a quantitative analysis conducted during the quarter ended September 30, 2025 that indicated an impairment of the Company's Digital Markets reporting unit. During the three months ended September 30, 2025, ongoing weakness in the market as well as changes in our internal organization structure prompted a revision to the long-term earnings forecast for the Digital Markets business. During the three months ended September 30, 2025, a goodwill impairment loss of $150.0 million was recognized in the Digital Markets reporting unit. The fair value of that reporting unit was estimated using a combination of the expected present value of future cash flows and market approach.\nBUSINESS MEASUREMENTS\nhat the following business measurements are important performance indicators for our reportable business segments:\nBUSINESS SEGMENT\nBUSINESS MEASUREMENT\n\nrepresents a measure of client satisfaction and renewed business relationships at a specific point in time. Client retention is calculated on a percentage basis by dividing our current clients, who were also clients a year ago, by all clients from a year ago. Client retention is calculated at an enterprise level, which represents a single company or customer.\nWallet retention rate\nrepresents a measure of the amount of contract value we have retained with clients over a twelve-month period. Wallet retention is calculated on a percentage basis by dividing the contract value of our current clients, who were also clients a year ago, by the contract value from a year ago, excluding the impact of foreign currency exchange. When wallet retention exceeds client retention, it is an indication of retention of higher-spending clients, or increased spending by retained clients, or both. Wallet retention is calculated at an enterprise level, which represents a single company or customer.\nNumber of destination conferences\nrepresents the total number of hosted in-person conferences completed during the period. Single day, local meetings are excluded.\nNumber of destination conferences\nrepresents the total number of people who attend in-person conferences. Single day, local meetings are excluded.\nrepresents future revenue to be derived from in-process consulting and benchmark analytics engagements.\nrepresents a measure of productivity of our consultants. Utilization rates are calculated for billable headcount on a percentage basis by dividing total hours billed by total hours available to bill.\nEXECUTIVE SUMMARY OF OPERATIONS AND FINANCIAL POSITION\nThe fundamentals of our strategy include a focus on creating actionable business and technology insights for executives and their teams, delivering innovative and highly differentiated product offerings, building a strong sales capability, providing world class client service with a focus on client engagement and retention, and continuously improving our operational effectiveness.\nWe had total revenues of $1.5 billion during the third quarter of 2025, an increase of 3% compared to the third quarter of 2024. During the third quarter of 2025, compared to the third quarter of 2024, revenues for Insights increased by 5%, Conferences revenue decreased by 2%, and Consulting revenue decreased by 3%. For a more complete discussion of our results by segment, see Segment Results below.\nFor the third quarter of 2025 and 2024, we had net income of $35.4 million and $415.0 million, respectively, and diluted net income per share of $0.47 and $5.32, respectively. The decrease in 2025 is primarily due to the goodwill impairment loss in 2025 and the gain on event cancellation insurance claims in 2024. Cash provided by operating activities was $1.0 billion and $1.1 billion during the nine months ended September 30, 2025 and 2024, respectively. As of September 30, 2025, we had $1.4 billion of cash and cash equivalents and approximately $0.7 billion of available borrowing capacity on our revolving credit facility. For a more complete discussion of our cash flows and financial position, see the Liquidity and Capital Resources section below.\nCRITICAL ACCOUNTING POLICIES AND ESTIMATES\nRECENTLY ISSUED ACCOUNTING STANDARDS\nThe FASB has issued accounting standards that have not yet become effective and that may impact the Company’s consolidated financial statements or its disclosures in future periods. Note 1 — Business and Basis of Presentation in the Notes to Condensed Consolidated Financial Statements provides information regarding those accounting standards.\nRESULTS OF OPERATIONS\nConsolidated Results\nThe table below presents an analysis of selected line items and period-over-period changes in our interim Condensed Consolidated Statements of Operations for the periods indicated (in thousands).\nThree Months Ended September 30, 2025\nThree Months Ended September 30, 2024\n\nCost of services and product development\nSelling, general and administrative\nAmortization of intangibles\nAcquisition and integration charges\nInterest expense, net\nGain on event cancellation insurance claims\nOther (expense) income, net\nLess: Provision for income taxes\nIn addition to GAAP results, we provide foreign currency neutral dollar amounts and percentages for our revenues, certain expenses, contract values and other metrics. These foreign currency neutral dollar amounts and percentages eliminate the effects of exchange rate fluctuations and thus provide a more accurate and meaningful trend in the underlying business performance being measured. We calculate foreign currency neutral dollar amounts by converting the underlying amounts in local currency for different periods into U.S. dollars by applying the same foreign exchange rates to all periods presented.\nTotal revenues for the three months ended September 30, 2025 were $1.5 billion, an increase of $39.8 million, or 3% compared to the same period in 2024 on a reported basis and 1% excluding the foreign currency impact. Total revenues for the nine months ended September 30, 2025 were $4.7 billion, an increase of $0.2 billion, or 4% compared to the same period in 2024 on both a reported basis and excluding the foreign currency impact. Refer to the section of this MD&A below entitled “Segment Results” for a "
}