{
  "source_file": "ivz-20250930.htm",
  "form_type": "10-Q",
  "item1_clean": null,
  "item7_clean": null,
  "item2_clean": "Results of Operations\nForward-Looking Statements\nThe following Management’s Discussion and Analysis of Financial Condition and Results of Operations should be read in conjunction with the Condensed Consolidated Financial Statements and related Notes thereto, which appear elsewhere in this Report. Except for the historical financial information, this Report may include statements that constitute “forward-looking statements” under the United States (U.S.) securities laws. Forward-looking statements include information concerning future results of our operations, expenses, earnings, liquidity, cash flow, capital expenditures, and AUM that could differ materially from actual results due to known and unknown risks and other important factors, including, but not limited to, industry or market conditions, geopolitical events including wars, global trade tensions, tariffs, natural disasters, and pandemics or health crises and their respective potential impact on the company, acquisitions and divestitures, debt and our ability to obtain additional financing or make payments, regulatory developments, demand for and pricing of our products, the prospects for certain legal contingencies, and other aspects of our business or general economic conditions. In addition, when used in this Report or such other documents or statements, words such as “believes,” “expects,” “anticipates,” “intends,” “plans,” “estimates,” “projects,” “forecasts,” and future or conditional verbs such as “will,” “may,” “could,” “should,” and “would” as well as any other statement that necessarily depends on future events, are intended to identify forward-looking statements. None of this information should be considered in isolation from, or as a substitute for, historical financial statements.\nYou may obtain these reports from the SEC’s website at\n. We expressly disclaim any obligation to update the information in any public disclosure if any forward-looking statement later turns out to be inaccurate.\nIn this Report, unless otherwise specified, the terms “we,” “our,” “us,” “company,” “firm,” and “Invesco” refer to Invesco Ltd., a company incorporated in Bermuda, and its consolidated entities.\nThe following executive overview summarizes the significant trends affecting our results of operations and financial condition for the periods presented. This overview and the remainder of this management’s discussion and analysis and supplements should be read in conjunction with the Condensed Consolidated Financial Statements of Invesco Ltd. and the notes thereto contained elsewhere in this Report. The company’s financial results are impacted by the fluctuations in exchange rates against the U.S. Dollar, as discussed in the “Results of Operations” section as applicable.\nThe company is an independent investment management firm dedicated to delivering a superior investment experience. Our comprehensive range of active, passive and alternative investment capabilities has been constructed over many years to help clients achieve their investment objectives. We draw on this comprehensive range of capabilities to provide solutions designed to deliver key outcomes aligned to client needs. One of Invesco's core strengths, and a key differentiator for the company within the industry, is our diversification across investment capabilities, distribution channels and geographies. This broad diversification helps to mitigate some of the impact of different market cycles on Invesco and enables the company to take advantage of growth opportunities in various markets and channels.\n\nPassive AUM by Client Domicile\nThree months ended September 30,\nAPAC\nEMEA\nAPAC\nEMEA\nBeginning Assets (July 1)\nNet flows in non-management fee earning AUM\nMarket gains and losses\nForeign currency translation\nEnding Assets (September 30)\nNine months ended September 30,\nAPAC\nEMEA\nAPAC\nEMEA\nBeginning Assets (January 1)\nNet flows in non-management fee earning AUM\nMarket gains and losses\nForeign currency translation\nEnding Assets (September 30)\n(1) Channel refers to the internal distribution channel from which the AUM originated. Retail AUM represents AUM distributed by the company’s retail sales teams. Institutional AUM represents AUM distributed by our institutional sales teams. This aggregation is viewed as a proxy for presenting AUM in the retail and institutional markets in which the company operates.\n(2) Client domicile groups AUM by the domicile of the underlying clients.\n(3) Investment capabilities are descriptive groupings of AUM by investment strategy.\n(4) ETFs and Index includes ETFs and Indexed Strategies and excludes Invesco QQQ Trust.\n(5) Fundamental Fixed Income includes Fixed Income products, including certain ETFs managed within this capability.\n(6) Fundamental Equities includes Equity products.\n(7) Private Markets includes Private Credit and Real Estate investments comprised primarily of Real Estate, CLOs, Private Credit and listed real assets, including certain ETFs managed within this capability.\n(8) Beginning in the first quarter of 2025, products managed by Invesco Great Wall and Invesco Asset Management (India) Private Limited are included in the newly defined China JV & India investment capability. Other products previously categorized under the APAC Managed investment capability are included in the other investment capabilities based on their investment strategies. Beginning assets as of January 1, 2025 and the comparative period reflect the current period presentation.\n(9) Multi-Asset/Other includes Global Asset Allocation, Invesco Quantitative Strategies, Global Targeted Returns, Solutions, intelliflo, and UITs, including certain ETFs managed within this capability.\n(10) Global Liquidity is comprised mainly of Money Market funds.\n(11) QQQ represents assets held within Invesco QQQ Trust.\n\nThird-Party Distribution, Service and Advisory\nThird-party distribution, service and advisory expenses were $558.3 million for the three months ended September 30, 2025 as compared to $499.6 million for the three months ended September 30, 2024. The increase was due to an increase in Investment management fees and pass-through Service and distribution costs resulting from higher average AUM.\nThird-party distribution, service and advisory expenses were $1,568.0 million for the nine months ended September 30, 2025 as compared to $1,499.0 million for the nine months ended September 30, 2024. The increase was due to an increase in Investment management fees and pass-through Service and distribution costs resulting from higher average AUM.\nEmployee Compensation\nEmployee compensation was $521.6 million for the three months ended September 30, 2025 as compared to $625.4 million for the three months ended September 30, 2024. The decrease was primarily due to a one-time acceleration of $147.6 million in expense during the third quarter of 2024 resulting from changes to the retirement criteria for vesting of outstanding common share-based awards and other long-term awards (collectively, Long-term awards), partially offset by higher benefits and other compensation costs of $13.9 million and higher variable compensation costs of $29.2 million primarily driven by improved operating results.\nEmployee compensation was $1,496.6 million for the nine months ended September 30, 2025 as compared to $1,550.4 million for the nine months ended September 30, 2024. The impact of foreign exchange rate movements increased Employee compensation by $8.1 million during the nine months ended September 30, 2025 as compared to the nine months ended September 30, 2024. After allowing for foreign exchange rate changes, there was a decrease in Employee compensation of $61.9 million. The decrease was primarily due to the above noted acceleration of expense for outstanding Long-term awards of $147.6 million during 2024, partially offset by $16.9 million of severance expense related to the reorganization of the fundamental equities investment teams, an increase of $12.5 million in benefits and other compensation costs, and an increase of $55.4 million in variable compensation costs primarily driven by improved operating results.\nHeadcount at September 30, 2025 was 8,368 (September 30, 2024: 8,524).\nMarketing expenses were $20.1 million for the three months ended September 30, 2025 as compared to $18.9 million for the three months ended September 30, 2024.\nMarketing expenses were $60.2 million for the nine months ended September 30, 2025 as compared to $57.6 million for the nine months ended September 30, 2024.\nProperty, Office and Technology\nProperty, office and technology expenses were $109.2 million for the three months ended September 30, 2025 as compared to $119.0 million for the three months ended September 30, 2024. The decrease was due to lower property and office costs of $5.2 million as well as lower technology costs of $4.6 million.\nProperty, office and technology expenses were $341.3 million for the nine months ended September 30, 2025 as compared to $353.0 million for the nine months ended September 30, 2024. The decrease was primarily due to lower property and office costs.\nGeneral and Administrative\nGeneral and administrative expenses were $151.3 million for the three months ended September 30, 2025 as compared to $140.8 million for the three months ended September 30, 2024. The increase was primarily due to higher costs of $14.6 million related to newly launched CIP, partially offset by lower professional fees.\nGeneral and administrative expenses were $427.8 million for the nine months ended September 30, 2025 as compared to $459.7 million for the nine months ended September 30, 2024. The decrease was primarily due to the expense related to the accrual of a $50 million liability related to the settlement of certain regulatory matters in the second quarter of 2024, partially offset by higher costs of $27.9 million related to newly launched CIP. The decrease was also driven by lower professional fees.\n\nOther Income and Ex"
}