{
  "source_file": "jec-20250926.htm",
  "form_type": "10-K",
  "item1_clean": "help clients operate more efficiently, safely and intelligently. Through the expertise of our people and ongoing investment in artificial intelligence (AI) and next-generation digital solutions, we empower our clients' decision-making across the entire asset lifecycle – from capital planning and operations to cybersecurity and operational technology. Our capabilities in data analytics, digital architecture, advisory and transformation, software development and cybersecurity enable clients to unlock the full value of their data and digital infrastructure to improve performance, resilience and sustainability.\nThrough our strategic partnership with PA Consulting, we are expanding our high-end advisory services and deploying our collective strengths to help clients adapt, innovate and transform. Together, we deliver integrated support across the full project lifecycle — from early-stage strategy to implementation — enabling clients to tackle complex challenges, accelerate sustainable growth and shape a smarter, more resilient future.\nA streamlined, focused business\nPrior to the Separation Transaction, the Company's four operating segments were comprised of its two global lines of business (\"LOBs\"): Critical Mission Solutions (\"CMS\") and People Places and Solutions (\"P&PS\"), its business unit Divergent Solutions (\"DVS\") and its majority investment in PA Consulting. After the Separation in fiscal year 2024, we reorganized P&PS and our remaining DVS businesses into a more streamlined operating model, Infrastructure & Advanced Facilities (\"I&AF\"), which enables our collective business teams to collaborate more horizontally. Our CMS LOB and portions of DVS which were included in the Separation are now reported as discontinued operations.\nOur Values in Action\nJacobs' Ethics and Code of Conduct, rooted in our values, set clear standards and support to guide decision-making and ensure we conduct our business with integrity.\nAt Jacobs, sustainability means delivering thoughtful solutions that meet today’s needs while enabling economies,\ncommunities and the environment to thrive in the future. Our PlanBeyond® sustainable business approach aligns with our purpose to create a more connected, sustainable world. This approach has strengthened client relationships, aiming to create new opportunities and embed resilience into our global strategy. Building on this foundation,\nfocuses on transparency, measurable outcomes and trusted delivery, guiding our path forward with our stakeholders, including our clients, partners and people.\nDriving positive impact\nOperating in more than 40 countries, we view sustainability and resilience as key differentiators and drivers of impact. Demand for solutions that address complex, interconnected challenges continues to grow across infrastructure, energy, advanced manufacturing and health. By embedding sustainability into our solutions, we help clients’ businesses and assets remain resilient. In fiscal 2025, we launched our\ntool, which generates recommendations to integrate sustainability into our projects to enhance their positive impact and resilience. Complimentary tools like\nClimate Risk Manager\nKaleidoscope and Intelligent O&M\nassess climate risks, carbon impacts and system vulnerabilities to inform critical project decisions.\nWe deliver cross-cutting solutions across seven interconnected capabilities: decarbonization & greenhouse gas management; adaptation & resilience; sustainable built environments; sustainable business; social value; nature positive; and energy transition. Together, these enable systems-level impact for clients and communities worldwide.\nTransparency and accountability\nWe are committed to leading by example in our own operations — advancing a suite of strategic actions to reduce our carbon footprint. Our current commitment, including sourcing 100% renewable electricity and our net-zero target validated by the Science Based Targets initiative, underscore our progress across our operations and supply chain.\nWe have invested in technology to enhance virtual collaboration and help mitigate business travel and employee commuting carbon emissions. We also invested in tools and technology to help our people consider when business travel is essential and make more sustainable choices when it is necessary.\nAs businesses worldwide experience increasing stakeholder expectations and sustainability regulatory requirements, corporate transparency and accountability remains central. We report on our sustainability performance and corporate responsibility initiatives in accordance with globally recognized frameworks when required by applicable regulations, or, in the absence of mandated standards, we follow widely accepted market practices.\nPositively impacting tomorrow’s communities\nWe work globally with our clients, partners and supply chains to deliver solutions that seek to improve how people live, move and thrive, aiming to foster health and well-being for all occupants, promoting a sustainable and thriving future.\nWe invest in local communities globally, collaborating with charities and not-for-profit organizations to make a positive impact and live our values. Through Collectively℠, our global giving and volunteering program, we empower employees to support causes aligned to our values, through paid volunteer time, donation matching and grant nomination. In fiscal 2025, our employees mobilized support for communities, including those impacted by natural disasters, water insecurity and conflict. For example, in 2025 a team of 10 Jacobs volunteers partnered with non-profit Bridges to Prosperity to build a suspended bridge across Rwanda’s Gatongati River — our 17th bridge build — providing safe, year-round access to education, healthcare, markets and other essential services for more than 8,300 people.\nWe also invest in the next generation through our science, technology, engineering, arts and mathematics (STEAM) education and engagement programs promoting sustainability learning among young people and providing information to inspire future careers in STEAM.\nIn 2025, Jacobs sponsored the International Science and Engineering Fair — a premier global competition engaging students from more than 300 affiliated science fairs worldwide and advancing the future talent pipeline.\nIn fiscal 2025, we donated over $2.9 million to 2,300+ charities across 34 countries. Our employees tracked more than 7,000 volunteer hours including nearly 4,000 STEAM volunteer hours.\nSocial value advisory in our client solutions\nWe also deliver social value strategies and services that help clients realize social value opportunities through their projects and services by embedding and measuring social, economic and environmental benefit generation into project delivery.\nOur fully owned subsidiary, Simetrica-Jacobs, specializes in social value, wellbeing research and impact evaluation — measuring and quantifying social value and impacts to help directly inform investment decisions and delivery models. Simetrica-Jacobs deploys internationally endorsed methods set out by the Organisation for Economic Co-operation and Development and government-produced guidelines, including the U.K. Government’s HM Treasury Green Book.\nBy combining this expertise with our infrastructure delivery, we help clients understand how they can transform local decision-making, shape inclusive investments and create lasting social change.\nWe maintain agile and disciplined capital deployment\nM&A and Divestitures\nConsistent with our profitable growth strategy, Jacobs pursues acquisitions, divestitures, strategic investments and other transactions to maximize long-term value by continuing to reshape our portfolio to higher value solutions and accelerating profitable growth strategy. The Company has recently made the following acquisitions, strategic investments and divestitures:\nOn September 27, 2024, Jacobs completed the Separation Transaction, pursuant to which it spun off its CMS and C&I businesses and then subsequently merged those businesses with Amentum Parent Holdings LLC. Amentum, the surviving entity of the Separation Transaction, is now an independent public company with common stock listed on the New York Stock Exchange under the symbol “AMTM”. For further information regarding separation activities that took place in fiscal 2025, see Note 14-\nDiscontinued Operations\nOn March 2, 2021, Jacobs completed the strategic investment of a 65% interest in PA Consulting, a U.K.-based leading innovation and transformation consulting firm.\nDuring fiscal 2025, the Company repurcha\ned $754.1 million in shar\nShareholder Dividends\nDuring fiscal 2025, the Com\npany paid dividends of $0.29 per share in the first quarter and $0.32 per share in the second, third and fourth quarters.\nThe services we provided to our end markets in fiscal 2025 fall into the following two operating segments: 1) Infrastructure & Advanced Facilities and 2) our majority investment in PA Consulting.\nFor additional information regarding our segments, including information about our financial results by segment and financial results by geography, see Note 19-\nInfrastructure & Advanced Facilities (I&AF)\nIn fiscal 2025, Jacobs' Infrastructure & Advanced Facilities business provided end-to-end solutions for our clients’ most complex challenges related to energy security, environmental resilience, safe and reliable transportation, buildings and infrastructure, integrated water management and biopharmaceutical manufacturing. In doing so, we combine deep experience in the following end markets - Critical Infrastructure, Water & Environmental and Life Sciences & Advanced Manufacturing.\nOur core skills revolve around consulting, planning, architecture, design, engineering, infrastructure delivery services\n\nmotorsports, energy and telecom sectors. Prior to the Separation Transaction, the DVS business unit served as the core foundation for developing and delivering innovative, next-generation cloud, cyber, data and digital technologies. DVS clients included government agencies and commercial clients in the U.S. and international markets. Certain portions of the DVS business related to advising on digital strategy and transformation and developing digital solutions that facilitate capital, operational and cybersecurity decisions for our clients across our segments and their end markets were retained and are now part of I&AF.\nSignificant Customers\nThe following table sets forth the percentage of total revenues from continuing operations earned directly or indirectly from agencies of the U.S. federal government for each of the last three fiscal years:\n\nAll of the officers listed in the preceding table serve in their respective capacities at the pleasure of the Board of Directors of the Company.\nMr. Pragada rejoined the Company in February 2016 after serving as President and Chief Executive Officer of The Brock Group since August 2014. From March 2006 to August 2014, Mr. Pragada served in executive and senior leadership capacities with the Company. Mr. Pragada served as President and Chief Operating Officer from November 2019 until he succeeded Steve Demetriou as Chief Executive Officer and was elected as a Director of the Company in January 2023. In September 2024, after completion of the Separation Transaction, Mr. Pragada assumed the additional position of Chair of the Jacobs Board of Directors.\nMr. Nathamuni joined the Company in June 2024 as Chief Financial Officer. Mr. Nathamuni served as Chief Financial Officer at Cirrus Logic Inc. from 2022 to 2024. Prior to that, he served as Head of Corporate Finance, M&A, investor relations and IT for Arista Networks. From 2012 to October 2021, Mr. Nathamuni served in several roles at Maxim Integrated Products, Inc. including as Vice President of M&A and corporate development and head of investor relations. He also held a variety of positions at J.P. Morgan, Synopsys, Synplicity and QuickLogic.\nMs. Caruso joi",
  "item7_clean": "Item 7. MANAGEMENT'S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS\nCritical Accounting Policies and Estimates\nIn order to better understand the changes that occur to key elements of our financial condition, results of operations and cash flows, a reader of this Management’s Discussion and Analysis of Financial Condition and Results of Operations (“MD&A”) should be aware of the critical accounting policies we apply in preparing our consolidated financial statements.\nThe consolidated financial statements contained in this report were prepared in accordance with U.S. GAAP. The preparation of our consolidated financial statements and the financial statements of any business performing long-term professional services, engineering and construction-type contracts requires management to make certain estimates and judgments that affect both the entity’s results of operations and the carrying values of its assets and liabilities. Although our significant accounting policies are described in Note 2-\nSignificant Accounting Policies\nRevenue Accounting for Contracts\nThe Company recognizes engineering, procurement, and construction contract revenue over time, as performance obligations are satisfied, due to the continuous transfer of control to the customer in accordance with ASC 606,\nRevenue from Contracts with Customers\n. Contracts that include engineering, procurement and construction services are generally accounted for as a single deliverable (a single performance obligation). In some instances, the Company’s services associated with a construction activity are limited only to specific tasks such as customer support, consulting or supervisory services. In these instances, the services are typically identified as separate performance obligations.\nThe Company recognizes revenue using the percentage-of-completion method, based primarily on contract costs incurred to date compared to total estimated contract costs. Estimated contract costs include the Company’s latest estimates using judgments with respect to labor hours and costs, materials, and subcontractor costs. The percentage-of-completion method (an input method) is the most representative depiction of the Company’s performance because it directly measures the value of the services transferred to the customer. Subcontractor materials, labor and equipment and, in certain cases, customer-furnished materials and labor and equipment are included in revenue and cost of revenue when management believes that the company is acting as a principal rather than as an agent (e.g., the Company integrates the materials, labor and equipment into the deliverables promised to the customer or is otherwise primarily responsible for fulfillment and acceptability of the materials, labor and/or equipment). Under the typical payment terms of our engineering, procurement and construction contracts, amounts are billed as work progresses in accordance with agreed-upon contractual terms at periodic intervals (e.g., biweekly or monthly) and customer payments are typically due within 30 to 60 days of billing, depending on the contract.\nFor service contracts, the Company recognizes revenue over time using the cost-to-cost percentage-of-completion method. In some instances where the Company is standing ready to provide services, the Company recognizes revenue ratably over the service period. When the Company has operations and maintenance or secondment contracts that do not contain variable consideration or have significant timing differences between cash payment and performance, the practical expedient method is applied for revenue recognition. Under the typical payment terms of our service contracts, amounts are billed as work progresses in accordance with agreed-upon contractual terms, and customer payments are typically due within 30 to 60 days of billing, depending on the contract.\nDirect cost of contracts include all costs incurred in connection with and directly for the benefit of client contracts, including depreciation and amortization relating to assets used in providing the services required by the related projects. The level of direct cost of contracts may fluctuate between reporting periods due to a variety of factors, including the amount of pass-through costs we incur during a period. On those projects where we are acting as principal for subcontract labor or third-party materials and equipment, we reflect the amounts of such items in both revenues and costs (and we refer to such costs as “pass-through costs”).\nAccounting for Pension Plans\nThe accounting for pension plans requires the use of assumptions and estimates in order to calculate periodic pension cost and the value of the plans’ assets and liabilities. These assumptions include discount rates, investment returns, and projected salary increases, among others. The actuarial assumptions used in determining the funded status of the respective plans are provided in Note 13-\nPension and Other Post Retirement Benefit Plans\nThe expected rates of return on plan assets ranged from\nfor fiscal 2025 and range from\nor fiscal 2026. We believe the range of rates selected for fiscal 2026 reflects the long-term returns expected on the plans’ assets, considering recent market conditions, projected rates of inflation, the diversification of the plans’ assets, and the expected real rates of market returns. The discount rates used to compute plan liabilities ranged from\nin fiscal 2025 and range from\nin fiscal 2026. These assumptions represent the Company’s best estimate of the rates at which its pension obligations could be effectively settled.\nChanges in the actuarial assumptions often have a material effect on the values assigned to plan assets and liabilities, and the associated pension expense. For example, if the discount rate used to value the net pension benefit obligation (“PBO”) at September 26, 2025 was lower or higher by 1.0%, the PBO would have been higher or lower, respectively, at that date by approximately\nfor non-U.S. plans, and by approximatel\ny $19.5 million for U.S. plans. If the expected return on plan assets was lower or higher by 1.0%, the net periodic pension cost for fiscal 2025 would be higher or lower, respectively, by approximately $13.1 million for non-U.S. plans, and by approximately $2.7 million\nfor U.S. plans. Differences between\nactuarial assumptions and actual performance (i.e., actuarial gains and losses) that are not recognized as a component of net periodic pension cost in the period in which such differences arise are recorded to accumulated other comprehensi\nve loss and are recognized as part of net periodic pension cost in future periods in accordance with U.S. GAAP. Management monitors trends in the marketplace within which our pension plans operate in an effort to assure the reasonableness of the actuarial assumptions used.\nRedeemable Noncontrolling Interests\nIn connection with the PA Consulting investment in March 2021, the Company recorded redeemable noncontrolling interests, representing the interest holders' initial 35% equity interest in the form of preferred and common shares of PA Consulting. The preferred shares are entitled to a cumulative annual compounding 12% dividend based on the outstanding preferred share subscription price. These noncontrolling interest holders have certain option rights to put the preferred and common share interests back to the Company at a value based on the fair value of PA Consulting (the redemption values). The primary inputs and assumptions impacting the fair value of PA Consulting include projections of revenue and earnings before interest, taxes, depreciation and amortization and discount rates applied thereto. Additionally, the Company has an option to call the interests for certain individual shareholders in certain circumstances. Because the interests are redeemable at the option of the holders and not solely within the control of the Company, the Company has classified the interests in redeemable noncontrolling interests in the mezzanine section of its Consolidated Balance Sheet at their redemption values. The optional redemption features may become exercisable no earlier than five years from the March 2, 2021 closing date, or upon the occurrence of certain other events.\nThe Company has deemed these interests probable of becoming redeemable in the future and requiring their measurement at the greater of (i) the redemption amount that would be paid if settlement occurred at the balance sheet date, or (ii) the historical value resulting from the original acquisition date fair value plus the impact of any earnings or loss attribution amounts, including dividends.\nThe fair value of the PA Consulting redeemable noncontrolling interest is determined using a combination of the income and market approaches. Under the income approach, fair value is determined by using the projected discounted cash flows of PA Consulting. Under the market approach, the fair value is determined by reference to guideline companies that are reasonably comparable to PA Consulting, with the fair value estimated based on those companies' valuation multiples of earnings before interest, taxes, depreciation and amortization.\nLitigation, Investigations, and Insurance\nIn the normal course of business, we make contractual commitments, and on occasion we are a party in litigation or arbitration proceedings. The litigation in which we are involved primarily includes personal injury claims, professional liability claims, and breach of contract claims. We are also routinely subject to investigations and audits.\nWe maintain insurance coverage for most insurable aspects of our business and operations. Our insurance programs have varying coverage limits depending upon the type of insurance and include certain conditions and exclusions which insurance companies may raise in response to any claim that the Company brings. We have also elected to retain a portion of certain losses, claims and liabilities that occur through the use of various deductibles, limits, and retentions under our insurance programs and utilize a number of internal financing mechanisms for these self-insurance arrangements including the operation of certain captive insurance entities. As a result, we may be subject to a future liability for which we are only partially insured or completely uninsured. We intend to mitigate any such future liability by continuing to exercise prudent business judgment in negotiating the terms and conditions of the contracts which the Company enters with its clients. Our insurers are also subject to business risk and, as a result, one or more of them may be unable to fulfill their insurance obligations due to insolvency or otherwise.\nOur Consolidated Balance Sheets include amounts representing our probable estimated liability relating to such claims, litigation, audits, and investigations. Our estimates of probable liabilities require us to make assumptions related to potential losses regarding our determination of amounts considered probable and estimable.\nThe Company believes, after consultation with counsel, that such litigation, U.S. government contract-related audits, investigations and claims, and income tax audits and investigations should not have a material adverse effect on our consolidated financial statements, beyond amounts currently accrued.\nJACOBS SOLUTIONS INC. AND SUBSIDIARIES\nCONSOLIDATED STATEMENTS OF EARNINGS\nFor the Fiscal Years Ended September 26, 2025, September 27, 2024 and September 29, 2023\n(In thousands, except per share information)\nDirect cost of contracts\nSelling, general and administrative expenses\nOther Income (Expense):\nLoss on extinguishment of debt\nMiscellaneous (expense) income, net\nTotal other (expense) income, net\nEarnings from Continuing Operations Before Taxes\nIncome Tax Expense for Continuing Operations\nNet Earnings of the Group from Continuing Operations\nNet (Loss) Earnings of the Group from Discontinued Operations, net of tax\nNet Earnings of the Group\nNet Earnings Attributable to Noncontrolling Interests from Continuing Operations\nNet Earnings Attributable to Redeemable Noncontrolling Interests\nNet Earnings Attributable to Jacobs from Continuing Operations\nNet Earnings Attributable to Noncontrolling Interests from Discontinued Operations\nNet (Loss) Earnings Attributable to Jacobs from Discontinued Operations\nNet Earnings Attributable to Jacobs\nNet Earnings Per Share:\nBasic Net Earnings from Continuing Operations Per Share\nBasic Net (Loss) Earnings from Discontinued Operations Per Share\nBasic Earnings Per Share\nDiluted Net Earnings from Continuing Operations Per Share\nDiluted Net (Loss) Earnings from Discontinued Operations Per Share\nDiluted Earnings Per Share\nNote: Earnings per share amounts may not add due to rounding.\nNet earnings attributable to the Company from continuing operations for fiscal 2025 were $313.3 million (or $2.58 per diluted share), a decrease of $299.5 million, or 48.9%, from $612.8 million (or $4.79 per diluted share) for the prior year. Our reported net earnings for the current year were favorably impacted by higher gross profit of $152.2 million compared to the prior year, primarily driven by stronger performance in our Infrastructure & Advanced Facilities (\"I&AF\") operating segment, specifically in the Advanced Facilities, Europe and Asia, Pacific and Middle East (\"APME\") businesses, as well as growth in our PA Consulting operating segment, as discussed below in the\nSegment Financial Information\nsection. While current year results reflected higher year-over-year underlying gross profit, the Company’s results from continuing operations for fiscal 2025 were unfavorably impacted by an increase in miscellaneous expense of $409.1 million primarily as a result of $227.3 million in mark-to-market losses relating to our investment in Amentum stock in connection with the Separation Transaction compared to $186.9 million in gains relating to the same investment in the prior year. Fiscal 2025 comparative results were also unfavorably impacted by a prior year realized gain of $35.2 million from settlement of interest rate swaps in fiscal 2024 and $20.5 million in discounts and expenses recorded to Loss on extinguishment of debt associated with our Equity-for-Debt Transaction on March 13, 2025, where the Company exchanged shares of our investment in Amentum Holdings, Inc. for a principal amount of term loans under the 2021 Term Loan Facility, which term loans were immediately extinguished (see Note 9-\nDiscontinued Operations\n). These unfavorable impacts were partly offset by an increase in TSA-related income and a decrease in interest expense included in miscellaneous expense as well as a decrease in pre-tax Restructuring and other charges and transaction costs of $104.6 million reported in Selling, general & administrative (\"SG&A\") expenses compared to the fiscal 2024 period, primarily associated with the Separation Transaction (mainly professional services and employee separation costs), which are discussed in Note 16-\nRestructuring and Other Charges\nIncome taxes were higher in the current year by $84.1 million primarily due to $51.2 million in tax expense from higher year-over-year pre-tax book income after excluding the permanent book-tax difference for the mark-to-market and other related transactions associated with our investment in Amentum stock. Further, our income tax expense was unfavorably impacted by a prior year discrete income tax benefit of $61.6 million related to the election to treat an Australian subsidiary as a corporation versus a partnership for U.S. tax purposes, which resulted in the derecognition of a deferred tax liability in fiscal year 2024. The overall higher income tax expense was partially offset by a return-to-provision income tax benefit of $16.2 million mainly attributable to additional research and development credits claimed on the U.S. federal tax return.\nNet (loss) earni",
  "item2_clean": null
}