{
  "source_file": "jec-20250627.htm",
  "form_type": "10-Q",
  "item1_clean": null,
  "item7_clean": null,
  "item2_clean": "motorsports, energy and telecom sectors. Prior to the Separation Transaction, the DVS business unit served as the core foundation for developing and delivering innovative, next-generation cloud, cyber, data and digital technologies. DVS clients included government agencies and commercial clients in the U.S. and international markets. Certain portions of the DVS business were retained and are now part of I&AF, which include advising digital strategy and transformation and developing digital solutions that facilitate capital, operational and cybersecurity decisions for our clients across our segments and their markets.\nResults of Operations for the three and nine months ended June 27, 2025 and June 28, 2024\n(in thousands, except per share information)\nFor the Three Months Ended\nFor the Nine Months Ended\nDirect cost of contracts\nSelling, general and administrative expenses\nOther Income (Expense):\nLoss on extinguishment of debt\nMiscellaneous income (expense), net\nTotal other income (expense), net\nEarnings from Continuing Operations Before Taxes\nIncome Tax Expense from Continuing Operations\nNet Earnings of the Group from Continuing Operations\nNet (Loss) Earnings of the Group from Discontinued Operations, net of tax\nNet Earnings of the Group\nNet (Earnings) Loss Attributable to Noncontrolling Interests from Continuing Operations\nNet Earnings Attributable to Redeemable Noncontrolling Interests\nNet Earnings Attributable to Jacobs from Continuing Operations\nNet Earnings Attributable to Noncontrolling Interests from Discontinued Operations\nNet (Loss) Earnings Attributable to Jacobs from Discontinued Operations\nNet Earnings Attributable to Jacobs\nNet Earnings Per Share:\nBasic Net Earnings from Continuing Operations Per Share\nBasic Net (Loss) Earnings from Discontinued Operations Per Share\nBasic Earnings Per Share\nDiluted Net Earnings from Continuing Operations Per Share\nDiluted Net (Loss) Earnings from Discontinued Operations Per Share\nDiluted Earnings Per Share\nOverview – Three and Nine Month Periods Ended June 27, 2025\nNet earnings attributable to the Company from continuing operations for the third fiscal quarter of 2025 were $181.2 million (or $1.56 per diluted share), an increase of $98.3 million, from net earnings of $82.9 million (or $0.66 per diluted share) for the corresponding period last year. Gross profit increased by $37.5 million for the third fiscal quarter of 2025 compared to the fiscal 2024 period primarily driven by stronger performance in our I&AF operating segment, specifically in the Europe, Energy & Power and Americas businesses, as well as growth in our PA Consulting business. Reported net earnings for the third fiscal quarter of 2025 were also favorably impacted by a decrease in pre-tax Restructuring and other charges and transaction costs of $28.7 million reported in Selling, general & administrative (\"SG&A\") expenses compared to the fiscal 2024 period associated with expenses incurred relating to the Separation Transaction (mainly professional services and employee separation costs), as well as favorable comparative results in Other income (expense), net for the current quarter of $44.6 million, offset by higher income tax expense of $8.5 million year over year for the third fiscal quarter of 2025. Included in the Company’s Other income (expense), net for the third fiscal quarter of 2025 were $27.4 million in pre-tax fair value gains associated with our investment in Amentum stock after finalization of the Separation Transaction, as well as $9.8 million in income from the Transition Services Agreement (the \"TSA\") with Amentum associated with the Separation Transaction (see Note 15-\nDiscontinued Operations\n) and comparatively lower year over year net interest expense of $7.3 million.\nNet loss attributable to the Company from discontinued operations for the third fiscal quarter of 2025 was $(1.6) million (or $(0.01) per diluted share), a decrease of $65.6 million, from net earnings of $64.0 million (or $0.51 per diluted share) for the corresponding period last year. The change year-over-year was primarily driven by prior year operating results of the SpinCo Business which were divested on September 27, 2024 and therefore are no longer in Company's financial results in fiscal year 2025. See Note 15-\nDiscontinued Operations.\nFor the nine months ended June 27, 2025, net earnings attributable to the Company from continuing operations was $175.3 million (or $1.53 per diluted share), a decrease of $128.2 million, from net earnings of $303.5 million (or $2.42 per diluted share) for the corresponding period last year. Our reported net earnings for the nine months ended June 27, 2025 were favorably impacted by higher gross profit of $120.4 million year over year primarily driven by stronger performance in our I&AF operating segment, specifically in the Advanced Facilities, Europe and Asia, Pacific and Middle East (APME) businesses, as well as growth in our PA Consulting business and a decrease in pre-tax Restructuring and other charges and transaction costs of $73.1 million reported in SG&A expenses associated with expenses incurred relating to the Separation Transaction (mainly professional services and employee separation costs), which are discussed in Note 17-\nRestructuring and Other Charges,\noffset in part by $20.9 million in SG&A expenses associated with the TSA with Amentum and year over year increases in underlying personnel costs and other department spend. While current year results reflected higher year-over-year underlying operating profit, the Company’s results from continuing operations for the nine months ended June 27, 2025 were impacted by unfavorable reductions in Other income (expense), net of $185.5 million and higher income tax expense of $104.5 million, with the unfavorable impacts in Other income (expense), net due mainly to $227.3 million in pre-tax fair value losses and other related expenses relating to our investment in Amentum stock in connection with the Separation Transaction and $20.5 million in discounts and expenses recorded to loss on extinguishment of debt associated with our Equity-for-Debt Transaction on March 13, 2025 (see Note 12-\nDiscontinued Operations)\n, offset in part by comparatively lower net interest expense of $24.5 million for the nine months ended June 27, 2025 and $31.5 million of TSA-related income.\nFor the nine months ended June 27, 2025, net loss attributable to the Company from discontinued operations was $(8.2) million (or $(0.07) per diluted share), a decrease of $185.3 million, from net earnings of $177.2 million (or $1.40 per diluted share) for the corresponding period last year. The change year-over-year was primarily driven by prior year operating results of the SpinCo Business which were divested and therefore are no longer in the Company's financial results in fiscal year 2025. See Note 15-\nDiscontinued Operations.\nConsolidated Results of Operations\nRevenues for the third fiscal quarter of 2025 were $3.03 billion, an increase of $148.4 million, or 5.1%, from $2.88 billion for the corresponding period last year. For the nine months ended June 27, 2025, revenues were $8.88 billion, an increase of $334.3 million, or 3.9%, from $8.54 billion for the corresponding period last year. Revenue increases for both the three and nine month periods year over year were mainly due to the Company's I&AF business, as well as revenue growth in our PA Consulting business. The I&AF business benefited primarily from stronger performance in its Advanced Facilities, APME and Americas business operations for both quarterly and year to date comparative periods presented. Our revenues were favorably impacted by foreign currency translation of $37.2 million and $34.8 million for\nthe three and nine months ended June 27, 2025, respectively, across our international businesses, as compared to an unfavorable impact of $0.8 million and favorable impact of $58.2 million for the three and nine months ended June 28, 2024, respectively.\nGross profit for the third fiscal quarter of 2025 was $758.4 million, an increase of $37.5 million, or 5.2%, from $720.9 million for the corresponding period last year, with gross profit margins of 25.0% for both periods. Gross profit for the nine months ended June 27, 2025 was $2,218.0 million, an increase of $120.4 million, or 5.7%, from $2,097.6 million for the corresponding period last year, with gross profit margins of 25.0% and 24.6% for the respective periods. The Company's increase in gross profit was mainly attributable to higher revenues as mentioned above, with favorable margin impacts from year over year project mix primarily in the nine month period.\nSegment Financial Information\ndiscussion for further information on the Company’s results of operations at the operating segment.\nSelling, general & administrative expenses for the three and nine months ended June 27, 2025 were $523.4 million and $1,565.9 million, respectively, as compared to $550.0 million and $1,601.4 million for the corresponding periods last year, representing a decrease of $26.6 million or 4.8% and $35.5 million or 2.2%, respectively. SG&A expenses for the three and nine months ended June 27, 2025 were impacted by decreases of $28.7 million and $73.1 million, respectively, in Restructuring and other charges costs associated with the Separation Transaction, mainly comprised of professional services, compared to the prior year. These favorable items were partially offset by expenses associated with the TSA with Amentum of $4.7 million and $20.9 million in the three and nine months ended June 27, 2025, respectively. SG&A expenses for the nine months ended June 27, 2025 were further unfavorably impacted by an increase of $7.8 million in expenses associated with IT related software licensing and other costs as well as year over year increases in underlying personnel costs and other department spend. Lastly, SG&A expenses included unfavorable foreign exchange impacts of $6.2"
}