{
  "source_file": "jbl-20250831.htm",
  "form_type": "10-K",
  "item1_clean": "Jabil is one of the leading providers of engineering, manufacturing, and supply chain solutions. We deliver comprehensive design, production, and product management services to companies across a diverse range of industries and end markets. Our capabilities span the entire product lifecycle—from innovation, design, and planning to fabrication, assembly, and delivery—enabling seamless management of resources and materials across global supply chains. Through these integrated services, we help our customers reduce manufacturing costs, enhance supply chain efficiency, minimize inventory risk, lower transportation expenses, and accelerate product fulfillment.\nWe serve our customers primarily through dedicated business units that combine highly automated, continuous flow manufacturing with advanced electronic design and design for manufacturability. Each business unit team serves as a single point of contact between a customer and Jabil. Business unit teams are supported by cross-functional teams, which leverage the power of our global expertise and capabilities to carry out work at the site level.\nWe conduct our operations in facilities that are located worldwide, including but not limited to China, Malaysia, Mexico, and the United States. Our global manufacturing production sites allow customers to manufacture products simultaneously in the optimal locations for their products. Our global presence is key to assessing and executing on our business opportunities. For the fiscal year ended August 31, 2025, we had net revenues of $29.8 billion and net income attributable to Jabil Inc. of $657 million.\nAs of September 1, 2024, we are reporting our business in the following three segments: Regulated Industries, Intelligent Infrastructure, and Connected Living and Digital Commerce, which are also the Company’s reportable segments. Our Regulated Industries segment is focused on regulated markets and includes revenues from customers primarily in the automotive and transportation, healthcare and packaging, and renewables and energy infrastructure industries. Our Intelligent Infrastructure segment is focused on the modern digital ecosystem including artificial intelligence (“AI”) infrastructure and includes revenues from customers primarily in the capital equipment, cloud and data center infrastructure, and networking and communications industries. Our Connected Living and Digital Commerce segment is focused on digitalization and automation, including warehouse automation and robotics, and includes revenues from customers primarily in the connected living and digital commerce industries.\nAdditional financial information regarding our reportable operating segments is included in Item 7 of this report and Note 14 – “Concentration of Risk and Segment Data” to the Consolidated Financial Statements.\nOur industry was historically composed of companies that provide a range of design and manufacturing services to companies that utilize electronics components in their products. The industry subsequently expanded to include customers that require products and services beyond electronic components, including plastics and metal components, packaging, and injection molding.\nWe monitor the current economic environment and its potential impact on both the customers we serve as well as our end-markets; we closely manage our costs and capital resources so that we can respond appropriately as circumstances change. Over the long term we believe the factors driving our customers and potential customers to use our industry’s services include:\nEfficient Manufacturing.\nManufacturing solutions providers are often able to manufacture products at a reduced total cost to companies. These cost advantages result from higher utilization of capacity and efficiencies of scale because of diversified product demand and, generally, a greater focus on the components of manufacturing cost. Companies are increasingly seeking to reduce their investment in inventory, facilities, and equipment used in manufacturing and prioritizing capital investments in other activities, such as sales and marketing and research and development (“R&D”). This strategic shift in capital deployment has contributed to increased demand for and interest in outsourcing to external manufacturing service providers.\nAccelerated Product Time-to-Market and Time-to-Volume.\nManufacturing solutions providers are often able to deliver accelerated production start-ups and achieve high efficiencies in bringing new products to production. Providers are also able to more rapidly scale production for changing markets and to position themselves in global locations that serve the leading world markets. With increasingly shorter product life cycles, these key services allow new products to be sold in the marketplace in an accelerated time frame.\nAccess to Advanced Design and Manufacturing Technologies.\nBy utilizing manufacturing solutions providers, customers gain access to additional advanced technologies in manufacturing processes, as well as to product and production design, which can offer customers significant improvements in the performance, quality, cost, time-to-market and manufacturability of their products.\nImproved Inventory Management and Purchasing Power.\nManufacturing solutions providers are often able to more efficiently manage both procurement and inventory. Providers have demonstrated proficiency in purchasing components at improved pricing due to the scale of their operations and continuous interaction with the materials marketplace.\nGlobal Reach and Regional Manufacturing.\nManufacturing solutions providers operate globally and are often able to more efficiently transition the location of manufacturing processes for products in response to changing macroeconomic and geopolitical environments relying on installed footprints, local teams, and consistent processes.\nOur vision is to be the world’s most technologically advanced and trusted manufacturing solutions provider. As we work to achieve our vision, we pursue the following strategies:\nEstablish and Maintain Long-Term Customer Relationships.\nAn important element of our strategy is to develop and expand long-term relationships with leading companies in expanding industries that benefit from global, highly automated, continuous-flow manufacturing. We grow these partnerships across product lines and services to create deeper, more integrated value. In addition, we pursue relationships with new customers that meet our targeted profile: financially stable, technology-driven, growth-oriented, and committed to long-term collaboration.\nProduct Diversification.\nWe focus on balancing our portfolio of products and product families toward higher-return and strategically important segments. This includes manufacturing, supply chain management services, comprehensive electronics design, production, and product management services for markets such as cloud and data infrastructure, healthcare, packaging, automotive and transportation, warehouse automation, networking and communications, and semi-capital equipment. We have made concentrated efforts to diversify our industry sectors and customer base. Because of these efforts, we have experienced business growth from both existing and new customers as well as from acquisitions. In addition, we continue to evaluate emerging end-markets and technologies to help ensure our portfolio remains balanced, resilient, and aligned with long-term customer demand.\nUtilize Customer-Centric Business Units.\nMost of our business units serve a single customer, using dedicated production equipment, workers, supervisors, buyers, planners, and engineers to provide comprehensive, customized manufacturing solutions. We believe our customer-centric business units promote increased responsiveness, particularly for relationships that extend across multiple production locations.\nLeverage Global Production.\nWe believe that global production reduces obsolescence risk, lowers landed costs, and promotes consistent quality worldwide. Consistent with this strategy, we have established or acquired operations in the Americas, Europe and Asia. Our extensive global footprint allows us to select production locations that best serve customer needs. We believe that our global footprint is strengthened by our centralized procurement process, which, when coupled with our single Enterprise Resource Planning system, provides our customers end-to-end supply chain visibility. Increasingly, our customers also prefer manufacturing to be located closer to their end markets. To meet this need, we invest in local-for-local and local-for-regional capabilities that improve resilience, reduce lead times, enhance sustainability, and enable us to support customers directly where they operate.\nExpand Value-Added Services.\nOur systems assembly, direct-order fulfillment, and configure-to-order services allow customers to reduce product cost and obsolescence risk by lowering total work-in-process and finished goods inventory. These services are available at all of our manufacturing locations.\nDeliver Design Expertise.\nWe offer a wide spectrum of value-add design services focused on improving performance, reducing costs, accelerating time-to-market, and enhancing manufacturability. Our design expertise also helps customers navigate technology transitions and regulatory requirements, creating end-to-end solutions that integrate seamlessly from concept through production.\nPursue Strategic Acquisitions.\nOur acquisition strategy complements current capabilities, diversifies us into new industry sectors and customers, and expands the scope of services we offer.\nOur Approach to Manufacturing\nTo achieve high levels of manufacturing performance, we have adopted the following approaches:\nDecentralized Business Unit Model.\nMost of our business units serve a single customer and are empowered to tailor strategies to that customer’s needs. Our business units generally have dedicated production lines consisting of equipment, production workers, supervisors, buyers, planners, and engineers. Under certain circumstances, a production line may serve more than one business unit to maximize resource utilization. Business units have direct responsibility for manufacturing results and time-to-volume production, thereby promoting accountability and ownership. The business unit approach is modular and enables us to grow incrementally without disrupting the operations of other business units. Business unit management reviews customer-specific financial performance to assess whether the business units are meeting their designated responsibilities and to ensure that the daily execution of manufacturing activities remains on track. The business units aggregate into operating segments based on the end markets they serve.\nAutomated Continuous Flow.\nWe use a highly automated, continuous flow approach to manufacturing, whereby different pieces of equipment are joined directly or by conveyor to create an in-line assembly process. This process contrasts with a batch approach, in which equipment operates as standalone work-centers. The elimination of waiting time prior to sequential operations results in faster manufacturing, improved efficiency, tighter quality control, and reduced work-in-process inventory. We believe continuous flow manufacturing provides cost reductions and quality improvement when applied to high volumes of product.\nComputerized Control and Monitoring.\nWe support all aspects of our manufacturing activities with advanced computerized control and monitoring systems. Component inspection and vendor quality are monitored electronically in real-time. Materials planning, purchasing, stockroom, and shop floor control systems run on a computerized manufacturing resource planning system.\nElectronic Supply Chain Management.\nWe make available to our customers and suppliers an electronic commerce system/electronic data interchange and cloud-based ",
  "item7_clean": "Item 7. Management’s Discussion and Analysis of Financial Condition and Results of Operations\nWe are one of the leading providers of worldwide manufacturing services and solutions. We provide comprehensive electronics design, production, and product management services to companies in various industries and end markets. We derive substantially all of our revenue from production and product management services (collectively referred to as “manufacturing services”), which encompass the act of producing tangible components that are built to customer specifications and are then provided to the customer.\nAt August 31, 2025, we have three reporting segments: Regulated Industries, Intelligent Infrastructure, and Connected Living and Digital Commerce. Our Regulated Industries segment is focused on regulated markets and includes revenues from customers primarily in the automotive and transportation, healthcare and packaging, and renewable energy infrastructure industries. Our Intelligent Infrastructure segment is focused on the modern digital ecosystem including artificial intelligence (“AI”) infrastructure and includes revenues from customers primarily in the capital equipment, cloud and data center infrastructure, and networking and communications industries. Our Connected Living and Digital Commerce segment is focused on digitalization and automation, including warehouse automation and robotics, and includes revenues from customers primarily in the connected living and digital commerce industries.\nOur cost of revenue includes the cost of electronic components and other materials that comprise the products we manufacture; the cost of labor and manufacturing overhead; and adjustments for excess and obsolete inventory. As a provider of turnkey manufacturing services, we are responsible for procuring components and other materials. This requires us to commit significant working capital to our operations and to manage the purchasing, receiving, inspecting, and stocking of materials. At times, we collect deposits from our customers related to the purchase of inventory in order to effectively manage our working capital. Although we bear the risk of fluctuations in the cost of materials and excess scrap, our ability to purchase components and materials efficiently may contribute significantly to our operating results. While we periodically negotiate cost of materials adjustments with our customers, rising component and material prices may negatively affect our margins. Net revenue from each product that we manufacture consists of an element based on the costs of materials in that product and an element based on the labor and manufacturing overhead costs allocated to that product. Our gross margin for any product depends on the mix between the cost of materials in the product and the cost of labor and manufacturing overhead allocated to the product.\nOur operating results are impacted by the level of capacity utilization of manufacturing facilities; indirect labor costs; and selling, general, and administrative expenses. Operating income margins have generally improved during periods of high production volume and high capacity utilization. During periods of low production volume, we generally have reduced operating income margins.\nWe monitor the current economic environment and its potential impact on both the customers we serve as well as our end-markets and closely manage our costs and capital resources so that we can respond appropriately as circumstances change.\nBeginning in February 2025, the U.S. implemented tariffs on a variety of countries and commodities, including, among others, tariffs on aluminum and steel derivative products, imports of certain Canadian and Mexican goods, imports of Chinese goods, universal tariffs on imports from most countries, and reciprocal tariffs on select countries. In response, certain countries have imposed, or are considering, retaliatory tariffs on U.S. exports. The global tariff landscape continues to shift rapidly, with changes impacting businesses and markets around the world. While these increased tariffs have and may continue to impact end customer demand, we expect that we will recover the tariff costs by passing them on to our customers. If we are unable to fully pass on these costs, our operating results and cash flows could be adversely impacted.\nWe have consistently utilized advanced circuit design, production design and manufacturing technologies to meet the needs of our customers. To support this effort, our engineering staff focuses on developing and refining design and manufacturing technologies to meet specific needs of specific customers. Most of the expenses associated with these customer-specific efforts are reflected in our cost of revenue. In addition, our engineers engage in research and development (“R&D”) of new technologies that apply generally to our operations. The expenses of these R&D activities are reflected in the research and development line item within our Consolidated Statements of Operations.\nAn important element of our strategy is the expansion of our global production facilities. The majority of our revenue and materials costs worldwide are denominated in U.S. dollars, while our labor and utility costs in operations outside the U.S. are denominated in local currencies. We economically hedge certain of these local currency costs, based on our evaluation of the potential exposure as compared to the cost of the hedge, through the purchase of foreign currency exchange contracts. Changes\nin the fair market value of such hedging instruments are reflected within the Consolidated Statements of Operations and the Consolidated Statements of Comprehensive Income.\nSee Note 14 – “Concentration of Risk and Segment Data” to the Consolidated Financial Statements.\nThe following table sets forth, for the periods indicated, certain key operating results and other financial information (in millions, except per share data):\n\nInventory turns (annualized)\nDays in accounts receivable\nDays in accounts payable\nThe sales cycle is calculated as the sum of days in accounts receivable and days in inventory, less the days in accounts payable; accordingly, the variance in the sales cycle quarter over quarter is a direct result of changes in these indicators.\nInventory turns (annualized) are calculated as 360 days divided by days in inventory.\nDays in accounts receivable is calculated as accounts receivable, net, divided by net revenue multiplied by 90 days. During the three months ended August 31, 2025, the decrease in days in accounts receivable from the prior sequential quarter and the three months ended August 31, 2024, was primarily driven by an increase in net revenue and the timing of payments.\nDays in inventory is calculated as inventory and contract assets divided by cost of revenue multiplied by 90 days. During the three months ended August 31, 2025, the decrease in days in inventory from the prior sequential quarter and the three months ended August 31, 2024, was primarily driven by higher consumption of inventory to support sales during the quarter and improved working capital management.\nDays in accounts payable is calculated as accounts payable divided by cost of revenue multiplied by 90 days. During the three months ended August 31, 2025, the increase in days in accounts payable from the three months ended August 31, 2024, was primarily due to higher purchases of customer-controlled consignment components and the timing of cash payments.\nCritical Accounting Policies and Estimates\nThe preparation of our Consolidated Financial Statements and related disclosures in conformity with U.S. generally accepted accounting principles (“U.S. GAAP”) requires management to make estimates and judgments that affect our reported amounts of assets and liabilities, revenues and expenses, and related disclosures of contingent assets and liabilities. On an on-going basis, we evaluate our estimates and assumptions based upon historical experience and various other factors and circumstances. Management believes that our estimates and assumptions are reasonable under the circumstances; however, actual results may vary from these estimates and assumptions under different future circumstances. We have identified the following critical accounting policies that affect the more significant judgments and estimates used in the preparation of our Consolidated Financial Statements. For further discussion of our significant accounting policies, refer\ncription of Business and Summary of Significant Accounting Policies” to the Consolidated Financial Statements.\nFor our over time customers, we believe the measure of progress which best depicts the transfer of control is based on costs incurred to date, relative to total estimated cost at completion (i.e., an input method). This method is a faithful depiction of the transfer of goods or services because it results in the recognition of revenue on the basis of our to-date efforts in the satisfaction of a performance obligation relative to the total expected efforts in the satisfaction of the performance obligation. We believe that the use of an input method best depicts the transfer of control to the customer, which occurs as we incur costs on our contracts. The transaction price of each performance obligation is generally based upon the contractual standalone selling price of the product or service.\nWe purchase inventory based on forecasted demand and record inventory at the lower of cost and net realizable value. Management regularly assesses inventory valuation based on current and forecasted usage, customer inventory-related contractual obligations, and other lower of cost and net realizable value considerations. If actual market conditions or our customers’ product demands are less favorable than those projected, additional valuation adjustments may be necessary.\nWe have recorded intangible assets, including goodwill, in connection with business acquisitions. Estimated useful lives of amortizable intangible assets are determined by management based on an assessment of the period over which the asset is expected to contribute to future cash flows. The fair value of acquired amortizable intangible assets impacts the amounts recorded as goodwill. We review amortizable intangible assets for impairment whenever events or changes in circumstances indicate that the carrying amount of an asset may not be recoverable.\nWe perform a goodwill impairment analysis on an annual basis and whenever events or changes in circumstances indicate that the carrying value may not be recoverable. We may elect to perform a qualitative assessment to determine whether it is more likely than not that a reporting unit is impaired. If the qualitative assessment is not performed or if we determine that it is not more likely than not that the fair value of the reporting unit exceeds the carrying value, the recoverability of goodwill is measured at the reporting unit level by comparing the reporting unit’s carrying amount, including goodwill, to the fair value of the reporting unit. If the carrying amount of the reporting unit exceeds its fair value, goodwill is considered impaired, and a loss is recognized in the amount equal to that excess.\nFor further discussion related to impairment analyses performed during fiscal year 2025, and performed as a result of the organizational realignment, refer\n\nFiscal Year Ended August 31,\nNet cash provided by operating activities (U.S. GAAP)\nAcquisition of property, plant and equipment (“PP&E”)\nProceeds and advances from sale of PP&E\nAdjusted free cash flow (Non-GAAP)\nCertain customers co-invest in PP&E with us. As we acquire PP&E, we recognize the cash payments in acquisition of PP&E. When our customers reimburse us and obtain control, we recognize the cash receipts in proceeds and advances from the sale of PP&E.\nQuarterly Results (Unaudited)\nThe following table sets forth certain unaudited quarterly financial information for the three months ended August 31, 2025, and 2024. In the opinion of management, this information has been presented on the same basis as the audited consolidated financial statements appearing elsewhere, and all necessary adjustments (consisting primarily of normal recurring accruals) have been included in the amounts stated below to present fairly the unaudited quarterly results when read in conjunction with the audited consolidated financial statements and related notes thereto. The operating results for any quarter are not necessarily indicative of results for any future period.\n(in millions, except for per share data)\nNet income attributable to Jabil Inc.\nEarnings per share – basic\nEarnings per share – diluted\nAcquisitions and Divestitures\nOn September 1, 2025, we completed the acquisition of Rebound Technologies Group Holdings Limited (“Rebound Technologies”) for cash consideration transferred of $134 million. Rebound Technologies is a global supply chain service provider headquartered in the United Kingdom offering end-to-end solutions including global sourcing, data driven analytics, proactive shortage management and obsolescence strategies. The final purchase price is subject to adjustment based on conditions within the purchase agreement.\nOn February 3, 2025, we completed the acquisition of Pharmaceutics International, Inc. (“Pii”) for cash consideration transferred of $309 million. The final purchase price is subject to adjustment based on certain customary conditions as outlined in the purchase agreement. Pii is a contract development and manufacturing organization specializing in early stage, clinical, and commercial volume aseptic filling, lyophilization, and oral solid dose manufacturing. The acquisition is expected to enhance our existing Regulated Industries service offerings, which includes the development and commercial production of auto-injectors, pen injectors, inhalers, and on-body pumps.\nThe acquisition of Pii was accounted for as a business combination using the acquisition method of accounting. Assets acquired of $357 million, including $149 million in intangible assets and $142 million in goodwill, and liabilities assumed of $48 million were recorded at their estimated fair values as of the acquisition date. The preliminary estimates and measurements are subject to change during the measurement period for assets acquired, liabilities assumed, and tax adjustments. The excess of the purchase price over the fair value of the acquired assets and assumed liabilities was recorded to goodwill and was fully allocated to the Regulated Industries segment. Goodwill is primarily attributable to expected synergies enabling comprehensive support for customers in drug development, clinical trials, and product commercialization at scale. The majority of the goodwill is currently not expected to be deductible for income tax purposes. The results of operations were included in our consolidated financial results beginning on February 3, 2025. Pro forma information has not been provided as the acquisition of Pii is not deemed to be significant.\nOn October 1, 2024, we completed the acquisition of Mikros Technologies LLC (“Mikros Technologies”) for consideration transferred of $63 million. Mikros Technologies is a leader in the engineering and manufacturing of liquid cooling solutions for thermal management. The final purchase price is subject to adjustment based on certain customary conditions as outlined in the purchase agreement.\nThe acquisition of Mikros Technologies was accounted for as a business combination using the acquisition method of accounting. Assets acquired of $63 million, including $40 million in intangible assets and $17 million in goodwill, were recorded at their estimated fair values as of the acquisition date. The preliminary estimates and measurements are subject to change during the measurement period for assets acquired, liabilities assumed, and tax adjustments. The excess of th",
  "item2_clean": null
}