{
  "source_file": "jbl-20250531.htm",
  "form_type": "10-Q",
  "item1_clean": null,
  "item7_clean": null,
  "item2_clean": "Inventory turns (annualized)\nDays in accounts receivable\nDays in accounts payable\nThe sales cycle is calculated as the sum of days in accounts receivable and days in inventory, less the days in accounts payable; accordingly, the variance in the sales cycle quarter over quarter was a direct result of changes in these indicators.\nInventory turns (annualized) are calculated as 360 days divided by days in inventory.\nDays in accounts receivable is calculated as accounts receivable, net, divided by net revenue multiplied by 90 days. During the three months ended May 31, 2025, the decrease in days in accounts receivable from the prior sequential quarter was primarily driven by timing of payments.\nDays in inventory is calculated as inventories, net and contract assets divided by cost of revenue multiplied by 90 days. During the three months ended May 31, 2025, the decrease in days in inventory from the prior sequential quarter and the three months ended May 31, 2024, was primarily driven by higher consumption of inventory to support sales during the quarter and improved working capital management.\nDays in accounts payable is calculated as accounts payable divided by cost of revenue multiplied by 90 days. During the three months ended May 31, 2025, the increase in days in accounts payable from the three months ended May 31, 2024, was primarily due to higher purchases of customer-controlled consignment components and timing of cash payments.\n\nResearch and Development\n(dollars in millions)\nResearch and development\nPercent of net revenue\nResearch and development expenses remained consistent as a percentage of net revenue during the three months and nine months ended May 31, 2025, compared to the three months and nine months ended May 31, 2024.\nAmortization of Intangibles\nAmortization of intangibles\nAmortization of intangibles increased during the three months ended May 31, 2025, compared to the three months ended May 31, 2024, primarily due to additional amortization associated with intangible assets related to the acquisitions of Mikros Technologies LLC and Pharmaceutics International, Inc. that occurred during the first and second quarters of fiscal year 2025.\nAmortization of intangibles increased during the nine months ended May 31, 2025, compared to the nine months ended May 31, 2024, primarily due to (i) additional amortization associated with intangible assets related to the acquisitions of Mikros Technologies LLC and Pharmaceutics International, Inc. that occurred during the first and second quarters of fiscal year 2025 and (ii) amortization related to the Green Point trade name, which was reclassified to a definite-lived intangible asset during fiscal year 2024.\nRestructuring, Severance and Related Charges\nRestructuring, severance and related charges\nRestructuring, severance, and related charges decreased during the three months and nine months ended May 31, 2025, compared to the three months and nine months ended May 31, 2024, primarily due to higher restructuring, severance and related charges, related to the 2024 Restructuring Plan, during the three months and nine months ended May 31, 2024. The decrease is partially offset by increased restructuring, severance and related charges, related to the 2025 Restructuring Plan, during the three months and nine months ended May 31, 2025.\n2025 Restructuring Plan\nOn September 24, 2024, our Board of Directors approved a restructuring plan to align our support infrastructure to further optimize organizational effectiveness. This action includes headcount reductions across our Selling, General and Administrative (“SG&A”) and manufacturing cost base and capacity realignment (the “2025 Restructuring Plan”). The 2025 Restructuring Plan reflects our intention only and restructuring decisions, including the timing of such decisions, at certain locations remain subject to consultation with the Company’s employees and their representatives.\nWe expect to recognize approximately $200 million in pre-tax restructuring and other related costs over the course of our 2025 fiscal year. The charges relating to the 2025 Restructuring Plan are currently expected to result in net cash expenditures of approximately $100 million to $130 million that will be payable over the course of the Company’s fiscal years 2025 and 2026. The restructuring and other related charges are expected to include $60 million to $70 million of employee severance and benefit costs; $65 million to $70 million of asset write-off costs; and $55 million to $65 million of contract termination costs and other related costs. The amount and timing of the actual charges may vary due to a variety of factors, including the finalization of timetables for the transition of functions, consultation with employees and their representatives, as well as the impact of jurisdictional statutory severance requirements. Our estimates for the charges discussed above exclude any potential income tax effects.\n\n2024 Restructuring Plan\nOn September 26, 2023, our Board of Directors approved a restructuring plan to (i) realign our cost base for stranded costs associated with the sale and realignment of the Mobility Business and (ii) optimize our global footprint. This action includes headcount reductions across our SG&A cost base and capacity realignment (the “2024 Restructuring Plan”).\nThe 2024 Restructuring Plan, totaling approximately $300 million in pre-tax restructuring and other related costs, was substantially complete as of August 31, 2024.\nSee Note 14 – “Restructuring, Severance and Related Charges” to the Condensed Consolidated Financial Statements for further discussion of restructuring, severance and related charges.\nGain from the Divestiture of Businesses\nGain from the divestiture of businesses\nIn the second quarter of fiscal year 2024, we completed the divestiture of the Mobility Business and recorded a pre-tax gain of $944 million. Certain post-closing adjustments were realized in March 2025, which resulted in the recognition of a $54 million pre-tax gain during the three months ended May 31, 2025.\nSee Note 17 – “Business Acquisitions and Divestitures” to the Condensed Consolidated Financial Statements for additional information.\nAcquisition and Divestiture Related Charges\nAcquisition and divestiture related charges\nAcquisition and divestiture related charges increased during the three months ended May 31, 2025, compared to the three months ended May 31, 2024, primarily due to transaction costs incurred in connection with pursuing acquisition opportunities.\nAcquisition and divestiture related charges decreased during the nine months ended May 31, 2025, compared to the nine months ended May 31, 2024, primarily due to transaction and disposal costs incurred in connection with the divestiture of the Mobility Business during fiscal year 2024.\nSee Note 17 – “Business Acquisitions and Divestitures” to the Condensed Consolidated Financial Statements for additional information.\nLoss on securities during the three months and nine months ended May 31, 2025, relates to an impairment of an investment in Preferred Stock.\n\nOn November 1, 2023, we completed the acquisition of ProcureAbility Inc. (“ProcureAbility”) for approximately $60 million in cash. ProcureAbility is a procurement services provider specializing in technology-enabled advisory, managed services, digital, staffing, and recruiting solutions.\nThe acquisition of ProcureAbility was accounted for as a business combination using the acquisition method of accounting. Assets acquired of $87 million, including $40 million in intangible assets and $38 million in goodwill, and liabilities assumed of $26 million were recorded at their estimated fair values as of the acquisition date. The excess of the purchase price over the fair value of the acquired assets and assumed liabilities was recorded to goodwill and was fully allocated to the Regulated Industries segment. The majority of the goodwill is currently not expected to be deductible for income tax purposes. The results of operations were included in our condensed consolidated financial results beginning on November 1, 2023. Pro forma information has not been provided as the acquisition of ProcureAbility is not deemed to be significant.\nWe announced on September 26, 2023, that, through our indirect subsidiary, Jabil Circuit (Singapore) Pte. Ltd., a Singapore private limited company (“Singapore Seller”), we agreed to sell to an affiliate of BYD Electronic (International) Co. Ltd., a Hong Kong limited liability company (“Purchaser” or “BYDE”), its product manufacturing business in Chengdu, including its supporting component manufacturing in Wuxi, the Mobility Business, for cash consideration of approximately $2.2 billion, subject to certain customary purchase price adjustments.\nAs of August 31, 2023, we determined the Mobility Business met the criteria to be classified as held for sale. Assets and liabilities classified as held for sale had a carrying value less than the estimated fair value less cost to sell and, thus, no adjustment to the carrying value of the disposal group was necessary. Depreciation and amortization expense for long-lived assets was not recorded for the period in which these assets were classified as held for sale. The divestiture did not meet the criteria to be reported as discontinued operations, and we continued to report the operating results for the Mobility Business in our Condensed Consolidated Statements of Operations in the DMS segment until the Closing Date.\nOn December 29, 2023, the Closing Date, we completed the sale of the Mobility Business. As a result of the transaction, we derecognized net assets of approximately $1.2 billion, and recorded a pre-tax gain of $942 million in the fiscal year ended August 31, 2024. Certain post-closing adjustments were realized in March 2025, which resulted in the recognition of a $54 million pre-tax gain during the three months ended May 31, 2025. In addition, we agreed to"
}