{
  "source_file": "jci-20250930.htm",
  "form_type": "10-K",
  "item1_clean": "commercial HVAC equipment, industrial refrigeration systems, controls, security systems, fire-detection systems and fire-suppression solutions. The Company further serves customers by providing technical services, including maintenance, management, repair, retrofit and replacement of equipment (in the HVAC, industrial refrigeration, security and fire-protection space), and energy-management consulting. The Company's OpenBlue digital software platform enables enterprises to better manage their physical spaces by combining the Company's building products and services with cutting-edge technology and digital capabilities to enable data-driven “smart building” services and solutions. The Company partners with customers by leveraging its broad product portfolio with digital capabilities, together with its direct channel service and solutions capabilities, to deliver solutions and services addressing distinct and diverse operating environments and regulatory requirements that address customers’ needs in their core missions.\nIn connection with the divestiture of the R&LC HVAC business, the Company realigned its organizational structure into three regional reporting segments (Americas, EMEA and APAC) from four reporting segments (Global Products, Building Solutions North America, Building Solutions EMEA/LA and Building Solutions APAC). The Company implemented this change effective April 1, 2025 as part of ongoing initiatives to drive simplification, accelerate growth, better reflect its organizational and operational structure and align with the manner in which the Company's chief operating decision maker assesses performance and makes decisions regarding the allocation of resources following portfolio simplification actions. As a result, the Company conducts its business through three operating segments, all of which are reportable segments:\nwhich designs, manufactures, sells, installs and services HVAC, controls, building management, refrigeration, integrated electronic security systems, integrated fire detection and suppression systems, and digital (software) solutions for commercial, industrial, data center, institutional and governmental customers in the Americas (United States, Canada, and Latin America – Central and South America). Americas also provides energy efficiency solutions and technical services, including inspection, scheduled maintenance, and repair and replacement of mechanical and control systems, as well as data-driven \"smart building\" solutions, to the Americas marketplace.\nEMEA,\nwhich designs, manufactures sells, installs and services HVAC, controls, building management, refrigeration, integrated electronic security systems, integrated fire detection and suppression systems, and digital (software) solutions for commercial, residential security (Subscriber business), industrial, data center, institutional, governmental, and marine customers and provides technical services, including data-driven “smart building” solutions, to markets in Europe, the Middle East and Africa.\nAPAC,\nwhich designs, manufactures, sells, installs, and services HVAC, controls, building management, refrigeration, integrated electronic security systems, integrated fire detection and suppression systems, and digital (software) solutions for commercial, industrial, data center, institutional, and governmental customers and provides technical services, including data-driven “smart building” solutions, to the Asian and Pacific marketplaces.\nFor more information on the Company’s segments, refer to Note 18, \"Segment Information,\" of the notes to consolidated financial statements.\nProducts, Systems, Services and Solutions\nThe Company sells and installs its commercial HVAC equipment and systems, control systems, security systems, fire-detection and fire suppression systems, equipment and services primarily through its extensive direct channel, consisting of a global\nnetwork of sales and service offices. Significant sales are also generated through global third-party channels, such as distributors of air-conditioning, controls, security and fire-detection and suppression products. The Company’s large base of current customers leads to significant repeat business for the maintenance, retrofit and replacement markets. The Company is also able to leverage its installed base to generate sales for its service business. Trusted building brands, such as YORK®, Metasys®, Ansul®, Frick®, FM:Systems®, PENN®, Sabroe®, Silent-Aire®, Simplex® and Grinnell®, together with the breadth and depth of the products, systems and solutions offered by the Company, give it what it believes to be the most diverse portfolio in the building technology industry.\nThe Company has developed software platforms, including on-premises platforms and cloud-based software services, and integrated its products and services with digital capabilities to provide data-driven solutions to create smarter, safer and more sustainable buildings. The Company's OpenBlue platform combines the Company’s building expertise with cutting-edge technology, including artificial intelligence and machine learning-powered service solutions such as remote diagnostics, predictive maintenance, workplace management, compliance monitoring and advanced risk assessments. The Company leverages its product portfolio and service network, together with digital and data-driven technologies to offer integrated and customizable solutions focused on delivering outcomes to customers. These services are generally designed to generate recurring revenue for the Company as it supports its customers in achieving their desired outcomes.\nIn fiscal 2025, products and systems accounted for approximately 68% of sales from continuing operations and services accounted for 32% of sales from continuing operations.\nThe Company conducts its operations through a significant number of individual contracts that are either negotiated or awarded on a competitive basis. Key factors in the award of contracts include system and service performance, quality, price, design, reputation, technology, application engineering capability, availability of financing and construction or project management expertise. Competitors for HVAC equipment, security, fire detection, fire suppression and controls in the residential and non-residential marketplace include many local, regional, national and international providers. Larger competitors include Honeywell International, Inc.; Siemens Smart Infrastructure, an operating group of Siemens AG; Schneider Electric SA; Carrier Global Corporation; Trane Technologies plc; Vertiv Holdings Co., API Group and Daikin Industries, Ltd. In addition, the Company competes in a highly fragmented building services market. The Company also faces competition from a diverse range of established companies, start-ups and other emerging entrants to the buildings industry in the areas of digital services, software as a service and the Internet of Things. The loss of any individual contract or customer would not have a material adverse effect on the Company.\nThe Company’s business strategy is to sustain and expand its position as a leader in commercial building technology and solutions by developing and implementing solutions designed to address its customers’ vertical specific needs in their core missions. In 2024 and 2025, the Company acted to optimize its core commercial buildings portfolio with the divestitures of its Air Distribution Technologies and R&LC HVAC businesses. Following these portfolio optimization actions, the Company’s core strategy remains advancing smart, healthy and sustainable buildings to power its customers’ missions, enabled by a simpler, more focused company focused on driving growth, profit, and cash flow.\nThe Company has leading positions in attractive and growing end-markets across HVAC, controls, fire, security and services, enhanced by its comprehensive product portfolio, significant installed base and substantial field position. The Company believes that it is well positioned to capitalize on the emerging and prevalent trends in the commercial buildings industry, including data centers, sustainable buildings, smart buildings and mission-critical environments. To capitalize on these trends, the Company is focused on offering differentiated services and solutions designed to address its customers’ vertical specific needs in their core missions. In furtherance of these goals, the Company has four strategic priorities:\nCapitalize on Key Growth Vectors:\nData centers, decarbonization, sustainable buildings, smart buildings, energy efficiency and mission-critical environments represent key growth opportunities for the Company. The Company seeks to leverage its existing portfolio breadth and investments in product development, combined with the expansion of its digital products and capabilities powered by OpenBlue, to offer differentiated solutions and innovative deal structures to help customers achieve their objectives. The Company intends to expand its capabilities by investing in products and technologies, as well as expanding its partnerships, to power innovation that will allow it to provide differentiated services that are tailored to its customers’ desired outcomes.\nBringing Value Across the Building Lifecycle\n: The Company provides system and service solutions that maximize the opportunities around the lifecycle of the building, delivering outcomes to the customer that save energy, reduce emissions, maintain uptime, and optimize building lifecycle costs while delivering mission-critical environments and improving the overall occupant experience. The Company’s ability to drive direct, integrated solutions within multiple domains enables opportunities for attachment, cross-selling, recurring revenue, and developing long-term relationships with customers from installation to service, retrofit, and replacement.\nAccelerate in High Growth Verticals\n: The Company is focused on driving growth and profit by developing and implementing solutions designed to address its customers’ vertical specific needs in their core missions, enabled by the Company’s installed base, domain expertise and global coverage. The Company further intends to expand its presence in high growth verticals within the markets it serves, including data centers, hospitals, university campuses, advanced manufacturing, class A offices, and airports.\nSustain a High-Performance, Customer-Centric Culture\n: The Company recognizes that developing talent and creating positive customer experiences is central to accomplishing its business strategies. The Company is investing in its talent to build a workforce that is digitally capable, solutions oriented and focused on continuous learning and growth. The Company aims to leverage its talent capabilities and training to create a customer-focused culture to drive customer loyalty and decisions.\nTo realize these priorities, the Company is leveraging its technology leadership, product portfolio, global presence, substantial installed base, sizable field position and strong channels to monetize the lifecycle opportunities of systems, service, retrofit and replacement. The Company is augmenting its strategic priorities with disciplined execution, productivity enhancements and sustainable cost management to create a path to realize expanded margins and enhanced profitability.\nBacklog and orders are additional metrics that are meant to provide management with a deeper level of insight into the progress of specific strategic and growth initiatives. Backlog is applicable to sales of both products and systems and services and totaled $16.6 billion at September 30, 2025. Orders provide management with a signal of customer demand for the Company's products and services, as well as an indication of future revenues and performance. However, the timing and conversion of backlog and orders are subject to numerous uncertainties and risks and are not necessarily indi",
  "item7_clean": "MANAGEMENT’S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS\nJohnson Controls International plc, headquartered in Cork, Ireland, is a global leader in smart, healthy and sustainable buildings, serving a wide range of customers around the globe. The Company’s products and solutions advance the safety, comfort and intelligence of spaces to serve people, places and the planet. The Company is committed to helping its customers win and creating greater value for all of its stakeholders through its strategic focus on buildings.\nThe Company is a global leader in engineering, manufacturing, commissioning and retrofitting building products and systems, including commercial heating, ventilating, air-conditioning (\"HVAC\") equipment, industrial refrigeration systems, controls, security systems, fire-detection systems and fire-suppression solutions. The Company further serves customers by providing technical services, including maintenance, management, repair, retrofit and replacement of equipment (in the HVAC, industrial refrigeration, controls, security and fire-protection space) and energy-management consulting. The Company partners with customers by leveraging its broad product portfolio and digital capabilities, together with its direct channel service and solutions capabilities, to deliver solutions and services addressing distinct and diverse operating environments and regulatory requirements that address customers’ needs in their core missions. On April 1, 2025, the Company, as part of ongoing initiatives to drive simplification, accelerate growth, better reflect its organizational and operational structure and align with the manner in which the Company's chief operating decision maker assesses performance and makes decisions regarding the allocation of resources following portfolio simplification actions, realigned into three reportable segments (Americas, EMEA and APAC) from four reportable segments (Global Products, Building Solutions North America, Building Solutions EMEA/LA and Building Solutions APAC). The Company began reporting under this segment structure on April 1, 2025.\nThe Company's fiscal year ends on September 30. Unless otherwise stated, references to years in this report relate to fiscal years rather than calendar years. This discussion summarizes the significant factors affecting the consolidated operating results,\nfinancial condition and liquidity of the Company on a continuing operations basis for the year ended September 30, 2025 and should be read in conjunction with Item 8, the consolidated financial statements and the notes to consolidated financial statements.\nMacroeconomic Trends\nMuch of the demand for the Company’s products and solutions is heavily dependent on general economic conditions, localized demand for real estate and the availability of credit, public funding or other financing sources. Positive or negative fluctuations in these dependencies could have a corresponding impact on the Company’s financial condition, results of operations and cash flows.\nThe Company maintains global operations. The United States has announced tariffs and reciprocal tariffs on a wide range of products manufactured or produced worldwide, including Canada, China, the European Union, Japan and Mexico, among others. Several countries have similarly announced reciprocal or other tariffs impacting products manufactured or produced in the United States. In addition, the United States and other nations have, and may in the future, pause, reimpose, decrease or increase tariffs. Although the Company has been largely able to mitigate the impact of tariffs that have been enacted to date, if additional tariffs and reciprocal tariffs are implemented (whether as currently proposed or otherwise), such actions could negatively impact the Company's revenue growth and margins in future periods through decreased sales and increased cost of goods sold. Further, the Company has experienced, and could again experience, increased material cost inflation and component shortages, as well as disruptions and delays in its supply chain, as a result of global macroeconomic trends including the imposition of tariffs and other restrictive trade measures, as well as geopolitical and economic tensions. The net effect of these events will continue to depend on the Company’s ability to successfully mitigate and offset their impact.\nThe Company is taking actions to mitigate the actual and anticipated impact of these events, including strengthening the Company's in region, for region manufacturing strategy, pivoting to local sourcing in its supply chain, accelerating pricing actions and asserting contractual rights through change orders. The Company has historically taken a variety of actions to mitigate trade restrictions, supply chain disruptions and inflation, including through expanding and redistributing its supplier network, supplier financing, accelerated purchasing and productivity improvements. These actions have largely been successful mitigating the impacts of the current macroeconomic environment, however, it is uncertain as to whether the actions taken or contemplated to be taken by the Company will be effective in continuing to mitigate the impact of current and future trade restrictions and their related impacts. The Company continues to actively monitor and evaluate the development and potential impacts of tariffs and other trade restrictions on its supply chain and results of operations.\nAs a result of the Company’s global presence, a significant portion of its revenues and expenses are denominated in currencies other than the U.S. dollar, which results in non-U.S. currency risks and exchange exposure. While the Company employs financial instruments to hedge some of its transactional foreign exchange exposure, these activities do not insulate it completely from those exposures. In addition, currency exposure from the translation of non-U.S. dollar functional currency subsidiaries cannot be hedged. Exchange rates can be volatile and a substantial weakening or strengthening of foreign currencies against the U.S. dollar could increase or reduce the Company’s profit margin, respectively, and impact the comparability of results from period to period.\nThe Company continues to observe trends demonstrating increased interest and demand for its products and services that enable smart, safe, efficient and sustainable buildings, which are driven in part by government tax incentives, building performance standards and other regulations designed to limit emissions and combat climate change. In particular, legislative and regulatory initiatives such as the EU Energy Efficiency Directive, EU Heat Transition, U.S. Inflation Reduction Act and EU Energy Performance of Buildings Directive include provisions designed to fund and encourage investment in decarbonization and digital technologies for buildings. This demand is supplemented by an increase in commitments in both the public and private sectors to reduce emissions and/or achieve net zero emissions. In addition, the increased maturity and adoption of AI and high-performance computing is currently impacting the microchip and data center industry and driving technology innovation, which has led to increased demand for hyperscale and data center cooling solutions that deliver heat management and energy efficiency. The Company seeks to capitalize on these trends to enable delivery of sustainable, high-efficiency products and tailored services to enable customers to achieve their sustainability, heat management and energy efficiency goals. The Company is leveraging its install base, together with data-driven products and services, to offer outcome-based solutions to customers with a focus on generating accelerated growth in services and recurring revenue.\nCertain of our customers, including governmental and institutional customers, have exhibited increased uncertainty regarding future spending decisions due to various political and economic factors, including budget reductions, reprioritization of spending, interest rate fluctuation and economic uncertainty. This uncertainty has and may in the future impact on the Company's ability to predict and forecast the revenue and backlog associated with these customers.\nPortfolio Simplification Transactions\nThe Company continues to engage in an ongoing evaluation of its non-core product lines in connection with its objective to be a pure-play provider of comprehensive solutions for commercial buildings. On July 31, 2025, the Company completed the divestiture of its Residential and Light Commercial (\"R&LC\") HVAC business to Robert Bosch GmbH (“Bosch”) for net cash proceeds of approximately $5.6 billion after tax and transaction-related expenses. The R&LC HVAC business included the Company's North America Ducted business and Johnson Controls-Hitachi Air Conditioning Holding (UK) Ltd., the Company’s global residential joint venture with Hitachi Global Life Solutions, Inc.\nRestructuring and Cost Optimization Initiatives\nDuring the fourth quarter of fiscal 2024, the Company committed to a multi-year restructuring plan to address stranded costs and further right-size global operations as a result of previously announced portfolio simplification actions. It is expected that one-time restructuring costs, including severance and other employee termination benefits, contract termination costs, and certain other related cash and non-cash charges, of approximately $400 million will be incurred over the course of fiscal 2025, 2026 and 2027, resulting in expected annual cost savings of approximately $500 million upon full completion of the plan. Restructuring and transformation costs in fiscal 2025 have been material, resulting in savings in 2025 and additional expected savings in fiscal 2026 and 2027. Restructuring costs will be incurred across all segments and Corporate functions. Refer to Note 16, \"Restructuring and Related Costs,\" for an update on the restructuring plan.\nFISCAL YEAR 2025 COMPARED TO FISCAL YEAR 2024\n\nYear Ended September 30,\nContinuing operations\nCash provided by operating activities\nCash used by investing activities\nCash used by financing activities\nDiscontinued operations\nCash provided by discontinued operations\nThe increase in cash provided by operating activities reflects higher net income and favorable changes in accounts receivable, partially offset by the timing of accrued income tax payments.\nThe increase in cash used by investing activities was primarily due to proceeds from the ADTi divestiture in fiscal 2024, partially offset by the decrease in capital expenditures.\nThe increase in cash used by financing activities was primarily due to the Accelerated Share Repurchase Transactions (\"ASR Transactions\").\nThe increase in cash provided by discontinued operations was primarily due to the net proceeds from the sale of the R&LC HVAC business, partially offset by dividends paid.\nCurrent portion of long-term debt\nLess: Cash and cash equivalents\nShareholders’ equity attributable to Johnson Controls ordinary shareholders (\"Equity\")\nTotal capitalization (Total debt plus Equity)\nNet capitalization (Net debt plus Equity)\nTotal debt as a % of Total capitalization\nNet debt as a % of Net capitalization\nNet debt and net debt as a percentage of net capitalization are non-GAAP financial measures. The Company believes the percentage of net debt to net capitalization is useful to understanding the Company’s financial condition as it provides a view of the extent to which the Company relies on external debt financing for its funding and is a measure of risk to its shareholders.\nThe Company's material cash requirements primarily consist of working capital requirements, repayments of long-term debt and related interest, operating leases, dividends, capital expenditures, potential acquisitions and share repurchases.\nRefer to Note 9, \"Debt and Financing Arrangements,\" of the notes to consolidated financial statements for additional information on debt obligations and maturities. Interest payable on long-term debt outstanding as of September 30, 2025 is $326 million in the twelve months following September 30, 2025 and $3.3 billion thereafter.\nRefer to Note 8, \"Leases,\" of the notes to consolidated financial statements for additional information on lease obligations and maturities.\nThe Company received net cash proceeds related to the sale of its R&LC HVAC business of approximately $5.6 billion after tax and transaction-related expenses in connection with the close of the transaction on July 31, 2025. Consistent with its capital allocation policy and pursuant to its previously announced share repurchase authorization, the Company returned the net proceeds of the transaction to shareholders through the $5.0 billion ASR Transactions which were launched in August 2025 and are expected to be completed in the second quarter of fiscal 2026. The total number of the Company’s ordinary shares (the \"Shares\") to be repurchased under the ASR Transactions will be based on volume-weighted average prices of the Shares during the term of the ASR Transactions, less a discount and subject to customary adjustments.\nAs of September 30, 2025, the Company had purchase obligations which were payable in the next twelve months of approximately $2 billion and payable thereafter of approximately $0.2 billion. These purchase obligations represent commitments under enforceable and legally binding agreements, and do not represent all future expected purchases.\nAs of September 30, 2025, the Company expects to contribute $23 million and $162 million to the global pension and postretirement plans in the next twelve months and thereafter, respectively.\nAs of September 30, 2025, approximately $4.8 billion remains available under the Company's share repurchase authorization, which does not have an expiration date and may be amended or terminated by the Board of Directors at any time without prior notice. The Company expects to repurchase outstanding shares from time to time depending on market conditions, alternate uses of capital, liquidity and economic environment.\nThe Company declared dividends of $1.51 per share in fiscal 2025 and intends to continue paying quarterly dividends in fiscal 2026. The authority to declare and pay dividends is vested in the Board of Directors. The timing, declaration and payment of future dividends to holders of the Company's ordinary shares is determined by the Company's Board of Directors and depends upon many factors, including the Company's financial condition and results of operations, the capital requirements of the Company's businesses, industry practice and any other relevant factors.\nThe Company believes its capital resources and liquidity position, including cash and cash equivalents of $379 million at September 30, 2025, are adequate to fund operations and meet its cash obligations for the foreseeable future.\nThe Company manages its short-term debt position in the U.S. and euro commercial paper markets and bank loan markets. Commercial paper outstanding was $400 million as of September 30, 2025 and $350 million as of September 30, 2024.\nThe Company maintains a shelf registration statement with the SEC under which it may issue additional debt securities, ordinary shares, preferred shares, depository shares, warrants, purchase contracts and units that may be offered in one or more offerings on terms to be determined at the time of the offering. The Company anticipates that the proceeds of any offering would be used for general corporate purposes, including repayment of indebtedness, acquisitions, additions to working capital, repurchases of ordinary shares, dividends, capital expenditures and investments in the Company's subsidiaries.\nThe Company has the ability to draw on its syndicated $2.5 billion committed revolving credit facility, which is scheduled to expire in December 2028, and a syndicated $500 millio",
  "item2_clean": null
}