{
  "source_file": "jkhy-20250630.htm",
  "form_type": "10-K",
  "item1_clean": "issued in the 2023 calendar year. Comparing calendar years 2024 to 2023, the number of transactions of FDIC-insured banks acquiring or merging with other banks or credit unions decreased 18%.\nACU reports the number of credit unions declined 15% from the end of calendar year 2019 to the end of calendar year 2024. Although the number of credit unions declined at a 3% compound annual rate during this period, aggregate assets increased at a compound annual rate of 8% and totaled $2.3 trillion as of December 31, 2024.\nDespite continued industry consolidation, Jack Henry net core footprints increased year-over-year from calendar year 2023 to calendar year 2024 in both bank and credit union client bases. Furthermore, the average assets under management for our banking core clients grew from $1.26 billion to $1.29 billion, and the average assets under management for our credit union core clients grew from $1.17 billion to $1.20 billion.\nCommunity and regional banks and credit unions are vitally important to the communities, consumers, and businesses they serve as well as to the local economies where they operate. Bank and credit union accountholders rely on these institutions to provide personalized, relationship-based service and competitive financial products and services available through the accountholders' delivery channel of choice. Institutions are recognizing that attracting and retaining accountholders in today’s highly competitive financial industry and realizing near-term and long-term performance goals are often technology dependent. Banks and credit unions must implement technological solutions that enable them to:\nOffer digital strategies that provide the convenience-driven services required in today’s financial services industry.\nMaximize performance with accessible, accurate, and timely business intelligence information.\nProvide the high-demand products and services needed to successfully compete with traditional and non-traditional competitors created by convergence within the financial services industry.\nFoster growth and efficiency through delivering accountholders exceptional user experiences.\nExpand existing accountholder relationships and strengthen exit barriers by cross selling additional products and services.\nCapitalize on new revenue, and deposit and loan portfolio growth opportunities.\nIncrease operating efficiencies and reduce operating costs.\nProtect mission-critical information assets and operational infrastructure.\nProtect accountholders with various security tools from fraud and related financial losses.\nMaximize the day-to-day use of technology and return on technology investments.\nEnsure full regulatory compliance.\nJack Henry’s extensive product and service offerings help diverse banks and credit unions meet business challenges and capitalize on opportunities. We strive to get to know our clients, understand their strategies and challenges, and provide innovative solutions that help them achieve short- and long-term success.\nOur fundamental business strategy is to generate organic revenue and earnings growth augmented by strategic acquisitions. Our strategy for the next three to five years is to enable banks and credit unions to win on exceptional user experience and trust through open, innovative technology, data-driven insights, and service, resulting in greater growth and efficiency. We intend to execute this strategy by:\nProviding community and regional banks and credit unions with core processing systems that provide excellent functionality and support on-premise and private cloud delivery environments with identical functionality.\nExpanding each core client relationship by cross-selling complementary/payment products and services that enhance the functionality provided by our core processing systems.\nDelivering non-core highly specialized core-agnostic complementary/payment products and services to banks and credit unions, including institutions not utilizing one of our core processing systems, and diverse corporate entities.\nDeveloping and deploying a long-term technology modernization strategy to provide public cloud-native solutions that provide clients with greater flexibility, optionality, open integration, speed to market, and other benefits.\nUpholding a company-wide commitment to service that consistently exceeds our clients’ expectations and generates high levels of retention.\nCarrying out a large client strategy that focuses on deep engagement with banks and credit unions to align objectives, optimize revenue streams, and foster collaborative growth and innovation through continuous engagement and commitment to excellence.\nGrowing our market share of services to small and medium-sized businesses offering features through banks and credit unions.\nBuilding, maintaining, and enhancing a protected environment and tools that help our clients and Jack Henry protect accountholder data, assets, and comply with regulations.\nMaintaining a disciplined acquisition strategy.\nTechnology Modernization Strategy\nOur public cloud-native technology modernization strategy seeks to enable our bank and credit union clients to innovate faster, differentiate themselves in the markets they serve, and meet the evolving needs of their accountholders.\nThe Jack Henry Platform\nTM\nis the centerpiece of this strategy and operates as a single public cloud-native, API-first platform, which we are developing into a fully functional modern alternative for existing core functions. The platform includes services like wire transfers, a centralized data hub for reporting and analysis, exception item processing, general ledger, deposit servicing, and entitlements. These services can be combined with other Jack Henry public cloud-native solutions, such as digital banking, digital payments, and fraud detection, as well as third-party provider solutions on a single, unified platform.\nThe Jack Henry Platform leverages public cloud advantages, including high system availability, rapid processing, modern security standards, easily deployable upgrades, and scalability.\nAcquisition Strategy\nWe have a disciplined approach to acquisitions and have been successful in supplementing our organic growth with 35 strategic acquisitions since the end of fiscal year 1999. We continue to explore acquisitions that have the potential to:\nExpand our suite of complementary/payment products and services.\nProvide products and services that can be sold to both existing core and non-core clients as well as outside our core base to new clients.\nAccelerate our internal development efforts for technology modernization.\nProvide selective opportunities to sell outside our traditional markets in the financial services industry.\nAfter nearly 50 years in business, we have very few gaps in our product line, so it is increasingly difficult to find proven products or services that would enable our clients and prospects to better optimize their business opportunities or solve specific operational issues. In addition, we see few acquisition opportunities that would\nexpand our market or enable our entry into adjacent markets within the financial services industry that are fairly priced or that we could assimilate into our Company without material distractions.\nWe have a solid track record of executing acquisitions from both a financial and operational standpoint, and we will continue to pursue acquisition opportunities that support our strategic direction, complement and accelerate our organic growth, and generate long-term profitable growth for our stockholders. While we seek to identify appropriate acquisition opportunities, we will continue to explore alternative ways to leverage our cash position and balance sheet to the benefit of our stockholders, such as continued investment in new products and services for our clients, repurchases of our stock, and continued payment of dividends.\nOur most recent acquisition was:\nCompany or Product Name\nProducts and Services\nPayrailz, LLC (\"Payrailz\")\nProvider of cloud-native modern digital payment capabilities leveraging AI and machine learning features for the financial services industry.\nOur core banking solutions support commercial banks with information and transaction processing platforms that provide enterprise-wide automation. We have three functionally distinct core bank processing systems and many fully integrated complementary/payment solutions, including business intelligence and bank management, retail and business banking, digital and mobile internet banking and electronic payment solutions, fraud and risk management and protection, account origination, and item and document imaging solutions. Our core banking solutions have state-of-the-art functional capabilities, and we can re-market the hardware required by on-premise use of each software system. Our banking solutions can be delivered on-premise or through our private cloud delivery model and are backed by a company-wide commitment to provide exceptional client support.\nOur core credit union solutions support credit unions of all sizes with an information and transaction processing platform that provides enterprise-wide automation. Our solution includes one flagship core processing system and many fully integrated complementary/payment solutions, including business intelligence and credit union management, accountholder and accountholder business services, digital and mobile internet banking and electronic payment solutions, fraud and risk management and protection, account origination, and item and document imaging solutions. Our credit union solution also has state-of-the-art functional capabilities. We also re-market the hardware required by on-premise use of the software system. Our credit union solution can be delivered on-premise, through our private cloud, or through our partner private cloud delivery models. Each is backed by our company-wide commitment to provide exceptional client support.\nOur non-core solutions for banks, credit unions, and diverse corporate entities are specialized products and services assembled primarily through our focused diversification acquisition strategy. These core-agnostic solutions are compatible with a wide variety of information technology platforms and operating environments and offer a large number of complementary/payment solutions, including proven solutions for generating additional revenue and growth, increasing security and mitigating operational risks, and/or controlling operating costs. Our non-core products and services enhance the performance of banks and credit unions of all asset sizes and charters, and diverse corporate entities. These distinct products and services can be implemented individually or as solution suites to address specific business problems or needs and enable effective responses to dynamic industry trends.\nWe are committed to developing and maintaining modern and integrated solutions supported by high service levels. We continuously update and improve these solutions through an interactive client enhancement process, ensuring compliance with relevant regulations, and incorporating proven advances in technology. Our goal is to uphold our Company's reputation as a premium solution and service provider.\nCore Software Systems\nCore software systems primarily consist of the integrated applications required to process deposit, loan, and general ledger transactions, and to maintain centralized accountholder information.\nOur core banking solutions consist of three software systems marketed to banks, and our core credit union solution consists of one software system marketed to credit unions. These core systems are available for on-premise installation at client sites, or banks and credit unions can choose to leverage our private cloud environment for ongoing information processing.\nCore banking platforms are:\na robust system primarily designed for commercial-focused banks that currently serves banks with assets ranging from $1 billion to o",
  "item7_clean": "ITEM 7. MANAGEMENT’S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS\nOVERVIEW\nJack Henry & Associates, Inc. is a well-rounded financial technology company headquartered in Monett, Missouri, that employs approximately 7,240 full-time and part-time associates nationwide, and is a leading provider of technology solutions and payment processing services primarily to community and regional banks and credit unions. Our solutions serve approximately 7,400 clients and consist of integrated data processing systems solutions to banks ranging from de novo to multi-billion-dollar institutions with assets up to $55 billion, core data processing solutions for credit unions of all sizes, and non-core highly specialized core-agnostic products and services that enable banks and credit unions of every asset size and charter, and diverse corporate entities outside the financial services industry, to mitigate and control risks, optimize revenue and growth opportunities, and contain costs. Our integrated solutions are available for on-premise installation and delivery in our private and public cloud.\nEach of our solutions shares the fundamental commitment to provide high-quality business systems, service levels that consistently exceed client expectations, and integration of solutions and practical new technologies. The quality of our solutions, our high service standards, and the fundamental way we do business typically foster long-term client relationships, attract prospective clients, and have enabled us to capture substantial market share.\nThrough internal product development, disciplined acquisitions, and alliances with companies offering niche solutions that complement our proprietary solutions, we regularly introduce new products and services and generate new cross-sales opportunities. We provide compatible computer hardware for our on-premise installations and secure processing environments for our outsourced solutions in our private and public cloud. We perform data conversions, software implementations, initial and ongoing client training, and ongoing client support services.\nWe believe our primary competitive advantage is client service. Our support infrastructure and strict standards provide service levels that generate high levels of client satisfaction and retention. We consistently measure client satisfaction using a variety of surveys, such as an annual survey on the client's anniversary date and randomly-generated surveys initiated each day by routine support requests. Dedicated surveys are also used to grade specific aspects of our client experience, including product implementation, education, and consulting services.\nOur two primary revenue streams are \"services and support\" and \"processing.\" Services and support includes: \"private and public cloud\" revenues that predominantly have contract terms of six years at inception; \"product delivery and services\" revenues, which include revenues from the sales of licenses, implementation services, deconversions, consulting, and hardware; and \"on-premise support\" revenues, composed of maintenance fees that primarily contain annual contract terms. Processing includes: \"remittance\" revenues from payment processing, remote capture, and ACH transactions; \"card\" revenues, including card transaction processing and monthly fees; and \"transaction and digital\" revenues, which include transaction and mobile processing revenues. We continually seek opportunities to increase revenue while at the same time containing costs to expand margins.\nWe have four reportable segments: Core, Payments, Complementary, and Corporate and Other. The respective segments include all related revenues along with the related cost of revenue.\nA detailed discussion of the major components of the results of operations follows.\nRESULTS OF OPERATIONS\nFISCAL 2025 COMPARED TO FISCAL 2024\nIn fiscal 2025, total revenue increased 7.2% or $159,745, compared to fiscal 2024. Reducing total revenue for deconversion revenue of $33,905 in the current fiscal year and $16,554 in the prior fiscal year, results in a 6.5% increase, or $142,394. This increase was mainly driven by growth in data processing and hosting within cloud revenue as new clients were added and volumes expanded, card processing revenue primarily from expanded fraud detection and prevention risk management services and monthly service fees, digital revenue as active monthly users and volumes increased, and payment processing revenue from expanding volumes and new client revenue.\nOperating expenses increased 4.7%, or $80,421, in fiscal 2025 compared to fiscal 2024. Reducing total operating expenses for deconversion costs of $6,242 in the current fiscal year and $3,408 in the prior fiscal year and for VEDIP related costs of $16,443 in the prior fiscal year, results in a 5.5% increase, or $94,031 (The VEDIP program was a Company voluntary separation program offered to certain eligible associates who chose to participate in the program from July through December 2023, including immaterial payments that continued into calendar 2024). The increase in operating expenses was primarily due to higher direct costs generally commensurate with increases in the related lines of revenue, higher personnel costs including increases in compensation costs during the trailing twelve months, and higher internal licenses and fees from price increases and more deployments in the current fiscal year.\nAs we move into fiscal 2026 – our 50\nyear in business – we are excited and confident about our future, and we remain well-positioned to deliver durable, consistent growth and attractive results for our shareholders. Technology spending by financial institutions remains strong, and there is clear demand for our differentiated and innovative technology solutions. We have a very healthy sales pipeline and a proven ability to attract and win deals, especially with larger financial institutions. Our unwavering focus on culture, service, innovation, strategy, and execution continues to set us apart in the market and will enable us to drive continued industry-leading revenue growth with strong margin expansion, benefiting our associates, clients, and shareholders.\nA detailed discussion of the major components of the results of operations for the fiscal year ended June 30, 2025 compared to the fiscal year ended June 30, 2024 follows.\nREVENUE\nServices and Support Revenue\n\nCash provided by operating activities for fiscal 2025 increased 12.9% compared to fiscal 2024, primarily due to the increase in Net income and the net changes in prepaid expenses, deferred costs and other and accrued expenses within Change in other assets and liabilities fiscal year over fiscal year. Cash from operations is primarily used to repay debt, pay dividends, repurchase stock, and for capital expenditures.\nCash used in investing activities for fiscal 2025 totaled $232,163 and included: $172,445 for the ongoing enhancements and development of existing and new product and service offerings; capital expenditures on facilities and equipment of $53,358, mainly for the purchase of computer equipment; $5,363 for the purchase and development of internal use software; and $2,000 for the purchase of investments. These expenditures were partially offset by proceeds from investments of $1,000 and $3 of proceeds from the sale of assets.\nCash used in investing activities for fiscal 2024 totaled $240,165 and included: $167,175 for the ongoing enhancements and development of existing and new product and service offerings; capital expenditures on facilities and equipment of $58,118, mainly for the purchase of computer equipment; $8,646 for the purchase of investments; and $7,130 for the purchase and development of internal use software. These expenditures were partially offset by $904 of proceeds from the sale of assets.\nFinancing activities used cash of $345,672 for fiscal 2025 and included: $164,644 for dividends paid to stockholders; borrowings and repayments on our credit facilities which netted to repayments of $150,000; and $35,051 for the purchase of treasury shares. These expenditures were partially offset by $4,023 of net cash inflow related to stock-based compensation.\nFinancing activities used cash in fiscal 2024 of $301,835 and included $155,877 for dividends paid to stockholders; borrowings and repayments on our revolving credit facility which netted to repayments of $125,000; and $28,055 for the purchase of treasury shares. These expenditures were partially offset by $7,097 of net cash inflow related to stock-based compensation.\nCapital Requirements and Resources\nThe Company generally uses existing resources and funds generated from operations to meet its capital requirements. Capital expenditures totaling $53,358 and $58,118 for fiscal years ended June 30, 2025, and June 30, 2024, respectively, were made primarily for additional equipment and the improvement of existing facilities. These additions were funded from cash generated by operations. At June 30, 2025, the Company had $58,182 of significant outstanding purchase commitments related to property and equipment. We assessed our liquidity needs throughout fiscal 2025, and determined we had adequate capital resources and sufficient access to external financing sources to satisfy our current and reasonably anticipated funding needs. We will continue to monitor and assess these needs going forward.\nAt June 30, 2025, the Company had contractual obligations of $1,700,611, including operating lease obligations, and $1,643,789 related to off-balance sheet contractual purchase obligations. Included in off-balance sheet contractual purchase obligations was the strategic services agreement that offers full-service debit and credit card processing on a single platform to our customers. This agreement was signed in fiscal 2017 and amended in May 2025 to add two additional service years and $213,053 to contractual obligations, bringing the total remaining purchase commitment at June 30, 2025 to $1,022,283 over the remaining term of the contract, which now extends to January 2038, subject to certain renewal terms. Contractual obligations exclude $22,649 of liabilities for uncertain tax positions as we are unable to reasonably estimate the ultimate amount or timing of settlement.\nOn July 4, 2025, the President of the United States signed into law legislation referred to as “One Big Beautiful Bill Act” (H.R. 1), which enacts substantial changes to the federal income tax law. The legislation includes several business-focused provisions, such as the restoration of immediate expensing for domestic research and development expenditures and the reinstatement of 100% bonus depreciation for qualified property placed in service after January 19, 2025. The Act also permanently extends key provisions from the Tax Cuts and Jobs Act (TCJA). As the legislation was enacted after the June 30, 2025, balance sheet date, the financial implications are not included in the current fiscal year's financial statements. The Company is in the process of assessing the impacts of the new law and plans to incorporate updates in the financial results next fiscal year beginning in the quarter ending September 30, 2025.\nThe Board of Directors has authorized the Company to repurchase shares of its common stock. Under this authorization, the Company may finance its share repurchases with available cash reserves or short-term borrowings on its existing credit facilities. The share repurchase program does not include specific price targets or timetables and may be suspended at any time. At June 30, 2025, there were 31,580 shares in treasury stock and the Company had the remaining authority to repurchase up to 3,411 additional shares. The total cost of treasury shares at June 30, 2025 was $1,895,224. During fiscal 2025, the Company repurchased 207 treasury shares for $35,051. At June 30, 2024, there were 31,373 shares in treasury stock and the Company had authority to repurchase up to 3,618 additional shares.\nOn August 31, 2022, the Company entered into a five-year senior, unsecured amended and restated credit agreement. The credit agreement allows for borrowings of up to $600,000, which may be increased to $1,000,000 by the Company at any time until maturity. The credit agreement bears interest at a variable rate equal to (a) a rate based on an adjusted Secured Overnight Financing Rate (\"SOFR\") term rate or (b) an alternate base rate (the highest of (i) 0%, (ii) the Prime Rate for such day, (iii) the sum of the Federal Funds Effective Rate for such day\n0.50% per annum and (iv) the Adjusted Term SOFR Screen Rate (without giving effect to the Applicable Margin) for a one month Interest Period on such day for Dollars\n1.0%), plus an applicable percentage in each case determined by the Company's leverage ratio. The credit agreement is guaranteed by certain subsidiaries of the Company and is subject to various financial covenants that require the Company to maintain certain financial ratios as defined in the credit agreement. As of June 30, 2025, the Company was in compliance with all such covenants. The credit facility terminates August 31, 2027. There was $0 and $60,000 outstanding under the amended and restated credit facility at June 30, 2025, and June 30, 2024, respectively.\nOn May 16, 2023, the Company entered into a term loan credit agreement with a syndicate of financial institutions, with an original principal balance of $180,000. Borrowings under the term loan facility bore interest at a variable rate equal to (a) a rate based on an adjusted SOFR term rate or (b) an alternate base rate (the highest of (i) 0%, (ii) the Prime Rate for such day, (iii) the sum of the Federal Funds Effective Rate for such day\n0.50% per annum and (iv) the Adjusted Term SOFR Screen Rate (without giving effect to the Applicable Margin) for a one month Interest Period on such day for Dollars\n0.75%), plus an applicable percentage in each case determined by the Company's leverage ratio. The term loan credit agreement was guaranteed by certain subsidiaries of the Company\nand was subject to various financial covenants that required the Company to maintain certain financial ratios as defined in the term loan credit agreement. The term loan credit agreement matured on May 16, 2025, and at the maturity date the Company was in compliance with all such covenants. There was $0 and $90,000 outstanding under the term loan at June 30, 2025, and June 30, 2024, respectively.\nOther lines of credit\nThe Company had an unsecured bank credit line which provided for funding of up to $5,000 and bore interest at the prime rate\n1.0%. The credit line expired on April 30, 2025. There was no balance outstanding at June 30, 2025, or 2024.\nOn October 31, 2024, the Company entered into a discretionary line of credit demand note, which provides for funding of up to $50,000 and bears interest at the prime rate\n2.0%. The note does not constitute a committed line of credit. The line of credit expires on October 31, 2025. There was no balance outstanding at June 30, 2025.\nOn July 18, 2025, the Company entered into a new unsecured committed revolving line of credit facility with a commercial bank in the amount of $50,000, which bears interest at the prime rate\n1.0%. The line of credit expires on July 17, 2026.\nRECENT ACCOUNTING PRONOUNCEMENTS\nRecently Adopted Accounting Guidance\nIn November 2023, the FASB issued ASU No. 2023-07, Segment Reporting (Topic 280): Improvements to Reportable Segment Disclosures, which improves the disclosures about a public entity's reportable segments through enhanced disclosures about significant segment expenses that are regularly provided to the chief operating decision maker. The ASU is effective for fiscal years beginning after December 15, 2023, and interim periods within fiscal years beginning after December 15, 2024, and should be applied retrospectively to all prior periods presented in th",
  "item2_clean": null
}