{
  "source_file": "jnj-20241229.htm",
  "form_type": "10-K",
  "item1_clean": "and claims involving the Company's patent and other intellectual property are described in Note 19 Legal proceedings—Intellectual property of the Notes to Consolidated Financial Statements included in Item 8 of this Report.\nSales of the Company’s largest product, collectively DARZALEX (daratumumab) and DARZALEX FASPRO (daratumumab and hyaluronidase-fihj), accounted for approximately 13.1% of the Company's total revenues for fiscal 2024. Accordingly, the patents related to these products are believed to be material to the Company. Genmab A/S owns two patent families related to DARZALEX, and Janssen Biotech, Inc. has an exclusive license to those patent families. The two patent families both expire in the United States in 2029, and in Europe, compound/use patent protection in select countries extends to 2031/2032. Janssen Biotech, Inc. owns a separate patent portfolio related to DARZALEX FASPRO.\nSales of the Company’s second largest product, STELARA (ustekinumab) accounted for approximately 11.7% of the Company's total revenues for fiscal 2024. According to patent settlement and license agreements, the Company expects continued launches of biosimilar versions of STELARA in Europe and the United States in 2025 which will impact the Company’s sales of STELARA.\nThe Company’s subsidiaries have made a practice of selling their products under trademarks and of obtaining protection for these trademarks by all available means. These trademarks are protected by registration in the U.S. and other countries where such products are marketed. The Company considers these trademarks in the aggregate to be of material importance in the operation of its businesses.\nWorldwide sales do not reflect any significant degree of seasonality; however, spending has typically been heavier in the fourth quarter of each year than in other quarters. This reflects increased spending decisions, principally for advertising and research and development activity.\nIn all of their product lines, the Company's subsidiaries compete with companies both locally and globally. Competition exists in all product lines without regard to the number and size of the competing companies involved. Competition in research, both internally and externally sourced, involving the development and the improvement of new and existing products and processes, is particularly significant. The development of new and innovative products, as well as protecting the underlying intellectual property of the Company’s product portfolio, is important to the Company's success in all areas of its business. The competitive environment requires substantial investments in continuing research.\nThe Company is subject to a variety of environmental laws and regulations in the United States and other jurisdictions. The Company believes that its operations comply in all material respects with applicable environmental laws and regulations. The Company’s compliance with these requirements is not expected to have a material effect upon its capital expenditures, cash flows, earnings or competitive position.\nThe Company’s businesses are subject to varying degrees of governmental regulation in the countries in which operations are conducted, and the general trend is toward increasingly stringent regulation and enforcement. The Company is subject to costly and complex U.S. and foreign laws and governmental regulations, and any adverse regulatory action may materially adversely affect the Company's financial condition and business operations. In the U.S., the pharmaceutical product and medical technology industries have long been subject to regulation by various federal and state agencies, primarily as to product safety, efficacy, manufacturing, advertising, labeling and safety reporting. The exercise of broad regulatory powers by the U.S. Food and Drug Administration (the U.S. FDA) continues to result in increases in the amounts of testing and documentation required for U.S. FDA approval of new drugs and devices and a corresponding increase in the expense of product introduction. Similar trends are also evident in major markets outside of the U.S.\nThe medical device regulatory framework and the evolving privacy, data localization, and emerging cyber security laws and regulations around the world are examples of such increased regulation. Within the U.S., an increasing number of U.S. States have enacted comprehensive privacy laws, and federal regulators (e.g., the U.S. FDA, FTC and HHS) continue to stress the intersection of health and privacy as a compliance and enforcement priority. In the EU, multiple directives and laws (including NIS2, EHDS, the Data Act, the Cyber Resilience Act, and the AI Act) are rapidly changing privacy and cybersecurity compliance requirements while introducing new enforcement risks. In addition, China has introduced broad personal information protection and data security regulations, with more anticipated, thereby increasing China’s scrutiny of company compliance and data transfer practices. With other jurisdictions enacting similar privacy laws, local data protection authorities will force greater accountability on the collection, access and use of personal data in the healthcare industry. These laws can also restrict transfers of data across borders, potentially impacting how data-driven health care solutions are developed and deployed globally in a compliant manner. Moreover, as a result of the broad scale release and availability of Artificial Intelligence (AI) technologies such as generative AI, a global trend towards more comprehensive and nuanced regulation to ensure the ethical use, privacy, and security of AI is underway that includes standards for transparency, accountability, and fairness, which will require compliance developments or enhancements.\nThe regulatory agencies under whose purview the Company operates have administrative powers that may subject it to actions such as product withdrawals, recalls, seizure of products and other civil and criminal sanctions. In some cases, the Company’s subsidiaries may deem it advisable to initiate product recalls regardless of whether it has been required or directed to.\nThe U.S. FDA and regulatory agencies around the globe are also increasing their enforcement activities. If the U.S. FDA were to conclude that we are not in compliance with applicable laws or regulations, or that any of our pharmaceutical products or medical technologies are ineffective or pose an unreasonable safety risk, the U.S. FDA could ban such products, detain or seize adulterated or misbranded products, order a recall, repair, replacement, or refund of such products, withdraw approval for such products, refuse to grant pending applications for marketing authorization or require certificates of foreign governments for exports, and/or require us to notify health professionals and others that the products present unreasonable risks of substantial harm to the public health. The U.S. FDA may also assess civil or criminal penalties against us, our officers or employees and impose operating restrictions on a company-wide basis, or enjoin and/or restrain certain conduct resulting in violations of applicable law. The U.S. FDA may also recommend prosecution to the U.S. Department of Justice. Any adverse regulatory action, depending on its magnitude, may restrict us from effectively marketing and selling our products and limit our ability to obtain future clearances, classifications or approvals, and could result in a substantial modification to our business practices and operations. Equivalent enforcement mechanisms exist in different countries in which we conduct business.\nThe costs of human healthcare have been and continue to be a subject of study, investigation and regulation by governmental agencies and legislative bodies around the world. In the U.S., attention has been focused by states, regulatory agencies and Congress on prices, profits, overutilization and the quality and costs of healthcare generally. Laws and regulations have been enacted to require adherence to strict compliance standards and prevent fraud and abuse in the healthcare industry. There is increased focus on interactions and financial relationships between healthcare companies and healthcare providers. Various state and federal transparency laws and regulations require disclosures of payments and other transfers of value made to certain healthcare practitioners, including physicians, teaching hospitals, and certain non-physician practitioners. Federal and foreign laws governing international business practices require strict compliance with anti-bribery standards and certain prohibitions with respect to payments to any foreign government official. Payors and Pharmacy Benefit Managers (PBMs) are a potent force in the marketplace, and increased attention is being paid to the impact of PBM practices on healthcare cost and access in the U.S.\nOur business has been and continues to be affected by federal and state legislation that alters the pricing, coverage, and reimbursement landscape. At the federal level, in August 2022, President Biden signed into law the Inflation Reduction Act (IRA), which includes provisions that effectively authorize the government to establish prices for certain high-spend single-source drugs and biologics reimbursed by the Medicare program, starting in 2026 for Medicare Part D drugs and 2028 for Medicare Part B drugs. On August 29, 2023, the Centers for Medicare & Medicaid Services (“CMS”) published the first “Selected Drug” list, which includes XARELTO and STELARA as well as IMBRUVICA, which is developed in collaboration and co-commercialized in the U.S. with Pharmacyclics LLC, an AbbVie company. The Selected Drug list also included other medicines targeting disease states that are prevalent in the Medicare population. Although CMS published an explanation for how it determined prices for selected drugs in December 2024, uncertainty remains as to the methodology used to determine these prices. The IRA specifies a ceiling price but not a minimum price for selected drugs and does not require CMS to use a specific framework for determining selected drug prices. In any event, we anticipate that the selected products will be subjected to a government-established price for the Medicare population beginning in 2026.\n\nThe IRA also contains provisions that impose rebates if certain prices increase at a rate that outpaces the rate of inflation, beginning October 1, 2022, for Medicare Part D drugs and January 1, 2023, for Medicare Part B drugs. Separate IRA provisions redesign the Medicare Part D benefit in various ways, including by shifting a greater portion of costs to manufacturers within certain coverage phases and replacing the Part D coverage gap discount program with a new manufacturer discounting program. Failure to comply with IRA provisions may subject manufacturers to various penalties, including civil monetary penalties.\nIn July 2023, Janssen Pharmaceuticals, Inc. (Janssen) filed litigation against the U.S. Department of Health and Human Services as well as the Centers for Medicare and Medicaid Services challenging the constitutionality of the IRA's Medicare Drug Price Negotiation Program. The litigation requests a declaration that the IRA violates Janssen’s rights under the First Amendment and the Fifth Amendment to the Constitution and therefore that Janssen is not subject to the IRA’s mandatory pricing scheme. The impact of the IRA on our business and the broader pharmaceutical industry remains uncertain, as litigation filed by Janssen and other pharmaceutical companies remains ongoing and while CMS has publicly announced the maximum fair price for each of the selected drugs, implementation of the program is still in progress. In April 2024, Janssen appealed the district court’s denial of its summary judgment motion to the Third Circuit.\nAdditionally, we expect continued scrutiny on drug pricing and government p",
  "item7_clean": "divested interest was $2.5 billion and was recorded to additional paid-in capital. As of the closing of the IPO, Johnson & Johnson owned approximately 89.6% of the total outstanding shares of Kenvue Common Stock and at July 2, 2023, the non-controlling interest of $1.3 billion associated with Kenvue was reflected in equity attributable to non-controlling interests in the consolidated balance sheet.\nOn August 23, 2023, Johnson & Johnson completed the disposition of an additional 80.1% ownership of Kenvue Common Stock through an exchange offer, which resulted in Johnson & Johnson acquiring 190,955,436 shares of the Company’s common stock in exchange for 1,533,830,450 shares of Kenvue Common Stock. The $31.4 billion of Johnson & Johnson common stock received in the exchange offer is recorded in Treasury stock. Following the exchange offer, the Company owned 9.5% of the total outstanding shares of Kenvue Common Stock that was recorded in other assets within continuing operations at the fair market value of $4.3 billion as of August 23, 2023 and $3.9 billion as of December 31, 2023.\nJohnson & Johnson divested net assets of $11.6 billion as of August 23, 2023, and the accumulated other comprehensive loss attributable to the Consumer Health business at that date was $4.3 billion. Additionally, at the date of the exchange offer, Johnson & Johnson decreased the non-controlling interest by $1.2 billion to record the deconsolidation of Kenvue. This resulted in a gain on the exchange offer of $21.0 billion that was recorded in Net earnings from discontinued operations, net of taxes in the consolidated statements of earnings for the fiscal third quarter of 2023. This one-time gain includes a gain of $2.8 billion on the Kenvue Common Stock retained by Johnson & Johnson. The gain on the exchange offer qualifies as a tax-free transaction for U.S. federal income tax purposes.\nOn May 15, 2024, the Company issued $3.6 billion aggregate principal amount of commercial paper and received $3.6 billion of net cash proceeds to be used for general corporate purposes. On May 17, 2024, the Company completed a Debt-for-Equity Exchange of its remaining 182,329,550 shares of Kenvue Common Stock for the outstanding Commercial Paper. Upon completion of the Debt-for-Equity Exchange, the Commercial Paper was satisfied and discharged and the Company no longer owns any shares of Kenvue Common Stock. This exchange resulted in a loss of approximately $0.4 billion recorded in Other (income) expense.\nThe following table summarizes the Company’s material contractual obligations and their aggregate maturities as of December 29, 2024: To satisfy these obligations, the Company intends to use cash from operations.\n(Dollars in Millions)\n(TCJA)\nFor tax matters, see Note 8 to the Consolidated Financial Statements. For the proposed talc settlement payments, see Note 19 to the Consolidated Financial Statements.\nFinancing and market risk\nThe Company uses financial instruments to manage the impact of foreign exchange rate changes on cash flows. Accordingly, the Company enters into forward foreign exchange contracts to protect the value of certain foreign currency assets and liabilities and to hedge future foreign currency transactions primarily related to product costs. Gains or losses on these contracts are offset by the gains or losses on the underlying transactions. A 10% appreciation of the U.S. Dollar from the December 29, 2024 market rates would increase the unrealized value of the Company’s forward contracts by $0.2 billion. Conversely, a 10% depreciation of the U.S. Dollar from the December 29, 2024 market rates would decrease the unrealized value of the Company’s forward contracts by $0.2 billion. In either scenario, the gain or loss on the forward contract would be offset by the gain or loss on the underlying transaction, and therefore, would have no impact on future anticipated earnings and cash flows.\nThe Company hedges the exposure to fluctuations in currency exchange rates, and the effect on certain assets and liabilities in foreign currency, by entering into currency swap contracts. A 1% change in the spread between U.S. and foreign interest rates on the Company’s interest rate sensitive financial instruments would either increase or decrease the unrealized value of the Company’s swap contracts by approximately $1.5 billion. In either scenario, at maturity, the gain or loss on the swap contract would be offset by the gain or loss on the underlying transaction, and therefore, would have no impact on future anticipated cash flows.\nThe Company does not enter into financial instruments for trading or speculative purposes. Further, the Company has a policy of only entering into contracts with parties that have at least an investment grade credit rating. The counterparties to these contracts are major financial institutions and there is no significant concentration of exposure with any one counterparty. Management believes the risk of loss is remote. The Company entered into credit support agreements (CSA) with certain derivative counterparties establishing collateral thresholds based on respective credit ratings and netting agreements. See Note 6 to the Consolidated Financial Statements for additional details on credit support agreements.\nThe Company invests in both fixed rate and floating rate interest earning securities which carry a degree of interest rate risk. The fair market value of fixed rate securities may be adversely impacted due to a rise in interest rates, while floating rate securities may produce less income than predicted if interest rates fall. A 1% (100 basis points) change in spread on the Company’s interest rate sensitive investments would either increase or decrease the unrealized value of cash equivalents and current marketable securities by less than $8.0 million.\nThe Company has access to substantial sources of funds at numerous banks worldwide. In June 2024, the Company secured a new 364-day Credit Facility of $10 billion, which expires on June 25, 2025. Interest charged on borrowings under the credit line agreement is based on either Secured Overnight Financing Rate (SOFR) Reference Rate or other applicable market rate as allowed plus applicable margins. Commitment fees under the agreement are not material.\nTotal borrowings at the end of 2024 and 2023 were $36.6 billion and $29.3 billion, respectively. The increase in the borrowings was due to the issuance of new debt in 2024. In 2024, net debt (cash and current marketable securities, net of debt) was $12.1 billion compared to net debt of $6.4 billion in 2023. Total debt represented 34.0% of total capital (shareholders’ equity and total debt) in 2024 and 30.0% of total capital in 2023. Shareholders’ equity per share at the end of 2024 was $29.70 compared to $28.57 at year-end 2023.\nA summary of borrowings can be found in Note 7 to the Consolidated Financial Statements.\nThe Company increased its dividend in 2024 for the 62\nconsecutive year. Cash dividends paid were $4.91 per share in 2024 and $4.70 per share in 2023.\nOn January 2, 2025, the Board of Directors declared a regular cash dividend of $1.24 per share, payable on March 4, 2025 to shareholders of record as of February 18, 2025.\n\nEconomic and market factors\nThe Company is aware that its products are used in an environment where, for more than a decade, policymakers, consumers and businesses have expressed concerns about the rising cost of healthcare. In response to these concerns, the Company has a long-standing policy of pricing products responsibly. For the period 2014 - 2024, in the U.S., the weighted average compound annual growth rate of the Company’s net price increases for healthcare products (prescription and over-the-counter drugs, hospital and professional products) was below the U.S. Consumer Price Index (CPI).\nThe Company operates in certain countries where the economic conditions continue to present significant challenges. The Company continues to monitor these situations and take appropriate actions. Inflation rates continue to have an effect on worldwide economies and, consequently, on the way companies operate. The Company has accounted for operations in Argentina, Venezuela, Turkey and Egypt (beginning in the fiscal fourth quarter of 2024) as highly inflationary, as the prior three-year cumulative inflation rate surpassed 100%. This did not have a material impact to the Company's results in the period. In the face of increasing costs, the Company strives to maintain its profit margins through cost reduction programs, productivity improvements and periodic price increases.\nIn July 2023, Janssen Pharmaceuticals, Inc. (Janssen) filed litigation against the U.S. Department of Health and Human Services as well as the Centers for Medicare and Medicaid Services challenging the constitutionality of the IRA's Medicare Drug Price Negotiation Program. The litigation requests a declaration that the IRA violates Janssen’s rights under the First Amendment and the Fifth Amendment to the Constitution and therefore that Janssen is not subject to the IRA’s mandatory pricing scheme. The impact of the IRA on our business and the broader pharmaceutical industry remains uncertain, as litigation filed by Janssen and other pharmaceutical companies remains ongoing and while CMS has publicly announced the maximum fair price for each of the selected drugs, implementation of the program is still in progress. In April 2024, Janssen appealed the district court’s denial of its summary judgment motion to the Third Circuit.\nAlthough the long-term implications of Russia’s invasion of Ukraine are difficult to predict at this time, the financial impact of the conflict in the fiscal year 2024, including accounts receivable or inventory reserves, was not material. As of and for each of the fiscal years ending December 29, 2024 and December 31, 2023, the business of the Company’s Russian subsidiaries represented less than 1% of the Company’s consolidated assets and revenues. The Company does not maintain Ukraine subsidiaries subsequent to the Kenvue separation.\nIn March of 2022, the Company took steps to suspend all advertising, enrollment in clinical trials, and any additional investment in Russia. The Company continues to supply products relied upon by patients for healthcare purposes.\nConflict in the Middle East\nAlthough the long-term implications of the conflict in the Middle East are difficult to predict at this time, the financial impact of the conflict in the fiscal year 2024, including accounts receivable or inventory reserves, was not material. As of and for each of the fiscal years ending December 29, 2024 and December 31, 2023, the business of the Company’s Israel subsidiaries represented 1% of the Company’s consolidated assets and represented less than 1% of revenues.\nThe Company is exposed to fluctuations in currency exchange rates. A 1% change in the value of the U.S. Dollar as compared to all foreign currencies in which the Company had sales, income or expense in 2024 would have increased or decreased the translation of foreign sales by approximately $0.4 billion and net income by approximately $0.1 billion.\nGovernments around the world consider various proposals to make changes to tax laws, which may include increasing or decreasing existing statutory tax rates. In connection with various government initiatives, companies are required to disclose more information to tax authorities on operations around the world, which may lead to greater audit scrutiny of profits earned in other countries. A change in statutory tax rate in any country would result in the revaluation of the Company’s deferred tax assets and liabilities related to that particular jurisdiction in the period in which the new tax law is enacted. This change would result in an expense or benefit recorded to the Company’s Consolidated Statement of Earnings. The Company closely monitors these proposals as they arise in the countries where it operates. Changes to the statutory tax rate may occur at any time, and any related expense or benefit recorded may be material to the fiscal quarter and year in which the law change is enacted.\nThe Company faces various worldwide healthcare changes that may continue to result in pricing pressures that include healthcare cost containment and government legislation relating to sales, promotions, pricing and reimbursement of healthcare products.\nChanges in the behavior and spending patterns of purchasers of healthcare products and services, including delaying medical procedures, rationing prescription medications, reducing the frequency of physician visits and foregoing healthcare insurance coverage may continue to impact the Company’s businesses.\nThe Company also operates in an environment increasingly hostile to intellectual property rights. Firms have filed Abbreviated New Drug Applications or Biosimilar Biological Product Applications with the U.S. FDA or otherwise challenged the coverage and/or validity of the Company's patents, seeking to market generic or biosimilar forms of many of the Company’s key pharmaceutical products prior to expiration of the applicable patents covering those products. In the event the Company is not successful in defending the patent claims challenged in the resulting lawsuits, generic or biosimilar versions of the products at issue will be introduced to the market, resulting in the potential for substantial market share and revenue losses for those products, and which may result in a non-cash impairment charge in any associated intangible asset. There is also a risk that one or more competitors could launch a generic or biosimilar version of the product at issue following regulatory approval even though one or more valid patents are in place.\nJohnson & Johnson and certain of its subsidiaries are involved in various lawsuits and claims regarding product liability, intellectual property, commercial, employment, indemnification and other matters; governmental investigations; and other legal proceedings that arise from time to time in the ordinary course of business.\nThe Company records accruals for loss contingencies associated with these legal matters when it is probable that a liability will be incurred and the amount of the loss can be reasonably estimated. As of December 29, 2024, the Company has determined that the liabilities associated with certain litigation matters are probable and can be reasonably estimated. The Company has accrued for these matters and will continue to monitor each related legal issue and adjust accruals as might be warranted based on new information and further developments in accordance with ASC 450-20-25, Contingencies. For these and other litigation and regulatory matters discussed below for which a loss is probable or reasonably possible, the Company is unable to estimate the possible loss or range of loss beyond the amounts accrued. Amounts accrued for legal contingencies often result from a complex series of judgments about future events and uncertainties that rely heavily on estimates and assumptions including timing of related payments. The ability to make such estimates and judgments can be affected by various factors including, among other things, whether damages sought in the proceedings are unsubstantiated or indeterminate; scientific and legal discovery has not commenced or is not complete; proceedings are in early stages; matters present legal uncertainties; there are significant facts in dispute; procedural or jurisdictional issues; the uncertainty and unpredictability of the number of potential claims; ability to achieve comprehensive multi-party settlements; complexity of related cross-claims and counterclaims; and/or there are numerous parties involved. To the extent adverse awards, judgments or verdicts have been rendered against the Company, the Company does not record an accrual until a loss is determined to be probable and can be re",
  "item2_clean": null
}