{
  "source_file": "jpm-20241231.htm",
  "form_type": "10-K",
  "item1_clean": "JPMorgan Chase & Co. (“JPMorganChase” or the “Firm”, NYSE: JPM), a financial holding company incorporated under Delaware law in 1968, is a leading financial services firm based in the United States of America (“U.S.”), with operations worldwide. JPMorganChase had $4.0 trillion in assets and $344.8 billion in stockholders’ equity as of December 31, 2024. The Firm is a leader in investment banking, financial services for consumers and small businesses, commercial banking, financial transaction processing and asset management. Under the J.P. Morgan and Chase brands, the Firm serves millions of customers, predominantly in the U.S., and many of the world’s most prominent corporate, institutional and government clients globally.\nJPMorganChase’s principal bank subsidiary is JPMorgan Chase Bank, National Association (“JPMorgan Chase Bank, N.A.”), a national banking association with U.S. branches in 48 states and Washington, D.C. JPMorganChase’s principal non-bank subsidiary is J.P. Morgan Securities LLC (“J.P. Morgan Securities”), a U.S. broker-dealer. The bank and non-bank subsidiaries of JPMorganChase operate nationally as well as through overseas branches and subsidiaries, representative offices and subsidiary foreign banks. The Firm’s principal operating subsidiaries outside the U.S. are J.P. Morgan Securities plc and J.P. Morgan SE (“JPMSE”), which are subsidiaries of JPMorgan Chase Bank, N.A. and are based in the United Kingdom (“U.K.”) and Germany, respectively.\nBusiness segments & Corporate\nEffective in the second quarter of 2024, JPMorganChase reorganized its reportable business segments by combining the former Corporate & Investment Bank and Commercial Banking business segments to form one reportable segment, the Commercial & Investment Bank. As a result of the reorganization, the Firm has three reportable business segments\nConsumer & Community Banking (“CCB”), Commercial & Investment Bank (“CIB”) and Asset & Wealth Management (“AWM”)\nwith the remaining activities in Corporate. The Firm’s consumer business segment is CCB, and the Firm’s wholesale business segments are CIB and AWM.\nJPMorganChase and its subsidiaries and affiliates operate in highly competitive environments. Competitors include other banks, brokerage firms, investment banking companies, merchant banks, hedge funds, commodity trading companies, private equity firms, insurance companies, mutual fund companies, investment managers, credit card companies, mortgage banking companies, trust companies, securities processing companies, automobile financing companies, leasing companies, e-commerce and other internet-based companies, financial technology companies, and other companies engaged in providing similar and new products and services. The Firm’s businesses generally compete on the basis of the quality and variety of the Firm’s products and services, transaction execution, innovation, reputation and price. Competition also varies based on the types of clients, customers, industries and geographies served. With respect to some of its geographies and products, JPMorganChase competes globally; with respect to others, the Firm competes on a national or regional basis. New competitors in the financial services industry continue to emerge, including firms that offer products and services solely through the internet and non-financial companies that offer products and services that disintermediate traditional banking products and services offered by financial services firms such as JPMorganChase.\nSupervision and regulation\nThe Firm is subject to extensive and comprehensive regulation under U.S. federal and state laws, as well as the applicable laws of the jurisdictions outside the U.S. in which the Firm does business.\nFinancial holding company:\nConsolidated supervision\n. JPMorgan Chase & Co. is a bank holding company (“BHC”) and a financial holding company (“FHC”) under U.S. federal law, and is subject to comprehensive consolidated supervision, regulation and examination by the Board of Governors of the Federal Reserve System (the “Federal Reserve”). The Federal Reserve acts as the supervisor of the consolidated operations of BHCs. Certain of JPMorganChase’s subsidiaries are also regulated directly by additional authorities based on the activities or licenses of those subsidiaries.\nJPMorganChase’s national bank subsidiary, JPMorgan Chase Bank, N.A., is supervised and regulated by the Office of the Comptroller of the Currency (“OCC”) and, with respect to certain matters, by the Federal Deposit Insurance Corporation (the “FDIC”).\nJPMSE is a Germany-based credit institution jointly regulated by the European Central Bank (“ECB”), the German Financial Supervisory Authority and the German Central Bank, as well as the local regulators in each of the countries in which it operates. The Firm’s other non-U.S. subsidiaries are regulated by the banking, securities, prudential, payments and conduct regulatory authorities, as applicable, in the countries in which they operate.\nPermissible business activities\n. The Bank Holding Company Act restricts BHCs from engaging in business activities other than the business of banking and certain closely-related activities. FHCs are permitted to engage in a broader range of financial activities. The Federal Reserve has the authority to limit an FHC’s ability to conduct otherwise permissible activities if the FHC or any of its depository institution subsidiaries ceases to meet applicable eligibility requirements. The Federal Reserve may also impose corrective capital and/or managerial requirements on the FHC, and if deficiencies are persistent, may require divestiture of the FHC’s depository institutions. If any\ndepository institution controlled by an FHC fails to maintain a satisfactory rating under the Community Reinvestment Act, the Federal Reserve must prohibit the FHC and its subsidiaries from engaging in any new activities other than those permissible for BHCs, or acquiring a company engaged in such activities.\nCapital and liquidity requirements\n. The Federal Reserve establishes capital, liquidity and leverage requirements for JPMorganChase that are generally consistent with the international Basel III capital and liquidity framework and evaluates the Firm’s compliance with those requirements. The OCC establishes similar requirements for JPMorgan Chase Bank, N.A. Certain of the Firm’s non-U.S. subsidiaries and branches are also subject to local capital and liquidity requirements.\nBanking supervisors globally continue to refine and enhance the Basel III capital framework for financial institutions. In July 2023, U.S. banking regulators released a proposal to amend the U.S. risk-based capital framework to incorporate certain elements of the revised international Basel III capital framework. The proposal would significantly revise risk-based capital requirements for banks with assets of $100 billion or more, including the Firm and other U.S. global systemically important banks (\"GSIBs\"). Finalization of the proposal, including the required implementation date, is uncertain. The Firm continues to monitor developments and potential impacts.\nIn the EU and U.K., regulators have finalized the rules implementing their Basel III frameworks. The new rules became effective in the EU beginning January 1, 2025, with market risk aspects delayed until January 1, 2026. In January 2025, the PRA announced that it intends to delay the implementation of the new rules in the U.K. to January 1, 2027. There are certain transitional arrangements applicable in both the EU and U.K. until 2032 and 2030, respectively.\n. As a large BHC, JPMorganChase is subject to supervisory stress testing administered by the Federal Reserve as part of the Federal Reserve’s annual Comprehensive Capital Analysis and Review (“CCAR”) framework. The Firm must conduct annual company-run stress tests and must also submit an annual capital plan to the Federal Reserve, taking into account the results of separate stress tests designed by each of the Firm and the Federal Reserve. The Federal Reserve uses the results under the severely adverse scenario from its supervisory stress test to determine the Firm’s Stress Capital Buffer (“SCB”) requirement for the coming year, which forms part of the Firm’s applicable capital buffers. The Firm is required to file its annual CCAR submission on April 5, 2025. The Federal Reserve will notify the Firm of its indicative SCB requirement by June 30, 2025 and final SCB requirement by August 31, 2025. The Firm’s final\nSCB requirement will become effective on October 1, 2025. The OCC requires JPMorgan Chase Bank, N.A. to perform separate, similar stress tests annually. The Firm publishes each year the results of the annual stress tests for the Firm and JPMorgan Chase Bank, N.A. under the supervisory “severely adverse” scenarios provided by the Federal Reserve and the OCC. In December 2024, the Federal Reserve indicated in a press release that it intends to seek public comment on changes to its stress testing framework. Additionally, there is a pending legal challenge to the manner in which stress testing is administered. Refer to Litigation and regulatory challenges on pages 6-7 for further information.\nRefer to Capital Risk Management on pages 97–107 and Liquidity Risk Management on pages 108–115 for more information.\nEnhanced prudential standards\n. As part of its mandate to identify and monitor risks to the financial stability of the U.S. posed by large banking organizations, the Financial Stability Oversight Council (“FSOC”) recommends prudential standards and reporting requirements to the Federal Reserve for systemically important financial institutions (“SIFIs”), such as JPMorganChase. The Federal Reserve has adopted several rules to implement those heightened prudential standards, including rules relating to risk management and corporate governance of subject BHCs. JPMorganChase is required under these rules to comply with enhanced liquidity and overall risk management standards, including oversight by the board of directors of risk management activities.\nHolding company as a source of strength.\nJPMorgan Chase & Co. is required to serve as a source of financial strength for its depository institution subsidiaries and to commit resources to support those subsidiaries, including when directed to do so by the Federal Reserve.\nRegulation of acquisitions\n. Acquisitions by BHCs and their banks are subject to requirements, limitations and prohibitions established by law and by the Federal Reserve and the OCC. For example, FHCs and BHCs are required to obtain the approval of the Federal Reserve before they acquire more than 5% of the voting shares of an unaffiliated bank. In addition, acquisitions by financial companies are generally prohibited if, as a result of the acquisition, the total liabilities of the financial company would exceed 10% of the total liabilities of all financial companies, as determined under Federal Reserve regulations. Furthermore, for certain acquisitions, the Firm must provide written notice to the Federal Reserve prior to acquiring direct or indirect ownership or control of any voting shares of any company with over $10 billion in assets that is engaged in activities that are “financial in nature.” Moreover, while FHCs may engage in a\nbroader range of activities (including acquisitions) than BHCs, the Federal Reserve has the authority to limit an FHC’s ability to conduct otherwise permissible acquisitions if the FHC or any of its depository institution subsidiaries ceases to meet applicable eligibility requirements.\n. The Firm is subject to a five-year cooperation obligation under an order issued by the CFTC on September 29, 2020, relating to precious metals and U.S. Treasuries markets investigations. The Firm also remains subject to consent orders entered into in March 2024 with the OCC and the Board of Governors of the Federal Reserve System, and a resolution entered into in May",
  "item7_clean": null,
  "item2_clean": null
}