{
  "source_file": "k-20241228.htm",
  "form_type": "10-K",
  "item1_clean": "ITEM 1. BUSINESS\nKellanova (formerly Kellogg Company), founded in 1906 and incorporated in Delaware in 1922, and its subsidiaries are engaged in the manufacture and marketing of snacks and convenience foods.\nThe address of the principal business office of Kellanova is 412 N. Wells Street, Chicago, Illinois 60654. Unless otherwise specified or indicated by the context, “Kellanova,” the \"Company,\" “we,” “us” and “our” refer to Kellanova, its divisions and subsidiaries.\nOn October 2, 2023, the Company completed the separation of its North America cereal business resulting in two independent companies, Kellanova and WK Kellogg Co. As a result of the distribution, Kellanova shareowners of record on September 21, 2023, received one share of WK Kellogg Co common stock for every four shares of Kellanova common stock.\nReported results were prepared in accordance with U.S. GAAP, include all net sales and expenses recognized during the periods, and reflect WK Kellogg Co as discontinued operations for fiscal years 2023 and 2022. All\namounts, percentages and disclosures for all periods presented reflect only the continuing operations of Kellanova unless otherwise noted. See the discussion in Item 1A. Risk Factors, Item 7. Management's Discussion and Analysis of Financial Condition and Results of Operations, and in Note 2 within Notes to the Consolidated Financial Statements, which are located herein under Part II, Item 8.\n. On August 13, 2024, we entered into an Agreement and Plan of Merger (the “Merger Agreement”) with Acquiror 10VB8, LLC, a Delaware limited liability company (“Acquiror”), Merger Sub 10VB8, LLC, a Delaware limited liability company and a wholly owned subsidiary of Acquiror (“Merger Sub”), and, solely for the limited purposes specified in the Merger Agreement, Mars, Incorporated, a Delaware corporation (“Mars”).\nCompletion of the Merger is subject to customary closing conditions, including the receipt of required regulatory approvals. At a special meeting of shareowners held on November 1, 2024, the Company's shareowners approved the Merger Agreement. Currently, the Company expects the Merger to close in the first half of 2025; however, the exact timing of the completion of the Merger, if at all, cannot be predicted with any certainty.\nThe Merger Agreement provides that, subject to the terms and conditions set forth therein, at the effective time of the Merger (the “Effective Time”), (1) Merger Sub will be merged with and into the Company (the “Merger”), with the Company continuing as the surviving corporation and a wholly owned subsidiary of Acquiror, and (2) each share of public common stock, par value $0.25 per share, of the Company issued and outstanding immediately prior to Effective Time (other than shares owned by (i) the Company or its subsidiaries or Mars or its subsidiaries (including Acquiror and its subsidiaries) or (ii) shareowners who have properly exercised and perfected appraisal rights under Delaware law) will be automatically cancelled and converted into the right to receive $83.50 per share in cash, without interest. Completion of the Merger is subject to customary closing conditions, including the receipt of required regulatory approvals.\nFinancial Information About Segments.\nInformation on segments is located in Note 18 within Notes to the Consolidated Financial Statements.\nOur principal products are snacks, such as crackers, savory snacks, toaster pastries, cereal bars, granola bars and bites; and convenience foods, such as, ready-to-eat cereals, frozen waffles, veggie foods and noodles. These products were, as of February 21, 2025, manufactured by us in 20 countries and marketed in more than 180 countries. They are sold to retailers and other customers through direct sales forces for resale to consumers. We use broker and distributor arrangements for certain products and channels, as well as in certain geographies.\nOur snacks brands are marketed under brands such as\nRXBAR\n. Our frozen foods are marketed under the\n\n, to supermarkets in the United States through a variety of distribution methods.\nAdditional information pertaining to the sales across our segments for the years 2022 through 2024 is located in Note 18 within Notes to the Consolidated Financial Statements, which are included herein under Part II, Item 8.\nEnvironmental, Social and Governance Leadership.\nKellanova’s vision is to be the world’s best snacks-led powerhouse, unleashing the full potential of our differentiated brands and passionate people. Our purpose is creating better days, and a place at the table for everyone, through our trusted food brands. Our vision and purpose are brought to life through our Better Days™ Promise, our promise to advance sustainable and equitable access to food by addressing the intersection of wellbeing, hunger, sustainability, and equity, diversity and inclusion for 4 billion people by the end of 2030 (from a 2015 baseline).\nKellanova Better Days™ Promise, is our promise to create better days for 4 billion people by the end of 2030 (from a 2015 baseline, unless otherwise indicated), includes the following commitments:\nNourishing 1.5 billion people with our foods and, in doing so, providing clear, science-based, front-of-pack nutrition labeling and by removing industrial trans fats from our recipes by the end of 2030.\nFeeding 400 million people facing food insecurity through food donations, expanded child feeding programs and disaster relief by the end of 2030.\nAdvancing the wellbeing of 250,000 people in our food value chain, from farming communities to processors, prioritizing support for vulnerable groups by the end of 2030.\nKellanova commits to reach net-zero GHG emissions across the value chain by 2050. Our net-zero target has been approved by the Science Based Targets initiative (SBTi).\nAchieving 100% renewable electricity by the end of 2030.\nReducing water use in global Kellanova-owned manufacturing facilities in high water stress regions by the end of 2030.\nReducing food waste across our global Kellanova-owned manufacturing facilities by the end of 2030 (from a 2016 baseline).\nWorking towards 100% reusable, recyclable or compostable packaging (by volume) by the end of 2030.\nResponsibly sourcing priority ingredients by the end of 2030.\nAnd, engaging 2 billion people in advocating for sustainable and equitable access to food by the end of 2030.\nClimate-Related Disclosure.\nClimate change and food security are considerations for Kellanova to ensure the long-term health and viability of the ingredients we use in our products. As a plant-based food company, the success of Kellanova is dependent on having timely access to high-quality, low-cost ingredients, water and energy for manufacturing globally. Risks are identified annually through annual reporting and evaluated in the short ( 6 years). These natural capital dependencies are at risk of shortage, price volatility, regulation, and quality impacts due to climate change which is assessed as part of Kellanova’s overall enterprise risk management approach. Specific risks including climate change, deforestation, water, plastics, and social accountability are specifically identified and assessed on a regular basis, especially in emerging market expansion that fuels company growth.\nDue to these risks, Kellanova has implemented short and long-term initiatives to mitigate and adapt to these environmental pressures, as well as the resulting challenge of food security. While these risks are not currently impacting business growth, they must be monitored, evaluated, and mitigated. The Company has incorporated the risks and opportunities of climate change and food security as part of the Differentiate, Drive, & Deliver Strategy and Kellanova Better Days™ Promise by continuing to identify risk, incorporate sustainability indicators into strategic priorities, and report regularly to leadership, the Board, and publicly.\nKellanova's Board of Directors, including its Social Responsibility and Public Policy Committee, oversees our Better Days™ Promise social and environmental purpose strategy. Our Senior Vice President Chief Global Corporate Affairs Officer, Senior Vice President Global Supply Chain, Senior Vice President Chief Global Human Resources Officer, Senior Vice President, Global Growth Officer and other executives who report to the Chairman and CEO, are responsible for successfully implementing the strategy and regularly updating the CEO and\nBoard Committee. Our Chief Sustainability Officer (CSO) reports to the Senior Vice President Chief Global Corporate Affairs Officer. Additionally, numerous leaders are accountable for achieving specific social and environmental commitments, based on their roles.\nIn addition, Kellanova has a Global Better Days™ Promise Council and Regional Better Days™ Promise Councils. The Councils ensure execution on priority strategies to maximize environmental and social performance, share best practices to ensure we are progressing against our commitments.\nAgricultural commodities, including corn, wheat, rice, potato flakes, vegetable oils, sugar and cocoa, are the principal raw materials used in our products. Cartonboard, corrugate, and flexible packaging are the principal packaging materials used by us. We continually monitor world supplies and prices of such commodities (which include such packaging materials), as well as government trade policies. The cost of such commodities may fluctuate widely due to changes in government policy and regulation (including as a result of new or increased tariffs), changing weather patterns and conditions, climate change, and other supply and/or demand impacting events such as pandemics, geopolitical events, wars or other unforeseen circumstances. Continuous efforts are made to maintain and improve the quality and supply of such commodities for purposes of our short-term and long-term requirements.\nThe principal ingredients in the products produced by us in the United States include wheat and wheat-based ingredients, potato flakes, oats, rice, cocoa and chocolate, soybeans and soybean derivatives, various fruits, sugars and sweeteners, vegetable oils, dairy products, eggs, and other ingredients, which are obtained from various sources. While most of these ingredients are purchased from sources in the United States, some materials are imported due to regional availability and specification requirements.\nWe enter into long-term contracts for the materials described in this section and purchase these items on the open market, depending on our view of possible price fluctuations, supply levels, and our relative negotiating power. Although we are unable to predict the impact to our ability to source these materials and services in the future, and supply pressures have decreased, weather and geopolitical issues could result in other disruptions and logistical delays in 2025. As further discussed herein under Part II, Item 7A, we also use commodity futures and options to hedge some of our costs.\nRaw materials and packaging needed for internationally based operations are available in adequate supply and are sourced both locally and imported from countries other than those where used in manufacturing.\nNatural gas and propane are the primary sources of energy used to power processing equipment at major domestic and international facilities, although certain locations may use electricity, oil, propane or solar cells as needed. In addition, considerable amounts of diesel fuel are used in connection with the distribution of our products.\n\nthe Seal) for certain cereal products; and\nfor Pringles crisps.\nare used in connection with our frozen waffles, pancakes and French toast sticks, and\nused in connection with potato crisps and crackers are also important Kellanova trademarks.\nThe trademarks listed above, among others, individually and when taken as a whole, are important to our business. Certain individual trademarks are also important to our business.",
  "item7_clean": "This filing includes non-GAAP financial measures that we provide to management and investors that exclude certain items that we do not consider part of on-going operations. Reported results were prepared in accordance with U.S. GAAP, include all net sales and expenses recognized during the periods. Items excluded from our non-GAAP financial measures are discussed in the \"Significant items impacting comparability\" section of this filing. Our management team consistently utilizes a combination of GAAP and non-GAAP financial measures to evaluate business results, to make decisions regarding the future direction of our business, and for resource allocation decisions, including incentive compensation. As a result, we believe the presentation of both GAAP and non-GAAP financial measures provides investors with increased transparency into financial measures used by our management team and improves investors’ understanding of our underlying operating performance and in their analysis of ongoing operating trends. All historic non-GAAP financial measures have been reconciled with the most directly comparable GAAP financial measures.\nNon-GAAP Financial Measures\nNon-GAAP financial measures used for evaluation of performance include currency-neutral and organic net sales, adjusted and currency-neutral adjusted operating profit, adjusted and currency-neutral adjusted diluted earnings per share (EPS), adjusted and currency-neutral adjusted gross profit, adjusted and currency neutral adjusted gross margin, net debt and cash flow. We determine currency-neutral results by dividing or multiplying, as appropriate, the current-period local currency operating results by the currency exchange rates used to translate our financial statements in the comparable prior-year period to determine what the current period U.S. dollar operating results would have been if the currency exchange rate had not changed from the comparable prior-year period. These non-GAAP financial measures may not be comparable to similar measures used by other companies.\nCurrency-neutral net sales and organic net sales\n: We adjust the GAAP financial measure to exclude the impact of foreign currency, resulting in currency-neutral net sales. In addition, we exclude the impact of\nacquisitions, divestitures, and foreign currency, resulting in organic net sales. We excluded the items which we believe may obscure trends in our underlying net sales performance. By providing these non-GAAP net sales measures, management intends to provide investors with a meaningful, consistent comparison of net sales performance for the Company and each of our reportable segments for the periods presented. Management uses these non-GAAP measures to evaluate the effectiveness of initiatives behind net sales growth, pricing realization, and the impact of mix on our business results. These non-GAAP measures are also used to make decisions regarding the future direction of our business, and for resource allocation decisions.\nAdjusted: gross profit, gross margin, operating profit, operating margin, and diluted EPS\n: We adjust the GAAP financial measures to exclude the effect of restructuring programs, costs of the separation transaction\ncosts of the proposed merger, mark-to-market adjustments for pension plans (service cost, interest cost, expected return on plan assets, and other net periodic pension costs are not excluded), commodity contracts, certain equity investments and certain foreign currency contracts, and other costs impacting comparability resulting in adjusted. We excluded the items which we believe may obscure trends in our underlying profitability. By providing these non-GAAP profitability measures, management intends to provide investors with a meaningful, consistent comparison of the Company's profitability measures for the periods presented. Management uses these non-GAAP financial measures to evaluate the effectiveness of initiatives intended to improve profitability, as well as to evaluate the impacts of inflationary pressures and decisions to invest in new initiatives within each of our segments.\nCurrency-neutral adjusted: gross profit, gross margin, operating profit, operating margin, and diluted EPS\n: We adjust the GAAP financial measures to exclude the effect of restructuring programs, costs of the separation transaction, costs of the proposed merger, mark-to-market adjustments for pension plans (service cost, interest cost, expected return on plan assets, and other net periodic pension costs are not excluded), commodity contracts, certain equity investments and certain foreign currency contracts, other costs impacting comparability, and foreign currency, resulting in currency-neutral adjusted. We excluded the items which we believe may obscure trends in our underlying profitability. By providing these non-GAAP profitability measures, management intends to provide investors with a meaningful, consistent comparison of the Company's profitability measures for the periods presented. Management uses these non-GAAP financial measures to evaluate the effectiveness of initiatives intended to improve profitability, as well as to evaluate the impacts of inflationary pressures and decisions to invest in new initiatives within each of our segments.\nAdjusted other income (expense):\nWe adjust the GAAP financial measure to exclude the effect of restructuring programs, mark-to-market adjustments for pension plans (service cost, interest cost, expected return on plan assets, and other net periodic pension costs are not excluded) and certain equity investments, losses resulting from divestitures, and other costs impacting comparability. We excluded the items which we believe may obscure trends in our underlying profitability. By providing this non-GAAP measure, management intends to provide investors with a meaningful, consistent comparison of the Company's other income (expense), excluding the impact of the items noted above, for the periods presented. Management uses these non-GAAP financial measures to evaluate the effectiveness of initiatives intended to improve profitability.\nAdjusted effective income tax rate:\nWe adjust the GAAP financial measures to exclude the effect of restructuring programs, costs of the separation transaction, costs of the proposed merger, mark-to-market adjustments for pension plans (service cost, interest cost, expected return on plan assets, and other net periodic pension costs are not excluded), commodity contracts, certain equity investments, and certain foreign currency contracts, and other costs impacting comparability\nWe excluded the items which we believe may obscure trends in our pre-tax income and the related tax effect of those items on our adjusted effective income tax rate, and other impacts to tax expense. By providing this non-GAAP measure, management intends to provide investors with a meaningful, consistent comparison of the Company's effective tax rate, excluding the pre-tax income and tax effect of the items noted above, for the periods presented. Management uses this non-GAAP measure to monitor the effectiveness of initiatives in place to optimize our global tax rate.\n: Defined as the sum of long-term debt, current maturities of long-term debt and notes payable, less cash and cash equivalents, and marketable securities. With respect to net debt, cash and cash equivalents, and marketable securities are subtracted from the GAAP measure, total debt liabilities, because they could be used to reduce the Company’s debt obligations. Company management and investors use this non-GAAP measure to evaluate changes to the Company's capital structure and credit quality assessment.\n: Defined as net cash provided by operating activities reduced by expenditures for property additions. Free cash flow does not represent the residual cash flow available for discretionary expenditures. We use this non-GAAP financial measure of free cash flow to focus management and investors on the amount of cash available for debt repayment, dividend distributions, acquisition opportunities, and share repurchases once all of the Company’s business needs and obligations are met. Additionally, certain performance-based compensation includes a component of this non-GAAP measure.\nThese measures have not been calculated in accordance with GAAP and should not be viewed as a substitute for GAAP reporting measures.\nSignificant items impacting comparability\n\nDuring the second quarter of 2024, Kellanova issued $300 million of thirty-year 5.75% Notes due 2054, resulting in net proceeds after discount and underwriting commissions of $296 million. Additionally, during the second quarter of 2024, Kellanova issued €300 million of ten-year 3.75% Notes due 2034, resulting in net proceeds after discount and underwriting commissions of €297 million. The proceeds from these notes were used for general corporate purposes, including the payment of offering related fees and expenses, repayment of a portion of the €600 million 1.00% Notes when they matured on May 17, 2024.\nIn November 2023, we repaid $550 million, seven-year 2.65% U.S. Dollar Notes due 2023, upon maturity.\nDuring the first quarter of 2023, the Company issued $400 million of ten-year 5.25% Notes due 2033, resulting in net proceeds after discount and underwriting commissions of $396 million. The proceeds from these notes were used for general corporate purposes, including the payment of offering related fees and expenses, repayment of the $210 million 2.75% Notes when they matured on March 1, 2023, and repayment of a portion of commercial paper borrowings. The Notes contain customary covenants that limit the ability of the Company and its restricted subsidiaries (as defined) to incur certain liens or enter into certain sale and lease-back transactions, as well as a change of control provision.\nIn November 2022, we repaid €600 million, five-year 0.80% Euro Notes due 2022, upon maturity.\nWe paid quarterly dividends to shareholders totaling $2.26 per share in 2024 versus $2.34 per share in 2023. On February 21, 2025, the Board of Directors declared a dividend of $.57 per common share, payable on March 14, 2025 to shareholders of record at the close of business on March 3, 2025.\nWe entered into an unsecured Five-Year Credit Agreement in December 2021, allowing us to borrow, on a revolving credit basis, up to $1.5 billion and expiring in December 2026.\nIn December 2024, we entered into an unsecured 364-Day Credit Agreement to borrow, on a revolving credit basis, up to $750 million at any time outstanding, to replace the $1.0 billion 364-day facility that was set to expire in December 2024.\nThe Five-Year and 364 Day Credit Agreements which had no outstanding borrowings as of December 28, 2024, contain customary covenants and warranties, including specified restrictions on indebtedness, liens and a specified interest expense coverage ratio. If an event of default occurs, then, to the extent permitted, the administrative agents may terminate the commitments under the credit facilities, accelerate any outstanding loans under the agreements, and demand the deposit of cash collateral equal to the lender's letter of credit exposure plus interest. The Company was in compliance with all financial covenants contained in these agreements at December 28, 2024.\nOur Notes contain customary covenants that limit the ability of the Company and its restricted subsidiaries (as defined) to incur certain liens or enter into certain sale and lease-back transactions and also contain a change of control provision. There are no significant restrictions on the payment of dividends. We were in compliance with all covenants as of December 28, 2024.\nThe Notes do not contain acceleration of maturity clauses that are dependent on credit ratings. A change in our credit ratings could limit our access to the U.S. short-term debt market and/or increase the cost of refinancing long-term debt in the future. However, even under these circumstances, we would continue to have access to our 364-Day Credit Facility, which expires in December 2025, as well as our Five-Year Credit Agreement, which expires in December 2026. This source of liquidity is unused and available on an unsecured basis, although we do not currently plan to use it.\nWe monitor the financial strength of our third-party financial institutions, including those that hold our cash and cash equivalents as well as those who serve as counterparties to our credit facilities, our derivative financial instruments, and other arrangements.\nWe continue to believe that we will be able to meet our interest and principal repayment obligations and maintain our debt covenants for the foreseeable future, while still meeting our operational needs, including the pursuit of select acquisitions. This will be accomplished through our strong cash flow, our short-term borrowings, and our maintenance of credit facilities on a global basis.\nMonetization and Accounts Payable Tracking Systems\nWe have a program in which customers could extend their payment terms in exchange for the elimination of early payment discounts (Extended Terms Program). In order to mitigate the net working capital impact of the Extended Terms Program for discrete customers, we entered into agreements to sell, on a revolving basis, certain trade accounts receivable balances to third party financial institutions (Monetization Programs). Transfers under the Monetization Programs are accounted for as sales of receivables resulting in the receivables being de-recognized from our Consolidated Balance Sheet. The Monetization Programs provide for the continuing sale of certain receivables on a revolving basis until terminated by either party; however the maximum funding from receivables\nthat may be sold at any time is currently $975 million, but may be increased or decreased as customers move in or out of the Extended Terms Program and as additional financial institutions move in or out of the Monetization Programs. Accounts receivable sold of $653 million and $697 million remained outstanding under this arrangement as of December 28, 2024 and December 30, 2023, respectively.\nThe Monetization Programs are designed to directly offset the impact the Extended Terms Program would have on the days-sales-outstanding (DSO) metric that is critical to the effective management of the Company's accounts receivable balance and overall working capital. Current DSO levels within North America are consistent with DSO levels prior to the execution of the Extended Term Program and Monetization Programs.\nRefer to Note 3 within Notes to Consolidated Financial Statements for further information related to the sale of accounts receivable.\nWe have agreements with third parties to provide accounts payable tracking systems which facilitate participating suppliers’ ability to monitor and, if elected at their discretion, make offers to sell one or more of our payment obligations prior to their scheduled due dates at a discounted price to participating financial institutions. We have no economic interest in the sale of these suppliers’ receivables and no direct financial relationship with the financial institutions concerning these services. Our obligations to our suppliers, including amounts due and scheduled payment dates, are not impacted by suppliers’ decisions to sell amounts under the arrangements. However, our right to offset balances due from suppliers against payment obligations is restricted by the agreements for those payment obligations that have been sold by suppliers.\nRefer to Note 1 within Notes to Consolidated Financial Statements for further information related to accounts payable.\nIf financial institutions were to terminate their participation in the Monetization Programs and we are not able to modify related customer payment terms, working capital could be negatively impacted. Additionally, working capital could be negatively impacted if we shorten our supplier",
  "item2_clean": null
}