{
  "source_file": "kdp-20241231.htm",
  "form_type": "10-K",
  "item1_clean": "We have strategically-located distribution capabilities, which enable us to better align our operations with our customers and our sales channels, to ensure our products are available to meet consumer demand, to reduce transportation costs, and to have greater control over the timing and coordination of new product launches. We actively manage transportation of our products using our fleet (owned and leased) of approximately 7,100 vehicles in the U.S. and 2,200 in Mexico, as well as third party logistics providers.\nWith our Keurig.com website, we have a leading direct-to-consumer e-commerce platform which provides us insights and expertise in the e-commerce channel. We have been able to translate those insights and experiences to our LRB business as the number of fulfillment options that are better suited economically for beverages has evolved, leading to growth in the e-commerce channel. We continually invest in digital tools and capabilities as part of our route-to-market strategy, and as one element of a holistic digital transformation across KDP.\nShape our now and next beverage portfolio.\nWe have cultivated relationships with leading beverage brands to create long-term partnerships that enable us and our partners to benefit equitably in future value creation, and where appropriate, we bring these partner brands into our owned portfolio through acquisitions. We continually evaluate making investments in companies that fill in whitespace in our portfolio.\nGenerate fuel for growth.\nWe focus on critical transformational investments that drive continuous productivity and network optimization. We also maintain an emphasis on lean overheads in order to drive increasing operating leverage and fund our investments in our growth opportunities.\nDynamically allocate capital.\n\nOUR PRODUCTS AND OPERATING STRUCTURE\nWe are a leading integrated brand owner, manufacturer, and distributor of beverages in the U.S., Canada, Mexico, and the Caribbean.\nOperating and Reportable Segments\nAs of December 31, 2024, our operating structure consists of three operating and reportable segments: U.S. Refreshment Beverages, U.S. Coffee, and International. Segment financial data, including financial information about foreign and domestic operations, is included in Note 8 of the Notes to our Consolidated Financial Statements.\nU.S. Refreshment Beverages\nOur U.S. Refreshment Beverages segment is a brand owner, manufacturer, and distributor of LRBs in the U.S. In this segment, we manufacture and distribute beverage concentrates, syrups, and finished beverages of our brands to third-party bottlers, distributors, retailers, and, ultimately, the end consumer.\nWe manufacture beverage concentrates and syrups, which we then sell throughout the U.S. to third party bottlers or use them in our own manufacturing systems. Beverage concentrates, which are highly concentrated proprietary flavors, are combined with carbonation, water, sweeteners, and other ingredients, packaged in cans, bottles, or other packaging, and sold as a packaged beverage to retailers and, ultimately, the end consumer. Beverage concentrates are also manufactured into syrup, which is shipped to fountain customers, such as fast food restaurants, who mix the syrup with water and carbonation to create a finished beverage at the point of sale to consumers. Dr Pepper represents most of our fountain channel volume.\nWe manufacture and distribute finished beverages of our own beverage brands. Additionally, in order to maximize the size and scale of our manufacturing and distribution operations, we also distribute finished beverages for our partner brands and manufacture finished beverages for other third parties, including partners and private labels. We partner with other brands seeking effective route-to-market capabilities, including national selling and distribution scale. These brands can also give us exposure in certain markets to fast growing segments of the beverage industry in a capital-efficient manner. We sell finished beverages through our DSD and our WD systems, both of which include sales to all major retail channels.\nKey brands in this segment include Dr Pepper, Canada Dry, Mott’s, A&W, 7UP, Snapple, Sunkist soda, Squirt, C4 Energy, Hawaiian Punch, Electrolit, Core Hydration, Bai, Evian, Clamato, Yoo-Hoo, Vita Coco, and Big Red.\nOur U.S. Coffee segment is primarily a brand owner, manufacturer, and distributor of innovative single serve brewers, specialty coffee (including hot and iced varieties), and RTD coffee in the U.S. Our Keurig single serve brewers are aimed at changing the way consumers prepare and enjoy coffee and other beverages both at home and away from home in places such as offices, hotels, restaurants, cafeterias, and convenience stores. We create value by developing and selling our Keurig single serve brewers and by expanding Keurig brewer household adoption, which enables sales of specialty coffee and a variety of other specialty beverages in K-Cup pods (including hot and iced teas, hot cocoa, and other beverages) for use with Keurig brewers. We also compete in the broader coffee category through traditional whole bean and ground coffee in other package types, including bags, fractional packages, and cans, as well as RTD coffee beverages. We, together with our partners, are able to bring consumers high-quality coffee and other beverage experiences from the brands they love, all through the one-touch simplicity and convenience of Keurig brewers.\nWe manufacture and sell 100% of the K-Cup pods of our owned and licensed brands, including Green Mountain Coffee Roasters, The Original Donut Shop, and McCafé, to retailers, away from home channel participants, and end-use consumers. We manufacture K-Cup pods for our partner brands, who in turn sell them to retailers and consumers. Our partner brands include Starbucks, Dunkin', Folgers, and Peet's, among others. We have agreements for manufacturing, distributing, and selling K-Cup pods for tea under brands such as Celestial Seasonings and Bigelow. We produce and sell K-Cup pods for cocoa, including through a licensing agreement for the Swiss Miss brand, and hot apple cider, including under our own brand, Mott's. Generally, we are able to sell these partner brands to our away from home channel participants and directly to consumers through our website at www.keurig.com. We also participate in private label manufacturing arrangements.\n\nOur U.S. Coffee segment manufactures K-Cup pods using freshly roasted and ground coffee as well as tea, cocoa, and other products. We offer high-quality, responsibly sourced coffee, including certified single-origin, organic, flavored, limited edition, and proprietary blends. We carefully select our coffee beans and roast them to optimize their taste and flavor differences. We engineer and design most of our single serve brewers and utilize third-party contract manufacturers located in various countries in Asia for brewer appliance manufacturing. We distribute our brewers using third-party distributors, retail partners and directly to consumers through our website at www.keurig.com.\nOur International segment includes:\nSales in Canada, Mexico, and other international markets from the manufacture and distribution of branded concentrates, syrup, and finished beverages, including sales of our own brands and third-party brands, to third-party bottlers, distributors, and retailers. Key beverage brands include Peñafiel, Clamato, Squirt, Canada Dry, Dr Pepper, Mott’s, and Crush.\nSales in Canada from the manufacture and distribution of finished goods relating to our single serve brewers, K-Cup pods, and other coffee products to partners and retailers, as well as directly to consumer through our website at www.keurig.ca. Key K-Cup pod brands include McCafé, Tim Hortons, and Van Houtte, as well as other partner and private label brands.\nProduct Innovation and New Partnerships\nWe are focused on a robust innovation pipeline within our portfolio of products to build household penetration of our business. We regularly launch new brewers with new features and benefits, technological advances, sustainable attributes, and changes in aesthetics to provide a variety of options to suit individual consumer preferences. We also continuously innovate and renovate our portfolio of K-Cup pods and beverages to provide an expansive array of flavors.\nEffective December 31, 2024, we acquired a controlling interest in GHOST. Founded in 2016, GHOST is a lifestyle sports nutrition business with a portfolio anchored by GHOST Energy, a leading ready-to-drink energy brand. We initially purchased a 60% stake in GHOST, and we also entered into an agreement which requires us to buy the remaining 40% of GHOST in 2028.\nDuring 2024, we launched our Keurig K-Brew+Chill brewer that features Quick Chill Technology which delivers iced beverages at temperatures below 60 degrees straight from the brewer, as well as the ability to brew hot beverages. In addition, we announced our multi-year innovation agenda with the Keurig Alta brewer and K-Rounds plastic- and aluminum-free pods.\nWe debuted Canada Dry Fruit Splash, which partners classic ginger ale with cherry flavors and a splash of real fruit juice, as well as a limited edition offering of Dr Pepper Creamy Coconut. We launched Mott’s Active, a hydrating juice beverage for kids with naturally sourced electrolytes, no added sugar, and no artificial flavors, in Blastin’ Berry and Watermelon Burst.\nWe entered into new partnerships with The Brooklyn Roasting Company, Kahawa 1893, Killah Coffee, and Punk Bunny Coffee, among others, to provide their signature coffee blends in K-Cup pod format.\nWe expanded our partnership with Black Rifle Coffee Company to include a sales and distribution agreement for Black Rifle Energy. We also entered into an agreement with Nutrabolt to distribute Bloom RTD energy beverages. We began distributing under both of these agreements during the fourth quarter of 2024.\n\nCUSTOMERS\nWe primarily serve the following types of customers:\nRetailers include supermarkets, hypermarkets, mass merchandisers, club stores, e-commerce retailers, office superstores, vending machines, fountains, grocery and drug stores, convenience stores, and other small outlets. Retailers purchase finished beverages, K-Cup pods, appliances, and accessories directly from us. Our portfolio of strong brands, operational scale and experience in the beverage industry has enabled us to maintain strong relationships with major retailers throughout the U.S., Canada, and Mexico. Our largest retailer, Walmart, represented approximately 16% of our consolidated net sales in 2024. Net sales to Walmart are included in all reportable segments.\nBottlers and Distributors\nIn the U.S. and Canada, we generally grant manufacturing and distribution licenses for our carbonated soft drinks to bottlers for specific geographic areas that are typically exclusive and long-term. These bottlers may be affiliated with Coca-Cola or with PepsiCo, or they may be independent. These agreements prohibit bottlers and distributors from selling the licensed products outside their exclusive territory and from selling any imitative products in that territory. Generally, we may terminate bottling and distribution agreements only for cause or change in control, and the bottler or distributor may terminate without cause upon giving certain specified notice and complying with other applicable conditions. These bottlers and distributor agreements may also contain provisions for fountain distribution rights, which are not exclusive for a territory, but generally do restrict bottlers from carrying imitative product in the territory.\nCertain other brands, such as Snapple, Bai, and Core, are licensed for distribution in various territories to bottlers and a number of smaller distributors such as beer wholesalers, wine and spirit distributors, independent distributors, and retail brokers.\nWe have differentiat",
  "item7_clean": "Sales volumes for the year ended December 31, 2024 increased approximately 1.0% compared to the prior year period. Growth in carbonated soft drinks and the contributions from partnerships, such as Electrolit and C4, was partially offset by softness in our still beverages portfolio.\nNet sales increased 5.8% to $9,331 million in the year ended December 31, 2024, compared to $8,821 million in the prior year period, driven by favorable net price realization of 3.1% and volume/mix growth of 2.7%.\nIncome from Operations.\nIncome from operations decreased $605 million, or 24.4%, to $1,878 million for the year ended December 31, 2024 compared to $2,483 million for the prior year period. This decrease was primarily driven by the non-cash goodwill and intangible impairment charges (29 percentage points) and the accrued termination fee associated with ABI (9 percentage points). Other drivers include the benefit to gross profit of net sales growth (13 percentage points), a net benefit from changes in ingredients, materials, and productivity (3 percentage points), and earned equity from the achievement of milestones associated with certain distribution agreements (3 percentage points), partially offset by increased transportation and warehousing expenses (3 percentage points).\nThe following table provides selected information about our U.S. Coffee segment’s results:\nFor the Year Ended December 31,\n\nThe following table provides the percentage change in sales volumes for the International segment compared to the prior year period:\nLRB\nNet sales increased 6.8% to $2,053 million in the year ended December 31, 2024, compared to $1,922 million in the prior year period, reflecting volume/mix growth of 6.2% and higher net price realization of 3.0%, partially offset by unfavorable FX translation of 2.4%.\nIncome from Operations.\nIncome from operations increased $70 million, or 14.7%, to $545 million for the year ended December 31, 2024 compared to $475 million in the prior year period. This performance reflected the gross profit impact of volume/mix growth and higher net price realization (25 percentage points) and a net benefit from changes in ingredients, materials, and productivity (5 percentage points), partially offset by increased transportation and warehousing expenses (5 percentage points) and higher marketing investment (5 percentage points).\nLIQUIDITY AND CAPITAL RESOURCES\nWe believe our financial condition and liquidity remain strong. We continue to manage all aspects of our business, including, but not limited to, monitoring the financial health of our customers, suppliers, and other third-party relationships, implementing gross margin enhancement strategies through our productivity initiatives, and developing new opportunities for growth such as innovation and agreements with partners to distribute brands that are accretive to our portfolio.\nCash generated by our foreign operations is generally repatriated to the U.S. periodically as working capital funding requirements, where allowed. We do not expect restrictions or taxes on repatriation of cash held outside the U.S. to have a material effect on our overall business, liquidity, financial condition, or results of operations for the foreseeable future.\nThe following summarizes our cash activity for the years ended December 31, 2024, 2023, and 2022:\nPrincipal Sources of Capital Resources\nOur principal sources of liquidity are our existing cash and cash equivalents, cash generated from our operations, and borrowing capacity currently available under our Revolving Credit Agreement and our Term Loan Agreement. Additionally, we have an uncommitted commercial paper program where we can issue unsecured commercial paper notes on a private placement basis. Based on our current and anticipated level of operations, we believe that our operating cash flows will be sufficient to meet our anticipated obligations for the next twelve months and thereafter for the foreseeable future. To the extent that our operating cash flows are not sufficient to meet our liquidity needs, we may utilize cash on hand or amounts available under our financing arrangements, if necessary. At any time, and from time to time, we may seek additional deleveraging, refinancing, or liquidity enhancing transactions, including entering into transactions to repurchase or redeem outstanding indebtedness or otherwise seek transactions to reduce interest expense, extend debt maturities, and improve our capital and liquidity structure\nSources of Liquidity - Operations\nNet cash provided by operating activities increased $890 million for the year ended December 31, 2024, as compared to the year ended December 31, 2023, driven by the favorable comparison in working capital versus the prior year period.\nCash Conversion Cycle\nOur cash conversion cycle is defined as DIO and DSO less DPO. The calculation of each component of the cash conversion cycle is provided below:\nCalculation (on a trailing twelve month basis)\nDIO\n(Average inventory divided by cost of sales) * Number of days in the period\nDSO\n(Accounts receivable divided by net sales) * Number of days in the period\nDPO\n(Accounts payable * Number of days in the period) divided by cost of sales and SG&A expenses\nThe following table summarizes our cash conversion cycle:\nDIO\n\nOur cash conversion cycle increased 20 days to approximately 12 days as of December 31, 2024 as compared to (8) days as of December 31, 2023, which was primarily driven by the decrease in DPO, reflecting the reduction of payment terms for certain suppliers.\nAccounts Payable Program\nWe work with our suppliers to optimize our terms and conditions, which includes payment terms. Excluding our suppliers who require cash at date of purchase or sale, our current payment terms with our suppliers generally range from 10 to 360 days. We also enter into agreements with third party administrators to allow participating suppliers to track payment obligations from us, and, if voluntarily elected by the supplier, sell payment obligations from us to financial institutions. Suppliers can sell one or more of our payment obligations at their sole discretion and our rights and obligations to our suppliers are not impacted. We have no economic interest in a supplier’s decision to enter into these agreements and no direct financial relationship with the financial institutions. Our obligations to our suppliers, including amounts due and scheduled payment terms, are not impacted. Refer to Note 2 of the Notes to our Consolidated Financial Statements for additional information on our obligations to participating suppliers.\nSources of Liquidity - Financing\nNote 3 of the Notes to our Consolidated Financial Statements for management's discussion of our financing arrangements.\nWe also have an active shelf registration statement, filed with the SEC on August 19, 2022, which allows us to issue an indeterminate number or amount of common stock, preferred stock, debt securities, and warrants from time to time in one or more offerings at the direction of our Board.\nOur credit ratings are as follows:\nLong-Term Debt Rating\nCommercial Paper Rating\nP-2\nS&P\nBBB\nA-2\nThese debt and commercial paper ratings impact the interest we pay on our financing arrangements. A downgrade of one or both of our debt and commercial paper ratings could increase our interest expense and decrease the cash available to fund anticipated obligations.\nAs of December 31, 2024, we were in compliance with all debt covenants and we have no reason to believe that we will be unable to satisfy these covenants.\nPrincipal Uses of Capital Resources\nOur capital allocation priorities are investing to grow our business both organically and inorganically, continuing to strengthen our balance sheet, and returning cash to shareholders through regular quarterly dividends and opportunistic share repurchases. We dynamically adjust our cash deployment plans based on the specific opportunities available in a given period, but over time we allocate capital to balance each of these priorities.\nRegular Quarterly Dividends\nWe have declared total dividends of $0.89 per share and $0.83 per share for the years ended December 31, 2024 and 2023, respectively.\nRepurchases of Common Stock\nOur Board authorized a four-year share repurchase program, ending December 31, 2025, of up to $4 billion of our outstanding common stock. Repurchases and retirements of common stock, including payments on our share excise tax obligation, were $1,110 million and $706 million during the years ended December 31, 2024 and 2023, respectively. As of December 31, 2024, $1,810 million remained available for repurchase under the authorized share repurchase program.\nCapital Expenditures\nPurchases of property, plant, and equipment were $563 million and $425 million for the years ended December 31, 2024 and 2023, respectively.\nCapital expenditures, which includes both purchases of property, plant, and equipment and amounts included in accounts payable and accrued expenses, for the years ended December 31, 2024 and 2023, primarily related to investments in manufacturing capabilities, both in the U.S. and internationally. Capital expenditures included in accounts payable and accrued expenses were $220 million and $276 million for the years ended December 31, 2024 and 2023, respectively, which primarily related to these investments.\nInvestments in Unconsolidated Affiliates\nFrom time to time, we invest in beverage startup companies or in brand ownership companies to grow our presence in certain product categories, or enter into various licensing and distribution agreements to expand our product portfolio. Our investments generally involve acquiring a minority interest in equity securities of a company, in certain cases with a protected path to ownership at our future option. Investments in unconsolidated affiliates were $7 million and $316 million for the years ended December 31, 2024 and 2023, respectively.\nAcquisitions of Businesses and Purchases of Intangible Assets\nWe have invested in the expansion of our DSD network through transactions with strategic independent bottlers or third-party brand ownership companies to enhance competitive distribution scale. From time to time, we additionally acquire brand ownership companies to expand our portfolio. These transactions could be accounted for either as an acquisition of a business or as an asset acquisition, if the majority of the transaction price represents the acquisition of a single intangible asset. During the year ended December 31, 2024, we completed several acquisitions. Refer to Note 4 of the Notes to our Consolidated Financial Statements for further information about these acquisitions. Purchases of intangible assets were $59 million and $56 million for the years ended December 31, 2024 and 2023, respectively.\nRESIDUAL VALUE GUARANTEES\nWe have a number of leasing arrangements and one licensing arrangement with VIEs for which we are not the primary beneficiary. Each one of these arrangements contain an RVG. As of December 31, 2024, we have not recorded any liabilities as it is not probable that we will have to make any payments required under the RVGs. Refer to Note 19 of the Notes to our Consolidated Financial Statements for further information.\nUNCERTAINTIES AND TRENDS AFFECTING LIQUIDITY AND CAPITAL RESOURCES\nDisruptions in financial and credit markets, including those caused by global economic uncertainty and fluctuations in interest rates, may impact our ability to manage normal commercial relationships with our customers, suppliers, and creditors. These disruptions could have a negative impact on the ability of our customers to timely pay their obligations to us, thus reducing our cash flow, or the ability of our vendors to timely supply materials.\nWe believe that the following events, trends and uncertainties may also impact liquidity:\nOur ability to either repay existing debt maturities through cash flow from operations or refinance through future issuances of senior unsecured notes;\nOur ability to access and/or renew our committed financing arrangements\nOur ability to issue unsecured uncommitted commercial paper notes on a private placement basis;\nFuture mergers, acquisitions, or debt or equity investments, which may include brand ownership companies, regional bottling companies, distributors, and/or distribution rights to further extend our geographic coverage;\nSeasonality and other variability in our operating cash flows, which could impact short-term liquidity;\nOur continued payment of regular quarterly dividends;\nFuture repurchases of our common stock or special dividends to drive total shareholder return;\nOur continued capital expenditures;\nFluctuations in our tax obligations; and\nA potential significant downgrade in our credit ratings, which could limit i) our ability to issue debt at terms that are favorable to us, or ii) a financial institution's willingness to participate in our accounts payable program and reduce the attractiveness of the accounts payable program to participating suppliers who may sell payment obligations from us to financial institutions, which could impact our accounts payable program.\nCRITICAL ACCOUNTING ESTIMATES\nThe process of preparing our consolidated\nstatements in conformity with U.S. GAAP requires the use of estimates and judgments that affect the reported amounts of assets, liabilities, revenue, and expenses. Critical accounting estimates are both fundamental to the portrayal of a company’s financial condition and results and require difficult, subjective or complex estimates and assessments. These estimates and judgments are based on historical experience, future expectations and other factors and assumptions we believe to be reasonable under the circumstances. The most significant estimates and judgments are reviewed on an ongoing basis and revised when necessary. We have not made any material changes in the accounting methodology we use to assess or measure our critical accounting estimates. We have identified the items described below as our critical accounting estimates. We do not believe there is a reasonable likelihood that there will be a material change in the future estimates or assumptions we use in our critical accounting estimates. However, if actual results are not consistent with our estimates or assumptions, we may be exposed to gains or losses that could be material to our consolidated financial statements. See Note 2 of the Notes to our Consolidated Financial Statements for a discussion of these and other accounting policies.\nImpairment Assessment of Goodwill and Other Indefinite Lived Intangible Assets\nWe conduct tests for impairment of our goodwill and our other indefinite lived intangible assets annually, as of October 1, or more frequently if events or circumstances indicate the carrying amount may not be recoverable. We use present value and other valuation techniques to make this assessment. If the carrying amount of goodwill or an intangible asset exceeds its fair value, an impairment loss is recognized in an amount equal to that excess. For purposes of impairment testing, we assign goodwill to the reporting unit that benefits from the synergies arising from each business combination, and we also assign indefinite lived intangible assets to our reporting units.\nOur reportable segments as of October 1, 2024 were:\nU.S. Refreshment Beverages\n(reporting units: U.S. Beverage Concentrates, U.S. Warehouse Direct, and Direct Store Delivery)\n(reporting unit: U.S. Coffee)\n(reporting units: Canada Beverage Concentrates, Canada Warehouse Direct, Canada Coffee, and Latin America Beverages)\nFor both goodwill and other indefinite lived intangible assets, we have the option to first assess qualitative factors to determine whether the fair value of either the reporting unit or indefinite lived intangible asset is \"more likely than not\" less than its carrying value, also known as a Step 0 analysis.\nIf",
  "item2_clean": null
}