{
  "source_file": "key-20241231.htm",
  "form_type": "10-K",
  "item1_clean": "ITEM 1. BUSINESS\nKeyCorp, organized in 1958 under the laws of the State of Ohio, is headquartered in Cleveland, Ohio. We are a BHC under the BHCA and one of the nation’s largest bank-based financial services companies, with consolidated total assets of approximately $187.2 billion at December 31, 2024. KeyCorp is the parent holding company for KeyBank National Association, its principal subsidiary, through which most of our banking services are provided. Through KeyBank and certain other subsidiaries, we provide a wide range of retail and commercial banking, commercial leasing, investment management, consumer finance, student loan refinancing, commercial mortgage servicing and special servicing, and investment banking products and services to individual, corporate, and institutional clients through two major business segments: Consumer Bank and Commercial Bank.\nAs of December 31, 2024, these services were provided across the country through KeyBank’s 944 full-service retail banking branches and a network of 1,182 ATMs in 15 states, as well as additional offices, online and mobile banking capabilities, including our national digital brand, Laurel Road, and a telephone banking call center. Additional information pertaining to our two business segments is included in the “Business Segment Results” section in Item 7. Management’s Discussion and Analysis of Financial Condition and Results of Operations of this report, and in Note 25 (“Business Segment Reporting”) of the Notes to Consolidated Financial Statements presented in Item 8. Financial Statements and Supplementary Data, which are incorporated herein by reference.\nIn addition to the customary banking services of accepting deposits and making loans, our bank and its trust company subsidiary offer personal and institutional trust custody services, personal financial and planning services, access to mutual funds, treasury services, and international banking services. Through our bank, trust company, and registered investment adviser subsidiaries, we provide investment management services to clients that include large corporate and public retirement plans, foundations and endowments, high-net-worth individuals, and multi-employer trust funds established for providing pension or other benefits to employees.\nWe provide other financial services — both within and outside of our primary banking markets — through various nonbank subsidiaries. These services include community development financing, securities underwriting, investment banking and capital markets products, and brokerage. We also provide merchant services to businesses.\nKeyCorp is a legal entity separate and distinct from its banks and other subsidiaries. Accordingly, the right of KeyCorp, its security holders, and its creditors to participate in any distribution of the assets or earnings of its banks and other subsidiaries is subject to the prior claims of the creditors of such banks and other subsidiaries, except to the extent that KeyCorp’s claims in its capacity as a creditor may be recognized.\nWe derive the majority of our revenues within the United States from customers domiciled in the United States. Revenue from foreign countries and external customers domiciled in foreign countries was immaterial to our consolidated financial statements.\nOur management structure and basis of presentation is divided into two business segments, Consumer Bank and Commercial Bank. Note 25 (“Business Segment Reporting”) describes the products and services offered by each of these business segments and provides more detailed financial information pertaining to the segments, including changes in basis of presentation.\nThe Consumer Bank serves individuals and small businesses throughout our 15-state branch footprint and through our Laurel Road digital brand by offering a variety of deposit and investment products, personal finance and financial wellness services, lending, student loan refinancing, mortgage and home equity, credit card, treasury services, and business advisory services. In addition, wealth management and investment services are offered to assist non-profit and high-net-worth clients with their banking, trust, portfolio management, charitable giving, and related needs.\nThe Commercial Bank consists of the Commercial and Institutional operating segments. The Commercial operating segment is a full-service, commercial banking platform that focuses primarily on serving the borrowing, cash\nmanagement, and capital markets needs of middle market clients within Key’s 15-state branch footprint. The Institutional operating segment operates nationally in providing lending, equipment financing, and banking products and services to large corporate and institutional clients. The industry coverage and product teams have established expertise in the following sectors: Consumer, Energy, Healthcare, Industrial, Public Sector, Real Estate, and Technology. It is also a significant, national, commercial real estate lender and third-party master and special servicer of commercial mortgage loans. The operating segment includes the KBCM platform which provides a broad suite of capital markets products and services including syndicated finance, debt and equity underwriting, fixed income and equity sales and trading, derivatives, foreign exchange, mergers & acquisition and other advisory, and public finance.\nAdditional Information\nInformation contained on or accessible through, including any reports available on, our website or any other website referenced in this report is not part of this report. References to websites in this report are intended to be inactive textual references only.\nShareholders may obtain a copy of any of the above-referenced corporate governance documents by writing to our Investor Relations Department at Investor Relations, KeyCorp, 127 Public Square, Mailcode OH-01-27-0737, Cleveland, Ohio 44114-1306; by calling (216) 689-4221; or by sending an e-mail to investor_relations@keybank.com.\nThe market for banking and related financial services is highly competitive and continuously evolving. Legislative, regulatory, economic, and technology changes, as well as consolidation within the financial services industry, could result in increased competition from new and existing market participants. Key competes with other providers of financial services, such as BHCs, commercial banks, savings associations, credit unions, mortgage banking companies, finance companies, mutual funds, insurance companies, investment management firms, private credit funds, investment banking firms, broker-dealers, financial technology companies, and other local, regional, national, and global institutions that offer financial services. Some of our competitors are larger and may have more financial resources, while some of our competitors enjoy fewer regulatory constraints and may have lower cost structures. The financial services industry has become more competitive as technology advances have lowered barriers to entry, enabling more companies, including nonbank companies, to provide financial services. Mergers and acquisitions have also led to increased concentration in the banking industry, placing added competitive pressure on Key’s core banking products and services as we see competitors enter some of our markets or offer similar products. We compete by offering quality products and innovative services at competitive prices, and by maintaining our product and service offerings to keep pace with customer preferences and industry standards. Successfully competing in our markets also depends on our ability to invest in technology and infrastructure, execute transactions reliably and effectively, maintain and enhance our reputation, and attract, retain, and motivate talented employees, all while prudently managing risks and expenses. For more information on competition and related risks, see Item 1A. Risk Factors - “We operate in a highly competitive industry.”\nEngaging a high performing and collaborative workforce is a top strategic priority for Key. Our human capital management strategy is focused on attracting, retaining, developing, motivating and rewarding the talent our businesses need to drive sound, profitable growth, and ultimately, enhance shareholder value, which we do by offering a competitive total rewards package, providing opportunities for career development and growth, and fostering a culture that is fair and inclusive for all.\nWe make investments to hire and retain the people we need to serve our customers and communities and regularly review our pay practices to reflect changing market and economic conditions. We have steadily increased our starting minimum wage since 2015, and as of December 31, 2024, 93% of employees earned $20 or more per hour. We have made other compensation adjustments in response to market trends, competitive pressures, and a dynamic market for talent.\nThese investments include a comprehensive and competitive total rewards program, representing our investment in our teammates’ collective success and reflecting our commitment to helping them thrive. Key’s benefits offerings include employee health and welfare plans, a 401(k) plan with competitive matching contributions (dollar for dollar, up to the first 7% of eligible pay contributed on a per pay period basis for eligible employees), up to ten weeks of paid parental leave, a Discounted Stock Purchase Plan, wellness incentives, and a lifestyle reimbursement account program for covered expenses related to health, mental wellness, family needs, and finances.\nTeammates can also participate in a variety of company-sponsored volunteer and giving opportunities, including Neighbors Make the Difference Day, our national employee volunteer day, and the Employee Matching Gift Program, which offers eligible employees the opportunity to support qualified nonprofit organizations and multiply their contributions through the KeyBank Foundation.\nWe have a pay-for-performance culture that is guided by the following three principles:\nPay decisions are based on Key’s performance, business unit performance, and individual performance.\nWe deliver pay in a way that balances short-term and long-term financial performance objectives and aligns to shareholder value creation.\nWe support sustainable performance with policies that focus on prudent risk-taking and the balance between risk and reward.\nWe design our compensation programs to balance risk and reward and align with the guidance of our regulators, and we regularly monitor these programs to remain within our risk tolerances. We subject all discretionary\nincentives paid to our employees to a robust risk adjustment process that begins before grant and extends beyond payment.\nCareer Development and Growth\nWe invest in our teammates’ growth and professional development through a variety of internal networking groups that are open to all teammates, including our Key Business Impact and Networking Groups (“KBINGs”), formal and informal mentoring programs, including Key’s enterprise-wide formal mentoring program, MentorMe at Key, and a suite of leadership development programs. We also offer employees the opportunities to develop and enhance their skills through formal learning curricula and to obtain tuition reimbursement for eligible collegiate or post-collegiate education and relevant certifications.\nKey had an average of 16,753 full time equivalent employees in\n. As of December 31, 2024, a total of 17,406 full-time and part-time employees worked in the following regions, which are generally aligned to the regions Key uses for its retail branch banking network:\nWe invest significant time and resources in creating an attractive work environment and competitive total rewards package that attracts and retains top talent. Key’s annualized rate for voluntary turnover as of December 31, 2024, was 13.2%, lower than our annualized voluntary turnover rate for 2023, which was 14.6%, and lower",
  "item7_clean": "We seek to be client-centric in our actions and have taken purposeful steps to enhance our ability to acquire and expand targeted relationships. We seek to provide solutions to serve our clients' needs. We focus on markets and clients where we can be the most relevant. In aligning our businesses and investments against these targeted client segments, we are able to make a meaningful positive impact for our clients.\nEffectively manage risk and rewards —\nOur risk management activities are focused on ensuring we properly identify, measure, and manage risks across the entire company to maintain safety and soundness and maximize profitability.\nMaintain financial strength —\nWith the foundation of a strong balance sheet, we intend to remain focused on sustaining strong reserves, liquidity, and capital. We plan to work closely with our Board and regulators to manage capital to support our clients’ needs and drive long-term shareholder value. Our capital position remains strong, and we are well-positioned relative to our capital priorities.\nEngage a high-performing and talented workforce —\nEvery day our employees provide our clients with great ideas, extraordinary service, and smart solutions. We intend to continue to engage our high-performing and talented workforce to create an environment where everyone can make a difference, own their careers, be respected, and feel a sense of pride.\nOur 2024 financial results were generally positive and reflected the impact of large securities repositioning trades that enhanced our future earnings trajectory. Net interest income was down, reflecting lower loans and changes in interest rates, but remained within our target range versus 2023. Fee growth was stronger than expected reflecting the second highest year of investment banking revenues in our history. At December 31, 2024, our Common Equity Tier 1 and Tier 1 risk-based capital ratios stood at 11.92% and 13.69%, respectively. We achieved meaningful positive operating leverage in the second half of the year and look to continue to deliver earnings growth and operating leverage in 2025.\nStrategic Minority Investment by Scotiabank\nOn August 12, 2024, we entered into an Investment Agreement with Scotiabank pursuant to which Scotiabank agreed to make a strategic minority investment in KeyCorp of approximately $2.8 billion, representing approximately 14.9% pro forma common stock ownership of KeyCorp, for a fixed price of $17.17 per share. On August 30, 2024, Scotiabank completed the initial purchase of our Common Shares with an investment of approximately $821 million in gross proceeds. Following the initial purchase, Scotiabank owned approximately 4.9% of KeyCorp’s common stock.\nOn December 13, 2024, Key announced that all necessary bank regulatory approvals had been received for completion of Scotiabank’s strategic minority investment in KeyCorp. On December 27, 2024, Scotiabank completed the final purchase of our Common Shares contemplated under the Investment Agreement with an investment of approximately $2.0 billion (the “Second Closing”). Following the Second Closing, Scotiabank owns approximately 14.9% of our Common Shares.\nOn December 27, 2024, in connection with the Second Closing, the Board of Directors of KeyCorp increased the size of the Board to fifteen directors and appointed Jacqueline Allard and Somesh Khanna to serve on the Board, effectively immediately upon the Second Closing.\nRefer to Note 24 (“Shareholders' Equity”) for additional information on this transaction.\nSecurities Repositioning\nOn September 6, 2024, we initiated a strategic repositioning of our available-for-sale investment securities portfolio by selling approximately $7.0 billion in market value of low-yielding mortgage-backed securities. The mortgage-backed securities that were sold had a weighted average book yield of approximately 2.3% and an average duration of approximately six years. Reinvestment of the proceeds from the sale was completed in October 2024, with the new securities having an average book yield of approximately 4.95% and an average duration of approximately four years. During the third quarter of 2024, along with our customary sale of short-dated U.S. Treasuries set to mature within the quarter, we also sold approximately $3 billion in U.S. Treasuries yielding 50 basis points that were set to mature in the fourth quarter of 2024. The total pre-tax loss on the sale of securities available for sale for the third quarter was $935 million of which $918 million was associated with the strategic repositioning.\nPrior to the Second Closing, KeyCorp completed the strategic repositioning of its available-for-sale investment securities portfolio by selling an additional $3.0 billion in market value of low-yielding investment securities and terminating approximately $3.0 billion of fair value hedges, resulting in a pre-tax loss of $915 million in the fourth quarter of 2024. The investment securities that were sold had a weighted average book yield of approximately 1.5% and an average duration of approximately eight years. The reinvestment of the proceeds from the repositioning was completed in December 2024, with the new securities having an average book yield of 5.5% and an average duration of approximately four years.\nIn addition to the items described above, the following actions and results during 2024 also supported our overall corporate strategy.\nWe have expanded our commercial banking business in Chicago and Southern California to serve more middle market clients with our differentiated platform, which includes a full range of commercial lending and capital markets capabilities as well as payments solutions designed specifically for the segment.\nWe completed core technological modernization projects of our commercial loan platform and our derivatives platform.\nWe ended the year with $61.4 billion in assets under management and administration, a record high, reflecting the strong sales production in our mass affluent segment.\nWithin our Consumer Bank, we grew relationship households in excess of three percent for the second consecutive year, including growth of five to eight percent throughout our western markets.\nWe remained committed to our strategy to engage a high-performing and talented workforce and fostering an inclusive environment for all\nWe continue to be recognized by multiple organizations for our dedication to creating an environment where all employees are treated with respect and empowered to bring their authentic selves to work.\nConsistent with the forward guidance we provided on January 21, 2025, we expect these results for full year 2025 versus full year 2024.\nNet interest income (TE)\nAdjusted noninterest income\nAdjusted noninterest expense\nNet charge-offs to average loans\n40 to 45 basis points (FY2025)\n~21% to 22% (FY2025)\nTax-equivalent Effective Rate\n~23% to 24% (FY2025)\n(a) Ranges are shown on an operating basis.\n(b) Additional Guidance: Net interest income (TE): 10%+ 4Q25 vs. 4Q24.\n(d) Reflects the estimated full year taxable-equivalent adjustment.\nResults of Operations\nThe following chart provides a reconciliation of net income from continuing operations attributable to Key common shareholders for the year ended December 31, 2023, to the year ended December 31, 2024 (dollars in millions):\nOne of our principal sources of revenue is net interest income. Net interest income is the difference between interest income received on earning assets (such as loans and securities) and loan-related fee income, and interest expense paid on deposits and borrowings. There are several factors that affect net interest income, including:\nthe volume, pricing, mix, and maturity of earning assets and interest-bearing liabilities;\nthe volume and value of net free funds, such as noninterest-bearing deposits and equity capital;\nthe use of derivative instruments to manage interest rate risk;\ninterest rate fluctuations and competitive conditions within the marketplace;\nfair value accounting of acquired earning assets and interest-bearing liabilities.\nTo make it easier to compare both the results among several periods and the yields on various types of earning assets (some taxable, some not), we present net interest income in this discussion on a “TE basis” (i.e., as if all income were taxable and at the same rate). For example, $100 of tax-exempt income would be presented as $126, an amount that, if taxed at the statutory federal income tax rate of 21%, would yield $100.\nNet interest income (TE) for 2024 was $3.8 billion, and the net interest margin was 2.16%. Compared to 2023, net interest income (TE) decreased $133 million, and the net interest margin was relatively stable, decreasing by one basis point. The decline in net interest income (TE) and the net interest margin reflects higher deposit costs, partly due to a shift in funding mix from noninterest-bearing deposits to higher cost deposits in 2024, and lower loan balances, in part due to the residual effect of Key’s balance sheet optimization efforts during the second half of 2023. Net interest income (TE) and the net interest margin benefited from higher earning asset yields as a result of the higher interest rate environment, including the reinvestment of proceeds from maturing investment securities into higher-yielding investments. Net interest income (TE) and the net interest margin also benefited from the maturity of interest rate swaps with negative carry, and an increase in lower-cost deposits, which contributed to the decline in wholesale borrowings. In addition, during the second half of 2024, Key completed the available-for-sale portfolio repositioning, which involved the sale and reinvestment of approximately $10.0 billion of lower-yielding mortgaged-backed securities into higher-yielding investments.\nAverage loans totaled $107.7 billion for 2024, compared to $118.0 billion in 2023. The $10.3 billion decrease reflected continued tepid client loan demand. Commercial loans decreased $7.6 billion, due to lower commercial and industrial loans and commercial mortgage real estate loans. Additionally, average consumer loans declined by $2.6 billion, reflective of broad-based declines across all consumer loan categories.\nAverage deposits totaled $146.2 billion for 2024, an increase of $2.1 billion compared to 2023, reflecting growth in both consumer and commercial deposits, partially offset by a decline in brokered CDs.\nFigure 1 shows the various components of our balance sheet that affect interest income and expense and their respective yields or rates over the past three years. This figure also presents a reconciliation of TE net interest income to net interest income reported in accordance with GAAP for each of those years. The net interest margin, which is an indicator of the profitability of our earning assets less the cost of funding, is calculated by dividing taxable-equivalent net interest income by average earning assets.\nFigure 1. Consolidated Average Balance Sheets, Net Interest Income, and Yields/Rates from Continuing Operations\n\nCritical Accounting Policies and Estimates\nOur business is dynamic and complex. Consequently, we must exercise judgment in choosing and applying accounting policies and methodologies. These choices are critical; not only are they necessary to comply with GAAP, they also reflect our view of the appropriate way to record and report our overall financial performance. All accounting policies are important, and all policies described in Note 1 (“Summary of Significant Accounting Policies”) should be reviewed for a greater understanding of how we record and report our financial performance.\nIn our opinion, some accounting policies are more likely than others to have a critical effect on our financial results and to expose those results to potentially greater volatility. These policies apply to areas of relatively greater business importance, or require us to exercise judgment and to make assumptions and estimates that affect amounts reported in the financial statements. Because these assumptions and estimates are based on current circumstances, they may prove to be inaccurate, or we may find it necessary to change them. The following is a description of our current critical accounting policies.\nAllowance for loan and lease losses\nThe allowance for loan and lease losses represents management’s estimate of all expected credit losses over the expected contractual life of our existing loan portfolio. Determining the appropriateness of the allowance is complex and requires judgment by management about the effect of matters that are inherently uncertain. These critical estimates include significant use of our own historical data and complex methods to interpret them. We have an ongoing process to evaluate and enhance the quality, quantity, and timeliness of our data and interpretation methods used in the determination of these allowances. These evaluations are inherently subjective, as they require material estimates and may be susceptible to significant change, and include, among others:\nPD,\nLGD,\nOutstanding balance of the loan,\nMovement through delinquency stages,\nAmounts and timing of expected future cash flows,\nValue of collateral, which may be obtained from third parties,\nEconomic forecasts which are obtained from a third party provider, and\nQualitative factors, such as changes in current economic conditions, that may not be reflected in modeled results.\nAs described in our accounting policy related to the ALLL in Note 1 (“Summary of Significant Accounting Policies”) of this report under the heading “Allowance for Loan and Lease Losses,\" we employ a disciplined process and methodology to establish our ALLL, which has three main components: (i) asset specific / individual loan reserves; (ii) quantitative (formulaic or pooled) reserves; and (iii) qualitative (judgmental) reserves.\nWe use a non-DCF factor-based approach to estimate expected credit losses that include component PD/LGD/EAD models as well as less complex estimation methods for smaller loan portfolios. Probability of default models estimate the likelihood a borrower will cease making payments as agreed. These models use observed loan-level information and projected paths of macroeconomic variables. Borrower credit attributes including FICO scores of consumers and internally assigned risk ratings for commercial borrowers are significant inputs to the models. Consumer FICO scores are refreshed quarterly and commercial risk ratings are updated annually with select borrowers updated more frequently. The macroeconomic trends that have a significant impact on the probability of default vary by portfolio segment. Exposure at default models estimate the loan balance at the time of default. We use an amortization based formulaic approach to estimate account level EAD for all term loans. We use portfolio specific methods in each of our revolving product portfolios. LGD models estimate the loss we will suffer once a loan is in default. Account level inputs to LGD models include collateral attributes, such as loan to value.\nIf we observe limitations in the data or models, we use model overlays to make adjustments to model outputs to capture a particular risk or compensate for a known limitation. These variables and others may result in actual loan losses that differ from the originally estimated amounts.\nThis estimate produced by our models is forward-looking and requires management to use forecasts about future economic conditions to determine the expected credit loss over the remaining life of an instrument. Moody’s Consensus forecast is our source of macroeconomic projections, including the interest rate forecasts used in the credit models. We use a two year reasonable and supportable period across all products to forecast economic conditions. As the length of the life of a financial asset increases, these inputs may become impractical to estimate as reasonable and supportable.",
  "item2_clean": null
}