{
  "source_file": "khc-20250927.htm",
  "form_type": "10-Q",
  "item1_clean": null,
  "item7_clean": null,
  "item2_clean": "Item 2. Management’s Discussion and Analysis of Financial Condition and Results of Operations.\nThe following discussion provides an analysis of our financial condition and results of operations from management's perspective and should be read in conjunction with the condensed consolidated financial statements and related notes included in Item 1,\nFinancial Statements\nDescription of the Company:\nWe manufacture and market food and beverage products, including condiments and sauces, cheese and dairy, meals, meats, refreshment beverages, coffee, and other grocery products throughout the world.\nWe manage our operating results through four operating segments: North America, Europe and Pacific Developed Markets (“EPDM” or “International Developed Markets”), West and East Emerging Markets (“WEEM”), and Asia Emerging Markets (“AEM”). We have two reportable segments defined by geographic region: North America and International Developed Markets. Our remaining operating segments, consisting of WEEM and AEM, are combined and disclosed as Emerging Markets.\nFinancial Statements\n, for our financial information by segment.\nProposed Separation Transaction:\nOn September 2, 2025, we announced our plan to separate the Company into two independent, publicly traded companies through a tax-free spin-off. The Separation is expected to allow each company to have greater strategic and operational focus to better serve customers, customize capital allocation, and accelerate profitable growth. We currently expect to complete the Separation in the second half of 2026. See Part II. Items 1A.\nAcquisitions and Divestitures:\nOn July 9, 2025, we entered into a definitive agreement to sell our infant and specialty food business in Italy, within our International Developed Markets segment, which is expected to close in the first quarter of 2026. In the first quarter of 2024, we closed the sale of the Russia Infant Transaction and the Papua New Guinea Transaction, both within Emerging Markets. See Note 5,\nAcquisitions and Divestitures\nFinancial Statements\n, for additional information on divestiture activities.\nBusiness Trends and Items Affecting Comparability of Financial Results\nInflation, Supply Chain, and Tariff Impacts:\nDuring the nine months ended September 27, 2025, we experienced increased inflationary pressures compared to the prior year, due in part to the recent tariff and trade policy actions taken by the United States and foreign governments. We have incurred increased cost of products sold within a subset of our North America segment (primarily within our Coffee and Hydration platforms) due to the impacts of tariffs on certain raw materials currently sourced from outside of the U.S. and on certain products that are manufactured through our integrated supply chain that spans the U.S. and Canada.\nWhile these increased costs have had a negative impact on our results of operations, we have taken measures to mitigate the impact of this inflation through pricing actions, efficiency gains, and alternative sourcing. However, there has been, and we expect that there could continue to be, a difference between the timing of when these mitigative actions impact our results of operations and when the cost inflation is incurred. Additionally, the pricing actions we take have, in some instances, negatively impacted, and could continue to negatively impact, our market share. As the situation continues to remain fluid due to the rapidly changing global trade environment, we continue to evaluate the potential implications of these actions on our business.\nIn the second quarter of 2025, we announced our commitment to remove Food, Drug & Cosmetic (“FD&C”) colors from our U.S. portfolio of products before the end of 2027. Additionally, we have committed to ensuring that all new products launched in the U.S. will be free of FD&C colors. This initiative will impact a subset of the products sold within our North America segment, primarily within our Hydration and Desserts platforms. While we do not currently anticipate a significant impact to our input costs in our efforts to meet this commitment, our net sales, market share, or results of operations could be adversely affected if we are unsuccessful in our efforts to continue to satisfy consumer preferences.\nRegulatory Landscape:\nOn July 4, 2025, the One Big Beautiful Bill Act was signed into law in the United States. The OBBBA includes, among other provisions, a broad range of changes to U.S. tax law, as well as changes to eligibility requirements for Supplemental Nutrition Assistance Program (“SNAP”) recipients. While OBBBA did not have a significant impact on our total tax provision as of September 27, 2025, we are still evaluating our position on the elective provisions of the law and the potential impacts of those elections on our financial statements.\nResults of Operations\nWe disclose in this report certain non-GAAP financial measures. These non-GAAP financial measures assist management in comparing our performance on a consistent basis for purposes of business decision-making by removing the impact of certain items that management believes do not directly reflect our underlying operations. For additional information and reconciliations to the most closely comparable financial measures presented in our condensed consolidated financial statements, which are calculated in accordance with U.S. GAAP see\nNon-GAAP Financial Measures.\nConsolidated Results of Operations\nFor the Three Months Ended\nFor the Nine Months Ended\n(in millions, except per share data)\n(in millions, except per share data)\nOperating income/(loss)\nNet income/(loss) attributable to common shareholders\nFor the Three Months Ended\nFor the Nine Months Ended\n(a) Organic Net Sales is a non-GAAP financial measure. See the\nNon-GAAP Financial Measures\nsection at the end of this item.\nThree Months Ended September 27, 2025 Compared to the Three Months Ended September 28, 2024:\nNet sales decreased 2.3% to $6.2 billion for the three months ended September 27, 2025 compared to $6.4 billion for the three months ended September 28, 2024, including the favorable impact of foreign currency (0.2 pp). Organic Net Sales decreased 2.5% to $6.2 billion for the three months ended September 27, 2025 compared to $6.4 billion for the three months ended September 28, 2024, primarily due to the unfavorable volume/mix (3.5 pp), which more than offset higher pricing (1.0 pp). Pricing was higher in each segment. Volume/mix in North America and International Developed Markets was unfavorable, while volume/mix in Emerging Markets was favorable.\nNine Months Ended September 27, 2025 Compared to the Nine Months Ended September 28, 2024:\nNet sales decreased 3.5% to $18.6 billion for the nine months ended September 27, 2025 compared to $19.3 billion for the nine months ended September 28, 2024, including the unfavorable impact of foreign currency (0.4 pp). Organic Net Sales decreased 3.1% to $18.6 billion for the nine months ended September 27, 2025 compared to $19.2 billion for the nine months ended September 28, 2024, primarily due to the unfavorable volume/mix (3.9 pp), which more than offset higher pricing (0.8 pp). Pricing was higher in each segment. Volume/mix in North America and International Developed Markets was unfavorable, while volume/mix in Emerging Markets was favorable.\nFor the Three Months Ended\nFor the Nine Months Ended\nOperating income/(loss)\nNet income/(loss) attributable to common shareholders\nAdjusted Operating Income\n(a) Adjusted Operating Income is a non-GAAP financial measure. See the\nNon-GAAP Financial Measures\nsection at the end of this item.\nThree Months Ended September 27, 2025 Compared to the Three Months Ended September 28, 2024:\nOperating income/(loss) increased 1,114.9% to income of $1.0 billion for the three months ended September 27, 2025 compared to losses of $101 million for the three months ended September 28, 2024, primarily due to non-cash impairment losses that were $1.4 billion lower in the current year period. In addition to the impact of these non-cash impairment losses, operating income/(loss) decreased $267 million due to inflationary pressures in commodity and manufacturing costs that outpaced our efficiency initiatives, unfavorable volume/mix, increased SG&A, primarily due to increased advertising expenses, and unfavorable changes in unrealized losses/(gains) on commodity hedges. These unfavorable impacts to operating income/(loss) were partially offset by higher pricing.\nNet income/(loss) increased 311.4% to income of $613 million for the three months ended September 27, 2025 compared to losses of $290 million for the three months ended September 28, 2024. This increase was due to the favorable changes in operating income/(loss) factors discussed above, partially offset by higher income tax expense, unfavorable changes in other expense/(income), and higher interest expense.\nOur effective tax rate for the three months ended September 27, 2025 was an expense of 24.0% on pre-tax income. Our effective tax rate for the three months ended September 28, 2024 was an expense of 2.5% on pre-tax loss, which included the net unfavorable effective tax rate impact of goodwill and intangible asset impairment losses of 22.9%. The year-over-year change in the effective tax rate for the three-month period was primarily driven by the impact of non-deductible goodwill impairments and a less favorable geographic mix of pre-tax income in various non-U.S. jurisdictions primarily due to the changes made to our corporate entity structure in December 2024.\nOther expense/(income) was $22 million of income for the three months ended September 27, 2025 compared to $48 million of income for the three months ended September 28, 2024. This change was primarily driven by a $44 million net loss on the sale of a business recognized in the third quarter of 2025 associated with the Italy Infant Transaction, partially offset by an $18 million increase in interest i"
}