{
  "source_file": "kkr-20250930.htm",
  "form_type": "10-Q",
  "item1_clean": null,
  "item7_clean": null,
  "item2_clean": "As of September 30, 2025, 83% of the account value in Global Atlantic's general account associated with its fixed-rate and fixed-indexed annuity products, and 38% of account value in its general account associated with universal life products was protected by surrender charges.\n\"Other life products” includes universal life, term and whole life insurance products.\nInstitutional market reserves are sourced using customized reinsurance solutions such as block, flow and PRT. As of September 30, 2025, reserves sourced through block, flow and PRT transactions were $60.5 billion, $37.4 billion and $7.1 billion, respectively.\n“Other” includes long-term care insurance where Global Atlantic has ceded mortality and morbidity risk to a third-party reinsurance company.\nOur Strategic Holdings segment is primarily comprised of the firm’s ownership in the businesses we acquired through our participation in our core private equity strategy. In our core private equity strategy, our objective is to acquire and manage controlling interests in operating companies, which we intend to hold over a longer period of time and that we believe have a lower anticipated risk profile than our investments in businesses acquired through our traditional private equity strategy. Our core private equity portfolio companies are generally expected to be more stable and typically have lower leverage over our holding period than our traditional private equity portfolio companies. We have acquired assets in our Strategic Holdings segment that are not part of the core private equity strategy, and our Strategic Holdings segment is not limited to a specific industry or constrained to any investment strategy that we may manage for our investment funds or vehicles.\nAs of September 30, 2025, our Strategic Holdings segment consisted of our ownership stakes in 17 companies that we acquired through our core private equity strategy. Based on certain information made available to management as of September 30, 2025, approximately 68% of these companies are based in the Americas, 27% in Europe, and 5% in the Asia-Pacific (based on the geographic location of their headquarters). In addition, based on such information, these companies are primarily engaged in the following business sectors: approximately 36% in Business Services, 28% in Consumer, 17% in Healthcare, 13% in technology-media-telecommunications (TMT), and 6% in Infrastructure. We currently expect our Strategic Holdings segment to generate income from the receipt of dividends from our ownership stakes in these businesses, and if any ownership stake were to be sold, we would recognize realized investment income from such sale.\nThe fees and carried interest paid by the third party investors in our core private equity funds continues to be reported in our Asset Management segment and are not reported in our Strategic Holdings segment. Our Asset Management segment charges a quarterly management fee based on invested capital in our Strategic Holdings segment. Additionally, our Asset Management segment charges a performance fee from the sale of our interests in the companies included in our Strategic Holdings segment. The management and performance fees are charged in order to represent the cost of providing advisory services by our Asset Management segment rather than determining the allocable costs borne by our Asset Management segment to support our Strategic Holdings segment.\nBusiness Environment\nOur asset management, insurance, and strategic holdings segments are affected by the various market and economic conditions of the various countries and regions in which we operate. Market and economic conditions are expected to continue to have a substantial impact on our financial condition, results of operations, and our business in various ways that we are unable to control, including our ability to make new investments, the valuations of the investments we manage, the amount of investment proceeds we realize when we exit our investments, the timing for such realization activity, our ability to fundraise or to sell our various investment and insurance products and services, and the level of our capital markets activities, as discussed in the \"Risk Factors\" section of our Annual Report.\nThe United States, during the three months ended September 30, 2025, experienced an expansion in economic growth while also continuing to experience inflation in excess of the U.S. Federal Reserve Board’s target rate. The U.S. Federal Reserve Board decided to lower the target range to a range of 4.00% to 4.25% for the federal funds rate noting softening labor market conditions as a primary consideration in deciding to lower the target range despite inflation exceeding its target.\nReal gross domestic product (“GDP”) growth in the Eurozone during the three months ended September 30, 2025 was moderately positive. In Europe during the three months ended September 30, 2025, the European Central Bank maintained interest rates at the same level as prior quarter, leaving the deposit rate unchanged at 2.0% as Eurozone core inflation accelerated compared to the prior quarter and remained slightly above the European Central Bank’s 2% inflation target.\nIn Asia, Japan’s economy is expected to have experienced negative growth in the third quarter of 2025 driven by an expected slowdown in consumer spending and export volumes. The Bank of Japan kept interest rates flat during the three months ended September 30, 2025, leaving its policy rate at 0.50%. In China, the economy grew during the three months ended September 30, 2025 but continued to experience divergent economic conditions and headwinds as Chinese growth remains subject to various headwinds including in the property sector and uncertainty relating to a potential trade war with the United States as discussed further below.\nSeveral key economic indicators in the United States and in other countries and regions in which we operate include:\nGDP.\nIn the United States, real GDP is estimated to have expanded at an annualized rate of 2.8% for the three months ended September 30, 2025, compared to an annualized expansion of 3.8% for the three months ended June 30, 2025. Eurozone real GDP expanded at an annualized rate of 0.8% for the three months ended September 30, 2025, up from an annualized 0.4% expansion for the three months ended June 30, 2025. In Japan, real GDP is estimated to have contracted at an annualized rate of 1.1% for the three months ended September 30, 2025, down from a 2.2% annualized expansion for the three months ended June 30, 2025. Real GDP in China expanded at an annualized rate of 4.4% for the three months ended September 30, 2025, compared to an annualized expansion of 4.0% reported for the three months ended June 30, 2025.\nThe target federal funds rate set by the U.S. Federal Reserve Board was 4.125% as of September 30, 2025, down from 4.375% as of June 30, 2025. The benchmark short-term interest rate set by the European Central Bank was 2.0% as of September 30, 2025 unchanged from 2.0% as of June 30, 2025. The benchmark short-term interest rate set by the Bank of Japan was 0.50% as of September 30, 2025 with no change as compared with the rate as of June 30, 2025. The benchmark interest rate set by The People’s Bank of China was 3.0% as of September 30, 2025, unchanged from 3.0% as of June 30, 2025.\nThe U.S. core consumer price index rose 3.1% on a year-over-year basis as of September 30, 2025, up from 2.9% on a year-over-year basis as of June 30, 2025. Eurozone core inflation was 2.4% as of September 30, 2025, up from 2.3% as of June 30, 2025. In Japan, core inflation rose 1.6% on a year-over-year basis as of September 30, 2025, flat from 1.6% on a year-over-year basis as of June 30, 2025. Core inflation in China was 1.0% on a year-over-year basis as of September 30, 2025, up from 0.7% as of June 30, 2025.\nThe U.S. unemployment rate is estimated to have been 4.3% as of September 30, 2025, up from 4.1% as of June 30, 2025. Eurozone unemployment was 6.3% as of September 30, 2025, flat from 6.3% as of June 30, 2025. The unemployment rate in Japan was 2.6% as of September 30, 2025, up from 2.5% as of June 30, 2025. The unemployment rate in China was 5.2% as of September 30, 2025, flat from 5.2% as of June 30, 2025.\nSeveral key financial market indicators in the United States and in other countries and regions in which we operate include:\nFor the three months ended September 30, 2025, the S&P 500 was up 8.1%, the MSCI Europe Index was up 4.6%, the MSCI Asia Index was up 9.4% and the MSCI World Index was up 7.4% on a total return basis including dividends. Equity market volatility as evidenced by the Chicago Board Options Exchange Market Volatility Index (VIX), a measure of volatility, ended at 16.3 as of September 30, 2025, decreasing from 16.7 as of June 30, 2025.\nDuring the three months ended September 30, 2025, U.S. investment grade corporate bond spreads (BofA Merrill Lynch US Corporate Index) tightened by 10 basis points. The non-investment grade credit indices were up during the three months ended September 30, 2025 with the S&P/LSTA Leveraged Loan Index up 1.8% and the BofAML HY Master II Index up 2.4%. During the three months ended September 30, 2025, the 10-year government bond yields fell 8 basis points in the United States, rose 10 basis points in Germany, rose 22 basis points in Japan, rose 21 basis points in the UK and rose 21 basis points in China.\nDuring the three months ended September 30, 2025, the 3-year forward price of WTI crude oil increased approximately 0.5%, and the 3-year forward price of natural gas increased from approximately $3.25 per MMBtu as of June 30, 2025 to $3.63 per MMBtu as of September 30, 2025. The Japan spot LNG import price increased to approximately $11.68 per MMBtu as of September 30, 2025 from approximately $11.48 per MMBtu as of June 30, 2025.\nForeign Exchange Rates.\nFor the three months ended September 30, 2025, the euro fe"
}