{
  "source_file": "kkr-20241231.htm",
  "form_type": "10-K",
  "item1_clean": "As of December 31, 2024, 82% of the account value in Global Atlantic's general account associated with its fixed-rate and fixed-indexed annuity products, and 42% of account value in its general account associated with universal life products, was protected by surrender charges.\n\"Other life products” includes universal life, term, and whole life insurance products.\n\"Funding agreements” includes funding agreements associated with Federal Home Loan Bank borrowings and under Global Atlantic's funding-agreement backed-notes program.\nInstitutional market reserves are sourced using customized reinsurance solutions such as block, flow, and PRT. As of December 31, 2024, reserves sourced through block, flow, and PRT transactions were $63.3 billion, $31.6 billion, and $6.2 billion, respectively.\n“Other” includes long-term care insurance where Global Atlantic has ceded mortality and morbidity risk to a third-party reinsurance company.\nUnderwriting and Pricing\nGlobal Atlantic’s underwriting and pricing functions have dedicated teams, who are supported by multiple corporate functions, including actuarial, finance, operations, compliance, investments, and risk. These functions have guidelines and procedures designed to assess and quantify the risks of each product type originated through its individual or institutional markets.\nGlobal Atlantic’s internal, proprietary technology platform incorporates analytic models with customized third-party software and database technology, allowing Global Atlantic to dynamically analyze its asset and liability cash flow profile across a range of market and policyholder behavior scenarios. This proprietary platform allows Global Atlantic to integrate investment allocation decisions with product pricing, so that the terms of the liabilities it originates reflect its view of the investment environment. The committees responsible for underwriting and pricing are also aligned with other business functions and include representatives from actuarial, finance, operations, investments, risk, and sales.\nGlobal Atlantic also performs suitability reviews for new annuity sales. For sales through banks and broker-dealers, Global Atlantic generally delegates suitability reviews to these distribution partners.\nWhen pricing reinsurance transactions in the institutional market, Global Atlantic performs asset and liability modeling of the block of business to be reinsured and typically re-underwrites the liability assumptions on the block using then-current market conditions, actuarial experience provided by the ceding company, and its own experience from business Global Atlantic has originated. Reinsured blocks of business are integrated into Global Atlantic’s technology and infrastructure systems and monitored in the same manner used across the broader business, combining input from actuarial, risk, investment management, and other functions.\nInvestment Management\nGlobal Atlantic has an excellent track record of generating strong investment results, and since February 2021, KKR has been the investment manager of Global Atlantic’s assets. Global Atlantic believes that KKR's investment expertise, broad range of investment management services, and strong origination capabilities are key to maintaining Global Atlantic's successful track record of generating attractive risk-adjusted returns. Global Atlantic’s investment management strategy seeks to procure assets that are well-suited to the stable and long-dated nature of Global Atlantic's insurance liabilities.\nGlobal Atlantic seeks to focus on investments that have the potential to generate stable, predictable, long-dated asset cash flows, are of high credit quality, and that focus on capital protection. These kinds of investments have historically consisted of corporate debt, asset-backed finance, specialty finance, transportation finance, securitizations, private loan facilities, and commercial and residential real estate investment opportunities, amongst other asset classes. However, Global Atlantic’s investments are not limited to solely those asset classes.\nSupplementing KKR’s role as an investment advisor, Global Atlantic has retained in-house certain investment origination and allocation functions with expertise in consideration of insurance company asset portfolios. These considerations include asset-liability matching, asset allocation, ongoing portfolio management, and new business pricing across both Global Atlantic’s individual and institutional markets. Global Atlantic believes that matching asset and liability cash flows is key to protecting policyholders and achieving its target returns. Global Atlantic’s investment origination and allocation functions are closely integrated with its risk management team, and a group of its risk management professionals is dedicated to supporting investment decision-making. Global Atlantic uses a proprietary risk platform to develop a comprehensive view of the expected cash flow profile of its liabilities and determine the optimal profile of its asset cash flows. Global Atlantic is also capable of developing a bottoms-up view of the cash flows of investments that it considers. These processes help to identify the investments that offer a cash flow profile that is consistent with Global Atlantic’s risk tolerances.\nWorking within Global Atlantic’s cash flow matching framework as well as its regulatory and rating agency requirements, Global Atlantic has a flexible investment mandate, which allows it to pursue asset classes and investment types that it believes offer the best risk-adjusted returns. Global Atlantic believes that the integration of the analytics around its assets and liabilities and its flexible investment mandate enable Global Atlantic to respond dynamically to market conditions and make investment decisions that maximize risk adjusted returns while still protecting Global Atlantic’s policyholders.\nFor additional information regarding Global Atlantic's investment portfolio, see Note 7 \"Investments\" in our financial statements and \"Management's Discussion and Analysis of Financial Condition and Results of Operations—Segment Balance Sheet Investments—Global Atlantic's Investment Portfolio\".\nCapital strength allows insurance companies to meet their future policyholder obligations and to support the growth of their businesses. Global Atlantic believes it has built a strong financial foundation to meet these objectives. Global Atlantic is well capitalized, and its capital position, combined with annual capital generation from its seasoned in-force book of business and third-party capital, helps it to fund new business volume growth. Global Atlantic takes a responsible and flexible capital approach to allocating capital to where it believes is the most attractive alternative available. Global Atlantic manages its capital and liquidity position with the objective of maintaining sufficient capital and liquidity to be able to capture investment opportunities as they arise and meet policyholder obligations, even in times of foreseeable stress.\nThe financial strength of Global Atlantic’s life insurance operating subsidiaries is recognized by several ratings agencies. The financial strength ratings of these subsidiaries are “A” with a stable outlook from A.M. Best Company, Inc. (“A.M. Best”), “A2” with a stable outlook from Moody’s Investors Service, Inc. (“Moody’s”), “A-” with a positive outlook from S&P Global Ratings (“S&P”), and “A” with a stable outlook from Fitch Ratings, Inc. (\"Fitch\").\nGlobal Atlantic also sponsors third-party co-investment vehicles to participate alongside Global Atlantic in qualifying reinsurance opportunities. These sponsored reinsurance vehicles provide third-party capital to support reinsurance transactions. As of December 31, 2024, third parties have committed capital to the sponsored reinsurance vehicles of approximately $5.5 billion, of which $3.1 billion has been deployed.\nStarting with the first quarter of 2024, we report a third segment named Strategic Holdings. Our Strategic Holdings segment is currently comprised of the firm’s ownership in the businesses we acquired through our participation in our core private equity strategy. In our core private equity strategy, our objective is to acquire and manage controlling interests in operating companies, which we intend to hold over a longer period of time and that we believe have a lower anticipated risk profile than our investments in businesses acquired through our traditional private equity strategy. Our core private equity portfolio companies are generally expected to be more stable and typically have lower leverage over our holding period than our traditional private equity portfolio companies. We may acquire in the future other long-term assets in our Strategic Holdings segment that are not part of the core private equity strategy, and our Strategic Holdings segment is not limited to specific industry or constrained to any investment strategy that we may manage for our investment funds or vehicles.\nAs of December 31, 2024, our Strategic Holdings segment consisted of our ownership stakes in 18 companies that we acquired through our core private equity strategy. Based on certain information made available to management as of December 31, 2024, approximately 66% of these companies are based in the Americas, 28% in Europe, and 6% in the Asia-Pacific (based on the geographic location of their headquarters). In addition, based on such information, these companies are primarily engaged in the following business sectors: approximately 33% in Business Services, 30% in Consumer, 14% in technology-media-telecommunications (TMT), 13% in Healthcare, and 10% in Infrastructure. We currently expect our Strategic Holdings segment to generate income from the receipt of dividends from our ownership stakes in these businesses, and if any ownership stake were to be sold, we would recognize realized investment income from such sale.\nThe fees and carried interest paid by the third party investors in our core private equity funds continues to be reported in our Asset Management segment and are not reported in our Strategic Holdings segment. Our Asset Management segment charges a quarterly management fee based on invested capital in our Strategic Holdings segment. Additionally, our Asset Management segment charges a performance fee from the sale of our interests in the companies included in our Strategic Holdings segment. The management and performance fees are charged in order to represent the cost of providing advisory services by our Asset Management segment rather than determining the allocable costs borne by our Asset Management segment to support our Strategic Holdings segment.\nOur asset management business competes with other investment managers for both investors in our investment vehicles and investment opportunities. The firm's competitors consist primarily of traditional and alternative asset manager sponsors of public and private investment vehicles, real estate development companies, BDCs, investment banks (including activities conducted by their broker-dealers and investment advisers), commercial finance companies, and operating companies acting as strategic buyers. We believe that competition for investors in our investment vehicles is based primarily on investment performance, investor liquidity and willingness to invest, investor perception of investment managers' drive, focus and alignment of interest, business reputation, duration of relationships, quality of services, pricing, fund terms including fees, and the relative attractiveness of the types of investments that have been or are to be made. We believe that competition for investment opportunities is based primarily on the pricing, terms, and structure of a proposed investment and certainty of execution. In addition to these traditional competitors within the global investment management industry, we also face competition from local ",
  "item7_clean": "Total Fees and Other for the year ended December 31, 2024 increased compared to the year ended December 31, 2023 primarily as a result of an increase in transaction fees and management fees, which were partially offset by an increase in fee credits.\nFor a more detailed discussion of the factors that affected our transaction fees during the period, see \"—Analysis of Asset Management Segment Operating Results.\"\nThe increase in management fees was primarily attributable to (i) management fees earned on new capital raised over the past twelve months at Ascendant Fund (our middle market private equity fund) and our private equity and infrastructure K-Series vehicles and (ii) management fees commencing at Global Infrastructure Investors V in the current period. The increase was partially offset by (i) a lower level of management fees from Americas Fund XII and Asian Fund III due to a step-down in each fund's management fee rate and a decrease in invested capital over the past twelve months and (ii) a decrease in management fees earned from Global Infrastructure Investors IV as a result of entering its post-investment period in the current year, and now earns fees based on invested capital rather than capital committed.\nManagement fees due from consolidated investment funds and other investment vehicles are eliminated upon consolidation under GAAP. However, because these amounts are funded by, and earned from, noncontrolling interests, upon consolidation under GAAP, KKR's allocated share of the net income from the consolidated investment funds and other investment vehicles is increased by the amount of fees that are eliminated. Accordingly, net income (loss) attributable to KKR would be unchanged if such investment funds and other investment vehicles were not consolidated. For a more detailed discussion on the factors that affect our management fees during the period, see \"—Analysis of Asset Management Segment Operating Results.\"\nFee credits increased compared to the prior period as a result of (i) a higher level of transaction fees in our Private Equity, Real Assets, and Credit and Liquid Strategies business lines and (ii) a higher level of monitoring fees in our Private Equity and Real Assets business lines. Fee credits owed to consolidated investment funds and other investment vehicles are eliminated upon consolidation under GAAP. However, because these amounts are owed to noncontrolling interests, upon consolidation under GAAP, KKR's allocated share of the net income from the consolidated investment funds is decreased by the amount of fee credits that are eliminated. Accordingly, net income (loss) attributable to KKR would be unchanged if such investment funds and other investment vehicles were not consolidated. Transaction and monitoring fees earned from KKR portfolio companies are not eliminated upon consolidation because those fees are earned from companies which are not consolidated. Furthermore, transaction fees earned in our capital markets business are not shared with fund investors. Accordingly, certain transaction fees are reflected in our revenues without a corresponding fee credit.\nCapital Allocation-Based Income (Loss)\nCapital Allocation-Based Income (Loss) for the year ended December 31, 2024 was positive primarily due to the net appreciation of the underlying investments in many of our unconsolidated carry-earning investment vehicles, most notably North America Fund XIII, Global Infrastructure Investors IV, and our private equity and infrastructure K-Series vehicles. Capital Allocation-Based Income (Loss) for the year ended December 31, 2023 was positive primarily due to the net appreciation of the underlying investments in many of our unconsolidated carry-earning investment funds, most notably Americas Fund XII, Asian Fund III, and Global Infrastructure Investors III.\nKKR calculates the carried interest that would be due to KKR for each investment fund, pursuant to the fund agreements, as if the fair value of the underlying investments were realized as of the reporting date, irrespective of whether such amounts have been realized. Since the fair value of the underlying investments varies between reporting periods, it is necessary to make adjustments to the amounts recorded as carried interest to reflect either (a) positive performance, resulting in an increase in the carried interest allocated to the general partner or (b) negative performance that would cause the amount due to KKR to be less than the amount previously recognized, resulting in a negative adjustment to carried interest allocated to the general partner. In each case, it is necessary to calculate the carried interest on cumulative results compared to the carried interest recorded to date and to make the required positive or negative adjustments.\nInvestment Income (Loss)\nNet Gains (Losses) from Investment Activities for the year ended December 31, 2024\nThe net gains from investment activities for the year ended December 31, 2024 were comprised of net realized gains of $246.8 million and net unrealized gains of $3,196.0 million.\nInvestment gains and losses relating to our general partner capital interest in our unconsolidated funds are not reflected in our discussion and analysis of Net Gains (Losses) from Investment Activities. Our economics associated with these gains and losses are reflected in Capital Allocation-Based Income (Loss) as described above.\nRealized Gains and Losses from Investment Activities\nFor the year ended December 31, 2024, net realized gains related primarily to (i) realized gains on the sale of Söderberg & Partners (financial services sector), FiberCop S.p.A. (infrastructure: telecommunications infrastructure sector), and BridgeBio Pharma, Inc. (NASDAQ: BBIO) and (ii) realized gains on certain foreign exchange forward contracts. Partially offsetting these realized gains were (i) realized losses on our investments in Selecta Group HoldCo. (consumer products sector), Unzer GmbH (financial services sector), and Telepizza SAU (consumer products sector) and (ii) realized losses from the distribution of certain assets to third-party fund investors in certain of our consolidated energy funds.\nUnrealized Gains and Losses from Investment Activities\nFor the year ended December 31, 2024, net unrealized gains were driven primarily by mark-to-market gains primarily relating to our investment in USI, Inc. (financial services sector), 1-800 Contacts Inc. (healthcare sector), April SA (financial services sector), and Exact Holding B.V. (technology sector) held through our consolidated core investment vehicles. These unrealized gains were partially offset by (i) mark-to-market losses primarily relating to our investment in BridgeBio Pharma, Inc., PetVet Care Centers, LLC (healthcare sector), and Accell Group N.V. (consumer products sector) and (ii) the reversal of previously recognized unrealized gains relating to the realization activity described above.\nThe factors that affect each investment strategy vary depending on the nature of the asset class and the valuation methodology employed. For the year ended December 31, 2024, net gains were primarily generated in the following asset classes:\nPrivate Equity (including core private equity), which were primarily impacted by (i) overall positive operating performance of its portfolio companies and (ii) the positive returns of global equity markets and the related increase of market multiples used in the market comparables methodology for the valuation of Level III investments; and\nInfrastructure, which primarily benefited from the positive operating performance of certain infrastructure assets and, to a lesser extent, by the positive returns of global equity markets and the related increase of market multiples used in the market comparables methodology for the valuation of Level III investments.\nSee \"Risk Factors\" and \"—Business Environment\" for more information about the factors that may impact our business, financial performance, operating results, and valuation.\nNet Gains (Losses) from Investment Activities for the year ended December 31, 2023\nThe net gains from investment activities for the year ended December 31, 2023 were comprised of net realized losses of $(776.5) million and net unrealized gains of $3,801.9 million.\nRealized Gains and Losses from Investment Activities\nFor the year ended December 31, 2023, net realized losses related primarily to (i) a realized loss on our investment in GenesisCare Pty Ltd. (healthcare sector), (ii) realized losses from the distribution of certain assets to third-party investors in certain of our consolidated energy funds, predominantly allocated to noncontrolling interests based on their ownership in our investment funds, (iii) a realized loss on our investment in Envision Healthcare Corporation (healthcare sector), and (iv) realized losses on alternative credit investments, Hilding Anders International AB (consumer products sector) and Chembulk Group (transportation sector), predominantly allocated to noncontrolling interests based on their ownership in our investment funds. Partially offsetting these realized losses were realized gains primarily relating to (i) realizations on certain foreign exchange forward contracts and (ii) the sale of our investment in KnowBe4, Inc. (NASDAQ: KNBE) and Flutter Entertainment PLC (NYSE: FLUT).\nUnrealized Gains and Losses from Investment Activities\nFor the year ended December 31, 2023, net unrealized gains were driven primarily by (i) mark-to-market gains primarily relating to BridgeBio Pharma, Inc., Exact Holding B.V., and USI, Inc., (ii) the reversal of previously recognized unrealized losses relating to the realization activity described above, and (iii) certain investments held in our consolidated CLOs. These unrealized gains were partially offset by mark-to-market losses primarily relating to (i) PetVet Care Centers, LLC, (ii) certain foreign exchange forward contracts, and (iii) debt obligations of our consolidated CLOs.\nFor a discussion of other factors that affected KKR's realized investment income, see \"—Analysis of Asset Management Segment Operating Results.\" For additional information about net gains (losses) from investment activities, see Note 4 \"Net Gains (Losses) from Investment Activities - Asset Management and Strategic Holdings\" in our financial statements.\nDuring the year ended December 31, 2024, dividend income was primarily from (i) our investments in 1-800 Contacts Inc. and Exact Holdings B.V. held through our consolidated core investment vehicles, (ii) certain of our consolidated opportunistic real estate equity funds, and (iii) our investment in MásOrange (telecommunications sector), held through our consolidated European Fund V. During the year ended December 31, 2023, dividend income was primarily from (i) certain investments held in our consolidated open-ended core infrastructure fund, Diversified Core Infrastructure Fund, (ii) certain of our consolidated opportunistic real estate equity funds, and (iii) Cegid Group S.A. (technology sector) and Atlantic Aviation FBO Inc. (infrastructure: transportation sector), both held in our consolidated core private equity funds.\nSignificant dividends from portfolio companies and consolidated funds are generally not recurring quarterly dividends, and while they may occur in the future, their size and frequency are variable. For a discussion of other factors that affected KKR's dividend income, see \"—Analysis of Asset Management Segment Operating Results.\"\nThe increase in interest income during the year ended December 31, 2024 compared to the year ended December 31, 2023 was primarily due to (i) the impact of closing CLOs that are consolidated subsequent to December 31, 2023 and (ii) the impact of higher interest rates during the period on floating rate credit investments held in consolidated CLOs and our consolidated private credit funds. For a discussion of other factors that affected KKR's interest income, see \"—Analysis of Asset Management Segment Operating Results.\"\nThe increase in interest expense during the year ended December 31, 2024 compared to the year ended December 31, 2023 was primarily due to (i) the increase in the amount of borrowings outstanding from certain consolidated funds and other investment vehicles, (ii) the impact of closing CLOs that are consolidated subsequent to December 31, 2023, (iii) the impact of higher interest rates during the current period on floating rate debt obligations held in consolidated CLOs, and (iv) the impact of issuances of KKR senior notes after December 31, 2023. For a discussion of other factors that affected KKR's interest expense, see \"—Analysis of Non-GAAP Performance Measures.\"\nCompensation and Benefits\nThe increase in compensation and benefits during the year ended December 31, 2024 compared to the year ended December 31, 2023 was primarily due to a higher level of accrued carried interest compensation in the current period driven by a higher level of carried interest income earned and a higher percentage allocable to our carry pool in the current period. Additionally, the number of equity-based compensation awards granted in 2023 was higher than in 2022, which resulted in higher equity-based compensation in the current period.\nOccupancy and Related Charges\nThe increase in occupancy and related charges during the year ended December 31, 2024, compared to the year ended December 31, 2023, was primarily due to the commencement of new office leases in the current period.\nGeneral, Administrative and Other\nThe increase in general, administrative and other during the year ended December 31, 2024 compared to the year ended December 31, 2023 was primarily due to (i) a provision for legal reserves in the current period, (ii) a higher level of expenses reimbursable by our unconsolidated investment funds, and (iii) issuance costs from newly formed consolidated CLOs in the current period.\nIn periods of increased fundraising and to the extent that we use third parties to assist in our capital raising efforts, our General, Administrative and Other are expected to increase accordingly.\nConsolidated Results of Operations (GAAP Basis) - Insurance\nFor the years ended December 31, 2024 and 2023, revenues consisted of the following:\n\nThe increase in net other investment losses for the year ended December 31, 2024, as compared to the year ended December 31, 2023, was primarily due to (i) an increase in unrealized losses on fixed maturity securities classified as trading primarily as a result of an increase in market interest rates during the year ended December 31, 2024, as compared to relatively flat market interest rates during the year ended December 31, 2023, (having generally increased during 2023, and then decreased at the end of fourth quarter 2023), (ii) an increase in realized losses on available-for-sale fixed maturity securities as result of portfolio optimization and asset rotation, and (iii) a decrease in realized gains on real assets.\nOffsetting these increases in net other investment losses was an increase in realized gains on funds withheld at interest payable portfolio.\nNet Policy Benefits and Claims\nNet policy benefits and claims increased for the year ended December 31, 2024, as compared to the year ended December 31, 2023, primarily due to (i) an increase in net flows from both individual and institutional market channel sales, (ii) higher initial reserves assumed related to new reinsurance transactions with life contingencies or morbidity risk in the year ended December 31, 2024, as compared to the year ended December 31, 2023, (iii) higher average funding costs due to higher crediting rates and the ordinary-course run-off of older business originated in a lower interest rate environment, and (iv) an increase in the value of embedded derivatives in Global Atlantic’s fixed indexed annuity products, as a result of new business inflows and equity market gains (as discuss",
  "item2_clean": null
}