{
  "source_file": "kmb-20241231.htm",
  "form_type": "10-K",
  "item1_clean": "ITEM 1. BUSINESS\nDescription of Kimberly-Clark\nKimberly-Clark Corporation was founded in 1872 and incorporated in Delaware in 1928.\nWe are a global company focused on delivering products and solutions that provide better care for a better world through product innovation and building o\nur brands. We are principally engaged in the manufacturing and marketing of a wide range of products made from natural or synthetic fibers and materials using advanced technologies in fibers, nonwovens and absorbency. Fueled by ingenuity, creativity, and an understanding of people's most essential needs, we create products that help individuals experience more of what's important to them. Our portfolio of brands, including Huggies, Kleenex, Scott, Kotex, Cottonelle, Poise, Depend, Andrex, Pull-Ups, GoodNites, Intimus, Plenitud, Sweety, Softex, Viva and WypAll, encompass five global daily-need product categories: Baby & Child Care, Adult Care, Feminine Care, Family Care, and Professional. We strive to use sustainable practices that support a healthy planet, build strong communities, and ensure our business will thrive for decades to come. Unless the context indicates otherwise, the terms \"Corporation,\" \"Kimberly-Clark,\" \"K-C,\" \"we,\" \"our\" and \"us\" refer to Kimberly-Clark Corporation and its consolidated subsidiaries.\nBusiness Strategy and Segment Reporting\nDuring fiscal 2024, we announced our 2024 Transformation Initiative in order to create a more agile and focused operating structure that will accelerate our proprietary pipeline of innovation in right-to-win spaces and improve our growth trajectory, profitability, and returns on investment. This new operating structure leverages three synergistic forces:\nAccelerating pioneering innovation to capture significant growth available in our product categories by investing in science and technology to satisfy unmet and evolving consumer needs;\nOptimizing our margin structure to deliver superior consumer propositions and implement initiatives and deploy technology and data analytics designed to create a fast, adaptable, integrated supply chain with greater visibility that can deliver continuous improvement; and\nWiring our organization for growth to drive agility, speed, and focused execution that extends our competitive advantages further into the future.\nAs part of this transformation, we realigned our internal operating and management structure to streamline our global supply chain and improve the efficiency of our corporate and regional overhead cost structures. As a result of this realignment, we manage and report our operations through three reportable segments defined by geographic regions and product groupings: North America (\"NA\"), International Personal Care (\"IPC\") and International Family Care and Professional (\"IFP\"). Further, our measure of segment profitability was changed to include the effects of changes in exchange rates on monetary assets and liabilities for subsidiaries where we have adopted highly inflationary accounting. Segment results for the historical periods presented in these consolidated financial statements have been recast to reflect these changes. These changes had no impact on our previously reported consolidated net sales, operating profit, net income attributable to Kimberly-Clark or earnings per share.\nThese segments are described in greater detail in Item 8, Note 15 to the consolidated financial statements.\nDistribution and Customers\nProducts for household use are sold directly to supermarkets, mass merchandisers, drugstores, warehouse clubs, variety and department stores and other retail outlets, as well as through other distributors and e-commerce. Products for professional use are sold through distributors, directly to manufacturing, lodging, office building, food service, and high-volume public facilities, and through e-commerce.\nOur largest customer, Walmart Inc., represented approximately\n% in 2023 and 2022 of our consolidated net sales. Net sales to Walmart Inc. were primarily in the NA segment.\nKIMBERLY-CLARK CORPORATION\n- 2024 Annual Report\nAcquisitions and Divestitures\n2024 - The sale of our personal protective equipment business which included Kimtech branded products such as gloves, apparel and masks, and KleenGuard branded products such as gloves, apparel, respirators and eyewear. This business and brands serve a variety of scientific and industrial industries globally.\n2023 - The acquisition of the remaining shares of Thinx Inc. (“Thinx”), an industry leader in the reusable period and incontinence underwear category.\n2023 - The sale of our Neve tissue brand and related consumer and professional tissue assets in Brazil.\nThese transactions are discussed in greater detail in Item 8, Note 3 to the consolidated financial statements.\nPatents and Trademarks\nWe own various patents and trademarks registered domestically and in many foreign countries. We consider the patents and trademarks that we own and the trademarks under which we sell certain of our products to be material to our business. Consequently, we seek patent and trademark protection by all available means, including registration.\nCellulose fiber, in the form of kraft pulp or fiber recycled from recovered waste paper, is the primary raw material for our tissue products, and in the form of fluff pulp, is a component of disposable diapers, training and youth pants, feminine pads and incontinence care products.\nPolypropylene and other synthetics and chemicals are the primary raw materials for manufacturing nonwoven fabrics, which are used in disposable diapers, training and youth pants, wet wipes, feminine pads, incontinence care products, and professional wipers and apparel. Superabsorbent materials are important components of disposable diapers, training and youth pants and incontinence care products.\nRaw materials are purchased from third parties, and we consider the supply to be adequate to meet the needs of our businesses. See Item 1A, \"Risk Factors.\"\nWe have several major competitors in most of our markets, some of which are larger and more diversified than us. The principal methods and elements of competition include brand recognition and loyalty, product innovation, quality and performance, price, and marketing and distribution capabilities. For additional discussion of the competitive environment in which we conduct our business, see Item 1A, \"Risk Factors.\"\nCorporate Responsibility and Sustainability\nBetter care for a better world begins with focusing on the health and safety of our customers, consumers, and employees; promoting the value of inclusion, equity and diversity within our business; and making efforts to protect the rights of workers across our supply chain. We believe we can make meaningful contributions through our business activities and operations to clean water and sanitation, climate action and responsible consumption and production. Our sustainability strategy puts our brand, supply chain and innovation teams to work with the goal of creating shared value by addressing relevant global challenges and is focused on addressing key climate-related risks and opportunities throughout our value chain.\nKIMBERLY-CLARK CORPORATION\n- 2024 Annual Report\nWe strive to make lives better while also working to help safeguard the earth’s natural ecosystems. We implement this effort by considering our sustainability goals during our business and capital planning processes, coordinating the priorities of our supply chain, brand and innovation teams, and establishing meaningful performance indicators. Our environmental priorities include reducing our use of new fossil fuel-based plastic, while enabling circular systems to recover the materials in our products and packaging; reducing our products’ use of natural forest fiber, while supporting forest biodiversity and forest dependent communities; reducing greenhouse gas emissions along our value chain, with goals approved by the Science Based Targets initiative (\"SBTi\"); and building resilience to water risk at our facilities and in our communities in water-stressed regions around the world. We have aligned our goals with the United Nations' Sustainable Development Goals framework. Progress on our strategy is outlined in our Global Sustainability reports.\nFor 2025 and 2026, we expect total capital expenditures for voluntary environmental controls or controls necessary to comply with legal requirements relating to the protection of the environment at our facilities to average approximately $60 on an annual basis. Total operating expenses for environmental compliance, including pollution control equipment operation and maintenance costs, governmental fees, and research and engineering costs, are expected to be approximately $115 in 2025 and $140 in 2026.\nTotal environmental capital expenditures and operating expenses are not expected to have a material effect on our total capital and operating expenditures, consolidated earnings or competitive position. Current environmental spending estimates could be modified as a result of changes in our plans or changes in legal requirements, including any requirements related to global climate change or other factors.\nRegulatory Compliance\nWe are subject to many laws and regulations across all the countries in which we do business, and we are particularly impacted by those relating to product safety, environmental protection and data privacy and protection. We are also subject to anti-corruption laws and regulations, such as the U.S. Foreign Corrupt Practices Act, and antitrust and competition laws and regulations that govern our dealings with suppliers, customers, competitors and government officials.\nWe are obligated to comply with regulations that cover product safety, efficacy, manufacturing, advertising, labeling and safety reporting. These include requirements that we provide a label that highlights perceived concerns about a product or warns consumers of risks of using our products. In some cases, it may be necessary to initiate product recalls if safety risks are considered to exist. All our facilities and other operations are subject to various environmental protection statutes and regulations, including those relating to the use of water resources and the discharge of wastewater. We are also subject to expanding laws and regulations related to sustainability-related matters, non-financial reporting and diligence, labor and employment, trade, taxation and data privacy and protection, including the European Union’s General Data Protection Regulation, Brazil's General Data Protection Law, China's Personal Information Protection Law, and the California Consumer Privacy Act of 2018.\nOur policy is to abide by all applicable laws and regulations, and we have internal programs in place to manage global compliance with these various requirements. We also expect that our many suppliers, consultants and other third parties working on our behalf share our commitment to compliance, and we have policies and procedures in place to manage these relationships, though they inherently involve a lesser degree of control over operations and governance. We monitor each of these areas for new or changed regulatory requirements, particularly in the rapidly evolving area of data privacy and protection. We have made, and plan to continue making, necessary expenditures for compliance with applicable laws and regulations; however, total capital expenditures and operating expenses related to compliance are not expected to have a material effect on our total capital and operating expenditures, consolidated earnings or competitive position.\nKIMBERLY-CLARK CORPORATION\n- 2024 Annual Report\nHuman Capital Management\nWe had approximately 38,000 employees as of December 31, 2024 in our consolidated operations. Approximately 35% of our employees were located in North America and the remainder were in approximately 60 countries outside of North America. Overall, approximately 55% of",
  "item7_clean": "Certain actions under the 2024 Transformation Initiative are being finalized for implementation, and accounting for such actions will commence when the actions are authorized for execution. The 2024 Transformation Initiative is expected to be completed by the end of 2026. Total pre-tax savings are expected to be $3.0 billion in gross productivity; inclusive of input cost and manufacturing cost savings, and $200 in selling, general and administrative expenses. Total costs are anticipated to be approximately $1.5 billion pre-tax. Cash costs are expected to be approximately half of that amount, primarily related to workforce reductions. Expected non-cash charges are primarily related to incremental depreciation and asset write-offs, including losses associated with the expected exit of certain markets. For the year ended December 31, 2024, total 2024 Transformation Initiative charges were $457 pre-tax ($339 after-tax).\nKIMBERLY-CLARK CORPORATION\n- 2024 Annual Report\nChange in Reportable Segments\nAs part of the 2024 Transformation Initiative and the realignment of our internal operating and management structure during the fourth quarter of 2024, we manage and report our operations through three reportable segments defined by geographic regions and product groupings: North America (\"NA\"), International Personal Care (\"IPC\") and International Family Care and Professional (\"IFP\"). Further, our measure of segment profitability was changed to include the effects of changes in exchange rates on monetary assets and liabilities for subsidiaries where we have adopted highly inflationary accounting. These changes reflect the manner in which our chief operating decision maker develops, executes and evaluates global strategies to drive growth and profitability. Segment results for the historical periods presented in these consolidated financial statements have been recast to reflect these changes. These changes had no impact on our previously reported consolidated net sales, operating profit, net income attributable to Kimberly-Clark or earnings per share. These segments are described in greater detail in Item 8, Note 15 to the consolidated financial statements.\nAcquisition and Divestiture Activity\nOn July 1, 2024, we completed the sale transaction that was announced on April 7, 2024, of our personal protective equipment (\"PPE\") business for total consideration of $635, including the initial purchase price of $640 less working capital and other closing adjustments of $5. The transaction included Kimtech branded products, such as gloves, apparel and masks, and KleenGuard branded products, such as gloves, apparel, respirators and eyewear, which serve a variety of scientific and industrial industries globally. Upon closure of the transaction, a pre-tax gain of $566 ($453 after-tax) was recognized in Other (income) and expense, net. This gain is net of transaction costs of $14 that were determined to be directly attributable to the sale transaction.\nOn February 24, 2022, we completed our acquisition of a majority and controlling share of Thinx Inc. (“Thinx”), an industry leader in the reusable period and incontinence underwear category, for total consideration of $181. Subsequently in 2023, we acquired the remaining outstanding ownership interests in Thinx for additional purchase consideration of $95. As the purchase of additional ownership in an already controlled subsidiary represents an equity transaction, no gain or loss was recognized in consolidated net income or comprehensive income. See Item 8, Note 3 to the consolidated financial statements for additional details.\nOn June 1, 2023, we completed the sale transaction of our Neve tissue brand and related consumer and professional tissue assets in Brazil for $212. Upon closure of the transaction, a gain of $74 pre-tax was recognized in Other (income) and expense, net. We incurred divestiture-related costs of $30 pre-tax which were recorded in Cost of products sold and Marketing, research and general expenses, resulting in a net benefit of $44 pre-tax ($26 after-tax). See Item 8, Note 3 to the consolidated financial statements for additional details.\nOverview of 2024 Results\nNet sales of $20.1 billion declined 1.8% primarily due to unfavorable currency impacts and divestitures and business exits. Organic sales increased 3.2% driven by higher pricing, primarily in hyperinflationary economies, and volume and mix gains.\nOperating Profit of $3.2 billion increased 36.9% while Net Income Attributable to Kimberly-Clark of $2.5 billion increased 44.3%. Results primarily benefited from higher gross margins and the gain on sale of our PPE business, partially offset by charges related to the 2024 Transformation Initiative. Prior year results were primarily impacted by charges related to the impairment of intangible assets.\nDiluted earnings per share were $7.55 compared to $5.21, an increase of 44.9%, reflective of the growth in net income. Results in 2024 included a net benefit of $0.25 for items not reflective of our ongoing operations compared with a net charge of $1.36 in the prior year.\nWe continue to focus on generating cash flow and allocating capital to shareholders. Cash provided by operations was $3.2 billion in 2024. We raised our dividend in 2024 by 3.4%, the 52nd consecutive annual increase in our dividend, and altogether share repurchases and dividends in 2024 amounted to $2.6 billion.\nIn 2025, we will continue executing on our Powering Care growth strategy and its three strategic pillars: accelerate pioneering innovation, optimize our margin structure, and wire our organization for growth. Our first pillar focuses on\nKIMBERLY-CLARK CORPORATION\n- 2024 Annual Report\ninvesting in our brands to enhance our competitive advantage by leveraging our best-in-class science and proprietary, category-shaping technologies for innovative product solutions that solve unmet consumer needs around the world. Our second pillar is driven by our supply chain transformation and investment in three key areas that will enhance our value chain and improve our margin structure: value stream simplification, network optimization, and scalable automation. Our third pillar is centered on making our enterprise stronger and faster while sharpening our portfolio focus and footprint on categories and markets with the greatest long-term potential.\nOur strong legacy of financial discipline supports our Powering Care growth strategy through consistent investment in our technologies and brands, sustained supply chain productivity and enhanced working capital efficiency. Our capital allocation approach prioritizes capital investments to drive growth in our business, a strong and growing dividend, value accretive acquisitions that can enhance our portfolio, and allocation of excess cash flow to share repurchases.\nBusiness Environment and Trends\nOur results of operations have been, and we expect them to continue to be, affected by the following factors and key trends, which may cause our future results of operations to differ from our historical results discussed under “Consolidated Results of Operations.”\n- Sales of our baby and child care products are highly correlated with birth rate trends. In recent years, birth rate declines in key countries, including China, South Korea and the U.S., have pressured category volume growth rates. To help mitigate the effects of birth rate declines, we aim to drive sales growth at or ahead of category growth rates through innovation, premiumization, strong brand building plans and digital marketing investment as part of our growth strategy.\n- Our products are sold in a highly competitive global marketplace. Our competitors include global, regional and local manufacturers, including private label manufacturers which offer products that are typically sold at lower prices. In particular, private label market share has been increasing in the tissue category. Increased purchases of private label products could reduce net sales of our higher-margin products which would negatively impact our profitability. While the global marketplace in which we operate has always been highly competitive, we continue to experience increased concentration and the growing presence of large-format retailers, discounters and e-tailers. This market environment has resulted in increased pressure on pricing and other competitive factors, and we expect these pressures to continue in the coming year.\n- Our net sales growth and profitability may be affected as we adjust prices to address market conditions. We adjust our product prices based on a number of variables including demand, the competitive environment, technological improvements, product innovations and changes in our raw material, distribution, energy and other input costs. Price changes may affect net sales, earnings and market share in the near term as the market adjusts to new pricing and other market conditions.\n- Our operating costs include raw materials, labor, selling, general and administrative expenses, general business taxes, currency impacts and financing costs. We manage these costs through cost saving and productivity initiatives, sourcing and hedging programs, and pricing actions. To remain competitive on our operating structure, we continue to work on programs to expand our profitability, including our 2024 Transformation Initiative. While we saw stabilization in input costs in 2024 with tailwinds in fiber, resin and energy, the overall cost basket remains elevated versus pre-pandemic levels. In 2025, we expect net input costs to be inflationary, including the impact from currency on our non-U.S. operations.\nEvolving Consumer Product and Shopping Preferences\n- The retail landscape in many of our markets continues to evolve due to the rapid growth of e-commerce retailers, changing consumer preferences (as consumers increasingly shop online) and the increased presence of alternative retail channels, such as subscription services and direct-to-consumer businesses. Changing consumer preferences also include increased concerns in regard to post-consumer waste and packaging materials and their impact on environmental sustainability. If we experience\nKIMBERLY-CLARK CORPORATION\n- 2024 Annual Report\nlower sales due to changes in consumer demand for our products, our earnings could decrease. We believe our strategic growth focus, sustainability initiatives, innovation pipeline and continued investment in e-commerce capabilities has us well positioned relative to these changing dynamics.\nVolatility of Global Markets\n- Our growth strategy depends in part on our ability to expand our international operations, including in emerging markets. Some of these markets have greater political, economic and currency volatility and greater vulnerability to infrastructure and labor disruptions. Volatility in these markets affects our production costs and the demand for our products and may impact our supply chain and distribution networks. Volatility in global consumer demand, commodity costs and foreign currency exchange rates increased significantly over the past few years and is expected to continue in the near term.\n- We operate in many regions around the world where our businesses could be disrupted by climate change. Our climate change risk categories include risks related to the transition to a lower-carbon economy (“Transition Risks”) and risks related to the physical impacts of climate change (“Physical Risks”). Transition Risks include increased costs of carbon emission, increased cost to produce products in compliance with future regulations, increased raw materials cost, shifts in customer/consumer values and other legal, regulatory and technological risks.\nP\nhysical Risks include the risk of direct damage to assets or supply chain disruption caused by severe weather events such as floods, storms, wildfires and droughts. We continue to progress toward our 2030 Sustainability Goals which include elements that aim for reductions in greenhouse gas emissions, use of natural forest fibers, use of plastics and use of water in water-stressed regions.\n- Consistent with the humanitarian nature of our products, we manufacture and sell only essential items in Russia, such as baby diapers and feminine pads, which are critical to the health and hygiene of women, girls and babies. Beginning in March 2022, we significantly adjusted our business in Russia, substantially curtailing media, advertising and promotional activity and suspending capital investments, other than certain maintenance investments, in our sole manufacturing facility in Russia. Our Russia business has represented approximately 1% to 2% of our net global sales, operating profit and total assets. Our ability to continue our operations in Russia may change as the situation evolves. We have experienced high input costs, supply chain complexities, reduced consumer demand, restricted access to raw materials and production assets, and restricted access to financial institutions, as well as supply chain, professional services, monetary, currency, trade and payment/investment sanctions and related controls. As the business, geopolitical and regulatory environment concerning Russia evolves, we may not be able to sustain the limited manufacture and sale of our products, and our assets may be partially or fully impaired.\nKIMBERLY-CLARK CORPORATION\n- 2024 Annual Report\nConsolidated Results of Operations\nThe following discussion and analysis compares our consolidated net sales, operating profit and other information for 2024 with 2023.\nYear Ended December 31\nProvision for income taxes\nNet Income Attributable to Kimberly-Clark Corporation\nDiluted Earnings per Share\nAdjusted Gross Profit\nAdjusted Operating Profit\nAdjusted Earnings per Share\nAdjusted Effective Tax Rate\n\n(a) Adjusted amounts are Non-GAAP financial measures. See \"Summary of Non-GAAP Financial Measures\" below for reconciliations of our GAAP to Non-GAAP measures.\nDrivers of the changes in net sales were:\nPercent Change in Net Sales\nDivestitures and Business Exits\nCurrency Translation\n(a) Total may not sum across due to rounding.\n(b) Represents the change in net sales excluding the impacts of currency translation and divestitures and business exits. Organic Sales Growth is a non-GAAP financial measure. See \"Summary of Non-GAAP Financial Measures\" below for reconciliations of our GAAP to non-GAAP measures.\n(c) Impact of the sale of the Brazil tissue and professional business, sale of the PPE business and other exited businesses and markets in conjunction with the 2024 Transformation Initiative.\nNet sales of $20.1 billion for the year ended December 31, 2024 declined 1.8% primarily due to unfavorable currency impacts and divestitures and business exits. Excluding these items, organic growth was 3.2% driven by a 1.9% increase in price, primarily in hyperinflationary economies, coupled with volume and mix gains across all three reportable segments.\nGross and Operating Profits\nGross profit of $7.2 billion for the year ended December 31, 2024 increased 2.1%, while gross margin of 35.8% increased 140 basis points. Gross margin in the current year included approximately 70 basis points for charges related to the 2024 Transformation Initiative. Excluding these charges, adjusted gross margin increased 200 basis points to 36.5% primarily due to gross productivity savings from integrated margin management of approximately $500 million, favorable pricing net of inflation and volume gains, partially offset by higher manufacturing costs.\nOperating profit of $3.2 billion for the year ended December 31, 2024 increased 36.9%. Results in 2024 included a $565 million gain from the sale of our PPE business, offset by charges of $456 million related to the 2024 Transformation Initiative and $136 million from the impairment of intangible assets and litigation and regulatory matters associated with a previously exited business. Results in 2023 included ",
  "item2_clean": null
}