{
  "source_file": "kmb-20250930.htm",
  "form_type": "10-Q",
  "item1_clean": null,
  "item7_clean": null,
  "item2_clean": "Net sales of $1.4 billion for the three months ended September 30, 2025 increased 1.9% primarily due to a 2.1% increase in organic sales. Organic sales benefited from volume and mix gains of 2.0% and 1.6%, respectively, driven by China, South Korea, Australia and Indonesia, partially offset by lower pricing. Net sales of $4.3 billion for the nine months ended September 30, 2025 decreased 2.5% primarily driven by unfavorable currency impacts, partially offset by organic sales growth of 0.8%. The components of organic sales are consistent with the drivers discussed above.\nOperating profit for the three months ended September 30, 2025 of $214 increased 6.5% driven by gross productivity savings, volume and mix gains and lower marketing, research and general expenses, partially offset by unfavorable pricing net of cost inflation. Operating profit for the nine months ended September 30, 2025 of $597 decreased 9.7%, primarily due to unfavorable pricing net of cost inflation, supply chain related investments and currency impacts, partially offset by gross productivity savings and volume and mix gains.\nLiquidity and Capital Resources\nAs detailed in Item 1, Note 1 to the Unaudited Interim Condensed Consolidated Financial Statements, the Condensed Consolidated Statements of Cash Flows are presented on a consolidated basis for both continuing operations and discontinued operations. As a result, unless specifically stated, the following discussion reflects Kimberly Clark's consolidated results for all periods presented.\nCash Provided by Operations\nCash provided by operations was $1.8 billion during the nine months ended September 30, 2025 compared to $2.4 billion in the prior year. The decrease was driven by lower operating profit and timing impacts to working capital, including incremental restructuring and IFP Transaction separation cost payments of approximately $120.\nCash used for investing was $650 during the nine months ended September 30, 2025 compared to cash provided by investing of $94 in the prior year. This change is primarily due to proceeds from asset and business dispositions of $649 in 2024, primarily reflecting the sale of our PPE business. During the nine months ended September 30, 2025, our capital spending was $741 compared to $512 in the prior year. We anticipate that full year capital spending will be approximately $1.0 to $1.2 billion, including incremental spending from the 2024 Transformation Initiative.\nCash used for financing was $1.6 billion during the nine months ended September 30, 2025 compared to $2.5 billion in the prior year. This decrease was primarily due to decreased share repurchases, coupled with an increase in U.S. commercial paper. During the nine months ended September 30, 2025, we repurchased 1.1 million shares of our common stock pursuant to our publicly announced share repurchase programs at a total cost of $140 through a broker in the open market.\nOur short-term debt, which consists of U.S. commercial paper with original maturities up to 90 days and/or other short-term debt issued by non-U.S. subsidiaries, was $421 as of September 30, 2025 (included in Debt payable within one year on the Condensed Consolidated Balance Sheets). The average month-end balance of short-term debt for the nine months ended September 30, 2025 was $257. These short-term borrowings provide supplemental funding to support our operations. The level of short-term debt generally fluctuates depending upon the amount of operating cash flows and the timing of customer receipts and payments for items such as dividends and income taxes.\nAs of September 30, 2025 and December 31, 2024, total debt from continuing operations was $7.3 billion and $7.4 billion, respectively.\nWe maintain a $2.0 billion revolving credit facility which expires in June 2028 and a $750 revolving credit facility which expires in May 2026. These facilities, currently unused, support our commercial paper program and would provide liquidity in the event our access to the commercial paper markets is unavailable for any reason.\nOn July 4, 2025, the One Big Beautiful Bill Act (“OBBBA”) was enacted in the U.S. The OBBBA includes significant provisions, such as the permanent extension of certain expiring provisions of the Tax Cuts and Jobs Act, modifications to the international tax framework and the restoration of favorable tax treatment for certain business provisions. The legislation has multiple effective dates, with certain provisions effective in 2025 and others implemented through 2027. We are expecting favorable cash tax impacts in the near and medium term as a result of the OBBBA. During the three months ended September 30, 2025, provisions within the OBBBA increased the Noncurrent deferred tax liability by approximately $200 primarily due to the valuation allowance recorded in the quarter and changes providing for the immediate deduction of previously capitalized research and development expenditures.\nWe have evaluated the effects of the Global anti-Base Erosion rules set forth by the Organization for Economic Co-Operation and Development, referred to as “Pillar 2,” which establishes a global minimum corporate tax rate of 15%. We have (1) determined that Pillar 2 legislation has been enacted in one or more of the jurisdictions in which the Company operates and the Company is within the scope of such legislation, (2) assessed such enacted legislation and, as applicable, the Transitional Safe Harbor provisions for Pillar 2 that apply, and (3) determined the impact will be immaterial to our financial results. We intend to file a Qualified Country-by-Country Report for the current year for each jurisdiction in which we intend to rely on the Transitional Country-by-Country Reporting Safe Harbor provisions.\nWe believe that our ability to generate cash from operations and our capacity to issue short-term and long-term debt are adequate to fund working capital, obligations related to our 2024 Transformation Initiative, capital spending, pension contributions, share repurchases, dividends and other needs for the foreseeable future. Further, we do not expect restrictions or taxes on repatriation of cash held outside of the U.S. to have a material effect on our overall business, liquidity, financial condition or results of operations for the foreseeable future.\nInformation Concerning Forward-Looking Statements\nCertain matters contained in this report concerning the business outlook, including raw material, energy and other input costs, our plans and expectations regarding the pending IFP Transaction, the anticipated charges and savings from the 2024 Transformation Initiative, cash flow and uses of cash, growth initiatives, innovations, marketing and other spending, net sales, anticipated currency rates and exchange risks, including the impact in Argentina and\nTürkiye, effective tax rate, contingencies and anticipated transactions of Kimberly-Clark, including dividends, share repurchases and pension contributions, constitute \"forward-looking statements\" within the meaning of the Private Securities Litigation Reform Act of 1995 and are based upon management's expectations and beliefs concerning future events impacting Kimberly-Clark. There can be no assurance that these future events will occur as anticipated or that our results will be as estimated. Forward-looking statements speak only as of the date they were made, and we undertake no obligation to publicly update them.\nThe assumptions used as a basis for the forward-looking statements include many estimates that, among other things, depend on the achievement of future cost savings and projected volume increases. In addition, many factors outside our control, including risks and uncertainties around the pending IFP Transaction (including risks related to delays or failure to complete the proposed transaction, the incurrence of significant transaction and separation costs, adverse market reactions, regulatory or legal challenges, and operational disruptions), risks that we are not able to realize the anticipated benefits of the 2024 Transformation Initiative (including risks related to disruptions to our business or operations or related to any delays in implementation), war in Ukraine (including the related responses of consumers, customers, and suppliers and sanctions issued by the U.S., the European Union, Russia or other countries), government trade or similar regulatory actions (including current and potential trade and tariff actions affecting the countries where we operate and the resulting negative impacts on our supply chain, commodity costs, and consumer spending), pandemics, epidemics, fluctuations in foreign currency exchange rates, the prices and availability of our raw materials, supply chain disruptions, disruptions in the capital and credit markets, counterparty defaults (including customers, suppliers and financial institutions with which we do business), failure to realize the expected benefits or synergies from our acquisition and disposition activity, impairment of goodwill and intangible assets and our projections of operating results and other factors that may affect our impairment testing, changes in customer preferences, severe weather conditions, regional instabilities and hostilities (including the war in Israel), potential competitive pressures on selling prices for our products, energy costs, general economic and political conditions globally and in the markets in which we do business, as well as our ability to maintain key customer relationships, could affect the realization of these estimates.\nSUMMARY OF NON-GAAP FINANCIAL MEASURES\nThe following provides the reconciliation of the non-GAAP financial measures provided in this report to the most closely related GAAP measure. These measures include: Organic Sales Growth, Adjusted Gross Profit, Adjusted Operating Profit, Adjusted Earnings per Share, and Adjusted Effective Tax Rate. All discussions regarding non-GAAP financi"
}