{
  "source_file": "ko-20241231.htm",
  "form_type": "10-K",
  "item1_clean": "Mexico (a substantial part of central Mexico, as well as southeast and northeast Mexico), Guatemala, Colombia (most of the country), Nicaragua, Costa Rica, Panama, Venezuela, Uruguay, Brazil (a major part of the states of São Paulo and Minas Gerais; the states of Mato Grosso do Sul, Paraná, Rio Grande do Sul, and Santa Catarina; and part of the states of Goiás and Rio de Janeiro), and Argentina (federal capital of Buenos Aires and surrounding areas);\nCoca-Cola Europacific Partners plc (“CCEP”), which has bottling and distribution operations in Andorra, Australia, Belgium, continental France, Germany, Great Britain, Iceland, Indonesia, Luxembourg, Monaco, the Netherlands, New Zealand and Pacific Islands, Norway, Papua New Guinea, the Philippines, Portugal, Spain and Sweden;\nCoca-Cola HBC AG (“Coca-Cola Hellenic”), which has bottling and distribution operations in Armenia, Austria, Belarus, Bosnia and Herzegovina, Bulgaria, Croatia, Cyprus, the Czech Republic, Egypt, Estonia, Greece, Hungary, Italy, Latvia, Lithuania, Moldova, Montenegro, Nigeria, North Macedonia, Northern Ireland, Poland, the Republic of Ireland, Romania, Russia, Serbia, Slovakia, Slovenia, Switzerland and Ukraine;\nArca Continental, S.A.B. de C.V., which has bottling and distribution operations in northern and western Mexico, northern Argentina, Ecuador, Peru, and the state of Texas and part of the states of New Mexico, Oklahoma and Arkansas in the United States; and\nSwire Coca-Cola Limited, which has bottling and distribution operations in 11 provinces and the Shanghai municipality in mainland China, Hong Kong, Taiwan, Cambodia, Laos, Thailand, Vietnam and territories in 13 states in the western United States.\nIn 2024, these five bottling partners combined represented 44% of our total worldwide unit case volume.\nBeing a bottler does not create a legal partnership or joint venture between us and our bottlers. Our bottlers are independent contractors and are not our agents.\nBottler’s Agreements\nWe have separate contracts, to which we generally refer as “bottler’s agreements,” with our bottling partners under which our bottling partners are granted certain authorizations by us. Subject to specified terms and conditions and certain variations, the bottler’s agreements generally authorize the bottlers to prepare, package, distribute and sell Company Trademark Beverages in authorized containers in (but, subject to applicable local law, generally only in) an identified territory. The bottler is obligated to purchase its entire requirement of concentrates or syrups for the designated Company Trademark Beverages from the Company or Company-authorized suppliers. We typically agree to refrain from selling or distributing, or from authorizing third parties to sell or distribute, the designated Company Trademark Beverages throughout the identified territory in the particular authorized containers. However, we typically reserve for us or our designee the right (1) to prepare and package such Company Trademark Beverages in such containers in the territory for sale outside the territory; (2) to prepare, package, distribute and sell such Company Trademark Beverages in the territory in any other manner or form (territorial restrictions on bottlers vary in some cases in accordance with local law); and (3) to handle certain key accounts (accounts that cover multiple territories).\nWhile under most of our bottler’s agreements we generally have complete flexibility to determine the price and other terms of sale of the concentrates and syrups we sell to our bottlers, as a practical matter, our Company’s ability to exercise its contractual flexibility to determine the price and other terms of sale of concentrates and syrups is subject, both outside and within the United States, to competitive market conditions. However, in an effort to allow our Company and our bottling partners to grow together through shared value, aligned financial objectives and the flexibility necessary to meet consumers’ always changing needs and tastes, we have implemented an incidence-based concentrate pricing model in most markets. Under this model, the concentrate price we charge is impacted by a number of factors, including, but not limited to, bottler pricing, the channels in which the finished products produced from the concentrates are sold, and package mix.\nAs further discussed below, our bottler’s agreements for territories outside the United States differ in some respects from our bottler’s agreements for territories within the United States.\nBottler’s Agreements Outside the United States\nBottler’s agreements between us and our authorized bottlers outside the United States generally are of stated duration, subject in some cases to possible extensions or renewals. Generally, these bottler’s agreements are subject to termination by the Company following the occurrence of certain designated events, including defined events of default and certain changes in ownership or control of the bottlers. Most of the bottler’s agreements in force between us and bottlers outside the United States authorize the bottlers to manufacture and distribute fountain syrups, usually on a nonexclusive basis.\nIn certain parts of the world outside the United States, we have not granted comprehensive beverage production and distribution rights to the bottlers. In such instances, we have authorized certain bottlers to (1) prepare and package Company Trademark Beverages for sale to other bottlers or (2) purchase Company Trademark Beverages from other bottlers for sale and distribution throughout their respective designated territories, often on a nonexclusive basis.\nBottler’s Agreements Within the United States\nIn the United States, most bottlers operate under a contract to which we generally refer as a “Comprehensive Beverage Agreement” (“CBA”) that is of stated duration, subject in most cases to renewal rights of bottlers and in some cases to renewal rights of the Company. A small number of bottlers continue to operate under legacy bottler’s agreements with no stated expiration date for Trademark Coca-Cola Beverages and other cola-flavored Company Trademark Beverages. In all instances, the bottler’s agreements in the United States are subject to termination by the Company for nonperformance or upon the occurrence of certain defined events of default that may vary from contract to contract.\nCertain U.S. bottlers have been granted certain additional exclusive territory rights for the distribution, promotion, marketing and sale of Company-owned and licensed beverage brands (as defined by the CBAs). We refer to these bottlers as “expanding participating bottlers” or “EPBs.” EPBs operate under CBAs (“EPB CBAs”) under which the Company generally retained the rights to produce the applicable beverage products for territories not covered by specific manufacturing agreements, and such bottlers purchase from the Company (or from Company-authorized manufacturing bottlers) substantially all of the finished beverage products needed in order to service the customers in these territories. Each EPB CBA has a term of 10 years and is renewable, in most cases by the bottler, and in some cases by the Company, indefinitely for successive additional terms of 10 years each and includes additional requirements that provide for, among other things, a binding national governance model, mandatory incidence pricing and certain core performance requirements. The Company has also entered into manufacturing agreements that authorize certain EPBs that have executed EPB CBAs to manufacture certain beverage products for their own account and for supply to other bottlers.\nIn addition, certain U.S. bottlers that were not granted additional exclusive territory rights, which we refer to as “participating bottlers,” converted their legacy bottler’s agreements to CBAs, to which we refer as “participating bottler CBAs,” each of which has a term of 10 years, is renewable by the bottler indefinitely for successive additional terms of 10 years each, and is substantially similar in most material respects to the EPB CBAs, including with respect to requirements for a binding national governance model and mandatory incidence pricing, but includes core performance requirements that vary in certain respects from those in the EPB CBAs.\nThose bottlers that have not signed CBAs continue to operate under legacy bottler’s agreements that include pricing formulas that generally provide for a baseline price for Trademark Coca-Cola Beverages and other cola-flavored Company Trademark Beverages. This baseline price may be adjusted periodically by the Company, up to a maximum indexed ceiling price, and is adjusted quarterly based upon changes in certain sugar or sweetener prices, as applicable. The U.S. unit case volume prepared, packaged, sold and distributed under these legacy bottler’s agreements is not material.\nUnder the terms of the bottler’s agreements, bottlers in the United States generally are not authorized to manufacture fountain syrups. Rather, the Company manufactures and sells fountain syrups to authorized fountain wholesalers (including certain authorized bottlers) and some fountain retailers. These wholesalers in turn sell the syrups, or deliver them on our behalf, to restaurants and other retailers.\nPromotional and Marketing Programs\nIn addition to conducting our own independent advertising and marketing activities, we may provide promotional and marketing support and/or funds to our bottlers. In most cases, we do this on a discretionary basis under the terms of commitment letters or agreements, even though we are not obligated to do so under the terms of the bottler’s agreements between our Company and the bottlers. Also, on a discretionary basis in most cases, our Company may develop and introduce new products, packages and equipment to assist the bottlers. Likewise, in many instances, we provide promotional and marketing support and/or funds and/or dispensing equipment and repair services to fountain and bottle/can retailers, typically pursuant to marketing agreements.\nInvestments in Bottling Operations\nMost of our branded beverage products are prepared, packaged, distributed and sold by independent bottling partners. However, from time to time we acquire or take control of a bottling operation, often in underperforming markets where we believe we can use our resources and expertise to improve performance. Owning a bottling operation enables us to compensate for limited local resources; help focus the bottler’s sales and marketing programs; assist in the development of the bottler’s business and information systems; and establish an appropriate capital structure for the bottler. In line with our long-term bottling strategy, we may periodically consider options for divesting or reducing our ownership interest in a consolidated bottling operation, typically by selling all or a portion of our interest in the bottling operation to an independent bottler to improve Coca-Cola system efficiency. When we sell a consolidated bottling operation to an independent bottling partner in which we have an equity method investment, our Company continues to participate in the bottler’s results of operations through our share of the equity method investee’s earnings or losses.\nIn addition, from time to time we make equity investments representing noncontrolling interests in certain bottling operations with the intention of maximizing the strength and efficiency of the Coca-Cola system’s production, marketing, sales and distribution capabilities around the world by providing expertise and resources to strengthen those businesses. These investments are intended to result in increases in unit case volume, net operating revenues and profits at the bottler level, which in turn generate increased sales for our Company’s concentrate operations. When our equity investment provides us with the ability to exercise significant influence over t",
  "item7_clean": "The Company recognizes interest and penalties related to unrecognized tax benefits in the line item income taxes in our consolidated statement of income. The Company had $631 million and $544 million in interest and penalties related to unrecognized tax benefits accrued as of December 31, 2024 and 2023, respectively. Of these amounts, expense of $87 million and $48 million was recognized in 2024 and 2023, respectively. If the Company were to prevail on all uncertain tax positions, the reversal of this accrual would be a benefit to the Company’s effective tax rate.\nBased on current tax laws, including the impact of several countries enacting global minimum tax regulations, the Company’s effective tax rate in 2025 is expected to be approximately 20.8% before considering the potential impact of any significant operating and nonoperating items that may affect our effective tax rate. This rate does not include the impact of the ongoing tax litigation with the IRS, if the Company were not to prevail.\nMany jurisdictions have enacted legislation and adopted policies resulting from the OECD’s Anti-Base Erosion and Profit Shifting project. The OECD is currently coordinating a two-pillared project on behalf of the G20 and other participating countries which would grant additional taxing rights over profits earned by multinational enterprises to the countries in which their products are sold and services rendered. Pillar One would allow countries to reallocate a portion of profits earned by multinational businesses with an annual global revenue exceeding €20 billion and a profit margin of over 10% to applicable market jurisdictions. While the OECD issued draft language for the international implementation of Pillar One in October 2023, both the substantive rules and implementation process remain under discussion at the OECD so the timetable for any implementation remains uncertain.\nIn December 2021, the OECD issued Pillar Two model rules which would establish a global per-country minimum tax of 15%, and the European Union has approved a directive requiring member states to incorporate similar provisions into their respective domestic laws. The directive requires, with certain limited exceptions, the rules to initially become effective for fiscal years starting on or after December 31, 2023. Numerous countries have enacted legislation that implemented certain aspects of Pillar Two effective January 1, 2024, while many others have indicated their intent to adopt, or have adopted, legislation effective in 2025. The OECD and implementing countries are expected to continue to make further revisions to their legislation and release additional guidance. The Company will continue to monitor developments to determine any potential impact in the countries in which we operate.\nLIQUIDITY, CAPITAL RESOURCES AND FINANCIAL POSITION\nWe believe our ability to generate cash flows from operating activities is one of the fundamental strengths of our business. Refer to the heading “Cash Flows from Operating Activities” below. The Company does not typically raise capital through the issuance of stock. Instead, we use debt financing to lower our overall cost of capital and increase our return on shareowners’ equity. Refer to the heading “Cash Flows from Financing Activities” below. We have a history of borrowing funds both domestically and internationally at reasonable interest rates, and we expect to be able to continue to borrow funds at reasonable rates over the long term. Our debt financing also includes the use of a commercial paper program. We currently have the ability to borrow funds in this market at levels that are consistent with our debt financing strategy, and we expect to continue to be able to do so in the future. The Company regularly reviews its optimal mix of short-term and long-term debt.\nThe Company’s cash, cash equivalents, short-term investments and marketable securities totaled $14.6 billion as of December 31, 2024. In addition to these funds, our commercial paper program and our ability to issue long-term debt, we had $4.6 billion in unused backup lines of credit for general corporate purposes as of December 31, 2024. These backup lines of credit expire at various times through 2029.\nOur current payment terms with the majority of our suppliers are 120 days. Certain financial institutions offer a voluntary supply chain finance program which enables our suppliers, at their sole discretion, to sell their receivables from the Company to these financial institutions on a non-recourse basis at a rate that leverages our credit rating and thus may be more beneficial to them. We do not believe there is a risk that our payment terms will be shortened in the near future. Refer to Note 9 of Notes to Consolidated Financial Statements for additional information.\nThe Company has a trade accounts receivable factoring program in certain countries. Under this program, we can elect to sell trade accounts receivables to unaffiliated financial institutions at a discount. In these factoring arrangements, for ease of administration, the Company collects customer payments related to the factored receivables and remits those payments to the financial institutions. The Company sold $21,873 million and $17,704 million of trade accounts receivables under this program during the years ended December 31, 2024 and 2023, respectively. The costs of factoring such receivables were $114 million and $83 million for the years ended December 31, 2024 and 2023, respectively. The cash received from the financial institutions is classified within the operating activities section in our consolidated statement of cash flows.\nOur current capital allocation priorities are as follows: investing wisely to support our business operations, continuing to grow our dividend payment, enhancing our beverage portfolio and capabilities through consumer-centric acquisitions, and using excess cash to repurchase shares over time. We currently expect 2025 capital expenditures to be approximately $2.2 billion. During 2025, we also expect to repurchase shares to offset dilution resulting from employee stock-based compensation plans.\nWe are currently in litigation with the IRS for tax years 2007 through 2009. On November 18, 2020, the Tax Court issued the Opinion in which it predominantly sided with the IRS. On November 8, 2023, the Tax Court issued a supplemental opinion, siding with the IRS in concluding both that certain U.S. tax regulations (known as the blocked-income regulations) that address the effect of certain Brazilian legal restrictions on royalty payments by the Company’s licensee in Brazil apply to the Company’s operations and that the Tax Court opinion in\n3M Co. & Subs. v. Commissioner\n(February 9, 2023) controlled as to the validity of those regulations. On August 2, 2024, the Tax Court entered a decision reflecting additional federal income tax of $2.7 billion for the 2007 through 2009 tax years. With applicable interest, the total liability for the 2007 through 2009 tax years resulting from the Tax Court’s decision is $6.0 billion, for which the IRS issued the Company invoices on September 3, 2024. The Company paid the IRS Tax Litigation Deposit on September 10, 2024, which stopped interest from accruing on the additional tax due for the 2007 through 2009 tax years. That amount, plus interest earned, would be refunded in full or in part if the Company’s tax positions are ultimately sustained on appeal. For the year ended December 31, 2024, the Company recorded net interest income of $77 million related to this tax payment in the line item income taxes in our consolidated statement of income, in accordance with our accounting policy. The payment of the IRS invoices and the related accrued interest were recorded in the line item other noncurrent assets in our consolidated balance sheet as of December 31, 2024. On October 22, 2024, the Company appealed the Tax Court’s decision to the U.S. Court of Appeals for the Eleventh Circuit. The Company strongly disagrees with the IRS’ positions and the portions of the Opinions affirming such positions and intends to vigorously defend our positions utilizing every available avenue of appeal. While the Company believes that it is more likely than not that we will ultimately prevail in this litigation upon appeal, it is possible that all, or some portion of, the adjustments proposed by the IRS and sustained by the Tax Court could ultimately be upheld. In that event, the Company would not receive a refund of the applicable portion or all of the $6.0 billion it paid in response to the IRS invoices issued in September 2024 and the related accrued interest receivable of $103 million as of December 31, 2024. Additionally, the Company would likely be subject to significant additional liabilities for subsequent years, which could have a material adverse impact on the Company’s financial position, results of operations and cash flows. The Company estimates that the potential aggregate remaining incremental tax and interest liability for the tax years 2010 through 2024 could be approximately $12 billion as of December 31, 2024. Additional income tax and interest on any unpaid potential liabilities for the 2010 through 2024 tax years would continue to\naccrue until the time any such potential liability, or portion thereof, were to be paid. Refer to Note 12 of Notes to Consolidated Financial Statements for additional information on the tax litigation.\nWhile we believe it is more likely than not that we will prevail in the tax litigation discussed above, we are confident that, between our ability to generate cash flows from operating activities and our ability to borrow funds at reasonable interest rates, we can manage the range of possible outcomes in the final resolution of the matter.\nBased on all of the aforementioned factors, the Company believes its current liquidity position is strong and will continue to be sufficient to fund our operating activities and cash commitments for investing and financing activities for the foreseeable future.\nCash Flows from Operating Activities\nNet cash provided by operating activities for the years ended December 31, 2024 and 2023 was $6,805 million and $11,599 million, respectively, a decrease of $4,794 million, or 41%. This decrease was primarily driven by the $6.0 billion IRS Tax Litigation Deposit, an unfavorable impact due to foreign currency exchange rate fluctuations, higher other tax payments, increased charitable donations, and the reduced operating cash flows resulting from the refranchising of our bottling operations. The decrease was also impacted by additional annual incentive payments in the current year due to improved business performance in the prior year. These items were partially offset by strong cash operating results, the transfer of surplus international plan assets from pension trusts to general assets of the Company, payments in the prior year resulting from the buildup of inventory to manage potential supply chain disruptions, increased dividend payments from our equity method investees, and $167 million of the $275 million milestone payment for fairlife in the prior year. Refer to Note 2 of Notes to Consolidated Financial Statements for additional information on the refranchising of our bottling operations. Refer to Note 12 of Notes to Consolidated Financial Statements for additional information on the tax litigation. Refer to Note 14 of Notes to Consolidated Financial Statements for additional information on the pension transfer. Refer to Note 17 of Notes to Consolidated Financial Statements for additional information on the milestone payment for fairlife.\nCash Flows from Investing Activities\nNet cash provided by investing activities was $2,524 million in 2024 and net cash used in investing activities was $3,349 million in 2023.\nPurchases of Investments and Proceeds from Disposals of Investments\nIn 2024, purchases of investments were $5,640 million and proceeds from disposals of investments were $6,589 million, resulting in a net cash inflow of $949 million. In 2023, purchases of investments were $6,698 million and proceeds from disposals of investments were $4,354 million, resulting in a net cash outflow of $2,344 million. This activity primarily represents the purchases of, and proceeds from the disposals of, investments in marketable securities and short-term investments that were made as part of the Company’s overall cash management strategy. Also included in this activity are purchases of, and proceeds from the disposals of, investments held by our captive insurance companies.\nAcquisitions of Businesses, Equity Method Investments and Nonmarketable Securities\nIn 2024 and 2023, the Company’s acquisitions of businesses, equity method investments and nonmarketable securities totaled $315 million and $62 million, respectively.\nProceeds from Disposals of Businesses, Equity Method Investments and Nonmarketable Securities\nIn 2024 and 2023, proceeds from disposals of businesses, equity method investments and nonmarketable securities totaled $3,485 million and $430 million, respectively. The activity during 2024 primarily related to the refranchising of certain of our bottling operations and sales of our ownership interests in certain equity method investees. The activity during 2023 primarily related to sales of our ownership interests in certain equity method investees. Refer to Note 2 of Notes to Consolidated Financial Statements for additional information.\nPurchases of Property, Plant and Equipment\nPurchases of property, plant and equipment during the years ended December 31, 2024 and 2023 were $2,064 million and $1,852 million, respectively.\nTotal capital expenditures for property, plant and equipment and the percentage of such totals by operating segment and Corporate were as follows (in millions):\nYear Ended December 31,\nCapital expenditures\n\nWe operate in the highly competitive commercial beverage industry. We face strong competition from numerous other general and specialty beverage companies. We, along with other beverage companies, are affected by a number of factors, including, but not limited to, the cost to manufacture and distribute products, consumer spending, economic conditions, availability and quality of water, consumer preferences, inflation, geopolitical conditions (including international conflicts), local and national laws and regulations, foreign currency exchange rate fluctuations, fuel prices, weather patterns and health crises.\nDespite the dynamic world in which we are currently operating, we believe we are well positioned to create value for our Company and our stakeholders. In an effort to support our future growth, we are continuing to invest in our portfolio of brands, our strategic capabilities and our people. We are focused on the following strategic priorities: shaping a portfolio of loved brands; transforming our marketing and innovation agenda; optimizing the Coca-Cola ecosystem; building talent and capabilities; and enhancing our license to operate.\nChallenges and Risks\nBeing a global enterprise provides unique opportunities for our Company. Challenges and risks accompany those opportunities. Our management has identified certain challenges and risks that demand the attention of our Company and the commercial beverage industry. Of these, six key strategic business challenges and risks are discussed below.\nObesity continues to impact individuals, communities and countries worldwide. There is concern among consumers, public health professionals and governments about the health problems associated with obesity, which may present a challenge to our industry. We understand that obesity is a complex public health challenge, and we are committed to being a part of the solution.\nWe recognize the uniqueness of consumers’ lifestyles and dietary choices. Therefore, we continue to do the following:\noffer an expanded portfolio of beverage c",
  "item2_clean": null
}