{
  "source_file": "ko-20250926.htm",
  "form_type": "10-Q",
  "item1_clean": null,
  "item7_clean": null,
  "item2_clean": "Calculation is not meaningful.\nThree Months Ended September 26, 2025 versus Three Months Ended September 27, 2024\nDuring the three months ended September 26, 2025, operating income was $3,982 million, compared to $2,510 million during the three months ended September 27, 2024, an increase of $1,472 million, or 59%. The increase was driven by lower other operating charges and favorable pricing initiatives, partially offset by higher commodity costs and an unfavorable foreign currency exchange rate impact of 4%.\nFluctuations in foreign currency exchange rates, including the effects of our hedging activities, unfavorably impacted consolidated operating income by 4% due to a stronger U.S. dollar compared to certain foreign currencies, including the Argentine peso and Turkish lira, which had an unfavorable impact on our Latin America and Europe, Middle East and Africa operating segments. The unfavorable impact of a stronger U.S. dollar compared to the currencies listed above was partially offset by the impact of a weaker U.S. dollar compared to certain other foreign currencies, including the euro, which had a favorable impact on our Europe, Middle East and Africa operating segment. Refer to the heading “Liquidity, Capital Resources and Financial Position — Foreign Exchange” below.\nThe Europe, Middle East and Africa operating segment reported operating income of $1,097 million and $998 million for the three months ended September 26, 2025 and September 27, 2024, respectively. The increase in operating income was primarily driven by an increase in concentrate sales volume of 3% and favorable pricing initiatives, partially offset by increased marketing spending due to timing and an unfavorable foreign currency exchange rate impact of 2%.\nLatin America reported operating income of $897 million and $937 million for the three months ended September 26, 2025 and September 27, 2024, respectively. The decrease in operating income was primarily driven by a decrease in concentrate sales volume of 3%, higher commodity costs, increased marketing spending due to timing, and an unfavorable foreign currency exchange rate impact of 16%, partially offset by favorable pricing initiatives and lower other operating charges.\nOperating income for North America for the three months ended September 26, 2025 and September 27, 2024 was $1,681 million and $1,456 million, respectively. The increase in operating income was primarily driven by favorable pricing initiatives, partially offset by a decrease in concentrate sales volume of 2% and higher commodity costs.\nAsia Pacific’s operating income for the three months ended September 26, 2025 and September 27, 2024 was $521 million and $462 million, respectively. The increase in operating income was primarily driven by favorable pricing initiatives and mix as well as a favorable foreign currency exchange rate impact of 11%, partially offset by a decrease in concentrate sales volume of 1%, higher commodity costs and increased marketing spending due to timing.\nBottling Investments’ operating income for the three months ended September 26, 2025 and September 27, 2024 was $57 million and $43 million, respectively. The increase in operating income was primarily driven by an increase in unit case volume of 5%, favorable pricing initiatives and a favorable foreign currency exchange rate impact of 12%, partially offset by the impact of refranchising our bottling operations in certain territories in India and higher commodity costs.\nCorporate’s operating loss for the three months ended September 26, 2025 and September 27, 2024 was $271 million and $1,386 million, respectively. Operating loss in 2025 decreased primarily as a result of lower other operating charges, primarily due to the prior year remeasurement of our contingent consideration liability to fair value in conjunction with the fairlife acquisition, as well as marketing efficiencies and lower operating expenses. Refer to Note 16 of Notes to Consolidated Financial Statements for additional information on the fairlife acquisition.\nNine Months Ended September 26, 2025 versus Nine Months Ended September 27, 2024\nDuring the nine months ended September 26, 2025, operating income was $11,921 million, compared to $7,283 million during the nine months ended September 27, 2024, an increase of $4,638 million, or 64%. The increase was driven by lower other operating charges and favorable pricing initiatives, partially offset by higher commodity costs and an unfavorable foreign currency exchange rate impact of 12%.\nFluctuations in foreign currency exchange rates, including the effects of our hedging activities, unfavorably impacted consolidated operating income by 12% due to a stronger U.S. dollar compared to certain foreign currencies, including the Mexican peso, Brazilian real, Argentine peso, Zimbabwe gold and Turkish lira, which had an unfavorable impact on our Latin America and Europe, Middle East and Africa operating segments. The unfavorable impact of a stronger U.S. dollar compared to the currencies listed above was partially offset by the impact of a weaker U.S. dollar compared to certain other foreign currencies, including the euro, British pound and Japanese yen, which had a favorable impact on our Europe, Middle East and Africa and Asia Pacific operating segments. Refer to the heading “Liquidity, Capital Resources and Financial Position — Foreign Exchange” below.\nThe Europe, Middle East and Africa operating segment reported operating income of $3,487 million and $3,360 million for the nine months ended September 26, 2025 and September 27, 2024, respectively. The increase in operating income was primarily driven by an increase in concentrate sales volume of 2% and favorable pricing initiatives, partially offset by higher commodity costs, increased marketing spending and an unfavorable foreign currency exchange rate impact of 5%.\nLatin America reported operating income of $2,758 million and $2,803 million for the nine months ended September 26, 2025 and September 27, 2024, respectively. The decrease in operating income was primarily driven by a decrease in concentrate sales volume of 2% and an unfavorable foreign currency exchange rate impact of 23%, partially offset by favorable pricing initiatives, lower commodity costs, lower marketing spending due to timing and lower other operating charges.\nOperating income for North America for the nine months ended September 26, 2025 and September 27, 2024 was $4,643 million and $3,329 million, respectively. The increase in operating income was primarily driven by favorable pricing initiatives and lower other operating charges due to the impairment of our BodyArmor trademark in the prior year, partially offset by a decrease in concentrate sales volume of 2%, higher commodity costs and increased marketing spending. Refer to Note 16 of Notes to Consolidated Financial Statements for additional information on the impairment of our BodyArmor trademark.\nAsia Pacific’s operating income for the nine months ended September 26, 2025 and September 27, 2024 was $1,792 million and $1,765 million, respectively. The increase in operating income was primarily driven by favorable pricing initiatives, partially offset by the impact of structural changes, higher commodity costs, increased marketing spending and an unfavorable foreign currency exchange rate impact of 4%.\nBottling Investments’ operating income for the nine months ended September 26, 2025 and September 27, 2024 was $235 million and $297 million, respectively. The decrease in operating income was primarily driven by the impact of refranchising our bottling operations in the Philippines, Bangladesh and certain territories in India, higher commodity costs, higher operating expenses and an unfavorable foreign currency exchange rate impact of 2%, partially offset by favorable pricing initiatives.\nCorporate’s operating loss for the nine months ended September 26, 2025 and September 27, 2024 was $994 million and $4,271 million, respectively. Operating loss in 2025 decreased primarily as a result of lower other operating charges, primarily due to the prior year remeasurement of our contingent consideration liability to fair value in conjunction with the fairlife acquisition as well as marketing efficiencies. Refer to Note 16 of Notes to Consolidated Financial Statements for additional information on the fairlife acquisition.\nBased on current spot rates and our hedging coverage in place, we expect foreign currency exchange rate fluctuations will have an unfavorable impact on our full year 2025 operating income.\nDuring the three months ended September 26, 2025, interest income was $185 million, compared to $263 million during the three months ended September 27, 2024, a decrease of $78 million, or 30%. During the nine months ended September 26, 2025, interest income was $553 million, compared to $784 million during the nine months ended September 27, 2024, a decrease of $231 million, or 30%. The decreases were primarily driven by lower average investment balances on our Corporate and certain international investments.\nDuring the three months ended September 26, 2025, interest expense was $391 million, compared to $425 million during the three months ended September 27, 2024, a decrease of $34 million, or 8%. During the nine months ended September 26, 2025,\ninterest expense was $1,223 million, compared to $1,225 million during the nine months ended September 27, 2024, a decrease of $2 million. The decreases were primarily due to the impact of lower rates on derivative instruments compared to the prior year, partially offset by higher debt balances.\nEquity Income (Loss) — Net\nThree Months Ended September 26, 2025 versus Three Months Ended September 27, 2024\nDuring the three months ended September 26, 2025, equity income was $644 million, compared to equity income of $541 million during the three months ended September 27, 2024, an increase of $103 million, or 19%. This incr"
}