{
  "source_file": "kr-20250201x10k.htm",
  "form_type": "10-K",
  "item1_clean": "ITEM 1.\nBUSINESS.\nThe Kroger Co. (the “Company” or “Kroger”) was founded in 1883 and incorporated in 1902. Our Company is built on the foundation of our retail grocery business, which includes the added convenience of our retail pharmacies and fuel centers. Our strategy is focused on growing households and increasing customer loyalty by delivering great value and convenience, and investing in four strategic pillars: Fresh,\n, Data & Personalization and Seamless.\nWe utilize the data and traffic generated by our retail business to create personalized experiences and value for our customers. This data and traffic also enables our fast-growing, high operating margin alternative profit business, including data and analytic services and third-party media revenue. In turn, the value generated from these businesses enables us to reinvest back into our retail business.\nOur revenues are predominately earned and cash is generated as consumer products are sold to customers in our stores, fuel centers and via our online platforms. We earn income predominately by selling products at price levels that produce revenues in excess of the costs we incur to make these products available to our customers. Such costs include procurement and distribution costs, facility occupancy and operational costs, and overhead expenses. Our fiscal year ends on the Saturday closest to January 31. All references to 2024, 2023 and 2022 are to the fiscal years ended February 1, 2025, February 3, 2024 and January 28, 2023, respectively, unless specifically indicated otherwise.\nKroger is diversified across brands, product categories, channels of distribution, geographies and consumer demographics. Our combination of assets includes the following:\nAs of February 1, 2025, Kroger operates supermarkets under a variety of local banner names in 35 states and the District of Columbia. As of February 1, 2025, Kroger operated, either directly or through its subsidiaries, 2,731 supermarkets, of which 2,273 had pharmacies and 1,702 had fuel centers. Approximately 51% of our supermarkets were operated in Company-owned facilities, including some Company-owned buildings on leased land. Our stores operate under a variety of banners that have strong local ties and brand recognition. We connect with customers through our expanding seamless ecosystem and the consistent delivery of a full, fresh, and friendly customer experience.\nFuel sales are an important part of our revenue, net earnings and loyalty offering.\nOur fuel strategy is to include a fuel center at each of our supermarket locations when it is feasible and it is expected to be profitable.\nEach fuel center typically includes five to ten islands of fuel dispensers and storage tanks with capacity for 40,000 to 50,000 gallons of fuel.\nSupermarkets are generally operated under one of the following formats: combination food and drug stores (“combo stores”); multi-department stores; marketplace stores; or price impact warehouses.\n\nThe traffic and data generated by our retail business, including pharmacies and fuel centers, enables our diverse business. Kroger serves approximately 63 million households annually and because of our rewards program, over 95% of customer transactions are tethered to a Kroger loyalty card. Our over 20 years of investment in data science capabilities allows us to utilize this data to create personalized experiences and value for our customers and enables our growing, high operating margin alternative profit businesses, including data analytic services and third-party media revenue. Our retail media business – Kroger Precision Marketing – provides differentiated media capabilities for our consumer packaged goods partners and other industry verticals. It is a key driver of our digital profitability and alternative profit.\nSEASONALITY\nThe majority of our revenues are generally not seasonal in nature. However, revenues tend to be higher during the major holidays throughout the year. Additionally, certain significant events including inclement weather systems, particularly winter storms, tend to affect our sales trends.\nHUMAN CAPITAL MANAGEMENT\nWe want Kroger to be a place where our customers love to shop and associates love to work. This is why we aim to create working environments where associates feel encouraged and supported to be their best selves every day. As of February 1, 2025, Kroger employed over 409,000 full- and part-time employees. Our people are essential to our success, and we focus intentionally on attracting, developing and engaging a diverse workforce that represents the communities we serve. We strive to create a culture of opportunity and take seriously our role as a leading employer in the United States. Kroger has provided a large number of people with first jobs, new beginnings and lifelong careers. We have long been guided by our values – Honesty, Integrity, Respect, Safety, Diversity and Inclusion.\nAttracting & Developing Our Talent\nTo deliver on our customers’ experiences and remain competitive with union and non-union employers, we continually try to improve how we attract and retain talent. In addition to competitive wages, quality benefits and a safe work environment, we offer a broad range of employment opportunities for workers of all ages and aspirations. Many retail roles offer opportunities to learn new skills, where new associates come for a job, and discover a career.\nAssociates at all levels of Kroger have access to training and education programs to build their skills and prepare for the roles they want. In 2024, we spent approximately $192 million on training our associates through onboarding, leadership development programs and programs designed to upskill associates across the Company. We continue to invest in new platforms and applications to make learning more accessible to our associates.\nBeyond our own training programs, associates can take advantage of our tuition reimbursement benefit, which offers up to $3,500 annually — $21,000 over the course of employment — toward continuing education. These funds can be applied to education programs like certifications, associate or graduate degrees. Approximately 5,500 associates, 89% of whom are hourly, have taken advantage of our tuition reimbursement program in 2024. Kroger has invested approximately $64 million in this program since it launched in 2018.\n\nThe combo store is the primary grocery store format. We believe this format is successful because the stores are large enough to offer the specialty departments, including natural food and organic sections, pharmacies, general merchandise, pet centers and high-quality perishables such as fresh seafood and organic produce.\nMulti-department stores are significantly larger in size than combo stores. In addition to the departments offered at a typical combo store, multi-department stores sell a wide selection of general merchandise items such as apparel, home fashion and furnishings, outdoor living, electronics, automotive products and toys.\nMarketplace stores are smaller in size than multi-department stores. They offer full-service grocery, pharmacy and health and beauty care departments as well as an expanded perishable offering and general merchandise area that includes apparel, home goods and toys.\nPrice impact warehouse stores offer a “no-frills, low cost” warehouse format and feature everyday low prices plus promotions for a wide selection of grocery and health and beauty care items. Quality meat, dairy, baked goods and fresh produce items provide strategic differentiation for price impact warehouse stores. The average size of a price impact warehouse store is similar to that of a combo store.\nSeamless Digital Ecosystem\nWe offer a convenient shopping experience for our customers regardless of how they choose to shop with us, including Pickup, Delivery and Ship. We offer Pickup and Harris Teeter ExpressLane™ — personalized, order online, pick up at the store services — at 2,412 of our supermarkets and provide Delivery, which allows us to offer digital solutions to substantially all of our customers. Our Delivery solutions include orders delivered to customers from retail store locations, customer fulfillment centers and orders placed through third-party platforms. These channels allow us to serve customers anything, anytime and anywhere with zero compromise on selection, convenience, and price. We also provide relevant customer-facing apps and interfaces that have the features customers want that are also reliable, easy to use and deliver a seamless customer experience across our store and digital channels.\nMerchandising and Manufacturing\nproducts play an important role in our merchandising strategy and represented over $32 billion of our sales in 2024. Our supermarkets, on average, stock over 12,000 private label items.\nproducts are primarily produced and sold in three “tiers.” Private Selection® is our main premium quality brand, offering customers culinary foods and ingredients that deliver amazing eating experiences. The Kroger® brand, which represents the majority of our private label items, is designed to consistently satisfy and delight customers with quality products that exceed or meet the national brand in taste and efficacy, as well as with unique and differentiated products. Big K®, Smart Way® and Heritage Farm® are some of our value brands, designed to deliver good quality at a very affordable price. In addition to our three “tiers,”\noffers customers a variety of natural and organic products with Simple Truth® and Simple Truth Organic®. Both Simple Truth® and Simple Truth Organic® are free from a defined list of artificial ingredients that some customers have told us they do not want in their food, and the Simple Truth Organic products are USDA certified organic.\nApproximately 31% of\nunits sold in our supermarkets are produced in our food production plants; the remaining\nitems are produced to our strict specifications by outside manufacturers. We perform a “make or buy” analysis on\nproducts and decisions are based upon a comparison of market-based transfer prices versus open market purchases. As of February 1, 2025, we owned 33 food production plants. These plants consisted of 14 dairies, nine deli or bakery plants, five grocery product plants, two beverage plants, one meat plant and two cheese plants.\n\nRewarding Our Associates\nAs we continue to operate in a challenging labor market, we are dedicated to attracting and retaining the right talent across the organization to be able to continue delivering for our customers. We are investing in our associates by expanding our industry-leading benefits, including continuing education, training and development and health and wellness. During 2024, we increased associate wages resulting in an average hourly rate of more than $19, and a rate of more than $25 with comprehensive benefits factored in, which is a 38% increase in rate in the last seven years. Over the last five years, we have now invested more than $2.7 billion in incremental wage investments. We remain committed to supporting our associates with investments in wages and comprehensive benefits that are sustainable and will allow us to continue to keep products affordable for the communities we serve. We expect to make continued associate investments in 2025.\nCreating a Safe Environment\nOur associates’ safety is a top priority. It is also one of our core values. We prioritize providing the right safety training and equipment, safe working conditions and resources to maintain and improve associates’ well-being. Through our strategy to set clear expectations, routine monitoring, and regular communication and engagement, we reduce the number of injuries and accidents that happen in our workplace. We track health and safety metrics centrally for an enterprise-wide view of issues, trends and opportunities and monitor associate injury performance including total injuries, Occupational Safety and Health A",
  "item7_clean": "We define FIFO gross margin as FIFO gross profit divided by sales. FIFO gross profit is calculated as sales less merchandise costs, including advertising, warehousing and transportation expenses, but excluding the LIFO charge, rent and depreciation and amortization.\nOur fuel sales lower our FIFO gross margin rate due to the very low FIFO gross margin rate, as a percentage of sales, of fuel sales compared to non-fuel sales. Excluding the effect of fuel and the Extra Week, our FIFO gross margin rate increased 32 basis points in 2024, compared to 2023. This increase resulted primarily from the sale of our Kroger Specialty Pharmacy business, which has a lower gross margin rate, strong\nperformance and lower shrink, partially offset by lower pharmacy margins. Excluding the effect of fuel, the Extra Week and Kroger Specialty Pharmacy, our FIFO gross margin rate increased 14 basis points in 2024, compared to 2023.\nOperating, General and Administrative Expenses\nOG&A expenses consist primarily of employee-related costs such as wages, healthcare benefit costs, retirement plan costs, utilities, and credit card fees. Rent expense, depreciation and amortization expense, and interest expense are not included in OG&A.\nOG&A expenses, as a percentage of sales, were 17.29% in 2024 and 17.50% in 2023. The decrease in 2024, compared to 2023, resulted primarily from the 2023 OG&A Adjusted Items and continued execution of broad-based cost savings initiatives that drive administrative efficiencies, including store productivity, partially offset by the effect of decreased fuel sales, which increases our OG&A rate, as a percentage of sales, the sale of our Kroger Specialty Pharmacy business, which has a lower OG&A rate to sales, increased incentive plan costs, an increase in costs due to the severity of general liability claims, planned investment in associates and the 2024 OG&A Adjusted Items.\nOur fuel sales lower our OG&A rate, as a percentage of sales, due to the very low OG&A rate, as a percentage of sales, of fuel sales compared to non-fuel sales. Excluding the effect of fuel, the Extra Week, the 2024 OG&A Adjusted Items and the 2023 OG&A Adjusted Items, our OG&A rate increased 31 basis points in 2024, compared to 2023. This increase resulted primarily from the sale of our Kroger Specialty Pharmacy business, which has a lower OG&A rate to sales, increased incentive plan costs, an increase in costs due to the severity of general liability claims and planned investments in associates, partially offset by the broad-based improvement from cost savings initiatives that drive administrative efficiencies, including store productivity. Excluding the effect of fuel, the Extra Week, Kroger Specialty Pharmacy, the 2024 OG&A Adjusted Items and the 2023 OG&A Adjusted Items, our OG&A rate increased 19 basis points in 2024, compared to 2023.\nRent expense remained relatively consistent, as a percentage of sales, for 2024 compared to 2023.\nDepreciation and Amortization Expense\nDepreciation and amortization expense increased, as a percentage of sales, in 2024, compared to 2023, primarily due to the Extra Week, additional depreciation associated with higher capital investments during 2024 and a decrease in the average useful life on these capital investments.\nOperating Profit and FIFO Operating Profit\nOperating profit was $3.8 billion, or 2.62% of sales, for 2024, compared to $3.1 billion, or 2.06% of sales, for 2023. Operating profit, as a percentage of sales, increased 56 basis points in 2024, compared to 2023, due to decreased OG&A expenses, as a percentage of sales and a higher FIFO gross margin rate, partially offset by increased depreciation and amortization expenses, as a percentage of sales, a decrease in fuel operating profit and the Extra Week.\n\nCash flows for FIFO inventory were less favorable for 2024, compared to 2023, primarily due to a decrease in FIFO inventory at the end of 2023, compared to 2022, primarily due to maintaining inventory at optimal levels through improved inventory management planning\nCash flows for accounts receivable were less favorable in 2024, compared to 2023, primarily due to an increase in pharmacy receivables at the end of 2024, compared to 2023, primarily due to timing of cash receipts and increased Health and Wellness sales;\nPartially offset by cash flows for accrued expenses were more favorable in 2024, compared to 2023, primarily due to the following:\nA decrease in accrued incentive plan costs at the end of 2023, compared to 2022;\nA decrease in our commitments due to the UFCW International Union-Industry Pension Fund (“National Fund”) at the end of 2023, compared to 2022, as a result of the final contractual payment related to the multi-employer pension plan withdrawal liability charge we incurred in 2020; and\nAn increase in accrued interest expense at the end of 2024, compared to 2023, primarily due to accrued interest expense associated with the net $5.8 billion senior notes issuance;\nPartially offset by an increase in accrued legal expenses at the end of 2023, compared to 2022, primarily due to an increase in the current portion of our accrued opioid settlement charges.\nNet cash used by investing activities\nInvesting activities used cash of $3.2 billion in 2024, compared to $3.8 billion in 2023. The amount of cash used by investing activities decreased in 2024, compared to 2023, primarily due to the net proceeds from the sale of our Kroger Specialty Pharmacy business in 2024 and an increase in proceeds from the sale of assets related to the sale of an equity investment in 2024, partially offset by increased payments for property and equipment, including payments for lease buyouts.\nNet cash used by financing activities\nWe used $490 million of cash for financing activities in 2024, compared to $2.2 billion in 2023. The amount of cash used for financing activities decreased in 2024, compared to 2023, primarily due to increased proceeds from the issuance of long-term debt, partially offset by increased payments on long-term debt including obligations under finance leases and increased payments on treasury stock purchases and unsettled accelerated share repurchases.\n\nITEM 7.\nMANAGEMENT’S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND\nRESULTS OF OPERATIONS.\nOUR VALUE CREATION MODEL – DELIVERING CONSISTENT AND ATTRACTIVE TOTAL SHAREHOLDER RETURN\nKroger’s proven value creation model is allowing us to deliver today and invest for the future. The foundation of our value creation model is our omnichannel retail business, including fuel and health and wellness. By executing on our go-to-market strategy built on the four pillars of Fresh,\n, Personalization and Seamless, we are creating a shopping experience that builds loyalty and grows sales. Our retail business generates traffic and data which accelerates growth in our high operating margin alternative profit businesses, like Kroger Precision Marketing. In turn, the value generated from these businesses enables us to reinvest back into our retail business.\nWe are focused on enhancing our pillars and delivering an exceptional customer experience to accelerate this flywheel effect. By expanding our store network and improving our digital capabilities, we expect to grow households and increase sales. Our model provides more ways than ever to generate net earnings growth.\nThis will be achieved by:\nGrowing identical sales without fuel. Our plan involves maximizing growth opportunities in our retail business and is supported by continued strategic investments in our associates, greater value for our customers and our seamless ecosystem to ensure we deliver a full, fresh and friendly experience for every customer, every time. In an effort to serve more households, we will invest in major storing projects that allow us to increase both in-store and online sales. As more and more customers incorporate ecommerce into their permanent routines, we expect digital sales to grow at a double-digit rate – a faster pace than other food at home sales – over time; and\nExpanding operating margin through long-term initiatives in gross margin, growing alternative profit businesses, and productivity and cost savings initiatives that are focused on simplifying processes and utilizing technology to enhance the associate experience without affecting the customer experience. Together, these will enable us to improve operating margin, while balancing strategic price investments for customers and wage and benefit investments for associates.\nWe expect to continue to generate strong free cash flow and are committed to being disciplined with capital deployment in support of our value creation model and stated capital allocation priorities. Our first priority is to invest in the business through attractive high return opportunities that drive long-term sustainable net earnings growth. We are committed to maintaining our current investment grade debt rating and our net total debt to adjusted EBITDA ratio target range of 2.30 to 2.50. We also expect to continue to grow our dividend over time and return excess cash to shareholders via stock repurchases, subject to Board approval. During the fourth quarter of 2024, following the termination of the merger with Albertsons, as discussed in Note 18 to the Consolidated Financial Statements, we resumed our share repurchase program after a more than two-year pause to return excess capital to our shareholders.\nWe expect our value creation model will result in total shareholder return within our target range of 8% to 11% over time.\n\nThe accompanying Consolidated Financial Statements, including the related notes, are presented in accordance with generally accepted accounting principles (“GAAP”). We provide non-GAAP measures, including First-In, First-Out (“FIFO”) gross margin, FIFO operating profit, adjusted FIFO operating profit, adjusted net earnings and adjusted net earnings per diluted share because management believes these metrics are useful to investors and analysts. These non-GAAP financial measures should not be considered as an alternative to gross margin, operating profit, net earnings and net earnings per diluted share or any other GAAP measure of performance. These measures should not be reviewed in isolation or considered as a substitute for our financial results as reported in accordance with GAAP.\nWe calculate FIFO gross margin as FIFO gross profit divided by sales. FIFO gross profit is calculated as sales less merchandise costs, including advertising, warehousing and transportation expenses, but excluding the Last-In, First-Out (“LIFO”) charge, rent and depreciation and amortization. FIFO gross margin is an important measure used by management, and management believes FIFO gross margin is a useful metric to investors and analysts because it measures the merchandising and operational effectiveness of our go-to-market strategy.\nWe calculate FIFO operating profit as operating profit excluding the LIFO charge. FIFO operating profit is an important measure used by management, and management believes FIFO operating profit is a useful metric to investors and analysts because it measures the operational effectiveness of our financial model\nThe adjusted net earnings, adjusted net earnings per diluted share and adjusted FIFO operating profit metrics are important measures used by management to compare the performance of core operating results between periods. We believe adjusted net earnings, adjusted net earnings per diluted share and adjusted FIFO operating profit are useful metrics to investors and analysts because they present more accurate year-over-year comparisons of our net earnings, net earnings per diluted share and FIFO operating profit because adjusted items are not the result of our normal operations. Net earnings for 2024 include the following, which we define as the “2024 Adjusted Items:”\nCharges to operating, general and administrative expenses (“OG&A”) of $32 million, $24 million net of tax, for severance charge and related benefits, $30 million, $23 million net of tax, for impairment of intangible assets, $25 million, $19 million net of tax, for property losses, $684 million, $489 million net of tax, for merger-related costs, net of a credit to OG&A of $27 million, $21 million net of tax, for opioid settlement charges (the “2024 OG&A Adjusted Items”).\nA loss in other income (expense) of $148 million, $112 million net of tax, for the unrealized loss on investments, a charge to other income (expense) of $34 million, $26 million net of tax, for merger-related net interest expense and a gain in other income (expense) of $79 million, $60 million net of tax, on the sale of Kroger Specialty Pharmacy (the “2024 Other Income (Expense) Adjusted Items”).\nA reduction to income tax expense of $31 million from recognizing deferred tax assets related to the sale of our Kroger Specialty Pharmacy business (the “2024 Income Tax Expense Adjusted Item”).\n\nNet Earnings and Net Earnings Per Diluted Share\nOur net earnings are based on the factors discussed in the Results of Operations section.\nNet earnings of $3.67 per diluted share for 2024 represented an increase of 24.0% compared to net earnings of $2.96 per diluted share for 2023. Excluding the 2024 and 2023 Adjusted Items and the Extra Week, adjusted net earnings of $4.47 per diluted share for 2024 represented a decrease of 2.0% compared to adjusted net earnings of $4.56 per diluted share for 2023. The decrease in adjusted net earnings per diluted share resulted primarily from decreased adjusted FIFO operating profit, excluding fuel, and decreased fuel earnings, partially offset by a decreased LIFO charge and lower net interest expense.\nRETURN ON INVESTED CAPITAL\nWe calculate return on invested capital (“ROIC”) by dividing adjusted ROIC operating profit for the prior four quarters by the average invested capital. Adjusted operating profit for ROIC purposes is calculated by excluding certain items included in operating profit, and adding back our LIFO charge, depreciation and amortization and rent to our U.S. GAAP operating profit of the prior four quarters. Average invested capital is calculated as the sum of (i) the average of our total assets, (ii) the average LIFO reserve and (iii) the average accumulated depreciation and amortization; minus (i) the average taxes receivable, (ii) the average accounts payable, (iii) the average accrued salaries and wages and (iv) the average other current liabilities, excluding accrued income taxes. Averages are calculated for ROIC by adding the beginning balance of the first quarter and the ending balance of the fourth quarter, of the last four quarters, and dividing by two. ROIC is a non-GAAP financial measure of performance. ROIC should not be reviewed in isolation or considered as a substitute for our financial results as reported in accordance with GAAP. ROIC is an important measure used by management to evaluate our investment returns on capital. Management believes ROIC is a useful metric to investors and analysts because it measures how effectively we are deploying our assets.\nAlthough ROIC is a relatively standard financial term, numerous methods exist for calculating a company’s ROIC. As a result, the method used by our management to calculate ROIC may differ from methods other companies use to calculate their ROIC. We urge you to understand the methods used by other companies to calculate their ROIC before comparing our ROIC to that of such other companies.\n\nIdentical sales, excluding fuel, for 2024 were calculated on a 52-week basis by excluding week 1 of fiscal 2023 in our 2023 identical sales base.\nIdentical sales, excluding fuel, for 2023 were calculated on a 53-week basis by including week 1 of fiscal year 2023 in our 2022 identical sales base.\nGross Margin, LIFO and FIFO Gross Margin\nOur gross margin rates, as a percentage of sales, were 22.26% in 2024 and 21.83% in 2023. This increase resulted primarily from the sale of our Krog",
  "item2_clean": null
}