{
  "source_file": "kvue-20250928.htm",
  "form_type": "10-Q",
  "item1_clean": null,
  "item7_clean": null,
  "item2_clean": "September 28, 2025, which have been prepared in accordance with accounting principles generally accepted in the United States of America (“U.S. GAAP”) and the rules and regulations of the SEC for interim financial statements, and our audited consolidated financial statements for the fiscal twelve months ended December 29, 2024, which are included in the Annual Report. In our opinion, the Condensed Consolidated Financial Statements reflect all adjustments, consisting of normal and recurring adjustments, necessary for a fair statement of the financial condition, results of operations, and cash flows for the periods indicated. All currency amounts are expressed in U.S. dollars unless otherwise noted.\nAt Kenvue, our purpose is to realize the extraordinary power of everyday care. As a global leader at the intersection of healthcare and consumer goods, we are the world’s largest pure-play consumer health company by revenue with $15.5 billion in Net sales in the fiscal year 2024. By combining the power of science with meaningful consumer insights and our digital strategy, we empower consumers to live healthier lives every day. Built on more than a century of heritage and trusted by generations, our differentiated portfolio of iconic brands—including Aveeno\n, BAND-AID\n—is backed by science and recommended by healthcare professionals, which further reinforces our consumers’ connections to our brands.\nOur portfolio includes Self Care, Skin Health and Beauty, and Essential Health products, allowing us to connect with consumers globally—in their daily rituals and the moments that matter most.\nOur global scale and the breadth of our brand portfolio are complemented by our well-developed capabilities and accelerated through our digital strategy, allowing us to dynamically capitalize on and respond to current trends impacting our categories and geographic markets.\nWith a sole focus on consumer health, our marketing organization operates efficiently by leveraging our precision marketing, e-commerce, and broader digital capabilities to develop unique consumer insights and further enhance the relevance of our brands. Similarly, our research and development organization combines these consumer insights with deep, multi-disciplinary scientific expertise, and engagement with healthcare professionals, to drive innovative new products, solutions, and experiences centered around consumer health.\nOur Business Segments\nWe operate our business through the following three reportable business segments:\nOur Self Care product categories include: Cough, Cold, and Allergy; Pain Care; and Other Self Care (Digestive Health, Smoking Cessation, Eye Care, and Other). Major brands in the segment include Tylenol\n, ORSL\nSkin Health and Beauty.\nOur Skin Health and Beauty product categories include: Face and Body Care; and Hair, Sun, and Other. Major brands in the segment include Neutrogena\n, OGX\n, Le Petit Marseillais\nOur Essential Health product categories include: Oral Care; Baby Care; and Other Essential Health (Women’s Health, Wound Care, and Other). Major brands in the segment include Listerine\n, BAND-AID\nFor additional information about our three reportable business segments, see Note 14, “Segments of Business,” to the Condensed Consolidated Financial Statements included herein.\nIn November 2021, J&J, our former parent company, announced its intention to separate its Consumer Health segment (the “Consumer Health Business”) into an independent publicly traded company (the “Separation”). Kenvue was incorporated in Delaware in February 2022, as a wholly owned subsidiary of J&J, to serve as the ultimate parent company of J&J’s Consumer Health Business. In April 2023, J&J completed the transfer of substantially all of the assets and liabilities of the Consumer Health Business to us and our subsidiaries. In May 2023, we completed an initial public offering (the “Kenvue IPO”) and began trading on the New York Stock Exchange under the ticker symbol “KVUE.” In July 2023, J&J announced an exchange offer (the “Exchange Offer”) under which its shareholders could exchange shares of J&J common stock for shares of our common stock owned by J&J. In August 2023, J&J completed the Exchange Offer, completing the Separation from J&J and transition to being a fully independent public company. In May 2024, J&J completed an additional exchange offer (the “Debt-for-Equity Exchange”) through which J&J exchanged indebtedness of J&J for shares of our common stock owned by J&J. Following the completion of the Debt-for-Equity Exchange, J&J did not own any shares of our common stock.\nWe are incurring certain non-recurring separation-related costs in connection with our establishment as a standalone public company (the “Separation-related costs”). Separation-related costs associated with information technology and other activities, primarily related to the disentanglement of systems and the discontinuance of certain information technology assets, are substantially completed. However, costs related to legal entity name changes and certain other separation-related activities are expected to continue for a longer period than originally anticipated. For additional information about the Separation, see Note 1, “Description of the Company and Summary of Significant Accounting Policies,” and Note 8, “Relationship with J&J,” to the Condensed Consolidated Financial Statements included herein.\nRelationship with J&J\nWe entered into the Separation Agreement and various other agreements with J&J for the purpose of effecting the Separation. These agreements provide a framework for our relationship with J&J and govern various interim and ongoing relationships between us and J&J that follow the completion of the Kenvue IPO. See Note 8, “Relationship with J&J,” to the Condensed Consolidated Financial Statements included herein for additional information on these agreements.\nKenvue Global and North America Headquarters\nOn April 20, 2023, we entered into a long-term lease for a newly renovated global and North America corporate headquarters building and a newly constructed research and development building in Summit, New Jersey (the “Global and North America Headquarters Lease”). In March 2025, we began operating out of the new global and North America corporate headquarters. The relocation to our new campus from multiple U.S.-based locations will continue through 2026 when the new research and development building is expected to be complete. When construction is completed, the campus will encompass approximately 290,000 square feet. The Global and North America Headquarters Lease collectively includes the lease associated with the global and North America corporate headquarters building, the lease associated with the land where the research and development building is under construction, and the lease associated with land used for amenities.\nOn February 21, 2024, we listed our former corporate headquarters in Skillman, New Jersey for sale, which met the criteria to be classified as held for sale at that date. The Skillman, New Jersey facility continues to meet the criteria for held for sale classification as of September 28, 2025. For the fiscal three months ended March 31, 2024, an impairment charge of $68 million was recorded on the held for sale asset associated with the former corporate headquarters in Skillman. See Note 1, “Description of the Company and Summary of Significant Accounting Policies—Impairment Charges—Assets Held for Sale,” to the Condensed Consolidated Financial Statements included herein for more information.\nStrategic Review and Proposed Transaction with Kimberly-Clark\nIn July 2025, we announced that our Board of Directors (our “Board”) had previously initiated a comprehensive review of strategic alternatives and has established a strategic review committee (the “Strategic Review Committee”) to oversee the ongoing process. On November 2, 2025, following our Board’s review of strategic alternatives, our Board unanimously approved the execution of the Merger Agreement pursuant to which K-C will acquire all of the outstanding shares of the Company for a combination of stock and cash in a series of transactions, as described in Note 16, “Subsequent Events,” to the Condensed Consolidated Financial Statements included herein. Pursuant to the terms and subject to the conditions of the Merger Agreement, Company stockholders will receive the Merger Consideration consisting of 1) 0.14625 shares of K-C common stock and 2) $3.50 in cash for each share of the Company they own. Upon completion of the Transaction, current K-C stockholders are expected to own approximately 54%, and current Company stockholders are expected to own approximately 46% of the combined company on a fully diluted basis.\nThe Merger Agreement contains customary representations, warranties, covenants, and termination rights. The Transaction is expected to close in the second half of 2026 and is conditioned on the approval by the Company’s stockholders of a proposal to adopt the Merger Agreement and by K-C stockholders of a proposal to approve the issuance of K-C common stock in connection with the First Merger, as well as the satisfaction or waiver of other customary closing conditions, including the receipt of antitrust clearance in the United States and a number of foreign regulatory approvals.\nAcetaminophen Regulatory Developments\nIn September 2025, officials in the United States federal government alleged that in utero exposure to acetaminophen (the active ingredient in Tylenol\n, an over-the-counter pain medication) may be associated with an increased risk of neurological conditions such as autism spectrum disorder and attention-deficit/hyperactivity disorder in children and cautioned against the use of Tylenol\nby pregnant women. The U.S. Food and Drug Administration (“FDA”) also stated it initiated the process for a label change for acetaminophen and issued a notice to physicians. A third party, Informed Con"
}