{
  "source_file": "l-20250930.htm",
  "form_type": "10-Q",
  "item1_clean": null,
  "item7_clean": null,
  "item2_clean": "CNA’s Property & Casualty and Other Insurance Operations\nCNA’s commercial property and casualty insurance operations (“Property & Casualty Operations”) include its Specialty, Commercial and International lines of business. CNA’s Other Insurance Operations outside of Property & Casualty Operations include its long-term care business that is in run-off, certain corporate expenses, including interest on CNA’s corporate debt, and the results of certain property and casualty businesses in run-off, including CNA Re, asbestos and\nenvironmental pollution (“A&EP”), a legacy portfolio of excess workers’ compensation (“EWC”) policies and certain legacy mass tort reserves. We believe the presentation of CNA as one reportable segment is appropriate in accordance with applicable accounting standards on segment reporting. However, for purposes of this discussion and analysis of the results of operations, we provide greater detail with respect to CNA’s Property & Casualty Operations and Other Insurance Operations to enhance the reader’s understanding and to provide further transparency into key drivers of CNA’s financial results.\nIn assessing its insurance operations, CNA utilizes the core income (loss) financial measure. Core income (loss) is calculated by excluding investment gains or losses and gains or losses resulting from pension settlement transactions from net income (loss). In addition, core income (loss) excludes the effects of noncontrolling interests. The calculation of core income (loss) excludes investment gains or losses because they are generally driven by economic factors that are not necessarily reflective of CNA’s primary insurance operations. The calculation of core income (loss) excludes gains or losses resulting from pension settlement transactions as they result from decisions regarding CNA’s defined benefit pension plans which are unrelated to its primary insurance operations. Core income (loss) is deemed to be a non-GAAP financial measure and management believes some investors may find this measure useful to evaluate CNA’s insurance operations. Please see the non-GAAP reconciliation of net income (loss) to core income (loss) in this MD&A.\nIn evaluating the results of Property & Casualty Operations CNA utilizes the loss ratio, the underlying loss ratio, the expense ratio, the dividend ratio, the combined ratio and the underlying combined ratio. These ratios are calculated using GAAP financial results. The loss ratio is the percentage of net incurred claim and claim adjustment expenses to net earned premiums. The underlying loss ratio excludes the impact of catastrophe losses and development-related items from the loss ratio. Development-related items represent net prior year loss reserve and premium development, and includes the effects of interest accretion and change in allowance for uncollectible reinsurance. The expense ratio is the percentage of insurance underwriting and acquisition expenses, including the amortization of deferred acquisition costs, to net earned premiums. The dividend ratio is the ratio of policyholders’ dividends incurred to net earned premiums. The combined ratio is the sum of the loss ratio, the expense ratio and the dividend ratio. The underlying combined ratio is the sum of the underlying loss ratio, the expense ratio and the dividend ratio. The underlying loss ratio and the underlying combined ratio are deemed to be non-GAAP financial measures, and management believes some investors may find these ratios useful to evaluate CNA’s underwriting performance since they remove the impact of catastrophe losses which are unpredictable as to timing and amount, and development-related items as they are not indicative of current year underwriting performance.\nChanges in estimates of claim and claim adjustment expense reserves, net of reinsurance, for prior years are defined as net prior year loss reserve development within this MD&A. These changes can be favorable or unfavorable. Net prior year loss reserve development does not include the effect of any related acquisition expenses. Further information on CNA’s reserves is provided in Notes 4 and 5 of the Notes to Consolidated Condensed Financial Statements included under Item 1 of this Report.\nIn addition, renewal premium change, rate, retention and new business are also utilized in evaluating operating trends. Renewal premium change represents the estimated change in average premium on policies that renew, including rate and exposure changes. Rate represents the average change in price on policies that renew excluding exposure change. Exposure represents the measure of risk used in the pricing of the insurance product. The change in exposure represents the change in premium dollars on policies that renew as a result of the change in risk of the policy. Retention represents the percentage of premium dollars renewed, excluding rate and exposure changes, in comparison to the expiring premium dollars from policies available to renew. New business represents premiums from policies written with new customers and additional policies written with existing customers. Gross written premiums, excluding third-party captives, excludes business which is ceded to third-party captives, including business related to large warranty programs.\nCNA also uses underwriting gain (loss) and underlying underwriting gain (loss), calculated using GAAP financial results, to monitor insurance operations. Underwriting gain (loss) is deemed to be a non-GAAP financial measure and is calculated pretax as net earned premiums less total insurance expenses, which includes insurance claims and policyholders’ benefits, amortization of deferred acquisition costs and insurance related administrative expenses. Net income (loss) is the most directly comparable GAAP measure. Management believes some investors may find this measure useful to evaluate the profitability, before tax, derived from CNA’s underwriting activities, which are managed separately from its investing activities. Underlying underwriting gain (loss) is also deemed to be a non-GAAP financial measure, and represents pretax underwriting gain (loss) excluding catastrophe losses and development-related items. Management believes some investors may find this measure useful to evaluate the profitability, before tax, derived from CNA’s underwriting activities, excluding the impact of catastrophe losses, which are unpredictable as to timing and amount, and development-related items as they are not indicative of CNA’s current year underwriting performance.\nThe following tables present reconciliations of net income attributable to Loews Corporation to core income (loss), underwriting gain (loss) and underlying underwriting gain for t\nhe three and nine months\nended September 30, 2025 and 2024:\nThree Months Ended September 30, 2025\nOther Insurance Operations\nNet income (loss) attributable to Loews Corporation\n\nRenewal premium change\nCompared to the Comparable\nGross written premiums, excluding third-party captives, for Specialty increased $27 million for the three months ended September 30, 2025 as compared with the comparable 2024 period driven by favorable renewal premium change, inclusive of rate, partially offset by lower retention. Net written premiums for Specialty increased $5 million for the three months ended September 30, 2025 as compared with the comparable 2024 period. The increase in net earned premiums for the three months ended September 30, 2025 was consistent with the trend in net written premiums for Specialty.\nGross written premiums for Commercial increased $22 million for the three months ended September 30, 2025 as compared with the comparable 2024 period driven by favorable renewal premium change, inclusive of rate, partially offset by lower retention and new business. Net written premiums for Commercial increased $30 million for the three months ended September 30, 2025 as compared with the comparable 2024 period. The increase in net earned premiums for the three months ended September 30, 2025 was consistent with the trend in net written premiums for Commercial.\nGross written premiums for International increased $17 million for the three months ended September 30, 2025 as compared with the comparable 2024 period. Excluding the effect of foreign currency exchange rates, gross written premiums increased $9 million driven by higher new business partially offset by lower rate. Net written premiums for International increased $42 million for the three months ended September 30, 2025 as compared with the comparable 2024 period. Excluding the effect of foreign currency exchange rates, net written premiums increased $33 million for the three months ended September 30, 2025 as compared with the comparable 2024 period driven by a true-up due to a reduction in anticipated reinsurance costs for prior treaty terms in the third quarter of 2025. The increase in net earned premiums for the three months ended September 30, 2025 was consistent with the trend in net written premiums in recent quarters for International.\nCore income for Property & Casualty Operations increased $110 million for the three months ended September 30, 2025 as compared with the comparable 2024 period primarily due to lower catastrophe losses, improved underlying underwriting results and higher net investment income.\nCatastrophe losses for Property & Casualty Operations were $41 million for the three months ended September 30, 2025 as compared with $143 million for the comparable 2024 period, driven by severe weather related events. Catastrophe losses for the three months ended September 30, 2024 included $55 million for Hurricane Helene. For the three months ended September 30, 2025 and 2024, Specialty had no catastrophe losses, Commercial had catastrophe losses of $39 million and $127 million and International had catastrophe losses of $2 million and $16 million.\nFavorable net prior year loss reserve development for Property & Casualty O"
}