{
  "source_file": "ldos-20251003.htm",
  "form_type": "10-Q",
  "item1_clean": null,
  "item7_clean": null,
  "item2_clean": "Item 2. Management's Discussion and Analysis of Financial Condition and Results of Operations\nThe following discussion and analysis of Leidos Holdings, Inc.'s (\"Leidos\") financial condition, results of operations, and quantitative and qualitative discussion about business environment and trends should be read in conjunction with Leidos' condensed consolidated financial statements and related notes.\nUnless indicated otherwise, references in this report to \"we,\" \"us\" and \"our\" refer collectively to Leidos and its consolidated subsidiaries.\nOVERVIEW\nLeidos is an industry and technology leader serving government and commercial customers with smarter, more efficient digital and mission innovations. Headquartered in Reston, Virginia, with 47,000 global employees, we bring domain-specific capabilities, technologies and insights to customers in each of these markets by leveraging seven technical core capabilities: trusted mission artificial intelligence, cyber operations, digital modernization, mission software systems, integrated systems, mission operations, and rapid prototyping and manufacturing. Our customers include the U.S. Department of Defense (\"DoD\"), the U.S. Intelligence Community, the U.S. Department of Homeland Security, the Federal Aviation Administration, the Department of Veterans Affairs, National Aeronautics and Space Administration and many other U.S. civilian, state and local government agencies, foreign government agencies and commercial businesses.\nBUSINESS ENVIRONMENT AND TRENDS\nU.S. GOVERNMENT MARKETS\nDuring both the three and nine months ended October 3, 2025, and September 27, 2024, we generated approximately 87%, of total revenues from contracts with the U.S. government. Accordingly, our business performance is affected by the overall level of U.S. government spending, especially national security, homeland security and intelligence spending, and the alignment of our service and product offerings and capabilities with current and future budget priorities of the U.S. government.\nOn October 1, 2025, the federal government shutdown following the expiration of a continuing resolution. Congress is currently working to reopen the federal government and is engaged in ongoing negotiations. As a result of the government shutdown, we may experience reduced or delayed work on existing contracts and there may be delays in other government contracting actions and payments. Once the government reopens, Congress will resume consideration of the Fiscal Year 2026 appropriations bills, with the goal of completing them by the end of the current calendar year.\nLeidos Holdings, Inc.\nPART I—FINANCIAL INFORMATION\nINTERNATIONAL MARKETS\nSales to customers in international markets represented approximately 8% of total revenues for both the three\n\nended October 3, 2025, as compared to the three months ended September 27, 2024, operating income remained consistent. This was primarily attributable to higher material costs for production programs in their initial phases.\nThe increase in operating income for the nine months ended October 3, 2025, as compared to the nine months ended September 27, 2024, was primarily attributable to program wins and a decrease in amortization expense in the current year.\nLeidos Holdings, Inc.\nPART I—FINANCIAL INFORMATION\n(dollars in millions)\nThe increase in operating loss for the three months ended October 3, 2025, as compared to the three months ended September 27, 2024, was primarily attributable to a $24 million increase in legal reserves and general and administrative expenses.\nThe decrease in operating loss for the nine months ended October 3, 2025, as compared to the nine months ended September 27, 2024, was primarily attributable to decreased legal fees, a $25 million insurance reimbursement for legal costs primarily incurred prior to fiscal year 2025 and lower acquisition and integration costs.\nNON-OPERATING EXPENSE, NET\nNon-operating expense, net for the three months ended October 3, 2025, was $51 million as compared to $46 million for the three months ended September 27, 2024. The increase was primarily driven by increased interest expense as a result of the two $500 million senior notes issued in February 2025.\nNon-operating expense, net for the nine months ended October 3, 2025, was $156 million as compared to $142 million for the nine months ended September 27, 2024. The increase was primarily driven by increased interest expense as a result of the two $500 million senior notes issued in February 2025 and unfavorable exchange rate movements.\nPROVISION FOR INCOME TAXES\nOn July 4, 2025, tax legislation was enacted in H.R.1 Reconciliation Act, commonly referred to as the One Big Beautiful Bill Act (the “OBBBA”) implementing several corporate tax law changes, including but not limited to, (1) restoring the immediate expensing of U.S. research and development costs; (2) allowing certain taxpayers an election to deduct the unamortized balance of U.S. research and development costs capitalized in prior years; and (3) reinstating one hundred percent bonus depreciation for eligible property. Based upon our interpretation of the law as currently enacted, we estimate that income taxes payable and net deferred taxes will be $270 million and $235 million, respectively, lower at January 2, 2026, than our estimates prior to the OBBBA enactment.\nFor the three months ended October 3, 2025, our effective tax rate was 23.8% compared to 23.0% for the three months ended September 27, 2024. The increase to the effective tax rate was primarily due to impacts from the OBBBA, partially offset by a decrease in valuation allowance compared to the prior year quarter.\nFor the nine months ended October 3, 2025, our effective tax rate was 23.9% compared to 23.3% for the nine months ended September 27, 2024. The increase to the effective tax rate was primarily due to impacts from the OBBBA.\nBOOKINGS AND BACKLOG\nEffective for the first quarter of fiscal 2025, we changed our backlog policy to include estimated future revenue on task orders expected to be awarded under sole source indefinite delivery/indefinite quantity (\"IDIQ\") contracts in our reported backlog. We believe this presentation provides enhanced visibility for investors and more accurately reflects the future revenues we expect to generate from our business.\nWe recorded net bookings worth an estimated $5.9 billion and $11.9 billion during the three\n\nNet cash used in investing activities\nNet cash used in financing activities\n(1) Net cash provided by operating activities for the three and nine months ended September 27, 2024, was recast to reflect a change in the accounting policy, see \"Note 1–Basis of Presentation and Summary of Significant Accounting Policies.\"\nNet cash provided by operating activities increased $64 million during the three months ended October 3, 2025, when compared to the prior year quarter. The increase was primarily due to an increase in tax benefits from the impacts of the OBBBA legislation and favorable changes in working capital, partially offset by the timing of payroll and employee benefit payments.\nNet cash provided by operating activities increased $114 million during the nine months ended October 3, 2025, when compared to the prior year. The increase was primarily due to an increase in tax benefits from the impacts of the OBBBA legislation, partially offset by the timing of payroll and employee benefit payments.\nNet cash used in investing activities increased $13 million for the three months ended October 3, 2025, when compared to the prior year quarter. The increase was primarily due to higher capital expenditures and a $7 million payment related to the acquisition of Kudu Dynamics.\nNet cash used in investing activities increased $316 million for the nine months ended October 3, 2025, when compared to the prior year. The increase was primarily due to $292 million of net cash paid related to the acquisition of Kudu Dynamics and higher capital expenditures.\nNet cash used in financing activities increased $338 million for the three months ended October 3, 2025, when compared to the prior year quarter. The increase was primarily due to a $450 million prepayment on our senior unsecured term loan, partially offset by a $100 million decrease in stock repurchases in the current year quarter.\nNet cash used in financing activities increased $144 million for the nine months ended October 3, 2025, when compared to the prior year primarily due to a $150 million increase in stock repurchases, a $10 million increase in payments for debt activities, partially offset by a $11 million decrease in shares withheld for tax obligations.\nLeidos Holdings, Inc.\nPART I—FINANCIAL INFORMATION\nOFF-BALANCE SHEET ARRANGEMENTS\nGUARANTOR AND ISSUER OF GUARANTEED SECURITIES\nLeidos Holdings, Inc. (“Guarantor”) has fully and unconditionally guaranteed the debt securities of its subsidiary, Leidos, Inc. (“Issuer”), that were issued pursuant to transactions that were registered under the Securities Act of 1933, as amended (collectively, the “Registered Notes”). The following is a list of the Registered Notes guaranteed by Leidos Holdings, Inc.\nSenior unsecured Registered Notes issued by Leidos, Inc.:\n$500 million 3.625% notes, due May 2025\n$750 million 4.375% notes, due May 2030\n$1,000 million 2.300% notes, due February 2031\n$500 million 5.400% notes, due March 2032\n$750 million 5.750% notes, due March 2033\n$500 million 5.500% notes, due March 2035\n\nand nine months ended September 27, 2024, respectively. The activity for the three months ended October 3, 2025, included a prepayment on our senior unsecured term loan of $450 million and the activity for the nine months ended October 3, 2025, also included a $500 million payment to discharge the $500 million notes due May 2025.\nOur senior unsecured term loan, senior unsecured notes and senior unsecured revolving facility contain financial covenants and customary restrictive covenants. We were in compliance"
}