{
  "source_file": "ldos-20250103.htm",
  "form_type": "10-K",
  "item1_clean": "OUR COMPANY\nLeidos Holdings, Inc. (“Leidos”), a Delaware corporation, is a holding company whose direct 100%-owned subsidiary and principal operating company is Leidos, Inc. Leidos was founded in 1969 by physicist Dr. Robert Beyster. Since our founding 56 years ago, we have applied our expertise in science, research and engineering in rapidly-evolving technologies and markets to solve complex problems of global concern.\nWe use the terms “we,” “us” and “our” to refer collectively to Leidos Holdings, Inc. and its consolidated subsidiaries. Leidos is an industry and technology leader serving government and commercial customers with smarter, more efficient digital and mission innovations. Headquartered in Reston, Virginia, with 48,000, global employees, we bring domain-specific capabilities, technologies and insights to customers in each of these markets by leveraging seven technical core capabilities: trusted mission artificial intelligence, cyber operations, digital modernization, mission software systems, integrated systems, mission operations, and rapid prototyping and manufacturing. Applying our technically-advanced solutions to help solve our customers’ most difficult problems has enabled us to build strong relationships with key customers. Our customers include the U.S. Department of Defense (“DoD”), the U.S. Intelligence Community, the U.S. Department of Homeland Security (“DHS”), the Federal Aviation Administration (“FAA”), the Department of Veterans Affairs (“VA”), National Aeronautics and Space Administration (“NASA”) and many other U.S. civilian, state and local government agencies, foreign government agencies and commercial businesses. With a focus on delivering mission-critical solutions, Leidos generated 87% of revenues for the fiscal year ended January 3, 2025, (“fiscal 2024”) from U.S. government contracts, either as a prime contractor or a subcontractor to other contractors engaged in work for the U.S. government. Approximately 8% of our revenues are generated by entities located outside of the United States.\nBy leveraging expertise in multiple disciplines, tailoring our services and solutions to the particular needs of our targeted markets and using advanced analytics, we work to securely deliver services and solutions that not only meet customers’ current goals, but also support their future missions.\nOUR BUSINESS SEGMENTS\nBeginning in fiscal 2024, we realigned our business and operate in four reportable segments that are focused on specific, defined capability sets we bring to our customers. As a result of this change, prior year segment results and disclosures have been recast to reflect the current reportable segment structure. We now operate in the following reportable segments: National Security & Digital, Health & Civil, Commercial & International and Defense Systems. We also separately present the unallocated costs associated with corporate functions as Corporate.\nWe provide a wide array of scientific, engineering and technical services and solutions across these reportable segments.\nNATIONAL SECURITY & DIGITAL\nOur National Security & Digital business provides leading-edge and technologically advanced services, solutions and products, as well as mission software capabilities for defense and intelligence customers in the areas of cyber, logistics, security operations and decision analytics. We also deliver IT operations and digital transformation programs across all U.S. federal government customers. Our advanced capabilities include the delivery of technology-enabled services, mission software capabilities and IT modernization services. Our capabilities allow us to provide innovative technology solutions in software development, engineering & design, modeling & simulation, analytics, cyber security, intelligence analysis, linguistics and mission operations.\nMission Software – We deliver trusted national security software for defense, intelligence, and homeland security customers. Our mission software aims to provide the decision advantage for protecting the homeland, securing critical infrastructure, enabling logistics and conducting multi-domain operations. The core of this capability offering is our Secure Development Operations approach that is designed to ensure our code is secure and assured from the start, enabling our mission partners to focus on execution.\nLeidos Holdings, Inc. Annual Report\nPART I\nMulti-Domain Solutions – We provide services by using artificial intelligence and machine learning to coordinate sea, ground, air and space rapidly and securely, helping our warfighters have the right information at the right time to take action with decision advantage. We apply an open architecture approach to digitally connect the joint force across air, land, sea, cyber and space domains in support of the DoD’s multi-domain operations through innovative solutions, essential services and enriched data management tools facilitating critical decision making.\nCyber Operations – We offer full-spectrum cyber solutions to include offensive, defensive, and physical cyber operations. We drive new advances for our customers in the areas of Zero Trust, Cognitive Cyber, Quantum Cryptography, Identity, Credential and Access Management. We deliver global-scale cryptographic management solutions to protect our customers’ most critical information and assets.\nIntelligence Analysis, Mission Support, and Global Logistics Services – We provide intelligence analysis, operational support, logistics operations, security, linguistics, force production, biometrics, Chemical, Biological, Radiological, Nuclear, and Explosives, energetics, and training. In addition, we deliver tailored IT services and solutions to our customers. We offer product support and lifecycle sustainment services to our customers, including planning and managing the cost and performance across the product’s lifecycle. We offer reverse engineering, classified manufacturing and design, and threat exploitation services to U.S. Intelligence Community customers. We use predictive analytics and AI to securely deliver transformational logistics to our customers. We provide a wide range of integrated logistics systems, including rapid procurement, inventory and facility management, and distribution systems.\nDigital Modernization – We provide worldwide digital support for our nation’s largest and most critical infrastructure. We design, develop, implement and maintain IT environments to provide stability and flexibility to mission needs. Our capabilities support offerings including cybersecurity, data analytics, and operations and logistics. Our cybersecurity solutions help detect and manage the most sophisticated cyber threats.\nDigital Transformation – We deliver secure, user-centric IT solutions in cloud computing, mobility, application modernization, DevOps, data center and network modernization, asset management, help desk operations and digital workplace enablement. We help our customers achieve their missions and business goals by delivering purpose-built solutions, cybersecurity as a standard, efficient project delivery and end-user satisfaction. We accelerate enterprise transformation using customizable roadmaps and repeatable processes, enabling customers to effectively use their resources and advance their objectives. Using our cyber expertise, we continually enhance our techniques and processes to build systems that operate resiliently in the face of evolving cyber threats. Leidos is modernizing enterprise IT in classified and unclassified environments, including programs with the FAA, NASA, U.S. Department of Justice, Internal Revenue Service, U.S. MINT, U.S. Department of Commerce, U.S. Federal Trade Commission, and U.S. Department of Housing and Urban Development.\nNational Security & Digital represented 44% of total revenues for fiscal 2024, 47% of total revenues for both the fiscal year ended December 29, 2023 (“fiscal 2023”) and the fiscal year ended December 30, 2022 (“fiscal 2022”).\nHEALTH & CIVIL\nOur Health & Civil business provides services and solutions to federal and commercial customers in the areas of public health, care coordination, life and environmental sciences and transportation. We are dedicated to delivering effective and affordable solutions that are responsible for the health and well-being of people, including service members and veterans. Our core capabilities include health information management services, managed health services, systems and infrastructure modernization, and life sciences research and development. We help customers achieve their missions and take on the connected world with data-driven insights, improved efficiencies and technological advantages. Health & Civil represented 30% of total revenues for fiscal 2024 and 27% of total revenues for both fiscal 2023 and fiscal 2022.\nTransportation Solutions – Leidos is a trusted systems developer, service provider and integrator serving Air Navigation Service Providers around the world, including the FAA. We provide air traffic control systems that help manage the world’s most complex airspace. We deliver many of the FAA’s key automation systems and services, including the En Route Automation Modernization (“ERAM”), Advanced Technologies and Oceanic Procedures (“ATOP”), Time Based Flow Management, Terminal Flight Data Manager, Enterprise-Information Display System, Geo-7 and Future Flight Services. Leidos received 10 plus year extensions to the ERAM and ATOP contracts for continued delivery of the evolving National Airspace System needs. In addition, under the Mode S Beacon Replacement Systems contract, Leidos is supporting the replacement of the FAA’s Mode S Beacon Systems, which are secondary surveillance radar capable of providing surveillance and specific aircraft information necessary to support Air Traffic Control automation in all traffic environments. We also provide key air traffic control systems around the world, including New Zealand and South Korea.\nLeidos Holdings, Inc. Annual Report\nPART I\nHealth Mission Software\n– Leidos employs holistic-systems used for fielding applied technology solutions across the entire continuum of healthcare. We deliver a single, common electronic health record to both DoD and VA hospitals and treatment facilities worldwide. Our responsibilities range from integrating software for the electronic healthcare record vendor and dental record vendors to integrating picture archiving and communications software and more. We support cybersecurity across all integrated systems. We also provide enterprise IT solutions to the VA, National Institutes of Health (“NIH”), DoD and other federal health customers to help operate mission critical infrastructure reliably and at a reasonable cost.\nManaged Health Services – We deploy a national footprint of health clinics and health providers to support care delivery services, including medical disability and behavioral health examinations for the VA, as well as serving other independent medical exam markets. We have developed unique capabilities in behavioral health management through many decades of experience with a special emphasis on substance abuse services and non-medical counseling. We believe that these capabilities can be expanded into other clinical adjacencies. Our managed health services activities leverage our IT and mission enablement capabilities, which underpin solutions we offer to our customers across all of our served markets.\nClimate, Energy and Environment – We believe that we are trusted by government agencies with substantial environmental and sustainability driven-missions. We strive to ensure that our reputation across climate science, environmental management and operations, nuclear security, infrastructure management, mission support and IT modernization provides the applicable expertise needed to transform operations while modernizing aging infrastructure and maintaining environmental stewardship. We support th",
  "item7_clean": "CRITICAL ACCOUNTING ESTIMATES\nOur discussion and analysis of our financial condition and results of operations are based upon our consolidated financial statements, which are prepared in accordance with accounting principles generally accepted in the United States of America (“GAAP”). The preparation of these financial statements in accordance with GAAP requires management to make estimates and assumptions that affect the reported amounts of assets and liabilities and the disclosure of contingencies at the date of the financial statements, as well as the reported amounts of revenues and expenses during the reporting periods. Management evaluates these estimates and assumptions on an ongoing basis. Our estimates and assumptions have been prepared by management on the basis of the most current and best available information. The results of these estimates form the basis for making judgments about the carrying values of assets and liabilities that are not readily apparent from other sources. Actual results could differ from these estimates under different assumptions and conditions.\nWe have identified the following accounting policies as critical because they require significant judgments and assumptions about highly complex and inherently uncertain matters and the use of reasonably different estimates and assumptions could have a material impact on our results of operations or financial condition.\nREVENUE RECOGNITION\nWe perform work under various types of contracts, which include FFP, T&M, FPLOE, cost-plus-fixed-fee, cost-plus-award-fee, cost-plus-incentive-fee and fixed-price-incentive-fee contracts.\nOn FFP contracts requiring system integration and cost-plus contracts with variable consideration, revenue is generally recognized over time using a method that measures the extent of progress towards completion of a performance obligation, principally using a cost-input method (referred to as the cost-to-cost method). Under the cost-to-cost method, revenue is recognized based on the proportion of total costs incurred to estimated total costs-at-completion (“EAC”), which require us to use estimates of the revenue and cost associated with the design, manufacture and delivery of our offerings and services. A performance obligation’s EAC includes all direct costs such as materials, labor, subcontract costs, overhead and a ratable portion of general and administrative costs. If the estimated cost of a performance obligation whose associated revenue is recognized using the cost-to-cost method exceeds the estimated transaction price, the entire amount of the loss is recognized in operations in the period the loss is known.\nSome of our cost-plus and fixed-price contracts contain award fees, incentive fees or other provisions that may either increase or decrease the transaction price. These variable amounts generally are awarded upon achievement of certain performance metrics, program milestones or cost targets and can be based upon customer discretion. We estimate variable consideration at the most probable amount that we expect to be entitled to, based on the assessment of the contract specific variable fee criteria, complexity of work and related risks, extent of customer discretion, amount of variable consideration received historically and the potential of significant reversal of revenue.\nWe allocate the transaction price of a contract to its performance obligations primarily based upon the proportional individual selling prices. The standalone selling price of the performance obligations is generally based on an expected cost-plus margin approach. For certain product sales, performance obligations may be allocated to a contract's transaction price based on prices observed in other standalone sales or the residual value method. Substantially all of our contracts do not contain a significant financing component, which would require an adjustment to the transaction price of the contract.\nLeidos Holdings, Inc. Annual Report\nPART II\nGOODWILL\nGoodwill represents the excess of the fair value of consideration transferred, plus the fair value of any non-controlling interests in the acquiree, over the fair value of the net assets acquired and liabilities assumed as of the acquisition date. Goodwill is not amortized, but instead is tested annually, at the beginning of the fourth quarter, for impairment at the reporting unit level and may be tested more frequently if events or circumstances indicate that the carrying value may not be recoverable. As of January 3, 2025, and December 29, 2023, goodwill represented 46% and 48% of our total assets, respectively.\nWe may perform qualitative or quantitative analysis to test for impairment. Qualitative factors include macroeconomic, industry and market considerations, overall financial performance, industry, legal and other relevant events and factors affecting the reporting unit.\nOur quantitative analysis utilizes discounted cash flow models and market multiple valuation methods to estimate reporting unit fair values. Discounted cash flow analyses rely on significant judgment and assumptions about expected future cash flows, weighted-average cost of capital, discount rates, expected long-term growth rates and operating margins. These assumptions are based on estimates of future sales and earnings after considering such factors as general market conditions, customer budgets, existing firm and future orders, changes in working capital, long term business plans and recent operating performance. Market multiple analyses incorporate significant judgments and assumptions related to the selection of guideline public companies, our forecast earnings before interest, taxes, depreciation and amortization (“EBITDA”), forecast EBITDA of guideline public companies and control premium estimates.\nOperations of the Security Enterprise Solutions (“SES”) reporting unit rely heavily on the sales and servicing of security and detection products, which prior to fiscal 2024, have been negatively impacted due to delays in airline travel infrastructure projects as customer budgets recover from the pandemic.\nDuring fiscal 2023, the SES reporting unit refined its portfolio and made strategic business decisions to exit certain product offerings, as well as cease operations in certain countries in order to align the operations of the reporting unit with its strategic business plan. These decisions, along with the delays in airline travel infrastructure projects and higher than anticipated servicing costs, contributed to a significant reduction in the reporting unit’s forecasted revenue and cash flows.\nAccordingly, we recognized a non-cash goodwill impairment charge of $596 million for fiscal 2023 (see “Note 8—Goodwill and Intangible Assets” of the notes to the consolidated financial statements contained within this Annual Report on Form\nK). The goodwill impairment resulted in a lower difference between the fair value and carrying value for the SES reporting unit and therefore, in fiscal 2024, we performed a quantitative impairment analysis for the SES reporting unit, which resulted in no further impairment.\nIn fiscal 2024, we performed our annual test for impairment as of September 28, 2024, which resulted in no impairments being identified.\nCOMMITMENTS AND CONTINGENCIES\nRECENTLY ADOPTED AND ISSUED ACCOUNTING PRONOUNCEMENTS\nLeidos Holdings, Inc. Annual Report\nPART II\n\nItem 7. Management’s Discussion and Analysis of Financial Condition and Results of Operations\nUnless indicated otherwise, references in this report to “we,” “us” and “our” refer collectively to Leidos and its consolidated subsidiaries.\nOVERVIEW\nLeidos is an industry and technology leader serving government and commercial customers with smarter, more efficient digital and mission innovations. Headquartered in Reston, Virginia, with 48,000, global employees, we bring domain-specific capabilities, technologies and insights to customers in each of these markets by leveraging seven technical core capabilities: trusted mission artificial intelligence, cyber operations, digital modernization, mission software systems, integrated systems, mission operations, and rapid prototyping and manufacturing. Our customers include the U.S. Department of Defense (“DoD”), the U.S. Intelligence Community, the U.S. Department of Homeland Security, the Federal Aviation Administration, the Department of Veterans Affairs, National Aeronautics and Space Administration (“NASA”) and many other U.S. civilian, state and local government agencies, foreign government agencies and commercial businesses. Approximately 8% of our revenues are generated by entities located outside of the United States.\nBeginning in fiscal 2024, we realigned our business and operate in four reportable segments that are focused on specific, defined capability sets we bring to our customers. As a result of this change, prior year segment results and disclosures have been recast to reflect the current reportable segment structure. We now operate in the following reportable segments: National Security & Digital, Health & Civil, Commercial & International and Defense Systems. We also separately present the unallocated costs associated with corporate functions as Corporate.\nOur significant initiatives include the following:\nachieving annual revenue growth through internal collaboration and better leveraging of key differentiators across our company and the deployment of resources and investments into profitable growth markets;\ncontinued improvement in our back-office infrastructure and related business processes for greater effectiveness and efficiency across all business functions; and\ndisciplined deployment of our cash resources and use of our capital structure to enhance shareholder value while retaining an appropriate amount of financial leverage.\n. For fiscal 2024, revenues increased $1.2 billion, or 8%, compared to fiscal 2023, the increase was primarily due to a net increase in volumes on certain programs and program wins, partially offset by the completion of certain contracts.\nFor fiscal 2023, revenues increased $1.0 billion, or 7%, compared to fiscal 2022, primarily due to program wins, a net increase in volumes on certain programs and a net increase in revenues attributable to our business acquisitions. The increase was partially offset by the completion of certain contracts.\nOperating Expenses and Income Trend\nLeidos Holdings, Inc. Annual Report\nPART II\nFrom a macroeconomic perspective, our industry is under general competitive pressures associated with spending from our largest customer, the U.S. government, and requires a high level of cost management focus to allow us to remain competitive. Although the U.S. Presidential Administration has not indicated a desire to reduce spending in the defense and homeland security sectors, the likelihood, extent and duration of current spending levels in these areas remains unclear. We continue to review our cost structure against our anticipated sales and undertake cost management actions and efficiency initiatives where necessary.\nBUSINESS ENVIRONMENT AND TRENDS\nU.S. GOVERNMENT MARKETS\nWe generated approximately 87% of our total revenues from contracts with the U.S. government in fiscal 2024 and 2023 as compared to 86% of our total revenues from contracts with the U.S. government in fiscal 2022, either as a prime contractor or a subcontractor to other contractors engaged in work for the U.S. government. Revenues under contracts with the DoD and U.S. Intelligence Community, including subcontracts under which the DoD or the U.S. Intelligence Community is the ultimate purchaser, represented approximately 48%, 49% and 44% of our total revenues for fiscal 2024, 2023 and 2022, respectively. Accordingly, our business performance is affected by the overall level of U.S. government spending, especially national security, homeland security and intelligence spending, and the alignment of our service and product offerings and capabilities with current and future budget priorities of the U.S. government.\nOn December 21, 2024, the U.S. federal government avoided a shutdown by passing into law a continuing resolution that provides government funding through March 14, 2025. The continuing resolution gives lawmakers additional time to consider the 12 appropriations bills for government fiscal year 2025. Failure to pass the appropriations bills or another continuing resolution by March 14, 2025, will result in a partial or complete federal government shutdown.\nINTERNATIONAL MARKETS\nSales to customers in international markets represented approximately 8% of total revenues for fiscal 2024, as compared to 9% and 8% of total revenues for fiscal 2023 and 2022, respectively. Our international customers include foreign governments and their agencies. Our international business increases our exposure to international markets and the associated international regulatory, foreign currency exchange rate and geopolitical risks.\nChanges in international trade policies, including higher tariffs on imported goods and materials, may increase our procurement costs of certain IT hardware used both on our contracts and for internal use. However, we expect to recover certain portions of these higher tariffs through our cost-plus contracts. While we evaluate the impact of higher tariffs, currently, we do not expect tariffs to have a significant impact to our business.\nKEY PERFORMANCE MEASURES\nThe primary financial performance measures we use to manage our business and monitor results of operations are revenue, operating income, cash flows from operations and diluted earnings per share. Bookings and backlog are also useful measures for management and investors to evaluate our performance and potential future revenues. In addition, we consider business performance by contract type to be useful to management and investors when evaluating our operating income and margin performance.\nLeidos Holdings, Inc. Annual Report\nPART II\nRESULTS OF OPERATIONS\nOur results of operations for the periods presented were as follows:\n\n(dollars in millions)\nThe increase in operating loss for fiscal 2024 as compared to fiscal 2023, was primarily attributable to an increase in research and development activities and general and administrative costs.\nThe increase in operating loss for fiscal 2023 as compared to fiscal 2022, was primarily attributable to higher legal costs, increased expenses in integration and restructuring activities, partially offset by the impact of foreign payroll tax reserves.\nNON-OPERATING EXPENSE, NET\nNon-operating expense, net decreased by $30 million for fiscal 2024 as compared to fiscal 2023, primarily due to higher interest income earned from higher cash balances.\nNon-operating expense, net increased by $16 million for fiscal 2023 as compared to fiscal 2022, primarily due to a net increase in interest expense driven by higher interest rates and refinancing activities.\nPROVISION FOR INCOME TAXES\nOur effective tax rate was 23.7%, 48.4% and 21.8% in fiscal 2024, 2023 and 2022, respectively. The effective tax rate for fiscal 2024 was favorably impacted primarily by federal research tax credits and lower state income taxes, partially offset by an increase in unrecognized tax benefits. The effective tax rate for fiscal 2023 was unfavorably impacted primarily by non tax deductible goodwill impairments. The effective tax rate for fiscal 2022 was favorably impacted primarily by federal research tax credits and excess tax benefits related to employee stock-based payment transactions.\nIn December 2021, the Organization for Economic Cooperation and Development enacted model rules for a new 15% global minimum tax framework (“Pillar Two”). Many governments around the world have enacted or are in the process of enacting Pillar Two legislation. The Pillar Two legislation became effective for certain jurisdictions beginning in fiscal 2024. We will continue to evaluate the impact of the rules a",
  "item2_clean": null
}