{
  "source_file": "len-20250831.htm",
  "form_type": "10-Q",
  "item1_clean": null,
  "item7_clean": null,
  "item2_clean": "Management’s Discussion and Analysis of Financial Condition and Results of Operations\nOur third quarter results reflect the continued softening of market conditions and affordability challenges against the backdrop of what might be the beginnings of an improving economic landscape for the housing market. While our deliveries were just below our goal and we sold more homes than expected during the quarter, it was at the expense of margin deterioration. Sales volume was difficult to maintain and required additional incentives in order to achieve our expected pace and avoid a buildup of excess inventory. Accordingly, we remained focused on volume and even flow production, although at a slightly slower pace. We will maintain responsible volume to maintain an affordable cost structure and relieve pressure on sales and deliveries which will establish a floor on margin as the overall housing market continues to remain short on supply.\nThe macroeconomic landscape remains challenging, and diminished consumer confidence is being affected by a wide range of uncertainties, both domestic and global. We have begun to see interest rates drift downwards and we’re just beginning to see consumers return to the market. Against that backdrop, supply remains constrained in most markets driven by years of underproduction. New construction has slowed as builders have pulled back on production due to slow sales and affordability concerns therefore exacerbating the chronic supply shortage. Demand is still high as people want and need homes, but affordability and waning confidence around buying now have been constraining that demand. We are optimistic that if mortgage rates approach the 6% level, or even lower, we will soon see some firming in the market, and we will benefit from stronger affordability and therefore demand.\nOperationally, we will continue to drive growth, production and volume to fill the housing shortage that we know persists across our markets. We remain focused on leveraging advanced technology throughout our homebuilding operations. We look to position ourselves as the leading technology-enabled, low-cost homebuilding manufacturer. We are now situated with a lower cost structure, efficient product offerings, and strong market positions to accommodate pent-up demand as rates moderate and confidence ultimately returns. Financially, we are focused on driving an efficient, land-light balance sheet to effectively have land banks and third parties hold and develop our land assets while we build cash flow.\nLooking ahead to the fourth quarter of 2025, we anticipate selling between 20,000 to 21,000 homes and delivering between 22,000 and 23,000 homes. Our average sales price is expected to be between $380,000 and $390,000, as we continue to see pricing pressure on homes sold during the quarter. We are focused on driving sales and closings and maintaining strong current cash flow even at reduced profitability. We expect our margin to come in at approximately 17.5%, depending on market conditions.\nWhile the short-term road ahead may seem choppy, we are optimistic about our future. We are well-prepared with a strong national footprint, increasing community count, and growing volume. Our strong balance sheet and land banking relationships, along with our technology-enabled solutions, will afford us flexibility and advantaged opportunities for strategic growth.\n(1) Results of Operations\nWe historically have experienced, and expect to continue to experience, variability in quarterly results. Our results of operations for the three and nine months ended August 31, 2025 are not necessarily indicative of the results to be expected for the full year. Our homebuilding business is seasonal in nature and generally reflects higher levels of new home order activity in our second and third fiscal quarters and increased deliveries in the second half of our fiscal year. However, a variety of factors can alter seasonal patterns.\nOur net earnings attributable to Lennar were $591.0 million, or $2.29 per diluted share, in the third quarter of 2025, compared to our third quarter net earnings attributable to Lennar in 2024 of $1.2 billion, or $4.26 per diluted share. Excluding mark-to-market gains of $99.2 million on technology investments, third quarter net earnings attributable to Lennar in 2025 were $516.0 million, or $2.00 per diluted share. Excluding mark-to-market gains of $39.1 million on technology investments and one-time items of $89.0 million in our Multifamily segment, third quarter net earnings attributable to Lennar in 2024 were $1.1 billion or $3.90 per diluted share.\nFinancial information relating to our operations was as follows:\nThree Months Ended August 31, 2025\nSelling, general and administrative expenses\nOther costs and expenses\nTotal costs and expenses\nEquity in earnings (losses) from unconsolidated entities\nOther income (expense), net and other gains (losses), net\nLennar Other realized and unrealized gains from technology investments\nOperating earnings (loss)\nCorporate general and administrative expenses\nCharitable foundation contribution\nEarnings (loss) before income taxes\nThree Months Ended August 31, 2024\nSelling, general and administrative expenses\nOther costs and expenses\nTotal costs and expenses\nEquity in earnings (losses) from unconsolidated entities\nOther income (expense), net and other gains (losses), net\nLennar Other unrealized gains from technology investments\nCorporate general and administrative expenses\nCharitable foundation contribution\nEarnings (loss) before income taxes\nNine Months Ended August 31, 2025\nSelling, general and administrative expenses\nOther costs and expenses\nTotal costs and expenses\nEquity in earnings (losses) from unconsolidated entities\nOther income (expense), net and other gains (losses), net\nLennar Other realized and unrealized gains from technology investments\nOperating earnings (loss)\nCorporate general and administrative expenses\nCharitable foundation contribution\nEarnings (loss) before income taxes\nNine Months Ended August 31, 2024\nHomebuilding costs and expenses:\nSelling, general and administrative expenses\nOther costs and expenses\nTotal costs and expenses\nEquity in earnings (losses) from unconsolidated entities\nOther income (expense), net and other gains (losses), net\nLennar Other unrealized gains from technology investments\nOperating earnings (loss)\nCorporate general and administrative expenses\nCharitable foundation contribution\nEarnings (loss) before income taxes\nOn February 10, 2025, we completed our acquisition of Rausch Coleman Homes (\"Rausch\"). Prior year information includes only stand-alone data for Lennar Corporation for the three and nine months ended August 31, 2024.\nThree Months Ended August 31, 2025 versus Three Months Ended August 31, 2024\nRevenues from home sales decreased 9% in the third quarter of 2025 to $8.2 billion from $9.0 billion in the third quarter of 2024. Revenues were lower primarily due to a 9% decrease in the average sales price of homes delivered. New home deliveries were 21,584 homes in the third quarter of 2025, compared to 21,516 homes in the third quarter of 2024. The average sales price of homes delivered was $383,000 in the third quarter of 2025, compared to $422,000 in the third quarter of 2024.\nThe decrease in average sales price of homes delivered in the third quarter of 2025 compared to the same period last year was primarily due to continued weakness in the market.\nGross margins on home sales were $1.4 billion, or 17.5%, in the third quarter of 2025, compared to $2.0 billion, or 22.5%, in the third quarter of 2024. During the third quarter of 2025, gross margins decreased primarily due to a lower revenue per square foot and higher land costs year over year, which were partially offset by a decrease in construction costs, reflecting our continued focus on cost-saving initiatives.\nSelling, general and administrative expenses were $676.5 million in the third quarter of 2025, compared to $600.7 million in the third quarter of 2024. As a percentage of revenues from home sales, selling, general and administrative expenses increased to 8.2% in the third quarter of 2025, from 6.7% in the third quarter of 2024, primarily due to less leverage as a result of lower revenues and an increase in marketing and selling expenses.\nDuring the three months ended August 31, 2025, our homebuilding operating earnings included $8.7 million of interest income, compared to $33.8 million of interest income in the three months ended August 31, 2024. The decrease in interest income was primarily due to lower cash balances year over year.\nOperating earnings for the Financial Services segment were $177.4 million in the third quarter of 2025, compared to $143.6 million in the third quarter of 2024. The increase in operating earnings was primarily due to higher profit per locked loan in the mortgage business as a result of higher margins.\nOperating loss for the Multifamily segment was $16.4 million in the third quarter of 2025, compared to operating earnings of $79.0 million in the third quarter of 2024, which were positively impacted by a $179.0 million one-time net gain from the sale of assets in our LMV Fund I, partially offset by a one-time $90.0 million write-down of non-core assets.\nOperating earnings for the Lennar Other segment were $62.5 million in the third quarter of 2025, compared to operating earnings of $20.1 million in the third quarter of 2024. The Lennar Other operating earnings for both the third quarter of 2025 and 2024 were primarily related to $99.2 million and $39.1 million mark-to-market gains on our technology investments, respectively.\nIn the third quarter of 2025 and 2024, we had tax provisions of $190.9 million and $347.9 million, which resulted in an overall effective income tax rate of 24.4% and 23.0%, respectively. For both periods, our effective income tax rate included state income tax expense and non-deductible executive compensation, partially "
}