{
  "source_file": "len-20241130.htm",
  "form_type": "10-K",
  "item1_clean": "Financial information about our Homebuilding, Financial Services, Multifamily and Lennar Other operations is contained in\nItem 7. Management's Discussion and Analysis of Financial Condition and Results of Operations\nOur company was founded as a local Miami homebuilder in 1954. We completed our initial public offering in 1971 and listed our common stock on the New York Stock Exchange in 1972. During the 1980s and 1990s, we entered and expanded operations in a number of homebuilding markets, including California, Florida and Texas, through both organic growth and acquisitions, such as Pacific Greystone Corporation in 1997. In 2000, we acquired U.S. Home Corporation, which expanded our operations into New Jersey, Maryland, Virginia, Minnesota and Colorado and strengthened our position in other states. From 2002 through 2005, we acquired several regional homebuilders, which brought us into new markets and strengthened our position in several existing markets. From 2010 through 2013, we expanded our homebuilding operations into Georgia, Oregon, Washington and Tennessee. In 2017, we acquired WCI Communities, Inc., a homebuilder of luxury single-family and multifamily homes, including a small number of luxury high-rise tower units, in Florida. In 2018, we acquired CalAtlantic Group, Inc. (\"CalAtlantic\"), a major homebuilder which was building homes across the homebuilding spectrum, from entry level to luxury, in 43 metropolitan statistical areas spanning 19 states, and providing mortgage, title and escrow services.\nWe are focused on increasing efficiencies in our building process and reducing selling, general and administrative expenses by using technology and innovative strategies to reduce customer acquisition costs. Our construction playbook has three primary areas of focus: lowering construction costs, reducing cycle time and achieving even flow production. We have aimed to maintain strong operating margins by deferring home sale price commitments until construction costs are finalized to protect against cost escalations. We focus on executing our operating strategy to be a consistent and high-volume homebuilder with production pace in sync with sales pace while using our gross margin as a shock absorber. In addition, we are continuing our transition to a land light operating model by increasing the percentage of land we control through options or agreements but do not own, which reduces our years’ supply of owned homesites. In connection with this transition, we expect to spin off a significant portion of our land assets to Millrose (as defined below), as discussed further below under the caption “Homebuilding Operations – Millrose Spin-Off.”\nHomebuilding Operations\nOur homebuilding operations include the construction and sale of single-family attached and detached homes as well as the purchase, development and sale of residential land directly through entities in which we have investments. New home deliveries, including deliveries from unconsolidated entities, were 80,210 in fiscal 2024, compared to 73,087 in fiscal 2023 and 66,399 in fiscal 2022. We primarily sell homes in communities targeted to first-time, move-up, active adult, and luxury homebuyers. The average sales price of a Lennar home varies depending on product and geographic location. For fiscal 2024, the average sales price, excluding deliveries from unconsolidated entities, was $423,000, compared to $446,000 in fiscal 2023 and $480,000 in fiscal 2022.\nWe operate primarily under the Lennar brand name. Our homebuilding mission is focused on the profitable development of residential communities. Key elements of our strategy include:\nStrong Operating Margins -\nOur purchasing leverage combined with our focus on reducing selling, general and administrative costs by using technology and innovative strategies and reducing interest expense through paydowns of debt has enabled us to achieve strong gross profit and operating margins.\nEverything’s Included\n- We are focused on distinguishing our products, including through our Everything’s Included\napproach, which maximizes our purchasing power, enables us to include luxury features as standard items in our homes and simplifies our homebuilding operations.\nInnovative Homebuilding -\nWe are constantly innovating the homes we build to create products that better meet our customers' needs and desires. Our Next Gen\nhome provides what can be a home within a home to accommodate children or parents or can be an office from which to work remotely.\n- We are integrating standardized, highly efficient, value engineered Plan series across all divisions at different price points. The Core Plans are driving cost savings and strong operating margins, while delivering great value for our homebuyers.\nFlexible Operating Structure\n- Our local operating structure gives us the flexibility to make operating decisions based on local homebuilding conditions and customer preferences, while our centralized management structure provides strategic oversight for our homebuilding operations.\n- We are increasingly advertising homes through digital channels, which is significantly increasing the cost effectiveness of our marketing efforts.\nDynamic pricing model\n- We match up unsold production as homes progress toward completion, with pricing information from our dynamic pricing model on a community-by-community and home-by-home basis.\n- We partner with and/or invest in technology companies that are looking to improve the homebuilding and financial services industries to increase efficiencies, reduce customer acquisition costs and create a better customer experience.\n- We are focused on reducing our years' supply of owned homesites and increasing the percentage of land we control through options or agreements, including agreements with strategic land banks and joint ventures, rather than ownership. In connection with this strategy, we expect to spin off a significant portion of our land assets to Millrose, as discussed further below under the caption “Homebuilding Operations – Millrose Spin-Off.”\nEven flow production\n- We adjust prices, with our gross margin being a shock absorber, in an effort to maintain consistent starts and sales paces in order to generate increased market share in all the markets we build in.\nDiversified Program of Property Acquisition\nWe generally acquire, or obtain options to acquire, land for development and for the construction of homes that we sell to homebuyers. Land purchases are subject to specified underwriting criteria and are made through our diversified program of property acquisition, which may consist of:\nAcquiring land through option contracts, which generally enables us to control portions of properties owned by land banks and other third parties or entities in which we have investments until we have determined whether to exercise the options;\nAcquiring land directly from individual land owners/developers, or other homebuilders;\nAcquiring local or regional homebuilders that own, or have options to purchase, land in strategic markets;\nAcquiring access to land through joint ventures or partnerships, which among other benefits, limits the amount of our capital invested in land while helping to ensure our access to potential future homesites and allowing us to participate in strategic ventures;\nInvesting in regional developers in exchange for preferential land purchase opportunities; and\nAcquiring land in conjunction with our Multifamily business.\nFor the last several years, we have been reducing our reliance on land we own and increasing our access to land through options and joint ventures, most significantly through our use of land banks which is a critical part of our operating strategy. At November 30, 2024, 82% of our total homesites were controlled through options with land banks, land sellers and joint ventures compared to 76% at November 30, 2023. For additional information about our investments in and relationships with unconsolidated entities, see Management’s Discussion and Analysis of Financial Condition and Results of Operations in Item 7 of this Report.\nConstruction and Development\nWe are involved in all phases of planning and building in our residential communities, including land acquisition, site planning, preparation and improvement of land and design, construction and marketing of homes. We use independent subcontractors for most aspects of land development and home construction. At November 30, 2024, we were actively building and marketing homes in 1,447 communities, including 11 communities being constructed by unconsolidated entities. This was an increase from the 1,260 communities, including five communities being constructed by unconsolidated entities, in which we were actively building and marketing homes at November 30, 2023. At November 30, 2024 and 2023, we had about 2,900 and 1,200 completed unsold homes, respectively.\nWe generally supervise and control the development of land and the design and building of our residential communities with a relatively small labor force. We hire subcontractors for site improvements and virtually all of the work involved in the construction of homes. Arrangements with our subcontractors generally provide that our subcontractors will complete specified work in accordance with price and time schedules and in compliance with applicable building codes and laws. The price schedules may be subject to change to meet changes in labor and material costs or for other reasons. Although we, like homebuilders throughout the country, encountered shortages of materials and skilled labor during 2022, we believe that because of our size and our builder of choice program, where we work with our trade partners to drive efficiencies for them, we were less affected by these shortages than many of our competitors. Most shortages were eliminated due to the supply chain environment catching up to homebuilder demand as well as Lennar’s continued effort to work with our suppliers and manufacturers on the volume and specific products needed to build homes. We generally do not own heavy construction equipment. We finance construction and land development activities primarily with cash generated from operations and historically from proceeds of unsecured corporate debt. Following the Millrose Spin-Off, we expect that, when Millrose acquires undeveloped or partially developed land that we have options to purchase, Millrose will finance the horizontal development of all such homesites up to pre-negotiated development budgets, which will be incorporated into the takedown prices for Lennar’s purchase options on the properties.\nWe offer a diversified line of homes for first-time, move-up, active adult, luxury and multi-generational homebuyers in a variety of locations ranging from urban infill communities to suburban golf course communities. Our Everything’s Included\nmarketing program enables us to differentiate our homes from those of our competitors by including luxury items as standard features at competitive prices, while reducing construction and overhead costs through a simplified construction process, product standardization and volume purchasing. In addition, we include built in wireless capability, home automation and solar power in many of the homes we sell, which enhances our brand and improves our ability to generate traffic and sales.\nWe sell our homes from models that we have designed and constructed. We employ new home consultants who are paid salaries, commissions or both to conduct on-site sales of our homes. We also sell homes through independent realtors. We have made it possible for potential homebuyers to take virtual tours of model homes. During fiscal 2024 and 2023, even with shifts in macroeconomic factors and adjusting to an inflationary environment in much of the period, we were able to develop, enhance, use, and improve the Lennar machine. Our sales, marketing, and dynamic pricing machine is quickly becoming an adv",
  "item7_clean": "are inherently dangerous. While safety is a priority on our land development and construction sites, we cannot always control the way work is performed by subcontractors, including whether they comply with laws and regulations designed to maximize the safety of construction workers. Failures in health and safety performance on our\nworksites may result in penalties for non-compliance with relevant regulatory requirements and in our subcontractors having difficulty attracting the workers they need as well as in a negative impact to our reputation.\nProducts supplied to us and work done by subcontractors can expose us to risks that could adversely affect our business.\nWe rely on subcontractors to perform the actual construction of our homes, and in many cases, to select and obtain building materials. Despite our detailed specifications and quality control procedures, in some cases, subcontractors may use improper construction processes or defective materials. Defective products widely used by the homebuilding industry can result in the need to perform extensive repairs to large numbers of homes. The cost of complying with our warranty obligations may be significant if we are unable to recover the cost of repairs from subcontractors, materials suppliers and insurers.\nWe also can suffer damage to our reputation, and may be exposed to possible liability, if subcontractors fail to comply with applicable laws, including laws involving things that are not within our control. When we learn about possibly improper practices by subcontractors, we try to cause the subcontractors to discontinue them. However, we may not always be able to do that, and even when we can, it may not avoid claims against us relating to work the subcontractors already performed.\nA reduced number of home sales would extend the time it takes us to recover land purchase and property development costs.\nWe incur many costs even before we begin to build homes in a community. Depending on the stage of development a land parcel is in when we acquire it (or when it is acquired by Millrose or another land banking entity), these may include costs of preparing land, finishing and entitling lots, installing roads, sewers, water systems and other utilities, and taxes and other costs related to ownership of the land on which we plan to build homes. If the rate at which we sell and deliver homes slows, or if we delay the opening of new home communities, we may incur increased pre-construction costs and it may take longer for us to recover those costs.\nIncreased interest rates could increase our cost of building homes.\nOur business requires us to finance much of the cost of developing our residential communities. One of the ways we do this is with bank borrowings. At November 30, 2024, we had a $2.9 billion revolving credit facility with a group of banks (the \"Credit Facility\"), which had an accordion feature that could increase it to $3.5 billion. We also had warehouse borrowing facilities totaling $3.4 billion to support our residential and commercial mortgage lending activities. The interest on borrowings under the Credit Facility is at rates based on prevailing short-term rates from time to time. In 2022 and 2023, the Federal Reserve steadily raised benchmark interest rates and the Federal Reserve did not begin reducing benchmark interest rates until well into 2024. At November 30, 2024, we had no borrowings under our Credit Facility. However, if in the future we have a need for significant borrowings under our Credit Facility and interest rates continue be high, that would increase the cost of the homes we build, which either would make those homes more expensive for homebuyers, which is likely to reduce demand, or would lower our operating margins, or both.\nIncreases in the rate of cancellations of home sale agreements could have an adverse effect on our business.\nOur backlog reflects agreements of sale with our homebuyers for homes that have not yet been delivered. We usually have received a deposit from our homebuyer for each home reflected in our backlog, and generally we have the right to retain the deposit if the homebuyer does not complete the purchase. In some cases, however, a homebuyer may cancel the agreement of sale and receive a complete or partial refund of the deposit for reasons such as state and local laws, the homebuyer’s inability to obtain mortgage financing, the homebuyer's inability to sell their current home or our inability to complete and deliver the home within the specified time. With the increase in interest rates, we have experienced an increase in cancellation rates. If there is a weakening of the housing market, or if mortgage financing becomes less available or more expensive than it currently is or is expected to be more homebuyers may cancel their agreements of sale with us, which would have an adverse effect on our business and results of operations.\nOur success to a substantial extent depends on our ability to acquire land that is suitable for residential homebuilding and meets our land investment criteria.\nThere is strong competition among homebuilders for land that is suitable for residential development. The future availability of finished and partially finished developed lots and undeveloped land that meet our internal criteria depends on a number of factors outside our control, including land availability in general, competition with other homebuilders and land buyers for desirable property, inflation in land prices, zoning, allowable housing density, and other regulatory requirements. Should suitable lots or land become less available, the number of homes we could build and sell could be reduced, and the cost of land could be increased, perhaps substantially, which could adversely impact our results of operations.\nWe could be hurt if land banks are not able to raise investor funds needed to enable them to supplement land acquisitions by Millrose.\nWe formed and intend to spin off Millrose to make it a recycling source of land acquisition funding. However, Millrose will not have the capacity to provide all the land acquisition funding we require, and Millrose’s policies will limit its acquisitions to land we expect to use within five years. We will look to traditional land banks to acquire at least some of the\nland that Millrose will not or cannot acquire. Most land banks are funds that use financial investor capital to finance land acquisitions. If returns to investors in land banks are not sufficient to attract investor funds and land banks are not able to identify alternative sources of funding, we would no longer have access to land banks. This could significantly impair our ability to carry out our strategy of reducing our inventory of owned land.\nWe could be hurt by refusals of owners of land to honor options or contracts to sell land to us.\nWe have made a strategic decision to increase the portion of our potential land inventory that we control through options or contracts and reduce the portion we own. This substantially reduces our investment in land. However, if landowners who are parties to the options or contracts, possibly including land banks, were to refuse to honor them, we could lose access to land at the time we want to use it in our homebuilding activities.\nThe loss of the services of members of our senior management or a significant number of our operating employees could negatively affect our business.\nOur success depends to a significant extent upon the performance and active participation of our senior management, many of whom have been with us for 20 or more years. If we were to lose members of our senior management, we might not be able to find appropriate replacements on a timely basis and our operations could be negatively affected. Also, the loss of a significant number of key operating employees and our inability to hire qualified replacements could have a material adverse effect on our business.\nNatural disasters and severe weather conditions could delay deliveries and increase costs of new homes in affected areas, which could harm our sales and results of operations.\nMany of our homebuilding operations are conducted in areas that are subject to natural disasters, including hurricanes, earthquakes, droughts, floods, wildfires and severe weather. The occurrence of natural disasters or severe weather conditions can delay new home deliveries, increase costs by damaging inventories and lead to shortages of labor and materials in areas affected by the disasters, and can negatively impact the demand for new homes in affected areas. Our insurance may not cover business interruptions or losses resulting from these events and our results of operations could be adversely affected by these events. Additionally, natural disasters and severe weather conditions may increase the cost of homeowner's insurance or create difficulties in obtaining homeowners’ insurance at all, which could reduce the number of potential buyers who can afford, or are willing, to purchase homes we build in affected areas. For example, the incidence of large wildfires in California has substantially increased in recent years and the risk of future wildfires is expected to increase. The housing markets in areas affected by California’s recent wildfires have been adversely affected by increased insurance costs and difficulties in obtaining homeowners’ insurance, which we expect to be exacerbated by the recent wildfires in Los Angeles.\nIf our homebuyers are not able to obtain suitable financing, that would reduce demand for our homes and our home sales revenues.\nMost purchasers of our homes obtain mortgage loans to finance a substantial portion of the purchase price of the homes they purchase. While the majority of our homebuyers obtain their mortgage financing from our Financial Services segment, others obtain mortgage financing from banks and other independent lenders. Disruptions in the mortgage markets or increased government regulation could adversely affect the ability of potential homebuyers to obtain financing for home purchases, making it difficult for them to purchase our homes. Among other things, changes made by Fannie Mae, Freddie Mac, Ginnie Mae and FHA/VA in recent years to sponsored mortgage programs, as well as changes made in recent years by private mortgage insurance companies, have reduced the ability of a number of potential homebuyers to qualify for mortgages. Principal among these are higher income requirements, larger required down payments, increased reserves and higher required credit scores. In addition, there has been uncertainty regarding the future of Fannie Mae, Freddie Mac and Ginnie Mae, including proposals that they reduce or terminate their role as the principal sources of liquidity in the secondary market for mortgage loans. It is not clear how, if Fannie Mae, Freddie Mac and Ginnie Mae were to curtail their secondary market mortgage loan purchases, the liquidity they provide would be replaced. There is a substantial possibility that substituting an alternate source of liquidity would increase mortgage interest rates, which would increase the buyers' effective costs of paying for the homes we sell, and therefore could reduce demand for our homes and adversely affect our results of operations.\nChanges in tax laws could increase the cost of owning a home.\nCurrently, there are significant income tax benefits from owning a home, including deductibility of all or some interest on mortgage loans incurred to finance home purchases and the deductibility of property taxes, subject to certain limits. If federal or state tax laws are changed to eliminate or reduce any of these income tax benefits or if personal income or property tax rates were to increase,\nthe after-tax cost of homeownership could measurably increase and diminish consumer interest in buying a home,\nwith a resulting adverse effect on our revenues.\nOur Financial Services segment can be adversely affected by reduced demand for our homes.\n100% of the residential mortgage loans made by our Financial Services segment in 2024 were made to buyers of homes we built. Therefore, a decrease in the demand for our homes or an increase in the mortgage financing obtained by homebuyers from lenders other than our Financial Services segment would adversely affect the revenues of this aspect of our business.\nIf our ability to sell residential mortgages into the secondary market is impaired, that could significantly reduce our ability to sell homes unless we are willing to become a long-term investor in loans we originate.\nSubstantially all of the residential mortgage loans we originate are sold within a short period in the secondary mortgage market on a servicing-released, non-recourse basis. If we became unable to sell residential mortgage loans into the secondary mortgage market or directly to Fannie Mae, Freddie Mac and Ginnie Mae, we would have to either curtail our origination of residential mortgage loans, which among other things, could significantly reduce our ability to sell homes, or commit our own funds to long-term investments in mortgage loans, which, in addition to requiring us to deploy substantial amounts of our own funds, could delay the time when we recognize revenues from home sales on our statements of operations.\nWe may be liable for certain limited representations and warranties we make in connection with the sale of loans.\nWhile substantially all of the residential mortgage loans we originate are sold within a short period in the secondary mortgage market on a servicing-released, non-recourse basis, we remain responsible for certain industry standard limited representations and warranties we make in connection with such sales. Mortgage investors sometimes seek to have us buy back mortgage loans or compensate them for losses incurred on mortgage loans that we have sold based on claims that we breached our limited representations and warranties. In addition, when LMF Commercial sells loans to securitization trusts or other purchasers, it gives limited industry standard representations and warranties about the loans, which, if incorrect, may require it to repurchase the loans, replace them with substitute loans or indemnify persons for losses or expenses incurred as a result of breaches of representations and warranties. If we have significant liabilities with respect to such claims, it could have an adverse effect on our results of operations, and possibly our financial condition.\nFailure to comply with the covenants and conditions imposed by our lenders could restrict future borrowing or cause our debt to become immediately due and payable.\nThe agreement governing our Credit Facility (the \"Credit Agreement\") makes it a default if we fail to pay principal or interest when it is due (subject, in some instances, to grace periods) or to comply with various covenants, including covenants regarding financial ratios. In addition, our Financial Services residential mortgage companies and our LMF Commercial mortgage lending group have warehouse facilities to finance their mortgage lending. If we default under the Credit Agreement or our warehouse facilities, the lenders will have the right to terminate their commitments to lend and to require immediate repayment of all outstanding borrowings. This could reduce our available funds at a time when we are having difficulty generating all the funds we need from our operations, in the capital markets or otherwise, and restrict our ability to obtain financing in the future. In addition, if we default under the Credit Agreement or our warehouse facilities, it could cause the amounts outstanding under our senior notes to become immediately due and payable, which would seriously adversely impact our consolidated financial condition.\nWe have a substantial level of indebtedness, which may have an adverse effect on our business or limit our ability to take advantage of business, strategic o",
  "item2_clean": null
}