{
  "source_file": "lh-20241231.htm",
  "form_type": "10-K",
  "item1_clean": "BLS segment operating income\nBLS provides drug development, medical device and CDx development solutions from early-stage research to clinical development, along with support for crop protection and chemical testing, through its ED and Central Laboratory Services businesses. Its customers are comprised of pharmaceutical, biotechnology, medical device, and diagnostic companies across the world. With a global network of operations, BLS offers deep expertise in early development and clinical trials in each therapeutic area. BLS had provided support for more than\nof the new drugs and therapeutic products approved in 2024 by the FDA, including 86% of those specific to oncology, 74% of those submitted by biotechnology companies, and 80% of those submitted by leading and large pharmaceutical companies. Through its industry-leading central laboratory business, it supports clinical trial a\nin approximately 100 cou\nEarly Development Research Laboratories\n: connects early discovery activities to regulated preclinical studies\n: bioanalytical testing services offering appropriate dose and frequency of drug administration\n: general, genetic, and immunotoxicology services; nonclinical pathology; safety pharmacology services; preclinical medical device services; respiratory services; and developmental and reproductive toxicology (DART) studies\nChemistry manufacturing services\n: robust, cost-effective solutions in the areas of safety, identity, strength, quality, and purity assessments for biologics\nEarly phase development solutions\n: focused, multidisciplinary teams of experts that craft integrated solutions to identify and develop lead drug candidates and reduce development challenges\nCrop protection and chemical testing\n: Consulting services for chemical manufacturers and other firms engaged in the development of modern crop protection technology\nCentral Laboratory Services\nClinical laboratory services for individuals participating in clinical studies\nProvided to biopharmaceutical customers through its global network of central laboratories in the U.S., Europe, and Asia\nOperates world’s largest automated clinical trial sample collection kit production lines that enable kits to be produced with 5.5 sigma precision\n6 ISO 15189-certified laboratories\nTechnology Solutions\nProprietary digital tools and services providing customers with greater access to key insights and results, enhanced transparency, quality, and speed of clinical trial patient recruitment, resulting in reduced costs and increased market potential for customers:\nMetrics and benchmarking applications for monitoring patient recruitment for clinical site selection, protocol design, and optimization\nAbility to communicate with patients in the U.S. who may be eligible for clinical trials\nThe Company believes in the power of science to change lives. The Company’s culture centers around its mission to improve health and improve lives. The Company’s nearly 70,000 employees located across 17 countries are essential to the Company’s ability to innovate and advance science and technology to empower patients, providers, and pharmaceutical companies to make clear and confident decisions. Engaging the collective expertise and passion of its employees across the globe is vital to achieving the Company’s mission, which permeates its performance-driven, collaborative, inclusive, customer-centered, and inquisitive culture.\nWorkforce Demographics\nThe Company’s global talent is core to its ability to innovate and meet a wide range of patient and customer needs. The Company’s employees are globally dispersed, with 89% in the U.S. and Canada, 5% in Asia, and 6% in Europe. Of the Company’s global workforce, 87% of employees are full time, and 13% are part time. Approximately 71% of the Company’s employees globally are women. Of the U.S.-based employees, approximately 52% of the team are people of color. About 2.5% of the Company’s global workforce is employed under a collective bargaining agreement. Depending on business demand and the availability of talent, the Company supplements up to 8% of its workforce with contingent workers.\nIn 2024, the Company made investments in its talent to support retention and enable the Company’s growth. For the fourth consecutive year, hiring outpaced voluntary attrition, both globally and in the U.S.\nThe Company’s talent initiatives support the development of inclusive leadership and culture, enhancing the team member experience, and supporting community engagement and patient focus. Highlights for 2024 include:\nLaunch of a listening strategy, including measuring employee experience, inclusion, and well-being;\nSupporting our Employee Resource Groups (ERGs), which are created and led by employee volunteers and open to all employees. ERGs are important resources to foster cross-connections, encourage belonging, support career development, and champion employee voices. The Company now has nine unique ERGs – with 118 local chapters across eight countries (United States, Belgium, China, Switzerland, Germany, India, Singapore, and United Kingdom)\nwith 7,900 participating employees, representing a growth of 43% participation compared to the year prior. Each ERG has executive sponsorship from senior leadership;\nRecognition of locally relevant celebrations of cultural events reflecting the breadth of different cultures, constituencies, and observances throughout the year;\nContinued deployment of anti-harassment training to employees around the world;\nContinued support of mentoring programs, including a formal mentoring initiative;\nContinued opportunities for greater engagement between employees and management, including quarterly global town halls, which are held virtually and are open to all employees, interactions with front-line employees on visits to the Company’s facilities, and in-person town halls with employees across business units and functions;\nHarmonization of the U.S. paid holiday policy to now recognize six company-designated holidays and one floating holiday – providing a more consistent and inclusive experience for eligible U.S. non-exempt employees. By offering the flexibility of a floating holiday, the Company aims to better accommodate the unique needs, beliefs, and backgrounds of our workforce; and\nReceived several awards, such as Silver Military Friendly Award, Best Place to Work for Disability Inclusion, and Forbes’ Best Places to Work for Diversity.\nThe Company operates in a complex, global, and dynamic healthcare industry and believes that its compensation and benefits programs are comprehensive and flexible to attract and retain the caliber of talent needed for the sustained growth and success of the business.\nThe Company regularly monitors market activity and employee movement within and outside of the healthcare industry to maintain competitiveness. In 2024, the Company awarded $93 million in annual merit increases to recognize its talent and foster pay competitiveness in the market.\nThe Company believes that its investments in compensation and employee well-being are crucial to maintaining comprehensive positioning and a productive, engaged workforce. The Company fulfills its commitment to employee well-being by investing in a variety of holistic tools and resources to support its employees’ physical, emotional, and financial well-being.\nIn early 2024, the Company re-launched its wellness program making it more inclusive of both domestic and international employees. This new program, called “Best You”, translates easily into the different languages of our international employees and can be tailored to local needs by “Best You Champions” that are present in most countries where the Company has in-office employees. The Company is integrating Best You into the fabric of our company worldwide. The Company has outreach programs to support its ERGs and other groups in providing wellness support to members.\nIn support of Best You, the Company continues to offer zero-cost telehealth and implemented free virtual Primary care visits for medical, dermatological, and behavioral treatment as part of its medical plans in the U.S., employer matching 401(k) contributions, financial wellness workshops, and custom stress management strategies for teams around the world.\nThe Company also understands the importance of providing mental health resources to support employees and their families. In 2024, the Company implemented a global employee assistance program (EAP) solution to support employee mental health across the globe. In addition, a suite of People Leader Mental Health Trainings was expanded to further support employees. Best You wellbeing breaks were leveraged by leaders for their teams across the globe, with sessions such as guided meditations and stretch breaks. In partnership with EAP providers, the Company recognized World Kindness Day in November 2024 with events and education throughout the whole month, including videos from our executive leadership team educating and supporting a culture of Kindness, which also helps build an inclusive culture committed to the Company’s mission and strategy.\nAdditional efforts in support of employee wellbeing include:\nReducing the cost of monthly medical insurance contributions by $240 per year for more than 17,500 employees in the U.S. earning less than $50,000 per year who participate in Company medical plans;\nOffering free annual wellness screenings for U.S. employees and covered spouses/domestic partners focusing on identifying metabolic conditions that can increase the risk of heart attack, stroke and diabetes. Nearly 28,000 U.S. employees and their covered spouses completed the no-cost screening and earned an annual medical plan contribution discount of up to $4,560;\nProviding up to $1,000 in health reimbursement arrangement and health savings account contributions, available to approximately 31,000 employees and their spouses or domestic partners to encourage health and wellness education and activities;\nReimbursing up to $300 in fitness-related expenses for more than 13,000 employees across the U.S. and Canada;\nProviding free ColoFit\nTM\nkits to over 5,000 employees to enhance colon cancer awareness and screenings;\nOffering Weight Watchers at no cost to employees and adding Weight Watchers Clinic access to support weight health with more than 7,400 employees actively engaged; and\nExpanding $0 MDLIVE services to include Virtual Primary Care alongside Urgent Care, Behavioral Health, and Dermatology for U.S. medical plan participants.\nThe Company’s No Charge Laboratory Testing program enables eligible U.S. employees and their covered dependents to offset any outstanding balance for most lab work sent to a Company facility or patient service center, following insurance claim processing. Additionally, the Company offers global initiatives to encourage sustainable transportation through programs such as discounted transportation vouchers, reduced-cost bicycle leases, and mileage reimbursement for bicycle commuters, with benefits varying by country.\nTo enable its employees to establish ownership in the Company, the Company offers an employee stock purchase plan that permits substantially all U.S., Canada, and United Kingdom employees to purchase Common Stock at a 15% discount.\nDevelopment and Training\nAs an organization that pursues answers to the world’s most critical healthcare questions, the Company supports its employees with a work environment that emphasizes continuous learning and development. Through these learning and development opportunities, the Company encourages learning, growth, and innovation to deliver better patient care and new solutions for its customers. The Company provides professional skills training and role specific training, along with formal and informal mentoring and job rotations. The Company onboards and develops new hires through extensive training provided by a dedicated team of technical skill trainers with different department",
  "item7_clean": "Dx segment operating income\nDx segment operating margin\nBLS segment operating income\nBLS segment operating margin\nSegment operating income\nGeneral corporate and unallocated expenses\nAmortization of intangibles and other assets\nRestructuring and other charges\nGoodwill and other asset impairments\nTotal operating income\nDx operating income was $1,606.3 for the year ended December 31, 2024, an increase of 0.9% over operating income of $1,591.3 in the corresponding period of 2023, and Dx operating margin decreased 110 basis points year-over-year. The decrease in operating margin was primarily due to higher personnel costs, partially offset by organic demand.\nBLS operating income was $458.9 for the year ended December 31, 2024, an increase of 15.8% from operating income of $396.3 in the corresponding period of 2023, and BLS operating margin increased 140 basis points year over year. The increase was primarily due to organic growth and LaunchPad savings, partially offset by higher personnel costs.\nGeneral corporate expenses are comprised primarily of administrative services such as executive management, human resources, legal, finance, corporate affairs, and information technology. Corporate expenses were $670.8 for the year ended December 31, 2024, an increase of 4.1% over corporate expenses of $644.1 in the corresponding period of 2023, primarily due to higher costs related to acquisitions and personnel.\nLIQUIDITY AND CAPITAL RESOURCES (dollars and shares in millions)\nThe Company’s strong cash-generating capability and financial condition typically have provided ready access to capital markets. The Company’s principal source of liquidity is operating cash flow, supplemented by proceeds from debt offerings. The Company’s senior unsecured revolving credit facility is further discussed in Note 11 Debt to the Company’s Consolidated Financial Statements.\nIn summary the Company’s cash flows were as follows:\n\nNet cash provided by continuing operating activities\nNet cash used for continuing investing activities\nNet cash provided by (used for) continuing financing activities\nEffect of exchange rate on changes in cash and cash equivalents\nNet cash impact from discontinued operations\nNet change in cash and cash equivalents\nCash and Cash Equivalents\nCash and cash equivalents at December 31, 2024, and 2023 totaled $1,518.7 and $536.8, respectively. Cash and cash equivalents consist of highly liquid instruments, such as time deposits and other money market investments, which have original maturities of three months or less.\nCash Flows from Operating Activities\nDuring the year ended December 31, 2024, the Company’s continuing operations provided $1,585.8 of cash as compared to $1,202.3 in 2023. The $383.5 increase in cash provided from operations in 2024, as compared with the corresponding 2023 period, was primarily due to higher cash earnings and favorable working capital requirements.\nCash Flows from Investing Activities\nNet cash used for continuing investing activities for the year ended December 31, 2024, was $1,366.8 as compared to $1,146.8 for the year ended December 31, 2023. The increase in net cash used for investing activities for the year ended December 31, 2024 as compared to the year ended December 31, 2023, was primarily due to an increase in business acquisitions and higher capital expenditures.\nCapital expenditures were $489.9 and $453.6 for the years ended December 31, 2024, and 2023, respectively. Capital expenditures in 2024 were 3.8% of revenues, primarily in connection with projects to support growth in the Company’s core businesses. The Company expects this level of spending to remain consistent in 2025, primarily in connection with projects to support growth in the Company’s core businesses, facility expansion and updates, projects related to its LaunchPad initiative, and further acquisition integration initiatives.\nCash Flows from Financing Activities\nNet cash provided by continuing financing activities for the year ended December 31, 2024, was $779.9 compared to cash used in continuing financing activities of $1,559.0 for the year ended December 31, 2023. This movement in cash within financing activities for 2024, as compared to 2023, was primarily due to $2,000.0 of proceeds from new debt securities and $300.0 of proceeds from the new accounts receivable facility described below, partially offset by $1,000.0 of payments towards the Company’s senior notes, $250.1 of share repurchases, and $243.1 of dividends paid, compared to $1,000.0 of share repurchases and $300.0 of payments towards the Company’s senior notes, and $254.0 of dividends paid in 2023.\nOn September 23, 2024, LCAH (the Issuer) entered into a base indenture with U.S. Bank Trust Company, National Association, as trustee (the Trustee) (the 2024 Indenture). On September 23, 2024, the Company, the Issuer and the Trustee entered into supplemental indentures to the 2024 Indenture under which the Issuer issued, and the Company guaranteed, $2,000.0 in debt securities, consisting of $650.0 aggregate principal amount of 4.35% senior notes due 2030, $500.0 aggregate principal amount of 4.55% senior notes due 2032, and $850.0 aggregate principal amount of 4.80% senior notes due 2034, with interest payable semi-annually on April 1 and October 1 of each year, commencing April 1, 2025. Net proceeds from these offerings were approximately $1,983.0 after deducting underwriting discounts and other estimated expenses of the offering. The net proceeds were used to redeem or repay indebtedness and, to the extent not used for such purpose, for other general corporate purposes. Indebtedness redeemed or repaid or to be redeemed or repaid at or prior to maturity were the Company’s 2.30% senior notes due December 2024, its 3.60% senior notes due February 2025, and $500.0 of borrowings under its revolving credit facility.\nOn January 13, 2023, LCAH amended and restated its revolving credit facility. It consists of a five-year revolving facility in the principal amount of up to $1,000.0, with the option of increasing the facility by up to an additional $500.0, subject to the agreement of one or more new or existing lenders to provide such additional amounts and certain other customary conditions. The Company is required to pay a facility fee on the aggregate commitments under the revolving credit facility, at a per annum rate ranging from 0.100% to 0.225%, depending on the Company’s debt ratings. Borrowings under the revolving credit facility will accrue interest at a per annum rate equal to, at the Company’s election, either (x) a LIBOR (changed to SOFR in 2023) rate plus a margin ranging from 0.775% to 1.275% or (y) a base rate plus a margin ranging from 0% to 0.275%, in each case, depending on the Company’s debt ratings.\nOn August 23, 2024, the Company and a bankruptcy-remote special purpose vehicle entered into a $300.0 three-year accounts receivable securitization facility with PNC Bank, National Association (PNC) as administrative agent (AR Facility). The AR Facility provides for purchases of accounts receivable by PNC in an amount of up to $300.0 through August of 2027 and may increase to up to $700.0, subject to the satisfaction of certain conditions.\nOn January 31, 2025, the Company amended its AR Facility (AR Facility Amendment). The AR Facility Amendment increased the amount the Company can borrow from PNC from $300.0 to $700.0 through August of 2027. In addition, pursuant to the terms of the AR Facility Amendment (i) the Toronto-Dominion Bank became a party to the underlying receivables purchase agreement as a committed purchaser through January 2026 and (ii) MUFG Bank Ltd. and certain of its related conduit purchasers became parties to the underlying receivables purchase agreement as purchasers and the loans or investments of such conduit purchasers may accrue interest as specified in the AR Facility Amendment and receivables purchase agreement.\nOn February 18, 2025, the Company borrowed an additional $225.0 under the AR Facility Amendment, bringing the amount outstanding under the AR Facility Amendment to $525.0.\nAt December 31, 2024, the Company had $1,518.7 of Cash and cash equivalents and $1,000.0 of available borrowings under its revolving credit facility, which does not mature until 2026. Under the Company’s credit facilities and indentures relating to the Company’s senior notes, the Company is subject to negative covenants limiting subsidiary indebtedness and certain other covenants typical for investment grade-rated borrowers, and with respect to the credit facilities, the Company is required to maintain certain leverage ratios. The Company was in compliance with all covenants under the credit facilities and the indentures related to the Company’s outstanding senior notes as of December 31, 2024. The Company expects that it will remain in compliance with all covenants associated with its existing debt obligations for the next twelve months.\nOn July 24, 2024, the Board adopted a new share repurchase plan authorizing the repurchase of up to $1,000.0 maximum value of the Company’s shares in addition to the remaining amount outstanding under the previous plan. At December 31, 2024, the Company had outstanding authorization from its Board to purchase up to $1,280.4 maximum value of Company Common Stock. The repurchase authorization has no expiration date.\nFor the year ended December 31, 2024, the Company paid $243.1 in Common Stock dividends. On January 8, 2025, the Company announced a cash dividend of $0.72 per share of Common Stock for the first quarter, or approximately $61.0 in the aggregate. The dividend will be payable on March 12, 2025, to stockholders of record of all issued and outstanding shares of Common Stock at the close of business on February 27, 2025. The declaration and payment of any future dividends will be at the discretion of the Company’s Board.\nGuarantor Information\nIn connection with the Reorganization, the Company, LCAH and the Trustee entered into a seventeenth supplemental indenture (the Seventeenth Supplemental Indenture) to the indenture, dated as of November 19, 2010, between LCAH and the Trustee (the 2010 Indenture). In addition, the Company, LCAH and the Trustee entered into the 2024 Indenture (the 2010 Indenture, together with the 2024 Indenture, the Indentures). The Seventeenth Supplemental Indenture, among other things, provides for the full and unconditional guarantee by the Company of LCAH’s obligations under the 2010 Indenture and each\nseries of senior unsecured notes issued and outstanding thereunder, and the 2024 Indenture provides for the full and unconditional guarantee by the Company of LCAH’s obligations and each series of senior unsecured notes issued and outstanding, thereunder (collectively, the Labcorp Holdings Guarantees). Also, the Indentures permit the Company to satisfy LCAH’s reporting obligations so long as the Labcorp Holdings Guarantees remain in place and the Company’s financial statements and other information comply with the requirements of Rule 3-10 of Regulation S-X.\nAt December 31, 2024, there was $4,073.2 and $2,000.0 aggregate principal amount of issued and outstanding senior notes of LCAH, issued under the 2010 Indenture and the 2024 Indenture, respectively, that are fully and unconditionally guaranteed by the Company. Accordingly, pursuant to Rule 3-10 of Regulation S-X, separate consolidated financial statements of LCAH have not been presented. As permitted under Rule 13-01(a)(4)(vi) of Regulation S-X, we have excluded the summarized financial infor\nmation for LCAH because the assets, liabilities and results of operations of LCAH are not materially different than the corresponding amounts in the Company’s Consolidated Financial Statements and management believes such summarized financial information would be repetitive and would not provide incremental value to investors.\nThe investment grade debt ratings from Moody’s and S&P contribute to the Company’s ability to access capital markets.\nOff-balance Sheet Arrangements\nThe Company does not have any variable interest entities or special purpose entities whose financial results are not included in the Company’s Consolidated Financial Statements and the Company does not have any off-balance sheet financing other than normal, short-term leases and letters of credit.\nOther Commercial Commitments\nThe Company has debt instruments outstanding. At December 31, 2024, the Company had total future payments of $6,373.9, with $1,000.4 payable within 12 months.\nThe Company has leases for patient service centers, laboratories and testing facilities, clinical facilities, general office spaces, vehicles, and office and laboratory equipment. At December 31, 2024, the Company had total future lease payments of $1,140.3, with $190.7 payable within 12 months.\nAt December 31, 2024, the Company had provided letters of credit aggregating approximately $102.7, primarily in connection with certain insurance programs which are renewed annually.\nThe contractual value of the noncontrolling interest put in the Company’s Ontario subsidiary totaled $14.3 and $15.5 at December 31, 2024, and 2023, respectively, and has been classified as mezzanine equity in the Company’s Consolidated Balance Sheets.\nBased on current and projected levels of cash flows from operations, coupled with availability under its revolving credit facility, the Company believes it has sufficient liquidity to meet both its anticipated short-term and long-term cash needs for the next 12 months and the reasonably foreseeable future; however, the Company continually reassesses its liquidity position in light of market conditions and other relevant factors.\nCRITICAL ACCOUNTING ESTIMATES\nThe preparation of financial statements in conformity with generally accepted accounting principles in the U.S., requires management to make estimates and assumptions that affect the reported amounts of assets and liabilities and disclosure of contingent assets and liabilities at the date of the financial statements and the reported amounts of revenues and expenses during the reported periods. While the Company believes these estimates are reasonable and consistent, they are by their very nature estimates of amounts that will depend on future events. Accordingly, actual results could differ from these estimates. The Company’s Audit Committee periodically reviews the Company’s significant accounting policies. The Company’s critical accounting policies arise in conjunction with the following:\nRevenue recognition;\nBusiness combinations;\nGoodwill and indefinite-lived assets; and\nLegal contingencies.\nWithin the Dx segment, a revenue transaction is initiated when Dx receives a requisition form to perform a diagnostic test. The information provided on the requisition form is used to determine the party that will be billed for the testing performed and the expected reimbursement. Dx recognizes revenue and satisfies its performance obligation for services rendered when the testing process is complete, and the associated results are reported. The Dx segment also enters into lab management agreements which have monthly and non-testing-based fees which are recognized each month as the services are provided. Revenues are distributed among four payer portfolios —clients, patients, Medicare and Medicaid, and third party. Dx considers negotiated discounts and anticipated adjustments, including historical collection experience for the payer portfolio, when revenues are recorded.\nThe following are descriptions of the Dx payer portfolios:\nClient payers represent the portion of Dx’s revenue related to physicians, hospitals, health systems, accountable care organizations, employers, and other entities where payment is received exclusively from the entity ordering the testing service. Generally, client revenues are recorded on a fee-for-service basis at Dx’s client list price, less any negotiated discount. A portion of client bi",
  "item2_clean": null
}