{
  "source_file": "hrs-20251003.htm",
  "form_type": "10-Q",
  "item1_clean": null,
  "item7_clean": null,
  "item2_clean": "On January 28, 2021 and October 21, 2022, we announced that our Board of Directors (“Board”) approved share repurchase authorizations under our repurchase program of $6.0 billion, which was fully utilized in first quarter 2025, and $3.0 billion, respectively. During year to date 2025, we used $998 million of cash to repurchase 4.5 million shares of our common stock under our share repurchase program. As of October 3, 2025, we had $2.4 billion of remaining unused authorization under our repurchase program.\nDuring year to date 2024, we used $512 million of cash to repurchase 2.3 million shares of our common stock under our share repurchase program.\nSee “Liquidity and Capital Resources” in\nPart II. Item 7. Management's Discussion and Analysis of Financial Condition and Results of Operations\nPart II. Item 2. Unregistered Sales of Equity Securities and Use of Proceeds\nof this Report for further information regarding common stock repurchases.\nDuring year to date 2025, we repaid the entire outstanding $600 million of our 3.832% 2025 Notes with proceeds from the issuance and sale of the $600 million 5.50% 2054 Notes in fiscal 2024.\nDuring year to date 2024, we closed the issuance and sale of $2.25 billion aggregate principal amount of long-term fixed-rate debt consisting of 5.05% notes, due June 2029, 5.25% notes, due June 2031 and 5.35% notes, due June 2034 and used the proceeds to repay the entire outstanding $2.25 billion, variable rate-term loan facility utilized to finance the fiscal 2023 acquisition of Tactical Data Links. Additionally, we closed the issuance and sale of the $600 million 5.50% 2054 Notes and repaid the $350 million of our 3.950% notes, due May 28, 2024.\nAs of October 3, 2025, we had $11.0 billion of outstanding long-term debt, net of current portion of $120 million. The current portion primarily consists of the $100 million 7.00% debentures, due January 15, 2026.\nDuring year to date 2025, our CP Program had a maximum outstanding balance of $1.8 billion and a daily average outstanding balance of $1.3 billion. During year to date 2024, our CP Program had a maximum outstanding balance of $2.8 billion and daily average outstanding balance of $2.3 billion. While we continue to expect balances under the CP Program to remain elevated as compared to historical norms through fiscal 2025, we expect to utilize cash from operations to lower the outstanding balance by the end of fiscal 2025.\nOn February 28, 2025, we announced that our Board increased the quarterly per share cash dividend rate on our common stock to $1.20 from $1.16, the 24th consecutive annual dividend increase. During year to date 2025 and 2024, we paid $678 million and $665 million in dividends, respectively. See\nPart II. Item 5. Market for Registrant’s Common Equity, Related Stockholder Matters and Issuer Purchases of Equity Securities\nNote G: Debt and Credit Arrangements\nDefined Benefit Plan Contributions.\nAs of October 3, 2025, we had net defined benefit plan assets of $933 million, the majority of which pertain to our U.S. qualified defined benefit pension plans. We intend to contribute annually no less than the required minimum funding thresholds to these pension plans and do not expect to make material contributions in fiscal 2025. Future required contributions will depend primarily on the actual return on plan assets and the discount rate used to measure the benefit obligation at the end of each year.\n_____________________________________________________________________\nWe expect to continue evaluating opportunities to strategically manage our pension obligations, including the potential for additional pension de-risking transactions in the future, subject to market conditions and plan funding levels. These actions align with our long-term strategy to reduce exposure to pension volatility while maintaining financial flexibility.\nNote 9: Retirement Benefits\nNote H: Retirement Benefits\nin the Notes for further information regarding our defined benefit plans.\nLiquidity Assessment\nGiven our current cash position, outlook for funds generated from operations, credit ratings, available credit facilities, cash needs and debt structure, we have not experienced to date, and do not expect to experience, any material issues with liquidity for the next 12 months and in the longer term, although we can give no assurances concerning our future liquidity, particularly in light of our overall level of debt, U.S. Government budget uncertainties, including the ongoing government shutdown, and the state of global commerce and general political and global financial uncertainty. We continue to monitor the potential effects of the ongoing government shutdown, which, if prolonged, could adversely affect our cash flows. See the “U.S. and International Budget Environment” discussion above in this MD&A and\nPart I. Item 1A. Risk Factors\nBased on our current business plan and revenue prospects, we believe that our existing cash, funds generated from operations, availability under our senior unsecured credit facilities and our CP Program, and access to the public and private debt and equity markets will be sufficient to provide for our anticipated working capital requirements, capital expenditures, dividend payments, repurchases under our share repurchase program, and repayments of our debt securities at maturity for the next 12 months and the reasonably foreseeable future thereafter. Our capital expenditures for fiscal 2025 are expected to be approximately 2% of revenue. See “Cash Requirements” in this MD&A and “Capital Resources”, “Cash Requirements” and “Commercial Commitments” in\nPart II. Item 7. Management's Discussion and Analysis of Financial Condition and Results of Operations\nCRITICAL ACCOUNTING ESTIMATES\nThere have been no material changes to the critical accounting estimates disclosed in “Critical Accounting Estimates” in\nPart II. Item 7. Management's Discussion and Analysis of Financial Condition and Results of Operations\nWe test our goodwill for impairment annually as of the first day of our fourth fiscal quarter, or under certain circumstances, more frequently, such as when events or circumstances indicate there may be impairment or when we reorganize our reporting structure such that the composition of one or more of our reporting units is affected.\nFiscal 2025 Impairment Tests.\nInformation on interim impairment tests can be found in “Critical Accounting Estimates– Fiscal 2025 Impairment Tests” in\nPart I. Item 2. Management's Discussion and Analysis of Financial Condition and Results of Operations\n, which information is incorporated herein by reference. These assessments indicated no impairment existed.\nImpact of Recently Issued Accounting Pronouncements\nThere have been no new accounting pronouncements that became effective during year to date 2025 that have had a material impact on our Condensed Consolidated Financial Statements.\n\nITEM 2.\nMANAGEMENT’S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS.\nThe following Management’s Discussion and Analysis (“MD&A”) is intended to assist in an understanding of our financial condition and results of operations. This MD&A is provided as a supplement to, should be read in conjunction with, and is qualified in its entirety by reference to, our Condensed Consolidated Financial Statements and accompanying Notes in this Report (the “Notes”). In addition, reference should be made to our audited Consolidated Financial Statements and accompanying Notes to our Consolidated Financial Statements and\nPart II. Item 7. Management's Discussion and Analysis of Financial Condition and Results of Operations\nOVERVIEW\nWe are the Trusted Disruptor in the defense industry. With customers’ mission-critical needs always in mind, we deliver end-to-end technology solutions connecting the space, air, land, sea and cyber domains in the interest of national security. We support government customers in more than 100 countries, with our largest customers being various departments and agencies of the U.S. Government, their prime contractors and international allies. Our products, systems and services have defense and civil government applications, as well as commercial applications. The percentage of our revenue that was derived from sales to U.S. Government customers, including foreign military sales funded through the U.S. Government, whether directly or through prime contractors, was 75% for year to date 2025.\nU.S. and International Budget Environment\nThe U.S. and international budget environments are evolving rapidly within a dynamic geopolitical context, influenced by the new administration and Congress, heightened geopolitical tensions, global security concerns, inflationary pressures, and overall macroeconomic conditions.\nOn March 15, 2025, the President signed into law a full-year Continuing Resolution (“CR”) for GFY 2025, funding the government through September 30, 2025, with $893 billion for defense funding, including $851 billion for the U.S. Department of War (“DoW”). This was in line with the 1% increase permitted by the caps under the Fiscal Responsibility Act of 2023 for GFY 2025. Notably, the CR provided funding at the account level, not the program level, allowing federal agencies more discretion with how they prioritized funding for programs.\nOn May 2, 2025, the White House released a preliminary GFY 2026 budget that included a flat national defense topline of $893 billion (including $849 billion for DoW) and included an additional $119 billion from reconciliation funding in 2026 for a total of approximately $1 trillion. The administration requested $557 billion for non-defense funding, down from $721 billion in GFY 2025, resulting in material funding declines for some agencies, including a $6 billion cut to NASA.\nOn July 4, 2025, the President signed Congress’ reconciliation package which included $155 billion for national defense spending to fund DoW priorities, including priorities closely "
}