{
  "source_file": "hrs-20250103.htm",
  "form_type": "10-K",
  "item1_clean": "using our own funds (company-funded R&D) and under contractual arrangements\n(customer-funded R&D)\nNote 1: Significant Accounting Policies\nin the Notes for further information on company-\nIntellectual Property\nWe own a large portfolio of patents, trade secrets, know-how, confidential information, trademarks, copyrights\nand other intellectual property and we routinely apply for new patents, trademarks and copyrights. We also license\nintellectual property to and from third parties\nWith regard to certain patents, the U.S. Government has an\nirrevocable, non-exclusive, royalty-free license, pursuant to which the U.S. Government may use or authorize others\nto use the inventions covered by such patents. Pursuant to similar arrangements, the U.S. Government may consent\nto our use of inventions covered by patents owned by other persons. Numerous trademarks used on or in connection\nwith our products are also considered to be valuable assets.\nGovernment Regulations\nOur company is subject to various federal, state, local and international laws and regulations relating to the\ndevelopment, manufacture, sale and distribution of our products and services, and it is our policy to comply with the\napplicable laws in each jurisdiction in which we conduct business. Regulations include, but are not limited to, those\nrelated to import and export controls, corruption, bribery, the protection of the environment, government\nprocurement, competition, product safety, workplace health and safety, employment, labor and data privacy. The\nfollowing describes significant regulations that may impact our businesses. For further discussion of risks relating to\ngovernment regulations, see “Item 1A. Risk Factors” of this Report.\nGovernment Contracts.\n, the percentage of our revenue that was derived from sales to\nU.S. Government customers, including foreign military sales funded through the U.S. Government, whether directly\nor through prime contractors, was\nand no other customer accounted for more than\nAdditional information regarding customers for each of our segments is provided under “Item 1. Business —\nDescription of Business Segments” of this Report.\nCost-type contracts.\nOur U.S. Government cost-reimbursable contracts provide for the reimbursement of\nallowable costs plus payment of a fee and fall into three basic types: (i) cost-plus fixed-fee contracts, which provide\nfor payment of a fixed fee irrespective of the final cost of performance; (ii) cost-plus incentive-fee contracts, which\nprovide for payment of a fee that may increase or decrease, within specified limits, based on actual results\ncompared with contractual targets relating to factors such as cost, performance and delivery schedule; and (iii) cost-\nplus award-fee contracts, which provide for payment of an award fee determined at the customer’s discretion based\non our performance against pre-established performance criteria. Under our U.S. Government cost-reimbursable\ncontracts, we are reimbursed periodically for allowable costs and are paid a portion of the fee based on contract\nprogress. Some costs ar\npartially or wholly unallowable for reimbursement by statute or regulation. Examples\ninclude certain merger and acquisition\n, lobbying costs, charitable contributions,\ninterest expense, financing\nand certain litigation defense costs.\nFixed-price contracts.\nOur U.S. Government fixed-price contracts are either firm fixed-price contracts or fixed-\nprice incentive contracts. Under our U.S. Government firm fixed-price contracts, we agree to perform a specific\nscope of work or sell a specific product for a fixed price and, as a result, benefit from cost savings or carry the\nburden of cost overruns. Under our U.S. Government fixed-price incentive contracts, we share with the\nU.S. Government both savings accrued for performance at less than target cost as well as costs incurred in excess of\na negotiated ceiling price,\nwhich is higher than the target cost, but carry the entire burden of costs\nexceeding the negotiated ceiling price. Under such incentive contracts, profit may also be adjusted up or down\ndepending on whether specified performance objectives are met. Under our U.S. Government firm fixed-price and\nfixed-price incentive contracts, we generally receive either milestone payments totaling\nof the contract price\nor monthly progress payments in amounts equaling\nunder the contract. The remaining\namounts, including profits or incentive fees, are billed upon delivery and final acceptance of end items and\ndeliverables under the contract.\n_____________________________________________________________________\nOur production contracts are mainly fixed-price contracts and development contracts are generally cost-\nreimbursable contracts, although we have some fixed-price development contracts.\nTime-and-material contracts\nare considered fixed-price contracts as they specify a fixed hourly rate for each labor hour charged.\nFor further discussion of risks relating to U.S. Government contracts, see “Item 1A. Risk Factors,” “Item 3.\nLegal Proceedings” and “Item 7. M\nanagement’s Discussion and Analysis of Financial Condition and Results of\n\nincluded 53 weeks and fiscal years ended\n”) included 52 weeks. Unless the context otherwise requires, the terms “we,” “our,” “us,” “Company” and\n“L3Harris” as used in this Report mean L3Harris Technologies, Inc. and its subsidiaries.\nDescription of Business Segments\nWe structure our operations primarily around the products, systems and services we sell and the markets we\nserve, and we report our financial results\nfour operating segments, which are also our reportable segments or\nbusiness segments. From time to time, we acquire or divest businesses and strategically realign businesses within\nand across our business segments to optimize existing capabilities and enhance the efficiency with which we\ndevelop and deliver our products and services.\nOur business segments provide a wide-range of products, systems\nand services to various customers and are described below.\n\nof our revenue) and came from a large number of countries with no single foreign country\naccounting for more than\nof our total revenue. For financial information regarding our domestic and international\noperations, including long-lived assets, see\nNote 14: Business Segments\nThe majority of our international marketing activities are conducted through subsidiaries that operate in the\nEurope, Middle East and Africa (“\nEMEA\n”) and Asia-Pacific (“\nAPAC\n”) regions and Canada. We also have established\ninternational marketing organizations and several regional sales offices\nCompetitive Conditions and Trends in Market Demand\nWe operate in highly-competitive markets that are sensitive to technological advances. Some of our competitors\nin each of our markets are larger than we are and can maintain higher levels of expenditures for research and\nR&D\n”). We concentrate on the opportunities that we believe are compatible with our resources,\noverall technological capabilities and objectives. We also collaborate with innovative partners, such as our strategic\nTechnologies and Shield Capital to develop new capabilities to meet the demands of our\ncustomers. Such collaboration is required by modern market dynamics where competing in our markets requires the\nability to fuse hardware, software and\nartificial intelligence (“\nAI\n\nmission solutions as a prime and subsystem integrator in the\nspace, airborne and cyber domains. We provide top-tier capabilities in the design, development, integration,\nproduction and sustainment of weapons systems for national security, civil government and international customers\nin the following business sectors:\nIntelligence, surveillance and reconnaissance (“\nISR\n”); position, navigation and timing; weather\nand climate monitoring; missile defense and ground-based space surveillance networks.\nSituational awareness, optical networks and advanced wireless solutions for classified intelligence\nand defense customers.\nCommunications and networking solutions for air traffic management.\nSensors, processors, hardened electronics,\nunmanned aircraft systems,\nweapons, infrared search and tracking, distributed aperture systems and precision pointing, weapons release\nsystems; antennas for aircraft platforms; and threat warning and countermeasures for airborne, ground and\nIntegrated Mission Systems (“\nIMS\nDelivers differentiated mission capabilities and prime systems integration\nto support intelligence, reconnaissance and surveillance (ISR), passive sensing and targeting, electronic attack,\nautonomy, power and communications, networks and sensors. IMS specializes in system design, development,\nintegration, production, modernization and sustainment for national security and international customers in the\nfollowing business sectors:\nISR:\nAirborne passive sensing and targeting, mission systems development, integration and life-cycle\nmanagement for strategic reconnaissance, national command and control, tactical surveillance, electronic attack,\nagile strike, mobility, and classified platforms.\nPower, electrical, imaging, communication and sensor systems for naval platforms; integrated\nautonomous vessels for surface and undersea operations; fleet management; in-service support; missionization\nprototyping; and naval integration.\nGlobal Optical Systems:\nMulti-domain, multi-spectral electro-optical and infrared (EO/IR) sensor systems\nsupporting ISR and target acquisition missions; manufacturing of specialty laser and filter glass materials, laser\nrange finders, target designators and transmitters; and highly scalable autonomous solutions. On January 4, 2025,\nwe realigned our software solutions business from the ISR sector into Global Optical Solutions and renamed the\nsector Targeting & Sensor Systems.\n_____________________________________________________________________\nSpace communications and space flight avionics;\n360-degree visible/midwave IR passive\nuzing, navigation and range-testing solutions; and precision electronic components.\nCommercial Aviation Solutions\nIntegrated aircraft avionics, pilot training and data analytics services for the\ncommercial aviation industry. At\nCommercial Aviation Solutions (“\nclassified as held for sale in our\nConsolidated Balance Sheet\nNote 13: Acquisitions and Divestitures\n\nOur operations are subject to and affected by U.S. federal, state, local and foreign laws and\nregulations relating to the protection of the environment. We have\nbased on currently available\ninformation, we expect to continue to incur capital and operating costs to comply with existing and pending\nenvironmental laws and regulations. See “Item 1A. Risk Factors” and “Item 3. Legal Proceedings” of this Report and\nNote 1: Significant Accounting Policies\nNote 15: Legal Proceedings, Commitments and Contingencies\nMaterials, Suppliers and Seasonality\nBecause of the diversity of our products and services, as well as the wide geographic dispersion of our facilities,\nwe use numerous sources for the wide array of materials, such as electronic components, printed circuit boards,\nmetals and plastics needed for our operations and products. We depend on suppliers and subcontractors for a large\nnumber of components and subsystems. We also rely on a limited number of certified microelectronics component\nsuppliers for our products. We have experienced component shortages from vendors as a result of the global\npandemic, natural disasters, or the shifting regulatory landscape. These events or regulations may cause a spike in\ndemand for certain electronic components resulting in industry-wide supply chain disruptions. For further\ndiscussion of risks relating to subcontractors and suppliers, see “Item 1A. Risk Factors” of this Report.\nWe do not consider any material portion of our business to be seasonal. Various factors can affect the\ndistribution of our revenue between accounting periods, including the timing of contract awards and the timing and\navailability of U.S. Government funding, as well as t",
  "item7_clean": "of contributions to these plans in\nand may consider voluntary contributions\nFuture required contributions primarily will depend on the actual annual return on plan assets and the discount\nrate used to measure the benefit obligation at the end of each year. Depending on these factors, and the resulting\nfunded status of our pension plans, the level of future statutory required minimum contributions could be material.\nWe had net defined benefit plan assets of\n. The improvement in funded status as of\nis primarily due to more favorable\nthan expected return on plan assets and decreased pension obligations resulting from higher discount rates. See\nNote 9: Retirement Benefits\nin the Notes for further information regarding our pension plans.\nCommercial Commitments\nWe have entered into commercial commitments in the normal course of business including surety bonds,\nstandby letter of credit agreements and other arrangements with financial institutions and customers primarily\nrelating to the guarantee of future performance on certain contracts to provide products and services to customers\nor to obtain insurance policies with our insurance carriers. See\nNote 15: Legal Proceedings, Commitments and\nin the Notes for additional information.\nLiquidity Assessment\nGiven our current cash position, outlook for funds generated from operations, credit ratings, available credit\nfacilities, cash needs and debt structure, we have not experienced to date, and do not expect to experience, any\nmaterial issues with liquidity for the next 12 months and in the longer term, although we can give no assurances\nconcerning our future liquidity, particularly in light of our overall level of debt, U.S. Government budget uncertainties\nand the state of global commerce and general political and global financial uncertainty.\nBased on our current business plan and revenue prospects, we believe that our existing cash, funds generated\nfrom operations, availability under our senior unsecured credit facilities and our\nand access to the public\nand private debt and equity markets will be sufficient to provide for our anticipated working capital requirements,\ncapital expenditures, dividend payments, repurchases under our share repurchase program and repayments of our\ndebt securities at maturity for the next 12 months and the reasonably foreseeable future thereafter. Our capital\nare expected to be approximately\nCRITICAL ACCOUNTING ESTIMATES\nPreparation of this Report in accordance with GAAP requires us to make estimates and assumptions that affect\nthe reported amount of assets, liabilities, revenue, expenses and backlog as well as disclosure of contingent assets\nand liabilities. While the following is not intended to be a comprehensive list of our accounting estimates, we\nconsider the estimates discussed below as critical to an understanding of our financial statements because their\napplication places the most significant demands on our judgment, with financial reporting results dependent on\nestimates about the effect of matters that are inherently uncertain and may change in subsequent periods. Specific\nrisks for these critical accounting estimates are described in the following paragraphs. The impact and any\nassociated risks described in the following paragraphs related to these estimates on our business operations are\ndiscussed throughout this MD&A where such estimates affect our reported and expected financial results. Senior\nmanagement has discussed the development and selection of the critical accounting estimates and the related\ndisclosure included herein with the Audit Committee of our Board. Actual results may differ from those estimates.\nA significant portion of our business is derived from development and production contracts. Revenue and profit\nrelated to development and production contracts are generally recognized over-time, typically using the percentage\nPOC\n”) cost-to-cost method of revenue recognition, whereby we measure our progress towards\ncompletion of the performance obligation based on the ratio of costs incurred to date to estimated costs at\ncompletion under the contract. Because costs incurred represent work performed, we believe this method best\ndepicts the transfer of control of the asset to the customer. Under the POC cost-to-cost method of revenue\nrecognition, a single estimated profit margin is used to recognize profit for each performance obligation over its\nperiod of performance.\nRecognition of profit on a contract requires estimates of the total cost at completion and transaction price and\nthe measurement of progress towards completion. Due to the long-term nature of many of our contracts, developing\nthe estimated total cost at completion and total transaction price often requires judgment. Factors that must be\nconsidered in estimating the cost of the work to be completed include: the nature and complexity of the work to be\nperformed, subcontractor performance, the cost and availability of purchased materials and services, labor cost and\navailability and the risk and impact of delayed performance. Factors that must be considered in estimating the total\n_____________________________________________________________________\ntransaction price include contractual cost or performance incentives (such as incentive fees, award fees and\npenalties) and other forms of variable consideration as well as our historical experience and our expectation for\nperformance on the contract. These variable amounts generally are awarded upon achievement of certain\nnegotiated performance metrics, program milestones or cost targets and can be based upon customer discretion.\nWe include such estimated amounts in the transaction price to the extent it is probable that a significant reversal of\ncumulative revenue recognized will not occur when the uncertainty associated with the variable consideration is\nAt the outset of each contract, we gauge its complexity and perceived risks and establish an estimated total cost\nat completion in line with these expectations. We follow a standard EAC process in\nwe review the progress\nand performance on our ongoing contracts\nIf we successfully retire risks associated with the technical, schedule\nand cost aspects of a contract, we may lower our estimated total cost at completion commensurate with the\nretirement of these risks. Conversely, there are many reasons estimated contract costs can increase, including: (i)\nsupply chain disruptions, inflation and labor issues; (ii) design or other development challenges; and (iii) program\nexecution challenges (including from technical or quality issues and other performance concerns). Additionally, as\nthe contract progresses, our estimates of total transaction price may increase or decrease if, for example, we\nreceive incentive or award fees that are higher or lower than expected.\nWhen changes in estimated total costs at completion or in estimated total transaction price are determined, the\nrelated impact on operating income is recognized on a cumulative basis. Cumulative EAC adjustments represent the\ncumulative effect of the changes on current and prior periods; revenue and operating margins in future periods are\nrecognized as if the revised estimates had been used since contract inception. Any anticipated losses on these\ncontracts are fully recognized in the period in which the losses become evident. In\nearnings were impacted by recognition of net favorable EAC adjustments of\nand net unfavorable EAC\n, we recognized approximately\nin unfavorable EAC adjustments related to three\nclassified fixed-price development programs in\nthere were no individual EAC adjustments\nthat were material to our results of operations on a consolidated or segment basis in\nWe recognize revenue from numerous contracts with multiple performance obligations. For these contracts, we\nallocate the transaction price to each performance obligation based on the relative standalone selling price of the\nproduct or service underlying each performance obligation. The standalone selling price represents the amount for\nwhich we would sell the product or service to a customer on a standalone basis (i.e., not sold as a bundled sale with\nany other products or services). The allocation of transaction price among separate performance obligations may\nimpact the timing of revenue recognition but will not change the total revenue recognized on the contract.\nority of our revenue is derived from contracts with the U.S. Government, including foreign\nmilitary sales contracts. These contracts are subject to the Federal Acquisition Regulation (“\nFAR\n”) and the prices of\nour contract deliverables are typically based on our estimated or actual costs plus margin. As a result, the\nstandalone selling prices of the products and services in these contracts are typically equal to the selling prices\nstated in the contract, thereby eliminating the need to allocate (or reallocate) the transaction price to the multiple\nperformance obligations. In our non-U.S. Government contracts, when standalone selling prices are not directly\nobservable, we also generally use the expected cost plus margin approach to determine standalone selling price. In\ndetermining the appropriate margin under the cost plus margin approach, we consider historical margins on similar\nproducts sold to similar customers or within similar geographies where objective evidence is available. We may also\nconsider our cost structure and profit objectives, the nature of the proposal, the effects of customization of pricing,\nour practices used to establish pricing of bundled products, the expected technological life of the product, margins\nearned on similar contracts with different customers and other factors to determine the appropriate margin.\nDefined Benefit Plans\nCertain of our current and former employees participate in defined benefit plans in the U.S., Canada and United\nKingdom, which are sponsored by L3Harris. See\nNote 9: Retirement Benefits\nin the Notes for additional information\nrelated to our defined benefit plans.\nSignificant Assumptions\nThe determination of the projected benefit obligation (“\nPBO\n”) and recognition of net\nrelated to defined benefit plans depend on various assumptions, including discount rates, expected return on plan\nassets, rate of future compensation increases, mortality, termination and other factors.\nWe develop assumptions using relevant experience, in conjunction with market-related data for each plan.\nAssumptions are reviewed annually with third-party experts and adjusted as appropriate.\n_____________________________________________________________________\nfrom our assumptions are accumulated and generally amortized for each plan to the extent required over the\nestimated future life expectancy or, if applicable, the average remaining service period of the plan’s active\nThe following table presents the significant assumptions used to determine the PBO:\nThe following table presents the significant assumptions used to determine net periodic benefit income:\nDiscount rate to determine service cost\nDiscount rate to determine interest cost\nExpected return on plan assets\nThe discount rate is used to calculate the present value of expected future benefit payments at\nthe measurement date. An increase in the discount rate decreases the\nPBO\nand generally decreases\nbenefit income. A decrease in the discount rate increases the\nPBO\nand generally increases our net periodic benefit\nThe discount rate assumption is based on current investment yields of high-quality fixed income\ninvestments during the retirement benefits maturity period. The pension discount rate is determined by considering\nan interest rate yield curve comprising AAA/AA bonds, with maturities between zero and thirty years, developed by\nthe plan’s actuaries. Annual benefit payments are then discounted to present value using this yield curve to develop\na single discount rate matching the plan’s characteristics.\nSensitivity Analysis\nThe sensitivity of the PBO to changes in the discount rate varies depending on the\nmagnitude and direction of the change in the discount rate. We estimate that a\nchange in the discount\nrate of our combined U.S. defined benefit pension plans would have the following impact on our PBO at\nand net periodic benefit income for the next twelve months:\nPBO\nNet periodic benefit income\nExpected Return on Plan Assets.\n\nSubstantially all of our plan assets are managed on a commingled basis in a\nmaster investment trust. We determine our expected return on plan assets by evaluating both historical returns and\nestimates of future returns. Specifically, we consider the plan’s actual historical annual return on assets over the\npast 15, 20 and 25 years and historical broad market returns over long-term timeframes based on our strategic\nallocation, which is detailed in\nNote 9: Retirement Benefits\nin the Notes. Future returns are based on independent\nestimates of long-term asset class returns. Based on this approach, the weighted average long-term annual rate of\nreturn on assets was estimated to be\nSensitivity Analysis.\nchange in the expected return on plan assets of our\ncombined U.S. defined benefit pension plans would have the following impact on net periodic benefit income for the\nNet periodic benefit income\nWe test our goodwill for impairment annually as of the first business day of our fourth fiscal quarter, which was\n, or under certain circumstances more frequently, such as when events or\ncircumstances indicate there may be impairment or when we reorganize our reporting structure such that the\ncomposition of one or more of our reporting units is affected. We test goodwill for impairment at a level within the\nCompany referred to as the reporting unit, which is our business segment level or one level below the business\n_____________________________________________________________________\nsegment. Some of our segments are comprised of several reporting units. Allocation of goodwill to several reporting\nunits could make it more likely that we will have an impairment charge in the future. An impairment charge to any\none of our reporting units could have a material impact on our financial condition and results of operations.\nThe process of evaluating the potential impairment of goodwill is highly subjective and requires significant\njudgment. To test goodwill for impairment, we may perform both qualitative and quantitative assessments. If we\nelect to perform a qualitative assessment for a certain reporting unit, we evaluate events and circumstances\nimpacting the reporting unit to determine the probability that goodwill is impaired. If we determine it is more-likely-\nthan-not that the fair value of the reporting unit is less than its carrying amount, we perform a quantitative\nOur qualitative assessment of the recoverability of goodwill, whether performed annually or based on specific\nevents or circumstances, considers various macroeconomic, industry-specific and company-specific factors. These\nfactors include: (i) deterioration in the general economy; (ii) deterioration in the environment in which we operate;\n(iii) increase in materials, labor or other costs; (iv) negative or declining cash flows; (v) changes in management,\nchanges in strategy or significant litigation; (vi) changes in the composition or carrying amount of net assets or an\nexpectation of disposing all or a portion of the reporting unit; or (vii) a sustained decrease in share price.\nIf we perform a quantitative assessment for a certain reporting unit, we calculate the fair value of that reporting\nunit and compare the fair value to the reporting unit’s net book value. We estimate fair values of our reporting units\nbased on projected cash flows. Values derived from projected cash flows are corroborated through review of\nrevenue and/or earnings multiples applied to the latest twelve months’ revenue and earnings of our reporting units.\nProjected cash flows are based on our best estimate of future revenues, operating costs and",
  "item2_clean": null
}