{
  "source_file": "lii-20241231.htm",
  "form_type": "10-K",
  "item1_clean": "These products are distributed primarily through commercial contractors and directly to national account customers. We believe the success of our products is attributable to their efficiency, impact to the environment, design flexibility, total cost of ownership, ease of service, and advanced control technology.\nNational Account Services\n. National Account Service (“NAS”) provides installation, service and preventive maintenance for commercial HVAC national account customers in the United States and Canada.\nAES\nIn October 2023, we completed the acquisition of AES Industries, Inc. and AES Mechanical Service Group, Inc. (collectively, “AES”) to the Building Climate Solutions segment. AES is a company dedicated to service and sustainability in the light commercial markets across North America. AES manufactures curbs, curb adapters, drop box diffusers and also offers HVAC recycling and salvage services, as well as focusing on multi-facility HVAC replacement for expired mechanical assets.\nRefrigeration Products.\nWe manufacture and market equipment for the North American commercial refrigeration markets under the Heatcraft Worldwide Refrigeration name. We sell these products to distributors, installing contractors, engineering design firms, original equipment manufacturers and end-users.\nOur commercial refrigeration products include condensing units, unit coolers, fluid coolers, air-cooled condensers, air handlers and refrigeration rack systems. These products preserve food and other perishables in supermarkets, convenience stores, restaurants, warehouses and distribution centers. In addition, our products are used to cool a wide variety of industrial processes, including data centers, machine tooling, and other critical cooling applications. We routinely provide application engineering for consulting engineers, contractors, store planners, end customers and others to support the sale of commercial refrigeration products.\nIn addition, we own a 50% interest in a joint venture in Mexico that produces unit coolers, air-cooled condensers, condensing units, compressors and compressorized racks of the same design and quality as those manufactured by our U.S. business. This joint venture product line is complemented with imports from the U.S., which are sold through the joint venture’s distribution network.\nWe own a 49.9% interest in a joint venture with Samsung that distributes Samsung ductless AC and heat pump products in the U.S. and Canada as well as \"Lennox powered by Samsung\" branded products through Lennox stores and direct-to-dealer network. Results are reported in either Home Comfort Solutions or Building Climate Solutions based on product type.\n\nLennox offers a full spectrum of cooling, heating, indoor air quality and refrigeration products to meet the energy-efficient climate-control needs of residential and commercial customers across North America. We are advancing our market position through a balanced approach that includes organic growth and selective strategic investments. By effectively managing pricing and costs, we are driving margin expansion and profitability. Our success is rooted in a three-phase self-help transformation plan that continues to guide our progress over the coming years.\nDifferentiated Growth.\nWe are investing in our sales force to expand customer touchpoints, enhancing the overall customer experience through digital innovations and anticipating improved output from our new commercial HVAC factory in Mexico. Additionally, we are focused on improving the fulfillment rate of HVAC equipment and driving higher attachment rates for parts and accessories, delivering a seamless and comprehensive solution that enhances customer satisfaction.\nResilient Profit Margins\n. We are committed to sustaining resilient margins through pricing excellence, enhanced productivity from higher volumes, material cost reductions, and a favorable mix influenced by regulatory transitions. Together, these initiatives fortify our financial foundation and long-term competitiveness.\nExecution Management\n. We will leverage the Lennox Unified Management System to streamline our operations and set clear priorities. A focused strategy, investments in heat pump growth, and enhancements to our distribution network further exemplify our commitment to consistent management execution.\nMarketing and Distribution\nWe utilize multiple channels of distribution and offer different brands at various price points in order to better penetrate the HVACR markets. Our products and services are sold through a combination of direct sales, distributors and company-owned parts and supplies stores. Dedicated sales forces and manufacturers’ representatives are deployed across our business segments and brands in a manner designed to maximize our ability to service each distribution channel. To optimize enterprise-wide effectiveness, we have active cross-functional and cross-organizational teams coordinating approaches to pricing, product design, distribution and national account customers.\nThe North American residential heating and cooling market provides an example of the competitive strength of our marketing and distribution strategy. We use three distinct distribution approaches in this market: the company-owned distribution system, the independent distribution system and direct sales to end-users. We distribute our “Lennox” brands in a company-owned process directly to independent dealers that install these heating and cooling products. We distribute our “Armstrong Air,” “Ducane,” “Air-Ease,” “Concord,” “MagicPak” and “ADP Advanced Distributor Products” brands through the traditional independent distribution process pursuant to which we sell our products to distributors who, in turn, sell the products to installing contractors. We also sell our products through our Lennox Stores.\n\nWe are a global leader in energy-efficient climate-control solutions. We design, manufacture and market a broad range of products for the heating, ventilation, air conditioning and refrigeration (“HVACR”) markets. We have leveraged our expertise to become an industry leader known for innovation, quality and reliability. Our products and services are sold through multiple distribution channels under various brand names. The Company was founded in 1895, in Marshalltown, Iowa, by Dave Lennox, the owner of a machine repair business for railroads. He designed and patented a riveted steel coal-fired furnace, which led to numerous advancements in heating, cooling and climate control solutions.\nOur two business segments, Home Comfort Solutions and Building Climate Solutions, the key products, services and well-known product and brand names within each segment and net sales in 2024 by segment are shown in the table below. The Corporate and Other segment previously held our European operations, which were successfully divested in the fourth quarter of 2023. Corporate and Other was excluded from the table below as there were no sales in 2024. Segment financial data for 2024, 2023 and 2022, including financial information about foreign and domestic operations, is included in Note 3 of the Notes to our Consolidated Financial Statements in “Item 8. Financial Statements and Supplementary Data” and is incorporated herein by reference.\nProduct and Brand Names\nNet Sales (in millions)\nHome Comfort Solutions\nFurnaces, air conditioners, heat pumps, packaged heating and cooling systems, indoor air quality equipment, comfort control products, replacement parts and supplies\nLennox, Dave Lennox Signature Collection, Armstrong Air, Ducane, AirEase, Concord, MagicPak, ADP Advanced Distributor Products, Allied, Elite Series, Merit Series, Comfort Sync, Healthy Climate, Healthy Climate Solutions, iComfort, ComfortSense and Lennox Stores\nBuilding Climate Solutions\nUnitary heating and air conditioning equipment, applied systems, controls, installation and service of commercial heating and cooling equipment, variable refrigerant flow commercial products, curb, curb adapters, drop box diffusers, HVAC recycling and salvage service, condensing units, unit coolers, fluid coolers, air cooled condensers, air handlers, process chillers, controls, compressorized racks\nLennox, Model L, CORE, Enlight, Xion, Energence, Prodigy, Strategos, Raider, Lennox VRF, Lennox National Account Services, Allied Commercial, Elite, AES Industries, AES Mechanical, AES Recycle, Heatcraft Worldwide Refrigeration, Bohn, MAGNA, Larkin, Climate Control, Chandler Refrigeration, IntelliGen and Interlink\n\nProducts and Services\nHome Comfort Solutions\nHeating & Cooling Products\n. We manufacture and market a broad range of heat pumps, furnaces, air conditioners, packaged heating and cooling systems, equipment and accessories to improve indoor air quality, comfort control products, replacement parts and supplies and related products for both the residential replacement and new construction markets in North America. These products are available in a variety of designs and efficiency levels and at a range of price points, and are intended to provide a complete line of home comfort solutions. We believe that by maintaining a broad product line marketed under multiple brand names, we can address different market segments and penetrate multiple distribution channels.\nThe “Lennox” business and brands (“Dave Lennox Signature Collection,” “Elite Series,” “Merit Series,” “iComfort,” “ComfortSense” and “Healthy Climate Solutions”) are sold directly to independent installing dealers, making us one of the largest wholesale distributors of residential heating, ventilation, and air conditioning products in North America. We operate a network of Lennox Stores across the United States and Canada. These stores provide an easy access solution for contractors and independent dealers to obtain universal service and replacement parts, supplies, convenience items, tools, Lennox equipment and OEM parts.\nThe Allied Air Enterprise business and brands (“Armstrong Air,” “AirEase,” “Concord,” “Ducane,” “Allied,” and “MagicPak”) include a full line of heating, ventilation and air conditioning products and are sold through independent wholesale distributors in the U.S. and Canada. The Allied Air Enterprise business also sells a full line of heating, ventilation and cooling equipment through private label brands.\nThe Advanced Distributor Products (“ADP”) business and brand (“ADP Advanced Distributor Products”) sells evaporator coils, air handlers and unit heaters to independent HVAC wholesale distributors across the U.S. and Canada.\nBuilding Climate Solutions\nHeating and Cooling Products.\nIn North America, we manufacture and sell unitary heating and cooling equipment used in light commercial applications, such as low-rise office buildings, restaurants, retail centers, distribution, churches and schools.\n\nOur sales and related segment profit tend to be seasonally higher in the second and third quarters of the year because summer is the peak season for sales of air conditioning equipment and services in the U.S. and Canada. For the same reason, our working capital needs are generally greater in the first and second quarters, and we generally have higher operating cash inflows in the third and fourth quarters.\nHVAC markets are driven by seasonal weather patterns. HVAC products and services are sold year round, but the volume and mix of product sales and services change significantly by season. The industry generally ships roughly twice as many units during June as it does in December. Overall, cooling equipment represents a substantial portion of the annual HVAC market. Between the heating season (roughly November through February) and cooling season (roughly May through August) are periods commonly referred to as “shoulder seasons” when the distribution channel transitions its buying patterns from one season to the next. These seasonal fluctuations in mix and volume drive our sales and related segment profit, resulting in some",
  "item7_clean": "The demand for our products and services is seasonal and can be significantly impacted by the weather. Warmer than normal summer temperatures generate demand for replacement air conditioning and refrigeration products and services, and colder than normal winter temperatures have a similar effect on heating products and services. Conversely, cooler than normal summers and warmer than normal winters depress the demand for HVACR products and services. In addition to weather, demand for our products and services is influenced by national and regional economic and demographic factors, such as interest rates, the availability of financing, regional population and employment trends, new construction, general economic conditions and\nconsumer spending habits and confidence. A substantial portion of the sales in each of our business segments is attributable to replacement business, with the balance comprised of new construction business.\nThe principal elements of cost of goods sold are components, raw materials, factory overhead, labor, estimated costs of warranty expense and freight and distribution costs. The principal raw materials used in our manufacturing processes are steel, aluminum and copper. In recent years, pricing volatility for these commodities and related components has impacted us and the HVACR industry in general. We seek to mitigate the impact of certain commodity price volatility through a combination of pricing actions, vendor contracts, improved production efficiency and cost reduction initiatives. We also partially mitigate volatility in the prices of these commodities by entering into futures contracts and fixed forward contracts.\nFinancial Highlights\nNet sales increased $359 million, or 7%, to $5,341 million in 2024 from $4,982 million in 2023.\nOperating income in 2024 was $1,035 million compared to $790 million in 2023.\nNet income in 2024 increased to $807 million from $590 million in 2023.\nDiluted earnings per share was $22.54 per share in 2024 compared to $16.54 per share in 2023.\nWe generated $946 million of cash flow from operating activities in 2024 compared to $736 million in 2023.\nWe returned $160 million to shareholders through dividend payments in 2024.\nHome Comfort Solutions\nsegment experienced an 11% increase in net sales and a\nincrease in segment profit in\nprimarily driven by favorable price and mix and higher sales volumes. Our\nBuilding Climate Solutions\nsegment saw an increase in net sales of 17% and a\nincrease in segment profit in\nprimarily due to favorable price and mix. As a result of the transition to low GWP refrigerants, customers pre-purchased R-410A equipment, which is estimated to have positively impacted revenue by $125 million.\nResults of Operations\nThe following table provides a summary of our financial results, including information presented as a percentage of net sales (dollars in millions):\nFor the Years Ended December 31,\nSelling, general and administrative expenses\nLosses (gains) and other expenses, net\nRestructuring charges\nImpairment on assets held for sale\nLoss (gain) on sale of businesses\nIncome from equity method investments\nYear Ended December 31, 2024 Compared to Year Ended December 31, 2023 - Consolidated Results\nNet sales increased 7% in 2024 compared to 2023 as higher sales volumes of 8%, favorable price and mix of 3% and an increase of sales volumes of 1% from our AES acquisition were partially offset by a 5% reduction in sales due to the fourth quarter 2023 sale of our European businesses.\nGross profit margins for 2024 increased 210 basis points (“bps”) to 33.2% compared to 31.1% in 2023. Gross profit margin increased 250 bps from higher price and favorable mix, which was partially offset by 40 bps from higher freight and distribution costs.\nSelling, General and Administrative Expenses\nSG&A expenses increased by $25 million in 2024 compared to 2023. As a percentage of net sales, SG&A expenses decreased 50 bps from 14.2% to 13.7% in the same periods, primarily due to higher employee-related costs including increased incentive compensation, which was partially offset by a $62 million reduction in SG&A expenses from our 2023 divestiture of our European businesses.\n\nFair value is the price that would be received to sell an asset or the price paid to transfer a liability in an orderly transaction between market participants at the measurement date. Fair value is based upon the transparency of inputs to the valuation of an asset or liability as of the measurement date and requires consideration of our creditworthiness when valuing certain liabilities. Our framework for measuring fair value is based on a three-level hierarchy for fair value measurements.\nThe three-level fair value hierarchy for disclosure of fair value measurements is defined as follows:\ninstruments in active markets at the measurement date.\ninstruments in active markets; quoted prices for identical or similar instruments in markets that are not active; and model-derived valuations in which all significant inputs and significant value drivers are\nin active markets at the measurement date and for the anticipated term of the instrument.\n- Valuations derived from valuation techniques in which one or more significant inputs or significant value drivers are\ninputs that reflect the reporting entity’s own assumptions about the assumptions market participants would use in pricing the asset or liability developed based on the best information available in the circumstances.\nWhere available, the fair values were based upon quoted prices in active markets. However, if quoted prices were not available, then the fair values were based upon quoted prices for similar assets or liabilities or independently sourced market parameters, such as credit default swap spreads, yield curves, reported trades, broker/dealer quotes, interest rates and benchmark securities. For assets and liabilities without observable market activity, if any, the fair values were based upon discounted cash flow methodologies incorporating assumptions that, in our judgment, reflect the assumptions a marketplace participant would use. Valuation adjustments to reflect either party’s creditworthiness and ability to pay were incorporated into our valuations, where appropriate, as of December 31, 2024 and 2023, the measurement dates. See Note 16 of the Notes to the Consolidated Financial Statements for more information on the assets and liabilities measured at fair value.\nCommodity Price Risk\nWe enter into commodity futures contracts to stabilize prices expected to be paid for raw materials and parts containing high copper and aluminum content. These contracts are for quantities equal to or less than quantities expected to be consumed in future production. Fluctuations in metal commodity prices impact the value of the futures contracts that we hold. When metal commodity prices rise, the fair value of our futures contracts increases. Conversely, when commodity prices fall, the fair value of our futures contracts decreases. Information about our exposure to metal commodity price market risks and a sensitivity analysis related to our metal commodity hedges is presented below (in millions):\nNotional amount (pounds of aluminum and copper)\nCarrying amount and fair value of net asset\nChange in fair value from 10% change in forward prices\nRefer to Note 9 of the Notes to the Consolidated Financial Statements for additional information regarding our commodity futures contracts.\nOur results of operations can be affected by changes in interest rates due to variable rates of interest on our debt facilities, cash, cash equivalents and short-term investments. A 10% adverse movement in the levels of interest rates across the entire yield curve would have resulted in an increase to pre-tax interest expense of approximately $0.9 million, $2.3 million and $1.7 million for the years ended December 31, 2024, 2023 and 2022, respectively.\nFrom time to time, we may use an interest rate swap hedging strategy to eliminate the variability of cash flows in a portion of our interest payments. This strategy, when employed, allows us to fix a portion of our interest payments when interest rates are low. As of December 31, 2024 and 2023, no interest rate swaps were in effect.\nForeign Currency Exchange Rate Risk\nOur results of operations are affected by changes in foreign currency exchange rates. Net sales and expenses in foreign currencies are translated into U.S. dollars for financial reporting purposes based on the average exchange rate for the period. Our primary exposure to foreign currencies are the Canadian dollar, Mexican Peso, and the Euro. During 2024, 2023 and 2022, net sales from outside the U.S. represented 6.0%, 11.3% and 11.4%, respectively, of our total net sales. For the years ended December 31, 2024, 2023, and 2022, foreign currency transaction gains and losses did not have a material impact to our results\nof operations. A 10% change in foreign exchange rates would have had an estimated $2.6 million, $5.6 million and $3.5 million impact to net income for the years ended December 31, 2024, 2023 and 2022, respectively.\nWe seek to mitigate the impact of currency exchange rate movements on certain short-term transactions by periodically entering into foreign currency forward contracts. By entering into forward contracts, we lock in exchange rates that would otherwise cause losses should the U.S. dollar appreciate and gains should the U.S. dollar depreciate. Refer to Note 9 of the Notes to the Consolidated Financial Statements for additional information regarding our foreign currency forward contracts.\nCritical Accounting Estimates\nA critical accounting estimate is one that requires difficult, subjective or complex estimates and assessments and is fundamental to our results of operations and financial condition. The following describes our critical accounting estimate related to product warranties and product-related contingencies and how we develop our judgments, assumptions and estimates about future events and how such policies can impact our financial statements. This discussion and analysis should be read in conjunction with our Consolidated Financial Statements and related Notes in “Item 8. Financial Statements and Supplementary Data.”\nProduct Warranties and Product-Related Contingencies\nThe estimate of our liability for future warranty costs requires us to make assumptions about the amount, timing and nature of future product-related costs. Some of the warranties we issue extend 10 years or more in duration and a relatively small adjustment to an assumption may have a significant impact on our overall liability.\nFrom time to time, we may also incur costs to repair or replace installed products experiencing quality issues in order to satisfy our customers and protect our brand. These product-related costs may not be covered under our warranties and are not covered by insurance.\nWe periodically review the assumptions used to determine the liabilities for product warranties and product-related contingencies and we adjust our assumptions based upon factors such as actual failure rates and cost experience. Numerous factors could affect actual failure rates and cost experience, including the amount and timing of new product introductions, changes in manufacturing techniques or locations, components or suppliers used. Should actual costs differ from our estimates, we may be required to adjust the liabilities and to record expense in future periods. See Note 5 in the Notes to the Consolidated Financial Statements for more information on our product warranties and product-related contingencies.\nRecent Accounting Pronouncements\nSee Note 2 in the Notes to the Consolidated Financial Statements for disclosure of recent accounting pronouncements and the potential impact on our financial statements and disclosures.\n\nLosses (Gains) and Other Expenses, Net\nLosses (gains) and other expenses, net for 2024 and 2023 included the following (in millions):\nFor the Years Ended December 31,\nRealized losses on settled future contracts\nForeign currency exchange losses (gains)\nGain on disposal of fixed assets\nOther operating (income) loss\nNet change in unrealized losses (gains) on unsettled futures contracts\nEnvironmental liabilities and special litigation charges\nLosses and other expenses, net (pre-tax)\nThe net change in unrealized (gains) losses on unsettled futures contracts was due to changes in commodity prices relative to the unsettled futures contract prices. For more information on our derivatives, see Note 9 in the Notes to the Consolidated Financial Statements. Foreign currency exchange losses increased in 2024 primarily due to changes in foreign exchange rates in our primary markets. Environmental liabilities and special legal contingency charges in 2024 relate to estimated remediation costs at some of our facilities and outstanding legal settlements including asbestos. Refer to Note 5 in the Notes to the Consolidated Financial Statements for more information on litigation, including asbestos-related litigation, and environmental liabilities.\nRestructuring Charges\nThere were no restructuring charges in 2024 compared to $3.1 million in 2023. Charges in 2023 were related to the reorganization or removal of duplicative headcount and infrastructure. For more information on our restructuring activities, see Note 7 in the Notes to the Consolidated Financial Statements.\nWe performed a qualitative impairment analysis and noted no indicators of goodwill impairment for the year ended December 31, 2024. Refer to Note 9 in the Notes to the Consolidated Financial Statements for more information on goodwill. In 2023, we recorded a $2.3 million impairment of goodwill related to our agreement to sell our European commercial HVAC and refrigeration businesses.\nWe did not have any impairments of assets in 2024. In the third quarter of 2023, we recorded a $22.6 million impairment of property, plant and equipment related to our agreement to sell our European commercial HVAC and refrigeration businesses.\nIncome from Equity Method Investments\nInvestments over which we do not exercise control but have significant influence are accounted for using the equity method of accounting. Income from equity method investments was $8 million in 2024 consistent with 2023.\nInterest Expense, net\nNet interest expense of $39 million in 2024 decreased from $52 million in 2023 primarily due to decreased borrowings on our revolving credit facility as a result of increased cash flow.\nThe income tax provision was $187 million in 2024 compared to $147 million in 2023, and the effective tax rate was 18.8% in 2024 compared to 20.0% in 2023. The 2024 and 2023 effective tax rates differ from the statutory rate of 21% primarily due to lower foreign tax rates. Refer to Note 12 in the Notes to the Consolidated Financial Statements for more information on income taxes.\nYear Ended December 31, 2024 Compared to Year Ended December 31, 2023 - Results by Segment\nHome Comfort Solutions\nThe following table presents our Home Comfort Solutions segment’s net sales and profit for 2024 and 2023 (dollars in millions):\nFor the Years Ended December 31,\n\nNet sales increased 11% in 2024 compared to 2023 due to a 7% increase in volume and a 4% increase in price and mix.\nSegment profit in 2024 increased $150 million compared to 2023 primarily due to $122 million from higher price and favorable mix, $90 million from higher sales volumes and $10 million from factory productivity and favorable product costs, including LIFO. Partially offsetting these increases were $37 million from higher SG&A costs, $20 million from higher freight and distribution costs, $9 million from unfavorable foreign currency, and $6 million from miscellaneous other items.\nBuilding Climate Solutions\nThe following table presents our Building Climate Solutions segment’s net sales and profit for 2024 and 2023 (dollars in millions):\nFor the Years Ended Decem",
  "item2_clean": null
}