{
  "source_file": "lin-20250930.htm",
  "form_type": "10-Q",
  "item1_clean": null,
  "item7_clean": null,
  "item2_clean": "Reported operating profit for the third quarter of 2025 was $2,367 million, or 27.5% of sales, 13% above the prior year. The reported year-over-year increase was primarily driven by higher pricing and productivity initiatives and lower cost reduction program and other charges, which more than offset adverse impacts from cost inflation. The reported effective tax rate (\"ETR\") was 18.0% in the third quarter 2025 versus 24.1% in the third quarter 2024. Diluted earnings per share (\"EPS\") was $4.09, or 27% above EPS of $3.22 in the third quarter of 2024, primarily due to higher net income - Linde plc and lower diluted shares outstanding.\nIn the third quarter of 2025, adjusted operating profit of $2,558 million, or 29.7% of sales, was 3% higher as compared to 2024, driven by higher pricing and productivity initiatives partially offset by cost inflation. The adjusted ETR was 22.7% in the third quarter 2025 versus 23.6% in the respective 2024 quarter. On an adjusted basis, EPS was $4.21, 7% above the 2024 adjusted EPS of $3.94, driven by higher adjusted net income - Linde plc and lower diluted shares outstanding.\nLinde provides quarterly updates on operating results, material trends that may affect financial performance, and financial guidance via quarterly earnings releases and investor teleconferences. These updates are available on the company’s website, www.linde.com, but are not incorporated herein.\nResults of operations\nThe changes in consolidated sales compared to the prior year are attributable to the following:\n\nOther Financial Data\nEBITDA was $3,364 million for the third quarter of 2025 as compared to $3,084 million in the respective 2024 period. EBITDA was $9,825 million for the nine months ended September 30, 2025 as compared to $9,363 million in the respective 2024 period.\nAdjusted EBITDA increased to $3,377 million for the third quarter of 2025 from $3,253 million in the respective 2024 period. Adjusted EBITDA increased to $9,941 million for the nine months ended September 30, 2025 from $9,575 million in the respective 2024 period. The increase on both a reported and adjusted basis was driven by higher net income - Linde plc versus prior year.\nSee the \"Non-GAAP Measures and Reconciliations\" section for definitions and reconciliations of these adjusted non-GAAP measures to reported GAAP amounts.\nOther Comprehensive Income (Loss)\nOther comprehensive loss for the third quarter was $165 million and income was $507 million for the nine months ended September 30, 2025. The loss in the quarter and income in the year-to-date periods resulted primarily from currency translation adjustments of $167 million and $466 million, respectively. The translation adjustments reflect the impact of translating local currency foreign subsidiary financial statements to U.S. dollars, and are largely driven by the movement of the U.S. dollar against major currencies, including the Euro and British pound. See the \"Currency\" section of the MD&A for exchange rates used for translation purposes and Note 10 to the condensed consolidated financial statements for a summary of the currency translation adjustment component of accumulated other comprehensive income (loss) by segment.\nThe following summary of sales and operating profit by segment provides a basis for the discussion that follows. Linde plc evaluates the performance of its reportable segments based on operating profit, excluding items not indicative of ongoing business trends.\n\nNON-GAAP MEASURES AND RECONCILIATIONS\n(Millions of dollars, except per share data)\nThe following non-GAAP measures are intended to supplement investors’ understanding of the company’s financial information by providing measures which investors, financial analysts and management use to help evaluate the company’s operating performance and liquidity. Items which the company does not believe to be indicative of on-going business trends are excluded from these calculations so that investors can better evaluate and analyze historical and future business trends on a consistent basis. Definitions of these non-GAAP measures may not be comparable to similar definitions used by other companies and are not a substitute for similar GAAP measures.\nQuarter Ended September 30,\nNine Months Ended September 30,\nAdjusted Operating Profit and Operating Margin\nReported operating profit\nAdd: Cost reduction program and other charges\nAdd: Purchase accounting impacts - Linde AG (c)\nAdjusted operating profit\nReported percentage change\nAdjusted percentage change\nReported operating margin\nAdjusted operating margin\nAdjusted Depreciation and amortization\nReported depreciation and amortization\nLess: Purchase accounting impacts - Linde AG (c)\nAdjusted depreciation and amortization\nAdjusted Other Income (Expense) - net\nReported Other Income (Expense) - net\nAdd: Purchase accounting impacts - Linde AG (c)\nAdjusted Other Income (Expense) - net\nAdjusted Net Pension and OPEB Cost (Benefit), Excluding Service Cost\nReported net pension and OPEB cost (benefit), excluding service cost\nAdd: Pension settlement charges\nAdjusted Net Pension and OPEB cost (benefit), excluding service costs\nAdjusted Interest Expense - Net\nReported interest expense - net\nAdd: Purchase accounting impacts - Linde AG (c)\n\nItem 2. Management’s Discussion and Analysis of Financial Condition and Results of Operations (\"MD&A\")\nThroughout MD&A, the company provides adjusted operating results exclusive of certain items such as Cost reduction program and other charges, purchase accounting impacts of the Linde AG merger, and pension settlement charges. Adjusted amounts are non-GAAP measures which are intended to supplement investors’ understanding of the company’s financial information by providing measures which investors, financial analysts and management find useful in evaluating the company’s operating performance. Items which the company does not believe to be indicative of on-going business performance are excluded from these calculations so that investors can better evaluate and analyze historical and future business trends on a consistent basis. In addition, operating results, excluding these items, is important to management's development of annual and long-term employee incentive compensation plans. Definitions of these non-GAAP measures may not be comparable to similar definitions used by other companies and are not a substitute for similar GAAP measures.\nThe non-GAAP measures and reconciliations are separately included in a later section in the MD&A titled \"Non-GAAP Measures and Reconciliations.\"\n\nQuarter Ended September 30,\nNine Months Ended September 30,\n(Millions of dollars, except per share data)\nCost of sales, exclusive of depreciation and amortization\nAs a percent of sales\nSelling, general and administrative\nAs a percent of sales\nDepreciation and amortization\nCost reduction program and other charges\nOther income (expense) - net\nInterest expense - net\nNet pension and OPEB cost (benefit), excluding service cost\nIncome from equity investments\nNoncontrolling interests\nNet Income – Linde plc\nDiluted earnings per share\nDiluted shares outstanding\nAdjusted Amounts (a)\nDepreciation and amortization\nNet Income – Linde plc\nDiluted earnings per share\nOther Financial Data (a)\nEBITDA\nAdjusted Amounts and Other Financial Data are non-GAAP performance measures. A reconciliation of reported amounts to adjusted amounts can be found in the \"Non-GAAP Measures and Reconciliations\" section of this MD&A.\nIn the third quarter of 2025, Linde's sales were $8,615 million, 3%, above the prior year. Sales grew 2% from higher price attainment. Acquisitions increased sales by 1% in the third quarter. Currency translation increased sales by 1% in the quarter driven primarily by the strengthening of the Euro and British pound against the U.S dollar. Cost pass-through, representing the contractual billing of energy cost variances primarily to onsite customers, was flat in the quarter. Engineering sales decreased by 1% in the quarter. Volumes were flat in the quarter versus the 2024 respective period, as base volume declines were largely offset by new project start-ups.\n\nFactors Contributing to Changes - Sales\nAcquisitions/divestitures\nSales increased by 3% for the third quarter of 2025 and 2% for the nine months ended September 30, 2025, versus the respective 2024 periods. Higher price attainment increased sales by 2% in the quarter and nine months ended September 30, 2025. Acquisitions increased sales by 1% in the quarter and nine months ended September 30, 2025. Currency translation increased sales by 1% in the quarter, primarily driven by the strengthening of the Euro and British pound against the\n. In the nine months ended September 30, 2025, currency translation impact on sales was flat. Cost pass-through was flat in both the quarter and nine months ended September 30, 2025. Volumes were flat in the quarter and decreased sales by 1% for the nine months ended September 30, 2025, as base volume declines were partially offset by new project start-ups. Engineering sales decreased by 1% in the quarter and was flat for the nine months ended September 30, 2025.\nCost of sales, exclusive of depreciation and amortization\nCost of sales, exclusive of depreciation and amortization, increased $23 million, or 1%, for the third quarter of 2025 primarily due to cost inflation, partially offset by productivity gains, and increased $19 million for the nine months ended September 30, 2025. Cost of sales, exclusive of depreciation and amortization, was 50.8% and 50.9% of sales for the third quarter and nine months ended September 30, 2025, respectively, versus 52.1% and 51.9% for the respective 2024 periods. The decrease as a percentage of sales in the quarter and year-to-date periods was primarily due to higher pricing and productivity gains.\n\n10.4% of third quarter sales and 10.1% of sales for the nine months ended September 30, 2025 versus 9.8% and 10.2% of sales for the respective 2024 periods. Currency "
}