{
  "source_file": "lly-20250930.htm",
  "form_type": "10-Q",
  "item1_clean": null,
  "item7_clean": null,
  "item2_clean": "Revenue increased for the three and nine months ended September 30, 2025, driven by increased volume, partially offset by lower realized prices. The increased volume and lower realized prices during the three and nine months ended September 30, 2025 were primarily driven by Mounjaro and Zepbound.\nNet income and earnings per share for the three and nine months ended September 30, 2025 increased primarily due to higher gross margin, partially offset by increased marketing, selling, and administrative expenses and research and development expenses.\nSee \"Results of Operations\" for additional information.\nClinical Development Pipeline Updates\nOur long-term success depends on our ability to continually discover or acquire, develop, and commercialize innovative new medicines. See “Management’s Discussion and Analysis of Results of Operations and Financial Condition—Executive Overview—Clinical Development Pipeline” in Part II, Item 7 of our Annual Report on\nfor the year ended December 31, 2024 for select new molecular entities (NMEs) and new indication line extension (NILEX) products in Phase 2 or Phase 3 clinical trials or that were submitted for regulatory review or received regulatory approval in the U.S., European Union (EU), or Japan. The following reflects certain developments since our Annual Report on\nfor the year ended December 31, 2024:\nSubmitted our application for tirzepatide for pediatric and adolescent type 2 diabetes to the U.S. Food and Drug Administration (FDA) and European Commission (EC) for approval.\nAnnounced that a Phase 3 trial for tirzepatide for cardiovascular outcomes in type 2 diabetes met the primary endpoint.\nA Phase 3 trial was initiated for tirzepatide for type 1 diabetes.\nWithdrew our U.S. application for tirzepatide for heart failure with preserved ejection fraction.\nInsulin Efsitora Alfa\nSubmitted our application for insulin efsitora alfa for type 2 diabetes to the FDA and EC for approval.\nA Phase 3 trial was initiated for muvalaplin for atherosclerotic cardiovascular disease.\nAnnounced that Phase 3 trials for orforglipron for obesity met their primary and all key secondary endpoints.\nAnnounced that Phase 3 trials for orforglipron for type 2 diabetes met their primary and all key secondary endpoints.\nA Phase 3 trial was initiated for orforglipron for hypertension and overweight or obesity.\nA Phase 3 trial was initiated for orforglipron for osteoarthritis pain of the knee and overweight or obesity.\nA Phase 3 trial was initiated for orforglipron for stress urinary incontinence and overweight or obesity.\nA Phase 3 trial was initiated for retatrutide for chronic low back pain and overweight or obesity.\nJapan's Ministry of Health, Labour and Welfare approved mirikizumab for treatment of Crohn’s disease.\nThe EC approved donanemab for the treatment of early symptomatic Alzheimer's disease.\nImlunestrant (Inluriyo)\nThe FDA approved imlunestrant for treatment of ER+, HER2-, ESR1-mutated advanced or metastatic breast cancer.\nPirtobrutinib (Jaypirca)\nThe EC approved pirtobrutinib for treatment of chronic lymphocytic leukemia.\nAnnounced that Phase 3 trials for pirtobrutinib for chronic lymphocytic leukemia or small lymphocytic leukemia met their primary endpoints.\nA Phase 3 trial was initiated for olomorasib for resected adjuvant non-small cell lung cancer.\nA Phase 3 trial was initiated for olomorasib for unresected adjuvant non-small cell lung cancer.\nThe FDA granted Breakthrough Therapy designation for the treatment of certain newly diagnosed metastatic KRAS G12C-mutant lung cancers. Breakthrough Therapy designation is designed to expedite the development and review of potential medicines that are intended to treat a serious condition when preliminary clinical evidence indicates that the treatment may demonstrate substantial improvement on a clinically significant endpoint(s) over already available therapies.\nTrends Affecting Pharmaceutical Pricing, Reimbursement, and Access and Certain Other Regulatory Developments\nGlobal concern over access to, and affordability of, pharmaceutical products continues to drive debate and action, as well as cost containment efforts by governmental authorities and scrutiny of pricing and access disparities. Cost containment measures include the use of mandated discounts, price reporting requirements, mandated reference prices, restrictive formularies, changes to available intellectual property protections, as well as other efforts.\nReforms, initiatives, and other actions, including those that may stem from political initiatives, periods of uneven economic growth or downturns, or as a result of inflation or deflation, trade and other global disputes and interruptions including related to tariffs, trade protection measures, and similar restrictions, the emergence or escalation of, and responses to, international tension and conflicts, or government budgeting priorities, are expected to continue to result in added pressure on cost, pricing, reimbursement, and access for our products.\nFor example, in May 2025, the U.S. presidential administration issued an executive order intended, in part, to encourage or impose the use of most-favored-nation pricing to tie U.S. prescription drug prices with prices in selected comparably developed nations. In July 2025, we and other pharmaceutical companies received letters from the U.S. presidential administration reiterating certain drug pricing objectives. We and other pharmaceutical manufacturers face uncertainty on the implementation of these objectives, which could result in reduced prices and reimbursement for certain of our or competing products and may significantly impact our business and results of operations. Additionally, in July 2025, the OBBBA was enacted into law. In addition to tax impacts, the OBBBA implements spending cuts to certain federal healthcare programs, including Medicaid and the Affordable Care Act.\nThe Inflation Reduction Act of 2022 (IRA) requires HHS to effectively set prices for certain single-source drugs and biologics reimbursed under Medicare Part B and Part D. Currently, these government prices generally apply beginning at nine years (for medicines approved under a New Drug Application) or thirteen years (for medicines approved under a Biologics License Application) following FDA approval or licensure for the molecule. In August 2023, HHS selected Jardiance, which is part of our collaboration with Boehringer Ingelheim, as one of the first ten medicines subject to government-set prices effective in 2026 and we expect additional of our significant products will be selected in future years. The IRA has, and will continue to, meaningfully influence our business strategies and those of our competitors and could significantly impact our business and consolidated results of operations.\nOther policies, regulations, legislation, or enforcement, including those proposed or pursued by lawmakers, regulators, and other authorities in the U.S. and worldwide, have and may continue to adversely impact our business and consolidated results of operations. For example, the U.S. and other countries have recently imposed or reached alignment on new tariffs. In some cases, imposed tariffs have been paused but may come into effect quickly and unpredictably. While pharmaceuticals are exempt from certain of these tariffs, such exemptions may be terminated or may not apply to any future tariffs. The precise impact of tariffs, trade protection measures, and other restrictions depend on their ultimate scope, timing, and other factors. If enacted, additional restrictions could result in supply disruptions or delays, further increase costs, or otherwise have a negative impact on our business. Given the nature of pharmaceutical regulation and commercialization, we may not be able to share the burden of increased costs from tariffs and related impacts to any meaningful degree.\nPrivate payers and pharmacy benefit managers in the U.S. continue to significantly impact the market for pharmaceuticals through negotiation of access, manufacturer price or rebate concessions and pharmacy reimbursement rates. Restrictive or unfavorable pricing, coverage, or reimbursement determinations for our medicines or product candidates by governments, regulatory agencies, courts, or private actors have and may continue to adversely impact our business and consolidated results of operations. In addition, we are engaged in litigation and investigations related to the 340B program, access to insulin, pricing, product safety, and other matters that, if resolved adversely to us, could negatively impact our business and consolidated results of operations. It is not currently possible to predict the overall potential adverse impact to us or the general pharmaceutical industry of continued cost containment efforts worldwide.\nIn addition, regulatory issues concerning compliance with current Good Manufacturing Practices, quality assurance, safety signals, evolving standards, and increased scrutiny around excipients and potential impurities such as nitrosamines, and similar regulations and standards (and comparable foreign regulations and standards) for our products in some cases lead to regulatory and legal actions, product recalls and seizures, fines and penalties, interruption of production leading to product shortages, import bans or denials of import certifications, inability to realize the benefit of capital expenditures, or delays or denials in new product approvals, line extensions or supplemental approvals of current products pending resolution of the issues, or other negative impacts, any of which result in reputational harm or adversely affect our business.\nAt various times during 2024, demand for our incretin medicines exceeded production. Tirzepatide supply currently exceeds demand in the U.S. Demand in launched markets remains dynamic, and increases or changes in demand, by dose or overall, as well as the complex supply chain, may result in peri"
}