{
  "source_file": "lmt-20241231.htm",
  "form_type": "10-K",
  "item1_clean": "provides long-range infrared detection and tracking of airborne threats and is used on several fixed-wing aircraft. IRST21 is produced for the U.S. Air Force, the U.S. Navy, the National Guard and international customers.\nThe Special Operations Forces Global Logistics Support Services (SOF GLSS) program, which provides logistics support services to the special operations forces of the U.S. military.\nHypersonics programs, which include several programs with the U.S. Air Force and U.S. Army to design, develop and build hypersonic strike weapons.\nThe Javelin program, which is a one-person portable and platform-employable anti-tank and multi-target precision weapon system. Javelin was developed and is currently produced for the U.S. Army and U.S. Marine Corps by a joint venture between Lockheed Martin and RTX Corporation.\nRotary and Mission Systems\nRMS designs, manufactures, services and supports various military and commercial helicopters, sea- and land-based missile defense systems, radar systems, laser systems, sea- and air-based mission and combat systems, command and control mission solutions, cyber solutions, simulation and training solutions, and services and supports surface ships. RMS also has contracts with the U.S. Government for various classified programs. RMS’ major programs include:\nSikorsky helicopter programs such as those related to the Black Hawk, Seahawk\nand CH-53K King Stallion heavy lift helicopters, which are in service with U.S. and foreign governments, the Combat Rescue Helicopter (CRH) utilized by the\nU.S. Air Force, and the VH-92A helicopter for the U.S. Marine One transport mission, Presidential helicopter, of which we made the final aircraft delivery under the program in 2024.\nIntegrated warfare systems and sensors (IWSS) programs such as Aegis Combat System (Aegis) programs that serve as an air and missile defense system for the U.S. Navy and international customers and are also a sea and land-based element of the U.S. missile defense system, and the Littoral Combat Ship (LCS), Multi-Mission Surface Combatant (MMSC), and Canadian Surface Combatant (CSC) programs to provide surface combatant ships for the U.S. Navy and international customers that are designed to operate in shallow waters and the open ocean.\nCommand, control, communications, computers, cyber, combat systems, intelligence, surveillance, and reconnaissance (C6ISR) programs such as the Command, Control, Battle Management and Communications (C2BMC) program to provide an air operations center for the Ballistic Missile Defense System for the U.S. Government, undersea combat systems programs largely serving the U.S. Navy, and Australia's Joint Air Battle Management System (AIR 6500).\nTraining and logistics solutions (TLS) programs such as those providing sustainment services and programs that provide simulators and associated training to U.S. military and foreign government customers.\nSpace is engaged in the research and design, development, engineering and production of satellites, space transportation systems, and strategic, advanced strike, and defensive systems. Space provides network-enabled situational awareness and integrates complex space and ground global systems to help our customers gather, analyze and securely distribute critical intelligence data. Space is also responsible for various classified systems and services in support of vital national security systems. Space’s major programs include:\nThe Next Generation Overhead Persistent Infrared (Next Gen OPIR) system, which provides the U.S. Space Force with enhanced worldwide missile warning capabilities.\nThe Trident II D5 Fleet Ballistic Missile (FBM), a program with the U.S. Navy for the only submarine-launched intercontinental ballistic missile currently in production in the U.S.\nThe Orion Multi-Purpose Crew Vehicle (Orion), a spacecraft for NASA utilizing new technology for human exploration missions beyond low earth orbit.\nNext Generation Interceptor (NGI), a program with the Missile Defense Agency (MDA) utilizing next generation propulsion and sensors to provide homeland missile defense.\nGlobal Positioning System (GPS) III, a program to modernize the GPS satellite system for the U.S. Space Force.\nHypersonics programs, which include several programs with the U.S. Army and U.S. Navy to design, develop and build hypersonic strike weapons.\nThe Transport Layer programs, small satellite capabilities to support proliferated space constellations and early warning communications for the Space Development Agency.\nIntellectual Property\nWe routinely apply for and own a substantial number of U.S. and foreign patents and trademarks related to the products and services we provide. We also develop and own other intellectual property, including copyrights, trade secrets and research, development and engineering know-how, that contributes significantly to our business. In addition, we license intellectual property to and from third parties. The Federal Acquisition Regulation (FAR) and Defense Federal Acquisition Regulation Supplement (DFARS) provide the U.S. Government certain rights in intellectual property, including patents, developed by us and our subcontractors and suppliers in performance of government contracts or with government funding. The U.S. Government may use or authorize others, including competitors, to use such intellectual property. See the discussion of matters related to our intellectual property in Item 1A - Risk Factors. Non-U.S. governments also may have certain rights in patents and other intellectual property developed in performance of our contracts for them. Although our intellectual property rights in the aggregate are important to the operation of our business, we do not believe that any existing patent, license or other intellectual property right is of such importance that its loss or termination would have a material adverse effect on our business taken as a whole.\nResearch and Development\nWe conduct research and development (R&D) activities using our own funds (referred to as company-funded or independent R&D (IR&D)) and under contractual arrangements with our customers (referred to as customer-funded R&D) to enhance existing products and services and to develop future technologies. R&D costs include basic research, applied research, concept formulation studies, design, development, and related test activities. See “Note 1 – Organization and Significant Accounting Policies” (under the caption “Research and development and similar costs”) included in our Notes to Consolidated Financial Statements.\nRaw Materials, Suppliers and Seasonality\nSome of our products require relatively scarce raw materials, such as rare earth minerals. Other important materials and components, on which certain of our products rely, include aluminum, titanium, specialty steel, carbon fiber and advanced microelectronics, such as semiconductors. We rely on other companies to provide materials, components and products and to perform a portion of the services that are provided to our customers under the terms of most of our contracts. Although long-term agreements have historically helped enable a continued supply of these materials, supply chain challenges, supplier disputes, regulatory restrictions, and inflationary pressures have caused certain parts’ shortages, extended lead times and pricing escalations affecting certain sources of supply. We are working with U.S. Government, customers and suppliers on phase-in of regulatory requirements for transitioning the supply chains for rare earth minerals and magnets to secure and compliant sources. The current availability of sources of supply meeting regulatory requirements and the ability to ensure compliance down to the mining level within the timeframes required by the regulations are challenges we continue to work with our multi-tier supplier base. At the same time, we are focused on minimizing the impact of these supply chain challenges on our programs. However, many of the challenges are industry wide or caused by geopolitical events and general economic conditions that are outside of our control. These supplier disruptions have resulted in delays and increased costs and have adversely affected our program performance and operating results. These dynamics are expected to continue in 2025. For more information on the risks related to our suppliers and raw materials, see Item 1A - Risk Factors.\nNo material portion of our business is considered to be seasonal. Various factors, however, can affect the distribution of our sales between accounting periods, including the timing of government awards, the availability of government funding, product deliveries and customer acceptance.\nDue to the specialized nature of our business, our performance depends on identifying, attracting, developing, motivating and retaining a highly skilled workforce with the requisite skills and, in many cases, security clearances, in multiple areas, including engineering, science, manufacturing, information technology, cybersecurity, business development and strategy and management. Our human capital management strategy, which we refer to as our people strategy, tightly aligns to our business needs and technology strategy and focused in 2024 on continuing to accelerate the transformation of our technology for workforce management through investments in upgraded systems and processes, increasing our ability to meet the quickly changing needs of our business, and maintaining a working environment and culture that is supportive of all employees and reflects our core value of “Respect Others.” We structure our people strategy and its implementation to comply with the laws and regulations to which we are subject as a federal government contractor.\nAs of December 31, 2024, we had a highly skilled workforce made up of approximately 121,000 employees, including approximately 70,000 engineers, scientists and information technology professionals. As of December 31, 2024, approximately 93% of our workforce was located in the U.S. and approximately 19% of our employees were covered by collective bargaining agreements with various unions. A number of our existing collective bargaining agreements expire in any given year. Historically, we have been successful in renegotiating expiring agreements without any material disruption of operating activities, and management considers employee and union relations to be good. This has continued to be the case in 2024.\nWe strive to hire, develop and retain the top talent in the industry. During 2024, we hired nearly 9,200 employees and we hired 3,900 college hires and interns during the 2023-24 academic year. An integral part of our people strategy is early career hiring through college and intern pipelines, particularly in technical fields and critical skills areas. We seek to access the broadest possible pool of talent to enable us to meet our hiring needs, and we work to expand Lockheed Martin’s brand awareness and positioning as a best place to work.\nEmployee satisfaction is essential to attracting and retaining top talent, and we regularly conduct employee engagement surveys to gauge employee satisfaction and to understand the effectiveness of our people strategy and assess employees’ intent to stay. We attract and reward our employees by providing market competitive compensation and benefits, including incentives and recognition plans that extend to non-represented employees of all levels in our organization and encourage excellence through our pay-for-performance philosophy. We have a hybrid workforce model that enables flexible working arrangements for employees and teams who can meet our customer commitments remotely, which has helped recruit and retain talent. In addition, we invest in the development of our employees through training, apprenticeship programs, security clearance sponsorship, leadership development plans and offering tuition assistance programs for continuing e",
  "item7_clean": "Management’s Discussion and Analysis of Financial Condition and Results of Operations\nThe following Management’s Discussion and Analysis of Financial Condition and Results of Operations (MD&A) is intended to help the reader understand our results of operations and financial condition. The MD&A is provided as a supplement to, and should be read in conjunction with, our consolidated financial statements and notes thereto included in Item 8 - Financial Statements and Supplementary Data.\nWe are a global aerospace and defense company principally engaged in the research, design, development, manufacture, integration and sustainment of advanced technology systems, products and services. We also provide a broad range of management, engineering, technical, scientific, logistics, system integration and cybersecurity services. Our main areas of focus are in defense, space, intelligence, homeland security and information technology, including cybersecurity. We serve both U.S. and international customers with products and services that have defense, civil and commercial applications, with our principal customers being agencies of the U.S. Government. In 2024, 73% of our $71.0 billion in net sales were from the U.S. Government, either as a prime contractor or as a subcontractor (including 65% from the Department of Defense (DoD)), 26% were from international customers (including foreign military sales (FMS) contracted through the U.S. Government) and 1% were from U.S. commercial and other customers.\nWe operate in four business segments: Aeronautics, Missiles and Fire Control (MFC), Rotary and Mission Systems (RMS) and Space. We organize our business segments based on the nature of the products and services offered.\nOur 21st Century Security\nvision is to accelerate the adoption of advanced networking and other leading-edge technologies into the American defense enterprise, while enhancing the performance and value of our platforms and products for our customers. The aim of 21st Century Security is to integrate and continuously upgrade new and existing systems across all domains with advanced, open-architecture networking and operational technologies that make defense forces more agile, adaptive and unpredictable, enabling overmatch and strengthening deterrence today and into the future.\n21st Century Security guides our strategy and investments. As our growth pillars continue to evolve, we are focusing on advancing all-domain mission solutions through investments in digital technologies such as Artificial Intelligence (AI)/Machine Learning (ML), Autonomy and Crewed/Uncrewed Teaming, Generative Design and other technologies and capabilities enabling Combined Joint All-Domain Command and Control (CJADC2). Innovations in these areas will expand capability, improve interoperability, increase demand for our multi-domain solutions and drive efficient conversion of backlog into growth across our portfolio. We have well established programs across our business segments that continue to experience growth, including F-35 sustainment activity (Aeronautics); increased Patriot Advanced Capability-3 (PAC-3) production rates and increased demand for High Mobility Artillery Rocket System (HIMARS\n) and Guided Multiple Launch Rocket Systems (GMLRS) (Missiles and Fire Control); radar surveillance systems and CH-53K King Stallion heavy lift helicopter (Rotary and Mission Systems); and the modernization of and enhancements to the Trident II D5 Fleet Ballistic Missile (FBM) (Space). Additionally, our teams continue to transform our products and rapidly innovate for the future, developing 6th generation air dominance technologies within Skunk Works\n, demonstrating autonomous capabilities with the X-62A (F-16) and optionally piloted BLACK HAWK\n, creating new Joint All-Domain Operating systems with Defense of Guam and AIR 6500 in Australia, establishing small-to-medium satellite capabilities to support proliferated space constellations and advancing hypersonic capabilities. Finally, we are always in pursuit of new program awards to develop future platforms that enable us to continue to strengthen our national defense and advance deterrence and global security.\nKeys to enabling success of our strategy include developing and investing in differentiating technologies, forging strategic partnerships, including with commercial companies, executing on our multi-year business transformation initiative to enhance our digital infrastructure and increase efficiencies and collaboration throughout our business and maintaining fiscal discipline. Underpinning our ability to execute our strategy is our talent and culture. We invest substantially in our people to ensure that our workforce has the technical skills necessary to succeed, and we expect to continue to invest internally in innovative technologies that address rapidly evolving mission requirements for our customers. We also will continue to evaluate our portfolio and will make strategic acquisitions or divestitures, as appropriate, while deepening our connection to commercial industry through cooperative partnerships, joint ventures and equity investments.\nPortfolio Shaping Activities\nWe continuously strive to strengthen our portfolio of products and services to meet the current and future needs of our customers. We accomplish this in part by our independent research and development activities and through acquisition, divestiture and internal realignment activities.\nWe selectively pursue the acquisition of businesses, investments and ventures at attractive valuations that will expand or complement our current portfolio and allow access to new customers or technologies. We also may explore the divestiture of businesses, investments or ventures that no longer meet our needs or strategy or that could perform better outside of our organization or with a different owner. In pursuing our business strategy, we routinely conduct discussions, evaluate targets and enter into agreements regarding possible acquisitions, divestitures, joint ventures and equity investments.\nOn September 9, 2024, we completed the sale of our Commercial Engine Solutions (CES) business, which was part of our Aeronautics business segment. We received $170 million in cash from the sale. Gains recognized from the sale in 2024 were not significant. The final gain is subject to certain post-closing adjustments, including final working capital, indemnification, and tax adjustments, which we expect to complete in 2025. This sale did not represent a strategic shift and the impacts to our consolidated results of operation, financial position, and cash were not significant. Accordingly, the operating results and cash flows for the CES business up to the divestiture date have not been reclassified to discontinued operations.\nOn October 30, 2024, we closed our acquisition of Terran Orbital Corporation (Terran Orbital) for a purchase consideration of $314 million, which will be included in our Space business segment. Terran Orbital’s product and service offerings include satellite design, production, launch planning, mission operations, and on-orbit support for the aerospace and defense industries. We believe this acquisition will enable us to broaden our capabilities and offerings, provide additional innovative solutions to meet our customers’ emerging requirements, and provide expanded opportunities for our combined employees. The financial results of Terran Orbital have been included within our operating results in the period post-acquisition. See Note 1 to the consolidated financial statements for further information regarding the acquisition of Terran Orbital.\nU.S. Budget Environment\nWith approximately three quarters of our sales from the U.S. Government, U.S. Government spending levels, particularly defense spending, and timely funding thereof can affect our financial performance over the short and long term.\nOn March 22, 2024, the President signed into law the second Fiscal Year (FY) 2024 Consolidated Appropriations package, which includes the DoD funding. This legislation reflects the Fiscal Responsibility Act of 2023 (FRA) spending limit of $886 billion for National Defense, of which $842 billion was for the DoD base budget.\nThe President’s FY 2025 budget request was submitted to Congress on March 11, 2024, initiating the FY 2025 defense authorization and appropriations legislative process. The request included $895 billion for National Defense, of which $850 billion is for the DoD base budget, in keeping with the limit established by the FRA. While compression on overall requirements driven by the FRA limit is evident, the Office of the Secretary of Defense has stated the FY 2025 budget proposal meets their objectives of keeping National Defense Strategy priorities on track.\nOn April 24, 2024, the President signed a bill providing a total of $95 billion in additional supplemental funding for Ukraine, Israel and Taiwan, including funding for the restock of U.S. munitions capacity. Supplemental funding legislation is not subject to the FRA limits.\nThe House and Senate continue the legislative process on the FY 2025 budget. The National Defense Authorization Act for Fiscal Year 2025, signed by the President on December 24, 2024, is consistent with the FY 2025 President’s Budget Request (PBR) and Congressionally mandated budget caps established by the FRA with a topline of $849.8 billion. The House Appropriations Committee also marked its bill at this same level. The Senate Appropriations Committee, however, did not adhere to the FRA spending caps and marked budgets above the PBR, providing between a $21 billion and $25 billion increase over the PBR level. Regardless of toplines, all four Committees support additional funding for several of our programs, spread across our four business areas.\nCongress still needs to approve or revise the President’s FY 2025 budget proposal through enactment of appropriations bills and other policy legislation, which would then require final approval from the President in order for the FY 2025 budget process to conclude. A second Continuing Resolution (CR) for FY 2025 passed the House and Senate on December 20, 2024, and was signed by the President on December 21, 2024. The bill funds U.S. Government operations through March 14, 2025. In addition to the Continuing Resolution, the President also signed the Disaster Relief Supplemental Appropriations Act on December 21, 2024, which includes more than $100 billion in supplemental funding. Of note, the final version of the bill did\nnot address the debt ceiling, which is set to expire mid-January 2025 and is expected to cause challenges at the start of the 119th Congressional negotiations. Once the debt ceiling is reached, Treasury may have to use extraordinary measures to prevent default. Treasury’s available cash and any extraordinary measures taken should delay the risk of default for at least several months after the end of the first quarter of 2025. In the upcoming months, the new Congress will return to the task of funding the U.S. Government for the balance of FY 2025. Significant differences that must be resolved include the different allocations as noted above and policy matters that arose during consideration of the CR and the underlying bills.\nWe anticipate the federal budget will continue to be subject to debate and compromise shaped by, among other things, the new Administration and Congress, the global security environment, inflationary pressures, and macroeconomic conditions. The result may be shifting funding priorities, which could have material impacts on defense spending broadly and our programs.\nGeopolitical and Economic Environment\nWe operate in a complex and evolving global security environment and our business is affected by geopolitical and security issues. Russia’s invasion of Ukraine, conflicts in the Middle East and heightened tension in the Pacific region have elevated global security concerns resulting in increased interest for our products and services as countries seek to improve their security posture. In this context, the U.S. Government, our largest customer, continues to align its budget with the defense priorities set forth in the 2022 National Defense Strategy. In addition, security assistance provided by the U.S. Government and its allies to Ukraine has increased U.S. Government and allied demand to replenish U.S. stockpiles, resulting in additional and potential future orders, including for the ramp-up in production capacity for certain products. We continue to expect additional orders over the next several years attributable to the global threat environment. We operate primarily in a long-cycle business and the U.S. Government has been focused on increasing industry capacity to meet demand. We continue to work with the U.S. Government and our supply chain to evaluate increases in capacity at our operations to anticipate potential demand and enable us to deliver critical capabilities.\nOur business and financial performance is also affected by general economic conditions. We continue to experience supply chain challenges, including supplier shortages and performance issues. These issues have delayed certain customer deliveries, have been a limiting factor on our ability to ramp up production in response to customer demand for certain products and have caused out-of-sequence manufacturing, which increases costs and decreases operational efficiency. In addition, elevated levels of inflation and macroeconomic conditions present risks for us, our suppliers and the stability of the broader defense industrial base. Certain costs, including rising labor rates and supplier costs, have increased as a result of inflation, and have adversely affected our margins on certain programs. In addition, some suppliers are reducing the duration of pricing validity of their proposals to us or seeking to reopen pricing on existing agreements, which is operationally challenging and increases the risk of cost volatility. We continue to work to mitigate challenges caused by the supply chain or current macroeconomic environment on our business, including by supporting small business and at-risk suppliers, deploying resources to work with our supply chain, securing materials and support by executing long-term contracts, enforcing existing contract terms, identifying alternative sources, collaborating with our customers to address industry-wide challenges, and optimizing our supply chain organization through digital transformation and workforce development. If we experience significant supply chain issues or high rates of inflation, and are unable to successfully mitigate the impact, our future profits, margins and cash flows, particularly for existing fixed-price contracts, may be adversely affected. Inflation and higher interest rates can also constrain the overall purchasing power of our customers for our products and services potentially impacting future orders, especially in a budget constrained environment. We remain committed to our ongoing efforts to increase the efficiency of our operations and improve the cost competitiveness and affordability of our products and services, which may, in part, offset cost increases from inflation.\nInternational Business\nA key component of our strategic plan is to grow our international sales. To accomplish this growth, we continue to focus on strengthening our relationships internationally through partnerships and joint technology efforts. Our international business is conducted either by FMS contracted through the U.S. Government or by direct commercial sales (DCS) to international customers. In 2024, approximately 73% of our sales to international customers were FMS and about 27% were DCS. Additionally, in 2024, substantially all of our sales from international customers were in our Aeronautics, MFC and RMS business segments. Space’s sales from international customers were not material in 2024. S",
  "item2_clean": null
}