{
  "source_file": "lnt-20241231.htm",
  "form_type": "10-K",
  "item1_clean": "safety standards and employee expectations. We instill company Values, methods and procedures from day one.\n2) REGULATION -\nAlliant Energy, IPL and WPL are subject to regulation by various federal, state and local agencies. The following includes the primary regulations impacting Alliant Energy’s, IPL’s and WPL’s businesses.\nFERC\nPublic Utility Holding Company Act of 2005 -\nAlliant Energy is registered with FERC as a public utility holding company, pursuant to the Public Utility Holding Company Act of 2005, and is required to maintain certain records and to report certain transactions involving its public utilities, service company and other entities regulated by FERC. Corporate Services, IPL and WPL are subject to regulation by FERC under the Public Utility Holding Company Act of 2005 for various matters including, but not limited to, affiliate transactions, public utility mergers, acquisitions and dispositions, and books, records and accounting requirements.\nEnergy Policy Act of 2005 -\nThe Energy Policy Act of 2005 requires creation of an Electric Reliability Organization to provide oversight by FERC. FERC designated North American Electric Reliability Corporation, which also provides oversight of cybersecurity standards, as the overarching Electric Reliability Organization. Midwest Reliability Organization, which is a regional member of North American Electric Reliability Corporation, has direct responsibility for mandatory electric reliability standards for IPL and WPL.\nFederal Power Act of 1935 -\nFERC also has jurisdiction, under the Federal Power Act of 1935, over certain electric utility facilities and operations, electric wholesale sales, interstate electric transmission rates, dividend payments, issuance of IPL’s securities, and accounting practices of Corporate Services, IPL and WPL.\nElectric Wholesale Rates\n- FERC has authority over IPL's and WPL's wholesale electric market-based rates. Market-based rate authorization allows for wholesale sales of electricity within FERC’s wholesale markets, including the MISO market, and in transactions directly with third parties, based on the market value of the transactions. IPL and WPL also have FERC-approved cost of service formula-based rates related to the provision of firm full- and partial-requirement wholesale electric sales, which allow for true-ups to actual costs, including fuel costs.\nElectric Transmission Rates\n- FERC regulates the rates charged for electric transmission facilities used in interstate commerce. IPL and WPL do not own or operate FERC-regulated electric transmission facilities; however, both IPL and WPL pay for the use of the interstate electric transmission system based upon FERC-regulated rates. IPL and WPL rely primarily on the use of the ITC and ATC transmission systems, respectively.\n- FERC regulates the transportation and sale for resale of natural gas in interstate commerce under the Natural Gas Act. Under the Natural Gas Act, FERC has authority over certain natural gas facilities and operations of IPL and WPL.\nIUC\nIPL is subject to regulation by the IUC for various matters including, but not limited to, retail utility rates and standards of service, accounting requirements, the construction of EGUs, and the acquisition, sale or lease of assets with values that exceed 3% of IPL’s revenues. In Iowa, counties and cities are prohibited from regulating the sale of natural gas and propane, which supports IPL’s ability to provide gas utility service to retail customers and industries.\n\nRetail Utility Base Rates -\nIPL files periodic requests with the IUC for retail rate changes and may base those requests on either historical or forward-looking test periods. The IUC must decide on requests for retail rate changes within 10 months of the date of the application for which changes are filed, subject to certain exceptions. The historical test periods may be adjusted for certain known and measurable changes to capital investments, cost of capital and operating and maintenance expenses consistent with IUC rules and regulations. The IUC has rules that establish minimum filing requirements for rate reviews using a forward-looking test period, and a related subsequent proceeding review after the close of the forward-looking test period. The rules provide that in the subsequent proceeding review, a utility’s actual costs and revenues will be presumed to be reasonably consistent with the forward-looking test period if the utility’s actual return on common equity falls within a standard of reasonableness of 50 basis points above to 50 basis points below the authorized return on common equity. If the utility’s actual return on common equity is outside of this range, future rates could be adjusted. In addition, the rules require that IPL must receive an order from the IUC related to the subsequent proceeding review before it can file another rate review. Also, IPL is required to defer a portion of its earnings if its annual regulatory return on common equity exceeds certain levels. Refer to “\n” in MDA for discussion of IPL’s retail electric base rate moratorium from October 2025 through September 2029 approved by the IUC in IPL’s most recent retail electric rate review.\nIn accordance with Iowa law, IPL is required to file an energy efficiency plan (EEP) every five years with the IUC. An EEP provides a utility’s plan and related budget to achieve specified levels of electric and gas energy savings. IUC approval demonstrates that IPL’s EEP is reasonably expected to achieve cost-effective delivery of the energy efficiency programs. Refer to\nfor discussion of the recovery of these costs from IPL’s retail electric and gas customers.\nElectric Generating Units -\nIPL must obtain a certificate of public convenience, use and necessity (GCU Certificate) from the IUC in order to construct a new, or significantly alter (including fuel switching) an existing, EGU or energy storage facility located in Iowa with a nameplate generating capacity of 25 MW or more. IPL’s ownership and operation of EGUs (including those located outside the state of Iowa) to serve Iowa customers is subject to retail utility rate regulation by the IUC.\nGas Pipeline Projects -\nIPL must obtain a pipeline permit from the IUC related to the siting of utility gas pipelines in Iowa that will be operated at a pressure over 150 pounds per square inch and will transport gas to a distribution system or single, large volume customer.\nAdvance Rate-making Principles -\nIowa law allows Iowa utilities to request rate-making principles prior to making certain investments in Iowa. As a result, IPL may file for, and the IUC must render a decision on, rate-making principles for certain new EGUs located in Iowa, including any alternate energy production facility (such as a wind, solar, energy storage or nuclear-fired facility), combined-cycle natural gas-fired EGU, and certain base-load EGUs with a nameplate generating capacity of 300 MW or more. Advance rate-making principles are also available for the repowering of an alternative energy production facility or certain significant alterations of an existing EGU. Upon approval of rate-making principles by the IUC, IPL must either construct the EGU or repower the alternative energy production facility under the approved rate-making principles, or not at all. If rate-making principles are not approved by the IUC, IPL may construct the facility, subject to other applicable approvals (such as a GCU Certificate), subject to recovery in future rate reviews.\nThe IUC’s 2023 order for the advance rate-making principles for IPL’s 400 MW of solar generation projects placed in service in 2024 included a consumer protection plan, which monitors IPL’s achievement of certain aggregate summer capacity factors for those projects during June, July and August each calendar year over 30 years. Actual three-year rolling average summer capacity factors will be compared to target capacity factors, which may result in surpluses or deficits that would be offset against one another and contribute to an accumulated balance in a given calendar year. Surpluses or deficits will be capped at $3 million in aggregate per year. At the end of the program, any accumulated deficit balance would be addressed in IPL’s next rate review, and any accumulated surplus balance would not result in any return to IPL.\nElectric Generating Unit Environmental Controls Projects\n- At its sole discretion, IPL may submit an updated emissions plan and budget to the IUC setting out a multi-year plan and budget for managing regulated emissions from its coal-fired EGUs in a cost-effective manner. IPL must simultaneously submit this plan and budget to the Iowa Department of Natural Resources for a determination of whether the plan and budget meet state environmental requirements for regulated emissions. The reasonable and prudent costs associated with implementing the approved plan are expected to be included in IPL’s future retail electric rates.\nPSCW\nWPL is subject to regulation by the PSCW related to its operations in Wisconsin for various matters including, but not limited to, retail utility rates and standards of service, accounting requirements, issuance and use of proceeds of securities, affiliate transactions, approval of the location and construction of EGUs and certain other additions and extensions to facilities. In addition, Alliant Energy is subject to regulation by the PSCW for the type and amount of Alliant Energy’s holdings in non-utility businesses and other affiliated interest activities, among other matters.\nRetail Utility Base Rates -\nWPL files periodic requests with the PSCW for retail rate changes, which are based on forward-looking test periods. There is no statutory time limit for the PSCW to decide on retail base rate requests. However, the PSCW attempts to process retail base rate reviews in approximately 10 months and has the ability to approve interim retail rate relief, subject to refund, if necessary. Currently, WPL is required to defer a portion of its earnings if its annual regulatory return on common equity exceeds certain levels.\n\nC. INFORMATION RELATING TO UTILITY OPERATIONS\nAlliant Energy’s utility business includes the operations of IPL (electric, gas and steam operations) and WPL (electric and gas operations), which are both reportable segments. IPL’s and WPL’s electric, gas and other revenues as a percentage of total revenues were as follows:\nIPL\nWPL\n1) ELECTRIC UTILITY OPERATIONS\nAlliant Energy’s electric utility operations are located in the Midwest with IPL providing retail and wholesale electric service in Iowa and WPL providing retail and wholesale electric service in Wisconsin. IPL also sells electricity to wholesale customers in Minnesota and Illinois. Refer to the “\nElectric Operating Information\n” tables for additional details regarding electric utility operations.\n\n1) IPL -\nis a public utility engaged principally in the generation and distribution of electricity and the distribution and transportation of natural gas to retail customers in select markets in Iowa. IPL provides utility services to incorporated communities as directed by the IUC and utilizes non-exclusive franchises, which cover the use of public right-of-ways for utility facilities in incorporated communities for a maximum term of 25 years. At December 31, 2024, IPL supplied electric and natural gas service to approximately 500,000 and 230,000 retail customers, respectively, in Iowa. IPL also sells electricity to wholesale customers in Minnesota (IPL’s related wholesale power agreement expires July 2025), Illinois and Iowa. IPL is also engaged in the generation and distribution of steam for two customers in Cedar Rapids, Iowa, which are each under contract through 2025 for taking minimum quantities of annual steam usage, with certain conditions, after which IPL expects to exit the steam business.\n2) WPL -\nis a public utility engaged principally in the generation and d",
  "item7_clean": "Growing customer demand -\nAlliant Energy’s strategy supports expanding electric and gas usage in its service territories by promoting electrification initiatives and economic development.\nThe IUC’s order for IPL’s most recent retail electric rate review includes the creation of an individual customer rate tariff, allowing IPL to attract new load growth to its service territory. In addition, Iowa’s Major Economic Growth Attraction program and Wisconsin’s sales and use tax exemption for qualified data centers, encourage economic development in Alliant Energy’s service territory.\nIPL has entered into electric service agreements with two new customers, who currently expect to build data centers at the Big Cedar Industrial Center in Cedar Rapids, Iowa in IPL’s service territory. These agreements include aggregate, maximum demands of approximately 1.9 gigawatts. The electric service agreements are subject to IUC approval under the individual customer rate tariff that was included in the IUC’s September 2024 order for IPL’s retail electric rate review. The actual timing and amount of increases in IPL’s load are subject to various factors, including interconnections and actual customer demand, and any executed or future agreements with customers are not expected to result in immediate increases in load.\nVarious development-ready sites, which are rail-served and in close proximity to a variety of transportation options, are located throughout Alliant Energy’s service territories.\nRESULTS OF OPERATIONS\nFinancial Results Overview\nThe table below includes diluted EPS for Utilities and Corporate Services, ATC Holdings, and Non-utility and Parent, which are non-GAAP financial measures. Alliant Energy believes these non-GAAP financial measures are useful to investors because they facilitate an understanding of performance and trends, and provide additional information about Alliant Energy’s operations on a basis consistent with the measures that management uses to manage its operations and evaluate its performance. Alliant Energy’s net income and EPS attributable to Alliant Energy common shareowners were as follows (dollars in millions, except per share amounts):\nEPS\nEPS\nUtilities and Corporate Services\nNon-utility and Parent\nAlliant Energy Consolidated\nAlliant Energy’s Utilities and Corporate Services net income decreased by $2 million in 2024 compared to 2023. The decrease was primarily due to an asset valuation charge for IPL’s Lansing Generating Station as a result of the IUC order for IPL’s retail electric rate review, estimated temperature impacts on retail electric and gas sales, restructuring and voluntary separation charges, an ARO charge allocated to the steam business at IPL due to the revised CCR Rule, higher depreciation and financing expenses, and lower\nAFUDC. These items were partially offset by higher revenue requirements from capital investments.\nAlliant Energy’s Non-utility and Parent net income decreased by $16 million in 2024 compared to 2023, primarily due to higher financing expense.\n\nCommon Stock Dividends -\nAlliant Energy announced a 6% increase in its targeted 2025 annual common stock dividend to $2.03 per share, which is equivalent to a quarterly rate of $0.5075 per share, beginning with the February 2025 dividend payment. The timing and amount of future dividends is subject to approval of quarterly dividend declarations from Alliant Energy’s Board of Directors, and is dependent upon earnings expectations, capital requirements, and general financial business conditions, among other factors.\nCash Flows From Operating Activities -\nAlliant Energy, IPL and WPL currently expect an increase in future cash flows from operating activities resulting from the transfer of future renewable tax credits to other corporate taxpayers pursuant to the Inflation Reduction Act of 2022. In addition, Alliant Energy, IPL and WPL currently expect an increase in future cash flows from operating activities resulting from higher earnings on increasing rate base at IPL and WPL.\nHigher Earnings on Increasing Rate Base -\nAlliant Energy, IPL and WPL currently expect increases in electric utility and gas utility revenues in 2025 compared to 2024 due to impacts from increasing revenue requirements related to investments in the utility business. In addition, Alliant Energy, IPL and WPL currently expect a decrease in the effective income tax rate in 2025 compared to 2024 due to additional tax credits from renewable generation and energy storage projects placed in service in 2024 and/or expected to be placed in service in 2025. A majority of the differences between actual renewable tax credits and renewable tax credits used to determine rates are recorded in regulatory assets or regulatory liabilities on the balance sheets until they are reflected in future billings to customers. Investment tax credits resulting from IPL energy storage projects expected to be placed in service in 2025 may be utilized to offset any revenue deficiency on an annual basis up to the earnings sharing mechanism threshold included in IPL’s retail electric rate review settlement agreement discussed in “\nSales Trends and Temperatures -\nIn July 2025, IPL’s wholesale power agreement with Southern Minnesota Energy Cooperative (SMEC) will expire (sales to SMEC represented approximately 5% of IPL’s total electric sales in 2024), which is not expected to have a material impact on Alliant Energy’s or IPL’s future financial condition and results of operations. In 2024, warmer than normal temperatures in the winter and cooler than normal temperatures in the summer in Alliant Energy’s, IPL’s and WPL’s service territories resulted in lower retail electric and gas sales volumes and operating income.\nOther Operation and Maintenance Expenses\n- Alliant Energy, IPL and WPL currently expect a decrease in other operation and maintenance expenses in 2025 compared to 2024 largely due to the asset valuation charge for IPL’s Lansing Generating Station and ARO charge for steam assets at IPL recorded in 2024, charges for restructuring and voluntary employee separation recorded in 2024, as well as expected future cost savings related to Alliant Energy’s restructuring activities. These items are expected to be partially offset by higher generation maintenance and energy delivery expenses.\nDepreciation and Amortization Expense -\nAlliant Energy, IPL and WPL currently expect an increase in depreciation and amortization expense in 2025 compared to 2024 due to capital projects placed in service in 2024 and 2025, and updated electric depreciation rates for IPL effective October 1, 2024.\nAlliant Energy, IPL and WPL currently expect an increase in interest expense in 2025 compared to 2024 due to financings completed in 2024 and planned in 2025 as discussed above.\nCUSTOMER INVESTMENTS\nAlliant Energy’s, IPL’s and WPL’s strategic priorities include making significant customer-focused investments toward reliable, resilient and sustainable customer energy solutions. These priorities include:\nAlliant Energy’s current resource plan continues to add resources in Iowa and Wisconsin, and serves as a guide to meet customer demand for affordable, safe, reliable and sustainable energy. Over the next five years, Alliant Energy currently plans to develop and/or acquire new generation investments to add flexibility with evolving load growth, including approximately 1,200 MW of new wind and solar generation in aggregate, approximately 1,000 MW of energy storage, approximately 750 MW of new natural gas resources, refurbishments at approximately 600 MW of existing wind farms, and improvements at approximately 650 MW of existing natural gas-fired EGUs and the conversion of existing coal-fired EGUs to natural gas. Alliant Energy is currently evaluating the impact of potential additional large load growth customers and MISO’s seasonal resource adequacy requirements on its resource plans and will update these generation investment plans as needed in the future. Estimated capital expenditures for these planned projects for 2025 through 2028 are included in the “Generation” section in the construction and acquisition table in “\nLiquidity and Capital Resources\n.” Information on IPL’s and WPL’s regulatory filings and/or approvals for future generation and energy storage projects, as well as recently completed projects, are as follows:\nWPL’s Generation and Energy Storage Projects -\n- In 2022 through 2024, WPL completed 1,089 MW of new solar generation projects in Wisconsin, including the Grant County facility (200 MW) in 2024. Refer to\nfor discussion of the construction costs associated with these projects.\n- In 2023, the PSCW issued orders authorizing WPL to construct, own and operate energy storage at the Grant County (100 MW) and Wood County (75 MW) solar projects in Wisconsin, which is currently expected to be placed in service in the second half of 2025, and at the Edgewater Generation Station in Wisconsin (approximately 99 MW), which is currently expected to be placed in service in 2026.\nIn July 2024, the U.S. Department of Energy Office of Clean Energy Demonstrations awarded WPL’s Columbia Energy Storage Project, an approximately 20 MW compressed CO2-based long-duration energy storage system at the Columbia\n\nCounterparty Credit Risk -\nAlliant Energy, IPL, and WPL are exposed to credit risk related to losses resulting from counterparties’ nonperformance of their contractual obligations. Alliant Energy, IPL and WPL maintain credit policies intended to minimize overall credit risk and actively monitor these policies to reflect changes and scope of operations. Alliant Energy, IPL, and WPL conduct credit reviews for certain counterparties, and employ credit risk controls such as letters of credit, parental guarantees, master netting agreements and termination provisions. Credit exposure is monitored, and when necessary, activity with a specific counterparty is limited until credit enhancement is provided. Distress in the financial markets could increase Alliant Energy’s, IPL’s and WPL’s credit risk.\nAlliant Energy, IPL and WPL are exposed to investment price risk as a result of their investments in securities, largely related to securities held by their pension and OPEB plans, as well as unconsolidated investments accounted for under the equity method of accounting. Refer to\nfor details of the securities held by their pension and OPEB plans, and\nfor details of equity investments. Refer to “\n” for the impact on retirement plan costs of changes in the rate of returns earned by plan assets.\nAlliant Energy, IPL and WPL are exposed to risk resulting from changes in interest rates associated with variable-rate borrowings. In addition, Alliant Energy and IPL are exposed to risk resulting from changes in interest rates on cash amounts outstanding under IPL’s sales of accounts receivable program. Assuming the impact of a hypothetical 100 basis point increase in interest rates on variable-rate borrowings and cash amounts outstanding under IPL’s sales of accounts receivable program at December 31, 2024, Alliant Energy’s, IPL’s and WPL’s annual pre-tax expense would increase by approximately $6 million, $1 million and $2 million, respectively. Refer to Notes\nfor additional information on cash amounts outstanding under IPL’s sales of accounts receivable program, and short- and long-term variable-rate borrowings, respectively. Refer to “\n” for the impacts of changes in discount rates on retirement plan obligations and costs.\nCritical Accounting Estimates\nAlliant Energy’s, IPL’s and WPL’s financial statements are prepared in conformity with GAAP, which requires management to apply accounting policies, judgments and assumptions, and make estimates that affect results of operations and the amounts of assets and liabilities reported in the financial statements. The following accounting estimates are critical to the business and the understanding of financial results as they require critical assumptions and judgments by management. The results of these assumptions and judgments form the basis for making estimates regarding the results of operations and the amounts of assets and liabilities that are not readily apparent from other sources. Actual financial results may differ materially from estimates. Management has discussed these critical accounting estimates with the Audit Committee of the Board of Directors. Refer to\nfor additional discussion of accounting estimates used in the preparation of the financial statements.\nRegulatory Assets and Regulatory Liabilities -\nIPL and WPL are regulated by various federal and state regulatory agencies. As a result, they are subject to GAAP for regulated operations, which recognizes that the actions of a regulator can provide reasonable assurance of the existence of an asset or liability. Regulatory assets or regulatory liabilities arise as a result of a difference between GAAP and actions imposed by the regulatory agencies in the rate-making process. Regulatory assets generally represent incurred costs that have been deferred as such costs are probable of recovery in future customer rates. Regulatory liabilities generally represent obligations to make refunds to customers or amounts collected in rates for which the related costs have not yet been incurred. Regulatory assets and regulatory liabilities are recognized in accordance with the rulings of applicable federal and state regulators, and future regulatory rulings may impact the carrying value and accounting treatment of regulatory assets and regulatory liabilities.\nprovides details of the nature and amounts of regulatory assets and regulatory liabilities assessed at December 31, 2024.\nAssumptions and judgments are made each reporting period regarding whether regulatory assets are probable of future recovery and regulatory liabilities are probable future obligations by considering factors such as regulatory environment changes, rate orders issued by the applicable regulatory agencies, historical decisions by such regulatory agencies regarding similar regulatory assets and regulatory liabilities, and subsequent events of such regulatory agencies. The decisions made by regulatory agencies have an impact on the recovery of costs, the rate of return on invested capital and the timing and amount of assets to be recovered by rates. A change in these decisions may result in a material impact on results of operations and the amount of assets and liabilities in the financial statements.\nIn May 2023, IPL retired the Lansing Generating Station. IPL was previously allowed a full recovery of and a full return on this EGU from its retail customers. In September 2024, the IUC approved IPL’s retail electric rate review for the October 2024 through September 2025 forward-looking Test Period, which includes a return of the remaining net book value of Lansing; however, the IUC did not approve a return on the remaining net book value of Lansing, therefore the return on the remaining net book value is no longer recoverable from IPL’s retail electric customers. As a result a pre-tax non-cash charge of $60 million was recorded to “Asset valuation charge for IPL’s Lansing Generating Station” in Alliant Energy’s and IPL’s income statements in 2024, with a corresponding decrease in Alliant Energy’s and IPL’s assets retired early regulatory assets. IPL is currently allowed a full recovery of and a full return on this EGU from its wholesale customers.\n\nElectric Utility Revenue Variances\nThe following items contributed to increased (decreased) electric utility revenues for 2024 compared to 2023 (in millions):\nIPL\nWPL\nHigher revenue requirements (a)(b)\nHigher (lower) sales for resale bulk power and other revenues (c)\nDeferral of incremental solar generation construction costs at WPL in 2024 (Refer to\nLower revenues primarily due to changes in retail electric fuel-related costs at WPL, and credits on IPL’s customers’ bills related to production tax credits ",
  "item2_clean": null
}