{
  "source_file": "lnt-20250930.htm",
  "form_type": "10-Q",
  "item1_clean": null,
  "item7_clean": null,
  "item2_clean": "Environmental Matters and Stewardship:\nIn March 2025, the EPA announced it expects to initiate a formal reconsideration of various environmental regulations and programs, including the Cross-State Air Pollution Rule and Effluent Limitation Guidelines. In June 2025, the EPA proposed to repeal emissions standards and guidelines issued under Clean Air Act Sections 111(b) and 111(d) for electric generating units. In July 2025, the EPA proposed to repeal its 2009 finding that GHG contributes to climate change, which gave it authority to regulate GHG under the Clean Air Act. In October 2025, the EPA proposed a rule to revise certain deadlines and other provisions of the 2024 Effluent Limitation Guidelines. The EPA also expects to expedite review of state programs to delegate implementation of the Coal Combustion Residuals Rule and reconsider compliance deadlines. Alliant Energy, IPL and WPL are currently unable to predict with certainty the future outcome or impact of these matters, including resolution of ongoing and potential litigation.\nAlliant Energy’s current voluntary environmental stewardship goals include the following:\nBy 2030, reduce GHG emissions from its utility operations by 50% from 2005 levels, reduce its electric utility water supply by 75% from 2005 levels and electrify 100% of its owned light-duty fleet vehicles.\nBy 2040, eliminate all coal-fired EGUs from its generating fleet.\nBy 2050, aspire to achieve net-zero GHG emissions from its utility operations.\nAlliant Energy’s aspirational GHG goal includes EPA reportable emissions based on applicable regulatory compliance requirements for carbon dioxide, methane and nitrous oxide from its owned fossil-fueled EGUs and distribution of natural gas. Alliant Energy’s voluntary environmental stewardship goals may be revised, or their achievement may be delayed, based on increasing customer energy needs, reliability and resource adequacy requirements, and tax policy changes, and the ability to achieve these goals is subject to various additional risk factors included in the 2024\n. These goals are not meant to be considered guidance.\nLegislative Matters:\nIn July 2025, the One Big Beautiful Bill Act was enacted, which modifies various clean energy tax credits under the Inflation Reduction Act of 2022, including production tax credits and investment tax credits. The most significant provisions of the new legislation for Alliant Energy, IPL and WPL relate to the accelerated phase out of clean energy tax credits for eligible projects for which construction begins more than 12 months after the date of enactment or for projects placed in service after 2027, and restricted access to clean energy tax credits for projects that begin construction after 2025 and receive impermissible amounts of construction support from entities with ties to certain foreign countries, including China. Additionally, in July 2025, the Presidential Administration directed the U.S. Department of the Treasury to strictly enforce the termination of clean energy tax credits, including issuing new and revised guidance in August 2025, to ensure that requirements concerning the beginning of construction are not circumvented. Refer to “\n” for discussion of Alliant Energy’s, IPL’s and WPL’s current plans to develop and/or acquire new clean energy resources. Alliant Energy, IPL and WPL currently expect these clean energy projects would continue to be eligible for clean energy tax credits. If these clean energy projects do not begin construction within the anticipated timeframes or fail to meet other eligibility requirements, the amount of clean energy tax credits could be significantly reduced, which could adversely impact Alliant Energy’s, IPL’s and WPL’s financial condition and results of operations.\nFinancings and Common Stock Dividends:\nResults of Operations\n” for discussion of expected future issuances of common stock in 2026 through 2029 and common stock dividends in 2026, and expected future issuances and retirements of long-term debt by the end of 2026.\nIn April 2025, WPL submitted an application to the U.S. Army Corps of Engineers for up to $45 million in loans through the Corps Water Infrastructure Financing Program. If finalized, such loans would provide low interest financing for various proposed safety projects at WPL’s Kilbourn and Prairie du Sac hydro EGUs.\nRESULTS OF OPERATIONS\nFinancial Results Overview\nThe table below includes diluted EPS for Utilities and Corporate Services, ATC Holdings, and Non-utility and Parent, which are non-GAAP financial measures. Alliant Energy believes these non-GAAP financial measures are useful to investors because they facilitate an understanding of performance and trends, and provide additional information about Alliant Energy’s operations on a basis consistent with the measures that management uses to manage its operations and evaluate its performance. Alliant Energy’s net income and EPS attributable to Alliant Energy common shareowners for the three months ended September 30 were as follows (dollars in millions, except per share amounts):\nEPS\nEPS\nUtilities and Corporate Services\nNon-utility and Parent\nAlliant Energy Consolidated\nAlliant Energy’s Utilities and Corporate Services net income decreased by $16 million for the three-month period, primarily due to higher other operation and maintenance expenses, the timing of income tax expense, higher depreciation and financing expenses. These items were partially offset by higher revenue requirements from IPL’s and WPL’s capital investments.\n\nITEM 2. MANAGEMENT’S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS\nThis MDA includes information relating to Alliant Energy, and IPL and WPL (collectively, the Utilities), as well as ATC Holdings, AEF and Corporate Services. Where appropriate, information relating to a specific entity has been segregated and labeled as such. The following discussion and analysis should be read in conjunction with the\nFinancial Statements\nincluded in this report, as well as the financial statements, notes and MDA included in the 2024\n10-K\n. Unless otherwise noted, all “per share” references in MDA refer to earnings per diluted share.\n2025 HIGHLIGHTS\nKey highlights since the filing of the 2024\ninclude the following:\nCustomer Investments:\nOver the next six years, Alliant Energy currently plans to develop and/or acquire new generation investments to add flexibility with evolving load growth, including approximately 2,000 MW of natural gas resources, approximately 1,300 MW of new energy storage, approximately 1,100 MW of new renewable generation, improvements of approximately 530 MW at existing natural gas-fired EGUs, and refurbishments at approximately 450 MW of existing wind farms. Alliant Energy is currently evaluating the impact of potential additional large load growth customers and MISO’s seasonal resource adequacy requirements on its resource plans and will update these generation investment plans as needed in the future. Estimated capital expenditures for these planned projects for 2025 through 2029 are included in the “Generation” section in the construction and acquisition table in “\nLiquidity and Capital Resources\n.” Information on IPL’s and WPL’s regulatory filings and/or approvals for future generation and energy storage projects are as follows:\nIn February 2025, WPL filed a certificate of authority (CA) application with the PSCW for approval to construct a 2 billion cubic feet, or 25 million gallon, liquified natural gas facility in Rock County, Wisconsin. A decision from the PSCW is currently expected in the second quarter of 2026.\nIn April 2025, the PSCW issued an order authorizing WPL to construct, own and operate a 17.5 MW natural gas-fired EGU using Reciprocating Internal Combustion Engine (RICE) technology, at the site of its Riverside Energy Center.\nIn April 2025, WPL filed a CA application with the PSCW for approval to construct, own and operate the Bent Tree North EGU, an approximate 153 MW wind farm. A decision from the PSCW is currently expected in the second quarter of 2026.\n\nIn May 2025, the PSCW issued an order authorizing WPL to refurbish the Bent Tree wind farm.\nIn June 2025, the IUC issued an order authorizing IPL to construct, own and operate the Cedar River Generating Station, a 94 MW natural gas-fired EGU using RICE technology, at the site of its Prairie Creek Generating Station.\nIn June 2025, the PSCW issued an order authorizing WPL to construct, own and operate an approximately 20 MW compressed carbon dioxide-based long-duration energy storage system at the site of its Columbia Energy Center.\nIn July 2025, IPL filed for advance rate-making principles with the IUC for up to 1,000 MW of new wind generation in Iowa. The advance rate-making principles filing included requests for a fixed cost cap of $3,020/kilowatt, including allowance for funds used during construction and transmission upgrade costs among other costs, and a return on common equity of 11.25%. A decision from the IUC is currently expected in the first quarter of 2026.\nIn July 2025, the IUC issued an order authorizing IPL to construct, own and operate up to 150 MW of energy storage at the site of its retired Lansing Generating Station.\nIn July 2025, WPL completed construction of approximately 100 MW of energy storage at the site of its Grant County solar facility.\nIn August 2025, the IUC issued an order authorizing IPL to construct, own and operate up to 75 MW of energy storage at the site of its Golden Plains wind farm.\nIn August 2025, IPL filed a certificate of public convenience, use and necessity (GCU Certificate) application with the IUC for approval to construct, own and operate an approximate 720 MW simple-cycle natural gas-fired EGU at the site of its Marshalltown Generating Station, known as the Bobcat Energy Center. A decision from the IUC is currently expected in the first quarter of 2026.\nIn September 2025, the IUC issued an order authorizing IPL to con"
}