{
  "source_file": "low-20250131.htm",
  "form_type": "10-K",
  "item1_clean": "There are many variables that affect consumer demand for the home improvement products and services we offer. Key indicators we monitor include home price appreciation, age of the housing stock, real disposable personal income, and housing turnover. We also monitor demographic and societal trends that shape home improvement industry growth over time as the US population moves through major life stages and events. These include strong millennial household formation, an increased preference among older generations to age in place, and the persistence of remote work.\nThe home improvement industry includes a broad competitive landscape that continues to evolve. We compete with national and regional home improvement warehouse chains and lumber yards in most of the markets we serve. We also compete with traditional hardware, plumbing, electrical, and home supply retailers, as well as paint stores, lumber yards, garden centers, and maintenance and repair organizations. In addition, we compete with general merchandise retailers, home goods specialty stores, warehouse clubs, online retailers, other specialty retailers, providers of equipment and tool rental, service providers that install home improvement products, and wholesalers that provide home-related products and services to homeowners, renters, businesses, and the government.\nLocation of stores, product assortment, product pricing, and customer service continue to be key competitive factors in our industry, while the evolution of technology, including artificial intelligence (AI) and machine learning technologies, expansion of fulfillment capabilities, and customer expectations also underscore the importance of omnichannel capabilities as a competitive factor. See further discussion of competition in\n, “Risk Factors”, of this Annual Report.\nOur Omnichannel Capabilities\nWe are committed to meeting customer demand to shop however, whenever, and wherever they choose. Our omnichannel network provides a single view of the customer, no matter where they place their order, whether in-store, online, on-site or through the contact center. This allows our customers to move from channel to channel with simple and seamless transitions even within the same transaction. For example, for many projects, the majority of our customers conduct research online before making an in-store purchase. For purchases made on Lowes.com, customers may pick up their purchase in-store at the customer service desk, curbside, or from touchless lockers, or have their purchase delivered to their home or business. In addition, flexible fulfillment options are available for in-store purchases and those made through the contact center. Regardless of the channels through which customers choose to engage with us, we strive to provide them with a seamless experience across channels and an extended aisle of products, enabled by our flexible fulfillment capabilities. Our ability to sell products in-store, online, on-site, or through our contact centers speaks to our leverage of our existing infrastructure with the omnichannel capabilities we continue to introduce.\nLowe’s-branded home improvement stores and outlet stores are generally open seven days per week and average approximately 112,000 square feet of retail selling space, plus approximately 32,000 square feet of outdoor garden center selling space. Our home improvement stores offer similar products and services, with certain variations based on localization, along with a dedicated team of knowledgeable and friendly frontline associates available to assist our customers. We continue to develop and implement productivity tools, including our front-end transformation and freight flow optimization initiatives, to enhance the efficiency of our sales associates and improve the customer experience. Our Lowe’s Outlet stores have a smaller format and offer value to our customers through incremental savings on discontinued, overstocked, or scratch and dent items.\nThrough our websites and mobile applications, we seek to empower consumers by providing a 24/7 shopping experience, product information, customer ratings and reviews, buying guides, how-to videos, and other information. These tools help consumers make more informed purchasing decisions and give them increased confidence to undertake home improvement projects. We enable customers to choose from a variety of fulfillment options, including buying online and picking up in-store, curbside pick-up, same-day delivery through our gig network, and shipment to their homes or businesses. Further, we also offer digital inspiration, design, and project management tools across our destination home improvement categories.\nWe have on-site specialists available for retail and Pro customers to assist them in selecting products and services for their projects. Our Pro sales managers meet with Pro customers at their place of business or on a job site and leverage nearby stores and our distribution network to ensure we meet customer needs for products and resources. In addition, our In-Home Sales program is available in the majority of our stores to discuss various exterior projects such as windows, doors, and fencing, whose characteristics lend themselves to an in-home consultative sales approach.\nLowe’s operates contact centers utilizing a combination of internal staffing and third-party providers. These contact centers help Lowe’s enable an omnichannel customer experience by providing the ability to tender sales, assist with order management, coordinate deliveries, manage after-sale installations, and answer general customer questions via phone, mail, e-mail, live chat, and social media.\n\nTo meet customers’ varying needs, we offer a complete line of products for construction, maintenance, repair, remodeling, and decorating. We offer home improvement products in the following categories: Appliances, Seasonal & Outdoor Living, Lumber, Lawn & Garden, Kitchens & Bath, Hardware, Building Materials, Millwork, Paint, Rough Plumbing, Tools, Electrical, Flooring, and Décor. A typical Lowe’s-branded home improvement store stocks approximately 40,000 items, with additional items available through our online selling channel. Our product assortments offered in-store strive to meet the needs of the local market for the Pro and DIY customer. See\nof the Notes to Consolidated Financial Statements included in\n, “Financial Statements and Supplementary Data”, of this Annual Report for historical revenues by product category for each of the last three fiscal years.\nWe are committed to offering a wide selection of national brand-name merchandise complemented by our selection of high-value private brands. We are balancing our value-oriented private brands with our national power brands, intensifying our localization efforts and expanding our rural assortment. In addition, we are dedicated to selling products sourced in a socially responsible, efficient, and cost-effective manner.\nWe source our products from vendors worldwide and believe that alternative and competitive suppliers are available for virtually all of our products. Whenever possible, we purchase directly from manufacturers to provide savings for customers and improve our gross margin.\nTo efficiently replenish our stores and meet our customers’ expectations for fast fulfillment and delivery, we own and operate more than 120 supply chain facilities in our network. These facilities include regional distribution centers (RDCs), flatbed distribution centers (FDCs), import distribution centers (IDCs), bulk distribution centers (BDCs), cross-dock terminals (XDTs), and Fulfillment Centers (FCs). Fulfillment centers, along with many of our stores, ship product directly to our customers. In addition, we leverage our existing supply chain to deliver directly to our Pro customers. Each one of these distribution nodes plays a critical role in our Total Home strategy and collectively enable our products to get to their destination as efficiently as possible.\nThe FDCs distribute merchandise that requires special handling due to size or type of packaging such as lumber, boards, panel products, pipe, siding, ladders, and building materials. On average, each RDC and FDC serves approximately 115 stores. Our Pro fulfillment network stocks deeper quantities of our top Pro assortments and has expanded capabilities to handle large orders on multiple flat bed trucks. Our IDCs were expanded to create more capacity to hold import product at the coast, which improves our network’s agility to move inventory where and when it is needed. Our BDCs handle appliances and other big and bulky products, and our XDTs fulfill final mile box truck deliveries of these products.\nOur supply chain supports every pillar of our Total Home strategy, and as such, we continue to invest and transform our network to unlock our omnichannel capabilities while keeping our organization’s sustainability goals top of mind. As part of the completion of the rollout of our market-based delivery model, we expanded to additional geographic areas and enhanced our distribution capacity for big and bulky products. As of fiscal year 2024, we have finalized the roll-out of our market-based delivery model.\nWe have also been focused on improving the speed of our delivery capabilities for our customers. As of fiscal year 2024, most parcel-eligible items fulfilled by Lowe’s can be ordered by a customer and delivered within two business days or less at standard shipping rates. Also, the nationwide expansion of our gig provider network enables same-day delivery of certain products from our stores, and as of fiscal 2024, we have the ability to deliver major appliances next-day in almost every zip code in the United States. Customer needs and buying patterns are constantly changing, and our supply chain will continue to evolve to meet their needs. We are building an omnichannel supply chain that positions the right products in the right quantities in the right places, and operates with greater network capacity with better flow management and optimization.\nWe offer installation services through independent contractors in many of our product categories, with Kitchen & Bath, Flooring, Appliances, Millwork, and Rough Plumbing accounting for the majority of installed sales. Our installed sales model, which separates selling and project administration tasks, allows our sales associates to focus on project selling, while project managers ensure that the details related to installing the products are efficiently executed. We are simplifying the process through a team of remote associates that we call our central selling team. This team handles building quotes, answering questions over video or phone call, and providing personalized support to our customers. We are also implementing technology that allows our customers to finalize their installation contract and checkout on lowes.com or mobile application, so they do not need to return to the store.\nInstalled sales, which includes both product and\nlabor, accounted for approximately 5% of total sales in fiscal 2024.\nLowe’s Protection Plans and Repair Services\nWe offer extended protection plans for certain products within the Appliances, Kitchens & Bath, Décor, Millwork, Rough Plumbing, Electrical, Seasonal & Outdoor Living, Tools, and Hardware categories. These protection plans provide customers with product protection that enhances the coverage offered by the manufacturer’s warranty and provide additional benefits and repair services that extend beyond the manufacturer’s warranty.\nSeasonality and Working Capital\nThe home improvement business in general is subject to seasonal influences, particularly related to the spring selling season. Historically, we have realized the highest volume of sales during our second fiscal quarter (May, June, and July) and the lowest volume of sales during our fourth fiscal quarter (November, December, and January). Accordingly, our working",
  "item7_clean": "The following table sets forth key metrics utilized by management in assessing business performance. This table should be read in conjunction with the following discussion and analysis and the consolidated financial statements, including the related notes to the consolidated financial statements.\nComparable sales decrease\nTotal customer transactions (in millions)\nSales floor square feet (in millions)\nAverage store size selling square feet (in thousands)\nNet earnings to average debt and shareholders’ deficit\nReturn on invested capital\nThe fiscal year ended February 3, 2023 had 53 weeks. The fiscal years ended January 31, 2025 and February 2, 2024 had 52 weeks.\nA comparable location is defined as a retail location that has been open longer than 13 months. A location that is identified for relocation is no longer considered comparable in the month of its relocation. The relocated location must then remain open longer than 13 months to be considered comparable. A location we have decided to close is no longer considered comparable as of the beginning of the month in which we announce its closing. Operating locations which are sold are included in comparable sales until the date of sale. Comparable sales include online sales, which positively impacted comparable sales in fiscal 2024, fiscal 2023, and fiscal 2022 by approximately 50\nbasis points, 25 basis points, and 45 basis points, respectively. The comparable sales calculation for fiscal 2022 was calculated using sales for a comparable 52-week period.\nAverage ticket is defined as net sales divided by the total number of customer transactions.\nAverage store size selling square feet is defined as sales floor square feet divided by the number of stores open at the end of the period.\nReturn on invested capital is calculated using a non-GAAP financial measure. See below for additional information and reconciliations of non-GAAP measures.\nFiscal 2024 Compared to Fiscal 2023\nNet sales decreased 3.1% to $83.7 billion in fiscal 2024. The decrease in total sales was primarily driven by the decrease in comparable sales. Comparable sales decreased 2.7% over the same period, driven by a 3.0% decline in comparable customer transactions, and a 0.3% increase in comparable average ticket. Comparable sales change during each quarter of the fiscal year, as reported, were declines of 4.1% in the first quarter, 5.1% in the second quarter, 1.1% in the third quarter, and an increase of 0.2% in the fourth quarter.\nDuring fiscal 2024, we had comparable sales increases in Building Materials. An additional four product categories performed above the Company average, including Hardware, Rough Plumbing, Appliances, and Millwork. Strength in Building Materials reflects strong demand from Pro customers. Our DIY customer categories were impacted by lower DIY discretionary demand, particularly in bigger-ticket interior projects.\n– Gross margin as a percentage of sales for fiscal 2024 decreased seven basis points compared to fiscal 2023. The gross margin decrease for the year was primarily driven by investments in our supply chain, partially offset by productivity initiatives.\nSG&A\n– SG&A expense for fiscal 2024 deleveraged 72 basis points as a percentage of sales compared to fiscal 2023. This was primarily driven by employee compensation and benefits, due to higher bonus attainment and employee insurance costs, as well as cycling favorable legal settlements in the prior year.\nDepreciation and Amortization\n– Depreciation and amortization expense deleveraged eight basis points for fiscal 2024 as a percentage of sales compared to fiscal 2023.\n– Net interest expense is comprised of the following:\nInterest expense, net of amount capitalized\nAmortization of original issue discount and loan costs\nInterest on tax uncertainties\n\nItem 7 - Management’s Discussion and Analysis of Financial Condition and Results of Operations\nThe following discussion and analysis summarizes the significant factors affecting our consolidated operating results, financial condition, liquidity and capital resources during the two-year period ended January 31, 2025 (our fiscal years 2024 and 2023). Unless otherwise noted, all references herein for the years 2024, 2023, and 2022 represent the fiscal years ended January 31, 2025, February 2, 2024, and February 3, 2023, respectively. Fiscal years 2024 and 2023 contained 52 weeks of operating results compared to fiscal year 2022, which contained 53 weeks. We intend for this discussion to provide the reader with information that will assist in understanding our financial statements, the changes in certain key items in those financial statements from year to year, and the primary factors that accounted for those changes, as well as how certain accounting principles affect our financial statements. This discussion should be read in conjunction with our consolidated financial statements and notes to the consolidated financial statements included in this Annual Report that have been prepared in accordance with accounting principles generally accepted in the United States of America. This discussion and analysis is presented in four sections:\nFinancial Condition, Liquidity and Capital Resources\nCritical Accounting Policies and Estimates\nEXECUTIVE OVERVIEW\nThe following table highlights our annual financial results:\n(in millions, except per share data)\nDiluted earnings per share\nNet cash provided by operating activities\nCapital expenditures\nRepurchases of common stock\nCash dividend payments\nThe fiscal year ended February 3, 2023 had 53 weeks. The fiscal years ended January 31, 2025 and February 2, 2024 had 52 weeks.\nRepurchases of common stock on a trade-date basis.\nNet sales for fiscal 2024 decreased\n. Comparable sales for fiscal 2024 decreased\n3.0% decrease in comparable customer transactions, and a 0.3% increase in comparable average ticket\n. Net earnings for fiscal 2024 de\ncreased 10.0% to $7.0 billion. Diluted earnings per common share decreased 7.4% in fiscal 2024 to $12.23 from $13.20 in fiscal 2023.\n2024 results is pre-tax income of $177 million associated with the fiscal 2022 sale of the Canadian retail business, w\nincreased diluted earnings per share by $0.24\n. Included in the fiscal 2023 results is $63 million of pre-tax income associated with the sale of the Canadian retail business, which increased diluted earnings per share by $0.11 in fiscal year 2023. Adjusting for these items, adjusted diluted earnings per common share decreased 8.4% to $11.99 in 2024 from adjusted diluted earnings per common share of $13.09 in 2023 (see the\nnon-GAAP financial measures\nFor fiscal 2024, cash flows from operating activities wer\n, with $1.9 billion used for capital expenditures. Continuing to deliver on our commitment to return excess cash to shareholders, the Company repurchased\nin dividends during the year.\nMacroeconomic factors, such as ongoing inflation and higher interest rates resulting in depressed levels of housing turnover, continued to exert downward pressure on big-ticket DIY discretionary spending in fiscal 2024. Despite these factors, we generated positive Pro customer comparable sales and increased Pro penetration for the year. This is the result of our cumulative investments in the right brands and products, greater inventory depth, improved job site delivery, dedicated service levels, and the Pro customer digital experience. In addition, our strong online performance gives us confidence that our focus on an intuitive user experience and omnichannel fulfillment capabilities, specifically more same-day delivery options and an improved Buy Online Pickup in Store experience, are resonating with our customers.\n\nThe core demand drivers of our business that we track remain unchanged: disposable personal income, home price appreciation, and the age of the housing stock. We believe these drivers will sustain long-term demand as homeowners invest in repairs and upgrades. Trends such as millennial household formation, the elderly preference to age in place, and the persistence of remote work also support home improvement market demand. While these demand drivers remain supportive, broader market uncertainties also exist around tariffs, tax policy, and the overall geopolitical environment. We remain focused on delivering strong operating performance, while continuing to make the right long-term investments for growth. This includes executing at a high level through the near-term market pressures by driving productivity, managing costs, and investing in our updated Total Home strategy while continuing to drive sustainable, long-term shareholder value.\nOPERATIONS\nThe following table sets forth the percentage relationship to net sales of each line item of the consolidated statements of earnings. This table should be read in conjunction with the following discussion and analysis and the consolidated financial statements, including the related notes to the consolidated financial statements.\nBasis Point Increase/(Decrease) in\n\nNet interest expense in fiscal 2024 leveraged three basis points.\nIncome Tax Provision\n– Our effective income tax rate was 24.0% in fiscal 2024 compared to 24.1% in fiscal 2023.\nFiscal 2023 Compared to Fiscal 2022\nFor a comparison of our results of operations, financial condition, liquidity, and capital resources for the fiscal years ended February 2, 2024, and February 3, 2023, see “\nPart II, Item 7. Management’s Discussion and Analysis of Financial Condition a\nnd Results of Operations\nNon-GAAP Financial Measures\nAdjusted Diluted Earnings Per Share\nAdjusted diluted earnings per share is considered a non-GAAP financial measure. The Company believes this non-GAAP financial measure provides useful insight for analysts and investors in understanding the comparison of operational performance for fiscal 2024 and fiscal 2023. Adjusted diluted earnings per share excludes the impact of certain items, further described below, not contemplated in the Company’s business outlook for fiscal 2024 and fiscal 2023.\nIn fiscal 2024, the Company recognized pre-tax income of $177 million consisting of realized gains on the contingent consideration associated with the fiscal 2022 sale of the Canadian retail business (Canadian retail business transaction).\nIn fiscal 2023, the Company recognized pre-tax income of $63 million consisting of a realized gain on the contingent consideration and adjustments to the selling price associated with the fiscal 2022 sale of the Canadian retail business (Canadian retail business transaction).\nAdjusted diluted earnings per share should not be considered an alternative to, or more meaningful indicator of, the Company’s diluted earnings per common share as prepared in accordance with GAAP. The Company’s methods of determining this non-GAAP financial measure may differ from the method used by other companies and may not be comparable.\nDiluted earnings per share, as reported\n\nRepresents the tax benefit or expense related to the item excluded from adjusted diluted earnings per share.\nReturn on Invested Capital\nReturn on Invested Capital (ROIC) is calculated using a non-GAAP financial measure. Management believes ROIC is a meaningful metric for analysts and investors as a measure of how effectively the Company is using capital to generate financial returns. Although ROIC is a common financial metric, numerous methods exist for calculating ROIC. Accordingly, the method used by our management may differ from the methods used by other companies. We encourage you to understand the methods used by another company to calculate ROIC before comparing its ROIC to ours.\nWe define ROIC as the rolling 12 months’ lease adjusted net operating profit after tax (Lease adjusted NOPAT) divided by the average of current year and prior year ending debt and shareholders’ deficit. Lease adjusted NOPAT is a non-GAAP financial measure, and net earnings is considered to be the most comparable GAAP financial measure. The calculation of ROIC, together with a reconciliation of net earnings to Lease adjusted NOPAT, is as follows:\n(In millions, except percentage data)\nCalculation of Return on Invested Capital\nInterest expense – net\nOperating lease interest\nProvision for income taxes\nLease adjusted net operating profit\nIncome tax adjustment\nLease adjusted net operating profit after tax\nAverage debt and shareholders’ deficit\nNet earnings to average debt and shareholders’ deficit\n\nFor the year ended January 31, 2025, February 2, 2024, and February 3, 2023, return on invested capital was impacted by approximately 44 basis points, 19 basis points, an\nbasis points, respectively, as a result of the sale of the Canadian retail business.\nFINANCIAL CONDITION, LIQUIDITY AND CAPITAL RESOURCES\nSources of Liquidity\nCash flows from operations, combined with our continued access to capital markets on both a short-term and long-term basis, as needed, remain adequate to fund our operations, make strategic investments to support long-term growth, return excess cash to shareholders in the form of dividends and share repurchases, and repay debt maturities as they become due. We believe these sources of liquidity will continue to support our business for the next twelve months. As of January 31, 2025, we held\n$1.8 billion of cash and cash equivalents, as well as $4.0 billion in undrawn capacity on our revolving credit facilities.\nAs of January 31, 2025, our material contractual obligations and commercial commitments consist of leases, long-term debt, purchase obligations, and letters of credit. See\nof the Notes to the Consolidated Financial Statements in\n\nIncome tax adjustment is defined as net operating profit multiplied by the effective tax rate, which was 24.0%, 24.1%, and 28.8% for fiscal 2024, fiscal 2023, and fiscal 2022, respectively.\nAverage debt and shareholders’ deficit is defined as average current year and prior year ending debt, including current maturities, short-\nterm borrowings, and operating lease liabilities, plus the average current year and prior year ending total shareholders’ deficit.\n\nNon-GAAP adjustments – per share impacts\nCanadian retail business transaction\nAdjusted diluted earnings per share",
  "item2_clean": null
}