{
  "source_file": "low-20251031.htm",
  "form_type": "10-Q",
  "item1_clean": null,
  "item7_clean": null,
  "item2_clean": "Repurchases of common stock on a trade-date basis.\nNet sales in the third quarter of fiscal 2025 improved 3.2% to $20.8 billion compared to net sales of $20.2 billion in the third quarter of fiscal 2024. Comparable sales for the third quarter of fiscal 2025 increased 0.4%, consisting of an increase in comparable average ticket of 3.4%, partially offset by a decrease of 3.0% in comparable customer transactions. Net earnings in the third quarter of fiscal 2025 were $1.6 billion, compared to net earnings of $1.7 billion in the third quarter of fiscal 2024. Diluted earnings per common share were $2.88 in the third quarter of fiscal 2025 compared to $2.99 in the third quarter of fiscal 2024. Included in the third quarter of 2025 results were pre-tax expenses of $129 million consisting of transaction costs and intangible asset amortization related to the acquisitions of Artisan Design Group (ADG) and Foundation Building Materials (FBM). Excluding the impact of these items, adjusted diluted earnings per common share was $3.06 in the third quarter of 2025 (see the\nnon-GAAP financial measures\nFor the first nine months of fiscal 2025, cash flows from operating activities were approximately $8.3 billion, with $1.6 billion used for capital expenditures. During the three months ended October 31, 2025, we closed on the acquisition of FBM for $8.8 billion. In addition, we paid $673 million in dividends, continuing to deliver on our commitment to return cash to shareholders.\nDuring the third quarter, we saw strength across all five key initiatives of our 2025 Total Home strategy. Our continued Pro growth is driven by our focus on enhancing the products and services offerings to the Pro customers. In addition, we delivered double-digit online sales growth through increased traffic and continued strong conversion rates. We are also leveraging our loyalty ecosystem to gain deeper customer insights which enable tailored, value-enhancing offers through data-driven marketing. Home services also delivered double-digit growth driven in-part by our technology enabled solutions which have enhanced the experience of our customers, installers, and associates by accelerating the process from inquiry to completed installation through intuitive scheduling, quoting, and payment solutions. Lastly, we continued to focus on increasing space productivity to drive incremental sales opportunities. We expanded our rural format as well as our workwear and pet assortments to additional locations, while also making progress on our SKU rationalization efforts.\nThe acquisitions of ADG and FBM will create a comprehensive interior solution for our home builders by expanding our product portfolio and strengthening our fulfillment capabilities.\nOverall, we were encouraged to see modest improvement in DIY customer engagement in the third quarter as we continued to navigate an uncertain macro environment. Affordability and uncertainty in the broader economy continue to weigh on consumer confidence in the near term. Looking ahead we expect lower interest rates will help drive demand for the Company’s products and services. The combination of strong fundamentals, substantial home equity, and the potential for lower interest rates in the future, gives us confidence in the long-term health of the home improvement industry, and we remain confident that continued execution of our Total Home strategy will position us to capitalize on the expected recovery in housing and home improvement.\nDuring the year, the United States has enacted significant changes to its trade policy and imposed tariffs on imported goods from a number of countries. The Company has been, and continues to, monitor these trade policies and their ongoing impacts on the cost of our inventory. We will also continue to evaluate adjustments to our merchandise assortment, pricing, and global supply chain strategies, including continued country of origin diversification, as potential mitigating actions.\nOPERATIONS\nThe following table sets forth the percentage relationship to net sales of each line item of the consolidated statements of earnings (unaudited), as well as the percentage change in dollar amounts from the prior period. This table should be read in conjunction with the following discussion and analysis and the consolidated financial statements (unaudited), including the related notes to the consolidated financial statements (unaudited).\nBasis Point Increase/(Decrease) in Percentage of Net Sales\nBasis Point Increase/(Decrease) in Percentage of Net Sales\n\nIncome tax adjustment is defined as lease adjusted net operating profit multiplied by the effective tax rate, which was 24.2% and 23.8% for the periods ended October 31, 2025, and November 1, 2024, respectively.\nAverage debt and shareholders’ deficit is defined as average current year and prior year ending debt, including current maturities, short-term borrowings, and operating lease liabilities, plus the average current year and prior year ending total shareholders’ deficit.\nResults of Operations\nNet sales in the third quarter of 2025 increased 3.2% to $20.8 billion. Comparable sales increased 0.4%, consisting of a 3.4% increase in comparable average ticket, partially offset by a 3.0% decline in comparable customer transactions.\nDuring the third quarter of 2025, ten of our 14 product categories experienced positive comparable store sales, led by Rough Plumbing, Appliances, Paint and Flooring. Strength in these categories reflects continued growth with our Pro customer and online, as well as our broad assortment of appliances available next-day to our customers in the majority of the United States.\nNet sales increased 0.9% to $65.7 billion for the first nine months of 2025 compared to 2024. Comparable sales declined 0.1% over the same period, driven by a 3.0% decline in comparable customer transactions, partially offset by a comparable average ticket increase of 2.9%.\nFor the third quarter of 2025, gross margin as a percentage of sales increased fifty basis points compared to 2024. The gross margin improvement for the quarter was driven by cycling storm pressures from the prior year, as well as improvements in credit revenue and better sell-through of inventory as part of item rationalization efforts.\nGross margin as a percentage of sales increased thirty-five basis points in the first nine months of 2025 compared to 2024, primarily due to cycling storm pressures from the prior year, as well as improvements in credit revenue.\nSG&A –\nFor the third quarter of 2025, SG&A expense deleveraged 102 basis points as a percentage of sales compared to the third quarter of 2024, primarily due to cycling the prior year gain on contingent consideration associated with the fiscal 2022 sale of the Canadian retail business, expenses associated with the acquisitions of ADG and FBM, along with an increase in employee compensation and benefits.\nSG&A expense as a percentage of sales deleveraged 63 basis points as a percentage of sales for the first nine months of 2025 compared to 2024, primarily due to the same factors that impacted SG&A for the third quarter.\nDepreciation and Amortization –\nDepreciation and amortization deleveraged 13 basis points as a percentage of sales for the third quarter of 2025 compared to 2024.\nDepreciation and amortization deleveraged 13 basis points as a percentage of sales for the first nine months of 2025 compared to 2024.\n– Net interest expense for the third quarter of 2025 deleveraged 12 basis points as a percentage of sales primarily due to the costs related to the bridge financing for the FBM acquisition.\nNet interest expense for the first nine months of 2025 deleveraged one basis point as a percentage of sales.\nIncome Tax Provision –\nOur effective income tax rates were 24.1% and 23.6% for the three months ended October 31, 2025 and November 1, 2024, respectively, and 24.0% and 23.8% for the nine months ended October 31, 2025 and November 1, 2024, respectively.\nFINANCIAL CONDITION, LIQUIDITY AND CAPITAL RESOURCES\nSources of Liquidity\nCash flows from operations, combined with our continued access to capital markets on both a short-term and long-term basis, as needed, remain adequate to fund our operations, make strategic investments to support long-term growth, return cash to shareholders in the form of dividends, and repay debt maturities as they become due. We believe these sources of liquidity will continue to support our business for the next twelve months. As of October 31, 2025, we held $0.6 billion of cash and cash equivalents, as well as $5.0 billion in undrawn capacity on our Revolving Credit Facilities at quarter end.\nCash Flows Provided by Operating Activities\nNet cash provided by operating activities\nCash flows from operating activities continued to provide the primary source of our liquidity. The decrease in net cash provided by operating activities for the nine months ended October 31, 2025, compared to the nine months ended November 1, 2024, was\nprimarily driven by the timing of income tax payments in the third quarter of fiscal 2025 which were previously deferred under the income tax relief announced by the IRS for businesses impacted by Hurricane Helene.\n\nUnder the amendment, borrowings under the 2023 Credit Agreement will no longer be subject to a SOFR credit spread adjustment.\nThe 2025 Credit Agreement and the 2023 Credit Agreement (collectively the Long-Term Credit Agreements) support the Company’s commercial paper program. The amounts available to be drawn under the Long-Term Credit Agreements are reduced by the amount of borrowings under the commercial paper program. As of October 31, 2025, November 1, 2024, and January 31, 2025, there were no outstanding borrowings under the Company’s commercial paper program or the Long-Term Credit Agreements.\nOn September 16, 2025, the Company also entered into a $1.0 billion 364-day unsecured revolving credit agreement (collectively with the Long-Term Credit Agreements the"
}