{
  "source_file": "lrcx-20250629.htm",
  "form_type": "10-K",
  "item1_clean": "EOS\n, and SP Series Product Families\nWafer cleaning is performed repeatedly during semiconductor device manufacturing and is a critical process that affects product yield and reliability. Unwanted microscopic materials - some no bigger than the tiny structures themselves - need to be cleaned effectively. At the same time, these processes must selectively remove residues that are chemically similar to the device films. For advanced WLP, the wet clean steps used between processes that form the package and external wiring have surprisingly complex requirements. These processes are called on to completely remove specific materials and leave other fragile structures undisturbed. In IoT products that include power devices, MEMS and image sensors, there is a unique requirement for wafer backside wet etch to uniformly thin the silicon wafer while protecting the device side of the wafer.\nBased on our pioneering single-wafer spin technology, the DV-Prime\nproducts provide the process flexibility needed with high productivity to address a wide range of wafer cleaning steps throughout the manufacturing process flow. As the latest of Lam’s wet clean products, EOS\ndelivers exceptionally low on-wafer defectivity and high throughput to address progressively demanding wafer cleaning applications. With a broad range of process capability, our SP Series products deliver cost-efficient, production-proven wet clean and silicon wet etch solutions for challenging WLP and IoT applications.\nFiscal Periods Presented\nAll references to fiscal years apply to our fiscal years, which ended June 29, 2025, June 30, 2024, and June 25, 2023.\nResearch and Development\nThe market for semiconductor capital equipment is characterized by rapid technological change and product innovation. Our ability to achieve and maintain our competitive advantage depends in part on our continued and timely development of new products and enhancements to existing products. Accordingly, we devote a significant portion of our personnel and financial resources to research and development (“R&D”) programs and seek to maintain close and responsive relationships with our customers and suppliers.\nWe believe current challenges for customers at various points in the semiconductor manufacturing process present opportunities for us. We expect to continue to make substantial investments in R&D to meet our customers’ product needs, support our growth strategy, and enhance our competitive position.\nMarketing, Sales, and Service\nOur marketing, sales, and service efforts are focused on building long-term relationships with our customers and targeting product and service solutions designed to meet their needs. These efforts are supported by a team of product marketing and sales professionals as well as equipment and process engineers who work closely with individual customers to develop solutions for their wafer processing needs. We maintain ongoing service relationships with our customers and have an extensive network of service engineers in place throughout the United States (“U.S.”), China, Europe, India, Japan, Korea, Southeast Asia, and Taiwan. We believe that comprehensive support programs and close working relationships with customers are essential to maintaining high customer satisfaction and our competitiveness in the marketplace.\nWe provide standard warranties for our systems. The warranty provides that systems will be free from defects in material and workmanship and will conform to agreed-upon specifications. The warranty is limited to repair of the defect or replacement with new or like-new equivalent goods and is valid when the buyer provides prompt notification within the warranty period of the claimed defect or non-conformity and also makes the items available for inspection and repair.\nLam Research Corporation 2025 10-K\nA significant portion of our sales and operations occur outside the United States and, therefore, may be subject to certain risks, including but not limited to compliance with U.S. and international laws and regulations, including U.S. export restrictions; tariffs and other barriers; difficulties in staffing and managing non-U.S. operations; adverse tax consequences; foreign currency exchange rate fluctuations; changes in currency controls; and economic and political conditions. Any of these factors may have a material adverse effect on our business, financial position, and results of operations and cash flows. For geographical reporting, revenue is attributed to the geographic location in which the customers’ facilities are located. Refer to\nOur customers include many of the world’s leading semiconductor manufacturers. Customers continue to establish joint ventures, alliances, and licensing arrangements which have the potential to positively or negatively impact our competitive position and market opportunities. Refer to\nof our Consolidated Financial Statements, included in Part II, Item 8 of this report, for information concerning customer concentrations. Our most significant customers during the fiscal years ending June 29, 2025, June 30, 2024, and June 25, 2023 included Samsung Electronics Company, Ltd. and Taiwan Semiconductor Manufacturing Company.\nA material reduction in orders from our customers could adversely affect our results of operations and projected financial condition. Our business depends upon the expenditures of semiconductor manufacturers. Semiconductor manufacturers’ businesses, in turn, depend on many factors, including their economic capability, the current and anticipated market demand for ICs, and the availability of equipment capacity to support that demand.\nOur manufacturing operations mainly consist of assembling and testing components, sub-assemblies, and modules that are then integrated into finished systems prior to shipment to or at the location of our customers. The assembly and testing of our products is conducted predominately in cleanroom environments.\nWe have agreements with third parties to outsource certain aspects of our manufacturing, production warehousing, and logistics functions. These outsourcing contracts may provide us more flexibility to scale our operations up or down in a timely and cost-effective manner. We believe that we have selected reputable providers and have secured their performance on terms documented in written contracts. However, it is possible that one or more of these providers could fail to perform as we expect, and such failure could have an adverse impact on our business and have a negative effect on our operating results and financial condition. Overall, we believe we have effective mechanisms to manage risks associated with our outsourcing relationships. Refer to\nof our Consolidated Financial Statements, included in Part II, Item 8 of this report, for further information concerning our outsourcing commitments, reported as a component of purchase obligations.\nCertain components and sub-assemblies that we include in our products may only be obtained from a single supplier. We are engaged in efforts to obtain and qualify alternative sources to supply these products and in some circumstances protect against potential supply challenges by carrying inventory in excess of current need. Any prolonged inability to obtain these components could have an adverse effect on our operating results and could unfavorably impact our customer relationships.\nCompliance with Government Regulations\nAs a public company with global operations, we are subject to a variety of governmental regulations across multiple jurisdictions, including those related to export controls, financial and other disclosures, corporate governance, anti-trust, intellectual property, privacy, anti-bribery, anti-corruption, anti-boycott, tax, tariffs, labor, health and safety, conflict minerals, human trafficking, the management of hazardous materials, and carbon emissions, among others. Each of these regulations imposes costs on our business and has the potential to divert our management’s time and attention from revenue-generating and other profit maximizing activities to those associated with compliance. Efforts to comply with new and changing regulations have resulted in, and are likely to continue to result in, decreased net income and increased capital expenditures. If we are alleged or found by a court or regulatory agency not to be in compliance with regulations, we may be subject to fines, restrictions on our actions, reputational damage, and harm to our competitive position, and our business, financial condition, and/or results of operations could be adversely affected. For additional details, please refer to “Legal, Regulatory and Tax Risks – We Are Exposed to Various Risks from Our Regulatory Environment” in\n\nIncorporated in 1980, Lam Research Corporation (“Lam Research,” “Lam,” “we,” “our,” “us,” or the “Company”) is a Delaware corporation, headquartered in Fremont, California. We maintain a network of facilities throughout Asia, Europe, and the United States in order to meet the needs of our dynamic customer base.\nLam Research Corporation 2025 10-K\nThe Lam Research logo, Lam Research, and all product and service names used in this report are either registered trademarks or trademarks of Lam Research Corporation or its subsidiaries in the United States and/or other countries. All other marks mentioned herein are the property of their respective holders.\nWe are a global supplier of innovative wafer fabrication equipment and services to the semiconductor industry. We have built a strong global presence with core competencies in areas such as nanoscale manufacturing enablement, chemistry, plasma and fluidics, advanced systems engineering, and a broad range of operational disciplines. Our products and services are designed to help our customers build smaller and better performing devices that are used in a variety of electronic products, including mobile phones, personal computers, cloud and enterprise servers, wearables, automotive vehicles, and data storage devices.\nOur customer base includes leading semiconductor memory, foundry, and integrated device manufacturers (“IDMs”) that make products such as non-volatile memory (“NVM”), dynamic random-access memory (“DRAM”), and logic devices. Their continued success is part of our commitment to driving semiconductor breakthroughs that define the next generation. Our core technical competency is integrating hardware, process, materials, software, and process control enabling results on the wafer.\nSemiconductor manufacturing, our customers’ business, involves the fabrication of multiple dies or integrated circuits (“ICs”) on a wafer. This involves the repetition of a set of core processes and can require hundreds of individual steps. Fabricating these devices requires a sequence of highly sophisticated process technologies to integrate an increasing array of new materials with precise control at the atomic scale. Along with meeting technical requirements, wafer processing equipment must deliver high productivity and be cost-effective.\nDemand from cloud computing (the “Cloud”)\nartificial intelligence, 5G, the Internet of Things (“IoT”), and other markets is driving the need for increasingly powerful and cost\nefficient semiconductors. At the same time, there are growing technical challenges with traditional two-dimensional scaling. These trends are driving significant inflections in semiconductor manufacturing, such as the increasing importance of vertical scaling strategies like three-dimensional (“3D”) architecture as well as multiple patterning to enable shrinks.\nWe believe we are in a strong position with our leadership and expertise in deposition\netch, and clean markets to facilitate some of the most significant innovations in semiconductor device manufacturing. Several factors create opportunity for sustainable differentiation for us: (i) our focus on research and development, with several on-going programs relating to sustaining engin",
  "item7_clean": "(in thousands, except per share data, percentages and basis points)\nGross margin as a percent of total revenue\nTotal operating expenses\nNet income per diluted share\nFiscal year 2025 revenue increased 23.7% compared to fiscal year 2024, driven by strong customer demand for semiconductor equipment systems as well as customer support-related revenues from customer investments across memory and non-memory markets. Gross margin as a percentage of revenue increased in fiscal year 2025 compared to fiscal year 2024 largely due to improved factory efficiencies and favorable product mix, partially offset by increased transformational charges. The increase in operating expenses in fiscal year 2025 compared to fiscal year 2024 was driven by higher employee-related costs primarily as a result of increased headcount, increased spending on transformational activities, and higher outside service expense.\nFiscal year 2024 revenue decreased 14.5% compared to fiscal year 2023.\nSystems and customer-support related revenues declined in fiscal year 2024 primarily from weakness in the non-volatile memory market, partially offset by strength in\ns well as increased revenue generation from our China regional customers. Gross margin as a percentage of revenue increased in fiscal year\ncompared to fiscal year\nlargely due to a more favorable customer mix, lower spending on material costs, and higher field resource utilization, partially offset by lower factory efficiencies. The increase in operating expenses in fiscal year\ncompared to fiscal year\nwas driven by higher employee-related costs primarily as a result of increased research and development-related headcount, increased spending on transformational activities, higher deferred compensation plan-related costs, and increased spending on supplies.\nWe aim to balance the requirements of our customers with the availability of resources, as well as performance to our operational and financial objectives. As a result, from time to time, we exercise discretion and judgment as to the timing and prioritization of manufacturing and deliveries of products, which has impacted, including in the current fiscal year, and may in the future impact, the timing of revenue recognition with respect to such products.\nOur cash and cash equivalents and restricted cash balances totaled approximately $6.4 billion as of June 29, 2025, compared to $5.9 billion as of June 30, 2024. Cash flows provided from operating activities were $6.2 billion for fiscal year 2025 compared to $4.7 billion for fiscal year 2024. Cash flows provided from operating activities in fiscal year 2025 were primarily used for $3.4 billion in treasury stock purchases, including net share settlement of employee stock-based compensation; $1.1 billion in dividends paid to our stockholders; $759 million of capital expenditures; and $507 million of principal payment on debt instruments and debt issuance costs.\nResults of Operations\n\n(in thousands, except percentages and basis points)\nThe decrease in the effective tax rate in fiscal year 2025 as compared to fiscal year 2024 was primarily due to the recognition of previously unrecognized tax benefits from lapses of statutes of limitation in fiscal year 2025 and the change in level and proportion of income in higher and lower tax jurisdictions.\nThe increase in the effective tax rate in fiscal year 2024 compared to fiscal year 2023 was primarily due to the change in level and proportion of income in higher and lower tax jurisdictions.\nInternational revenues account for a significant portion of our total revenues, such that a material portion of our pre-tax income is earned and taxed outside the United States. International pre-tax income is taxable in the United States at a lower effective tax rate than the federal statutory tax rate. Please refer to\nNote 7: Income Taxes\nOn July 4, 2025, the One Big Beautiful Bill Act (\"OBBBA\") was signed into law by U.S. President Donald Trump. The impact on income taxes due to change in legislation is required, under Accounting Standards Codification (“ASC”) 740, Income Taxes, to be recognized in the period in which the law is enacted, which is during our fiscal year 2026. In general, the OBBBA introduces changes to U.S. taxation, including changes in the taxation of non-U.S. income. We are currently assessing the potential implications of these changes to our fiscal year 2026 Consolidated Financial Statements.\nDeferred Income Taxes\nDeferred income taxes reflect the net tax effect of temporary differences between the carrying amounts of assets and liabilities for financial reporting purposes and the amounts used for income tax purposes, as well as the tax effect of carryforwards. Our gross deferred tax assets were $1,897 million and $1,516 million at the end of fiscal years 2025 and 2024, respectively. These gross deferred tax assets were offset by gross deferred tax liabilities of $197 million and $218 million and a valuation allowance primarily representing our entire California deferred tax asset balance due to the single sales factor apportionment resulting in lower taxable income in California of $424 million and $389 million at the end of fiscal years 2025 and 2024, respectively. The change in gross deferred tax assets, gross deferred tax liabilities, and valuation allowance between fiscal year 2025 and 2024 is primarily due to increases in gross deferred tax assets for outside basis differences of foreign subsidiaries.\nWe evaluate if the deferred tax assets are realizable on a quarterly basis and will continue to assess the need for changes in valuation allowances, if any.\nUncertain Tax Positions\nWe re-evaluate uncertain tax positions on a quarterly basis. This evaluation is based on factors including, but not limited to, changes in facts or circumstances, changes in tax law, effectively settled issues under audit, and new audit activity. Any change in recognition or measurement would result in the recognition of a tax benefit or an additional charge to the tax provision.\nLam Research Corporation 2025 10-K\nCritical Accounting Policies and Estimates\nA critical accounting policy is defined as one that has both a material impact on our financial condition and results of operations and requires us to make difficult, complex and/or subjective judgments, often as a result of the need to make estimates about matters that are inherently uncertain. The preparation of financial statements in conformity with U.S. generally accepted accounting principles (“GAAP”) requires management to make certain judgments, estimates and assumptions that could affect the reported amounts of assets and liabilities at the date of the financial statements and the reported amounts of revenue and expenses during the reporting period. We base our estimates and assumptions on historical experience and on various other assumptions we believe to be applicable and evaluate them on an ongoing basis to ensure they remain reasonable under current conditions. Actual results could differ significantly from those estimates, which could have a material impact on our business, results of operations, and financial condition. Our critical accounting estimates include:\nthe recognition and valuation of revenue;\nthe valuation of inventory, which impacts gross margin; and\nthe recognition and measurement of current and deferred income taxes, including the measurement of uncertain tax positions, which impact our provision for income tax expenses.\nWe believe that the following critical accounting policies reflect the more significant judgments and estimates used in the preparation of our consolidated financial statements regarding the critical accounting estimates indicated above. See\nNote 2: Summary of Significant Accounting Policies\nRevenue Recognition:\nWe generally consider documentation of terms with an approved purchase order as a customer contract, provided that collection is considered probable, which is assessed based on the creditworthiness of the customer as determined by credit checks, payment histories, and/or other circumstances. The transaction price for our contracts with customers is allocated among the identified performance obligations and consists of both fixed and variable consideration provided it is probable that a significant reversal of revenue will not occur when the uncertainty related to variable consideration is resolved. Fixed consideration includes amounts to be contractually billed to the customer while variable consideration includes estimates for discounts and credits for future usage which are based on contractual terms outlined in volume purchase agreements and other factors known at the time. We generally invoice customers at shipment and for professional services as provided. Revenue for systems and spares are recognized at a point in time, which is generally upon shipment or delivery. Revenue from services is recognized over time as services are completed or ratably over the contractual period of generally one year or less. Revenue is recognized in an amount that reflects the consideration to which we expect to be entitled in exchange for those goods or services.\n\nManagement’s Discussion and Analysis of Financial Condition and Results of Operations\nManagement’s Discussion and Analysis of Financial Condition and Results of Operations (“MD&A”) provides a description of our results of operations and should be read in conjunction with our Consolidated Financial Statements and accompanying Notes to Consolidated Financial Statements included in\nprovides a summary of the key highlights of our results of operations and our management’s assessment of material trends and uncertainties relevant to our business.\nResults of Operations\nprovides an analysis of operating results.\nCritical Accounting Policies and Estimates\ndiscusses accounting policies that reflect the more significant judgments and estimates used in the preparation of our Consolidated Financial Statements.\nLiquidity and Capital Resources\nprovides an analysis of cash flows, contractual obligations, and financial position.\nLam Research Corporation is a global supplier of innovative wafer fabrication equipment and services to the semiconductor industry. We have built a strong global presence with core competencies in areas like nanoscale manufacturing enablement, chemistry, plasma and fluidics, advanced systems engineering and a broad range of operational disciplines. Our products and services are designed to help our customers build smaller and better performing devices that are used in a variety of electronic products, including mobile phones, personal computers, cloud and enterprise servers, wearables, automotive vehicles, and data storage devices.\nOur customer base includes leading semiconductor memory, foundry, and integrated device manufacturers that make products such as NVM, DRAM, and logic devices. Their continued success is part of our commitment to driving semiconductor breakthroughs that define the next generation. Our core technical competency is integrating hardware, process, materials, software, and process control, enabling results on the wafer.\nSemiconductor manufacturing, our customers’ business, involves the fabrication of multiple dies or integrated circuits on a wafer. This involves the repetition of a set of core processes and can require hundreds of individual steps. Fabricating these devices requires a sequence of highly sophisticated process technologies to integrate an increasing array of new materials with precise control at the atomic scale. Along with meeting technical requirements, wafer processing equipment must deliver high productivity and be cost-effective.\nDemand from cloud computing, artificial intelligence, 5G, the Internet of Things, and other markets is driving the need for increasingly powerful and cost\nefficient semiconductors. At the same time, there are growing technical challenges with traditional two-dimensional scaling. These trends are driving significant inflections in semiconductor manufacturing, such as the increasing importance of vertical scaling strategies like three-dimensional architecture as well as multiple patterning to enable shrinks.\nWe believe we are in a strong position with our leadership and expertise in deposition\netch, and clean markets to facilitate some of the most significant innovations in semiconductor device manufacturing. Our Customer Support Business Group provides products and services to maximize installed equipment performance, predictability, and operational efficiency. Several factors create opportunities for sustainable differentiation for us: (i) our focus on research and development, with several on-going programs relating to sustaining engineering, product and process development, and concept and feasibility; (ii) our ability to effectively leverage cycles of learning from our broad installed base; (iii) our collaborative focus with semi-ecosystem partners, including our close-to-customer focus; (iv) our ability to identify and invest in the breadth of our product portfolio to meet technology inflections; and (v) our focus on delivering our multi-product solutions with a goal to enhance the value of Lam’s solutions to our customers.\nWafer fabrication equipment spending levels were strong in the 2025 fiscal year driven by an increase in both the memory and non-memory market segments. In the short term, volatility in the semiconductor industry environment from trade restrictions, tariffs, as well as other direct and indirect risks and uncertainties, have had, and in the future may have, a negative impact on our revenue and operating margin. Over the longer term, we believe that secular demand for semiconductors, combined with technology inflections in our industry, including 3D device scaling, multiple patterning, process flow, and advanced packaging chip integration, will drive sustainable growth and lead to an increase in the served available market for our products and services in the deposition, etch, and clean businesses.\nLam Research Corporation 2025 10-K\nOn October 2, 2024, the Company effected a ten-for-one stock split of its common stock and a proportional increase in the number of authorized shares. All references made to share or per share amounts throughout this Management’s Discussion and Analysis of Financial Condition and Results of Operations have been retroactively adjusted to reflect the stock split.\nThe following table summarizes certain key financial information for the periods indicated below:\n\nInventory Valuation:\nInventories are stated at the lower of cost or net realizable value using standard costs that approximate actual cost on a first-in, first-out basis. Inventory in excess of management’s estimated usage requirement and obsolete inventory is written down to its estimated net realizable value if less than cost. Estimates of net realizable value include but are not limited to customer demand, management’s forecasts related to our future manufacturing schedules, technological and/or market obsolescence, general semiconductor market conditions, and possible alternative uses.\nDeferred income taxes reflect the net tax effect of temporary differences between the carrying amount of assets and liabilities for financial reporting purposes and the amounts used for income tax purposes, as well as the tax effect of carryforwards. We record a valuation allowance to reduce our deferred tax assets to the amount that is more likely than not to be realized. The assessment of valuation allowances against our deferred tax assets includes estimation and judgement with respect to future operating results and market conditions. We have an accounting policy election to record deferred taxes related to Global Intangible Low-Taxed Income (“GILTI”).\nWe recognize the benefit from a tax position only if it is more likely than not that the position will be sustained upon audit based solely on the technical merits of the tax pos",
  "item2_clean": null
}