{
  "source_file": "lulu-20250803.htm",
  "form_type": "10-Q",
  "item1_clean": null,
  "item7_clean": null,
  "item2_clean": "ITEM 2. MANAGEMENT'S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS\nThese forward-looking statements are based on our current expectations and assumptions, are subject to risks and uncertainties, and may differ materially from actual results due to various factors, including those described under \"Risk Factors\" and elsewhere in this report. We undertake no obligation to update any forward-looking statements, except as required by applicable law.\nOur fiscal year ends on the Sunday closest to January 31 of the following year, typically resulting in a 52-week year, but occasionally giving rise to an additional week, resulting in a 53-week year. Fiscal 2025 will end on February 1, 2026 and will be a 52-week year. Fiscal 2024 was a 53-week year and ended on February 2, 2025. Fiscal 2025 and fiscal 2024 are referred to as \"2025,\" and \"2024,\" respectively. The first two quarters of 2025 and 2024 ended on August 3, 2025 and July 28, 2024, respectively.\nComponents of this MD&A include:\nFinancial Highlights and Market Conditions and Trends\nQuarter-to-Date Results of Operations\nYear-to-Date Results of Operations\nNon-GAAP Financial Measures\nLiquidity and Capital Resources\nCritical Accounting Policies and Estimates\nWe use comparable sales as a metric to evaluate the performance of our business. Due to the 53rd week in 2024, comparable sales are calculated on a one-week shifted basis such that the 13 or 26 weeks ended August 3, 2025 is compared to the 13 or 26 weeks ended August 4, 2024 rather than July 28, 2024. Refer to the Comparable Sales section of this MD&A for further information.\nWe provide constant dollar changes, which is a non-GAAP financial measure, as supplemental information to help investors understand the underlying growth rate of net revenue excluding the impact of changes in foreign currency exchange rates. Refer to the Non-GAAP Financial Measures section of this MD&A for reconciliations between the non-GAAP financial measures and the most directly comparable measures calculated in accordance with GAAP.\nWe disclose material non-public information through one or more of the following channels: our investor relations website (http://corporate.lululemon.com/investors), the social media channels identified on our investor relations website, press releases, SEC filings, public conference calls, and webcasts. Information contained on or accessible through our websites is not incorporated into, and does not form a part of, this Quarterly Report or any other report or document we file with the SEC, and any references to our websites are intended to be inactive textual references only.\nlululemon athletica inc. is principally a designer, distributor, and retailer of technical athletic apparel, footwear, and accessories. We have a vision to create transformative products and experiences that build meaningful connections, unlocking greater possibility and wellbeing for all. Since our inception, we have fostered a distinctive corporate culture; we promote a set of core values in our business which include taking personal responsibility, acting with courage, valuing connection and inclusion, and choosing to have fun. These core values attract passionate and motivated employees who are driven to achieve personal and professional goals, and share our purpose \"to elevate human potential by helping people feel their best.\"\nWe offer a comprehensive line of technical athletic apparel, footwear, and accessories marketed under the lululemon brand. Our apparel assortment includes items such as pants, shorts, tops, and jackets designed for a healthy lifestyle including athletic activities such as yoga, running, training, and most other activities. We also offer apparel designed for being on the move and fitness-inspired accessories. We expect to continue to broaden our merchandise offerings through expansion across these product areas.\nFinancial Highlights\nThe summary below compares the second quarter of 2025 to the second quarter of 2024:\nNet revenue increased 7% to $2.5 billion. On a constant dollar basis, net revenue increased 6%.\nComparable sales increased 1%.\nAmericas comparable sales decreased 4%, or 3% on a constant dollar basis.\nChina Mainland comparable sales increased 17%, or 16% on a constant dollar basis.\nRest of World comparable sales increased 12%, or 9% on a constant dollar basis.\nGross profit increased 5% to $1.5 billion.\nGross margin decreased 110 basis points to 58.5%.\nIncome from operations decreased 3% to $523.8 million.\nOperating margin decreased 210 basis points to 20.7%.\nIncome tax expense decreased 2% to $162.6 million. Our effective tax rate for the second quarter of 2025 was 30.5% compared to 29.6% for the second quarter of 2024.\nDiluted earnings per share were $3.10 compared to $3.15 in the second quarter of 2024.\nMarket Conditions and Trends\nAcross all markets, our business continues to be negatively influenced by macroeconomic conditions, including trade policies, shifting consumer demand, inflation, foreign currency fluctuations, and geopolitical instability. These factors have had varying effects across our markets and are expected to continue to impact our business throughout 2025 and beyond.\nWhile total net revenue increased across all regions in the second quarter of 2025, comparable sales in the Americas decreased 4%, or 3% on a constant dollar basis. We experienced lower conversion rates and store traffic in the Americas, partially reflective of economic uncertainty, lower consumer confidence, changes in discretionary spending, and certain product offerings experiencing lower demand.\nOn April 2, 2025, the United States announced the implementation of a 10% baseline tariff on imports from nearly all countries with higher country-specific tariff rates scheduled to begin April 9, 2025. The implementation of country-specific tariffs was subsequently delayed to allow negotiations. Certain countries, including Vietnam, have announced trade deals with the United States and most negotiated tariff rates are higher than the 10% baseline rate. There has been significant volatility in U.S. tariff and customs policy, and trade negotiations between the United States and other countries are ongoing.\nThe United States also approved the One Big Beautiful Bill Act on July 4, 2025, which removed the de minimis exemption for low value shipments imported into the United States in 2027. On July 30, 2025, the President of the United States issued an executive order removing the de minimis exemption for all countries beginning August 29, 2025.\nThese changes in the tariff landscape, including the de minimis removal, are expected to have a significant adverse effect on our business and results of operation. The countries from which we source the majority of our products are now subject to higher tariffs on imports into the United States. Further, the majority of our sales to U.S. e-commerce guests are currently fulfilled from distribution centers in Canada, and historically a significant proportion of these orders qualified for the de minimis exemption. The removal of this exemption increases the cost of fulfilling those orders. We are taking steps to mitigate the financial impact which includes vendor negotiations and selective price increases. These actions are not anticipated to fully offset the effect of higher tariffs and the removal of the de minimis exemption, and we anticipate a significant reduction in our gross margin and operating margin.\nThe impact of increased tariffs, net of mitigating activities, resulted in a reduction to gross profit for the first two quarters of 2025 of approximately $10 million. We estimate, based on the information available to us today, that increased tariffs, and the removal of the de minimis exemption, will reduce gross profit for 2025 by approximately $240 million, net of mitigation efforts.\nThis estimate is our best current view and may change materially as conditions evolve and new information becomes available. It reflects a number of assumptions including (i) the tariff rates and timing of implementation, (ii) the duration and scope of the de minimis exemption removal, (iii) the potential application of transshipment tariff rules, (iv) our ability to execute vendor savings, and (v) customer demand elasticity and pricing response. Actual results may differ materially from this estimate, whether because these assumptions prove inaccurate or because of subsequent changes in tariff policy, trade negotiations, sourcing conditions, consumer demand for our products, or other factors outside our control.\nBecause this is an evolving area, future developments may change our expectations materially. For additional information on related risks, please see “Risk Factors” in this quarterly report.\nOur updated forecasts, inclusive of the trends above, have resulted in changes in the probability of achieving performance conditions of performance-based restricted stock units. Therefore, we recognized a reversal of stock-based compensation expense of $26.3 million during the second quarter of 2025.\nForeign Currency Fluctuations\nForeign currency fluctuations negatively impacted our financial results during the first two quarters of 2025, reducing net revenue growth by $10.7 million compared to the first two quarters of 2024, primarily due to the overall appreciation of\nthe US dollar relative to the Canadian dollar. We expect ongoing exchange rate volatility to continue affecting our financial results.\nQuarter-to-Date Results of Operations: Second Quarter Results\nThe following table summarizes key components of our results of operations for the periods indicated:\n\nTotal comparable sales\nComparable sales includes comparable company-operated store and e-commerce net revenue.\nOur business is affected by the general seasonal trends common to the retail apparel industry. Our annual net revenue is typically weighted more heavily toward our fourth fiscal quarter, reflecting o"
}