{
  "source_file": "lulu-20250202.htm",
  "form_type": "10-K",
  "item1_clean": "ITEM 1. BUSINESS\nlululemon athletica inc. is principally a designer, distributor, and retailer of technical athletic apparel, footwear, and accessories. We have a vision to create transformative products and experiences that build meaningful connections, unlocking greater possibility and wellbeing for all. Since our inception, we have fostered a distinctive corporate culture; we promote a set of core values in our business which include taking personal responsibility, acting with courage, valuing connection and inclusion, and choosing to have fun. These core values attract passionate and motivated employees who are driven to achieve personal and professional goals, and share our purpose \"to elevate human potential by helping people feel their best.\"\nComponents of this discussion of our business include:\nOur Markets and Segments\nIntegrated Marketing\nProduct Design and Development\nSourcing and Manufacturing\nDistribution Facilities\nIntellectual Property\nWe offer a comprehensive line of technical athletic apparel, footwear, and accessories marketed under the lululemon brand. Our apparel assortment includes items such as pants, shorts, tops, and jackets designed for a healthy lifestyle including\nathletic activities such as yoga, running, training, and most other activities. We also offer apparel designed for being on the move and fitness-inspired accessories. We expect to continue to broaden our merchandise offerings through expansion across these product areas.\nOur design and development team continues to source technically advanced fabrics, with new feel and fit, and craft innovative functional features for our products. Through our vertical retail strategy and direct connection with our customers, whom we refer to as guests, we are able to collect feedback and incorporate unique performance and fashion needs into our design process. In this way, we believe we are better positioned to address the needs of our guests, helping us advance our product lines and differentiate us from our competitors.\nDuring 2024, our women's range represented 63% of net revenue and our men's range represented 24% of net revenue. Our comprehensive men's line is a key pillar of our strategic growth plans. We believe net revenue from our men's range is growing as more guests discover the technical rigor and premium quality of our men's products, and are attracted by our distinctive brand.\nWe continue to innovate and introduce new products for our guests. This includes introducing new product categories and expanding our accessories assortment. We believe this is another way in which we can attract new guests and enable them to experience our products. Net revenue from our other product categories represented 13% of net revenue in 2024.\nOur Markets and Segments\nWe operate in over 25 countries around the world and organize our operations into four regional markets: Americas, China Mainland, Asia Pacific (\"APAC\"), and Europe and the Middle East (\"EMEA\").\nWe report three segments, Americas, China Mainland, and Rest of World, which is comprised of the APAC and EMEA regions on a combined basis.\nWe operate an omni-channel retail model and aim to efficiently and effectively serve our guests in the ways most convenient to them. We continue to evolve and integrate our digital and physical channels in order to enrich our interactions with our guests, and to provide a seamless omni-channel experience. We have invested in technologies which enable our omni-channel retailing model. Our capabilities differ by market and include:\nBuy online pick-up in store\n- guests can purchase our products via our website or digital app and then collect that product from a retail location;\n- our store educators can access inventory located at our other locations and have product shipped directly to a guest's address or a store;\n– we are able to fulfill e-commerce orders by accessing inventory at both our distribution centers and at our retail locations, expanding the pool of accessible inventory;\n– e-commerce guests are able to return products either online or in-store; and\n– we are able to view and allocate the product held at our distribution centers to either our physical retail locations, or make it available to fulfill online demand.\nWe operate a combination of physical retail locations and e-commerce services via our websites, other region-specific websites, digital marketplaces, and mobile apps. Our physical retail locations remain a key part of our growth strategy and we view them as a valuable tool in helping us build our brand and product line as well as enabling our omni-channel capabilities. We plan to continue to expand square footage and open new company-operated stores to support our growth objectives.\nWe have operated in the Americas for over 25 years. We opened our first ever store in Vancouver, Canada in 1998. In 2024, the net revenue we generated in the Americas represented 75% of our total net revenue.\nOur operations in the Americas are core to our business and we aim to continue to grow our net revenue in this market through ongoing product innovation and by building brand awareness. We also plan to continue to invest in our omni-channel capabilities, to open new retail locations, and to relocate, optimize, and renovate our existing locations as needed.\nWe generate net revenue in the Americas through our lululemon branded retail locations which include different sizes of company-operated stores, outlets, pop-ups, and other temporary locations. We also serve our guests via our e-commerce website www.lululemon.com, our mobile app, our “Like New” re-commerce program, and through certain wholesale arrangements including university campus retailers and other organizations that we partner with to sell co-branded lululemon products as well as through wholesale arrangements with yoga and fitness studios and other select partners.\nOn September 10, 2024, we acquired the lululemon branded retail locations and operations run by a third party in Mexico. We had previously granted the third party the right to operate retail locations and to sell lululemon products in Mexico.\nWe opened our first store in China Mainland in fiscal 2014. In 2024, the net revenue we generated in China Mainland represented 13% of our total net revenue.\nWe have experienced significant net revenue growth in China Mainland and believe that as we continue to expand our operations and build our brand awareness, net revenue will continue to increase in this market. We believe China Mainland net revenue growth will drive an increase in our overall international net revenue. We plan to continue to invest in China Mainland and expect that the majority of our company-operated store openings in 2025 will be in this market.\nWe operate lululemon branded retail locations in China Mainland in a variety of different formats including different sizes of company-operated stores, outlets, pop-ups, and other temporary locations. We also serve our guests via our WeChat store and on third party marketplaces such as T-Mall and JD.com.\nIn 2024, the net revenue we generated in APAC and EMEA represented 12% of our total net revenue.\nWe have experienced significant net revenue growth in APAC and EMEA and intend to continue to invest in these markets to build brand awareness. Where we identify growth opportunities, we plan to open new retail locations, including in new markets across the EMEA and APAC regions.\nWe operate lululemon branded retail locations in these markets in a variety of different formats including different sizes of company-operated stores, outlets, pop-ups, and stores operated by third-parties under license and supply arrangements. We also serve our guests via our country specific websites, our mobile app, and through third party regional marketplaces, such as Zalando, Lazada, and SSG.\nOur Selling Channels\nWe conduct our business through a number of different channels in each market:\nCompany-operated stores\n: In addition to serving as a venue to sell our products, our stores give us a direct connection to our guests, which we view as a valuable tool in helping us build our brand and product lines as well as enabling our omni-channel capabilities. Our retail stores are located primarily on street locations, in lifestyle centers, and in malls. Our sales per square foot was $1,574 and $1,609 for 2024 and 2023, respectively.\nNumber of company-operated stores by market\nAPAC\nNumber of company-operated stores by market\nEMEA\nTotal company-operated stores\n: We believe e-commerce is convenient for our guests and also allows us to reach and serve guests in markets beyond where our physical retail locations are based. We believe this channel is effective in building brand awareness, especially in new markets. We serve our guests via our e-commerce websites, other country and region-specific websites, digital marketplaces, and mobile apps. E-commerce net revenue includes our buy online pick-up in store, back-back room, and ship from store omni-channel retailing capabilities.\n: We also use certain other distribution channels, generally with the goal of building brand awareness and providing broader access to our products. These other channels include:\n- Our seasonal stores and pop-ups are typically opened for a short period of time enabling us to serve guests during peak shopping periods in markets where we do not ordinarily have a physical location, or to expand access in markets where we see high demand at our existing locations.\n- We sell to partners that offer convenient access for both core and new guests, including university campus retailers and other organizations that we partner with to sell co-branded lululemon products. We also sell to yoga and fitness studios and other select partners.\n- We utilize outlets to sell slower moving inventory and inventory from prior seasons at discounted prices. As of February 2, 2025, we operated 52 outlets, the majority of which were in the Americas.\n- Our re-commerce program allows guests to exchange their gently used lululemon products for merchandise credit. Those products are then verified and quality checked before being resold online at likenew.lululemon.com. We believe this program is a step towards a circular eco-system and helps reduce our environmental footprint.\nLicense and supply arrangements\n- We enter into license and supply arrangements when we believe it will be to our advantage to partner with third parties with significant experience and proven success in certain target markets. Under these arrangements we have granted certain third parties the right to operate lululemon branded retail locations and to sell lululemon products on websites in specific countries. On September 10, 2024, we acquired the lululemon branded retail locations and operations run by a third party in Mexico. We had previously granted the third party the right to operate retail locations and to sell lululemon products in Mexico.\nNumber of retail locations operated by third parties by market\nUnited Arab Emirates\nTotal locations operated by third parties under license and supply arrangements\nIntegrated Marketing\nWe believe that our brand awareness is relatively low, especially outside of the Americas, and also with men. This represents an opportunity for us and we have designed a multi-faceted strategy that leverages what guests know us for; our products, community, and experiences. This strategy is designed to leverage owned and paid channels, our ambassador network, events, and content – to drive awareness, consideration, engagement, conversion, and ultimately loyalty and engagement at the global, regional, and local levels.\nProduct Design and Development\nOur product design and development efforts are led by a team of researchers, scientists, engineers, and designers. Our team is comprised of athletes and users of our products who embody our design philosophy and dedication to premium quality. Our design and development team identifies ",
  "item7_clean": "section of this management's discussion and analysis of financial condition and results of operations for further information.\nWe provide constant dollar changes and adjusted financial results which exclude certain inventory provisions, asset impairments, and restructuring costs recognized in relation to lululemon Studio and their related tax effects. The constant dollar changes and adjusted financial results are non-GAAP financial measures, and we provide them as supplemental information that enable evaluation of the underlying trend in our operating performance, and enable a comparison to our historical financial information. Refer to the Non-GAAP Financial Measures section of this management's discussion and analysis of financial condition and results of operations for reconciliations between the adjusted non-GAAP financial measures and the most directly comparable measures calculated in accordance with GAAP.\nWe disclose material non-public information through one or more of the following channels: our investor relations website (http://corporate.lululemon.com/investors), the social media channels identified on our investor relations website, press releases, SEC filings, public conference calls, and webcasts. Information contained on or accessible through our websites is not incorporated into, and does not form a part of, this annual report or any other report or document we file with the SEC, and any references to our websites are intended to be inactive textual references only.\nFiscal 2024 was another year of growth for lululemon. Net revenue increased 10%, operating margin expanded 150 basis points, or 50 basis points on an adjusted basis, and diluted earnings per share grew 20%, or 15% on an adjusted basis. Our teams continued to execute against our Power of Three ×2 growth plan and the compound annual growth rate in net revenue was 19% between fiscal 2021 and 2024.\nWe saw growth across our regions, merchandise categories, and channels as we continue to engage with guests and provide them with innovative products that help enable their wellness journey. In the Americas, revenue grew 4% driven by strength in Canada. In the United States, we have been working to increase the level of seasonal newness within our assortment mix. In China Mainland, revenue increased 41%, and in Rest of World, revenue grew 27%. By category, we saw a 9% increase in women's, 14% growth in men's, and an 10% increase in other categories. We expanded our retail presence by adding 56 net new company-operated stores, contributing to a 14% increase in square footage. These metrics include our stores in Mexico which we now operate directly, the result of the acquisition of the Mexico operations from our license and\nsupply partner in September 2024. Company-operated store net revenue increased 14% and e-commerce net revenue increased 6%.\nWe repurchased 5.1 million shares for $1.6 billion in 2024, and our board of directors approved increases in our stock repurchase authorization totaling $2.0 billion during 2024.\nBrand Campaigns and Activations\nDeepening our relationship with existing guests while also bringing new guests into the lululemon brand remains an important priority for us. We believe our unaided brand awareness is relatively low across most of the regions where we operate. In 2024, we brought several activations to life aimed at increasing loyalty with existing guests while, at the same time, attracting new guests into our brand.\nOur partnership with the Canadian Olympic Committee and Canadian Paralympic Committee was on full display during the Paris Olympics, as we outfitted the athletes for their off-field activities. In the Americas, we continued to grow our membership program and began offering new benefits including our Partner Perks program which provides members with exclusive experiences and perks from select partner brands.\nIn China Mainland, we expanded our Summer Sweat Games to over 70 stores across nearly 40 cities and for World Mental Health Day, we hosted activities in nine cities across China Mainland, anchored by our event along the West Bund in Shanghai. We also extended our World Mental Health Day activations to additional countries, including South Korea, Germany, the United Kingdom, and the United States.\nIn 2024, we also welcomed additional new ambassadors to the brand, including six-time PGA tour winner Max Homa, Chinese director, actress, and screenwriter Jia Ling, and Frances Tiafoe our newest tennis ambassador.\nWe continue to seek to create product that solves the unmet needs of our guests. We believe our technical product is a key competitive advantage for us, and our positioning as a premium athletic brand, with high style and high performance product, helps differentiate us from our peers.\nIn 2024, we remained focused on our core activities of yoga, run, and train and also our newer \"play\" activities including golf and tennis. In women's, Align, Define, and Scuba continued to be key product franchises for us, and towards the end of the year, we launched our Daydrift trouser; a refined, casual pant to be worn all day into night. For men, guests continued to respond to our lounge franchises including Steady State, Soft Jersey, and Smooth Spacer, and our performance franchises including Pacebreaker and Zeroed In. In footwear, we expanded our offering with new casual and performance styles including our first collection for men. And in accessories, we continued to bring innovation across our offering of bags, which drove good response from our guests.\nFinancial Highlights\nThe summary below compares 2024 to 2023 and provides both GAAP and non-GAAP financial measures. The adjusted financial measures for 2023 exclude $72.1 million of post-tax asset impairment and other charges recognized in relation to lululemon Studio. There were no adjusted financial measures for 2024.\nNet revenue increased 10% to $10.6 billion. On a constant dollar basis, net revenue increased 11%.\nComparable sales, which excludes net revenue from the 53rd week of 2024, increased 4%.\nAmericas comparable sales decreased 1%.\nChina Mainland comparable sales increased 25%, or 27% on a constant dollar basis.\nRest of World comparable sales increased 19%, or 20% on a constant dollar basis.\nGross profit increased 12% to $6.3 billion. Adjusted gross profit increased 11%.\nGross margin increased 90 basis points to 59.2%. Adjusted gross margin increased 60 basis points.\nIncome from operations increased 17% to $2.5 billion. Adjusted income from operations increased 12%.\nOperating margin increased 150 basis points to 23.7%. Adjusted operating margin increased 50 basis points.\nIncome tax expense increased 22% to $761.5 million. Our effective tax rate for 2024 was 29.6% compared to 28.8% for 2023. The adjusted effective tax rate was 28.7% for 2023.\nDiluted earnings per share were $14.64 for 2024 compared to $12.20 in 2023. Adjusted diluted earnings per share were $12.77 in 2023.\nMarket Conditions and Trends\nMacroeconomic conditions, government actions and policies, consumer confidence and purchasing behaviors, and foreign currency fluctuations impact our business. Such factors are expected to continue to impact our business throughout 2025, with the impact varying by market.\nConsumer confidence, purchasing behaviors, and their propensity to spend in our sector have been impacted by uncertain economic conditions including inflation, fluctuating interest rates, and other factors. We continue to monitor the economic environment, including in the US, Canada, and China Mainland.\nWe experienced revenue and traffic growth in 2024 compared to 2023 in all regions, but have experienced a reduction in our revenue growth rate in the Americas compared to the growth we had in previous years, driven by our operations in the United States. During 2024, Americas comparable sales decreased 1%. We are monitoring government policies in the Americas, including changes in tariffs, and while we do not expect current changes to have a material impact on the cost of our products, tariffs and related uncertainties could impact consumer confidence, traffic, and demand for our products.\nForeign currency fluctuations have adversely impacted our financial results. Foreign currency fluctuations reduced the growth of our net revenue by $75.3 million when comparing 2024 to 2023, primarily due to the overall appreciation of the US dollar. We expect future exchange rate volatility to impact our results.\nResults of Operations\nThe following table summarizes key components of our results of operations for the periods indicated:\n\n(Percentage of net revenue)\n(Constant dollar change)\nThe increase in net revenue was primarily due to increased China Mainland net revenue. Americas and Rest of World net revenue also increased. We had total net revenue of $163.2 million during the 53rd week of 2024 which contributed to the total increase in net revenue in 2024. Comparable sales, which excludes net revenue from the 53rd week of 2024, increased 4%.\nYear over year change\nGross margin increased 90 basis points. As a result of our decision to cease selling the lululemon Studio Mirror, we recognized an inventory obsolescence provision of $23.7 million during 2023, which reduced gross margin by 30 basis points. Adjusted gross margin increased 60 basis points. Please refer to Note 9. Impairment of Goodwill and Other Assets, Restructuring Costs included in Item 8 of Part II of this report.\nThe increase in gross margin was primarily the result of a net increase in product margin of 120 basis points, comprised of:\na net increase of 120 basis points from lower product costs and lower inventory provision expense, partially offset by higher freight costs;\nan increase of 30 basis points due to the lululemon Studio obsolescence provision recognized during 2023; and\nan unfavorable impact of foreign currency exchange rates of 30 basis points.\nThe increase in product margin was partially offset by a net increase in other cost of sales as a percentage of net revenue of 30 basis points, comprised of:\nan increase in occupancy and depreciation costs of 60 basis points;\nan increase in distribution center costs of 30 basis points;\na decrease in costs related to our product departments of 50 basis points; and\na favorable impact of foreign currency exchange rates of 10 basis points.\nSelling, General and Administrative Expenses\nYear over year change\nSelling, general and administrative expenses\nSelling, general and administrative expenses as a % of net revenue\nThe increase in selling, general and administrative expenses was primarily due to:\nan increase in costs related to our operating channels of $196.0 million, comprised of:\nan increase in employee costs of $84.2 million primarily due to increased salaries and wages expense and benefit costs for retail employees primarily from the growth in our business, partially offset by decreased incentive compensation;\nan increase in brand and community costs of $54.2 million primarily due to increased digital marketing expenses;\nan increase in other operating costs of $41.9 million primarily due to increased depreciation costs and repairs and maintenance costs; and\nan increase in technology costs of $18.7 million.\nThe increase in costs related to our operating channels was partially offset by a decrease in variable costs of $2.9 million primarily due to decreased distribution costs driven by lower rates, partially offset by increased credit card fees as a result of increased net revenue.\nan increase in head office costs of $179.0 million, comprised of:\nan increase in brand and community costs of $64.5 million primarily due to increased marketing expenses as well as increased charitable donations;\nan increase in advisory and professional fees of $42.9 million;\nan increase in technology costs, including cloud computing amortization, of $27.6 million;\nan increase in other head office costs of $25.7 million; and\nan increase in depreciation of $20.2 million.\nThe increase in costs related to our head office was partially offset by a net decrease in employee costs of $1.9 million primarily due to decreased incentive compensation, partially offset by increased salaries and wages expense.\nThe increase in selling, general and administrative expenses was partially offset by an increase in net foreign currency exchange and derivative revaluation gains of $9.9 million.\nImpairment of Goodwill and Other Assets, Restructuring Costs\nYear over year change\nImpairment of goodwill and other assets, restructuring costs\nDuring 2023, we recognized certain asset impairments and restructuring costs related to lululemon Studio. Please refer to Note 9. Impairment of Goodwill and Other Assets, Restructuring Costs included in Item 8 of Part II of this report for further information.\nAmortization of Intangible Assets\nYear over year change\nAmortization of intangible assets\nThe amortization of intangible assets in 2024 was primarily the result of the amortization of intangible assets recognized upon the acquisition of the Mexico operations. The amortization of intangible assets in 2023 was primarily the result of the amortization of intangible assets recognized upon the acquisition of MIRROR, which we rebranded as lululemon Studio.\nOn a segment basis, we determine income from operations without taking into account corporate expenses and certain other expenses. Corporate expenses include the cost of centrally managed support functions including product design, raw material development, product innovation, sourcing, supply chain, and global merchandising which are included in other cost of sales. Administrative corporate expenses include technology, brand and marketing, finance, human resources, legal, and other head office costs.\nYear over year change\nSelling, general and administrative expenses\nSegmented income from operations\nSelling, general and administrative expenses as a % of net revenue\nSegmented income from operations as a % of net revenue\nThe increase in Americas net revenue was primarily due to a $263.5 million increase from new or expanded company-operated stores and our other channels. We added 24 net new company-operated stores in the Americas since 2023, including 14 company-operated stores from the acquisition of the Mexico operations. Americas net revenue during the 53rd week of 2024 was $118.0 million, which contributed to the increase in Americas net revenue in 2024. Americas comparable sales, which excludes net revenue from the 53rd week of 2024, decreased 1%. The decrease in comparable sales was primarily a result of decreased conversion rates, partially offset by an increase in traffic and a higher dollar value per transaction.\nThe decrease in gross margin was primarily due to deleverage on distribution center and occupancy costs, partially offset by higher product margin.\nThe increase in selling, general and administrative expenses was primarily due to increased marketing expenses, higher depreciation, and higher employee costs, partially offset by decreased distribution cost rates.\nYear over year change\nSelling, general and administrative expenses\nSegmented income from operations\nSelling, general and administrative expenses as a % of net revenue\nSegmented income from operations as a % of net revenue\nThe increase in China Mainland net revenue was primarily due to an increase in comparable sales, which increased 25%, or 27% on a constant dollar basis. China Mainland comparable sales excludes net revenue from the 53rd week of 2024. The increase in comparable sales was primarily a result of increased traffic, partially offset by a lower dollar value per transaction. The increase in China Mainland net revenue was also driven by a $156.5 million increase in in net revenue from new or expanded company-operated stores and our other channels. We have opened 24 net new company-operated stores since 2023. China Mainland net revenue during the 53rd week of 2024 was $23.6 million, which",
  "item2_clean": null
}