{
  "source_file": "luv-20241231.htm",
  "form_type": "10-K",
  "item1_clean": "enhance its Rapid Rewards program and benefits.\nThese initiatives stem from continued monitoring of Customer feedback, travel patterns, and preferences. The introduction of assigned seating is intended to address changes in Customer travel frequency and preferences for a seat assignment, particularly as the Company has increased its proportion of longer-haul flights in light of reduced demand for short-haul travel. Research indicates that a vast majority of both existing Southwest Customers and potential Customers prefer an assigned seat.\nIn addition to assigning seats, the Company plans to offer a premium, extended legroom portion of the cabin that research shows many Customers also prefer. The Company also plans to evolve its boarding process with the introduction of assigned seating and premium seating options, maintaining the Company’s unique approach in boarding through position numbers and signage displayed on stanchions within the gate area.\nThe move to assigned and premium seating will be a significant undertaking by the Company. In addition to incorporating new technologies and procedures for a seamless transition, the new cabin layout will require approvals from the FAA along with other regulatory agencies and vendor partners. The Company expects to make assigned seat and extended legroom bookings available in the second half of 2025, with related flights occurring in the first half of 2026.\nGetaways by Southwest\nBeginning in 2025, the Company plans to offer Customers an in-house vacation package product called “Getaways by Southwest”, replacing the outsourced product Southwest has historically offered. This new vacation booking platform is expected to allow the Company to appeal directly to its broad existing Customer base with an enhanced offering that includes both lodging and excursions, which is designed to drive growth with leisure travelers and grow higher-margin revenues.\nDistribution and Marketing Approach\nThe Company primarily offers its fare products directly to Customers through its Internet website, Southwest.com\n, and the Southwest App. For the years ended December 31, 2024, and December 31, 2023, approximately 81 percent and 82 percent, respectively, of the Company’s Passenger revenues originated from Southwest.com or the Southwest App (including revenues from SWABIZ®, the Company's online booking tool designed for business Customers who prefer a self-service and low-cost solution for booking their air travel on Southwest). This “direct to Customer” distribution approach has historically provided a cost advantage for the Company because it eliminates fees associated with the use of third-party distribution channels such as third-party online travel platforms.\nIn light of changing travel patterns post-pandemic, in 2024 the Company focused on attracting new and less frequent Customers, in part, through new distribution channels and the launching of new ad campaigns. The Company expanded its distribution channels through partnerships with flight meta search engines, including Google Flights, Kayak, and Skyscanner, to increase visibility and drive traffic for bookings to Southwest.com.\nIn April 2024, the Company launched “The Big Flex”: a bold new brand marketing campaign showcasing the Company’s fun-loving personality and flexible and Customer-friendly policy points of difference on every fare, everywhere. The campaign highlights choice and flexibility for the Company’s Customers delivered with the Hospitality for which the Company is famous. Additionally, in May 2024, the Company launched “Wanna Go Wednesdays” on Southwest.com, a new weekly program that allows Customers to book the latest low fares on routes that are still available for last minute bookings. The Company also invested in technology to support artificial intelligence (\"AI\")-based marketing efforts and more personalized marketing capabilities throughout 2024.\nThe Company supports its distribution approach by offering a broad suite of digital platforms to support Customers' travel needs, including full featured websites and apps. These digital platforms help Customers book and manage their Southwest air travel and facilitate the purchase of the Company’s ancillary products, including Fare Upgrades, EarlyBird Check-In, Upgraded Boarding, vacation packages, rental car reservations, hotel reservations, and travel activities. In addition, the digital platforms provide self-service tools for trip management and Customer support.\nThe Company is committed to its goal of widening its Customer Service advantage by enhancing digital Hospitality. The Company is amid a multi-year digital service modernization program designed to, among other things, provide better Customer Service at a lower cost. Key focus areas of the digital service modernization program include contact center service modernization, airport service modernization, Customer Service communications, and disruptions management.\nIn 2024, the Company implemented digital enhancements to empower Customer self-service and provide more efficient Customer Service. Key updates included a revamped Help Center, an expanded chatbot for improved information access, and enhanced disruption management tools (such as options to rebook or cancel flights and access nearby airports). In compliance with new DOT regulations, Southwest introduced automated ancillary refunds for canceled flights, additional flight rebooking flexibility for applicable schedule adjustments, and improved content to clearly communicate Customer options. The Company added additional Customer Service capabilities, including improved error messaging for increased clarity and actionable options for Customers, improved booking options when booking trips with youth travelers on mobile devices, increased passenger capacity per reservation, self-service features that enable self-management of companion designations, inbound flight tracking, and increased travel flexibility with improved standby booking options for connecting flights.\nIn 2024, the Company introduced generative AI capabilities and automation tools with a goal to improve Customer Service, increase efficiency, and drive lower cost while exceeding Customers’ Hospitality expectations. The Company continues to test the effectiveness of generative AI capabilities across the Customer journey.\nDuring 2024, as a result of these efforts, the Company experienced fewer contact center calls per trip, while increasing app utilization on the day of travel, each as compared with 2023. The Company’s digital service modernization program is expected to continue to deliver additional enhancements and efficiencies in 2025.\nThe Company continues to enhance digital revenue-generating capabilities through strategic investments and innovations. The Company deployed a comprehensive suite of optimizations designed to improve product performance across air sales and ancillary offerings, including Upgraded Boarding, EarlyBird Check-In, Cars, Hotels, and Vacations. These efforts are designed to drive incremental revenue while enhancing the Customer Experience.\nThe Company has made significant advancements in marketing automation, particularly on the mobile app. Generative AI-powered copy testing has been introduced to refine marketing messages and optimize conversion rates, yielding increased sales per marketing effort. The Company has also implemented enhanced Rapid Rewards acquisition techniques, promotional text message campaigns, increased push messaging marketing, and improved co-brand acquisition strategies to drive Customer engagement and loyalty. The Company continues to test ongoing improvements to its digital shopping and booking experience to further increase fare upsells and booking conversion effectiveness.\nFurther, the Company has expanded its offerings to include overnight connection flight options, enhanced Rapid Rewards marketing content, and added the ability for Customers to pay for flights using cash plus points. Improvements to account management tools underscore the Company’s commitment to meeting diverse customer needs and growing its market presence.\nIn addition to improvements in the Company's consumer-direct Southwest.com channel of distribution and new flight search engine partnerships, in recent years the Company has taken significant action, including investments in Employees, processes, and technology, in order to grow its corporate travel business with the goal of making it easier for corporate travel Customers and travel management companies to do business with Southwest. The Company employs a multi-channel distribution strategy for its corporate business travel, offering the ability for business travelers and travel decision makers to book Southwest fares within all major Global Distribution System platforms via Amadeus, Travelport, and Sabre channels, through third-party partners directly connected to the Company's host reservation system, or through the Company’s free corporate online booking tool, SWABIZ®.\nThe Company utilizes Airlines Reporting Corporation to implement industry standard processes to handle the settlement of tickets booked through Travelport, Amadeus, and Sabre channels. The Company also utilizes ATPCO Routehappy to provide detailed product information that supports robust shopping and selling processes in third-party booking channels.\nThe Company offers Southwest Business Meetings, a product for its corporate Customers that is designed to make it easier for meeting planners to manage travel on Southwest by streamlining the process to book group travel for meetings and conventions. In late 2024, the Company beta-launched a new group travel tool, Southwest Groups, designed to bring many self-service features to travel managers in early 2025. The Company also offers Southwest Business Assist™, a travel portal that enables corporate travel buyers, travel decision makers, and travel management companies to better manage their business travel on Southwest using dashboards, reports, automated processing of travel benefits, and Customer Service. The on-demand self-service tool provides access to real-time information and reporting. Southwest Business has also continued to invest in and enhance SWABIZ with mobile capabilities. SWABIZ is designed for business Customers who prefer a self-service and low-cost solution for booking their air travel on Southwest. The site also facilitates car and hotel bookings and offers a suite of reports for travel managers. The Company has additionally developed a new data-sharing API channel, Southwest Business TravelTrack®, that provides business travel Customers and third-party partners more visibility into the business they do with Southwest.\nTechnology Initiatives\nThe Company is focused on the prioritization and execution of its technology investments through an evolving multi-year plan, with the goal of developing stronger, more adaptable, more efficient, and more reliable technology systems to support the Company's strategic priorities. The Company has committed, and plans to continue to commit, significant resources to technology improvements in support of its ongoing operations and initiatives. During 2024, among other things, the Company (i) replaced its legacy flight planning system; (ii) expanded its distribution channels via multiple search engine partnerships; (iii) improved communication tools for Employees; (iv) delivered better visual and real-time information to assist both Customers and Employees; (v) leveraged AI to expedite support and call resolution time for Customer Service agents; (iv) worked towards moving to a fully digital (i.e., paperless) turn process; and (v) enabled Rapid Rewards Members to pay for their flights with a combination of cash and Rapid Rewards points. During 2023, among other things, the Company invested in technology and tools that are expected to enhance resiliency and improve its recovery during irregular operations, imple",
  "item7_clean": "As part of the Company's ongoing modernization efforts, during 2024, the Company announced several new initiatives designed to elevate the Customer Experience on its flights, improve financial performance, and drive Shareholder value. As part of its ongoing focus on product evolution, the Company is moving forward with plans to assign seats, offer premium seating options, redesign the boarding model, and introduce redeye (i.e., overnight) flying. The Company has been known for its open seating model for more than 50 years, which was unique in the airline industry and has been popular with Southwest Customers for decades. Open seating served the Company well as a primarily short-haul carrier. The open seating design, combined with historically lower load factors, contributed to the efficiency of turning aircraft quickly. The Company’s low-cost model enabled low fares and, combined with great Customer Service, allowed the Company to grow across the country and eventually become the nation’s largest domestic carrier.\nHowever, as the domestic travel market has matured and structural changes have reduced the demand for short-haul travel, especially post-pandemic, the Company has increased its proportion of longer-haul flights. The importance of having an assigned seat grows among Customers as the length of flight gets longer. In addition, Customer travel frequency and preferences have evolved—for both frequent flyers, as well as those of more infrequent travelers who are not accustomed to the open seating policy currently utilized by the Company—especially as Southwest has opened several new markets and expanded its route network during the past few years. The Company has continually monitored Customer feedback regarding seating preferences for decades, and Customer travel patterns and preferences have evolved and a seat assignment is generally preferred. Recent research conducted by the Company indicates that a vast majority of both existing Southwest Customers and potential Customers prefer an assigned seat, which supports the Company’s decision to now evolve its boarding and seating processes. In addition to assigning seats, the Company plans to offer a premium, extended legroom portion of the cabin that research shows many Customers also prefer. The Company expects to offer extended legroom, in-line with that offered by industry peers on narrowbody aircraft.\nThe decision to update the seating and boarding model is part of the Company's continued modernization and Customer Experience transformation. Following a Customer study regarding the inflight experience, the Company has continued to enhance its onboard offerings during the past two years with both completed and ongoing\nimprovements being made, such as faster WiFi, in-seat power, and larger overhead bins. Work is well underway on a refreshed cabin design, including new, more comfortable RECARO seats.\nThe move to assigned and premium seating will be a significant undertaking by the Company. In addition to incorporating new technologies and procedures for a seamless transition, the new cabin layout will require approvals from the FAA. The Company currently expects to make assigned seat and extended legroom bookings available in the second half of 2025, with related flights occurring in the first half of 2026. The Company also announced it is adding 24-hour operation capabilities with the introduction of redeye flights. Booking of redeye flying on initial routes became available starting July 25, 2024 through Southwest.com, with the first redeye flights scheduled on February 13, 2025 in five initial nonstop markets: Las Vegas to Baltimore and Orlando; Los Angeles to Baltimore and Nashville; and Phoenix to Baltimore.\nThese and other initiatives are designed to improve the Company’s financial performance and metrics, including return on invested capital and operating margins, over the next three years. The Company plans to continue to focus on the following tactical initiatives: Continual network optimization and maturation; Marketing and distribution evolution; and Revenue management maturation. Continual network optimization and maturation includes (i) reduced short-haul flying and redistributing resources to long-haul flying in profitable markets, (ii) reduced flying on weekdays with lower travel demand, (iii) restructured service and network connectivity in stations with lower demand, and (iv) taking a cross-functional, methodical approach to market maturation efforts. Marketing and distribution evolution includes (i) a new advertising campaign to highlight the unique, flexible value Southwest offers and target a new generation of travelers, (ii) partnerships with flight search engines, including Google Flights, Kayak, and Skyscanner intended to increase visibility and drive traffic for bookings to Southwest.com, and (iii) creating the option for Customers to use a combination of cash and Rapid Rewards® points to pay for travel, providing more ways to take advantage of the Company's loyalty program. Revenue management maturation efforts include (i) refinements to the Company's revenue management system, designed to achieve better, more customized results based on the Company's primarily domestic network, (ii) additional staffing to the Company's Revenue Management team to support focusing on driving results, and (iii) recalibrating probability curves, which are expected to improve yields by capturing more demand at higher fares.\nThe Company has also summarized recently announced strategic initiatives into three broad categories: Monetize the Company's value proposition; Increase efficiency and lower costs; and Optimize capital allocation.\nMonetize the Customer value proposition\nIn addition to the assigned seating and extended legroom changes discussed above, the Company also plans to offer an in-house vacation package product to Customers beginning in 2025 called “Getaways by Southwest”, versus the outsourced product it has historically offered. This new vacation booking platform is expected to be designed to allow the Company to appeal directly to its significant existing Customer base with an enhanced offering that includes both lodging and excursions, which is expected to drive growth with leisure travelers and grow higher-margin revenues with a relatively low capital and headcount investment. The Company also announced it will pursue partnerships with other airlines in order to further expand the reach of the Company’s network and connect Customers with more global destinations to generate additional demand. The Company launched its first such partnership in first quarter 2025 with transatlantic connectivity with Icelandair and plans to add at least one more partner during 2025.\nIncrease efficiency and lower costs\nIn addition to the aforementioned introduction of redeye flights, which is designed to maximize or increase asset utilization, another one of the Company's efficiency initiatives includes investments that will decrease the amount of time it takes to turn an aircraft (unload Passengers from an arriving flight and load Passengers on the same aircraft for its subsequent flight). Examples of such investments include moving to a fully digital (i.e., paperless) process, improved communication tools for Employees, and better visual and real-time information to assist both Customers and Employees. These efforts are rolling out and are expected to be fully implemented in November 2025. These initiatives are expected to result in a lowering of unit costs, as the Company is expected to be able to generate either the same number of ASMs with fewer aircraft, or produce more ASMs utilizing the same number of aircraft in its\nfleet, respectively. The Company also continues to invest in various technologies and digital products designed to improve the Customer travel experience. In addition, the Company is targeting other cost initiatives that are expected to result in savings, including minimizing hiring in order to right-size staffing to current operations and match the Company’s lower expected growth rates in the near term, capitalizing on identified supply chain opportunities, and improving its corporate efficiency through automation and better allocation of resources. These and other initiatives are currently expected to deliver more than $500 million in annual cost savings by 2027.\n\nOptimize capital allocation\nIn addition, the Company intends to focus on prudent capital deployment by minimizing fleet capital expenditures, continuing to invest in infrastructure, managing debt levels, and providing returns to Shareholders through dividends and share repurchases. The Company continues to have favorable pricing in its order book with Boeing for new 737 MAX aircraft that allows additional flexibility in being able to replace certain aircraft in its existing fleet, given current market conditions, with more fuel efficient and less-maintenance intensive models over the near term. The Company has pursued, and plans to continue to pursue, opportunities to take advantage of current market conditions through the sale and/or sale-leaseback of certain aircraft, with the intention of replacing most, if not all, of such aircraft with new MAX aircraft from Boeing by the end of 2031, assuming that Boeing is able to meet aircraft delivery expectations. As a result of these efforts, the Company’s expected net fleet capital expenditures during the near term are expected to moderate significantly from recent levels, with the added benefit of further accelerating the modernization of its fleet. The Company also intends to preserve the strength of its balance sheet with manageable debt maturities, with the goal of retaining investment-grade ratings. Finally, the Company intends to return value back to its Shareholders through dividends and share repurchases and will continually review its return of capital program based in large part upon the Company's free cash flow and leverage, and fleet monetization strategy, taking into account potential impacts to its investment grade ratings.\nThrough these initiatives, the Company expects to return to historical levels of financial performance in which its return on invested capital exceeds its weighted-average cost of capital. The targets the Company has set through 2027 include the following:\nAnnual capacity growth in the range of one to two percent, year-over-year, beginning in 2025\nAnnual Operating margins of at least 10 percent, in 2027\nFree cash flow exceeding $1 billion per year in 2027\nReturn on invested capital, after-tax, of at least 15 percent in 2027\nFinancial leverage in the low to mid 30’s percent range in 2027\nContinue to maintain an investment-grade credit rating\nThe Company's Board of Directors (“the Board”) received a letter dated June 10, 2024, from Elliott Investment Management L.P. (\"Elliott\") stating that Elliott had made an investment of approximately $1.9 billion in the Company, representing an approximately 11 percent economic interest in the Company, and advocating for changes to the Company's management, the Board, and the Company's corporate strategy. On October 23, 2024 (the \"Effective Date\"), the Company entered into a Cooperation Agreement (the \"Cooperation Agreement\") with Elliott, Elliott Associates, L.P., Elliott International, L.P., and The Liverpool Limited Partnership. Pursuant to the Cooperation Agreement, the Company agreed to, among other things, (i) appoint David Cush, Sarah Feinberg, David Grissen, Gregg Saretsky and Patricia Watson (collectively, the “Cooperation Agreement Directors”) to the Board, effective 11:59 p.m. Central Time on November 1, 2024, each with an initial term expiring at the 2025 Annual Meeting; (ii) announce that two incumbent Directors as of the Effective Date will not stand for re-election to the Board at the 2025 Annual Meeting; and (iii) include the Cooperation Agreement Directors, together with the other persons recommended by the Board, in the Company’s slate of nominees for election as a Director at the 2025 Annual Meeting. On July 7, 2024, the Board appointed Rakesh Gangwal to the Board, and on September 26, 2024, the Company announced the addition of Robert L. Fornaro to the Board.\nPursuant to the Cooperation Agreement, effective 11:59 p.m. Central Time on November 1, 2024, Gary C. Kelly, Executive Chairman of the Board, David W. Biegler, J. Veronica Biggins, Roy Blunt, William H. Cunningham, Thomas W. Gilligan, and Jill A. Soltau each resigned from the Board. None of the departures were due to any disagreement with the Company on any matter relating to the Company’s operations, policies, or practices.\nAdditionally, the Board appointed Pierre Breber as a member of the Board, effective 11:59 p.m. Central Time on November 1, 2024, with an initial term expiring at the 2025 Annual Meeting. On November 4, 2024, the Company announced the appointment of Rakesh Gangwal as independent Chair of the Board and named new Board Committee Chairs.\nBecause of this activist activity, the Company has incurred increased professional advisory fees and other costs related to Shareholder activism matters.\nAdditionally, in order to provide the Board with time to make informed decisions in the best interests of the Company and its Shareholders, on July 2, 2024, the Board adopted a shareholder rights plan (the \"Rights Agreement\") and declared a dividend of one right in respect of each of the Company’s issued and outstanding shares of common stock (the “Rights”), which would have caused substantial dilution to any person or group acquiring 12.5 percent or more of the Company’s outstanding common stock without the prior approval of the Board. The Rights Agreement was designed to deter the acquisition of actual, de facto, or negative control of the Company by any person or group without appropriately compensating its Shareholders for that control. On October 25, 2024, pursuant to the Cooperation Agreement, the Company and Equiniti Trust Company, LLC entered into the Amendment to the Rights Agreement, which amended and terminated the Rights Agreement by advancing the expiration time of the Rights to 5:00 p.m., New York City time, on October 25, 2024. At the time of the termination of the Rights Agreement, all of the Rights, which were previously distributed to holders of the Company’s Common Stock, pursuant to the Rights Agreement, expired.\nIn January 2025, the Company reached an amended co-brand agreement with Chase Bank USA, N.A. (\"Chase\"). The amendment includes enhanced Cardmember benefits associated with the Company's assigned and premium seating initiative and supports the multi-year financial targets announced at the Company's Investor Day in September 2024.\nDuring 2024, as a result of Boeing's ongoing delivery delays, the Company conservatively re-planned its capacity and delivery expectations for both 2024 and 2025. The Company will continue to closely monitor the ongoing aircraft delivery delays with Boeing and adjust expectations as needed.\nThe Company ended 2024 with 803 Boeing 737 aircraft, including 245 Boeing 737-8 (\"-8\") aircraft. During 2024, the Company retired 34 Boeing 737-700 (\"-700\") aircraft and two Boeing 737-800 (\"-800\") aircraft and took delivery of 22 -8 aircraft. The Company also completed the sale-leaseback of 35 -800 aircraft in December 2024, and completed the sale-leaseback of an additional -800 aircraft in late January 2025. The Company's order book with Boeing as of January 30, 2025, consists of a total of 496 MAX firm orders (300 Boeing 737-7 (\"-7\") aircraft and 196 -8 aircraft) for the years 2025 through 2031, including 63 MAX aircraft that were contractually committed for 2024, but were not received, and 176 MAX options (-7s or -8s) for the years 2026 through 2031. The Company is currently using a planning assumption of 38 -8 aircraft deliveries in 2025, which differs from its contractual order book, as Boeing continues to ramp up production",
  "item2_clean": null
}