{
  "source_file": "lvs-20250930.htm",
  "form_type": "10-Q",
  "item1_clean": null,
  "item7_clean": null,
  "item2_clean": "(Dollars in millions)\nConvention, retail and other\nProvision for (recovery of) credit losses\nGeneral and administrative\nDepreciation and amortization\nAmortization of leasehold interests in land\nLoss on disposal or impairment of assets\nTotal operating expenses\nOperating expenses were $2.61 billion for the three months ended September 30, 2025, an increase of $434 million compared to $2.18 billion for the three months ended September 30, 2024. The increase was primarily driven by increases of $233 million in casino expenses, $57 million in loss on disposal or impairment of assets, $44 million in depreciation and amortization, $17 million in development, and $23 million in provision for credit losses.\nCasino expenses increased $233 million compared to the three months ended September 30, 2024, due to increases of $131 million and $102 million at Marina Bay Sands and our Macao operations, respectively. The increase at Marina Bay Sands was primarily attributable to a $120 million increase in gaming taxes, consistent with increased gross gaming revenues and an increase in gaming tax rates from 8% to 12% on premium play during most of the third quarter due to the tiered tax structure in Singapore as our thresholds were met in July 2025 versus November 2024. The increase at our Macao operations was primarily attributable to increased gaming taxes of $60 million due to increased gross gaming revenues, as well as increases in casino marketing and payroll and related expenses.\nRoom expenses increased $10 million compared to the three months ended September 30, 2024, due to increases of $7 million and $3 million at our Macao operations and Marina Bay Sands, respectively, consistent with increased business volume and higher costs driven by the conversion of the Sheraton towers to the Londoner Grand in Macao and higher costs associated with new and elevated suites and rooms introduced at Marina Bay Sands.\nFood and beverage expenses increased $15 million compared to the three months ended September 30, 2024, due to increases of $9 million and $6 million at Marina Bay Sands and our Macao operations, respectively. These increases were primarily due to the opening of venues since the second half of 2024 and increases in payroll and business volumes.\nProvision for credit losses was $18 million for the three months ended September 30, 2025, compared to recovery of credit losses of $5 million for the three months ended September 30, 2024. The $23 million increase was primarily due to increases of $20 million and $3 million at Marina Bay Sands and our Macao operations, respectively. The increase at Marina Bay Sands resulted from an $11 million increase in provision during the current quarter and a $9 million decrease in settlements of previously reserved accounts. The increase at our Macao operations resulted from a $5 million increase in provision during the current quarter, partially offset by a $2 million increase in settlements of previously reserved accounts. The amount of this provision can vary over short periods of time because of factors specific to the patrons who owe us money from gaming activities. We believe the amount of our provision for credit losses in the future will depend upon the state of the economy, our credit standards, our risk assessments and the judgment of our employees responsible for granting credit.\nGeneral and administrative expenses increased $15 million compared to the three months ended September 30, 2024. The increase was primarily due to a $15 million increase at Marina Bay Sands, driven by increased payroll, maintenance and utility costs.\n\nCorporate expense increased $10 million compared to the three months ended September 30, 2024. The increase was primarily due to a $5 million increase in payroll and related expenses and $5 million in legal fee recoveries recorded during the three months ended September 30, 2024.\nDevelopment expenses were $72 million for the three months ended September 30, 2025, compared to $55 million for the three months ended September 30, 2024. During the three months ended September 30, 2025, the increase was primarily due to increased efforts related to the pursuit of new business opportunities in Texas and in the digital gaming space. Development costs are expensed as incurred.\nDepreciation and amortization increased $44 million compared to the three months ended September 30, 2024. The increase was due to increases of $27 million and $17 million at Marina Bay Sands and our Macao operations, respectively. The increase at Marina Bay Sands was a result of the completion of renovations that were placed into service throughout 2024 and through the first half of 2025. The increase at our Macao operations was driven by a $28 million increase due to new assets placed into service from the fourth quarter of 2024 and onward, mainly related to the Londoner Grand and the Venetian Arena, partially offset by a $12 million decrease in depreciation due to assets fully depreciated during the prior year and through the third quarter of the current year.\nLoss on disposal or impairment of assets was $68 million for the three months ended September 30, 2025. The losses incurred for the three months ended September 30, 2025, consisted primarily of impairments of $51 million on assets associated with the decision to no longer pursue the development of certain digital gaming activities, $9 million related to assets associated with the decision to no longer pursue a casino license from the state of New York and $3 million related to certain assets in Texas, and losses of $4 million in Macao due to asset disposals at The Londoner Macao and The Venetian Macao.\nSegment Adjusted Property EBITDA\nThe following table summarizes information related to our segments:\nThree Months Ended September 30,\n(Dollars in millions)\nThe Plaza Macao and Four Seasons Macao\nFerry Operations and Other\nConsolidated adjusted property EBITDA\n__________________________\n(1) Consolidated adjusted property EBITDA, which is a non-GAAP financial measure, is used by management as the primary measure of the operating performance of our segments. Consolidated adjusted property EBITDA is net income (loss) before stock-based compensation expense, corporate expense, pre-opening expense, development expense, depreciation and amortization, amortization of leasehold interests in land, gain or loss on disposal or impairment of assets, interest, other income or expense, gain or loss on modification or early retirement of debt and income taxes. Consolidated adjusted property EBITDA is a supplemental non-GAAP financial measure used by management, as well as industry analysts, to evaluate operations and operating performance. In particular, management utilizes consolidated adjusted property EBITDA to compare the operating profitability of our operations with those of our competitors, as well as a basis for determining certain incentive compensation. Integrated Resort companies, including LVSC, have historically reported adjusted property EBITDA as a supplemental performance measure to GAAP financial measures. In order to view the operations of their properties on a more stand-alone basis, Integrated Resort companies, including LVSC, have historically excluded certain expenses that do not relate to the management of specific properties, such as pre-opening expense, development expense and corporate expense, from their adjusted property EBITDA calculations. Consolidated adjusted property EBITDA should not be interpreted as an alternative to income from operations (as an indicator of operating performance) or to cash flows from operations (as a measure of liquidity), in each case, as determined in accordance with GAAP. We have significant uses of cash flow, including capital expenditures, dividend payments, interest payments, debt principal repayments and income taxes, which are not reflected in consolidated adjusted property EBITDA. Not all companies calculate adjusted property EBITDA in the same manner. As a result, our presentation of consolidated adjusted property EBITDA may not be directly comparable to similarly titled measures presented by other companies.\n\nCorporate expenses increased $5 million compared to the nine months ended September 30, 2024. The increase was primarily due to a $9 million increase in payroll and related expenses and $5 million in legal fee recoveries recorded during the nine months ended September 30, 2024, partially offset by $10 million recorded during the three months ended March 31, 2024, related to a shareholder dividend tax agreement with the Macao government, which was finalized on February 7, 2024, and covers the years from 2023 to 2025.\nPre-opening expenses were $20 million for the nine months ended September 30, 2025, compared to $10 million for the nine months ended September 30, 2024. During the nine months ended September 30, 2025, the increase was primarily due to increases in marketing and media expenses for the Londoner Grand and property taxes related to the MBS Expansion Project in Singapore.\nDevelopment expenses were $210 million for the nine months ended September 30, 2025, compared to $169 million for the nine months ended September 30, 2024. During the nine months ended September 30, 2025, the increased costs were associated with increased efforts primarily related to our digital gaming pursuits. Development costs are expensed as incurred.\nDepreciation and amortization increased $141 million compared to the nine months ended September 30, 2024. The increase was primarily due to increases of $111 million and $28 million at Marina Bay Sands and our Macao operations, respectively. The increase at Marina Bay Sands was primarily due to the completion of the room renovations that were placed into service throughout 2024 and the first half of 2025. The increase at our Macao operations was driven by a $91 million increase due to new assets placed into service from the fourth quarter of 2024 onward"
}