{
  "source_file": "lw-20250525.htm",
  "form_type": "10-K",
  "item1_clean": "ITEM 1. BUSINESS\nLamb Weston Holdings, Inc. (“we,” “us,” “our,” “the Company,” or “Lamb Weston”) is a leading global producer, distributor, and marketer of value-added frozen potato products and is headquartered in Eagle, Idaho. We are the number one supplier of value-added frozen potato products in North America and a leading supplier of value-added frozen potato products internationally, with a strong presence in high-growth emerging markets. We offer a broad product portfolio to a diverse channel and customer base in over 100 countries. French fries represent most of our value-added frozen potato product portfolio.\nWe were organized as a Delaware corporation in July 2016. Our common stock trades under the ticker symbol “LW” on the New York Stock Exchange.\nOur North America segment primarily includes frozen potato products sold in the United States, Canada, and Mexico to quick service and full-service restaurants and chains, foodservice distributors, non-commercial channels, and retailers. Our North America segment’s product portfolio includes frozen potatoes, commercial ingredients, and appetizers sold under the\nbrand, as well as frozen potatoes sold under the Company’s owned or licensed brands, including\n, other licensed equities comprised of brand names of major North American restaurant chains, customer labels, and retailers’ own brands.\nOur International segment primarily includes frozen potato products sold outside of North America to quick service and full-service restaurant chains, foodservice distributors, non-commercial channels, and retailers. Our International segment’s product portfolio includes frozen potatoes, commercial ingredients, and appetizers sold under the\nbrand, as well as many customer labels.\nJoint Venture Relationships\nWe hold a 50% ownership interest in Lamb-Weston/RDO Frozen (“Lamb Weston RDO”), a joint venture with RDO Frozen Co., that operates a single potato processing facility in the U.S. We provide all sales and marketing services to Lamb Weston RDO and receive a fee for these services based on a percentage of the net sales of the venture. We account for our investment in Lamb Weston RDO under the equity method of accounting. In addition, LW EMEA owns a 75% interest in a joint venture in Austria. This joint venture’s financial results are consolidated in our financial statements.\nSales, Distribution and Customers\nWe benefit from strong relationships with a diverse set of customers. We sell our products through a network of internal sales personnel and independent brokers, agents, and distributors to chain restaurants, wholesale, grocery, mass merchants, club retailers, specialty retailers, and foodservice distributors and institutions, including businesses, educational institutions, independent restaurants, regional chain restaurants, and convenience stores. We have long-tenured relationships with leading quick service and fast casual restaurant chains, global foodservice distributors, large grocery retailers, and mass merchants.\nProducts are generally shipped from warehouse distribution centers where they are consolidated for shipment to customers if an order includes products manufactured in more than one production facility or product category. Some customers also pick up their orders at distribution centers.\nA relatively limited number of customers account for a large percentage of our consolidated net sales. In fiscal 2025, our ten largest customers accounted for approximately 50% of our net sales. In fiscal 2025, 2024, and 2023, our largest customer, McDonald’s Corporation, accounted for approximately 15%, 14%, and 13%, respectively, of our consolidated net sales. No other customer accounted for more than 10% of our consolidated net sales in fiscal 2025, 2024, and 2023.\nResearch and Development\nWe leverage our research and development resources for both growth and efficiency initiatives. We seek to drive growth through innovation by creating new products, enhancing the quality of existing products, and participating in joint menu planning exercises with our customers. We also evaluate the sustainability impacts of our manufacturing processes and products in our research and development activities and continue to drive processing innovations aimed at reducing waste and water usage and improving food safety and quality.\nTrademarks, Licenses and Patents\nOur trademarks are material to our business and are protected by registration or other means in the U.S. and most other geographic markets where the related food items are sold. Depending on the country, trademarks generally remain valid for as long as they are in use or their registrations are maintained. Trademark registrations generally are for renewable, fixed terms. Our significant trademarks include\nLamb Weston, Lamb Weston Supreme, Lamb Weston Seeing Possibilities in Potatoes\nPossibilities in Potatoes\nLamb Weston Seasoned, Lamb Weston Private Reserve, Lamb Weston Stealth Fries, Lamb Weston Colossal Crisp, Lamb Weston Crispy on Delivery, Twister Fries\n. We also sell certain products in connection with marks such as\n, which we license from third parties.\nWe own numerous patents worldwide. We consider our portfolio of patents, patent applications, patent licenses, proprietary trade secrets, technology, know-how processes, and related intellectual property rights to be material to our operations. Patents, issued or applied for, cover inventions, including packaging, manufacturing processes, equipment, formulations, and designs. Our issued patents extend for varying periods according to the date of the patent application filing or grant, the legal term of patents in the various countries where patent protection is obtained, and, in most countries, the payment of fees to maintain the patents. The actual protection afforded by a patent, which can vary from country to country, depends upon the type of patent, the scope of its coverage as determined by the patent office or courts in the country, and the availability of legal remedies in the country, which may, in some countries, depend in part on appropriate patent marking and working the patents.\nOur primary raw materials are potatoes, edible oils, packaging, grains, starches, and energy inputs. We source a significant amount of our raw potatoes under both strategic, long-term grower relationships and short-term annual contracts. In the U.S., most of the potato crop used in our products is grown in Washington, Idaho, and Oregon. In Europe, growing regions for the necessary potatoes are concentrated in the Netherlands, Austria, Belgium, Germany, France, and the United Kingdom. We also have grower relationships in potato growing regions in Canada, China, Australia, and Argentina that support our processing facilities in those countries. We believe that the grower networks to which we have access provide a sufficient source of raw potato inputs year-to-year. We source edible oils through strategic relationships with key suppliers, and we source packaging and energy inputs through multiple suppliers under a variety of agreement types.\nThe prices paid for these raw materials, as well as other raw materials used in making our products, generally reflect factors such as weather, commodity market fluctuations, currency fluctuations, tariffs, fuel prices, energy costs, labor, freight transportation, logistics, general U.S. and global economic conditions, and the effects of governmental agricultural programs. The prices of raw materials can fluctuate as a result of these factors.\nDuring fiscal 2025, we continued to face increased costs for the primary raw materials for our products, including potatoes, edible oils, packaging, grains, starches, and energy inputs. We seek to mitigate higher input costs through long-term relationships, contracting strategies, and hedging activities where an active market for an input exists, as well as, through our pricing and productivity initiatives. See also “Item 1A. Risk Factors” for a discussion of risks related to our input costs.\nWe operate 26 production facilities for our products. See “Item 2. Properties” for more information about our production facilities. In addition to our own production facilities, we source a portion of our products under “co-packing” agreements, a common industry practice in which manufacturing is outsourced to other companies. We regularly evaluate our co-packing arrangements to ensure the most cost-effective manufacturing of our products and to utilize company-owned production facilities most effectively.\nInternational Operations\nOur inventory levels, net sales, segment adjusted EBITDA, and cash flows are affected by seasonality. In general, our segment adjusted EBITDA percentage tends to be highest in our fiscal third quarter, reflecting the cost benefits of freshly harvested potatoes. We typically harvest potatoes in the Pacific Northwest of the U.S. and Europe in July through October, which is primarily in our fiscal second quarter. While the quality of potatoes affects production efficiency, overall, freshly harvested potatoes process more efficiently in our production lines and are not subject to storage or secondary transport costs. We typically hold 50 to 60 days of finished goods inventory on a first-in-first-out basis, so the costs incurred from our fiscal second quarter harvest, which are generally favorable, will flow through our income statement in our fiscal third quarter. Inventory levels also tend to be higher in our fiscal third quarter, requiring more working capital at that time. In general, net sales and cash flows tend to be higher in our fiscal fourth quarter, reflecting customer and consumer buying patterns.\nThe number of days of inventory on hand exceeded our typical levels the last two fiscal years primarily due to lower sales volume compared to forecasted amounts. We have working capital initiatives underway to decrease inventories in line with historical levels.\nHuman Capital Resources\nWe believe that our employees and our workplace culture are among our most important assets, and that our employees are integral to our ability to achieve our strategic objectives. Attracting, developing, and retaining the best talent globally with the right skills to drive our mission, vision, and values are central components of our strategies for long-term growth. As of July 17, 2025, we had approximately 10,100 employees, of which approximately 3,100 employees work outside of the U.S. As of July 17, 2025, approximately 30% of our employees are parties to collective bargaining agreements with terms that we believe are typical for the industry in which we operate. Most of the union workers at our facilities are represented under contracts that expire at various times over the next several years. Of the hourly employees who are represented by these contracts, 65% are party to a collective bargaining agreement currently in negotiations or scheduled to expire over the course of the next twelve months. As the agreements expire, we believe they will be renegotiated on terms satisfactory to the parties.\nOur employees’ health, safety, and well-being are our highest priority. We strive for world-class safety at each of our facilities. This means we continuously focus on creating a zero-incident culture. To help achieve this goal, we foster safety leadership throughout the organization as part of our comprehensive environment, health, safety, and sustainability management system. Through ongoing communications, routine assessments of our safety programs, safety and job-related training, daily risk assessments at facilities, defined standards, and safety measures, we strive to improve our safety performance each year.\nOur compensation and benefits are designed to support the financial, mental, and physical well-being of our employees. We are committed to equal pay for equal work. As part of this commitment, we regularly review our compensation practices and benchmark and set pay ",
  "item7_clean": "ITEM 7. MANAGEMENT’S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS\nOur MD&A is based on financial data derived from the financial statements prepared in accordance with U.S. generally accepted accounting principles (“GAAP”). We have also presented Adjusted EBITDA, Adjusted Gross Profit, Adjusted Selling, General and Administrative expenses (“SG&A”), and Adjusted Equity Method Investment Earnings, each of which is considered a non-GAAP financial measure, to supplement the financial information included in this report. Refer to “Non-GAAP Financial Measures” below for the definitions of Adjusted EBITDA, Adjusted Gross Profit, Adjusted SG&A, and Adjusted Equity Method Investment Earnings, and a reconciliation of these non-GAAP financial measures to their most directly comparable GAAP financial measures, net income, gross profit, SG&A, and equity method investment earnings, as applicable. For more information, refer to the “Results of Operations” and “Non-GAAP Financial Measures” sections below.\nLamb Weston is a leading global producer, distributor, and marketer of value-added frozen potato products. We are the number one supplier of value-added frozen potato products in North America and are a leading supplier of value-added frozen potato products internationally, with a strong and growing presence in high-growth emerging markets. We offer a broad product portfolio to a diverse channel and customer base in over 100 countries. French fries represent most of our value-added frozen potato product portfolio.\nWe ended the year with improved trends in customer wins and retention, leading to volume growth for the full year. Inflationary pressure persisted in fiscal 2025, which contributed to consumer uncertainty and lower overall restaurant traffic and frozen potato demand. To compete in this highly competitive environment, we supported our customers with price and trade investments. Halfway through the year, we made important changes to adapt to the evolving environment and put our business on a path back to growth. We announced our FY25 Restructuring Plan, which included the permanent closure of one of our manufacturing facilities, temporarily curtailing certain production lines across our manufacturing network in North America, and other operating and capital expense reductions. We continue to make important changes to adapt to the evolving environment. On July 23, 2025, we outlined “Focus to Win,” a new strategic plan to focus on four pillars including (1) prioritizing markets and channels, (2) strengthening customer partnerships, (3) achieving executional excellence and (4) setting the pace for industry-leading innovation. This strategic plan includes our Cost Savings Program which is expected to deliver at least $250 million of annualized run rate savings by the end of fiscal year 2028. Approximately $200 million of these annualized cost savings are expected by the end of fiscal year 2027. In addition, we expect to generate approximately $120 million of working capital improvements, compared to current levels, by the end of fiscal 2027. In connection with the Cost Savings Program, we expect to recognize total pre-tax cash charges of $70 million to $100 million, most of which will be paid in fiscal 2026.\nIn fiscal 2026, we expect continued pressure on consumers from macroeconomic and geopolitical factors and that global restaurant traffic will remain approximately even with fiscal 2025 levels. We believe customers and consumers will continue to prioritize french fries as a menu and at home item and that our customer win momentum that began in the second half of fiscal 2025 and the contribution of a 53rd week in fiscal 2026, with the additional week falling in the fourth quarter, will increase sales volumes, despite continued soft restaurant traffic. We expect earnings will decline as they are pressured by carryover price investments and new investments in fiscal 2026, overall input cost increases, net of the benefit of lower raw potato costs, incremental depreciation from the capacity expansions in the Netherlands and Argentina, and increased compensation and benefits as we normalize incentives, which will only be partially offset by benefits from the FY25 Restructuring Plan and Cost Savings Program. Our outlook does not include additional impacts of evolving trade policies, including additional changes in tariffs and retaliatory countermeasures.\nOn July 4, 2025, President Trump signed into law the One Big Beautiful Bill Act (“OBBBA”). Accounting Standards Codification (“ASC”) 740,\nResults of Operations\nFiscal Year Ended May 25, 2025 Compared to Fiscal Year Ended May 26, 2024\nFor the Fiscal Years Ended May\n(in millions, except percentages)\nSegment Adjusted EBITDA\nLamb Weston’s net sales declined $16.3 million to $6,451.3 million in fiscal 2025. Price/mix declined 2%, reflecting the impact of planned investments in price and trade support in a competitive environment to attract and retain customers globally. The decrease in price/mix was mostly offset by a 2% increase in volume, primarily in the International segment and included fully replacing the combined regional, small, and retail customer volume lost, primarily in North America, in the prior year during the Company’s transition to a new ERP system in the second half of fiscal 2024. Volume increased despite a decrease in global restaurant traffic in fiscal 2025, compared to fiscal 2024.\nNorth America segment net sales declined $98.0 million, or 2%, to $4,265.2 million. Price/mix declined 3%, reflecting planned investments in price and trade driven by an increasingly competitive market, with moderate offsets in channel and product mix. Despite a low single-digit percentage point decline related to softer North America restaurant traffic in fiscal 2025, compared with fiscal 2024, volume increased 1%. Increased regional, small, and retail customer volume more than offset low single-digit volume declines with large chain customers, in North America, which were primarily in the first half of the year.\nInternational segment net sales increased $81.7 million, or 4%, to $2,186.1 million. Volume increased 5%, which reflects growth related to new customer wins and growth with existing customers in all regions. Price/mix declined 1%, which reflects pricing actions in key international markets in response to the continued competitive environment.\nGross profit declined $368.1 million versus the prior fiscal year to $1,398.6 million. Adjusted Gross Profit declined $298.2 million versus the prior fiscal year to $1,460.5 million, driven primarily by increased manufacturing costs per pound, including higher factory burden absorption. In response to softer restaurant traffic and to reduce inventory levels, we temporarily curtailed production in fiscal 2025. In addition, key input costs increased low-single-digits, including: potato, labor, and packaging costs, as well as $57.6 million of incremental depreciation expense largely associated with the Company’s recent capacity expansions in China, the U.S. and the Netherlands. Transportation and warehousing costs increased in the low double-digits, primarily related to higher warehouse inventories. The increased costs were partially offset by lapping an estimated $88 million of pre-tax losses associated with the ERP transition in fiscal 2024; $85.1 million pre-tax charge for the write-off of excess raw potatoes; and an estimated $9 million incremental pre-tax loss related to the voluntary product withdrawal initiated in the fourth quarter of the prior year.\nSelling, General and Administrative Expenses\nSG&A declined $67.9 million versus the prior fiscal year to $633.5 million. Adjusted SG&A declined $30.3 million to $643.9 million, primarily related to lapping higher expenses associated with the ERP transition in the prior year, a $13.9 million decrease in advertising and promotion expenses, and the benefit of cost savings associated with the FY25 Restructuring Plan, partially offset by $14.6 million of incremental depreciation and amortization expense primarily related to our ERP transition in the prior year and higher compensation and benefit expenses.\nRestructuring Expense\nNet Income, Adjusted EBITDA and Segment Adjusted EBITDA\nNet income was $357.2 million, down $368.3 million versus the prior fiscal year, and diluted EPS was $2.50, down $2.48 from the prior fiscal year.\nAdjusted EBITDA declined $196.2 million from the prior fiscal year to $1,220.5 million, reflecting lower Adjusted Gross Profit partially offset by lower Adjusted SG&A.\nNorth America Segment Adjusted EBITDA declined $161.7 million to $1,101.4 million, reflecting investments in price and trade, higher manufacturing costs per pound (which largely reflected higher factory burden absorption related to temporarily curtailed production as part of our effort to reduce inventory to current demand levels), and higher transportation and warehousing costs per pound. These cost increases were partially offset by lapping an approximately $83 million negative impact of the ERP transition in the prior year and lower Adjusted SG&A in fiscal 2025, including a $9.5 million decrease in advertising and promotion expenses.\nInternational Segment Adjusted EBITDA declined $78.2 million to $253.7 million. Higher net sales and lower Adjusted SG&A were offset by an increase in manufacturing costs per pound, including mid-to-high single-digit increases in raw potato costs, primarily in the first half of the year and incremental costs related to the start-up of the new production line in the Netherlands. Higher warehouse inventories also led a mid-to-high single-digit increase in warehousing costs. These costs more than offset lapping a $9.9 million charge for the write-off of excess raw potatoes, approximately $9 million, net of allocated losses related to the voluntary product withdrawal, and an approximately $5 million negative impact related to the ERP transition in the prior year.\nInterest Expense, Net\nOur effective tax rate for fiscal 2025 was 28.6%, versus 24.1% in fiscal 2024, with the increase largely attributable to foreign losses without tax benefits and a higher proportion of overall earnings in our International segment. Our effective tax rate varies from the U.S. statutory tax rate of 21% primarily due to the impact of U.S. state taxes, foreign taxes, permanent differences, and discrete items.\nEquity Method Investment Earnings\nEquity method investment earnings from unconsolidated joint ventures were $15.2 million and $26.0 million for fiscal 2025 and 2024, respectively. The results for the current and prior fiscal years reflect earnings associated with the Company's 50 percent interest in Lamb Weston/RDO Frozen, an unconsolidated potato processing joint venture in Minnesota.\nAdjusted Equity Method Investment Earnings was slightly down at $25.7 million compared to $26.0 million the prior fiscal year. The prior fiscal year included a $10.8 million charge for the write-off of excess raw potatoes. The decrease in equity method investment earnings reflects lower net sales and higher manufacturing costs per pound, primarily related to softer restaurant traffic contributing to lower production and increased factory burden absorption.\nLiquidity and Capital Resources\nThe primary source of our liquidity is from cash flow from operations. We generated $868.3 million of cash from operations in fiscal 2025. We use cash from operations to fund our capital expenditures, acquisitions, and debt service. A substantial portion of our operating cash flow has been returned to shareholders through dividends and share repurchases.\nWe ended fiscal 2025 with $70.7 million of cash and cash equivalents and approximately $1.2 billion of availability under our revolving credit facility. We believe we have sufficient liquidity to meet our business requirements for at least the next 12 months and the foreseeable future thereafter.\nBelow is a summary table of our cash flows, followed by a discussion of the sources and uses of cash through operating, investing, and financing activities:\nFor the Fiscal Years Ended May\n(in millions, except percentages)\nNet cash flows provided by (used for):\nOperating activities\nInvesting activities\nFinancing activities\nEffect of exchange rate changes on cash and cash equivalents\nNet decrease in cash and cash equivalents\nCash and cash equivalents, beginning of period\nCash and cash equivalents, end of period\nOperating Activities\nDuring fiscal 2025, cash provided by operating activities increased $70.1 million to $868.3 million, compared to $798.2 million for fiscal 2024. The increase primarily related to $349.1 million of favorable changes in working capital, primarily attributable to reduced inventories and a favorable change in accrued liabilities related to changes in compensation and benefit accruals in the prior year.\nInventory days on hand at the end of fiscal 2025 declined eight days compared with fiscal 2024. This was partially offset by a\n$279.0 million decrease in net income, adjusted for non-cash income and expenses\n. See “Results of Operations” in this MD&A for more information related to the\nin income from operations.\nInvesting Activities\nInvesting activities used $648.0 million of cash in fiscal 2025, compared with $984.1 million in fiscal 2024.\nprimarily attributable to reduced cash expenditures in fiscal 2025 as our strategic capacity expansion projects in China and the U.S. were completed in fiscal 2024 and our capacity expansion in the Netherlands was completed in the first half of fiscal 2025. We expect our capacity expansion project in Argentina will begin production in August 2025.\nWe expect to use approximately $500 million for investing activities in fiscal 2026, primarily related to maintenance and facility modernization, as well as expenditures related to environmental projects largely focused on wastewater treatment at our production facilities.\nFinancing Activities\nDuring fiscal 2025, we used $225.0 million of net cash for financing activities. We had net proceeds of $42.8 million from our revolving credit facility and other short-term credit facilities held by subsidiaries and $500 million of proceeds from our amended term loan facility that was used primarily to repay an existing term loan facility and outstanding borrowings under our revolving credit facility. We used $294.4 million to repurchase an aggregate of 4,867,449 shares at a weighted-average price of $57.94 per share and withheld 216,317 shares from employees to cover income and payroll taxes on equity awards that vested during the period. In addition, we paid $206.9 million in cash dividends to common stockholders.\nDuring fiscal 2024, proceeds from short-term borrowings and debt issuances were $756.9 million, of which $164.9 million were short-term and $592.0 million related to upsizing our term loan borrowing capacity in connection with entering into a new term loan credit agreement in May 2024. We repaid $401.1 million of debt and financial obligations, which primarily included repayments towards the Term A-2 loan facility and Euro loan facility in connection with entering into new term loan and revolving credit agreements. We used $225.3 million of cash to repurchase 2,294,654 shares of our common stock at an average price of $91.51 per share, and we withheld 146,259 shares from employees to cover income and payroll taxes on equity awards that vested during the year. In addition, we paid $174.0 million in cash dividends to common stockholders.\nObligations and Commitments\nAs part of our ongoing operations, we enter into arrangements that obligate us to make future payments under contracts such as debt agreements, lease agreements, potato supply agreements, and unconditional purchase obligations. The unconditional purchase obligations are enforceable and legally binding arrangements entered into in the normal course of business to ensure adequate ",
  "item2_clean": null
}