{
  "source_file": "lw-20250824.htm",
  "form_type": "10-Q",
  "item1_clean": null,
  "item7_clean": null,
  "item2_clean": "ITEM 2. MANAGEMENT'S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS\nForward-Looking Statements\nThis report, including the MD&A, contains forward-looking statements within the meaning of the federal securities laws. Words such as “will,” “continue,” “may,” “expect,” “anticipate,” “believe,” “strengthen,” “innovate,” “reduce,” “estimate,” “deliver,” “remain,” “drive,” “increase,” “expand,” “focus,” “decline,” “outlook,” and variations of such words and similar expressions are intended to identify forward-looking statements. Examples of forward-looking statements include, but are not limited to, statements regarding our business and financial outlook and prospects, our plans and strategies and anticipated benefits therefrom, including with respect to the Cost Savings Program and Restructuring Plan, capital expenditures and investments, costs, cash flows, liquidity, dividends, and anticipated conditions in our industry and the global economy. These forward-looking statements are based on management’s current expectations and are subject to uncertainties and changes in circumstances. Readers of this report should understand that these statements are not guarantees of performance or results. Many factors could affect these forward-looking statements and our actual financial results and cause them to vary materially from the expectations contained in the forward-looking statements, including those set forth in this report. These risks and uncertainties include, among other things: consumer preferences, including restaurant traffic in North America and our international markets, and an uncertain general economic environment, including tariffs, inflationary pressures and recessionary concerns, any of which could adversely impact our business, financial condition or results of operations, including the demand and prices for our products; the availability and prices of raw materials and other commodities; operational challenges; our ability to successfully implement the Cost Savings Program, the Restructuring Plan or other cost savings or efficiency initiatives, including achieving the benefits of those activities and possible changes in the size and timing of related charges; difficulties, disruptions or delays in implementing new technology; levels of labor and people-related expenses; our ability to successfully execute our long-term value creation strategies, including our Focus to Win plan; our ability to execute on large capital projects, including construction of new production lines or facilities; the competitive environment and related conditions in the markets in which we operate; political and economic conditions in the countries in which we conduct business and other factors related to our international operations; disruptions in the global economy caused by conflicts such as the war in Ukraine and conflicts in the Middle East and the possible related heightening of our other known risks; the ultimate outcome of litigation or any product recalls or withdrawals; changes in our relationships with our growers or significant customers; impacts on our business due to health pandemics or other contagious outbreaks, such as the COVID-19 pandemic, including impacts on demand for our products, increased costs, disruption of supply, other constraints in the availability of key commodities and other necessary services or restrictions imposed by public health authorities or governments; disruption of our access to export mechanisms; risks associated with integrating acquired businesses; risks associated with other possible acquisitions; our debt levels; actions of governments and regulatory factors affecting our businesses; our ability to pay regular quarterly cash dividends and the amounts and timing of any future dividends; and other risks described in our reports filed from time to time with the SEC. We caution readers not to place undue reliance on any forward-looking statements included in this report, which speak only as of the date of this report. We undertake no responsibility for updating these statements, except as required by law.\nLamb Weston Holdings, Inc. (“we,” “us,” “our,” the “Company,” or “Lamb Weston”) is a leading global producer, distributor, and marketer of value-added frozen potato products. We are the number one supplier of value-added frozen potato products in North America and a leading supplier of value-added frozen potato products internationally, with a strong and growing presence in high-growth emerging markets. We offer a broad product portfolio to a diverse channel and customer base in over 100 countries. French fries represent the majority of our value-added frozen potato product portfolio.\nThis MD&A is provided as a supplement to the consolidated financial statements and related condensed notes included elsewhere herein to help provide an understanding of our financial condition, changes in financial condition and results of our operations. Our MD&A is based on financial data derived from the financial statements prepared in accordance with U.S. generally accepted accounting principles (“GAAP”). We have also presented Adjusted EBITDA, Adjusted Gross Profit, Adjusted Selling, General and Administrative expenses (“SG&A”), and Adjusted Income Tax Expense, each of which is considered a non-GAAP financial measure, to supplement the financial information included in this report. Refer to “Non-GAAP Financial Measures” below for the definitions of Adjusted EBITDA, Adjusted Gross Profit, Adjusted SG&A, and Adjusted Income Tax Expense and a reconciliation of these non-GAAP financial measures to their most directly comparable GAAP financial measures, net income, gross profit, SG&A, or income tax expense, as applicable. For more information, refer to the “Results of Operations” and “Non-GAAP Financial Measures” sections below.\nDuring the quarter, we saw volume growth and positive customer momentum. While the operating environment remains competitive, we believe our disciplined execution and strategic plans are better enabling us to expand our customer base and drive long-term growth. We are focused on executional excellence, including delivering our Cost Savings Program. Actions taken over the past two fiscal years have improved our manufacturing costs per pound and lowered SG&A. We are focused on strengthening customer partnerships and innovating across our business.\nOur operational improvements also drove favorable working capital changes, primarily from lower inventories. Operating cash flow and cash on hand increased at the end of the period, and capital expenditures declined as we near completion of our growth-related investments in our production facilities, with the startup of a new production facility in Argentina during the first quarter.\nIn fiscal 2026, we anticipate that global consumers will continue to face macroeconomic and geopolitical pressures, alongside a competitive environment, particularly in our international markets. We expect global restaurant traffic to remain roughly in line with fiscal 2025 levels. We believe customers and consumers will continue to prioritize french fries both on menus and at home. Momentum from customer wins in the second half of fiscal 2025 and the contribution of a 53rd week in fiscal 2026, with the additional week falling in the fourth quarter, is expected to drive increased sales volumes.\nWe expect earnings will decline as they are pressured by the impact of pricing and mix, higher overall input costs, net of the benefit of lower raw potato costs, incremental depreciation and start-up costs from the capacity expansions in the Netherlands and Argentina, and increased compensation and benefits as incentive programs normalize. These factors will only be partially offset by benefits from the Restructuring Plan and Cost Savings Program.\nOur outlook includes our current view of the anticipated impact of enacted tariffs by the U.S. and other governments but does not include the potential effects of evolving trade policies, including future changes in tariffs or retaliatory countermeasures.\nResults of Operations\nThirteen Weeks Ended August 24, 2025 compared to Thirteen Weeks Ended August 25, 2024\nNet Sales and Segment Adjusted EBITDA\nThirteen Weeks Ended\n(in millions, except percentages)\n% Increase (Decrease) at Constant Currency\nSegment Adjusted EBITDA\nNet sales for the first quarter of fiscal 2026 increased $5.2 million to $1,659.3 million compared to the prior year quarter, including a favorable foreign currency impact of $23.7 million. Net sales at constant currency declined 1% over the prior year quarter, as a 6% increase in volume was more than offset by a 7% decline in price/mix. Net sales and price/mix at constant currency are calculated by translating financial data for the current year period at prior year average exchange rates. Volume growth was driven by customer wins and retention, particularly in North America and Asia, as well as lapping an approximately $15 million charge in the prior year quarter related to a voluntary product withdrawal. Price/mix reflects the carryover impact of fiscal 2025 price and trade investments to support customers, ongoing price and trade support, and unfavorable channel product mix within our segments.\nNorth America segment net sales, which includes all sales to customers in the U.S., Canada, and Mexico, declined $19.1 million, or 2%, to $1,084.6 million. Volume increased 5% compared to the prior year quarter supported by recent customer contract wins and growth across channels. Price/mix declined 7%, driven by the carryover impact from fiscal 2025 price investments, the ongoing support of customers through price and trade and an unfavorable channel mix.\nInternational segment net sales, which includes all sales to customers outside of North America, increased $24.3 million, or 4%, to $574.7 million year-over-year, including a favorable $24.5 million from foreign currency translation. Net"
}