{
  "source_file": "lyb-20250930.htm",
  "form_type": "10-Q",
  "item1_clean": null,
  "item7_clean": null,
  "item2_clean": "$3,750 million under our $3,750 million Senior Revolving Credit Facility. This facility supports our $2,500 million commercial paper program. Availability under this facility is net of outstanding borrowings, outstanding letters of credit provided under the facility and notes issued through our commercial paper program. As of September 30, 2025, we had no outstanding commercial paper and no borrowings or letters of credit outstanding under this facility; and\n$900 million under our $900 million U.S. Receivables Facility. Availability under this facility is subject to a borrowing base of eligible receivables, which is reduced by outstanding borrowings and letters of credit, if any. As of September 30, 2025, we had no borrowings or letters of credit outstanding under this facility. In May 2025, we extended the term of the facility to June 2026 in accordance with the terms of the agreement.\nIn September 2025, we amended the Senior Revolving Credit Facility primarily to increase the Maximum Leverage Ratio (as defined in the Credit Agreement) through 2027 unless we elect to terminate such provisions sooner. Included in the amendment are certain limitations, including restrictions on dividend increases, if our leverage ratio is greater than or equal to 4.00 to 1.00, and share repurchases except to offset dilution. Additionally, the modification to the Maximum Leverage Ratio was incorporated into the U.S. Receivables Facility. For additional detail see Note 8 to the Consolidated Financial Statements.\nAt any time and from time to time, we may repay or redeem our outstanding debt, including purchases of our outstanding bonds in the open market, through privately negotiated transactions or a combination thereof, in each case using cash and cash equivalents, cash from our short-term investments, cash from operating activities, proceeds from the issuance of debt or proceeds from asset divestitures. Any repayment or redemption of our debt will depend on prevailing market conditions, our liquidity requirements, contractual restrictions and other factors. In connection with such repurchases or redemptions, we may incur cash and non-cash charges, which could be material in the period in which they are incurred.\nIn May 2025, our shareholders approved a proposal to authorize us to repurchase up to 34.0 million ordinary shares through November 23, 2026, which superseded any prior repurchase authorizations. Our share repurchase authorization does not have a stated dollar amount, and purchases may be made through open market purchases, private market transactions or other structured transactions. Repurchased shares could be retired or used for general corporate purposes, including for various employee benefit and compensation plans. The maximum number of shares that may yet be purchased is not necessarily an indication of the number of shares that will ultimately be purchased. In September 2025, we amended our Senior Revolving Credit Facility which now restricts share repurchases, except to offset dilution. During the first half of 2025, we purchased approximately 3.0 million shares under our share repurchase authorizations for $201 million.\nAs of October 29, 2025, we had approximately 34.0 million shares remaining under the current authorization. The timing and amounts of additional shares repurchased, if any, will be determined based on our evaluation of market conditions and other factors, including any additional authorizations approved by our shareholders. For additional information related to our share repurchase authorizations, see Note 12 to the Consolidated Financial Statements.\nCURRENT BUSINESS OUTLOOK\nIn the fourth quarter of 2025, year-end seasonality and lower operating rates are expected to impact results across most businesses. In North America, higher natural gas and feedstock costs are likely to pressure integrated polyolefins margins. In Europe, weak industrial and consumer demand is expected to persist. Global capacity rationalizations and anti-involution measures in China are supporting a more constructive mid-term outlook for the industry. Industry downtime supported oxyfuels margins during October, but seasonally higher costs for feedstocks and lower octane values are expected to pressure oxyfuels profitability for the remainder of the fourth quarter. In our APS segment, pricing pressure persists, but cost reduction initiatives are expected to offset some of the impact.\nIn November 2025, we will idle our larger cracker in Wesseling, Germany and one of the propylene oxide/styrene monomer units in Channelview, Texas. Each asset will be down for about 40 days. This downtime will allow for maintenance activities while aligning production with global demand and reducing working capital. We expect fourth quarter operating rates of 80% for our O&P-Americas assets, 60% for our European O&P-EAI assets and 75% for our I&D assets.\nCRITICAL ACCOUNTING POLICIES AND ESTIMATES\nWe test goodwill for impairment annually in the fourth quarter, or more frequently when events or changes in circumstances indicate that the fair value of a reporting unit may be below its carrying amount.\nIn the third quarter of 2025, we performed a quantitative impairment assessment of the reporting units within our O&P-EAI and APS segments, resulting in the recognition of non-cash impairment charges of $1,182 million. Refer to Note 14 to our Consolidated Financial Statements.\nThe process of valuing each reporting unit is inherently subjective as valuation models require the application of significant estimates and the use of unobservable inputs including projected operating results, economic conditions, expected cash flows and discount rates and other assumptions based on a market participant perspective. The discount rates applied in our cash flow models reflect considerations such as prevailing market and economic conditions, the risk profile of the projected cash flows, and the return expectations of market participants. While we believe our fair value estimates are reasonable, actual results may differ from those projections.\nThe impairments recognized in our O&P-EAI and APS segments resulted in a full write-down of Goodwill for these segments, as well as Property, plant and equipment for the impacted asset groups. Intangible assets remaining within our APS segment after the recognition of impairment charges are immaterial. We believe that any reasonable variation, whether favorable or unfavorable, in a significant input would not have a material effect on Net (loss) income. In addition, due to the complexity and interdependence of the assumptions underlying the impairment analysis, it is not practicable to quantify the effect of individual assumptions on Net (loss) income.\nACCOUNTING AND REPORTING CHANGES\nFor a discussion of the potential impact of new accounting pronouncements on the Consolidated Financial Statements, see Note 2 to the Consolidated Financial Statements.\nCAUTIONARY STATEMENT FOR THE PURPOSES OF THE “SAFE HARBOR” PROVISIONS OF THE PRIVATE SECURITIES LITIGATION REFORM ACT OF 1995\nThis report includes forward-looking statements within the meaning of Section 27A of the Securities Act of 1933 (the “Securities Act”) and Section 21E of the Securities Exchange Act of 1934 (the “Exchange Act”). You can identify our forward-looking statements by the words “anticipate,” “estimate,” “believe,” “continue,” “could,” “intend,” “may,” “plan,” “potential,” “predict,” “should,” “will,” “expect,” “objective,” “projection,” “forecast,” “goal,” “guidance,” “outlook,” “effort,” “target” and similar expressions.\nWe based forward-looking statements on our current expectations, estimates and projections of our business and the industries in which we operate. We caution you that these statements are not guarantees of future performance. They involve assumptions about future events that, while made in good faith, may prove to be incorrect, and involve risks and uncertainties we cannot predict. Our actual outcomes and results may differ materially from what we have expressed or forecast in the forward-looking statements. Any differences could result from a variety of factors, including the following:\n\nthe cost of raw materials represents a substantial portion of our operating expenses, and energy costs generally follow price trends of crude oil, natural gas liquids and/or natural gas; price volatility can significantly affect our results of operations and we may be unable to pass raw material and energy cost increases on to our customers due to the significant competition that we face, the commodity nature of our products and the time required to implement pricing changes;\nour operations in the United States (“U.S.”) have benefited from low-cost natural gas and natural gas liquids; decreased availability of these materials (for example, from their export or regulations impacting hydraulic fracturing in the U.S.) could reduce the current benefits we receive;\nif crude oil prices are low relative to U.S. natural gas prices, we could see less benefit from low-cost natural gas and natural gas liquids and it could have a negative effect on our results of operations;\nindustry production capacities and operating rates may lead to periods of oversupply and low profitability and our future operating and financial results are dependent on the pace of global capacity rationalization;\nwe may face unplanned operating interruptions (including leaks, explosions, fires, weather-related incidents, mechanical failures, unscheduled downtime, supplier disruptions, labor shortages, strikes, work stoppages or other labor difficulties, transportation interruptions, spills and releases and other environmental incidents) at any of our facilities, which would negatively impact our operating results;\nchanges in general economic, business, political and regulatory conditions in the countries or regions in which we operate could increase our costs through tariffs or otherwise, limit "
}