{
  "source_file": "lyv-20250930.htm",
  "form_type": "10-Q",
  "item1_clean": null,
  "item7_clean": "There have been no changes to our critical accounting policies during the nine months ended September 30, 2025.\nItem 3. Quantitative and Qualitative Disclosures About Market Risk\nRequired information is within Part I — Financial Information—Item 2.—Management’s Discussion and Analysis of Financial Condition and Results of Operations—Market Risk.\nItem 4. Controls and Procedures\nEvaluation of Disclosure Controls and Procedures\nWe have established disclosure controls and procedures to ensure that material information relating to our company, including our consolidated subsidiaries, is made known to the officers who certify our financial reports and to other members of senior management and our board of directors.\nBased on their evaluation as of September 30, 2025, our Chief Executive Officer and Chief Financial Officer have concluded that our disclosure controls and procedures (as defined in Rules 13a-15(e) and 15d-15(e) under the Securities Exchange Act of 1934, as amended) are effective to ensure that (1) the information required to be disclosed by us in the reports that we file or submit under the Securities Exchange Act of 1934, as amended, is recorded, processed, summarized and reported within the time periods specified in SEC rules and forms, and (2) the information we are required to disclose in such reports is accumulated and communicated to management, including our Chief Executive Officer and Chief Financial Officer, as appropriate to allow timely decisions regarding required disclosure.\nOur management, including our Chief Executive Officer and Chief Financial Officer, does not expect that our disclosure controls and procedures or internal controls will prevent all possible errors and fraud. Our disclosure controls and procedures are, however, designed to provide reasonable assurance of achieving their objectives, and our Chief Executive Officer and Chief Financial Officer have concluded that our disclosure controls and procedures are effective at that reasonable assurance level.\nChanges in Internal Control Over Financial Reporting\nThere has been no change in our internal control over financial reporting during the period covered by this report that has materially affected, or is reasonably likely to materially affect, our internal control over financial reporting.\nPART II—OTHER INFORMATION\nItem 1. Legal Proceedings\nInformation regarding our legal proceedings can be found in Part I—Financial Information—Item 1. Financial Statements—Note 6 – Commitments and Contingent Liabilities.\nItem 1A. Risk Factors\nItem 2. Unregistered Sales of Equity Securities and Use of Proceeds\nPurchase of Equity Securities\nThe following table provides information regarding repurchases of our common stock during the three months ended September 30, 2025:\nTotal Number of Shares Purchased\nAverage Price Paid per Share\nTotal Number of Shares Purchased as Part of Publicly Announced Program\nMaximum Fair Value of Shares that May Yet Be Purchased Under the Program\nRepresents shares of common stock that employees surrendered as part of the default option to satisfy withholding taxes in connection with the vesting of restricted stock awards under our stock incentive plan. Pursuant to the terms of our stock plan, such shares revert to available shares under the plan.\nWe do not have a publicly announced program to purchase shares of our common stock. Accordingly, there were no shares purchased as part of a publicly announced program.\nItem 3. Defaults Upon Senior Securities\nItem 5. Other Information\ndirector or officer adopted or terminated any Rule 10b5-1 plan, or any other written trading arrangement that meets the requirements of a “\ntrading arrangement” during the three months ended September 30, 2025.\nIncorporated by Reference\nCertification of Chief Executive Officer.\nX\nCertification of Chief Financial Officer.\nX\nSection 1350 Certification of Chief Executive Officer.\nX\nSection 1350 Certification of Chief Financial Officer.\nX\n101.INS\nXBRL Instance Document - this instance document does not appear in the Interactive Data File because its XBRL tags are embedded within the Inline XBRL document.\nX\n101.SCH\nXBRL Taxonomy Schema Document.\nX\n101.CAL\nXBRL Taxonomy Calculation Linkbase Document.\nX\n101.DEF\nXBRL Taxonomy Definition Linkbase Document.\nX\n101.LAB\nXBRL Taxonomy Label Linkbase Document.\nX\n101.PRE\nXBRL Taxonomy Presentation Linkbase Document.\nX\nCover Page Interactive Data File (Formatted as Inline XBRL and contained in Exhibit 101)\nX\n§ Management contract or compensatory plan or arrangement.\nSIGNATURES\nPursuant to the requirements of the Securities Exchange Act of 1934, the registrant has duly caused this report to be signed on its behalf by the undersigned, thereunto duly authorized, on November 4, 2025.\n\nLIVE NATION ENTERTAINMENT, INC.\nSenior Vice President—Chief Accounting Officer\n(Duly Authorized Officer)",
  "item2_clean": "Item 2. Management’s Discussion and Analysis of Financial Condition and Results of Operations\n“Live Nation” (which may be referred to as the “Company,” “we,” “us” or “our”) means Live Nation Entertainment, Inc. and its subsidiaries, or one of our segments or subsidiaries, as the context requires. You should read the following discussion of our financial condition and results of operations together with the unaudited consolidated financial statements and notes to the financial statements included elsewhere in this quarterly report.\nSpecial Note About Forward-Looking Statements\nCertain statements contained in this quarterly report (or otherwise made by us or on our behalf from time to time in other reports, filings with the SEC, news releases, conferences, internet postings or otherwise) that are not statements of historical fact constitute “forward-looking statements” within the meaning of Section 27A of the Securities Act of 1933, as amended, and Section 21E of the Exchange Act of 1934, as amended, notwithstanding that such statements are not specifically identified. Forward-looking statements include, but are not limited to, statements about our financial position, business strategy, competitive position, potential growth opportunities, potential operating performance improvements, the effects of competition, the effects of future legislation or regulations and plans and objectives of our management for future operations. We have based our forward-looking statements on our beliefs and assumptions considering the information available to us at the time the statements are made. Use of the words “may,” “should,” “continue,” “plan,” “potential,” “anticipate,” “believe,” “estimate,” “expect,” “intend,” “outlook,” “could,” “target,” “project,” “seek,” “predict,” or variations of such words and similar expressions are intended to identify forward-looking statements but are not the exclusive means of identifying such statements.\nOur third quarter was another record for the Company with operating income up 24% and AOI up 14% versus 2024. With our largest quarter completed and the summer season wrapped, we are confident of hitting our 2025 goals. Nearly all of our large venue content for the year is booked and our event-related deferred revenue balance of $3.5 billion is up $1.0 billion or 37% compared to September 30, 2024, demonstrating continued consumer demand for live concert experiences.\nFor the third quarter of 2025, revenues increased by $848.1 million, or 11%, on a reported basis as compared to the same period in 2024, from $7.7 billion to $8.5 billion. The increase was $707.8 million, or 9%, on a constant currency basis. Revenue growth for the quarter was largely driven by our Concerts segment with more fans and record stadium activity across over 50 markets. Our operating income increased by 24% and AOI increased 14% versus 2024. Revenues, operating income and AOI rose in all three of our reporting segments in the quarter as a result of higher fan count, higher ticket sales and more brand partnerships.\nFor the first nine months of 2025, our consolidated revenue increased by $1.4 billion, or 8%, compared to the same period in 2024, from $17.5 billion to $18.9 billion. The increase was $1.3 billion, or 8%, on a constant currency basis. We had consolidated operating income of $1.4 billion for the first nine months of 2025, an increase of $0.3 billion compared to the first nine months of 2024 at a reported and constant currency basis. Consolidated AOI for the first nine months increased by $183.9 million, or 9%, compared to the same period in 2024, from $2.0 billion to $2.2 billion. The increase was the same on a constant currency basis.\nAll of the segment financial comments to follow are based on reported foreign currency exchange rates.\nOur Concerts segment revenue for the quarter increased by $701.9 million, or 11%, from $6.6 billion in the third quarter of 2024 to $7.3 billion in the third quarter of 2025. The revenue increase was largely the result of more stadium shows and fans this quarter. Similar to the second quarter, the majority of Concerts’ revenue growth came from international markets, led by Mexico and the United Kingdom. The total number of events for the third quarter of 2025 was approximately 12,300 compared to over 12,800 in the third quarter of 2024, a decrease of approximately 500 events or 4%. The number of fans for the quarter was 51.3 million compared to 50.1 million last year, an increase of 1.2 million or 2% driven by double-digit growth in stadium\ncontent. Some of the major acts touring in the third quarter of 2025 included Oasis, The Weeknd, Chris Brown and Blackpink. Our larger festivals in the quarter included Lollapalooza Chicago, Ocean’s Calling in Maryland, Rock Werchter in Belgium and Lowlands in the Netherlands. Meanwhile, Concerts AOI for the quarter was $514.2 million compared to $474.1 million in the third quarter of 2024, for growth of $40.1 million or 8%.\nFor the first nine months of 2025, Concerts revenue grew $1.3 billion compared to the same period in 2024, from $14.4 billion to $15.7 billion. For the first nine months of 2025, our Concerts fan count was 117.8 million compared to 111.9 million for the same period in 2024, an increase of 5.9 million fans or 5%. Fan growth has been driven by more activity in stadiums globally with nearly 30 million fans attending one of our stadium shows so far this year. Onsite spending at our United States amphitheater shows for the first nine months of 2025 versus 2024 grew by 8% per fan for the season, driven by higher food and beverage spending. For our larger festivals, we saw 6% growth in per fan spend, driven largely by higher food and beverage and VIP sales. Concerts AOI for the first nine months increased by $136.5 million, or 18%, compared to the same period in 2024, from $742.9 million to $879.4 million.\nOur Ticketing segment revenue for the quarter increased by $103.9 million, or 15%, from $693.7 million in the third quarter of 2024 to $797.6 million in the third quarter of 2025. We sold 89.1 million fee-bearing tickets, on a reported basis net of refunds, in the third quarter of 2025 compared to 85.8 million tickets in the same period of the prior year, an increase of 3.3 million tickets, or 4%. Two-thirds of the ticket sales growth occurred in North America with the remaining one-third came from our international markets. Fee-bearing GTV increased by 12% globally in the quarter with North America up double digits while international GTV increased by 5%. It was our second highest ever quarter for reported GTV and our fourth highest ever with respect to ticket volume. Ticketing AOI for the quarter was $285.9 million compared to $235.7 million last year, an increase of $50.2 million or 21%.\nFor the first nine months of 2025, our Ticketing segment’s revenue increased by $87.4 million compared to the same period in 2024, from $2.1 billion to $2.2 billion. Ticketing AOI for the first nine months of 2024 increased by $16.7 million compared to the same period in 2024, from $812.4 million to $829.1 million. For the first nine months of 2025, our fee-bearing ticket sales, on a reported basis net of refunds, were 249.9 million tickets, which was 5.1 million ahead of 2024. We have signed clients with 26.5 million of net new tickets so far this year, of which two-thirds are in our international markets, which demonstrates that our ticketing platforms’ features and functionalities continue to fuel growth.\nOur Sponsorship & Advertising segment’s revenue for the quarter increased by $52.3 million, or 13%, from $390.3 million in the third quarter of 2024 to $442.7 million in the third quarter of 2025. The growth was largely due to an increase in festival and venue sponsorship income for North America as well as festival and access growth for continental Europe. For the first nine months of 2025, our sponsorship growth has been driven by new and expanded ticket access deals in our international markets as well as from onsite sponsorships globally. AOI for the quarter increased by $37.7 million, from $275.3 million in the third quarter of 2024 to $313.1 million in the third quarter of 2025.\nFor the nine months of 2025, our Sponsorship & Advertising segment’s revenue grew $85.5 million, or 9%, compared to the same period in 2024, from $913.9 million to $999.3 million. Sponsorship & Advertising AOI for the first nine months increased by $48.7 million, or 8%, compared to the same period in 2024, from $627.9 million to $676.6 million. On a full year basis, we expect AOI and operating margins to be in line with historical norms. Our committed sponsorship sales are up over double-digits year-over-year and virtually all of our projected revenue for the year is accounted for, giving us confidence we will deliver double-digit growth for the year once again in our Sponsorship & Advertising segment.\nWe are optimistic about the long-term potential of our Company and are focused on the key elements of our business model: expanding our global platforms to connect artists and fans.\nConsolidated Results of Operations\nThree Months Ended September 30,\nAt Constant Currency**\nAt Constant Currency**\nDirect operating expenses\nSelling, general and administrative expenses\nDepreciation and amortization\nGain on disposal of operating assets\nEquity in losses of nonconsolidated affiliates\nOther expense (income), net\nIncome before income taxes\nNet income attributable to noncontrolling interests\nNet income attributable to common stockholders of Live Nation\nPercentages are not meaningful.\nConstant currency is a non-GAAP financial measure. We calculate currency impacts as the difference between current period activity translated using the current period’s currency exchange rates and the comparable prior period’s currency exchange rates. We present constant currency information to provide a framework for assessing how our underlying businesses performed excluding the effect"
}