{
  "source_file": "lyv-20241231.htm",
  "form_type": "10-K",
  "item1_clean": "Our Sponsorship & Advertising segment employs a sales force that creates and maintains relationships with sponsors through a combination of strategic, international, national and local opportunities that allow businesses to reach customers through our concert, festival, venue and ticketing assets, including advertising on our websites. We work with our corporate clients to help create marketing programs that support their business goals and connect their brands directly with fans and artists. We also develop, book and produce custom events or programs for our clients’ specific brands, which are typically presented exclusively to the clients’ consumers. These custom events can involve live music events with talent and media, using both online and traditional outlets. Including intersegment revenue, our Sponsorship & Advertising business generated $1.2 billion, or 5%, of our total revenue during 2024. We typically experience higher revenue in the second and third quarters as a large portion of sponsorships are usually associated with our outdoor venues and festivals, which are primarily used in or occur from May through October. We expect our seasonality trends to evolve as we continue to expand our global operations.\nWe believe that we have a unique opportunity to connect the music fan to corporate sponsors and therefore seek to optimize this relationship through strategic sponsorship programs. We continue to also pursue the sale of national and local sponsorships, both domestically and internationally, and placement of advertising, including signage, online advertising and promotional programs. Many of our venues have naming rights sponsorship programs. We believe national and international sponsorships allow us to maximize our network of venues and festivals and to arrange multi-venue or multi-festival branding opportunities for advertisers. Our local and venue-focused sponsorships include venue signage, promotional programs, onsite activation, hospitality and tickets, and are derived from a variety of client companies across various industry categories.\nLive Nation Venue Details\nIn the live entertainment industry, venue types generally consist of:\n—Stadiums are multi-purpose facilities, often housing local sports teams. Stadiums typically have 30,000 or more seats. Although they are the largest venues available for live music, they are not specifically designed for live music.\n—Amphitheaters are generally outdoor venues with between 5,000 and 30,000 seats that are used primarily in the summer season. We believe they are popular because they are designed specifically for concert events, with premium seat packages and better lines of sight and acoustics.\n—Arenas are indoor venues that are used as multi-purpose facilities, often housing local sports teams. Arenas typically have between 5,000 and 20,000 seats. Because they are indoors, they are able to offer amenities that other similar-sized outdoor venues cannot, such as luxury suites and premium club memberships. As a result, we believe they are popular for higher-priced concerts aimed at audiences willing to pay for these amenities.\n—Theaters are indoor venues that are built primarily for music events, but may include theatrical performances. These venues typically have a capacity of between 1,000 and 6,500. Theaters represent less risk to concert promoters because they have lower fixed costs associated with hosting a concert and may provide a more appropriately-sized venue for developing artists and more artists in general. Because these venues have a smaller capacity than an amphitheater or arena, they do not offer as much economic upside on a per show basis. Theaters can also be used year-round.\n—Clubs are indoor venues that are built primarily for music events, but may also include comedy clubs. These venues typically have a capacity of less than 1,000 and often without full fixed seating. Because of their small size, they do not offer as much economic upside, but they also represent less risk to a concert promoter because they have lower fixed costs associated with hosting a concert and also may provide a more appropriately-sized venue for developing artists. Clubs can also be used year-round.\nRestaurants & Music Halls\n—Restaurants & Music Halls are indoor venues that offer customers an integrated live music, entertainment and dining experience. This category includes our\nvenues whose live music halls are specially designed to provide optimum acoustics and typically can accommodate between 1,000 to 2,000 guests. A full-service restaurant and bar is located adjacent to the live music hall. We believe that the strength of the brand and the quality of the food, service and unique atmosphere in our restaurants attract customers to these venues independently from a live music event and generate a significant amount of repeat business from local customers.\n—Festival sites are outdoor locations used primarily in the summer season to stage large single-day or multi-day concert events featuring several artists on multiple stages. Depending on the location, festival site capacities can range from 10,000 to over 100,000 fans per day. We believe they are popular because of the value provided to the fan by packaging several artists together for an event. While festival sites only host a few events each year, they can provide higher operating income because we are able to generate income from many different services provided at the event.\n—Other venues includes restaurants and exhibition and convention halls that typically are not used for live music events.\nThe following table summarizes the number of venues by type that we owned, leased, operated, had exclusive booking rights for or had an equity interest over which we had a significant influence as of December 31, 2024:\nRestaurants & Music Halls\nTotal venues in operation\nVenues currently under construction\nVenues not currently in operation\nTotal venues in operation by location:\nOperated festival sites includes multi-year agreements providing us the right to use public or private land for a defined period of time leading up to and continuing after the festival. We may enter into multiple agreements for a single festival site or use the same site for multiple festivals. We have aggregated the agreements for each festival site and reported them as one festival site.\nCompetition in the live entertainment industry is intense. We believe that we compete primarily on the basis of our ability to deliver quality music events, sell tickets and provide enhanced fan and artist experiences. We believe that our primary strengths include:\nthe quality of service delivered to our artists, fans, ticketing clients and corporate sponsors;\nour track record and reputation in promoting and producing live music events and tours both domestically and internationally;\nour artist relationships;\nour global footprint;\nthe quality of our ticketing software and services;\nour ecommerce site and effective marketing capabilities;\nour diverse distribution platform of venues;\nthe scope, effectiveness and expertise of our advertising and sponsorship programs; and\nour financial stability.\nAlthough we believe that our products and services currently compete favorably with respect to such factors, we cannot provide any assurance that we can maintain our competitive position against current and potential competitors, especially those with significantly greater brand recognition, or greater financial, marketing, technical and other resources.\nIn the markets in which we promote music concerts, we face competition from other promoters and venue operators. We believe that barriers to entry into the promotion services business are low and that certain local promoters are increasingly expanding the geographic scope of their operations.\nSome of our competitors in the live music promotion industry are Anschutz Entertainment Group, or AEG, Another Planet Entertainment, CTS Eventim, Jam Productions, Ltd., I.M.P., Outback Presents and TEG Dainty in addition to numerous smaller regional companies and various casinos and venues in North America, Europe, Asia and Australia. AEG operates under a number of different names including AEG Presents, Concerts West, Frontier Touring, Goldenvoice and Messina Touring Group. Some of our competitors in the live music industry have a stronger presence in certain markets, have access to other sports and entertainment venues and may have greater financial resources in those markets, which may enable them to gain a greater competitive advantage in relation to us.\nIn markets where we own or operate a venue, we compete with other venues to serve artists likely to perform in that general region. Consequently, touring artists have various alternatives to our venues when scheduling tours. Our main competitors in venue management include ASM Global, Madison Square Garden Entertainment Corp., The Nederlander Organization and Bowery Presents, in addition to numerous smaller regional companies in North America, Europe, Australia and New Zealand. Some of our competitors in venue management may have more attractive or a greater number of venues in certain markets, and may have greater financial resources in those markets.\nThe ticketing services industry includes the sale of tickets primarily through online and mobile channels, but also through telephone and ticket outlets. The transition to online and mobile ticket purchases has made it easier for technology-based companies to offer primary ticketing services and standalone, automated ticketing systems that enable venues to perform their own ticketing services or utilize self-ticketing systems. In the online environment, we compete with other websites, online event sites and ticketing companies to provide event information, sell tickets and provide other online services such as fan clubs and artist websites.\nWe experience competition from other national, regional and local primary ticketing service providers to secure new venue clients and to reach fans for events. Resale, or secondary, ticketing services have created more aggressive buying of primary tickets whereby certain brokers are using automated internet “bot” technology to attempt to buy the best tickets when they go on sale, notwithstanding federal and state prohibitions. We actively develop and apply methods to mitigate the impact of these bots, however, the bot technology constantly evolves and changes. The internet allows fans and other ticket resellers to reach a vastly larger audience through the aggregation of inventory on resale websites and marketplaces, and provides consumers with more convenient access to tickets for a larger number and greater variety of events.\nWe also face significant and increasing competition from companies that sell self-ticketing systems, as well as from venues that choose to integrate self-ticketing systems into their existing operations or acquire primary ticketing service providers. Our competitors include primary ticketing companies such as Tickets.com, AXS, Paciolan, Inc., CTS Eventim AG, Eventbrite, eTix, SeatGeek, Ticketek, See Tickets and Dice; secondary ticketing companies such as StubHub, Vivid Seats, Viagogo and SeatGeek; and many others, including large technology and ecommerce companies that could enter these markets.\nOur main competitors at the local market level for sponsorships and advertising dollars include local sports teams, which often offer state-of-the-art venues, strong brand association and attractive local media packages, as well as festivals, theme parks and other local events. On the national level, our competitors include the major sports leagues that sell sponsorships combined with significant national media packages.\nGovernment Regulations\nWe are subject to federal, state and local laws, both domestically and internationally, governing matters such as:\nprivacy and the protection of personal or sensitive information;\ncompliance with",
  "item7_clean": "Constant currency is a non-GAAP financial measure. We calculate currency impacts as the difference between current period activity translated using the current period’s currency exchange rates and the comparable prior period’s currency exchange rates. We present constant currency information to provide a framework for assessing how our underlying businesses performed excluding the effect of foreign currency rate fluctuations.\nRevenue increased $429.3 million during the year ended December 31, 2024 as compared to the prior year driven by increased revenue in our Concerts segment of $283.4 million, Ticketing segment of $29.2 million and Sponsorship & Advertising segment of $99.8 million as further discussed within each segment’s operating results.\nOperating income decreased $260.4 million during the year ended December 31, 2024 as compared to the prior year primarily driven by decreased operating income in our Concerts segment of $313.2 million, which included Astroworld estimated loss contingencies of $454.9 million, and Ticketing segment of $20.7 million. These decreases in operating income were partially offset by increased operating income in our Sponsorship & Advertising segment of $99.2 million as further discussed within each segment’s operating results.\nInterest expense decreased $24.3 million during the year ended December 31, 2024 as compared to the prior year primarily driven by lower debt balance throughout 2024 as compared to 2023.\nInterest income decreased $81.6 million during the year ended December 31, 2024 as compared to the prior year primarily attributed to lower rate of return on our cash and cash equivalents in 2024 and a decrease in our cash and cash equivalents.\nOther expense (income), net\nFor the year ended December 31, 2024, we had $103.9 million of other income, net, which primarily includes mark to market adjustments for certain investments in nonconsolidated affiliates of $99.2 million. For the year ended December 31, 2023, we had $35.3 million of other expense, net, which includes net foreign exchange rate losses of $74.5 million partially offset by mark to market adjustments for certain investments in nonconsolidated affiliates of $46.5 million. The net foreign exchange rate gains and losses result primarily from revaluation of certain foreign currency denominated net assets held internationally.\nFor the year ended December 31, 2024, we had a net tax benefit of $391.7 million on income before income taxes of $739.4 million compared to a net tax expense of $209.5 million on income before income taxes of $913.3 million for 2023. In 2024, the net income tax benefit consisted of $518.3 million of tax benefit related to United States federal income taxes, $127.0 million of tax expense related to foreign entities and $0.4 million of tax benefit related to state and local income taxes. The net decrease in tax expense of $601.2 million is related to a valuation allowance release, due to changes in judgment regarding the realizability of certain deferred tax assets.\nNet income attributable to noncontrolling interests\nNet income attributable to noncontrolling interests increased $87.9 million during the year ended December 31, 2024 as compared to the prior year primarily due to higher operating results from certain concert businesses during 2024 as compared to the prior year.\nConsolidated AOI is a non-GAAP financial measure that we define as consolidated operating income (loss) before certain acquisition expenses (including ongoing legal costs stemming from the Ticketmaster merger, changes in the fair value of accrued acquisition-related contingent consideration obligations, and acquisition-related severance and compensation), amortization of non-recoupable ticketing contract advances, depreciation and amortization (including goodwill impairment), loss (gain) on disposal of operating assets, and stock-based compensation expense. We also exclude from AOI the impact of estimated or realized liabilities for settlements or damages arising out of the Astroworld matter that exceed our estimated insurance recovery, due to the significant and non-recurring nature of the matter. Ongoing legal costs associated with defense of these claims, such as attorney fees, are not excluded from AOI.\nWe use AOI to evaluate the performance of our operating segments. We believe that information about AOI assists investors by allowing them to evaluate changes in the operating results of our portfolio of businesses separate from non-operational factors that affect net income (loss), thus providing insights into both operations and the other factors that affect reported results. AOI is not calculated or presented in accordance with GAAP. A limitation of the use of AOI as a performance measure is that it does not reflect the periodic costs of certain amortizing assets used in generating revenue in our business. Accordingly, AOI should be considered in addition to, and not as a substitute for, operating income (loss), net income (loss), and other measures of financial performance reported in accordance with GAAP. Furthermore, this measure may vary among other companies; thus, AOI as presented herein may not be comparable to similarly titled measures of other companies.\nThe following table sets forth the reconciliation of consolidated operating income to consolidated AOI for the years ended December 31, 2024, 2023 and 2022:\nAcquisition expenses\nAmortization of non-recoupable ticketing contract advance\nDepreciation and amortization\nGain on sale of operating assets\nAstroworld estimated loss contingencies\nStock-based compensation expense\nFor the years ended December 31, 2023 and December 31, 2022, the revision increased our operating income and consolidated AOI by $18.7 million for 2023 and decreased our operating income and consolidated AOI by $10.1 million for 2022, respectively. See further discussion in Part II — Financial Information—Item 8.—Financial Statements and Supplementary Data—Note 2 – Correction of Errors in Previously Reported Consolidated Financial Statements.\nInformation regarding our use of AOI to evaluate the performance of our operating segments can be found in Part II —Financial Information —Item 8.—Financial Statements and Supplementary Data—Note 12 – Segments and Revenue Recognition.\nRevenue and related costs for events are generally deferred and recognized when the event occurs. All advertising costs incurred during the year for shows in future years are expensed at the end of the year. If a current year event is rescheduled into a future year, all advertising costs incurred to date are expensed in the period when the event is rescheduled.\nConcerts direct operating expenses include artist fees, event production costs, show-related marketing and advertising expenses, along with other costs.\nTo judge the health of our Concerts segment, we primarily monitor the number of confirmed events and fan attendance in our network of operated and third-party venues, talent fees, average paid attendance, market ticket pricing, advance ticket sales and the number of major artist clients under management. In addition, at our operated venues and festivals, we monitor ancillary revenue per fan and premium ticket sales. For business that is conducted in foreign markets, we also compare the operating results from our foreign operations to prior periods without the impact of changes in foreign exchange rates.\nRevenue related to ticketing service charges is recognized when the ticket is sold for our third-party clients. For our own events, where our concert promoters or venues control ticketing, revenue is deferred and recognized when the event occurs. GTV represents the total amount of the transaction related to a ticket sale and includes the face value of the ticket as well as the service charge. We use GTV to evaluate changes in ticket fee revenue that are driven by the pricing of our service charges.\nTicketing direct operating expenses include call center costs and credit card fees, along with other costs.\nTo judge the health of our Ticketing segment, we primarily review the GTV and the number of tickets sold through our primary and secondary ticketing operations, the number of clients renewed or added and the average royalty rate paid to clients who use our ticketing services. In addition, we review the number of visits to our websites, cost of customer acquisition, the purchase conversion rate, and the overall number of customers in our database. For business that is conducted in foreign markets, we also compare the operating results from our foreign operations to prior periods without the impact of changes in foreign exchange rates.\nSponsorship & Advertising\nRevenue related to sponsorship and advertising programs is recognized over the term of the agreement or operating season as the benefits are provided to the sponsor unless the revenue is associated with a specific event, in which case it is recognized when the event occurs.\nSponsorship & Advertising direct operating expenses include fulfillment costs related to our sponsorship programs, along with other costs.\nTo judge the health of our Sponsorship & Advertising segment, we primarily review the revenue generated through sponsorship arrangements and online advertising, and the percentage of expected revenue under contract. For business that is conducted in foreign markets, we also compare the operating results from our foreign operations to prior periods without the impact of changes in foreign exchange rates.\nKey Operating Metrics\n\nEstimated interest payments\nContingent and deferred consideration\nGuarantees of Third-Party Obligations\nAs of December 31, 2024 and 2023, we guaranteed the debt of third parties of approximately $19.4 million and $19.4 million, respectively, primarily related to maximum credit limits on employee and tour-related credit cards and obligations under a venue management agreement.\nInformation regarding the seasonality of our business can be found in Part II—Financial Information—Item 8.—Financial Statements and Supplementary Data—Note 1 – The Company and Summary of Significant Accounting Policies.\nWe are exposed to market risks arising from changes in market rates and prices, including movements in foreign currency exchange rates and interest rates.\nForeign Currency Risk\nWe have operations in countries throughout the world. The financial results of our foreign operations are measured in their local currencies. Our foreign subsidiaries also carry certain net assets or liabilities that are denominated in a currency other than that subsidiary’s functional currency. As a result, our financial results could be affected by factors such as changes in foreign currency exchange rates or weak economic conditions in the foreign markets in which we have operations. We operate in certain countries that are hyper-inflationary, for example Argentina, however the impact of these currencies did not have a material impact on our statement of operations for the year ended December 31, 2024. Our foreign operations reported an operating income of $744.4 million for the year ended December 31, 2024. We estimate that a 10% change in the value of the United States dollar relative to foreign currencies would change our operating income for the year ended December 31, 2024 by $74.4 million. As of December 31, 2024, our most significant foreign exchange exposure included the Euro, British Pound, Australian Dollar, Canadian Dollar and Mexican Peso. This analysis does not consider the implication such currency fluctuations could have on the overall economic conditions of the United States or other foreign countries in which we operate or on the results of operations of our foreign entities. In addition, the reported carrying value of our assets and liabilities, including the total cash and cash equivalents held by our foreign operations, will also be affected by changes in foreign currency exchange rates.\nWe primarily use forward currency contracts, in addition to options, to reduce our exposure to foreign currency risk associated with short-term artist fee commitments. At December 31, 2024, we had forward currency contracts outstanding with an aggregate notional amount of $283.1 million.\nOur market risk is also affected by changes in interest rates. We had $6.5 billion of total debt, excluding unamortized debt discounts and issuance costs, outstanding as of December 31, 2024. Of the total amount, we had $6.0 billion of fixed-rate debt and $457.6 million of floating-rate debt.\nBased on the amount of our floating-rate debt as of December 31, 2024, each 25-basis point increase or decrease in interest rates would increase or decrease our annual interest expense and cash outlay by approximately $1.1 million. This potential increase or decrease is based on the simplified assumption that the level of floating-rate debt remains constant with an immediate across-the-board increase or decrease as of December 31, 2024 with no subsequent change in rates for the remainder of the period.\nIn January 2020, we entered into an interest rate swap agreement that is designated as a cash flow hedge for accounting purposes to effectively convert a portion of our floating-rate debt to a fixed-rate basis. The swap agreement expires in October 2026, has a notional amount of $500 million and ensures that a portion of our floating-rate debt does not exceed 3.445%.\n\nITEM 7. MANAGEMENT’S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS\nYou should read the following discussion of our financial condition and results of operations together with the audited consolidated financial statements and notes to the consolidated financial statements included elsewhere in this Annual Report. This discussion contains forward-looking statements that involve risks and uncertainties. The forward-looking statements are not historical facts, but rather are based on current expectations, estimates, assumptions and projections about our industry, business and future financial results. Our actual results could differ materially from the results contemplated by these forward-looking statements due to a number of factors, including those discussed under Item 1A.—Risk Factors and other sections in this Annual Report.\nIn 2024, we saw demand for the live experience growing across the globe with emerging to superstar acts performing to packed houses across all genres and in venues big and small. After a record 2023 fueled by our highest volume of stadium shows ever, we surpassed last year’s revenue results. While operating income declined double-digits as a result of the Astroworld legal contingency, we grew our AOI by double-digits and our underlying businesses thrived in 2024. Our Concerts segment generated over $0.5 billion in AOI for the first time ever, growing by over 50%. We added over 5 million fans and nearly 5,000 additional shows in Concerts, with new venues added to our global footprint and plans to open more in the year ahead.\nOur overall revenue increased by $429 million, or 2%, to $23.2 billion as compared to last year. The increase in revenue was $664 million without the impact of changes in foreign exchange rates. Operating income for the year declined by $260 million or 24% primarily related to the Astroworld estimated loss contingencies of $455 million partially offset by stronger performance in our Concerts and Sponsorship segments. The decrease in operating income was $208 million without the impact of changes in foreign exchange rates. Consolidated AOI for the year increased by $265 million, or 14%, to $2.1 billion this year. The increase in AOI was $320 million without the impact of changes in foreign exchange rates.\nOur event-related deferred revenue balance increased by $336 million, or 11%, to $3.3 billion as of December 31, 2024 compared to December 31, 2023. This, coupled with current ticket sales for 2025, suggests ongoing strong demand for concerts, mak",
  "item2_clean": null
}