{
  "source_file": "ma-20250930.htm",
  "form_type": "10-Q",
  "item1_clean": null,
  "item7_clean": null,
  "item2_clean": "PART I\nITEM 2. MANAGEMENT'S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS\nThe following tables represents the reconciliation of our growth rates reported under GAAP to our non-GAAP growth rates:\nThree Months Ended September 30, 2025 as compared to the Three Months Ended September 30, 2024\nEffective income tax rate\nDiluted earnings per share\n(Gains) losses on equity investments\nLitigation provisions\nRestructuring charge\nAdjusted - Non-GAAP - currency-neutral\nNine Months Ended September 30, 2025 as compared to the Nine Months Ended September 30, 2024\nEffective income tax rate\nDiluted earnings per share\n(Gains) losses on equity investments\nLitigation provisions\nRestructuring charge\nAdjusted - Non-GAAP - currency-neutral\nNote: Tables may not sum due to rounding.\nKey Metrics and Drivers\nIn addition to the financial measures described above in “Financial Results Overview”, we review the following metrics to evaluate and identify trends in our business, measure our performance, prepare financial projections and make strategic decisions. We believe that the key metrics presented facilitate an understanding of our operating and financial performance and provide a meaningful comparison of our results between periods.\nmeasures how much profit we make on each dollar of sales after our operating costs but before other income (expense) and income tax expense. Operating margin is calculated by dividing our operating income by net revenue.\nGross Dollar Volume (“GDV”)\nmeasures dollar volume of activity, including both domestic and cross-border volume, on cards carrying our brands during the period, on a local currency basis and U.S. dollar-converted basis. GDV represents purchase volume plus cash volume; “purchase volume” means the aggregate dollar amount of purchases made with Mastercard-branded cards for the relevant period; and “cash volume” means the aggregate dollar amount of cash disbursements and includes the impact of balance transfers and convenience checks obtained with Mastercard-branded cards for the relevant period. Information denominated in U.S. dollars relating to GDV is calculated by applying an established U.S. dollar/local currency exchange rate for each local currency in which our volumes are reported. These exchange rates are calculated on a quarterly basis using the average exchange rate for each quarter. We report period-over-period rates of change in purchase volume and cash volume on the basis of local currency information, in order to eliminate the impact of changes in the value of currencies against the U.S. dollar in calculating such rates of change. Data used in the calculation of GDV is provided by our customers and is subject to verification by Mastercard and partial cross-checking against information provided by Mastercard’s transaction switching systems. All data is subject to revision and amendment by Mastercard or our customers.\nCross-border Volume Growth\nmeasures the growth of cross-border dollar volume during the period, on a local currency basis and U.S. dollar-converted basis, for all Mastercard-branded programs.\nSwitched Transactions\nmeasures the number of transactions switched by Mastercard, which is defined as the number of transactions initiated and switched through our network during the period.\n\nPART I\nITEM 2. MANAGEMENT'S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS\nKey highlights for the three and nine months ended September 30, 2025, versus the comparable periods in 2024:\nThree Months Ended September 30, 2025\nGAAP\nBoth the as-reported and currency-neutral net revenue increases were attributable to growth in our payment network and value-added services and solutions.\nNine Months Ended September 30, 2025\nGAAP\nBoth the as-reported and currency-neutral net revenue increases were attributable to growth in our payment network and value-added services and solutions.\nThree Months Ended September 30, 2025\nGAAP\nThe as-reported operating expenses increase was primarily due to higher general and administrative expenses (which included a restructuring charge in the third quarter of 2024), partially offset by lower litigation provisions. The as-adjusted operating expenses increase was primarily due to higher general and administrative expenses.\nNine Months Ended September 30, 2025\nGAAP\nThe as-reported operating expenses increase was primarily due to higher general and administrative expenses (which included a restructuring charge in the third quarter of 2024), partially offset by lower litigation provisions. The as-adjusted operating expenses increase was primarily due to higher general and administrative expenses.\nThree Months Ended September 30, 2025\nBoth the as-reported and as-adjusted effective income tax rates were higher versus the comparable period in 2024, primarily due to the 15% global minimum tax (Pillar 2 Rules) that took effect in 2025 and a change in our geographic mix of earnings.\nGAAP\nNine Months Ended September 30, 2025\nBoth the as-reported and as-adjusted effective income tax rates were higher versus the comparable period in 2024, primarily due to the Pillar 2 Rules that took effect in 2025 and a change in our geographic mix of earnings.\nGAAP\nOther financial highlights for the nine months ended September 30, 2025 were as follows:\nWe generated net cash flows from operations of $12.6 billion.\nshares of our common stock for $8.2 billion and paid dividends of $2.1 billion.\nWe completed a debt offering in February 2025 for an aggregate principal amount of $1.25 billion.\n\nPART I\nITEM 2. MANAGEMENT'S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS\nThe following tables provide a summary of the growth trends in our key drivers:\nThree Months Ended September 30,\nNine Months Ended September 30,\nUSD\nUSD\nUSD\nUSD\nMastercard-branded GDV growth\nWorldwide less United States\nCross-border volume growth\nThree Months Ended September 30,\nNine Months Ended September 30,\nSwitched transactions growth\nExcludes volume generated by Maestro and Cirrus cards.\nKey Metrics related to the Payment Network\nAssessments represent agreed-upon standard pricing provided to our customers based on various forms of payment-related activity. Assessments are used internally by management to monitor operating performance as it allows for comparability and provides visibility into cardholder trends. Assessments do not represent our net revenue.\nThe following provides additional information on our key metrics related to the payment network:\nDomestic assessments\nare charges based on activity related to cards that carry the Company’s brands where the merchant country and the country of issuance are the same. These assessments are primarily driven by the domestic dollar volume of activity (e.g., domestic purchase volume, domestic cash volume) or the number of cards issued.\nCross-border assessments\nare charges based on activity related to cards that carry the Company’s brands where the merchant country and the country of issuance are different. These assessments are primarily driven by the cross-border dollar volume of activity (e.g., cross-border purchase volume, cross-border cash volume).\nTransaction processing assessments\nare charges primarily driven by the number of switched transactions on our payment network. Switching activities include:\nAuthorization, the process by which a transaction is routed to the issuer for approval\nClearing, the determination and exchange of financial transaction information between issuers and acquirers after a transaction has been successfully conducted at the point of interaction\nSettlement, which facilitates the determination and exchange of funds between parties\nThese assessments can also include connectivity services and network access, which are based on the volume of data transmitted and the number of authorization and settlement messages.\nOther network assessments\nare charges for licensing, implementation and other franchise fees.\nThe following table provides a summary of our key metrics related to the payment network:\nThree Months Ended September 30,\nNine Months Ended September 30,\nDomestic assessments\nCross-border assessments\nTransaction processing assessments\nOther network assessments\n\nPART I\nITEM 2. MANAGEMENT'S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS\nNet revenue from our payment network increased 12%, or 10% on a currency-neutral basis, versus the comparable period in 2024. The increase was primarily driven by growth in domestic and cross-border dollar volumes and an increase in the number of switched transactions, reflecting growth trends across all of our key drivers. Net revenue from our payment network included $5,389 million of rebates and incentives provided to customers, which increased 16%, or 15% on a currency-neutral basis, versus the comparable period in 2024, primarily due to an increase in our key drivers as well as new and renewed deals.\nNet revenue from our value-added services and solutions increased 25%, or 22% on a currency-neutral basis, versus the comparable period in 2024, which included a 3 percentage point increase from Acquisitions. The remaining increase was driven primarily by (1) growth in our underlying key drivers, (2) our security and digital and authentication solutions, consumer acquisition and engagement services, and business and market insights and (3) pricing.\nFor the nine months ended September 30, 2025:\nNet revenue increased 16%, on both an as-reported and currency-neutral basis, versus the comparable period in 2024, which included a 1 percentage point increase from Acquisitions. The remaining increase in net revenue was attributable to organic growth in both our payment network and value-added services and solutions.\nNet revenue from our payment network increased 13%, on both an as-reported and currency-neutral basis, versus the comparable period in 2024. The increase was primarily driven by growth in domestic and cross-border dolla"
}