{
  "source_file": "maa-20241231.htm",
  "form_type": "10-K",
  "item1_clean": null,
  "item7_clean": "For the year ended December 31, 2024, net income available for MAA common shareholders was $523.9 million as compared to $549.1 million for the year ended December 31, 2023. Results for the year ended December 31, 2024 included $55.0 million of gain related to the sale of depreciable real estate assets, $11.2 million of gain on the consolidation of a third-party development, $9.3 million in net casualty gain and $6.1 million of non-cash gain, net of tax, from investments, partially offset by $18.8 million of non-cash loss related to the fair value adjustment of the embedded derivative in the MAA Series I preferred shares and $9.4 million of legal costs and settlements. Results for the year ended December 31, 2023 included $18.5 million of non-cash gain related to the fair value adjustment of the embedded derivative in the MAA Series I preferred shares and $3.5 million of non-cash gain, net of tax, from investments. Revenues for the year ended December 31, 2024 increased 2.0% as compared to the year ended December 31, 2023, driven by a 44.7% increase in our Non-Same Store and Other segment. Property operating expenses, excluding depreciation and amortization, for the year ended December 31, 2024 increased by 6.8% as compared to the year ended December 31, 2023, driven by a 3.9% increase in our Same Store segment and 71.8% increase in our Non-Same Store and Other segment. The primary drivers of these changes are discussed in the “Results of Operations” section.\n\nOur net debt to Adjusted EBITDA\nratio as of December 31, 2024 was 4.0x, as compared to a ratio of 3.6x as of December 31, 2023. The change in the ratio was primarily due to a decrease of $14.6 million in Adjusted EBITDA\nfor the year ended December 31, 2024 as compared to the year ended December 31, 2023 and an increase of $439.0 million in comparing net debt as of December 31, 2024 to net debt as of December 31, 2023. The decrease in Adjusted EBITDA\nwas primarily due to an increase in property operating expenses and property management expenses partially offset by an increase in property revenues, while the increase in net debt was primarily due to an increase in unsecured notes payable, partially offset by an increase in cash and cash equivalents. The increase in unsecured notes payable was primarily driven by an increase in cash requirements to fund acquisition and development activities.\n\nThe increase in cash outflows for purchases of real estate and other assets was primarily driven by the number of the real estate assets acquired during the year ended December 31, 2024 as compared to the year ended December 31, 2023. During the year ended December 31, 2024, we acquired three apartment communities and closed on the pre-purchase of a multifamily development community. During the year ended December 31, 2023, we acquired two apartment communities. The decrease in cash outflows for capital improvements and other was primarily driven by decreased capital spend relating to our property redevelopment and repositioning activities during the year ended December 31, 2024 as compared to the year ended December 31, 2023. The increase in cash outflows for development costs was primarily driven by increased development activity, including financing a third-party’s development of a 239-unit multifamily apartment community currently under construction located in Charlotte, North Carolina, during the year ended December 31, 2024 as compared to the year ended December 31, 2023. The decrease in cash outflows for contributions to affiliates was driven by a lesser amount of investments made in the technology-focused limited partnerships during the year ended December 31, 2024 as compared to the year ended December 31, 2023. The increase in cash inflows from proceeds from real estate asset dispositions resulted from the disposition of two multifamily communities during the year ended December 31, 2024 as compared to the disposition of one land parcel during the year ended December 31, 2023. The increase in cash inflows from proceeds from sale of marketable equity securities resulted from the sale of marketable equity securities during the year ended December 31, 2024 as compared to no marketable securities being sold during the year ended December 31, 2023. The increase in cash inflows from net proceeds from insurance recoveries was driven by increased insurance reimbursements received for property and storm-related casualty claims during the year ended December 31, 2024 as compared to the year ended December 31, 2023.\n\nThe increase in cash outflows related to the net change in commercial paper resulted from the decrease in net borrowings of $245.0 million under our commercial paper program during the year ended December 31, 2024 as compared to the increase in net borrowings of $475.0 million under our commercial paper program during the year ended December 31, 2023. The increase in cash inflows from proceeds from notes payable resulted from the issuance of $1.1 billion of unsecured senior notes during the year ended December 31, 2024 as compared to no issuance of unsecured senior notes during the year ended December 31, 2023. The increase in cash outflows from principal payments on notes payable primarily resulted from the retirement of $400.0 million of unsecured senior notes during the year ended December 31, 2024 as compared to the retirement of $350.0 million of unsecured senior notes during the year ended December 31, 2023. The increase in cash outflows related to payment of deferred financing costs resulted from the closing costs of $10.3 million related to the issuance of $1.1 billion of unsecured senior notes during the year ended December 31, 2024 as compared to negligible deferred financing costs during the year ended December 31, 2023. The increase in cash outflows from dividends paid on common shares primarily resulted from the increase in the dividend rate to $5.880 per share during the year ended December 31, 2024 as compared to the dividend rate of $5.600 per share during the year ended December 31, 2023. The decrease in cash inflows related to the proceeds from issuances of common shares resulted from the proceeds from the settlement of two forward sale agreements with respect to a total of 1.1 million shares at a forward price per share of $185.23 during the year ended December 31, 2023. The decrease in cash outflows from the acquisition of noncontrolling interests resulted from the acquisition of a 5% noncontrolling interest of a consolidated real estate entity for $15.8 million during the year ended December 31, 2023. The increase in cash inflows from the net change in other financing activities was primarily driven by fewer shares of MAA’s common stock surrendered by employees to satisfy their statutory minimum federal and state tax obligations associated with the vesting of restricted shares, and more contributions received from noncontrolling interest during the year ended December 31, 2024 as compared to year ended December 31, 2023.\n\nCore FFO attributable to common shareholders and unitholders for the year ended December 31, 2024 was $1.1 billion, a decrease of $33.1 million as compared to the year ended December 31, 2023, primarily as a result of increases in property operating expenses, excluding depreciation and amortization, of $52.0 million, interest expense of $19.3 million and property management expenses of $4.3 million, partially offset by an increase in property revenues of $42.5 million.\n\nProperty management expenses for the year ended December 31, 2024 were $72.0 million, an increase of $4.3 million as compared to the year ended December 31, 2023. General and administrative expenses for the year ended December 31, 2024 were $56.5 million, a decrease of $2.1 million as compared to the year ended December 31, 2023.\n\nis comprised of EBITDA\nfurther adjusted for items that are not considered part of our core operations such as adjustments related to the fair value of the embedded derivative in the MAA Series I preferred shares; gain or loss on sale of non-depreciable assets; gain or loss on investments; casualty related charges (recoveries), net; gain or loss on debt extinguishment; and legal costs, settlements and (recoveries), net. As an owner and operator of real estate, management considers Adjusted EBITDA\nto be an important measure of performance from core operations because Adjusted EBITDA\nexcludes various income and expense items that are not indicative of operating performance. Our computation of Adjusted EBITDA\nmay differ from the methodology utilized by other REITs to calculate Adjusted EBITDA\nshould not be considered as an alternative to net income, or any other GAAP measurement, as an indicator of operating performance or as an alternative to cash flow from operating, investing and financing activities as a measure of liquidity.\n\nA critical accounting estimate is one that is both important to our financial condition and results of operations and that involves some degree of uncertainty. The preceding discussion and analysis of our financial condition and results of operations are based upon our consolidated financial statements and the notes thereto, which have been prepared in accordance with GAAP. The preparation of financial statements in conformity with GAAP requires management to make a number of estimates and assumptions that affect the reported amounts and disclosures in the consolidated financial statements. On an ongoing basis, we evaluate our estimates and assumptions based upon historical experience and various other factors and circumstances. We believe that our estimates and assumptions are reasonable under the circumstances; however, actual results may differ from these estimates and assumptions.\n\nThe increase in property operating expenses for our Same Store segment for the year ended December 31, 2024 as compared to the year ended December 31, 2023 was primarily driven by increases in personnel expense of $7.6 million, real estate tax expense of $5.3 million, utilities expense of $4.6 million, office operations expense of $4.6 million, insurance expense of $2.4 million, and marketing expense of $2.3 million. The increase in property operating expenses from the Non-Same Store and Other segment for the year ended December 31, 2024 as compared to the year ended December 31, 2023 was primarily the result of increased expenses from completed development communities and recently acquired communities.\n\nThe decrease in operating cash flows was primarily driven by an increase in property operating expenses.\n\nWe account for long-lived assets in accordance with the provisions of accounting standards for the impairment or disposal of long-lived assets. Management periodically evaluates long-lived assets, including investments in real estate, for indicators that would suggest that the carrying amount of the assets may not be recoverable. The judgments regarding the existence of such indicators are based on factors such as operating performance, market conditions and legal factors. Long-lived assets, such as real estate assets, equipment, right-of-use lease assets and purchased intangibles subject to amortization, are grouped with other assets and liabilities at the lowest level for which identifiable cash flows are largely independent of the cash flows of other assets and liabilities, or an asset group. Management generally considers the individual assets of an apartment community to collectively represent an asset group. Recoverability of assets to be held and used is measured by a comparison of the carrying amount of an asset to estimated future undiscounted cash flows expected to be generated by the asset. If the carrying amount of an asset exceeds its estimated future cash flows, an impairment charge is recognized for the amount by which the carrying amount of the asset exceeds the fair value of the asset. Management calculates the fair value of an asset by dividing estimated future annual cash flow by a market capitalization rate. No material impairment losses were recognized during the years ended December 31, 2024 and 2023.\n\nThe redemption feature embedded in the MAA Series I preferred stock is reported as a derivative asset and is adjusted to its fair value at each reporting date, with a corresponding non-cash adjustment to the statement of operations. The derivative asset related to the redemption feature is valued using widely accepted valuation techniques, including a discounted cash flow analysis in which the perpetual value of the preferred shares is compared to the value of the preferred shares assuming the call option is exercised, with the value of the bifurcated call option as the difference between the two values. The analysis reflects the contractual terms of the redeemable preferred shares, which are redeemable at our option beginning on October 1, 2026 and at the redemption price of $50 per share. We may use various significant inputs in the analysis, including risk adjusted yields of relevant MAALP bond issuances and yields and spreads of relevant indices, estimated yields on preferred stock instruments from REITs with similar credit ratings as us, treasury rates and trading data available of prices of the preferred shares, to determine the fair value of the bifurcated call option. As a result of the adjustments recorded to reflect the change in fair value of the derivative asset, the fair value of the embedded derivative asset decreased to $13.2 million as of December 31, 2024 as compared to $31.9 million as of December 31, 2023, a decrease in value of the asset of $18.7 million.\n\nOur impairment assessments may contain uncertainties because they require management to make assumptions and to apply judgment to estimate future undiscounted cash flows and the fair value of the assets. Key assumptions used in estimating future cash flows and the fair value of an asset include projecting an apartment community’s NOI, estimating asset hold periods and recurring capital expenditures, as well as selecting an appropriate market capitalization rate. Management considers its apartment communities’ historical stabilized NOI performance, local market economics and the business environment impacting our apartment communities as the basis in projecting forecasted NOI, which management believes is representative of future cash flows. Management estimates the market capitalization rate by analyzing the market capitalization rates for sold properties with comparable ages in similarly sized markets. These estimates are subjective and our ability to realize future cash flows and asset fair values is affected by factors such as ongoing maintenance and improvement of the assets, changes in economic conditions and changes in operating performance.\n\nOur resident leases at our apartment communities allow for adjustments in the rental rate at the time of renewal, which may enable us to seek rent increases. The majority of our leases are for one year or less. The short-term nature of these leases generally serves to reduce our risk to adverse effects of inflation on our revenue. During the year ended December 31, 2024, we experienced inflationary pressures that drove higher operating expenses, primarily in personnel, real estate taxes, utilities, office operations, insurance and marketing expenses.\n\nDepreciation and amortization expense for the year ended December 31, 2024 was $585.6 million, an increase of $20.6 million as compared to the year ended December 31, 2023. The increase was primarily driven by the recognition of depreciation expense associated with our completed development communities and capital spend activities made in the normal course of business during the year ended December 31, 2024, partially offset from decreased depreciation expense from disposed communities during the year ended December 31, 2023.\n\nWe account for our acquisitions of investments in real estate as asset acquisitions in acc",
  "item2_clean": null
}