{
  "source_file": "mar-20241231.htm",
  "form_type": "10-K",
  "item1_clean": "four to seven percent of room revenues, plus for certain brands, up to four percent of food and beverage revenues, as well as reimbursement for centralized programs and services, such as our Loyalty Program, reservations, and marketing. Such agreements are generally for periods of 10 to 20 years.\nWe also have license and other agreements with third parties for certain offerings, such as for our timeshare properties, MGM Collection with Marriott Bonvoy, Design Hotels, and The Ritz-Carlton Yacht Collection\npursuant to which we receive royalty and certain other fees. For our timeshare properties, we receive royalty fees under license agreements with Marriott Vacations Worldwide Corporation and its affiliates (collectively, “MVW”) for certain brands. The royalty fees we receive from MVW consist of a fixed annual fee, adjusted for inflation, plus certain variable fees based on sales volumes. Certain licensees are also charged for certain systems and centralized programs and services, such as our Loyalty Program, reservations, and marketing.\nAt year-end 2024, we had 7,192 franchised, licensed, and other properties (1,104,446 rooms and timeshare units).\nWe use or license certain of our trademarks for the sale of residential real estate, often in conjunction with hotel development. We receive one-time branding fees upon the sale of each branded residential unit by the third-party developers who construct and sell the residences, with limited amounts, if any, of our capital at risk. We often also manage the related homeowners’ association and receive continuing management fees for that service. At year-end 2024, we had 137 branded residential properties (15,684 residential units).\nIntellectual Property\nWe operate in a highly competitive industry and our brand names, trademarks, service marks, trade names, and logos are very important to our business, including the development, sales and marketing of our lodging offerings and services. We believe that our brand names and other intellectual property have come to represent outstanding quality, care, service, and value to our customers, guests, and the traveling public. Accordingly, we register and protect our intellectual property where we deem appropriate and otherwise protect against its unauthorized use.\nLoyalty and Credit Card Programs\nis central to our business strategy. It encompasses our portfolio of over 30 brands and other travel offerings, our direct channels, and our award-winning travel loyalty program, which we refer to throughout this report as our “Loyalty Program.” Loyalty Program members can earn points for stays at participating properties and other travel offerings, such as Homes & Villas by Marriott Bonvoy, a global offering focusing on the premium and luxury tiers of rental homes, as well as through purchases with co-branded credit cards and our Loyalty Program partners. Members can redeem points for stays at participating properties, airline tickets, airline frequent flyer program miles, rental cars, products from Marriott Bonvoy Boutiques\n, and a variety of other awards, including experiences from Marriott Bonvoy Moments\n\nWe believe that our Loyalty Program generates substantial repeat business that might otherwise go to competing properties. In 2024, 72 percent of our U.S. hotel room nights and 65 percent of our global hotel room nights were booked by Loyalty Program members. We strategically market to this large and growing guest base to generate revenue.\nWe have co-branded credit cards associated with Marriott Bonvoy in 11 countries. In the U.S., we have multi-year agreements with JPMorgan Chase and American Express. We also license credit card programs internationally, including in Japan, China, Canada, the United Arab Emirates, and other markets. We generally earn fixed amounts that are payable at contract inception and variable amounts that are paid to us monthly over the term of the agreements primarily based on card usage. We believe that our co-branded credit cards create a diverse revenue stream for the Company, reflect the quality and value of our portfolio of brands, and contribute to the strength of our Loyalty Program by creating value for our customers, hotel owners, and other parties with whom we have an affiliation. Payments received under our co-branded credit card agreements represent a significant funding source for the Loyalty Program.\nSee the “Loyalty Program” caption in Note 2 for more information about our Loyalty Program and co-branded credit cards.\nSales and Marketing and Reservation Systems\nMarriott.com, the Marriott Bonvoy mobile app, and our other direct digital channels offer seamless digital experiences. We deliver customer-minded enhancements, including powerful in-stay capabilities through our mobile app, such as contactless check-in and check-out, Mobile Key, chat, service requests, mobile dining, and more. In addition, we are focused on strengthening Marriott Bonvoy by attracting more Loyalty Program members and localizing our experiences to reach new customers around the world. Our focus on creating frictionless experiences throughout our direct digital channels is foundational to our worldwide technology systems transformation. This multi-year transformation of our reservations, property management, and loyalty systems is focused on introducing new technology that delivers more choices for customers, new capabilities for associates, and new revenue opportunities for hotels in our system.\nOur above-property sales deployment and revenue management strategies are designed around the way the customer wants to buy and the strategic priorities of hotels in our system. Our above-property sales strategy focuses on offering global business-to-business solutions, driving efficiencies, optimizing revenue, and enhancing customer loyalty while minimizing duplication of efforts at the hotel level. We also utilize innovative and sophisticated revenue management systems, many of which are proprietary, which are designed to facilitate pricing decisions, increase efficiency, and optimize property-level revenue. Most of the hotels in our portfolio utilize web-based programs to effectively manage the rate set-up and modification processes, which provides for greater pricing flexibility and increased efficiency.\nOur marketing strategies focus on building awareness, increasing demand, promoting Marriott Bonvoy, and increasing customer loyalty. We do this through a variety of brand and marketing programs, offerings, and tools.\nWe compete for guests in many areas, including brand recognition and reputation, location, guest satisfaction, room rates, quality of service, amenities, quality of accommodations, safety and security, and the ability to earn and redeem loyalty program points. We encounter strong competition in the short-term lodging market from regional, national, and international chains that operate lodging properties or franchise their brands, lodging properties that are not affiliated with a chain, and online platforms, including Airbnb and Vrbo, that allow travelers to book short-term rentals of homes and apartments as an alternative to hotel rooms. Although we believe that our strong brand recognition assists us in attracting and retaining guests and hotel owners, we compete against many other companies with strong brands and guest appeal, including Hilton, IHG Hotels & Resorts, Hyatt, Wyndham Hotels & Resorts, Accor, Choice Hotels, Best Western Hotels & Resorts, and others. Our direct digital channels also compete for guests with online travel services platforms, such as Expedia.com, Priceline.com, Booking.com, Travelocity.com, Orbitz.com, and Trip.com, and search engines such as Google, Bing, Yahoo, and Baidu.\nWe believe that the location and quality of our lodging offerings, our Loyalty Program, our marketing programs, our reservation systems, and our emphasis on guest service and guest and associate satisfaction contribute to guest preference across all our brands.\nAffiliation with a brand is common in the U.S. lodging industry. In 2024, approximately 73 percent of U.S. hotel rooms were brand-affiliated. Although lodging properties outside the U.S. also often affiliate with a brand, such brand affiliation is\n\nInvesting in Associates\nWe are focused on providing our associates with the tools, resources, and support they need to thrive – both personally and professionally. We provide our eligible U.S. associates and their families with access to comprehensive compensation and benefits offerings, such as health care coverage, work/life support benefits, and other offerings, including retirement savings and employee stock purchase plans. Outside the U.S., we offer comprehensive compensation and benefit programs that vary based on the geographic market and we regularly evaluate these programs for competitiveness against the external talent market. Our TakeCare program provides associates with tools and resources to support their physical, mental, and financial well-being.\nIn addition, pay equity is foundational to our compensation structures and practices. Globally, pay equity best practices guide our determination of starting pay for our associates, including our policy of prohibiting compensation history inquiries. In the U.S., we conduct pay equity audits at least annually and make adjustments as needed.\nProviding Access to Opportunity\nOur focus on access to opportunity encompasses a range of initiatives and programs to support our goal to make all stakeholders (including associates, guests, hotel owners, and suppliers) feel welcome and valued. The Inclusion and Social Impact Committee of our Board of Directors (“Board”), established over 20 years ago, assists the Board in providing oversight of the Company’s strategy related to our people-first culture, associate well-being and inclusion, and corporate social responsibility and environmental matters.\nSustainability and Social Impact\nWe are focused on creating a positive and sustainable impact wherever we do business. Our sustainability and social impact platform, Serve 360: Doing Good in Every Direction, is built around four focus areas: Nurture Our World; Sustain Responsible Operations; Empower Through Opportunity; and Welcome All and Advance Human Rights. Our efforts are centered around (1) making the communities and environments where we operate better places to live, work, and visit, (2) embedding sustainability across our operations, (3) providing access to workplace readiness and opportunity for all to grow and succeed, and (4) encouraging cultural understanding and connecting people through the power of travel.\nOur sustainability strategy and initiatives focus on a wide range of issues, including designing resource-efficient hotels, implementing technologies to track and reduce energy and water consumption, as well as waste and food waste, increasing the use of renewable energy, managing water-related risks, focusing on third-party sustainability certifications at the hotel-level, supporting ecosystem restoration initiatives, and focusing on responsible and local sourcing.\nWe have set near-term and long-term science-based emissions reduction targets, which were verified by the Science Based Targets initiative in 2024.\nIn response to humanitarian crises and natural disasters, hotels in our system often look to support their local communities in need by donating funds, hotel stays, food, supplies, and volunteer hours. We also deploy our Company relief funds to support affected associates and their families and charitable organizations providing relief in impacted areas. We also continue to focus on our efforts to advance human rights, including by continuing to train associates in human trafficking awareness and donating our training program to the broader lodging industry.\nGovernment Regulations\nAs a company with global operations, we are subject to a wide variety of laws, regulations, and government policies around the worl",
  "item7_clean": "Over the long term, our centralized programs and services are not designed to impact our economics, either positively or negatively. See Note 2 for more information about the accounting for cost reimbursements, including our Loyalty Program.\nThe decrease in cost reimbursements, net primarily reflected lower revenues, net of expenses, for many of our programs and services, and Loyalty Program activity, which incurred higher program expenses.\nOther Operating Expenses\nChange 2024 vs. 2023\nDepreciation, amortization, and other\nGeneral, administrative, and other\nRestructuring and merger-related charges\nGeneral, administrative, and other expenses increased primarily due to higher compensation costs ($53 million) and higher guarantee reserves ($22 million).\nRestructuring and merger-related charges increased primarily due to $37 million of restructuring charges for employee termination benefits discussed in Note 16 and a $30 million reserve for a loan commitment related to the Company’s acquisition of Starwood, partially offset by $35 million of lower charges related to the Data Security Incident discussed in Note 7.\nNon-Operating Income (Expense)\nChange 2024 vs. 2023\nGains and other income, net\nGains and other income, net decreased primarily due to a gain recorded in the prior year on the sale of a hotel in the CALA region ($24 million).\nInterest expense increased primarily due to higher debt balances driven by Senior Notes issuances, net of maturities ($125 million).\n\n“Business Trends” section above for further discussion.\nChange 2024 vs. 2023\nSegment net fee revenues\nEMEA\nSegment net fee revenues\nSegment net fee revenues\nAPEC\nSegment net fee revenues\nvs. December 31, 2023\nvs. December 31, 2023\nEMEA\nAPEC\nIn 2024, net fee revenues grew in U.S. & Canada, EMEA, and APEC compared to 2023, primarily driven by higher RevPAR and unit growth (see the Lodging Statistics and Properties and Rooms tables above for more information), as well as higher profits at managed hotels. In Greater China, net fee revenues decreased in 2024 primarily due to lower RevPAR.\nU.S. & Canada segment profit decreased in 2024 compared to 2023 despite the higher net fee revenues due to $138 million of lower cost reimbursement revenue, net of reimbursed expenses, $59 million of lower owned, leased, and other revenue, net of direct expenses, and $28 million of higher general, administrative, and other expenses. Owned, leased, and other revenue, net of direct expenses decreased primarily due to higher termination fees in the prior year, largely related to one development project. General, administrative, and other expenses increased primarily due to higher guarantee reserves.\nEMEA segment profit increased in 2024 compared to 2023 due to higher net fee revenues and $30 million of lower general, administrative, and other expenses, primarily due to lower litigation accruals, partially offset by $26 million of lower cost reimbursement revenue, net of reimbursed expenses.\nLIQUIDITY AND CAPITAL RESOURCES\nWe are party to a $4.5 billion multicurrency revolving credit agreement (as amended, the “Credit Facility”). Available borrowings under the Credit Facility support our commercial paper program and general corporate needs. U.S. dollar borrowings under the Credit Facility bear interest at SOFR (the Secured Overnight Financing Rate) plus a spread based on our\n\n0.4 to 1.0 at both year-end 2024 and year-end 2023. We have significant borrowing capacity under our Credit Facility should we need additional working capital.\nInvesting Activities Cash Flows\nCapital Expenditures and Other Investments.\nWe made capital and technology expenditures of $750 million in 2024 and $452 million in 2023. Capital and technology expenditures in 2024 increased by $298 million compared to 2023, primarily due to approximately $200 million of spending related to the Sheraton Grand Chicago capitalized assets (discussed in Note 3) and higher than typical spending on our worldwide technology systems transformation, the overwhelming portion of which is expected to be reimbursed over time. In 2023, we also had cash outflows of $101 million due to the City Express brand acquisition.\nWe expect capital expenditures and other investments will total approximately $1.0 billion to $1.1 billion for 2025, including capital and technology expenditures, loan advances, contract acquisition costs, and other investing activities, but excluding any potential property or brand acquisitions, which we cannot forecast with sufficient accuracy and which may be significant. Our anticipated capital and technology expenditures include higher than typical spending on our worldwide technology systems transformation and renovations of hotels in our owned and leased portfolio.\nProperty and asset sales generated $16 million of cash proceeds in 2024 and $71 million in 2023.\nOver time, we have sold lodging properties, both completed and under development, generally subject to long-term management agreements. Our ability to attract third-party purchasers, and their ability to raise the debt and equity capital necessary to acquire such properties, depends in part on the perceived risks in the lodging industry and other constraints inherent in the capital markets. We monitor the status of the capital markets and regularly evaluate the potential impact of changes in capital market conditions on our business operations. We have made, and expect to continue making, selective and opportunistic investments to add units to our lodging business, which may include property acquisitions and renovations, new construction, loans, guarantees, and equity investments. Over time, we seek to minimize capital invested in our business through asset sales subject to long-term management or franchise agreements.\n\nYear-to-date through February 7, 2025, we repurchased 1.2 million shares for $350 million. For additional information, see “Market for Registrant’s Common Equity, Related Stockholder Matters, and Issuer Purchases of Equity Securities” in Part II, Item 5.\nOur Board declared the following quarterly cash dividends in 2024: (1) $0.52 per share declared on February 8, 2024 and paid on March 29, 2024 to stockholders of record on February 22, 2024; (2) $0.63 per share declared on May 10, 2024 and paid on June 28, 2024 to stockholders of record on May 24, 2024; (3) $0.63 per share declared on August 2, 2024 and paid on September 30, 2024 to stockholders of record on August 16, 2024; and (4) $0.63 per share declared on November 7, 2024 and paid on December 31, 2024 to stockholders of record on November 21, 2024.\nWe expect to continue to return cash to stockholders through a combination of share repurchases and cash dividends.\nMaterial Cash Requirements\nOur material cash requirements include the following contractual obligations and off-balance sheet arrangements.\nAt year-end 2024, we had $14,447 million of debt plus $3,110 million of future interest payments, of which a total of $1,866 million is payable within the next 12 months from year-end 2024. See Note 9 for further information about our long-term debt and Note 8 for further information about our finance leases.\nWe enter into operating leases primarily for hotels, offices, and equipment, which are discussed in Note 8.\nAt December 31, 2024, projected Deemed Repatriation Transition Tax payments under the 2017 Tax Cuts and Jobs Act totaled $135 million, which is payable within the next 12 months from year-end 2024.\nThe Company had guarantees and letters of credit as of year-end 2024, which are discussed in Note 7. The majority of our remaining guarantee commitments are not expected to be funded within the next 12 months from year-end 2024.\nIn the normal course of business, we enter into purchase commitments related to the programs and services that we typically provide to hotel owners, and we incur other obligations to manage the daily operating needs of the hotels that we manage. Since our contracts with hotel owners generally require reimbursement for expenses incurred in providing these programs and services and managing the daily operating needs of the hotels that we manage, these obligations are not expected to have a material impact on our net income and cash flow over the long term.\nNEW ACCOUNTING STANDARDS\nWe do not expect that accounting standards updates issued to date and that are effective after December 31, 2024 will have a material effect on our Financial Statements.\nCRITICAL ACCOUNTING POLICIES AND ESTIMATES\nOur preparation of financial statements in accordance with GAAP requires management to make estimates and assumptions that affect reported amounts and related disclosures. Management considers an accounting policy and estimate to be critical if: (1) we must make assumptions that were uncertain when the estimate was made; and (2) changes in the estimate, or selection of a different estimate methodology could have a material effect on our consolidated results of operations or financial condition.\n\nWhile we believe that our estimates, assumptions, and judgments are reasonable, they are based on information available when the estimate or assumption was made. Actual results may differ significantly. Additionally, changes in our assumptions, estimates or assessments due to unforeseen events or otherwise could have a material impact on our financial position or results of operations.\nSee Note 2 for further information related to our critical accounting policies and estimates, which are as follows:\n, including how we estimate the breakage of hotel points, credit card points, and free night certificates, the volume of points and free night certificates that will be issued under our co-branded credit card agreements, the amount of consideration to which we will be entitled under our co-branded credit card agreements, and the stand-alone selling prices of goods and services provided under our co-branded credit card agreements. Changes in these estimates could result in material changes to our liability for guest loyalty program and Loyalty Program revenue. Based on the conditions existing at December 31, 2024 and holding other factors constant, a one percent decrease in our estimate of the breakage of points could result in an increase in the liability for guest loyalty program of approximately\n\nOwned, Leased, and Other\nChange 2024 vs. 2023\nOwned, leased, and other revenue\nOwned, leased, and other - direct expenses\nOwned, leased, and other, net\nOwned, leased, and other revenue, net of direct expenses, decreased primarily due to $65 million of higher termination fees recorded in the prior year, largely related to one development project in U.S. & Canada.\nChange 2024 vs. 2023\nCost reimbursement revenue\nCost reimbursements, net\nCost reimbursements, net (cost reimbursement revenue, net of reimbursed expenses) varies due to timing differences between the costs we incur for centralized programs and services and the related rei\nts we receive from hotel owners and certain other counterparties.\n\nof food and beverage revenues. We also have license and other agreements with third parties for certain offerings, such as for our timeshare properties, MGM Collection with Marriott Bonvoy, Design Hotels, and The Ritz-Carlton Yacht Collection, under which we receive royalty fees and certain other fees. Additionally, we earn fees for other uses of our intellectual property, including primarily co-branded credit card fees, as well as residential branding fees and certain other licensing fees.\nPerformance Measures\nWe believe Revenue per Available Room (“RevPAR”), which we calculate by dividing property level room revenue by total rooms available for the period, is a meaningful indicator of our performance because it measures the period-over-period change in room revenues. RevPAR may not be comparable to similarly titled measures, such as revenues, and should not be viewed as necessarily correlating with our fee revenue. We also believe occupancy and average daily rate (“ADR”), which are components of calculating RevPAR, are meaningful indicators of our performance. Occupancy, which we calculate by dividing total rooms sold by total rooms available for the period, measures the utilization of a property’s available capacity. ADR, which we calculate by dividing property level room revenue by total rooms sold, measures average room price and is useful in assessing pricing levels. RevPAR, occupancy, and ADR statistics are on a systemwide basis for comparable properties, unless otherwise stated. Unless otherwise stated, all changes refer to year-over-year changes for the comparable period. Comparisons to prior periods are on a constant U.S. dollar basis, which we calculate by applying exchange rates for the current period to the prior comparable period. We believe constant dollar analysis provides valuable information regarding the performance of hotels in our system as it removes currency fluctuations from the presentation of such results.\nWe define our comparable properties as hotels in our system that were open and operating under one of our brands since the beginning of the last full calendar year (since January 1, 2023 for the current period) and have not, in either the current or previous year: (1) undergone significant room or public space renovations or expansions, (2) been converted between company-operated and franchised, or (3) sustained substantial property damage or business interruption. Our comparable properties also exclude MGM Collection with Marriott Bonvoy, Design Hotels, The Ritz-Carlton Yacht Collection, and timeshare properties. For 2024, we had 5,439 comparable U.S. & Canada properties and 1,741 comparable International properties.\nWe saw solid global RevPAR growth during 2024 compared to 2023. In 2024, worldwide RevPAR increased 4.3 percent compared to 2023, reflecting ADR growth of 2.8 percent and occupancy improvement of 1.0 percentage point. The increase in RevPAR was driven by strong year-over-year demand growth in nearly all our regions.\nIn the U.S. & Canada, where demand has normalized, RevPAR increased 3.0 percent in 2024, led by strong demand from group as well as strong demand from transient customer segments across our brand tiers.\nIn EMEA, RevPAR growth of 9.1 percent in 2024 was driven by strong demand in most countries across the region, aided by the 2024 Paris Olympics and other special events. In APEC, RevPAR increased 12.9 percent in 2024, driven by strong demand, including an increase in inbound demand into the region. In CALA, RevPAR increased 8.8 percent in 2024, driven by strong demand throughout the region. In Greater China, RevPAR declined 2.3 percent in 2024 due to lower domestic demand as a result of macro-economic conditions and an increase in outbound travel.\nIn 2024, we launched a comprehensive initiative to enhance our effectiveness and efficiency across the Company. At this point in the process, we expect this initiative to yield $80 million to $90 million of annual general and administrative cost reductions beginning in 2025. These efforts are also anticipated to deliver cost savings to our hotel owners.\nAs part of these efforts, in the second half of 2024, we implemented a voluntary retirement program for certain above-property associates, and some above-property roles in the organization were eliminated or redefined. We substantially completed this initiative as of year-end 2024.\nStarwood Data Security Incident\nOn November 30, 2018, we announced a data security incident involving\nunauthorized access to the Starwood\nreservations database (the “Data Security Incident”). We are currently unable to reasonably estimate the range of total possible financial impact to the Company from the Data Security Incident in excess of the expenses already recorded; however, we do not believe this incident will impact our long-term financial health. See Note 7 for additional information related to legal proceedings and governmental investigations related ",
  "item2_clean": null
}