{
  "source_file": "mchp-20250331.htm",
  "form_type": "10-K",
  "item1_clean": "We develop, manufacture and sell smart, connected and secure embedded control solutions used by our customers for a wide variety of applications. Our strategic focus includes general purpose and specialized 8-bit, 16-bit, and 32-bit mixed-signal microcontroller, microprocessors, analog, FPGA, and memory products. In July 2024, we entered the 64-bit mixed-signal microprocessor market furthering our expansion beyond 32-bit architecture. With over 35 years of technology leadership, our broad product portfolio offers a Total System Solution (TSS) for our customers that can provide a large portion of the silicon requirements in their applications. TSS is a combination of hardware, software and services which help our customers increase their revenue, reduce their costs and manage their risks compared to other solutions. Our synergistic product portfolio empowers disruptive growth trends, including AI/ML, data centers, edge computing and Internet of Things (IoT), E-mobility, networking and connectivity, and sustainability in key end markets such as automotive, aerospace and defense, communications, consumer appliances, data centers and computing, and industrial.\n\nOur direct sales force focuses on a wide variety of strategic accounts in three geographical markets: the Americas, Europe and Asia. We currently maintain sales and technical support centers in major metropolitan areas in all three geographic markets. We believe that a strong technical service presence is essential to the continued development of the embedded control market. Many of our CEMs, ESEs, and sales managers have technical degrees or backgrounds and have been previously employed in high technology environments. We believe that the technical and business knowledge of our sales force is a key competitive advantage in the sale of our products. The primary mission of our ESE team is to provide technical assistance to customers and to conduct periodic training sessions for the balance of our sales team. ESEs also frequently conduct technical seminars and workshops in major cities around the world or through online webcasts.\n\nOur other product line includes FPGA products, royalties associated with licenses for the use of our SuperFlash and other technologies, sales of our intellectual property, fees for engineering services, memory products, timing systems, manufacturing services (wafer foundry and assembly and test subcontracting), legacy application specific integrated circuits, and products for aerospace applications.\nOur portfolio of non-volatile FPGAs are recognized for their low power, high security and extended reliability. We market and sell our FPGA products and related solutions into a broad range of applications within the industrial, automotive, defense, aviation, space and communications markets.\nOur technology licensing business generates license fees and royalties associated with technology licenses for the use of our SuperFlash® embedded flash and other technologies. We also generate fees for engineering services related to these technologies. We license our Non-Volatile Memory technologies to foundries, integrated device manufacturers and design partners throughout the world for use in the manufacture of their advanced mixed-signal microcontroller products, gate array, RF, analog and neuromorphic compute products that require embedded non-volatile memory.\nOur memory products consist of EEPROMs, Serial Flash memories, Parallel Flash memories, Serial SRAM memories and EERAMs. Serial EEPROMs, Serial Flash memories, Serial SRAMs and EERAMs have a very low I/O pin requirement, permitting production of very small footprint devices. We sell our memory products primarily into the embedded control market, complementing our mixed-signal microcontroller offerings.\n\nThe semiconductor industry is intensely competitive and has historically been characterized by price erosion and rapid technological change. We compete with major domestic and international semiconductor companies, some of which have greater market recognition and greater financial, technical, marketing, distribution and other resources than we have with which to pursue engineering, manufacturing, marketing and distribution of their products. We also compete with a number of companies that we believe have copied, cloned, pirated or reverse engineered our proprietary product lines in such countries as China and Taiwan. We are continuing to take actions to vigorously and aggressively defend and protect our intellectual property on a worldwide basis.\nWe currently compete principally on the basis of the technical innovation and performance of our embedded control products, including the following product characteristics:\nanalog, digital and mixed-signal functionality and level of functional integration\nfield programmability\nlow power consumption\nextended voltage ranges\nsecurity and functional safety\npackaging alternatives\ncomprehensive suite of development tools\nWe believe that other important competitive factors in the embedded control market include:\nour broad product portfolio offers a Total System Solutions through a combination of hardware, software and services\nfunctionality of application development systems\nhardware, software and tool compatibility within product families to increase migration flexibility\ndependable delivery, quality and availability\ntechnical and innovative service and support\nWe believe that we compete favorably with other companies on all of these factors, but if we are unable to compete successfully in the future, our business could be harmed.\nPatents, Licenses and Trademarks\n\nHuman Capital Resources\nWe invest in our highly-skilled global workforce of approximately 19,400 people in accordance with our Guiding Value: employees are our greatest strength. We believe that our culture, values, and organizational development and training programs provide a work environment where our employees are empowered and engaged to deliver the best embedded control solutions to our customers.\nCulture and Core Values\nBefore Microchip went public in 1993, Microchip created a cultural framework to unite its employees through shared workplace values, and to guide employees’ strategies, decisions, actions and job performance. Our culture is centered on a values-based, highly-empowered, continuous-improvement oriented approach. This corporate culture strengthens our business, and enables us to fulfill our purpose. Our focus on communication aims to provide transparency among leadership, to promote trust among employees, and is a critical part of Microchip’s culture.\nOur culture is important to our employees, and is a key reason why we have a significant number of employees with long tenure with Microchip that have grown from individual contributors in the early stages of their careers into senior leadership positions today. This long tenure among our employee-base results in deep relationships and trust being built among colleagues, retention of our knowledge base, and continuation of our culture. More information on our Guiding Values can be found at www.microchip.com/en-us/about/investors/investor-information/mission-statement.\nWe promote employee adoption of our culture through a number of methods including training, mentorship, values-based performance reviews, company-wide quarterly meetings, town hall meetings with the President and Chief Executive Officer and other executive team members, and an open-door policy of communication where employees are encouraged to interact directly with management. To assess and improve employee engagement, we conduct our annual employee engagement survey, which is administered in a manner that allows employees to respond confidentially. The survey solicits feedback on a variety of factors, including engagement, culture, leadership, continuous improvement, collaboration, work environment, and ethics.\nTraining and Development\nMicrochip’s culture focuses on continuous improvement. We provide training on our culture, management skills, communication, technical skills, and personal improvement. Microchip also has a leadership program that provides for the growth and development of its future leaders. This program helps us develop leaders that serve as role models of Microchip culture, and support empowerment and open communication.\nTo support employee development, we provide opportunities to learn on-the-job through training courses, targeted development programs, mentoring and peer coaching, and ongoing feedback. We have a library of live and on-demand learning experiences. We create learning paths focused on our most common development needs and regularly upgrade our offerings to help ensure that our employees are exposed to current content. We offer tuition reimbursement programs to subsidize educational programs and advanced certifications.\nCompensation Programs\nWe strive to provide competitive pay and benefits, that help meet the varying needs of our employees and encourage employees to be shareholders in Microchip through our various equity incentive plans. Our total compensation package includes base pay, broad-based stock grants and bonuses, healthcare and retirement plans, employee stock purchase plans, paid time off and family leave. Benefit programs include 401(k) programs in the U.S., and statutory pension programs outside the U.S. Microchip has multiple equity programs in place including restricted stock unit awards and employee stock purchase plans that align employee interests with those of our shareholders.\nInformation About our Executive Officers\nThe following sets forth certain information regarding our executive officers as of April 30, 2025:\nExecutive Chair of the Board, Chief Executive Officer and President\nChief Operating Officer\nSenior Vice President and Chief Financial Officer\nSenior Vice President, Operations\nJoseph R. Krawczyk II\nSenior Vice President, Worldwide Client Engagement\nwas appointed as Executive Chair of the Board, Chief Executive Officer and President in November 2024. He previously served as Chief Executive Officer from October 1991 to March 2021, as Chair of the Board from October 1993 to March 2021 and August 2024 to November 2024, and as Executive Chair of the Board from March 2021 to August 2024, and from November 2024 to present. He served as President from August 1990 to February 2016 and has served as a director since August 1990. Mr. Sanghi holds an M.S. degree in Electrical and Computer Engineering from the University of Massachusetts and a B.S. degree in Electronics and Communication from Punjab University. Mr. Sanghi served on the Board of Directors of Myomo, Inc., a publicly traded commercial stage medical robotics company that offers expanded mobility for those suffering from neurological disorders and upper-limb paralysis, from November 2016 through October 2019. Mr. Sanghi served on the board of Mellanox Technologies Ltd., a publicly traded supplier of end-to-end Ethernet and InfiniBand intelligent interconnect solutions and services for servers, storage, and hyper-converged infrastructure, from February 2018 through April 2020. Mr. Sanghi was elected to the Board of Directors of Impinj, Inc. in March 2021 and assumed the role of Board Chair in June 2022. Mr. Sanghi was elected to the Board of Directors of Intel Corporation in December 2024.\nwas promoted to Chief Operating Officer on April 1, 2024 and served as Executive Vice President Analog Power and Interface Business Unit from April 2023 to April 2024; as Senior Vice President, Analog Power and Interface Business Units from February 2019 to April 2023; and as Vice President, Analog Power and Interface Business Units from September 1999 to February 2019. From October 1995 to September 1999, he served as Vice President in various roles. Since joining Microchip in 1990, Mr. Simoncic held various roles in Design, Device/Yield Engineering and Quality Systems. Mr. Simoncic holds a B.S. degree in Electrical Eng",
  "item7_clean": "Item 7. Management's Discussion and Analysis of Financial Condition and Results of Operations\nNote Regarding Forward-looking Statements\nThis report, including \"Item 1. Business,\" \"Item 1A. Risk Factors,\" and \"Item 7. Management's Discussion and Analysis of Financial Condition and Results of Operations,\" contains certain forward-looking statements that involve risks and uncertainties, including statements regarding our strategy, financial performance and revenue sources. We use words such as \"anticipate,\" \"believe,\" \"can,\" \"continue,\" \"could,\" \"expect,\" \"future,\" \"intend,\" \"plan,\" and similar expressions to identify forward-looking statements. Our actual results could differ materially from the results anticipated in these forward-looking statements as a result of certain factors including those set forth under \"Risk Factors,\" beginning at page\nOur expectation that we will experience period-to-period fluctuations in operating results, gross margins, product mix and average gross profit per unit;\nThe effects that uncertain global economic conditions and fluctuations in the global credit and equity markets may have on our financial condition and results of operations;\nThe effects and amount of competitive pricing pressure on our product lines and modest pricing declines in certain of our more mature proprietary product lines;\nOur ability to moderate future average selling price declines;\nThe amount of, and changes in, demand for our products and those of our customers;\nThe impact of national security protections, trade restrictions and changes in tariffs, including those impacting China;\nOur intent to vigorously defend our legal positions and our expectations of the impact of litigation on our operations;\nThe future impact on our business in response to public health concerns;\nOur goal to continue to be more efficient with our selling, general and administrative expenses;\nOur belief that customers recognize our products and brand name and our use of distributors as an effective supply channel;\nOur belief that familiarity with and adoption of development tools from us and from our third-party development tool partners will be an important factor in the future selection of our embedded control products;\nThe accuracy of our estimates of the useful life and values of our property, assets and other liabilities;\nThe possibility of future pricing fluctuations in our analog product line;\nThe impact of any supply disruption we may experience;\nOur ability to effectively utilize our facilities at appropriate capacity levels;\nOur ability to maintain manufacturing yields;\nThe maintenance of our competitive position based on our investments in new and enhanced products;\nThe cost effectiveness of using our own assembly and test operations;\nOur plans to continue to transition certain outsourced assembly and test capacity to our internal facilities;\nOur expectations regarding investments in equipment and facilities and the timeline of expansions of our manufacturing capacity;\nThe continued development of the embedded control market based on our strong technical service presence;\nOur anticipated level of capital expenditures;\nThe possibility that loss of, or disruption in the operations of, one or more of our distributors could reduce our future net sales and/or increase our inventory returns;\nOur intent, including length, timing, planned closure days, to reduce production levels at global fabrication facilities, or closure of facilities completely and its impact on inventory levels and estimated cash savings;\nOur expectations regarding LTSAs and the realization of deferred revenue;\nThe continuation and amount of quarterly cash dividends;\nThe sufficiency of our existing sources of liquidity to finance anticipated capital expenditures and otherwise meet our anticipated cash requirements, and the effects that our contractual obligations are expected to have on them;\nOur belief that the capital expenditures to be incurred over the next 12 months will provide sufficient manufacturing capacity to support the growth of our production capabilities for our new products and technologies and to bring in-house more of the production requirements that are currently outsourced;\nOur belief that our IT system compromise will not have a material adverse effect on our business or result in any material damage to us;\nOur expectation that we will continue to be the target of cyber-attacks, computer viruses, unauthorized access and other attempts to breach or otherwise compromise the security of our IT systems and data;\nOur plans to modify and enhance our cybersecurity risk management processes and strategy;\nThe impact of the resolution of legal actions on our business, and the accuracy of our assessment of the probability of loss and range of potential loss;\nThe amounts and timing, and our plans and expectations relating to the U.S. Statutory Notice of Deficiencies and proposed income adjustment from the Malaysian Inland Revenue Board;\nOur expectation regarding the treatment of our unrecognized tax benefits in the next 12 months;\nOur belief that the expiration of any tax holidays will not have a material impact on our effective tax rate;\nOur expectations regarding our tax expense, cash taxes and effective tax rate;\nOur expectation that the global minimum tax (GMT) will not have a material impact on our fiscal 2026 results;\nOur belief that the estimates used in preparing our consolidated financial statements are reasonable;\nOur actions to vigorously and aggressively defend and protect our intellectual property on a worldwide basis;\nOur ability to obtain and maintain patents and intellectual property licenses and minimize the effects of litigation or other disputes or the loss of patent protection;\nThe level of risk we are exposed to for product liability claims or indemnification claims;\nThe effect of fluctuations in market interest rates on our income and/or cash flows;\nThe effect of fluctuations in currency rates;\nThe impact of inflation on our business;\nOur ability to increase our borrowings or seek additional equity or debt financing to maintain or expand our facilities, or to fund cash dividends, share repurchases, acquisitions or other corporate activities, and that the timing and amount of such financing requirements will depend on a number of factors;\nOur expected debt obligation maturities, including the conversion of debt, Depositary Shares, and Series A Preferred Stock, and plans to refinance our existing debt;\nOur expectations regarding the amounts and timing of repurchases under our stock repurchase program;\nOur expectation that our reliance on third-party contractors may increase over time as our business grows;\nOur ability to collect accounts receivable;\nThe impact of the legislative and policy changes implemented or which may be implemented by the current administration on our business and the trading price of our stock;\nOur belief that our culture, values, and organizational development and training programs will continue to provide a work environment where our employees are empowered and engaged to deliver the best embedded control solutions;\nOur belief that our continued success is driven by the skills, knowledge, and innovative capabilities of our personnel, a strong technical service presence, and our ability to rapidly commercialize new and enhanced products;\nThe potential impact of changes in regulations or in their enforcement, including with respect to the capital expenditures or other costs or expenses;\nThe impact of any failure by use to adequately control the storage, use, discharge and disposal of regulated substances;\nEstimates and plans regarding pension liability and payments expected to be made for benefits earned;\nOur expectations regarding the amount, timing, and future applications for investment tax credits under the CHIPS Act;\nOur expectations regarding past or potential future acquisitions, joint development agreements or other strategic relationships and any related benefits; and\nThe impact on our business stemming from Russia’s invasion of Ukraine.\nBusiness and Macroeconomic Environment\nDuring fiscal 2024, many of our customers felt the adverse effects of slowing economic activity, increasing business uncertainty, persistent inflation and higher interest rates and we received requests to push out or cancel backlog resulting from customer actions to reduce inventory levels. Although we began to see evidence of improvements in our business in the March 2024 quarter which have continued in fiscal 2025, such as a decrease in customer requests to push out or cancel backlog while the number of expedites and shipment pull in requests grew, the overall macroeconomic environment remained weak throughout fiscal 2025 as we navigated through a large inventory correction. With our inventory levels being high and having ample capacity in place, on December 2, 2024, we announced our decision to close our Tempe, Arizona wafer fabrication facility that we refer to as Fab 2. Many of the process technologies that run in Fab 2 also run in our Oregon and Colorado factories, which both have ample clean room space for expansion. The closure of Fab 2 was completed in May 2025 and we expect that it will generate annual cash savings of approximately $90 million. Due to the high levels of inventory of the products which are manufactured in Fab 2, we do not expect to see income statement savings from the closure until the start of the June 2026 quarter based on a first-in first-out basis. We expect that the Fab 2 closure will begin to help us moderate our inventory levels. On March 3, 2025, we announced additional restructuring actions to reduce costs, resize manufacturing operations and to reduce headcount at our Fab 4 and Fab 5 facilities and our backend manufacturing facility in the Philippines which will result in approximately $25 million in annual savings from the temporarily reduced compensation costs. These actions resulted in a reduction of inventory in the March 2025 quarter. We also announced a 10% headcount reduction across our company to decrease our operating expenses, which reduction will be fully implemented by the June 2025 quarter. We expect this action to reduce our ongoing operating expenses by approximately $90 million to $100 million on an annualized basis. Consistent with the macroeconomic environment, most of our factory expansion activity remains paused, we have reduced our planned capital investments, and we remain focused on reducing our inventory levels and days of inventory through fiscal 2026.\nThere continues to be uncertainty regarding overall macroeconomic conditions, including increased geopolitical tensions, risk of a recession, and the effects of potential trade policies, including tariffs. Long established global trade relationships are potentially changing in fundamental ways that make it difficult to predict how global supply chains and economic environments will be affected. For example, in March and April 2025, the U.S. imposed tariffs on imports from China and other countries and foreign governments imposed additional tariffs on imports from the U.S. It is unclear what tariffs will apply to semiconductors during this time of change.\nWhile we continue to evaluate the potential impacts of these proposed tariffs and our ability to mitigate their related impacts, these tariffs and any retaliatory tariffs imposed may adversely impact our revenue and cost of goods sold in the U.S. and internationally. The imposition of tariffs could impact our supply chain for rare earth and other materials and cause a decrease in the sales of products to customers located in China, other customers selling to Chinese end users, or other global customers, which could materially and adversely affect our business, financial condition and results of operations. The ultimate impact of any tariffs will depend on various factors, including whether semiconductors continue to be exempt from tariffs and any changes to the amount, scope and nature of the tariffs imposed by the U.S. or other countries. For additional information, see “Item 1A. Risk Factors”, including the risk factor titled “\nWe may lose sales if suppliers of raw materials, components or equipment fail to meet our or our customers' needs, increase prices, are impacted by increases in tariffs, or such raw materials, components or equipment become restricted or unavailable.\"\nCritical Accounting Policies and Estimates\n\nWe operate assembly and test facilities in Thailand, the Philippines, and other locations throughout the world. During fiscal 2025, approximately 67% of our assembly requirements were performed in our internal assembly facilities, compared to approximately 59% during fiscal 2024. During fiscal 2025, approximately 67% of our test requirements were performed in our internal facilities, compared to approximately 71% during fiscal 2024. The percentage of our assembly and test operations that are performed internally fluctuates over time based on supply and demand conditions in the semiconductor industry, our internal capacity capabilities and our acquisition activities. We believe that the assembly and test operations performed at our internal facilities provide us with significant cost savings compared to third-party contractor assembly and test costs, as well as increased control over these portions of the manufacturing process. We plan to continue to selectively invest in assembly and test equipment to increase our internal capacity capabilities and transition certain outsourced assembly and test capacity to our internal facilities.\nWe rely on outside wafer foundries for a significant portion of our wafer fabrication requirements. Approximately 64% of our net sales came from products that were produced at outside wafer foundries in each of fiscal 2025 and fiscal 2024. This percentage may vary based on supply and demand conditions in the market.\nWe anticipate that our gross margins will fluctuate over time, driven primarily by capacity utilization levels, the overall mix of products sold during the period, as well as manufacturing yields, unabsorbed capacity charges, and competitive and economic conditions in the markets we serve. We continue to transition products to more advanced process technologies to reduce future manufacturing costs.\nResearch and Development\nR&D expenses for fiscal 2025 were $983.8 million, or 22.4% of net sales, compared to $1.10 billion, or 14.4% of net sales, for fiscal 2024. We are committed to investing in new and enhanced products, including development systems software, and in our design and manufacturing process technologies. We believe these investments are significant factors in maintaining our competitive position. R&D costs are expensed as incurred. Assets purchased to support our ongoing research and development activities are capitalized when related to products which have achieved technological feasibility or that have alternative future uses and are amortized over their expected useful lives. R&D expenses include labor, depreciation, masks, prototype wafers, and expenses for the development of process technologies, new packages, and software to support new products and design environments.\nR&D expenses decreased $113.6 million, or 10.4%, for fiscal 2025 compared to fiscal 2024. The primary reasons for the decrease in R&D expenses in fiscal 2025 compared to fiscal 2024 was lower employee compensation costs.\n\nR&D expenses fluctuate over time, primarily due to revenue and operating expense investment levels.\nSelling, General and Administrative\nSelling, general and administrative expenses for fiscal 2025 were $617.7 million, or 14.0% of net sales, compared to $734.2 million, or 9.6% of net sales, for fiscal 2024. Our goal is to continue to be more efficient with our selling, general and administrative expenses. Selling, general and administrative expenses include salary expenses related to field sales,",
  "item2_clean": null
}