{
  "source_file": "mck-20250331.htm",
  "form_type": "10-K",
  "item1_clean": "INDEX TO BUSINESS\nPrescription Technology Solutions\nMedical-Surgical Solutions\nInvestments, Restructuring, Business Combinations, and Divestitures\nPatents, Trademarks, Copyrights, and Licenses\nGovernment Regulation\nOther Information about the Business\nForward-Looking Statements\nMcKesson Corporation together with its subsidiaries (collectively, the “Company,” “McKesson,” “we,” “our,” or “us” and other similar pronouns), which traces its business roots to 1833, is a diversified healthcare services leader dedicated to advancing health outcomes for patients everywhere. Our teams partner with biopharma companies, care providers, pharmacies, manufacturers, governments, and others to deliver insights, products, and services to help make quality care more accessible and affordable.\nThe Company’s fiscal year begins on April 1 and ends on March 31. Unless otherwise noted, all references in this document to a particular year refers to the Company’s fiscal year. The Company was incorporated on July 7, 1994 in the State of Delaware.\nMcKESSON CORPORATION\nThe Company operates its business in four reportable segments: U.S. Pharmaceutical, Prescription Technology Solutions (“RxTS”), Medical-Surgical Solutions, and International.\nOur U.S. Pharmaceutical segment distributes branded, generic, specialty, biosimilar and over-the-counter (“OTC”) pharmaceutical drugs, and other healthcare-related products in the United States (“U.S.”). This segment also provides practice management, technology, clinical support, and business solutions to community-based oncology and other specialty practices. In addition, the segment sells financial, operational, and clinical solutions to pharmacies (retail, hospital, alternate sites) and provides consulting, outsourcing, technological, and other services.\nOur RxTS segment helps solve medication access, affordability and adherence challenges for patients by working across healthcare to connect patients, pharmacies, providers, pharmacy benefit managers, health plans, and biopharma companies. RxTS serves our biopharma and life sciences partners, delivering innovative solutions that help people get the medicine they need to live healthier lives. RxTS offers technology services, which includes electronic prior authorization, prescription price transparency, benefit insight, and dispensing support services, in addition to third-party logistics and wholesale distribution support designed to benefit stakeholders.\nOur Medical-Surgical Solutions segment provides medical-surgical supply distribution, logistics, and other services to healthcare providers, including physician offices, surgery centers, nursing homes, hospital reference labs, and home health care agencies. We offer more than 245,000 national brand medical-surgical products as well as McKesson’s own line of high-quality products through a network of distribution centers in the U.S.\nOur International segment provides distribution and services to wholesale, institutional, and retail customers in Canada and Norway where we own, partner, or franchise with retail pharmacies, and support better, safer patient care by delivering vital medicines, supplies, and information technology solutions. During fiscal 2025, we completed the sale of Rexall and Well.ca businesses in Canada. Refer to\nFinancial Note 2, “Business Acquisitions and Divestitures,”\n, to the consolidated financial statements included in this Annual Report for more information.\nU.S. Pharmaceutical Segment:\nOur U.S. Pharmaceutical segment provides distribution and logistics services for branded, generic, specialty, biosimilar, and OTC pharmaceutical drugs along with other healthcare-related products to customers. This business provides solutions and services to pharmacies, hospitals, oncology and other specialty practices, pharmaceutical manufacturers, biopharma partners, physicians, payors, and patients throughout the U.S. We also source generic pharmaceutical drugs through our ClarusONE Sourcing Services LLP joint venture with Walmart Inc. (“ClarusONE”).\nOur U.S. Pharmaceutical segment operates and serves customers through a network of 27 distribution centers in the U.S., including two strategic redistribution centers. We invest in technology and other systems at all of our distribution centers to enhance safety, reliability, and product availability. For example, we offer McKesson Connect\nSM\n, an internet-based ordering system that provides item look-up and real-time inventory availability as well as ordering, purchasing, third-party reconciliation, and account management functionality. We make extensive use of technology as an enabler to ensure customers have the right products at the right time in the right place.\nTo maximize distribution efficiency and effectiveness, we follow the Six Sigma methodology, which is an analytical approach that emphasizes setting high-quality objectives, collecting data, and analyzing results to a fine degree in order to improve processes, reduce costs, and enhance service accuracy and safety. We provide solutions to our customers including supply management technology, world-class marketing programs, managed care, repackaging products, and services to help them meet their business and quality goals. We continue to implement information systems to help achieve greater consistency and accuracy both internally and for our customers, as well as make investments to increase capacity and automation.\nWe have four primary customer pharmaceutical distribution channels: (i) retail national accounts, which include national and regional retail chains, food and drug combinations, mail order pharmacies, and mass merchandisers, (ii) community pharmacies and health (formerly described as independent, small, and medium chain retail pharmacies), (iii) institutional healthcare providers such as hospitals, health systems, integrated delivery networks, and long-term care providers, and (iv) oncology, biopharma, and other specialty partners.\nMcKESSON CORPORATION\nRetail National Accounts:\nWe provide business solutions that help our retail national account customers increase revenues and profitability. Solutions include:\nSM\n– Prescription refill service that enables pharmacies to more quickly refill prescriptions remotely, more accurately, and at a lower cost, while reducing inventory levels and improving customer service.\nStrategic Redistribution Centers – Two facilities totaling over 740,000 square feet that offer access to inventory for single source warehouse purchasing, including pharmaceuticals and biologics. These distribution centers also provide the foundation for a two-tiered distribution network that supports best-in-class direct store delivery.\n– Generic pharmaceutical purchasing program and inventory management that helps pharmacies maximize their cost savings with a broad selection of generic drugs, competitive pricing, and one-stop shopping.\nInventory Management – An integrated solution comprised of forecasting software and automated replenishment technologies that reduce inventory-carrying costs.\nExpressRx Track™ – Pharmacy automation solution featuring state-of-the-art robotics, upgraded imaging, and expanded vial capabilities, and industry-leading speed and accuracy in a small footprint.\nCommunity Pharmacy and Health:\nWe strengthen the overall health of community pharmacies and elevate the role they play in people’s lives. We accomplish this by providing supply chain excellence, pharmacy and patient solutions, as well as supporting independent pharmacies through industry and legislative advocacy. Our pharmacy and patient solutions include:\n– A national network of approximately 4,400 independently-owned pharmacies and one of the industry’s most comprehensive pharmacy franchise programs. Health Mart provides solutions for franchisees to promote excellence in business operations, team development, patient health, marketing and merchandising, and protects financial health through proactive audit support.\nand Atlas Specialty – Comprehensive managed care services that connect the continuum of care to help community pharmacies, health systems and physician practices save time, access competitive reimbursement rates, and improve cash flow.\nMcKesson Reimbursement Advantage\nSM\n(“MRA”) – MRA is one of the industry’s most comprehensive reimbursement optimization packages, comprising financial services (automated claim resubmission), analytic services, and customer care.\nMcKesson Provider Pay\n– Provider Pay is an automated reconciliation and payment management solution designed to maximize third-party cash flow and pursue unpaid claims.\nMcKesson Amplify – Provides resources for state pharmacy associations in all 50 states, including dedicated support funding, resources, and opportunities to participate in best practice sharing consortia. The funding helps to support advocacy initiatives that address the unique challenges faced by independent pharmacies and promote their sustainability and growth.\nMcKesson OneStop Generics\n– Generic pharmaceutical purchasing program that helps pharmacies maximize their cost savings with a broad selection of generic drugs, competitive pricing, and one-stop shopping.\nPinpoint Community Solutions – McKesson’s perpetual inventory management system targeted to independent pharmacy owners with five or fewer stores. The solution provides customers the opportunity to improve cash flow and increase efficiency with inventory visibility to help maximize operational performance.\nFrontEdge™ – Strategic planning, merchandising, and price maintenance program that helps community pharmacies maximize store profitability.\nMcKesson RxOwnership Program – A confidential, no-fee resource for pharmacists and pharmacy owners interested in buying, starting, or selling an independent pharmacy, regardless of their pharmacy affiliation.\nMcKESSON CORPORATION\nInstitutional Healthcare Providers:\nAt McKesson, we are relentless in our pursuit of opportunities to achieve operational efficiency, reduce waste, and improve the financial performance of our customers so they can achieve more of their goals today and into the future. Solutions include:\nProfessional and Advisory Services – Comprehensive suite of advisory and consulting services designed to support health system business of pharmacy initiatives, including patient care, business operations, ambulatory services, inpatient operations, data and digitization, pharmacy workforce management, leadership, and compliance with safety, quality, and regulatory standards. Specialized consulting areas include 340B optimization, orphan drug support and retail pharmacy payer solutions.\nMcKesson Plasma and Biologics – Specialty and plasma drug distributor that leads in market exclusive drug access; partner to health systems customers in navigating the complexities of limited distribution drug; and optimization of McKesson Distribution benefits.\nOutpatient, Retail, and Specialty Pharmacy – A portfolio of services and solutions customized to each customer’s business and clinical strategy.\nContracting and Contract/Purchasing Optimization – Solutions across generics, specialty, branded products, biosimilars, and 340B products, for inpatient and outpatient settings.\nSupply Assurance – Solutions and strategies to enhance product availability and proactively manage inventory of critical items.\nThe U.S. Pharmaceutical segment also offers solutions which enable its customers to drive greater efficiencies in their day-to-day operations, effectively managing their inventories and complying with complex government regulations. Solutions include McKesson Pharmacy Systems, MacroHelix, and Supply Logix, all of which provide innovative software technology and services that support retail pharmacies and hospitals.\nOncology, Biopharma, and Other Specialty Partners:\nThe U.S. Pharmaceutical segment provides a range of solutions to oncology and other specialty practices and offers community specialists (oncologists, rh",
  "item7_clean": "Years Ended March 31,\n(Dollars in millions)\nOther segment expense, net\nPrescription Technology Solutions\nMedical-Surgical Solutions\nTotal other expense, net\nSegment operating profit (loss)\nPrescription Technology Solutions\nMedical-Surgical Solutions\nCorporate expenses, net\nIncome from continuing operations before income taxes\nSegment operating profit margin\nPrescription Technology Solutions\nMedical-Surgical Solutions\nOther segment expense, net includes cost of sales, total operating expenses, as well as other income, net, for our reportable segments.\nOther segment expense, net for our U.S. Pharmaceutical segment includes the following:\na credit of $206 million and a provision for bad debts of $725 million for the years ended March 31, 2025 and 2024, respectively, related to the bankruptcy of our customer Rite Aid in October 2023, as further discussed in the\n“Trends and Uncertainties”\ncash receipts for our share of antitrust legal settlements of $444 million and $244 million for the years ended March 31, 2025 and 2024, respectively;\na charge of $82 million and a credit of $157 million for the years ended March 31, 2025 and 2024, respectively, related to the LIFO method of accounting for inventories;\nrestructuring charges of $59 million for the year ended March 31, 2025 for restructuring initiatives, as discussed in\nFinancial Note 3, “Restructuring, Impairment, and Related Charges, Net,”\nto the consolidated financial statements included in this Annual Report;\ncharges of $57 million and $74 million for the years ended March 31, 2025 and 2024, respectively, related to our estimated liability for opioid-related claims, as discussed in\nFinancial Note 17, “Commitments and Contingent Liabilities,”\nto the consolidated financial statements included in this Annual Report; and\na loss of $43 million for the year ended March 31, 2025 related to one of the Company’s equity method investments.\nOther segment expense, net for our RxTS segment for the year ended March 31, 2024 includes a gain of $78 million resulting from fair value adjustments of our contingent consideration liability related to the RxSS acquisition, as discussed in more detail in\nFinancial Note 2, “Business Acquisitions and Divestitures\nto the consolidated financial statements included in this Annual Report.\nOther segment expense, net for our Medical-Surgical Solutions segment for the year ended March 31, 2025 includes restructuring charges of $204 million related to a broad set of initiatives to drive operational efficiencies and increase cost optimization efforts, as\nMcKESSON CORPORATION\nFINANCIAL REVIEW (Continued)\nFinancial Note 3, “Restructuring, Impairment, and Related Charges, Net,”\nto the consolidated financial statements included in this Annual Report.\nOther segment expense, net for our International segment includes a charge of $605 million for the year ended March 31, 2025 to remeasure the assets and liabilities of our Canadian retail disposal group to fair value less costs to sell, as discussed in\nBusiness Acquisitions and Divestitures\nto the consolidated financial statements included in this Annual Report.\nCorporate expenses, net includes the following:\na charge of $87 million related to the termination of the U.K. pension plan as discussed in\nFinancial Note 13, “Pension Benefits,”\nto the consolidated financial statements included in this Annual Report;\na charge of $62 million for the year ended March 31, 2025 related to the effect of accumulated other comprehensive loss components from our Canadian retail disposal group, as discussed in\nBusiness Acquisitions and Divestitures\nto the consolidated financial statements included in this Annual Report;\na net gain of $101 million for the year ended March 31, 2025 related to our investments in equity securities of certain U.S. growth stage companies in the healthcare industry, as discussed in\nFinancial Note 15, “Fair Value Measurements,”\nto the consolidated financial statements included in this Annual Report;\ncharges of $51 million and $75 million for the years ended March 31, 2025 and 2024, respectively, related to our estimated liability for opioid-related claims as discussed in\nFinancial Note 17, “Commitments and Contingent Liabilities,”\nto the consolidated financial statements included in this Annual Report; and\nrestructuring charges of $68 million and $55 million for the years ended March 31, 2025 and 2024, respectively, for restructuring initiatives as discussed in Financial\nNote 3, “Restructuring, Impairment, and Related Charges, Net,”\nto the consolidated financial statements included in this Annual Report.\nOperating profit increased for the year ended March 31, 2025 compared to the prior year primarily due to a prior year provision for bad debts of $725 million and a fiscal 2025 credit of $206 million related to the reassessment of our initial estimates made in conjunction with the previously reserved prepetition balances owed by Rite Aid, growth in specialty pharmaceuticals and retail national account customers, and an increase in net cash proceeds received representing our share of antitrust legal settlements. These increases were partially offset by a LIFO charge in fiscal 2025 compared to a credit in the prior year period, an increase in operating expenses to support higher volumes, a charge of $57 million related to our estimated liability for opioid-related claims, and a loss related to one of our equity method investments.\nPrescription Technology Solutions\nOperating profit increased for the year ended March 31, 2025 compared to the prior year primarily driven by contributions from technology services partially offset by the gain of $78 million recognized in the prior year resulting from a fair value adjustment of our contingent consideration liability related to the RxSS acquisition.\nMedical-Surgical Solutions\nOperating profit decreased for the year ended March 31, 2025 compared to the prior year primarily due to higher restructuring charges recorded in fiscal 2025 and a decline in the contribution from our primary care business, partially offset by lower expenses resulting from business rationalization initiatives.\nOperating (loss) for this segment for the year ended March 31, 2025 compared to an operating profit for the prior year was largely due to remeasurement charges related to our Canadian retail disposal group, as discussed in\nBusiness Acquisitions and Divestitures\nto the consolidated financial statements included in this Annual Report.\nCorporate expenses, net decreased for the year ended March 31, 2025 compared to the prior year primarily due to a net gain of $101 million related to our investments in equity securities of certain U.S. growth stage companies in the healthcare industry, a favorable impact to interest income, and lower charges related to our estimated liability for opioid-related claims. These were partially offset by a fiscal 2025 charge of $87 million related to the termination of the U.K. pension plan, remeasurement charges related to our Canadian retail disposal group, as discussed in\nBusiness Acquisitions and Divestitures\nto the consolidated financial statements included in this Annual Report, and higher restructuring charges recorded in fiscal 2025 compared to the prior year.\nMcKESSON CORPORATION\nFINANCIAL REVIEW (Continued)\nFOREIGN OPERATIONS\nOur foreign operations represented approximately 4% and 5% of our consolidated revenues in fiscal 2025 and fiscal 2024, respectively. Foreign operations are subject to certain risks, including currency fluctuations. Refer to Item 1A - Risk Factors in Part I of this Annual Report for a risk factor related to fluctuations in foreign currency exchange rates, and risks from trade and tariffs. We monitor our operations and adopt strategies responsive to changes in the economic and political environment in each of the countries in which we operate. We conduct our business worldwide in local currencies, including the Canadian dollar and Euro. As a result, the comparability of our results reported in U.S. dollars can be affected by changes in foreign currency exchange rates. In discussing our operating results, we may use the term “foreign currency exchange fluctuations,” which refers to the effect of changes in foreign currency exchange rates used to convert the local currency results of our operations in foreign countries where the functional currency is not the U.S. dollar. We present this information to provide a framework for assessing how our business performed excluding the effect of foreign currency exchange rate fluctuations. In computing the foreign currency exchange fluctuations, we translate our current year results of our operations in foreign countries recorded in local currencies into U.S. dollars by applying their respective average foreign currency exchange rates of the corresponding prior year periods, and we subsequently compare those results to the previously reported results of the comparable prior year periods reported in U.S. dollars.\nIn fiscal 2025, we completed the sale of our Canadian retail disposal group. Refer to\nFinancial Note 2, “Business Acquisitions and Divestitures,\nto the consolidated financial statements included in this Annual Report for more information.\nAdditional information regarding our foreign operations is also included in Financial\nNote 20, “Segments of Business,”\nto the consolidated financial statements included in this Annual Report.\nBUSINESS COMBINATIONS\nBusiness Acquisitions and Divestitures\nto the consolidated financial statements included in this Annual Report for additional information.\nFISCAL 2026 OUTLOOK\nInformation regarding the Company’s fiscal 2026 outlook is contained in the release of our fourth quarter fiscal 2025 financial results included as an exhibit to our Form 8-K furnished to the SEC on May 8, 2025, which is not incorporated by reference into this Annual Report. That Form 8-K should be read in conjunction with the cautionary statements in Item 1 - Business - Forward-Looking Statements and Item 1A - Risk Factors, in Part I of this Annual Report.\nCRITICAL ACCOUNTING ESTIMATES\nWe consider an accounting estimate to be critical if the estimate requires us to make assumptions about matters based upon past experience and management’s judgment that were uncertain at the time the accounting estimate was made and if different estimates that we reasonably could have used in the current period, or changes in the accounting estimate that are reasonably likely to occur from period to period, could have a material impact on our financial condition or results from operations. Below are the estimates that we believe are critical to the understanding of our operating results and financial condition. Other accounting policies are described in\nFinancial Note 1, “Significant Accounting Policies,”\nto the consolidated financial statements included in this Annual Report. Because of the uncertainty inherent in such estimates, actual results may differ from these estimates.\nAllowances for Credit Losses:\nOur receivables primarily consist of short-term trade accounts receivable from customers that result from the sale of goods and services. We also provide customer financing arrangements to customers who purchase our products and services. Customer financing primarily relates to guarantees provided to our customers, or their creditors, regarding the repurchase of inventories. We also provide financing to certain customers related to the purchase of pharmacies, which serve as collateral for the loans. We estimate the receivables for which we do not expect full collection based on historical collection rates and specific knowledge regarding the current creditworthiness of our customers and record an allowance in our consolidated financial statements for these amounts.\nMcKESSON CORPORATION\nFINANCIAL REVIEW (Continued)\nThe Company considers historical credit losses, the current economic environment, customer credit ratings, collections on past due amounts, legal disputes, and bankruptcies, as well as reasonable and supportable forecasts to develop its allowance for credit losses. Management reviews these factors quarterly to determine if any adjustments are needed to the allowance.\nSales to the Company’s ten largest customers, including group purchasing organizations (“GPOs”), accounted for approximately 72% of total consolidated revenues in fiscal 2025 and comprised approximately 48% of total trade accounts receivable at March 31, 2025. Sales to our largest customer, CVS Health Corporation (“CVS”), accounted for approximately 24% of our total consolidated revenues in fiscal 2025 and comprised approximately 23% of total trade accounts receivable at March 31, 2025. As a result, our sales and credit concentration is significant. We also have agreements with GPOs, each of which functions as a purchasing agent on behalf of member hospitals, pharmacies and other healthcare providers, as well as with government entities and agencies. The accounts receivable balances are with individual members of the GPOs, and therefore no significant concentration of credit risk exists. A material default in payment, a material reduction in purchases from GPOs or any other large customers, or the loss of a large customer or GPO could have a material adverse impact on our financial position, results of operations, and liquidity.\nReserve methodologies are assessed annually based on historical losses and economic, business, and market trends. In addition, reserves are reviewed quarterly and updated if unusual circumstances or trends are present. We believe the reserves maintained and expenses recorded in fiscal 2025 are appropriate and consistent in the context of historical methodologies employed, as well as assessment of trends currently available.\nAt March 31, 2025, trade and notes receivables were $22.6 billion prior to allowances of $472 million. Our provision for bad debts was a credit of $130 million, in fiscal 2025 and a charge of $819 million, and $45 million in fiscal 2024 and fiscal 2023, respectively. At March 31, 2025 and 2024, the allowance as a percentage of trade and notes receivables was 2.1% and 4.5%, respectively. The provision for bad debts for fiscal 2024 included a charge of $725 million within our U.S. Pharmaceutical segment related to the bankruptcy of our customer Rite Aid, as discussed in the\n“Trends and Uncertainties”\nsection of this financial review and the\nFinancial Note 20, “Segments of Business,”\nto the consolidated financial statements included in this Annual Report. This amount represented the uncollected trade accounts receivable balance due from Rite Aid prior to its bankruptcy petition filing in October 2023. During the year ended March 31, 2025, we reassessed our initial estimates made in conjunction with the previously reserved prepetition balances, including cash received during the period, resulting in a reversal of $206 million recorded within “Selling, distribution, general, and administrative expenses” in our Consolidated Statements of Operations and included within our U.S. Pharmaceutical segment. During the year ended March 31, 2025, we released $237 million of allowance for doubtful accounts against trade accounts receivables, representing the write-off of uncollectible receivables related to the Rite Aid provision in the Consolidated Balance Sheet.\nAn increase or decrease of a hypothetical 0.1% in the fiscal 2025 allowance as a percentage of trade and notes receivables would result in an increase or decrease in the provision for bad debts of approximately $23 million. The selected 0.1% hypothetical change does not reflect what could be considered the best or worst-case scenarios. Additional information concerning our allowances for credit losses may be found in Schedule II included in this Annual Report.\nInventories consist of merchandise held for resale. We report inventories at the lower of cost or net realizable value, except for inventories determined",
  "item2_clean": null
}