{
  "source_file": "mck-20250930.htm",
  "form_type": "10-Q",
  "item1_clean": null,
  "item7_clean": null,
  "item2_clean": "McKESSON CORPORATION\nFINANCIAL REVIEW (CONTINUED)\n(UNAUDITED)\nFinancial Note 2, “Business Acquisitions and Divestitures,”\nto the accompanying condensed consolidated financial statements in this Quarterly Report for additional information regarding these acquisition transactions.\nThe following summary provides highlights and key factors that impacted our business, operating results, financial condition, and liquidity for the three and six months ended September 30, 2025:\nFor the three months ended September 30, 2025 compared to the prior year, revenues increased by 10%, gross profit increased by 9%, total operating expenses decreased by 20%, and other income, net increased by $28 million.\nFor the six months ended September 30, 2025 compared to the prior year, revenues increased by 16%, gross profit increased by 7%, total operating expenses decreased by 9%, and other income, net decreased by $38 million. Refer to the “\nOverview of Consolidated Results\n” section below for an analysis of these changes;\nDiluted earnings per common share attributable to McKesson Corporation increased to $8.92 from $1.87 for the three months ended September 30, 2025 and increased to $15.16 from $8.89 for the six months ended September 30, 2025 compared to the respective prior year periods;\nOn April 1, 2025, we completed the acquisition of a controlling interest in PRISM Vision for $871 million in cash, as discussed in further detail in the\n“Business Acquisitions and Divestitures”\nOn June 2, 2025, we completed the acquisition of a controlling interest in Core Ventures for $2.5 billion in cash, as discussed in further detail in the\n“Business Acquisitions and Divestitures”\nFor the six months ended September 30, 2025, we recorded a provision for bad debts of $189 million related to the bankruptcy of our customer, Rite Aid Corporation (including certain of its subsidiaries, “Rite Aid”);\nOn May 8, 2025, we entered into a syndicated $1.0 billion 364-Day senior unsecured credit facility (the “364-Day Credit Facility”) which is scheduled to mature in May 2026. Refer to\nFinancial Note 8, “Debt and Financing Activities,”\nto the accompanying condensed consolidated financial statements in this Quarterly Report for additional information;\nOn May 30, 2025, we completed a public debt offering of 4.65% Notes due May 30, 2030 in a principal amount of $650 million, 4.95% Notes due May 30, 2032 in a principal amount of $650 million, and 5.25% Notes due May 30, 2035 in a principal amount of $700 million, for total proceeds received, net of discounts and debt offering expenses, of $2.0 billion. The net proceeds from these notes in addition to cash on hand were utilized to fund the purchase of the interest in Core Ventures. Refer to\nFinancial Note 8, “Debt and Financing Activities,”\nto the accompanying condensed consolidated financial statements in this Quarterly Report for additional information;\nDuring the six months ended September 30, 2025, we returned $1.6 billion of cash to shareholders through $1.4 billion of common stock repurchases in open market transactions and $179 million of dividend payments. The total remaining authorization outstanding for repurchases of the Company’s common stock at September 30, 2025 was $6.1 billion; and\nOn July 29, 2025, our Board of Directors (the “Board”) raised our quarterly dividend to $0.82 from $0.71 per share of common stock.\nTrends and Uncertainties:\nAs described in “Item 1. Government Regulation” and “Item 1A - Risk Factors” in Part I of our 2025 Annual Report, our industry is highly regulated and is subject to risks and uncertainty caused by the volume and speed of changes to regulatory policies. Changes in U.S. federal regulatory posture and law may result in significant changes in healthcare policy, government funding of healthcare costs, and other laws affecting our operations, but the ultimate outcomes are difficult to predict.\n\nMcKESSON CORPORATION\nFINANCIAL REVIEW (CONTINUED)\n(UNAUDITED)\nSDG&A for the six months ended September 30, 2025 was impacted by higher operating expenses related to the acquisitions completed during the first half of fiscal 2026, as discussed in more detail in\nFinancial Note 2, “Business Acquisitions and Divestitures,”\nto the accompanying condensed consolidated financial statements in this Quarterly Report;\nClaims and litigation charges, net primarily consists of a charge of $108 million for the six months ended September 30, 2024 related to our estimated liability for opioid-related claims as discussed in more detail in\nFinancial Note 11, “Commitments and Contingent Liabilities,”\nto the accompanying condensed consolidated financial statements included in this Quarterly Report; and\nRestructuring, impairment, and related charges, net were $63 million and $171 million for the three months ended September 30, 2025 and 2024, respectively, and $110 million and $181 million for the six months ended September 30, 2025 and 2024, respectively, as discussed below under “Restructuring Initiatives.”\nWe evaluate goodwill for impairment on an annual basis in the first fiscal quarter, and at an interim date if indicators of potential impairment exist. The annual impairment testing performed in fiscal 2026 and fiscal 2025 did not indicate any impairment of goodwill, and no goodwill impairment charges were recorded during the three and six months ended September 30, 2025 and 2024. However, other risks, expenses, and future developments, such as government actions, increased regulatory uncertainty, and material changes in key market assumptions limit our ability to estimate projected cash flows, which could adversely affect the fair value of various reporting units in future periods.\nFor additional disclosure of our policy regarding goodwill, refer to the “Critical Accounting Estimates” section within Item 7 - Management’s Discussion and Analysis of Financial Condition and Results of Operations in Part II of our 2025 Annual Report.\nRestructuring Initiatives\nWe recorded restructuring, impairment, and related charges of $63 million and $171 million for the three months ended September 30, 2025 and 2024, respectively, and $110 million and $181 million for the six months ended September 30, 2025 and 2024, respectively. These charges were included in “Restructuring, impairment, and related charges, net” in the Condensed Consolidated Statements of Operations.\nDuring the second quarter of fiscal 2025, we approved enterprise-wide initiatives to modernize and accelerate our technology service operating model, which were intended to improve business continuity, compliance, operating efficiency and advance investments to streamline the organization. These initiatives include cost reduction efforts and support other rationalization efforts within Corporate, and the Medical-Surgical Solutions and North American Pharmaceutical segments to help realize long-term sustainable growth. We anticipate total charges related to these initiatives of $650 million to $700 million, consisting primarily of employee severance and other employee-related costs as well as facility, exit, and other related costs, including long-lived asset impairments. These programs are anticipated to be substantially complete in fiscal 2028. We recorded charges of $52 million and $90 million for the three and six months ended September 30, 2025, respectively, and $227 million for the three and six months ended September 30, 2024 related to these initiatives, which primarily includes severance and other employee-related costs as well as facility exit and other related costs, including\n\nManagement’s Discussion and Analysis of Financial Condition and Results of Operations.\nINDEX TO MANAGEMENT’S DISCUSSION AND ANALYSIS\nOverview of our Business\nTrends and Uncertainties\nOverview of Consolidated Results\nOverview of Segment Results\nNew Accounting Pronouncements\nFinancial Condition, Liquidity, and Capital Resources\nCautionary Notice About Forward-Looking Statements\nAvailable Information\nGENERAL\nOur fiscal year begins on April 1 and ends on March 31. Unless otherwise noted, all references to a particular year refer to our fiscal year.\nCertain statements in this report constitute forward-looking statements. See\n“Cautionary Notice About Forward-Looking Statements”\nincluded in this Quarterly Report.\nOverview of our Business:\nWe are a diversified healthcare services leader dedicated to advancing health outcomes for patients everywhere. Our teams partner with biopharma companies, care providers, pharmacies, manufacturers, governments, and others to deliver insights, products, and services to help make quality care more accessible and affordable.\nWe implemented a new segment reporting structure commencing in the second quarter of fiscal 2026, which resulted in four reportable segments: North American Pharmaceutical, Oncology & Multispecialty, Prescription Technology Solutions (“RxTS”), and Medical-Surgical Solutions.\nOur Norwegian operations are included in Other.\nAll prior segment information has been recast to reflect the Company’s new segment structure and current period presentation. Our organizational structure also includes Corporate, which consists of income and expenses associated with administrative functions and projects, as well as the results of certain investments. The factors for determining the reportable segments include the manner in which management evaluates the performance of the Company combined with the nature of individual business activities. We evaluate the performance of our operating segments on a number of measures, including revenues and operating profit before interest expense and income taxes.\n\nrelated to impairment of inventories within \"Cost of sales\" in the Condensed Consolidated Statements of Operations within our North American Pharmaceutical segment.\nTotal Operating Expenses\nA summary of the components of our total operating expenses for the three and six months ended September 30, 2025 and 2024 is as follows:\nSelling, distr"
}