{
  "source_file": "mco-20250930.htm",
  "form_type": "10-Q",
  "item1_clean": null,
  "item7_clean": null,
  "item2_clean": "Item 2. Management's Discussion and Analysis of Financial Condition and Results of Operations\nThis discussion and analysis of financial condition and results of operations should be read in conjunction with the Moody’s Corporation consolidated financial statements and notes thereto included elsewhere in this quarterly report on Form 10\nQ.\nThis Management’s Discussion and Analysis of Financial Condition and Results of Operations contains Forward-Looking Statements. See “Forward-Looking Statements” commencing on page\nfor a discussion of uncertainties, risks and other factors associated with these statements.\nTHE COMPANY\nIn a world shaped by increasingly interconnected risks, Moody's data, insights, and innovative technologies help customers develop a holistic view of their world and unlock opportunities. With a rich history of experience in global markets and a diverse workforce of approximately 16,000 across more than 40 countries, Moody's gives customers the comprehensive perspective needed to act with confidence and thrive. Moody’s has two reportable segments: MA and MIS.\nMoody's Investors Service\nMA provides data, intelligence and analytical tools to help business and financial leaders make confident decisions.\nFor more than 115 years, MIS has been a leading provider of credit ratings, research, and risk analysis helping businesses, governments, and other entities around the globe.\nMA is comprised of: i) a premier fixed income and economic research business (Research & Insights); ii) a data business powered by the world’s largest database on companies and credit (Data & Information); and iii) three cloud-based subscription businesses serving banking, insurance and KYC workflows (Decision Solutions).\nMIS publishes credit ratings and provides assessment services on a wide range of debt obligations, programs and facilities, and the entities that issue such obligations in markets worldwide, including various corporate, financial institution and governmental obligations, and structured finance securities.\nCritical Accounting Estimates\nAt July 31st of each year, Moody’s evaluates its goodwill for impairment at the reporting unit level, defined as an operating segment (i.e., MA and MIS), or one level below an operating segment (i.e., a component of an operating segment).\nPrior to 2025, MA's reporting unit structure consisted of\nreporting units comprised of businesses that offer: i) data and data-driven analytical solutions; and ii) risk-management software, workflow and CRE solutions. During the first quarter of 2025, MA reorganized its management and reporting structure, which affected the composition of the reporting units within the MA reportable segment. As a result, MA's reporting unit structure now consists of\nreporting unit, which is consistent with the segment's current management structure and operating model. This reorganization did not result in a change to the Company's reportable segments. The Company performed assessments of the reporting units impacted by the reorganization immediately before and after the reorganization became effective and determined that it was not more likely than not that the fair value of any reporting unit was less than its carrying amount.\nSubsequent to the aforementioned reorganization of the MA reporting unit structure, the Company now has three reporting units: two within the Company’s ratings business (one for the ICRA business and one that encompasses all of Moody’s other ratings operations) and one reporting unit within MA.\nAt July 31, 2025, the Company performed qualitative assessments for each of the three reporting units. These qualitative assessments resulted in the Company determining that it was not more likely than not that the fair value of any reporting unit was less than its carrying amount.\nThe Company is organized into two reportable segments as of September 30, 2025: MA and MIS, which are more fully described in the section entitled “The Company” above and in Note 17 to the consolidated financial statements.\nRESULTS OF OPERATIONS\nThe following footnotes are applicable throughout the discussion of the Company's results of operations:\nRefer to the section entitled \"Non-GAAP Financial Measures\" of this MD&A for the definition and methodology that the Company utilizes to calculate this metric.\nRefer to the section entitled \"Key Performance Metrics\" of this MD&A for the definition and methodology that the Company utilizes to calculate this metric.\nThree months ended September 30, 2025 compared with three months ended September 30, 2024\nThe following table provides an executive summary of key operating results for the quarter ended September 30, 2025. Following this executive summary is a more detailed discussion of the Company’s operating results as well as a discussion of the operating results of the Company’s reportable segments.\nInsight and Key Drivers of Change Compared to Prior Year\nMoody's total revenue\n\nDS: Global revenue ⇑ $41 million\nU.S. Revenue ⇑ $23 million\nNon-U.S. Revenue ⇑ $18 million\nGlobal DS revenue for the three months ended September 30, 2025 and 2024 was comprised as follows:\nGlobal DS revenue grew 11% compared to the third quarter of 2024 and reflects increases in the U.S. (16%) and internationally (8%). Organic constant currency revenue\nand organic constant currency recurring revenue\ngrowth for DS was 6% and 9%, respectively.\nThe most notable drivers of the growth are as follows:\nInsurance revenue grew 16%\nrecurring revenue growth of 18% in Insurance was attributable to:\ncontinued demand for subscription-based catastrophe models; and\nrevenue from Praedicat and CAPE Analytics, which the Company acquired in the third quarter of 2024 and first quarter of 2025, respectively\nOrganic constant currency revenue\ngrowth and organic constant currency recurring revenue\ngrowth for Insurance was 8% and 11%, respectively\nARR\ngrew 8% reflecting the continued demand for subscription-based catastrophe and actuarial models\nKYC revenue grew 19%\nrecurring revenue growth of 22% reflects strong demand and customer retention for the suite of KYC solutions\nOrganic constant currency revenue\ngrowth and organic constant currency recurring revenue\ngrowth in KYC was 16% and 18%, respectively\nARR\ngrew 16%, reflecting the aforementioned strong demand for KYC solutions\nBanking revenue was in line with the prior year\nrecurring revenue growth of 3% within Banking reflected:\nexpansion of existing customer relationships to cloud hosted subscription-based banking offerings, which enable customers' lending, risk management and finance workflows; and\nrevenue from Numerated, which the Company acquired in the fourth quarter of 2024;\npartially offset by:\na decline in revenue from installed software subscriptions\nTransaction revenue declined 11%\nThe aforementioned declines in installed software subscriptions and transaction revenue reflect MA's continued strategic shift to cloud hosted subscription-based solutions\nOrganic constant currency revenue\ndeclined by 3% and organic constant currency recurring revenue\nwas in line with the prior year\nARR\ngrew 7% reflecting the aforementioned expansion of existing customer relationships to subscription-based banking offerings\nThe aforementioned factors contributed to overall ARR\ngrowth for DS of 10%.\nRESEARCH AND INSIGHTS REVENUE\nThree months ended September 30,\n-----------------------------------------------------------------------------------\n_________________________________________________\n________________________________________________\n\nGlobal revenue ⇑ $194 million\nU.S. Revenue ⇑ $119 million\nNon-U.S. Revenue ⇑ $75 million\nThe 11% increase in global revenue reflects growth in MA of 9% and MIS of 12%. On an organic constant currency basis, revenue\ngrew 9%. Refer to the section entitled “Segment Results” of this MD&A for a more comprehensive discussion of the Company’s segment revenue.\nThird Quarter Operating Expense ⇓ $20 million\nCompensation expenses of $364 million decreased $30 million, reflecting:\nNon-compensation expenses of $128 million increased $10 million, reflecting:\n— a decrease in incentive compensation, which aligns with actual/projected financial and operational performance;\n— increase in costs to support operating growth, including investments to support technology and innovation\n— growth in salaries and benefits attributable to recent acquisitions as well as hiring and salary increases\nThird Quarter SG&A Expense ⇑ $19 million\nCompensation expenses of $271 million decreased $3 million, reflecting:\nNon-compensation expenses of $182 million increased $22 million, reflecting:\n— a decrease in incentive compensation, which aligns with actual/projected financial and operational performance;\n— an increase in charitable contributions; and\n— an increase in costs to support operating growth, including investments to support technology and innovation\n— growth in salaries and benefits attributable to hiring and salary increases as well as recent acquisitions\nDepreciation and amortization\nThe increase is primarily driven by amortization of internally developed software, which relates to the development of MA SaaS solutions, as well as amortization of recently acquired intangible assets.\nThe amounts reflect charges and adjustments related to the Company's restructuring programs. The Strategic and Operational Efficiency Restructuring Program is more fully discussed in Note 10 to the consolidated financial statements.\nOperating margin 45.7%, ⇑ 500 BPS\nAdjusted Operating Margin\n52.9%, ⇑ 510 BPS\nOperating margin and Adjusted Operating Margin\nexpansion reflects revenue growth coupled with disciplined cost management.\nInterest Expense, net ⇓ $2 million\nOther non-operating income ⇓ $17 million\nInterest expense was generally in line with prior year with the following offsetting factors:\nDecrease in income is primarily due to:\n— lower interest expense on borrowings of $20 million attributable to favorable impacts from fixed-to-floating interest"
}