{
  "source_file": "mco-20241231.htm",
  "form_type": "10-K",
  "item1_clean": "with a foundation of credibility, transparency, technology, data and analytics\nintegrated solutions\nto allow customers to manage multiple risks, bringing the best of Moody's capabilities\nInvest to successfully\nscale in priority growth markets\nwith highly differentiated products and services\nInvestment in high growth markets\nExecution Priorities\nHow we will get it done\nDevelop our people and culture\nCollaborate, modernize and innovate\nMoody’s invests in initiatives to implement the Company’s strategy, including internally-led organic development and targeted acquisitions. Illustrative examples include:\nEnhancements to ratings quality and product extensions\nExpansion in emerging markets\nNew products, services, content and technology capabilities, including Gen AI, to meet customer demands\nInvestments that extend ownership and participation in joint ventures as well as acquisitions and strategic partnerships that accelerate the ability to scale and grow Moody’s businesses\nIn this era of exponential risk, we know that risks are interconnected, and organizations want a complete view of risk. This includes having a greater breadth and depth of understanding around how risks connect.\nOur integrated approach provides stakeholders with a more comprehensive view of risk, helping them to make better decisions and unlock opportunities. Moody’s brings together multiple data sets and develops risk analysis solutions to assess multiple risk factors (e.g., supply chain failures; cyberattacks; geopolitical tensions; sanctions and security issues; and extreme weather events).\nMOODY'S\n2024 10-K 17\nPROSPECTS FOR GROWTH\nMoody’s believes that the overall long-term outlook remains favorable for continued growth from the offerings of both of our reportable segments.\nMoody’s growth is influenced by a number of trends that impact the market for our products, including:\nEnablement of Gen AI\nHealth of the world’s major economies\nDebt capital markets activity\nDisintermediation of credit markets\nFiscal and monetary policy of governments\nExpansion of market for integrated data and analytics solutions\nBusiness investment spending, including mergers and acquisitions\nIn an environment of increasing financial complexity and exponential risk, Moody’s expects to be well positioned to benefit from continued growth in global fixed-income market activity and more widespread use of credit ratings and integrated risk solutions. Moreover, pricing opportunities aligned with customer value creation and advances in technology present growth opportunities for Moody’s.\nOver the last decade, Moody’s has leveraged the power of AI and ML to better serve our customer base. As an early adopter of Gen AI, Moody's expects to be well positioned to benefit from the capabilities of this technology, which will help our customers make better decisions by unlocking deeper, more integrated perspectives on risk. Through enablement of Gen AI, both internally and through certain strategic partnerships, we are in the process of evolving how we deliver insights on exponential risk to our customers.\nMoody’s operations are subject to various risks, as more fully described in Part I, Item 1A “Risk Factors,” inherent in conducting business on a global basis.\nMA Prospects for Growth\nMA provides insights on the evolving risks of our customers and supports their ability to capitalize on related opportunities. Growth in MA is likely to be driven by landing new customers and expanding customer relationships across use cases over time. Our trusted and curated data is key in an environment that is increasingly using Gen AI, and we expect that the integration of our platforms will enable effective cross-selling of models, data and applications. MA's growth is also likely to be driven by quickly addressing new use cases and incorporating new risk data and analytics as needed.\nStrategic growth drivers\nNEW PRODUCT DEVELOPMENT\nSTRONG CUSTOMER RETENTION RATES\nCROSS-SELLING, UPGRADES & PRICING\nCONTINUED SAAS TRANSITION\nINCREASED DISTRIBUTION CAPACITY AND PRODUCTIVITY\nMOODY'S\n2024 10-K\nMarket growth drivers\nCustomers need to understand a large range of interconnected and emerging risks. Our comprehensive solutions support the transformation underway across various industries due to:\nOperational and reputational risks\nDigitization & Artificial Intelligence\nEvolving regulatory environment\nFluctuations in credit and financial markets\nMIS Prospects for Growth\nStrong secular trends should continue to provide long-term growth opportunities in MIS. Key growth drivers include:\nLong-term Growth Building Blocks\nDeveloping Capital Markets and Evolving Risks\nGDP growth drives demand for debt capital to fund business investments\nRefinancing needs support future supply\nProven rating accuracy and deeply experienced analysts\nMix of issuers and opportunistic issuance\nDeepening participation in developing markets\nMeeting customers’ evolving risk assessment demands, including Sustainable and Transition Finance, Private Credit, Digitalization of the financial sector, and Cybersecurity\nIn addition to the factors noted above, growth in global fixed income markets in a given year is dependent on many macroeconomic and capital market factors including:\nBusiness investment spending\nCorporate refinancing needs\nMerger and acquisition activity\nIssuer financial health\nConsumer borrowing levels\nSecuritization activity\nExpansion of ratings coverage\nExpansion into emerging markets\nRating fees paid by debt issuers account for most of the revenue of MIS. Therefore, a substantial portion of MIS’s revenue is dependent upon the dollar-equivalent volume and number of ratable debt securities issued in the global capital markets. However, annual fee arrangements with frequent debt issuers, annual fees from debt monitoring, commercial paper and medium-term note programs, bank deposit ratings, insurance company financial strength ratings, mutual fund ratings, and other areas partially mitigate MIS’s dependence on the volume or number of new debt securities issued in the global fixed-income markets.\nWithin MIS, we remain firmly committed to ratings quality, timely and insightful research, and engagement with issuers and investors. In the past year, we have enhanced our footprint in domestic markets by increasing our majority share in the GCR Africa affiliate and expanding in Latin American markets through Moody's Local domestic rating business. This strategic expansion has solidified our domestic rating agency's position, enhancing its capacity and reach.\nMA competes broadly in the financial information and enterprise risk software industries against various diversified competitors. MA’s main competitors within DS are providers of software and analytic solutions. In R&I, MA faces competition from providers of economic data, financial research and analysis. MA's main competitors within D&I are providers of commercial and financial data.\nMIS competes with other CRAs and with investment banks and brokerage firms that offer credit opinions and research. Many users of MIS’s ratings also have in-house credit research capabilities.\nMOODY'S\n2024 10-K 19\nMIS, certain of the Company's credit rating affiliates, and many of the issuers and/or securities that MIS and the affiliates rate, are subject to extensive regulation in the U.S. (including by state and local authorities), EU, U.K. and in other countries. In addition, some of the services offered by MA and its affiliates are subject to regulation in a number of countries. MA also derives a significant amount of its sales from banks and other financial services providers who are subject to regulatory oversight and who are required to conduct due diligence and pass through certain regulatory requirements to key suppliers such as MA by contract. Existing and proposed laws and regulations can impact the Company’s operations, products and the markets in which the Company operates. Additional laws and regulations have been proposed or are being considered. Each of the existing, adopted, proposed and potential laws and regulations can increase the costs and legal risk associated with the Company’s operations, including the issuance of credit ratings, and may negatively impact the Company’s profitability and ability to compete, or result in changes in the demand for the Company's products and services, in the manner in which the Company's products and services are utilized, and in the manner in which the Company operates.\nIn the U.S., CRAs are subject to extensive regulation primarily pursuant to Section 15E of the Exchange Act and rules thereunder. MIS is registered with the SEC as an NRSRO and is subject to the SEC's oversight and examination authority.\nIn the EU, the CRA industry is registered and supervised through a pan-EU regulatory framework. ESMA has direct supervisory responsibility for registered CRAs throughout the EU. MIS’s EU CRA subsidiaries are registered with and are subject to CRA regulation in the EU and periodic inspection by ESMA.\nThe European Parliament and the Council of the EU, the EU co-legislators, announced they had reached agreement on the text of the Regulation on ESG Ratings Activities in February 2024. The Regulation will become law after it has been published in the EU Official Journal. The regulation will apply after an 18 month implementation period from its publication, and will subject ESG rating and/or score providers to formal regulation and supervision by ESMA. Certain products offered by MIS may fall in scope of the Regulation and we continue to assess and prepare for the implications. We do not expect MA products to fall into scope.\nThe EU AI Act was published in the EU Official Journal in July 2024, though elements of the Act have different implementation periods. We continue to assess and prepare for any implications both for MA and MIS.\nIn December 2022, the EU adopted DORA, which will apply from early 2025. As a credit rating agency, MIS is in scope of DORA, and accordingly, is required to undertake certain steps to ensure that its oversight and risk management of its information technology, including any functions outsourced to third-parties that provide information communication technologies, is resilient. MA provides certain products and services to clients that may be regulated financial institutions in the EU and therefore fall in the scope of DORA. It is therefore expected that MA may receive queries from such clients in relation to those products and services, as well as requests for contractual commitments, to ensure their compliance with DORA.\nIn the U.K., MIS U.K. is registered with and regulated by the FCA. In March 2023, the FCA initiated a review of competition in the markets for certain types of wholesale market data, including credit ratings data. The review concluded at the end of February 2024. In its final report, the FCA declined to make a market investigation reference to the Competition and Markets Authority nor did it consider any specific remedies or other specific interventions in respect of credit ratings data.\nAdditionally, HM Treasury published a consultation in March 2023 on whether regulation for providers of ESG ratings should be introduced, and the potential scope of a regulatory regime. The U.K. Government has said it intends to take forward such legislation in 2025.\nIntellectual Property\nMoody’s and its affiliates own and control a variety of intellectual property, including but not limited to:\nProprietary information\nTrademarks and Patents\nSaaS and other software tools and applications\nModels and methodologies\nOther proprietary materials that, in the aggregate, are of material importance to Moody’s business\nMOODY'S\n2024 10-K\nManagement of Moody’s believes that the trademarks and related corporate names, marks and logos relating to its businesses, including those containing the term “Moody’s”, are of material importance to the Company.\nThe Company, primarily through MA and its affiliate",
  "item7_clean": "ITEM 7. MANAGEMENT'S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS\nThis Management’s Discussion and Analysis of Financial Condition and Results of Operations contains Forward-Looking Statements. See “Forward-Looking Statements” commencing on page\nand Item 1A. “Risk Factors” commencing on page\nfor a discussion of uncertainties, risks and other factors associated with these statements.\nMoody’s is a global integrated risk assessment firm that empowers organizations to anticipate, adapt and thrive in a new era of exponential risk. Moody’s reports in two segments: MA and MIS.\nMA is a global provider of: i) research and insights; ii) data and information; and iii) decision solutions, which help companies make better and faster decisions. MA leverages its industry expertise across multiple risks such as credit, market, financial crime, supply chain, catastrophe and climate to deliver integrated risk assessment solutions that enable business leaders to identify, measure and manage the implications of interrelated risks and opportunities.\nMIS publishes credit ratings and provides assessment services on a wide range of debt obligations, programs and facilities, and the entities that issue such obligations in markets worldwide, including various corporate, financial institution and governmental obligations, and structured finance securities.\nCritical Accounting Estimates\nMoody’s discussion and analysis of its financial condition and results of operations are based on the Company’s consolidated financial statements, which have been prepared in accordance with accounting principles generally accepted in the United States. The preparation of these financial statements requires Moody’s to make estimates and judgments that affect reported amounts of assets and liabilities and related disclosures of contingent assets and liabilities at the dates of the financial statements and revenue and expenses during the reporting periods. These estimates are based on historical experience and on other assumptions that are believed to be reasonable under the circumstances. On an ongoing basis, Moody’s evaluates its critical accounting estimates. Actual results may differ from these estimates under different assumptions or conditions. The following accounting estimates are considered critical because they are particularly dependent on management’s judgment about matters that are uncertain at the time the accounting estimates are made and changes to those estimates could have a material impact on the Company’s consolidated results of operations or financial condition.\nGoodwill and Other Acquired Intangible Assets\nAt July 31st of each year, Moody’s evaluates its goodwill for impairment at the reporting unit level, defined as an operating segment (i.e., MA and MIS), or one level below an operating segment (i.e., a component of an operating segment).\nThe Company has four reporting units: two reporting units within MA consisting of businesses that offer: i) data and data-driven analytical solutions; and ii) risk-management software, workflow and CRE solutions, and two within the Company’s ratings business (one for the ICRA business and one that encompasses all of Moody’s other ratings operations).\nThe Company evaluates the recoverability of goodwill using a two-step impairment test approach at the reporting unit level. In the first step, the Company assesses various qualitative factors to determine whether the fair value of a reporting unit may be less than its carrying amount. If a determination is made based on the qualitative factors that an impairment does not exist, the Company is not required to perform further testing. If the aforementioned qualitative assessment results in the Company concluding that it is more likely than not that the fair value of a reporting unit may be less than its carrying amount, the fair value of the reporting unit will be quantitatively determined and compared to its carrying value including goodwill. If the fair value of the reporting unit exceeds the carrying value of the net assets assigned to that unit, goodwill is not impaired, and the Company is not required to perform further testing. If the fair value of the reporting unit is less than the carrying value, the Company will record a goodwill impairment charge for the amount by which the carrying value exceeds the reporting unit’s fair value. The Company evaluates its reporting units on an annual basis, or more frequently if there are changes in the reporting structure of the Company due to acquisitions, realignments or if there are indicators of potential impairment. For the reporting units where the Company is consistently able to conclude that no impairment exists using only a qualitative approach, the Company’s accounting policy is to perform the second step of the aforementioned goodwill impairment assessment at least once every three years.\nAt July 31, 2024, the Company performed quantitative assessments for each of the four reporting units in accordance with the aforementioned policy. These quantitative assessments resulted in fair values that significantly exceeded carrying value for all reporting units.\nDetermining the fair value of a reporting unit involves the use of significant estimates and assumptions, which are more fully described below. In addition, the Company also makes certain judgments and assumptions in allocating shared assets and liabilities to determine the carrying values for each of its reporting units.\nOther assets and liabilities, including applicable corporate assets, are allocated to the extent they are related to the operation of respective reporting units.\nMOODY'S\n2024 10-K\nMethodologies and significant estimates utilized in determining the fair value of reporting units:\nThe following is a discussion regarding the Company’s methodology for determining the fair value of its reporting units, excluding ICRA, as of July 31, 2024. As ICRA is a publicly traded company in India, the Company was able to observe its fair value based on its market capitalization.\nThe fair value of each reporting unit, excluding ICRA, was estimated using a discounted cash flow methodology and comparable public company and precedent transaction multiples. The discounted cash flow analysis requires significant estimates, including projections of future operating results and cash flows of each reporting unit that are based on internal budgets and strategic plans, expected long-term growth rates, terminal values, weighted average cost of capital and the effects of external factors and market conditions. Changes in these estimates and assumptions could materially affect the estimated fair value of each reporting unit that could result in an impairment charge to reduce the carrying value of goodwill, which could be material to the Company’s financial position and results of operations. Moody’s allocates newly acquired goodwill to reporting units based on the reporting unit expected to benefit from the acquisition.\nThe sensitivity analyses on the future cash flows and WACC assumptions are described below. These key assumptions utilized in the discounted cash flow valuation methodology require significant management judgment:\nFuture cash flow assumptions\n- The projections for future cash flows utilized in the models are derived from historical experience and assumptions regarding future growth and profitability of each reporting unit. These projections are consistent with the Company’s operating budget and strategic plan. Cash flows for the five years subsequent to the date of the quantitative goodwill impairment test were utilized in the determination of the fair value of each reporting unit. Beyond five years, a terminal value was determined using a perpetuity growth rate based on inflation and real GDP growth rates. A sensitivity analysis of the revenue growth rates was performed on all reporting units. For each reporting unit analyzed, a 10% reduction in the revenue growth rates used would still result in fair values that significantly exceeded carrying values.\nWACC\n- The WACC is the rate used to discount each reporting unit’s estimated future cash flows. The WACC is calculated based on the proportionate weighting of the cost of debt and equity. The cost of equity is based on a risk-free interest rate and an equity risk factor, which is derived from public companies similar to the reporting unit and which captures the perceived risks and uncertainties associated with the reporting unit’s cash flows. The cost of debt component is calculated as the weighted average cost associated with all of the Company’s outstanding borrowings as of the date of the impairment test and was immaterial to the computation of the WACC. The cost of debt and equity is weighted based on the debt to market capitalization ratio of publicly traded companies with similarities to the reporting unit being tested. The WACC for all reporting units ranged from 10.0% to 10.5% as of July 31, 2024. Differences in the WACC used between reporting units is primarily due to distinct risks and uncertainties regarding the cash flows of the different reporting units. A sensitivity analysis of the WACC was performed on all reporting units as of July 31, 2024 for each reporting unit. For all reporting units, an increase in the WACC of one percentage point would still result in fair values that significantly exceeded carrying values.\nLong-lived assets, which consist primarily of amortizable intangible assets, operating lease ROU Assets and property and equipment, are reviewed for recoverability whenever events or changes in circumstances indicate that the carrying amount may not be recoverable.\nUnder the first step of the recoverability assessment, Moody's compares the estimated undiscounted future cash flows attributable to the asset or asset group to its carrying value. If the undiscounted future cash flows are greater than the carrying value, no further assessment is required. If the undiscounted future cash flows are less than the carrying value, Moody's proceeds with step two of the assessment. Under step two of this assessment, Moody's is required to determine the fair value of the asset or asset group and recognize an impairment loss if the carrying amount exceeds its fair value. In performing this assessment, Moody's must include assumptions that market participants would use in their estimates of fair value, including the estimated future cash flows and discount rate. Moody's must apply judgment in developing estimated future cash flows and in the determination of market participant assumptions.\nThe Company is subject to income taxes in the U.S. and various foreign jurisdictions. The Company’s tax assets and liabilities are affected by the amounts charged for services provided and expenses incurred as well as other tax matters such as intercompany transactions. The Company accounts for income taxes under the asset and liability method in accordance with ASC Topic 740. Therefore, income tax expense is based on reported income before income taxes, and deferred income taxes reflect the effect of temporary differences between the amounts of assets and liabilities that are recognized for financial reporting purposes and the amounts that are recognized for income tax purposes.\nThe Company is subject to tax audits in the U.S. and various foreign jurisdictions. The Company regularly assesses the likely outcomes of such audits in order to determine the appropriateness of liabilities for UTPs. The Company classifies interest related to income taxes as a component of interest expense in the Company’s consolidated statements of operations and associated penalties, if any, as part of other non-operating expenses.\nFor UTPs, ASC Topic 740 requires a company to first determine whether it is more-likely-than-not (defined as a likelihood of more than fifty percent) that a tax position will be sustained based on its technical merits as of the reporting date, assuming that taxing authorities will examine the position and have full knowledge of all relevant information. A tax position that meets this more-likely-\nMOODY'S\n2024 10-K 39\nthan-not threshold is then measured and recognized at the largest amount of benefit that is greater than fifty percent likely to be realized upon effective settlement with a taxing authority. As the determination of liabilities related to UTPs and associated interest and penalties requires significant estimates to be made by the Company, there can be no assurance that the Company will accurately predict the outcomes of these audits, and thus the eventual outcomes could have a material impact on the Company’s operating results or financial condition.\nAccounting for contingencies, including those matters described in Note 19 to the consolidated financial statements, is highly subjective and requires the use of judgments and estimates in assessing their magnitude and likely outcome. In many cases, the outcomes of such matters will be determined by third parties, including governmental or judicial bodies. The provisions made in the consolidated financial statements, as well as the related disclosures, represent management’s best estimates of the current status of such matters and their potential outcome based on a review of the facts and in consultation with outside legal counsel where deemed appropriate. The Company regularly reviews contingencies and as new information becomes available may, in the future, adjust its associated liabilities.\nFor claims, litigation and proceedings and governmental investigations and inquiries not related to income taxes, the Company records liabilities in the consolidated financial statements when it is both probable that a liability has been incurred and the amount of loss can be reasonably estimated and periodically adjusts these as appropriate. When the reasonable estimate of the loss is within a range of amounts, the minimum amount of the range is accrued unless some higher amount within the range is a better estimate than another amount within the range. In instances when a loss is reasonably possible but uncertainties exist related to the probable outcome and/or the amount or range of loss, management does not record a liability but discloses the contingency if material. As additional information becomes available, the Company adjusts its assessments and estimates of such matters accordingly.\nMoody’s also discloses material pending legal proceedings pursuant to SEC rules and other pending matters as it may determine to be appropriate.\nIn view of the inherent difficulty of assessing the potential outcome of legal proceedings, governmental, regulatory and legislative investigations and inquiries, claims and litigation and similar matters and contingencies, particularly when the claimants seek large or indeterminate damages or assert novel legal theories or the matters involve a large number of parties, the Company often cannot predict what the eventual outcome of the pending matters will be or the timing of any resolution of such matters. The Company also may be unable to predict the impact (if any) that any such matters may have on how its business is conducted, on its competitive position or on its financial position, results of operations or cash flows. As the process to resolve any pending matters progresses, management will continue to review the latest information available and assess its ability to predict the outcome of such matters and the effects, if any, on its operations and financial condition and to accrue for and disclose such matters as and when required. However, because such matters are inherently unpredictable and unfavorable developments or resolutions can occur, the ultimate outcome of such matters, including the amount of any loss, may differ from those estimates.\nPension and Other Retirement Benefits\nThe expenses, assets and liabilities that Moody’s reports for its Retirement Plans a",
  "item2_clean": null
}