{
  "source_file": "mdlz-20250930.htm",
  "form_type": "10-Q",
  "item1_clean": null,
  "item7_clean": null,
  "item2_clean": "Item 2. Management’s Discussion and Analysis of Financial Condition and Results of Operations.\nOverview of Business and Strategy\nOur core business is making and selling chocolate, biscuits and baked snacks, with additional businesses in adjacent, locally relevant categories including gum & candy, cheese & grocery and powdered beverages around the world.\nWe aim to be the global leader in snacking. Our strategy is to drive long-term growth by focusing on four strategic priorities: accelerating consumer-centric growth, driving operational excellence, creating a winning growth culture and scaling sustainable snacking. We believe the successful implementation of our strategic priorities and leveraging of our attractive global footprint, strong core of iconic global and local brands, marketing, sales, distribution and cost excellence capabilities, and top talent with a growth mindset, will drive consistent top- and bottom-line growth, enabling us to continue to create long-term value for our shareholders.\nRecent Developments and Significant Items\nMacroeconomic environment\nWe continue to observe significant market and geopolitical uncertainty, fluctuating consumer demand, inflationary pressures, supply constraints, trade and regulatory uncertainty and exchange rate volatility. As a result, we experienced significantly higher operating costs, including higher overall raw material, labor and energy costs that have continued to rise. In particular, while we expect cocoa costs to be lower in 2026 compared to the current year, we expect to continue to face elevated cocoa costs as compared to historical levels in the near- and medium-term. Refer to\nfor additional information.\nOur overall outlook for future snacks revenue growth remains strong; however, we anticipate ongoing volatility. While we have responded to elevated raw material costs with pricing increases for certain of our products, the elasticity impacts from those pricing increases has adversely impacted consumer demand, particularly in the United States and Europe. We will continue to proactively manage our business in response to the evolving global economic environment, related uncertainty and business risks while also prioritizing and supporting our employees and customers. We continue to take steps to mitigate impacts to our supply chain, operations, technology and assets.\nTrade and Regulatory Uncertainty\nWe are subject to risks from changes to the trade policies and tariff and import/export regulations by the U.S. and/or other foreign governments.\nIn February 2022, following the Russian military invasion of Ukraine, we stopped production and closed our facilities in Ukraine; since then, we have taken steps to protect the safety of our employees and to restore operations at our\ntwo manufacturing facilities, which were significantly damaged in March 2022. Refer to\nItems Affecting Comparability of Financial Results\nfor additional information.\nWe have suspended new capital investments and our advertising spending in Russia, but as a food company with more than 2,500 employees in the country, we have not ceased operations because we believe that we play a role in the continuity of the food supply. We continue to evaluate the situation in Ukraine and Russia and our ability to control our operating activities and businesses on an ongoing basis and comply with applicable international sanctions. We continue to consolidate both our Ukrainian and Russian subsidiaries. During the third quarter of 2025, Ukraine generated 0.4% and Russia generated 3.7% of our consolidated net revenue and during the third quarter of 2024, Ukraine generated 0.4% and Russia generated 2.9% of our consolidated net revenue. The profitability of and the assets held by our Russian business continue to remain above historic levels. We cannot predict if the recent strength in our Russian business will continue in the future.\nThe war in Ukraine has impacted and could continue to impact our business operations, financial performance and results of operations.\nDevelopments in the Middle East\nIn October 2023, conflict developed in the Middle East between Hamas and Israel, and has expanded to other parts of the region. Throughout 2024 and thus far in 2025, we experienced limited adverse sales impacts related to this conflict in certain AMEA markets, but this did not have a material impact on our business, results of operations or financial condition. We continue to evaluate the impacts of these developments, including ongoing geopolitical discussions, on our business and we cannot predict if the conflict will have a significant impact in the future.\nExtreme Price Growth in Argentina and Other Currency-Related Items\nDuring December 2023, the Argentinean peso significantly devalued. The peso's devaluation and potential resulting distortion on our non-GAAP Organic Net Revenue, Organic Net Revenue growth and other constant currency growth rate measures resulted in our decision to exclude the impact of pricing increases in excess of 26% year-over-year (\"extreme pricing\") in Argentina, from these measures beginning in the first quarter of 2024. The benchmark of 26% represents the minimum annual inflation rate for each year over a 3-year period which would result in a cumulative inflation rate in excess of 100%, the level at which an economy is considered hyperinflationary under U.S. GAAP. Throughout the following MD&A discussion, we exclude the impact of extreme pricing in Argentina from the net pricing impact of Organic Net Revenue and Organic Net Revenue growth and its related impact on our other non-GAAP financial constant currency growth measures. Additionally within this MD&A discussion, \"currency-related items\" reflect the impacts of extreme pricing and year-over-year currency translation rate changes. Refer to\nNon-GAAP financial measures\nfor additional information.\nCurrency-related items impacted our non-GAAP financial measures for the three months ended September 30, 2025 as follows:\nOrganic Net Revenue: In the third quarter of 2025, favorable currency-related items of $137 million (1.5 pp) were driven by favorable currency translation rate changes of $134 million (1.5 pp) and extreme pricing of $3 million (— pp). In Emerging Markets, favorable currency-related items of $14 million (0.4 pp) were driven by favorable currency translation rate changes of $11 million (0.3 pp) and extreme pricing of $3 million (0.1 pp). In Developed Markets, favorable currency-related items of $123 million (2.1 pp) were driven by favorable currency translation rate changes.\nAdjusted Operating Income: In the third quarter of 2025, favorable currency-related items of $15 million were driven by favorable currency translation rate changes of $15 million, as extreme pricing had an immaterial impact.\nAdjusted EPS: In the third quarter of 2025, favorable currency-related items of $0.01 were driven by favorable currency translation rate changes, as extreme pricing had an immaterial impact.\nCurrency-related items impacted our non-GAAP financial measures for the nine months ended September 30, 2025 as follows:\nOrganic Net Revenue: In the first nine months of 2025, unfavorable currency-related items of $137 million (0.5 pp) were driven by unfavorable currency translation rate changes of $186 million (0.7 pp), partially offset by extreme pricing of $49 million (0.2 pp). In Emerging Markets, unfavorable currency-related items of $296 million (2.8 pp) were driven by unfavorable currency translation rate changes of $345 million (3.2 pp), partially offset by extreme pricing of 49 million (0.4 pp). In Developed Markets, favorable currency-related items of 159 million (1.0 pp) were driven by favorable currency translation rate changes.\nAdjusted Operating Income: In the first nine months of 2025, favorable currency-related items of $18 million were driven by favorable currency translation rate changes of $10 million and the impact of extreme pricing of $8 million.\nAdjusted EPS: In the first nine months of 2025, favorable currency-related items of $0.02 were driven by favorable currency translation rate changes of $0.01 and extreme pricing of $0.01.\nERP System Implementation\nIn July 2024, our Board of Directors approved funding of $1.2 billion for a multi-year systems transformation program to upgrade our global ERP and supply chain systems (the “ERP System Implementation”). ERP System Implementation spending comprises both capital expenditures and operating expenses, of which a majority is expected to relate to operating expenses. The operating expenses associated with the ERP System Implementation represent incremental transformational costs above the normal ongoing level of spending on information technology to support operations. The ERP System Implementation program will be implemented by region in several phases with spending occurring over the next four years, with expected completion by year-end 2028. Refer to\nNon-GAAP financial measures\nfor additional information.\nAcquisitions and Divestitures\nDuring the fourth quarter of 2024\n, we completed the acquisition of Evirth (Shanghai)\nIndustrial Co., Ltd, a leading manufacturer of cakes and pastries in China.\nAcquisitions and Divestitures\n, for additional details.\nEquity Method Investment Transactions\nJDE Peet’s Transactions (Euronext Amsterdam: “JDEP”)\nDuring the first quarter of 2024, we recorded an impairment charge of €612 million ($665 million) related to our JDEP investment. During the fourth quarter of 2024, we sold our remaining 85.9 million shares to JAB Holding Company.\nOn August 24, 2025, Keurig Dr Pepper Inc. (“KDP”) and JDEP entered into a definitive agreement under which KDP will acquire JDEP. As a result of that definitive agreement, we became entitled to a cash payment of €145 million ($169 million) from JAB that we received in the third quarter of 2025.\nFor additional information, refer to Note 6,\nEquity Method Investments.\nMondelēz Global and Canada Retirement Plan Sett"
}