{
  "source_file": "mdt-20250425.htm",
  "form_type": "10-K",
  "item1_clean": "Products to treat a variety of conditions affecting the spine, including degenerative disc disease, spinal deformity, spinal tumors, fractures of the spine, and stenosis. These products include our CATALYFT PL expandable interbody spacers, CD Horizon ModuLeX spinal system, and T2 STRATOSPHERE expandable corpectomy system. These products can also include titanium interbody implants and surface technologies, such as our Adaptix interbody system and incorporated Titan interbody fusion device with nanoLOCK technology.\nProducts that facilitate less invasive thoracolumbar surgeries, including the CD Horizon Solera Voyager percutaneous fixation system and various retractor systems to access the spine through smaller incisions.\nProducts to treat conditions in the cervical region of the spine, including the ZEVO anterior cervical plate system, the Infinity Occipitocervical-Upper Thoracic (OCT) System, and Prestige LP cervical discs.\nBiologic solutions products, including our Infuse Bone Graft (InductOs in the European Union (E.U.)), which contains a recombinant human bone morphogenetic protein-2, rhBMP-2, for certain spinal, trauma, and oral maxillofacial applications.\nDemineralized bone matrix products, including Magnifuse, GRAFTON/GRAFTON PLUS, and the Mastergraft family of synthetic bone graft products – Matrix, Putty, Strip, and Granules.\nOur Specialty Therapies division includes the following Operating Units: Neurovascular; Ear, Nose, and Throat (ENT); and Pelvic Health. The division develops, manufactures, and markets products and therapies to treat patients afflicted with acute ischemic and hemorrhagic stroke, ENT diseases, and patients suffering from overactive bladder, and (non-obstructive) urinary retention. Principal products and services offered include:\nNeurovascular products to treat diseases of the vasculature in and around the brain. This includes coils, neurovascular stent retrievers, and flow diversion products, as well as access and delivery products to support procedures. Products also include the Pipeline Flex and Pipeline Vantage embolization devices with Shield Technology, endovascular treatments for large or giant wide-necked brain aneurysms, the portfolio of Solitaire revascularization devices for treatment of acute ischemic stroke, the Riptide aspiration system, the Onyx Liquid Embolic System, and a portfolio of associated access catheters including our React aspiration catheters also for the treatment of acute ischemic stroke.\nENT products, including the Straightshot M5 microdebrider handpiece, the Integrated Power Console (IPC) system, NIM Vital nerve monitoring systems, Propel and Sinuva Sinus Implants, StealthStation ENT and StealthStation FlexENT navigation systems, as well as products for hearing restoration.\nPelvic health products, including our InterStim X and InterStim II recharge-free neurostimulators, InterStim Micro rechargeable neurostimulators, and SureScan MRI leads. Our NURO System delivers Percutaneous Tibial Neuromodulation therapy to treat overactive bladder, (non-obtrusive) urinary retention, and chronic fecal incontinence.\nOur Neuromodulation division and Operating Unit develops, manufactures, and markets spinal cord stimulation and brain modulation systems, implantable drug infusion systems for chronic pain, as well as interventional products. Principal products and services offered include:\nSpinal cord stimulation products, including rechargeable and recharge-free devices and a large selection of leads used to treat chronic back and/or limb pain and chronic pain resulting from diabetic peripheral neuropathy. This includes the Inceptiv spinal cord stimulation system which offers a closed-loop feature that senses biological signals along the spinal cord and automatically adjusts stimulation in real time, Intellis (rechargeable) and Vanta (recharge-free) spinal cord stimulation systems, with\nAdaptiveStim and SureScan MRI Technology, DTM (differential target multiplexed) proprietary waveform, and the Evolve workflow algorithm, and Snapshot reporting.\nBrain modulation products, including those for the treatment of Parkinson's disease, essential tremor, refractory epilepsy, severe, treatment-resistant obsessive-compulsive disorder (approved under a Humanitarian Device Exemption (HDE) in the U.S.), and chronic, intractable primary dystonia (approved under a HDE in the U.S.). Specifically, the Percept family of neurostimulators with proprietary adaptive BrainSense technology.\nImplantable drug infusion systems, including our SynchroMed III Implantable Infusion System, which deliver small quantities of drug directly into the intrathecal space surrounding the spinal cord, to help manage chronic pain, cancer pain, and severe spasticity.\nInterventional products, including our full Kyphon portfolio of minimally invasive Kyphoplasty and Vertebroplasty solutions for the treatment of vertebral compression fractures, including bipedicular and unipedicular access options, bone access tools, inflatable balloon tamps, cement and delivery systems, as well as biopsy and specialty devices. The OsteoCool cooled radiofrequency ablation system with simultaneous, dual-probe capabilities and algorithms for the treatment of painful metastatic bone lesions. Emprint Microwave with Thermosphere technology for the treatment of non-resectable liver tumors. As well as the Accurian nerve ablation system, which conducts radio frequency ablation of nerve tissues.\nMEDICAL SURGICAL PORTFOLIO\nThe Medical Surgical Portfolio includes the Surgical & Endoscopy and Acute Care & Monitoring divisions. Products and therapies of this group are used primarily by healthcare systems, physicians' offices, ambulatory care centers, and other alternate site healthcare providers. While less frequent, some products and therapies are also used in home settings.\nSurgical & Endoscopy\nOur Surgical & Endoscopy division includes the following Operating Units: Surgical and Endoscopy. The division develops, manufactures, and markets advanced and general surgical products, including advanced stapling devices, vessel sealing instruments, wound closure products, electrosurgery products, AI-powered surgical video and analytics platform, robotic-assisted surgery products, hernia mechanical devices, mesh implants, gynecology products, minimally invasive gastrointestinal and hepatologic diagnostics and therapies, and therapies to treat diseases and conditions that are typically, but not exclusively, addressed by surgeons. Principal products and services offered include:\nAdvanced stapling and energy products, including the Tri-Staple technology platform for endoscopic stapling, including the Endo GIA reloads and reinforced reloads with Tri-Staple technology and the Endo GIA ultra universal stapler, the Signia powered stapling system, the LigaSure exact dissector and L-Hook Laparoscopic Sealer/Divider, and the Sonicision 7 curved jaw cordless ultrasonic dissection system.\nElectrosurgical hardware and instruments, including the Valleylab FT10 and FX8 energy platforms, the Valleylab FT10 vessel sealing generator, and the Force TriVerse electrosurgical pencils.\nRobotic and digital surgery technologies, including the Hugo robotic-assisted surgery (RAS) system designed for a broad range of soft-tissue procedures, and Touch Surgery Enterprise, an AI-powered surgical video management solution for the operating room.\nProducts designed for the treatment of hernias, including the AbsorbaTack absorbable mesh fixation device for hernia repair, MaxTack motorized fixation device designed for minimally invasive hernia fixation, the Symbotex composite mesh for surgical laparoscopic and open ventral hernia repair, and ProGrip laparoscopic self-fixating mesh, a self-gripping, biocompatible solution for inguinal hernias.\nSuture and wound closure products, including the V-Loc barbed sutures, the Polysorb braided absorbable sutures, and the Monosof absorbable monofilament nylon sutures.\nEndoscopy products, including the GI Genius intelligent endoscopy module, the PillCam capsule endoscopy systems, the Bravo calibration-free reflux testing systems, the Endoflip 300 Impedance Planimetry System, the Emprint ablation system with Thermosphere Technology, the ManoScan high-resolution manometry system, the Barrx platform through ablation with the Barrx 360 Express catheter, the Cool-tip radiofrequency ablation system, the Beacon delivery system, and the Nexpowder endoscopic hemostasis system.\nAcute Care & Monitoring\nOur Acute Care & Monitoring division develops, manufactures, and markets products in the fields of patient monitoring and airway management. Principal products and services offered include:\nProducts focused on blood oxygen management and remote monitoring, including Nellcor pulse oximetry monitors and sensors, Healthcast Connectivity Solutions, and the RespArray patient monitor.\nProducts focused on reducing perioperative complications, including Bispectral Index (BIS) brain monitoring technology, INVOS cerebral/somatic oximetry systems, and WarmTouch convective warming.\nProducts focused on airway management and respiratory monitoring, including Microstream capnography monitors, McGRATH MAC video laryngoscopes, Shiley endotracheal tubes, Shiley tracheostomy tubes, and DAR Breathing Systems.\nDIABETES OPERATING UNIT\nThe Diabetes Operating Unit develops, manufactures, and markets products and services for the management of Type 1 and Type 2 diabetes. The primary medical specialists who use and/or prescribe our Diabetes products are endocrinologists and primary care physicians.\nPrincipal products and services offered include:\nInsulin pumps and consumables, including the MiniMed 780G system, powered by SmartGuard technology. The MiniMed 780G system provides smartphone and Bluetooth connectivity, a meal-time detection system, an adjustable glucose target down to 100 mg/dl, and has the capability to continuously deliver background insulin and monitor sugar levels.\nContinuous glucose monitoring (CGM) systems include the Guardian Connect CGM system and Simplera platform. Both systems are worn by patients capturing glucose data to reveal patterns and potential problems, such as hyperglycemic and hypoglycemic episodes. The Simplera platform's discreet design simplifies the insertion and wear experience through the integration of the Simplera CGM, as a Smart Multiple Daily Injections (MDI) system, and the InPen with the Simplera Sync sensor and the MiniMed 780G system, offering disposable capabilities.\nThe InPen smart insulin pen system combines a reusable Bluetooth-enabled insulin pen with an intuitive mobile app that helps users administer the appropriate insulin dose. The InPen application integrates with our CGM data to provide real-time CGM readings alongside insulin dose information.\nIn May 2025, we announced our intention to separate the Diabetes business, with the intention to create a new independent, publicly traded company. The separation is expected to be completed within 18 months of the initial announcement.\nHUMAN CAPITAL\nMedtronic Workforce Overview\nMedtronic’s employees deliver on our Mission every day. We empower insight-driven care, experiences that put people first, and better outcomes for our world. In everything we do, we are engineering the extraordinary. We strive to be the employer of choice for the best and brightest global talent, where employees can grow and develop fulfilling careers. We aspire to create an inclusive, diverse, and equitable workplace that fosters innovation and creativity, and where employees feel a sense of belonging and well-being. Medtronic has over 95,000 full-time employees, of which 44% are based in the U.S. or Puerto Rico.\nWe believe that improving health for people from all walks of life depends on our ability to unleash the creative power of our global employees. By breaking down barriers, we open doors for everyone, driving opportunity, progress, and prosperity around the world. O",
  "item7_clean": "Contingent consideration\nIncludes commitments related to the funding of minority investments, estimated milestone payments, and royalty obligations. While it is not certain if and/or when payments will be made, the maturity dates included in the table reflect our best estimates.\nIncludes inventory purchase commitments, research and development, and other arrangements that are legally binding and specify minimum purchase quantities or spending amounts. These purchase commitments do not exceed our projected requirements and are in the normal course of business. Excludes open purchase orders with a remaining term of less than one year.\nIncludes the fair value of our current and non-current portions of contingent consideration. While it is not certain if and/or when payments will be made, the maturity dates included in this table reflect our best estimates.\nRepresents the tax obligations associated with the transition tax that resulted from U.S. Tax Reform. The transition tax will be paid over an eight-year period and will not accrue interest.\nIn the normal course of business, we periodically enter into agreements that require us to indemnify customers or suppliers for specific risks, such as claims for injury or property damage arising as a result of our products or the negligence of our personnel or claims alleging that our products infringe third-party patents or other intellectual property. Our maximum exposure under these indemnification provisions is unable to be estimated, and we have not accrued any liabilities within our consolidated financial statements or included any indemnification provisions in the table above. Historically, we have not experienced significant losses on these types of indemnification agreements.\nWe record tax liabilities in our consolidated financial statements for amounts that we expect to repatriate from subsidiaries (to the extent the repatriation would be subject to tax); however, no tax liabilities are recorded for amounts we consider to be permanently reinvested. We expect to have access to the majority of our cash flows in the future. In addition, we continue to evaluate our legal entity structure supporting our business operations, and to the extent such evaluation results in a change to our overall business structure, we may be required to accrue for additional tax obligations.\nBeyond the contractual obligations and other minimum commercial commitments outlined above, we have recurring cash requirements arising from the normal operation of our business that include capital expenditures, research and developments costs, and other operational costs.\nWe believe our balance sheet and liquidity provide us with flexibility, and our cash, cash equivalents, current investments, Credit Facility and related commercial paper programs, as well as our ability to generate operating cash flows, will satisfy our current and future contractual obligations and cash requirements. We regularly review our capital needs and consider various investing and financing alternatives to support our requirements.\nACQUISITIONS AND DISPOSITIONS\nCRITICAL ACCOUNTING ESTIMATES\nThe preparation of the consolidated financial statements, in conformity with U.S. GAAP, requires us to use judgment in making estimates and assumptions that affect the reported amounts of assets, liabilities, revenues, and expenses. These estimates reflect our best judgment about economic and market conditions and the potential effects on the valuation and/or carrying value of assets and liabilities based upon relevant information available. We base our estimates on historical experience and on various assumptions that are believed to be reasonable under the circumstances, the results of which form the basis for making judgments about the carrying values of assets and liabilities that are not readily apparent from other sources.\nOur critical accounting estimates include the following:\nRevenue recognition on our products varies depending on the amount of consideration we ultimately receive due to return terms, sales rebates, chargebacks, discounts, and other incentives, which are accounted for as variable consideration. The estimate of variable consideration for rebates and distributor chargebacks is considered critical due to the materiality of the balances and use of estimates. Estimates for rebates are based on sales terms, historical experience, and trend analysis. The Company considers the lag time between the point of sale and payment of the rebate claim, the stated rebate rates, and other relevant information to estimate rebates.\nRevenue adjustments related to distributor chargebacks are the difference between distributor sales price and the end-customer negotiated price. A provision for outstanding chargebacks is recorded when we recognize revenue from our sale to the distributor and requires estimates for the distributor chargeback rate, expected sell-through levels by the distributors to contracted customers, as well as estimated distributor inventory levels.\nAt April 25, 2025 and April 26, 2024, there were $1.7 billion and $1.6 billion of rebates and chargebacks recorded in the consolidated balance sheets, respectively. During fiscal year 2025, adjustments to rebate and chargebacks recorded in prior periods were not material.\nLitigation Contingencies\nWe are involved in a number of legal actions from time to time involving product liability, employment, intellectual property and commercial disputes, shareholder-related matters, environmental proceedings, tax disputes, and governmental proceedings and investigations. The outcomes of legal actions are not within the Company's complete control and may not be known for prolonged periods of time. In some actions, the enforcement agencies or private claimants seek damages, as well as other civil or criminal remedies (including injunctions barring the sale of products that are the subject of the proceeding), that could require significant expenditures, result in lost revenues, or limit the Company's ability to conduct business in the applicable jurisdictions. Estimating probable losses from our litigation and governmental proceedings is inherently difficult, particularly when the matters are in early procedural stages, with incomplete scientific facts or legal discovery, involve unsubstantiated or indeterminate claims for damages, potentially involve penalties, fines, or punitive damages, or could result in a change in business practice. We base our judgments on the best information\nWe establish reserves when, despite our belief that our tax return positions are fully supportable, we believe that certain positions are likely to be challenged and that we may or may not prevail. Under U.S. GAAP, if we determine that a tax position is more likely than not of being sustained upon audit, based solely on the technical merits of the position, we recognize the benefit. We measure the benefit by determining the amount that is greater than 50 percent likely of being realized upon settlement. We presume that all tax positions will be examined by a taxing authority with full knowledge of all relevant information. The calculation of our tax liabilities involves dealing with uncertainties in the application of complex tax regulations in a multitude of jurisdictions across our global operations. We regularly monitor our tax positions and tax liabilities. We reevaluate the technical merits of our tax positions and recognize an uncertain tax benefit, or derecognize a previously recorded tax benefit, when there is (i) a completion of a tax audit, (ii) effective settlement of an issue, (iii) a change in applicable tax law including a tax case or legislative guidance, or (iv) the expiration of the applicable statute of limitations. These reserves are subject to a high degree of estimation and management judgment. Although we believe that we have adequately reserved for liabilities resulting from tax assessments by taxing authorities, positions taken by these tax authorities could have a material impact on our effective tax rate, consolidated earnings, financial position, and/or cash flows.\nValuation of Intangible Assets and Goodwill\nWhen we acquire a business, the assets acquired and liabilities assumed are recorded at their respective fair values at the acquisition date. Goodwill is the excess of the purchase price over the estimated fair value of identified net assets of acquired businesses. Intangible assets primarily include patents, trademarks, tradenames, customer relationships, purchased technology, and in-process research and development. Determining the fair value of intangible assets acquired as part of a business combination requires us to make significant estimates. These estimates include the amount and timing of projected future cash flows of each project or technology, the discount rate used to discount those cash flows to present value, and the assessment of the asset’s life cycle. The estimates could be impacted by legal, technical, regulatory, economic, and competitive risks.\nWe have four goodwill reporting units with goodwill assigned to them. We assess the impairment of goodwill at the reporting unit level annually as of the first day of the third quarter and whenever an event occurs or circumstances change that would indicate that the carrying amount may be impaired. The test for impairment of goodwill requires us to make several estimates related to projected future cash flows to determine the fair value of the goodwill reporting units. We estimated the fair value of these reporting units using the income and the market approaches, weighted 50 percent each. Fair value under the income approach was determined by discounting to present value the estimated future cash flows of the reporting unit. Fair value under the market approach utilized revenue and earnings multiples using comparable public company information, which uses valuation indicators determined from other businesses that are similar to our reporting unit. We use estimates that are consistent with the highest and best use of the assets based on a market participant's view of the assets being evaluated.\nThe most critical assumptions used in the calculation of the fair value of each reporting unit are the projected revenue, projected earnings, projected future cash flows, and discount rate. Our forecast of future cash flows is based on estimates of projected revenue and projected earnings, based primarily on pricing, raw material costs, market share, industry outlook, general economic conditions and strategic actions to improve our earnings. The fair value of the reporting unit’s goodwill is sensitive to differences between estimated and actual cash flows, including changes in the projected revenue, projected earnings, and discount rate used to evaluate the fair value of the reporting unit.\nThe following table highlights the sensitivities of the most critical assumptions used in the goodwill impairment test as of the date of our annual testing:\nApproximate % by which the fair value exceeds the carrying value based on annual impairment test\nApproximate % by which the fair value exceeds the carrying value if the discount rate was to increase 1%\nApproximate % by which the fair value exceeds the carrying value if the future cash flows in the income approach and revenue and earnings in the market approach were to decrease by 5%\nAlthough we believe our estimate of fair value is reasonable, actual results may differ from our estimates due to a number of factors including, among others, changes in competitive conditions, timing of regulatory approval, results of clinical trials, changes in worldwide economic conditions, and fluctuations in currency exchange rates.\nNEW ACCOUNTING PRONOUNCEMENTS\nSUPPLEMENTAL GUARANTOR FINANCIAL INFORMATION\nMedtronic plc and Medtronic Global Holdings S.C.A. (Medtronic Luxco), a wholly-owned subsidiary guarantor, each have provided full and unconditional guarantees of the obligations of Medtronic, Inc., a wholly-owned subsidiary issuer, under the Senior Notes (Medtronic Senior Notes) and full and unconditional guarantees of the obligations of Covidien International Finance S.A. (CIFSA), a wholly-owned subsidiary issuer, under the Senior Notes (CIFSA Senior Notes). The guarantees of the CIFSA Senior Notes are in addition to the guarantees of the CIFSA Senior Notes by Covidien Ltd. and Covidien Group Holdings Ltd., both of which are wholly-owned subsidiary guarantors of the CIFSA Senior Notes. Medtronic plc and Medtronic, Inc. each have provided a full and unconditional guarantee of the obligations of Medtronic Luxco under the Senior Notes (Medtronic Luxco Senior Notes). The following is a summary of these guarantees:\nGuarantees of Medtronic Senior Notes\nParent Company Guarantor - Medtronic plc\nSubsidiary Issuer - Medtronic, Inc.\nSubsidiary Guarantor - Medtronic Luxco\nGuarantees of Medtronic Luxco Senior Notes\nParent Company Guarantor - Medtronic plc\nSubsidiary Issuer - Medtronic Luxco\nSubsidiary Guarantor - Medtronic, Inc.\nGuarantees of CIFSA Senior Notes\nParent Company Guarantor - Medtronic plc\nSubsidiary Issuer - CIFSA\nSubsidiary Guarantors - Medtronic Luxco, Covidien Ltd., and Covidien Group Holdings Ltd. (CIFSA Subsidiary Guarantors)\nThe following tables present summarized financial information for the fiscal year ended April 25, 2025 for the obligor groups of Medtronic and Medtronic Luxco Senior Notes, and CIFSA Senior Notes. The obligor group consists of the parent company guarantor, subsidiary issuer, and subsidiary guarantors for the applicable senior notes. The summarized financial information is presented after elimination of (i) intercompany transactions and balances among the guarantors and issuers and (ii) equity in earnings from and investments in any subsidiary that is a non-guarantor or issuer.\nThe summarized results of operations information for the fiscal year ended April 25, 2025 was as follows:\nMedtronic & Medtronic Luxco Senior Notes\nLoss before income taxes\nNet loss attributable to Medtronic\nThe summarized balance sheet information for the fiscal year ended April 25, 2025 was as follows:\nMedtronic & Medtronic Luxco Senior Notes\nTotal current assets\nTotal noncurrent assets\nTotal current liabilities\nTotal noncurrent liabilities\nNoncontrolling interests\nThe Medtronic Senior Notes and Medtronic Luxco Senior Notes obligor group consists of the following entities: Medtronic plc, Medtronic Luxco, and Medtronic, Inc. Refer to the guarantee summary above for further details.\nThe CIFSA Senior Notes obligor group consists of the following entities: Medtronic plc, Medtronic Luxco, CIFSA, and CIFSA Subsidiary Guarantors. Refer to the guarantee summary above for further details.\nIncludes receivables due from non-guarantor subsidiaries of $14.2 billion and $1.3 billion for Medtronic & Medtronic Luxco Senior Notes, and CIFSA Senior Notes, respectively.\nIncludes loans receivable due from non-guarantor subsidiaries of $5.2 billion and $5.2 billion for Medtronic & Medtronic Luxco Senior Notes, and CIFSA Senior Notes, respectively.\nIncludes payables due to non-guarantor subsidiaries of $16.0 billion and $4.6 billion for Medtronic & Medtronic Luxco Senior Notes, and CIFSA Senior Notes, respectively.\nIncludes loans payable due to non-guarantor subsidiaries of $11.3 billion and $7.7 billion for Medtronic & Medtronic Luxco Senior Notes, and CIFSA Senior Notes, respectively.\n\nFiscal year ended April 26, 2024\n(in millions, except per share data)\nIncome Before Income Taxes\nIncome Tax Provision (Benefit)\nNet Income Attributable to Medtronic\nGAAP\nNon-GAAP Adjustments:\nAmortization of intangible assets\nRestructuring and associated costs\nAcquisition and divestiture-related items\nCertain litigation charges, net\n(Gain)/loss on minority investments\nMedical device regulations\nCertain tax adjustments, net\nThe Company recognized $151 million of accelerated amortization on certain intangible assets re",
  "item2_clean": null
}