{
  "source_file": "met-20250930.htm",
  "form_type": "10-Q",
  "item1_clean": null,
  "item7_clean": null,
  "item2_clean": "Accounting Pronouncements\nNon-GAAP and Other Financial Disclosures\nForward-Looking Statements and Other Financial Information\nThis Management’s Discussion and Analysis of Financial Condition and Results of Operations may contain or incorporate by reference information that includes or is based upon forward-looking statements within the meaning of the Private Securities Litigation Reform Act of 1995. See “Note Regarding Forward-Looking Statements” for cautionary language regarding forward-looking statements.\nThis Management’s Discussion and Analysis of Financial Condition and Results of Operations includes references to our performance measures, adjusted earnings and adjusted earnings available to common shareholders, that are not based on accounting principles generally accepted in the United States of America (“GAAP”). See “— Non-GAAP and Other Financial Disclosures” for definitions and a discussion of these and other financial measures, and “— Results of Operations” and “— Investments” for reconciliations of historical non-GAAP financial measures to the most directly comparable GAAP measures.\nWe continue to be impacted by the changing global financial and economic environment that has been affecting the industry.\nFinancial and Economic Environment\nOur business and results of operations are materially affected by conditions in the global financial markets and the economy generally due to our market presence in numerous countries, our large investment portfolio and the sensitivity of our insurance liabilities and derivatives to changing market factors.\nGovernments and central banks around the world use fiscal and monetary policies to address uncertain economic conditions. In the United States (“U.S.”), citing growing concerns over the labor market, the Federal Open Market Committee recently cut interest rates. Future policy adjustments could be affected by the U.S. government shutdown. Other central banks have recently held rates steady but are signaling caution as they assess the implications of changing global trade policies on growth and inflation. We are closely monitoring these and other political and economic conditions that might contribute to global market volatility and impact our business operations, investment portfolio and derivatives, such as global inflation, supply chain disruptions, acts of war, banking sector volatility and employment and work policies of the federal government. We are also monitoring the imposition of tariffs, sanctions or other barriers to international trade, changes to international trade agreements, and their potential impacts on our business, results of operations and financial condition. See “— Investments — Current Environment,” as well as “Management’s Discussion and Analysis of Financial Condition and Results of Operations — Industry Trends — Impact of Market Interest Rates — Effects of Inflation” in the 2024 Annual Report.\nImpact of Market Interest Rates\nMarket interest rates are a key driver of our results. Increases and decreases in such rates, as well as extended periods of stagnation, may impact our business and investments in various ways. For a discussion of the potential impact of low and rising interest rates, and inflation, as well as management actions taken in response to the changing U.S. interest rate environment, see “Management’s Discussion and Analysis of Financial Condition and Results of Operations — Industry Trends — Impact of Market Interest Rates” and “Risk Factors — Economic Environment and Capital Markets Risks” included in the 2024 Annual Report.\nCompetitive Pressures\nSee “Business — Competition” and “Management’s Discussion and Analysis of Financial Condition and Results of Operations — Industry Trends — Competitive Pressures” in the 2024 Annual Report for information on our competitive position.\nRegulatory Developments\nThe following discussion on regulatory developments should be read in conjunction with “Business — Regulation” and “Management’s Discussion and Analysis of Financial Condition and Results of Operations — Industry Trends — Regulatory Developments” included in the 2024 Annual Report, as amended or supplemented.\nState Insurance Regulation\nIn 2023, the National Association of Insurance Commissioners (“NAIC”) adopted an interim solution with regard to the treatment of an insurer’s negative interest maintenance reserve (“IMR”) balance, which may occur in a rising interest rate environment and can impact how accurately the insurer’s surplus and financial strength are captured in its statutory financial statements due to lower surplus and risk-based capital (“RBC”) ratios. In August 2025, the NAIC extended its interim statutory accounting guidance to be effective until December 31, 2026, which permits an insurer with a company action level RBC ratio greater than 150% (or an authorized control level RBC ratio greater than 300%) to admit negative IMR for an amount up to 10% of its general account capital and surplus, subject to certain restrictions and reporting obligations. These interim changes had an immaterial impact on our RBC. The NAIC is developing a long-term solution for the accounting treatment of negative IMR.\nIn August 2025, the NAIC adopted a principle-based reserving (“PBR”) framework for non-variable annuities, located in Section VM-22 of the NAIC Valuation Manual (“VM”), similar to Section VM-20 for life insurance business and Section VM-21 for variable annuities. The framework for non-variable annuities applies to new issues for valuation dates on or after January 1, 2026, and companies have a three-year optional implementation period before Section VM-22 PBR requirements become mandatory to all applicable blocks of business. The ultimate financial impact from PBR on MetLife is uncertain.\nCertain Non-U.S. Regulation\nIn October 2025, the tax law in Mexico was revised to no longer allow the value-added tax deduction of certain insurance claims-related expenses, including health insurance claims. We expect the value-added tax change to result in a reduction in Latin America’s adjusted earnings of approximately $50 million to $60 million in 2026, with little to no impact in 2027 and beyond. See “— Results of Operations — Segment Results and Corporate & Other — Latin America” for information on the current period notable item related to this industry-wide value-added tax matter.\nStandards of Conduct, ERISA, Fiduciary Considerations, and Other Pension and Retirement Regulation\nIn March 2025, Chile enacted the pension reform bill approved by the Chilean Congress in January 2025. This reform introduces structural changes to the pension system, including mandatory bidding of 10% of pension fund administrator customer portfolios every two years beginning in 2028 and the creation of a state-owned entity to manage new pay-as-you-go-contributions. The impact of this reform on our Chilean pension business continues to be evaluated, and will depend on specific regulations that are expected to be issued during the next two years.\nManagement of Climate Risk and ESG\nIn March 2025, the SEC voted to end its defense of final rules that it had adopted in March 2024 requiring registrants to provide additional climate-related information in their registration statements and annual reports, including in their financial statements.\nDerivatives Regulation and Clearing of Treasury Securities\nIn 2023, the SEC adopted rules to require that covered clearing agencies have policies and procedures reasonably designed to require every direct participant of the agency to submit for clearing eligible secondary market transactions in U.S. Treasury securities. Following a February 25, 2025 extension by the SEC, the rule effectively requires such participants to clear eligible cash transactions in U.S. Treasury securities beginning on December 31, 2026, and clear eligible repurchase and reverse repurchase transactions in U.S. Treasury securities beginning on June 30, 2027. As a result, certain transactions between such participants and us will be required to be cleared. The rule’s potential effect on the U.S. Treasury markets is uncertain.\nSummary of Critical Accounting Estimates\nThe preparation of financial statements in conformity with GAAP requires management to adopt accounting policies and make estimates and assumptions that affect amounts reported on the interim condensed consolidated financial statements. The most critical estimates include those used in determining:\nfuture policy benefit liabilities, market risk benefits (“MRBs”) and the accounting for reinsurance;\nestimated fair values of investments in the absence of quoted market values;\ninvestment allowance for credit loss (“ACL”) and impairments;\nestimated fair values of freestanding derivatives;\nmeasurement of goodwill and related impairment;\nmeasurement of employee benefit plan liabilities;\nmeasurement of income taxes and the valuation of deferred tax assets; and\nliabilities for litigation and regulatory matters.\nIn addition, the application of acquisition accounting requires the use of estimation techniques in determining the estimated fair values of assets acquired and liabilities assumed — the most significant of which relate to the aforementioned critical accounting estimates. In applying these policies and estimates, management makes subjective and complex judgments that frequently require assumptions about matters that are inherently uncertain. Many of these policies, estimates and related judgments are common in the insurance and financial services industries; others are specific to our business and operations. Actual results could differ from these estimates.\nThe Company’s critical accounting estimates are described in “Management’s Discussion and Analysis of Financial Condition and Results of Operations — Summary of Critical Accounting Estimates” and\nof the Notes to the Consolidated Financial Statements in the 2024 Annual Report.\nGoodwill is tested for impairment at least annually or"
}