{
  "source_file": "meta-20241231.htm",
  "form_type": "10-K",
  "item1_clean": "Our mission is to build the future of human connection and the technology that makes it possible.\nWe build technology that helps people connect and share, find and build communities, and grow businesses. Our products enable people to connect and share with friends and family through mobile devices, personal computers, virtual reality (VR) and mixed reality (MR) headsets, augmented reality (AR), and wearables. We also help people discover and learn about what is going on in the world around them, enable people to share their experiences, ideas, photos, videos, and other content with audiences ranging from their closest family members and friends to the public at large, and stay connected everywhere by accessing our products. Meta is moving our offerings beyond 2D screens toward immersive experiences like augmented, mixed, and virtual reality to help build the next computing platform. Our vision does not center on any single product, but rather an entire ecosystem of experiences, devices, and new technologies. While the metaverse is in the very early stages of its development, we believe it will become the next computing platform and the future of social interaction.\nAcross our work, we are innovating in artificial intelligence (AI) technologies to build new experiences that help make our platform more social, useful, and immersive. Our AI investments support initiatives across our products and services, helping power the systems that rank content in our apps, our discovery engine that recommends relevant content, the tools advertisers use to reach customers, the development of new generative AI experiences, and the tools that make our product development more efficient and productive. For example, Meta AI is an assistant that's available across our apps, on Ray-Ban Meta AI glasses and on the web. It's designed to help people learn, get things done, create content, and connect with others to make the most of every moment.\nWe report financial results for two segments: Family of Apps (FoA) and Reality Labs (RL). Currently, we generate substantially all of our revenue from selling advertising placements on our family of apps to marketers, which is reflected in FoA. Ads on our platform enable marketers to reach people across a range of marketing objectives, such as generating leads or driving awareness. Marketers purchase ads that can appear in multiple places including on Facebook, Instagram, Messenger, and third-party applications and websites. RL generates revenue from sales of consumer hardware products, software, and content.\nWe invest in our business based on our company priorities. In 2025, we intend to focus on several key investment areas: generative AI, our discovery engine, the metaverse and wearables, Threads, monetization of our products and services, platform integrity and community support, and infrastructure capacity.\nThe majority of our investments are directed toward developing our family of apps. In 2024, 79% of our total costs and expenses were recognized in FoA and 21% were recognized in RL. Our FoA investments were $75.25 billion in 2024 and include expenses relating to headcount, data centers and technical infrastructure as part of our efforts to develop our apps and our advertising services. We are also making significant investments in our metaverse and wearables efforts. This includes developing virtual, mixed, and augmented reality devices, software for social platforms, neural interfaces, and other foundational technologies. Our total RL investments were $19.88 billion in 2024 and include expenses relating to headcount and technology development across these efforts. These are fundamentally new technologies that we expect will evolve as the next computing platform develops, and many products may only be fully realized in the next decade. Although it is inherently difficult to predict when and how the next computing platform will develop, we expect our RL segment to continue to operate at a loss for the foreseeable future, and our ability to support our efforts to build the next computing platform is dependent on generating sufficient profits from other areas of our business. We expect this will be a complex, evolving, and long-term initiative. We are investing now because we believe this is the next chapter of the internet and will unlock monetization opportunities for businesses, developers, and creators, including around advertising, hardware, and digital goods.\nFamily of Apps Products\nFacebook helps give people the power to build community and bring the world closer together. It's a place for people to share life's moments and discuss what's happening, nurture and build relationships, discover and connect to people with shared interests, and create economic opportunity. They can do this through Feed, Reels, Stories, Groups, Marketplace, and more.\nInstagram brings people closer to the people and things they love. Instagram Feed, Stories, Reels, Live, and messaging are places where people and creators can connect and express themselves through photos, video, and private messaging, and discover and shop from their favorite businesses.\nMessenger is a simple yet powerful messaging application for people to connect with friends, family, communities, and businesses across platforms and devices through text, audio, and video calls.\nThreads is an application for text-based updates and public conversations, where communities come together to discuss topics of interest. People can connect directly with their favorite creators and others who love the same things or build a loyal following of their own to share their ideas, opinions, and creativity with the world.\nWhatsApp is a simple, reliable, and secure messaging application that is used by people and businesses around the world to communicate and transact in a private way. Within WhatsApp we launched WhatsApp Channels, a one-to-many broadcast service designed to help people follow information from people and organizations that are important to them.\nReality Labs Products\nMany of our Reality Labs investments are directed toward long-term, cutting edge research and development for products that are not on the market today and may only be fully realized in the next decade. This includes exploring new technologies such as neural interfaces using electromyography, which lets people control their devices using neuromuscular signals, as well as innovations in AI and hardware to help build next-generation interfaces. In the near term, we are continuing to develop early metaverse and wearables products and experiences that help people feel connected, anytime, anywhere.\nOur metaverse efforts include our VR, MR, and social platform initiatives. Our current product offerings in VR include our Meta Quest devices, as well as software and content available through the Meta Horizon Store, which enable a range of social experiences that allow people to defy physical distance while engaging in gaming, fitness, entertainment, and more. To drive greater adoption and acceptance of VR we have introduced MR capabilities, which allow users to experience the immersion and presence of VR while still being grounded in the physical world, through our Meta Quest devices.\nOur wearables efforts include our AR initiatives. We have continued to advance our roadmap to include additional AI-enabled offerings such as the Ray-Ban Meta AI glasses, which feature Meta AI, our advanced conversational assistant, as well as other features such as hands-free interaction. As we continue our long-term efforts to bring AR glasses to market, in 2024 we also unveiled our Orion prototype, a pair of true AR glasses that overlay content on top of the physical world. It does this with an industry-leading field of view and in glasses form factor for comfortable wear.\nIn general, while all of these investments are part of our long-term initiative to help build the next computing platform, our metaverse efforts also include notable shorter-term projects developing specific products and services to go to market, whereas our wearables efforts are primarily directed toward longer-term research and development projects. For example, in 2025, we expect to spend approximately 50% of our Reality Labs operating expenses on our wearables initiatives, and the remaining 50% on our metaverse initiatives. We apply significant judgment in estimating this expense breakdown as there are certain shared costs across product lines, and our expectations are subject to change, including as the next computing platform and our business strategies evolve. In particular, we regularly evaluate our product roadmaps and make significant changes as our understanding of the technological challenges and market landscape and our product ideas and designs evolve.\nOur business is characterized by innovation, rapid change, and disruptive technologies. We compete with companies providing connection, sharing, discovery, and communication products and services to users online, as well as companies that sell advertising to businesses looking to reach consumers and/or develop tools and systems for managing and optimizing advertising campaigns. We face significant competition in every aspect of our business, including, but not limited to, companies that facilitate the ability of users to create, share, communicate, and discover content and information online or enable marketers to reach their existing or prospective audiences. We compete to attract, engage, and retain people who use our products, to attract and retain businesses that use our free or paid business and advertising services, and to attract and retain developers who build compelling applications that integrate with our products. We also compete with companies that develop and deliver consumer hardware and augmented, mixed, and virtual reality products and services. We also expect to face additional competition as we introduce or acquire new products, as our existing products evolve, or as other companies introduce new products and services, including as part of efforts to innovate through the development and application of AI and other new technologies as well as efforts to develop the metaverse.\nOur product development philosophy centers on continuous innovation in creating and improving products that are social by design, which means that our products are designed to place people and their social interactions at the core of the product experience. As our user base grows, as engagement with products like video, VR, and MR increases, and as we deepen our investment in new technologies, our computing needs continue to expand. We have designed and built our own data centers and key portions of our technical infrastructure, and a substantial portion of our technical infrastructure is also provided by third parties. Our ability to provide and continue to innovate our products and services depends on the continued availability of components, power, and network capacity.\nWe make significant investments in technology both to improve our existing products and services and to develop new ones, as well as for our marketers and developers. We are also investing in protecting the security, privacy, and integrity of our platform by investing in both people and technology to strengthen our systems against abuse. Across all of these efforts, we are making significant investments in AI initiatives, including generative AI, to, among other things, recommend relevant content across our products through our AI-powered discovery engine, enhance our advertising tools and improve our ad delivery, targeting, and measurement capabilities, and to develop new products as well as new features for existing products.\nWe also believe in the power of open source innovation and have released our Llama models, consisting of state-of-the-art foundation models that are available for researchers and developers to use and build upon. By making our Llama models openly avail",
  "item7_clean": "Interest and other income (expense), net in 2024 increased $606 million compared to 2023, mostly due to an increase in interest income from a combination of higher balances and interest rates, partially offset by an increase in interest expense on our long-term debt.\nProvision for income taxes\nYear Ended December 31,\n2024 vs 2023 % change\n2023 vs 2022 % change\n(in millions, except percentages)\nProvision for income taxes\nOur provision for income taxes in 2024 decreased $27 million compared to 2023, due to a decrease in the effective tax rate, offset by an increase in income before provision for income taxes.\nOur effective tax rate in 2024 decreased compared to 2023, primarily due to excess tax benefits recognized from share-based compensation and an increase in research tax credits.\nEffective Tax Rate Items.\nOur effective tax rate in the future will depend upon the proportion between the following items and income before provision for income taxes: U.S. tax benefits from foreign-derived intangible income, tax effects from share-based compensation, research tax credit, tax effects from capital losses not expected to be utilized, settlement of tax contingency items, tax effects of changes in our business, and the effects of changes in tax law.\nThe accounting for share-based compensation may increase or decrease our effective tax rate based upon the difference between our share-based compensation expense and the deductions taken on our tax return, which depend upon the stock price at the time of employee award vesting. If our stock price remains constant to the January 24, 2025 price, and absent any changes to our tax landscape, we expect our effective tax rate for the full year 2025 to be in the range of 12-15%. This includes the effects of the mandatory capitalization and amortization of research and development expenses incurred in 2024, as required by the 2017 Tax Cuts and Jobs Act (Tax Act). The mandatory capitalization requirement increased our 2024 cash tax liabilities materially but also decreased our effective tax rate due to increasing the foreign-derived intangible income deduction. If the mandatory capitalization is deferred, our effective tax rate in 2025 could be higher when compared to current law and our cash tax liabilities could be lower.\nA number of countries have enacted legislation to implement the Organization for Economic Cooperation and Development’s 15% global minimum tax regime with effect from January 1, 2024. These changes did not have a material impact on our consolidated financial statements for 2024. We continue to evaluate the impacts of proposed and enacted legislation with respect to the global minimum tax regime in the jurisdictions we operate in. As additional jurisdictions enact legislation, transitional relief expires, and other provisions of the minimum tax legislation become effective, our effective tax rate and cash tax payments could increase in future years.\nUnrecognized Tax Benefits.\nAs of December 31, 2024, we had net uncertain tax positions of $9.99 billion which was included in long-term income taxes on our consolidated balance sheets. These unrecognized tax benefits were predominantly accrued for uncertainties with our research tax credits and transfer pricing with our foreign subsidiaries, which include licensing of intellectual property, providing services and other transactions. The ultimate settlement of the liabilities will depend upon resolution of tax audits, litigation, or events that would otherwise change the assessment of such items. Based upon the status of litigation described below and the current status of tax audits in various jurisdictions, we do not anticipate a material change to such amounts within the next 12 months.\nLiquidity and Capital Resources\nOur principal sources of liquidity are our cash, cash equivalents, marketable securities, and cash generated from operations. Cash, cash equivalents, and marketable securities are comprised of cash on deposit with banks, time deposits, money market funds, U.S. government and agency securities, investment grade corporate debt securities, and marketable equity securities. As part of our cash management strategy, we concentrate cash deposits with large financial institutions and our investment holdings are in diversified highly rated securities. Cash, cash equivalents, and marketable securities were $77.81 billion as of December 31, 2024, an increase of $12.41 billion from December 31, 2023. The increase was due to $91.33 billion of cash generated from operations and $10.43 billion of net proceeds from the issuance of fixed-rate senior unsecured notes (the Notes) in August 2024. These increases were offset by $39.23 billion of capital expenditures, including principal payments on finance leases, our capital returns of $35.20 billion for repurchases of our Class A common stock and payments of dividends and dividend equivalents, and $13.77 billion of taxes paid related to net share settlement of employee restricted stock unit (RSU) awards.\nThe following table presents our cash flows (in millions):\nYear Ended December 31,\nNet cash provided by operating activities\nNet cash used in investing activities\nNet cash used in financing activities\nCash Provided by Operating Activities\nCash provided by operating activities during 2024 mostly consisted of $62.36 billion net income adjusted for certain non-cash items, such as $16.69 billion of share-based compensation expense and $15.50 billion of depreciation and amortization expense. The increase in cash flows from operating activities during 2024 compared to 2023, was due to an increase in cash collection from our customers driven by the increase in revenue, partially offset by higher cash paid for income taxes and other operational spending.\nCash Used in Investing Activities\nCash used in investing activities during 2024 mostly consisted of $37.26 billion of purchases of property and equipment as we continued to invest in servers, data centers, and network infrastructure, and $9.75 billion of net purchases of marketable securities. The increase in cash used in investing activities during 2024 compared to 2023 was mostly due to increases in net purchases of marketable debt securities and property and equipment.\nWe anticipate making capital expenditures of approximately $60 billion to $65 billion in 2025 to support our core business and generative AI efforts.\nCash Used in Financing Activities\nCash used in financing activities during 2024 mostly consisted of $30.13 billion for repurchases of our Class A common stock, $5.07 billion of payments of dividends and dividend equivalents, and $13.77 billion of taxes paid related to net share settlement of RSUs, partially offset by $10.43 billion of net proceeds from the issuance of additional Notes in August 2024. The increase in cash used in financing activities during 2024 compared to 2023, was mostly due to increases in our capital returns of $10.35 billion for repurchases of our Class A common stock and $5.07 billion for quarterly dividend payments that began in March 2024, as well as a $6.76 billion increase in taxes paid related to net share settlement of RSUs.\nIn addition to other financial measures presented in accordance with U.S. GAAP, we monitor free cash flow (FCF) as a non-GAAP measure to manage our business, make planning decisions, evaluate our performance, and allocate resources. We define FCF as net cash provided by operating activities reduced by purchases of property and equipment and principal payments on finance leases.\nWe believe that FCF is one of the key financial indicators of our business performance over the long term and provides useful information regarding how cash provided by operating activities compares to the property and equipment investments required to maintain and grow our business.\nWe have chosen our definition for FCF because we believe that this methodology can provide useful supplemental information to help investors better understand underlying trends in our business. We use FCF in discussions with our senior management and board of directors.\nFCF has limitations as an analytical tool, and you should not consider it in isolation or as a substitute for analysis of other GAAP financial measures, such as net cash provided by operating activities. FCF is not intended to represent our residual cash flow available for discretionary expenses. Some of the limitations of FCF are:\nFCF does not reflect our future contractual commitments; and\nother companies in our industry present similarly titled measures differently than we do, limiting their usefulness as comparative measures.\nManagement compensates for the inherent limitations associated with using the FCF measure through disclosure of such limitations, presentation of our financial statements in accordance with GAAP, and reconciliation of FCF to the most directly comparable GAAP measure, net cash provided by operating activities, as presented below.\nThe following is a reconciliation of FCF to the most comparable GAAP measure, net cash provided by operating activities (in millions):\nYear Ended December 31,\nNet cash provided by operating activities\nPurchases of property and equipment\nPrincipal payments on finance leases\nMaterial Cash Requirements\nWe currently anticipate that our available funds and cash flow from operations and financing activities will be sufficient to meet our operational cash needs and fund our investments in infrastructure and AI initiatives, share repurchases and dividend payments for at least the next 12 months and thereafter for the foreseeable future. We continuously evaluate our liquidity and capital resources, including our access to external capital, to ensure we can finance our future capital requirements.\nLeases and Contractual Commitments\nOur operating lease obligations mostly include data centers, offices and colocations. Our finance lease obligations include certain network infrastructure. Our facilities consolidation restructuring efforts did not materially change our operating lease obligations. Our contractual commitments are primarily related to our investments in servers and network infrastructure, and content costs from content providers whom we license video and music to increase engagement on the platform.\nAs of December 31, 2024, we had outstanding long-term debt in the form of senior unsecured notes for an aggregate principal amount of $29.0 billion, which mature from 2027 through 2064. Short-term and long-term future interest payments obligations as of December 31, 2024 were $1.39 billion and $28.10 billion, respectively.\nCapital Return Program\nOur board of directors has authorized a share repurchase program of our Class A common stock, which commenced in January 2017 and does not have an expiration date. In 2024, we repurchased and subsequently retired 65 million shares of our Class A common stock for an aggregate amount of $29.75 billion. As of December 31, 2024, $51.28 billion remained available and authorized for repurchases.\nWe paid four quarterly cash dividends, including dividend equivalents, totaling $2.00 for each share of Class A and Class B common stock during the year ended December 31, 2024. Total dividends and dividend equivalents paid were $5.07 billion for the year ended December 31, 2024. Subject to legally available funds and future declaration by our board of directors, we currently intend to continue to pay a quarterly cash dividend and dividend equivalents on our outstanding common stock.\nCash paid for income taxes was $10.55 billion for the year ended December 31, 2024. As of December 31, 2024, we had taxes payable of $718 million related to a one-time transition tax payable incurred as a result of the Tax Act, which is due within one year.\nOur long-term income taxes include $9.99 billion related to the uncertain tax positions as of December 31, 2024. Due to uncertainties in the timing of the completion of tax audits, the timing of the resolution of these positions is uncertain and we are unable to make a reasonably reliable estimate of the timing of payments.\nWe are involved in legal proceedings, claims, and regulatory, tax or government inquiries and investigations. Significant judgment is required to determine both probability and the estimated amount of loss. Such matters are inherently unpredictable and subject to significant uncertainties, some of which are beyond our control. Should any of these estimates and assumptions change or prove to be incorrect, it could have a material impact on our results of operations, financial position, and cash flows.\nRecently Issued Accounting Pronouncements\n\nManagement's Discussion and Analysis of Financial Condition and Results of Operations\nTo supplement our consolidated financial statements, which are prepared and presented in accordance with generally accepted accounting principles in the United States (GAAP), we present revenue on a constant currency basis and free cash flow, which are non-GAAP financial measures. Revenue on a constant currency basis is presented in the section entitled \"\nForeign Exchange Impact on Revenue.\" To calculate revenue on a constant currency basis, we translated revenue for the full year 2024 using 2023 monthly exchange rates for our settlement or billing currencies other than the U.S. dollar. For a full description of our free cash flow non-GAAP measure, see the section entitled \"\nLiquidity and Capital Resources—Free Cash Flow.\"\nThese non-GAAP financial measures are not intended to be considered in isolation or as a substitute for, or superior to, financial information prepared and presented in accordance with GAAP. These measures may be different from non‑GAAP financial measures used by other companies, limiting their usefulness for comparison purposes. Moreover, presentation of revenue on a constant currency basis is provided for year-over-year comparison purposes, and investors should be cautioned that the effect of changing foreign currency exchange rates has an actual effect on our operating results. We believe these non-GAAP financial measures provide investors with useful supplemental information about the financial performance of our business, enable comparison of financial results between periods where certain items may vary independent of business performance, and allow for greater transparency with respect to key metrics used by management in operating our business.\nExecutive Overview of Full Year 2024 Results\nOur mission is to build the future of human connection and the technology that makes it possible.\nOur financial results and key Family metrics for 2024 are set forth below. Total revenue for 2024 was $164.50 billion, an increase of 22% compared to 2023, due to an increase in advertising revenue. Revenue on a constant currency basis would have increased 23% compared to 2023. Ad impressions delivered across our Family of Apps in 2024 increased 11% year-over-year, and our average price per ad increased 10% year-over-year.\nIncome from operations for 2024 was $69.38 billion, an increase of $22.63 billion, or 48%, compared to 2023, driven by an increase in advertising revenue, partially offset by an increase in costs and expenses. The increase in costs and expenses was mainly due to increases in operational expenses related to our data centers and technical infrastructure and employee compensation, partially offset by lower restructuring and legal-related costs.\nConsolidated and Segment Results\nWe report our financial results for our two reportable segments: Family of Apps (FoA) and Reality Labs (RL). FoA includes Facebook, Instagram, Messenger, WhatsApp, and other services. RL includes our virtual, augmented, and mixed reality related consumer hardware, software, and content.\n(in millions, except percentages)\nIncome (loss) from operations\n\n2024 vs 2023 % change\n2023 vs 2022 % change\n(in millions, except percentages)\nFoA revenue in 2024 increased $29.35 billion, or 22%, compare",
  "item2_clean": null
}