{
  "source_file": "mhk-20250927.htm",
  "form_type": "10-Q",
  "item1_clean": null,
  "item7_clean": null,
  "item2_clean": "Macroeconomic Conditions\nThe Company continues to be impacted by soft demand across its markets, as inflationary pressures, elevated interest rates, shifting trade policy and geopolitical events are contributing to consumer uncertainty that has led to general deferrals of large discretionary purchases. In addition, mortgage rates remain elevated in most markets, contributing to a stagnant housing market in many regions and impacting the demand for the Company’s products for residential remodeling projects. Commercial channels continue to outperform residential in most of the Company’s markets, as many commercial construction and remodeling projects were planned and approved prior to rising interest rates. Based on historical industry cycles, the Company believes demand in its markets will accelerate when interest rates decline due to pent-up demand in the residential and commercial remodeling and construction markets. However, the ongoing impact of soft demand, inflationary pressures and elevated interest rates to the Company’s business, financial condition, results of operations, and prospects cannot be determined at this time.\nOver the last several quarters, the Company has, to some extent, offset the impact of lower volume from reduced demand, pricing pressures in competitive markets and higher input costs through productivity gains and benefits from restructuring initiatives. During 2022 and 2023, the Company implemented a number of restructuring actions, productivity initiatives and manufacturing enhancements focused on reducing costs to enhance future performance, including certain facility, asset and product rationalizations and workforce reductions. The Company anticipates that when completed these projects will deliver annual savings of approximately $150 million, with an estimated cost of approximately $215 million. In 2024, the Company announced further restructuring actions, including additional facility, assets and product rationalizations and workforce reductions to further reduce costs and improve the business for the future. The Company anticipates that when completed, these projects will deliver annual savings of approximately $140 million, with an estimated cost of approximately $145 million. In 2025, the Company announced additional restructuring actions, including assets and product rationalizations and workforce reductions to further reduce costs and streamline the business for the future. The Company anticipates that when completed, these projects will deliver annual savings of approximately $50 million, with an estimated cost of approximately $30 million. Execution timelines will vary by project, with some initiatives extending into 2026.\nThe Company continues to actively monitor trade policy and tariff announcements, including various executive orders issued by the current U.S. presidential administration. Due to its global footprint and manufacturing operations across 19 countries, the Company is generally able to provide its customers with regional supply. However, the current tariff policies have impacted certain of the Company’s sourcing and upstream and downstream supply chain processes occurring outside the U.S. and certain vendors, suppliers, and customers located outside the U.S. Based on recent changes, engineered wood and laminate imports will now be subject to reciprocal tariffs like other flooring categories, which should benefit domestically produced products. The Company has begun to take steps to mitigate the implemented tariffs through managing inventory of sourced products, adjusting prices as the tariff trade policy evolves and optimizing its supply chain. At a 10% baseline tariff rate, the Company expects to incur an annualized cost of approximately $50 million related to such tariffs. The Company continues to monitor changing tariff levels and adjust its strategies to mitigate their impact as trade policy evolves. However, the duration, magnitude and scope of any additional tariffs, trade restrictions, retaliatory or other measures are difficult to predict, including any related impacts to consumer demand, along with the extent (if any) to which the Company will be able to\noffset the impacts of such actions through mitigation efforts. These tariff actions, retaliatory measures, or other trade restrictions, could materially and adversely impact the Company’s business, financial condition, results of operations, and prospects.\nGeopolitical Conflict\nDue to its global footprint, Mohawk’s business is sensitive to geopolitical conflict, including the Russia-Ukraine conflict and the ongoing conflicts in the Middle East. Since the first quarter of 2022, the Company has suspended new investments in Russia in response to ongoing Russian military actions in Ukraine. In addition, continued escalation of conflict in the Middle East region could result in supply chain disruptions, higher energy and raw material prices, decreased consumer demand for the Company’s products and increased transportation barriers, though the extent of the impact on the Company’s business, financial condition, results of operations, and prospects cannot be predicted. The broader consequences of current ongoing military conflicts, which may include further economic sanctions, embargoes, regional instability, and geopolitical shifts; potential retaliatory actions, including nationalization of foreign-owned businesses; increased tensions between the United States and countries in which the Company operates; and the extent of the conflict’s effect on the Company’s business and results of operations, as well as the global economy, cannot be predicted.\nLiquidity and Capital Expenditures Overview\nThe Company believes it is well positioned with a strong balance sheet. Based on its current liquidity and available credit, the Company is in a position to finance internal investments, acquisitions and/or additional stock purchases and pay current debt as it becomes due. For information on risks that could impact the Company’s results, please refer to\nIn 2025, the Company plans to invest approximately $480 million focused on completing capacity expansion projects and targeted initiatives that will drive cost reduction while improving operational performance.\nFor the three months ended September 27, 2025, the net earnings attributable to the Company were $108.8 million compared to the net earnings attributable to the Company of $162.0 million for the three months ended September 28, 2024. The change was primarily attributable to higher input costs, higher legal settlements, reserves and fees, higher restructuring, acquisition and integration-related, and other costs, the unfavorable net impact of price and product mix and the unfavorable impact of temporary plant shutdowns, partially offset by productivity gains and lower income tax expenses.\nFor the nine months ended September 27, 2025, the net earnings attributable to the Company was $327.9 million compared to the net earnings attributable to the Company of $424.5 million for the nine months ended September 28, 2024. The change was primarily attributable to higher input costs, the unfavorable impact of temporary plant shutdowns, lower sales volume, order management system conversion, higher restructuring, acquisition and integration-related, and other costs and the unfavorable net impact of price and product mix, partially offset by productivity gains and lower income tax expenses. The Company believes that a number of circumstances may influence trends in 2025, including the impact of inflation and material availability due to disruptions in the global supply chain, but the extent and duration of such impact cannot be predicted.\nFor the nine months ended September 27, 2025, the Company generated $596.6 million of cash from operating activities. As of September 27, 2025, the Company had cash and cash equivalents of $516.2 million of which $285.6 million was in the U.S. and $230.6 million was in foreign countries.\n\nResults of Operations\nQuarter Ended September 27, 2025, as compared with Quarter Ended September 28, 2024\nNet sales for the three months ended September 27, 2025, were $2,757.9 million compared to net sales of $2,719.0 million for the three months ended September 28, 2024. The change was primarily attributable to the favorable net impact of foreign exchange rates of approximately $61 million, partially offset by lower sales volume of approximately $13 million and fewer shipping days for the quarter ended September 27, 2025, of approximately $11 million.\n—Net sales for the three months ended September 27, 2025, were $1,104.7 million compared to net sales of $1,058.0 million for the three months ended September 28, 2024. The change was primarily attributable to the favorable net impact of foreign exchange rates of approximately $28 million and the favorable net impact of price and product mix of approximately $26 million.\n—Net sales for the three months ended September 27, 2025, were $936.8 million compared to net sales of $974.0 million for the three months ended September 28, 2024. The change was primarily attributable to lower sales volume of approximately $34 million.\n—Net sales for the three months ended September 27, 2025, were $716.4 million compared to net sales of $687.0 million for the three months ended September 28, 2024. The change was primarily attributable to the favorable net impact of foreign exchange rates of approximately $34 million and higher sales volume of approximately $27 million, partially offset by the unfavorable net impact of price and product mix of approximately $21 million and fewer shipping days for the quarter ended September 27, 2025, of approximately $11 million.\nGross profit for the three months ended September 27, 2025, was $654.9 million compared to gross profit of $692.6 million for the three months ended September 28, 2024. The change was primarily attributable to higher input costs of approximately $39 million; hig"
}