{
  "source_file": "mkc-20250831.htm",
  "form_type": "10-Q",
  "item1_clean": null,
  "item7_clean": null,
  "item2_clean": "Percent increase (decrease)\nSegment operating income\nSegment operating income margin\nIn the third quarter of 2025, sales of our Flavor Solutions segment increased by 1.2% as compared to the third quarter of 2024 and increased by 0.6% an organic basis. Unfavorable volume and product mix decreased sales by 0.3% driven by the Americas and EMEA regions partially offset by growth in the APAC region. Favorable pricing increased sales by 0.9%. The favorable impact of foreign currency rates increased sales by 0.6% and is excluded from our measure of sales growth of 0.6% on an organic basis.\nIn the Americas region, Flavor Solutions sales increased by 0.1% in the third quarter of 2025 compared to the third quarter of 2024 and increased by 0.9% on an organic basis. Unfavorable volume and product mix decreased sales by 1.3% driven by lower sales to branded foodservice and packaged food customers. Favorable pricing impacted sales by 2.2%. The unfavorable impact from foreign currency rates decreased sales by 0.8% and is excluded from our measure of sales growth of 0.9% on an organic basis.\nIn the EMEA region, Flavor Solutions sales increased by 2.1% in the third quarter of 2025 compared to the third quarter of 2024 and decreased by 3.1% on an organic basis. Unfavorable volume and product mix decreased sales by 1.0%, driven by the effect of lower sales to packaged food customers. Unfavorable pricing impacted sales by 2.1%. The favorable impact from foreign currency rates increased sales by 5.2% and is excluded from our measure of sales decline of 3.1% on an organic basis.\nIn the APAC region, Flavor Solutions sales increased by 7.7% in the third quarter of 2025 compared to the third quarter of 2024, and increased by 6.3% on an organic basis. Favorable volume and product mix increased sales by 9.0%, primarily driven by growth in China and Southeast Asia. Pricing unfavorably impacted sales by 2.7%. The favorable impact from foreign currency rates increased sales by 1.4% and is excluded from our measure of sales growth of 6.3% on an organic basis.\nFor the nine months ended August 31, 2025, sales of our Flavor Solutions segment increased 0.2% as compared to the same period in 2024 and increased by 1.2% on an organic basis. Favorable volume and product mix increased sales by 0.1% driven by growth in the APAC region mostly offset by unfavorability in the Americas and EMEA regions. Favorable pricing increased sales by 1.1%, driven by the Americas regions partially offset by unfavorable pricing in the EMEA and APAC regions. The unfavorable impact of foreign currency rates decreased segment sales by 1.0% and is excluded from our measure of sales growth of 1.2% on an organic basis.\nSegment operating income for our Flavor Solutions segment for the third quarter of 2025 decreased by $1.8 million, or 1.8%, compared to the same period in 2024, driven by a decrease in gross profit partially offset by lower SG&A expense. The decrease in gross profit was driven by increased commodity costs including the impact of tariffs, unfavorable product mix and increased conversion costs including costs to support increased capacity for future growth, partially offset by favorable pricing. The decrease in SG&A expense was driven by the items described in the consolidated discussion. Segment operating margin decreased by 40 basis points to 13.3%. On a constant currency basis, segment operating income decreased by 1.6%.\nSegment operating income for our Flavor Solutions segment for the nine months ended August 31, 2025 increased by $23.7 million, or 9.5%, compared to the same period in 2024, driven by an increase in gross profit and lower SG&A expense. The increase in gross profit was driven by the impacts of favorable pricing and CCI-led cost savings, partially offset by increased\nconversion costs including costs to support increased capacity for growth. The decrease in SG&A expense was driven by the items described in the consolidated discussion. Segment operating margin increased by 110 basis points to 12.6%. On a constant currency basis, segment operating income increased by 12.0%.\nMARKET RISK SENSITIVITY\nWe utilize derivative financial instruments to enhance our ability to manage risk, including foreign exchange and interest rate exposures, which exist as part of our ongoing business operations. We do not enter into contracts for trading purposes, nor are we a party to any leveraged derivative instrument. The use of derivative financial instruments is monitored through regular communication with senior management and the utilization of written guidelines.\nForeign Exchange Risk\nWe are exposed to foreign currency risk affecting net investments in subsidiaries, transactions (both third-party and intercompany) and earnings denominated in foreign currencies. Management assesses foreign currency risk based on transactional cash flows and translational volatility and may enter into forward contract and currency swaps with highly-rated financial institutions to reduce fluctuations in the long or short currency positions. We do not enter into contracts for trading purposes, nor are we a party to any leveraged derivative instruments. All derivatives are designated as hedges.\nThe following table sets forth the notional values and unrealized net gain (loss) of the portfolio of our forward foreign currency and cross currency swap contracts:\nForward foreign currency:\nUnrealized net (loss)\nCross currency swaps:\nUnrealized net (loss) gain\nThe outstanding notional value is a result of our decisions on foreign currency exposure coverage, based on our foreign currency and foreign currency translation exposures.\nWe manage our interest rate exposure by entering into both fixed and variable rate debt arrangements. We use interest rate swaps to minimize worldwide financing costs and to achieve a desired mix of fixed and variable rate debt. We do not enter into contracts for trading purposes, nor are we a party to any leveraged derivative instruments, and all derivatives are designated as hedges.\nThe following table sets forth the notional values and unrealized net gain (loss) of our interest rate swap contracts:\nUnrealized net (loss)\nThe change in fair values of our interest rate swap contracts is due to changes in interest rates on the notional amounts outstanding as of each date as well as the remaining duration of our interest rate derivative contracts.\nWe purchase certain raw materials which are subject to price volatility caused by weather, market conditions, growing and harvesting conditions, governmental actions, and other factors beyond our control. Our most significant raw materials are dairy products, pepper, onion, garlic, capsicums (red peppers and paprika), tomato products, sugar, and salts. While future movements of raw material costs are uncertain, we respond to this volatility in a number of ways, including strategic raw material purchases, purchases of raw material for future delivery, and customer price adjustments. We generally have not used derivatives to manage the volatility related to this risk.\nThe customers of our Consumer segment are predominantly food retailers and food wholesalers. Consolidations in these industries have created larger customers. In addition, competition has increased with the growth in alternative channels including mass merchandisers, dollar stores, warehouse clubs, discount chains, and e-commerce. This has caused some customers to be less profitable and increased our exposure to credit risk. Some of our customers and counterparties are highly leveraged. We continue to closely monitor the credit worthiness of our customers and counterparties. We believe that our allowance for doubtful accounts properly recognizes trade receivables at realizable value. We consider nonperformance credit risk for other financial instruments to be insignificant.\nNON-GAAP FINANCIAL MEASURES\nThe following tables include financial measures of organic net sales, adjusted gross profit, adjusted gross profit margin, adjusted operating income, adjusted operating income margin, adjusted income tax expense, adjusted income tax rate, adjusted net income, and adjusted diluted earnings per share. These represent non-GAAP financial measures which are prepared as a complement to our financial results prepared in accordance with United States generally accepted accounting principles. These financial measures exclude the impact, as applicable, of the following:\nSpecial charges - Special charges consist of expenses and income associated with certain actions undertaken by us to reduce fixed costs, simplify or improve processes, and improve our competitiveness and are of such significance in terms of both up-front costs and organizational/structural impact to require advance approval by our Management Committee. Expenses associated with the approved actions are classified as special charges upon recognition and monitored on an ongoing basis through completion. Included in special charges are transaction and integration costs incurred in conjunction with acquisitions.\nWe believe that these non-GAAP financial measures are important. The exclusion of the items noted above provides additional information that enables enhanced comparisons to prior periods and, accordingly, facilitates the development of future projections and earnings growth prospects. This information is also used by management to measure the profitability of our ongoing operations and analyze our business performance and trends.\nThese non-GAAP financial measures may be considered in addition to results prepared in accordance with GAAP; however, they should not be viewed as a substitute for, or superior to, GAAP results. Furthermore, these non-GAAP financial measures may not be comparable to similarly titled measures of other companies, as they may calculate them differently than we do. We intend to continue providing these non-GAAP financial measures as part of our future earnings discussions, ensuring "
}