{
  "source_file": "mlm-20241231.htm",
  "form_type": "10-K",
  "item1_clean": "Martin Marietta Materials, Inc. (the Company or Martin Marietta) is a natural resource-based building materials company. The Company supplies aggregates (crushed stone, sand and gravel) through its network of approximately 390 quarries, mines and distribution yards in 28 states, Canada and The Bahamas. In 2024, aggregates gross profit accounted for 76% of the Company’s total reportable segment gross profit. Martin Marietta also provides cement and downstream products, namely, ready mixed concrete, asphalt and paving services, in targeted markets where the Company has a leading aggregates position. The Company’s heavy-side building materials are used in infrastructure, nonresidential and residential construction projects. Aggregates are also used in agricultural, utility and environmental applications and as railroad ballast. The aggregates, cement, ready mixed concrete, asphalt and paving operations are reported collectively as the “Building Materials business”. The Company also operates a Magnesia Specialties business with production facilities in Michigan and Ohio. The Magnesia Specialties business produces magnesia-based chemical products that are used in industrial, agricultural and environmental applications. It also produces dolomitic lime sold primarily to customers for steel production and soil stabilization. Magnesia Specialties’ products are shipped to customers domestically and worldwide.\n\nThe Company's cement operation, like those of other cement producers, requires combustion of significant amounts of fuel to generate high kiln temperatures and create carbon dioxide as a product of the calcination process, which is presently an unavoidable step in making clinker, the essential component for cement production. Accordingly, the Company continues to closely monitor GHG regulations and legislation and its potential impact on the Company's cement business, financial condition and product demand. The Company anticipates that any increased operating costs or taxes relating to GHG emission limitations at the Woodville lime plant or Midlothian cement plant would be passed on to customers. The magnesium oxide products produced at the Manistee operation, however, compete against other products that, due to the form and/or structure of the source material, require less energy in the calcination process, resulting in the generation of fewer GHGs per ton of production. The Manistee facility may be required to absorb additional costs, including for taxes or capital investments, in order to maintain competitive pricing in that market. In addition, the cement produced by the Company’s cement operation, like other U.S. producers, is subject to strict limits set by the U.S. Department of Transportation (USDOT) and other agencies, including those relating to “clinker substitution”, or the replacement of ground clinker in cement with alternate materials such as pozzolan, slag and fly ash, which has implications for the Company’s fuel use and efforts to reduce GHG emissions from its cement operations. For example, various industry associations are engaged in an effort requesting the USDOT and other agencies to further revise their standards allowing for greater rates of clinker substitution, similar to the rates currently permitted for European cement producers. If higher rates of substitution and blending are, in fact, permitted in the future, the result is likely to be both reduced clinker and power consumption in cement production, which would, in turn, reduce GHGs emitted in connection with each ton of cement produced in the United States. The Company has continued its rollout of Portland\n\nThe nature of the Company’s competition varies among its products due to the differing amounts of capital necessary to build and maintain production facilities and can be influenced by sustainability risks and opportunities particularly with respect to the Company’s small-but-strategic heritage cement business. Most domestic cement producers are owned by large non-U.S. companies operating in multiple international markets that report their results (including sustainability and emissions-related metrics) on a world-wide consolidated basis. The Company is subject to U.S. environmental regulations and there are critical regulatory differences between the U.S. and the European Union and differing calculation methodologies for carbon intensity calculations, blending and fuel choice that result in meaningful differences in the makeup of corresponding end-products and reported emissions metrics. Those differences, in turn, make like-for-like comparisons of the emissions performance of non-U.S. companies with the performance of the Company's heritage cement business challenging. To the extent that investors or consumers decide to use world-wide comparisons of these metrics in making investment and purchase decisions, the Company could be at a competitive disadvantage. Geography is critically important when assessing market attractiveness and growth opportunities for the Company. Attractive geographies generally exhibit (a) population growth and/or high population density, both of which are drivers of heavy-side building materials consumption; (b) business and employment diversity, drivers of greater economic stability, and (c) a superior state financial position, a driver of public infrastructure investment. All of these factors can be and are influenced by weather patterns and physical risk and opportunities.\n\nIn addition to impacts from increased regulation, weather patterns may result in physical impacts that could have adverse effects on the Company’s operations or financial condition. Physical impacts may include disruptions in production and/or regional supply or product distribution networks due to major storm events and shifts in regional rainfall and temperature patterns and intensities, as well as flooding from sea level changes. In addition, production and shipment levels for the Building Materials business correlate with general construction activity, which occurs outdoors and, as a result, is affected by erratic weather patterns, seasonal changes and other unusual or unexpected weather-related conditions, which can significantly affect that business. In the Company's cement and downstream operations, the physical impacts of weather may result in disruptions to its operations or its customers’ transportation activities, including impacts on production capabilities and capacities, supply chain interruptions and project delays that can impact the Company's reputation and result in additional costs to the Company. Excessive rainfall and other severe weather jeopardize production, shipments and profitability in all markets served by the Company in its Building Materials business. In addition, inclement weather can reduce the useful life of an asset. In particular, the Company’s operations near the Atlantic Ocean and Gulf Coast regions of the United States and The Bahamas are at risk for hurricane activity, most notably in August, September and October. The Company is also at risk for Pacific Ocean storm activity. The last several years brought an unprecedented amount of precipitation to the United States and particularly to Texas and the southeastern United States, notably the Carolinas, Florida and Georgia, where it impacted the Company’s facilities. In addition, the Company's California operations are at risk for wildfires and water use restrictions in the event of severe drought conditions. An insufficient supply of water for the Company's operations in those areas could impact production. While reconstruction activities may offset some or most of the financial impacts on sales and demand, any of these events could have a material adverse effect on the Company’s business and operations.\n\nThe profitability of the Building Materials business, which serves customers in the construction marketplace, is sensitive to national, regional and local economic conditions and construction cyclicality, which are in turn affected by fluctuations in levels of public-sector infrastructure funding; interest rates; access to capital markets; and demographic, geographic, employment and population dynamics. The heavy-side construction business is conducted outdoors, as are much of the Building Materials business’ operations. Therefore, erratic weather patterns, seasonal changes and other weather-related conditions, including precipitation, flooding, hurricanes, snowstorms, extreme temperatures, wildfires, earthquakes and droughts, can significantly affect production schedules, shipments, costs, efficiencies and profitability. Generally, the financial results for the first and fourth quarters are subject to the impacts of winter weather, while the second and third quarters are subject to the impacts of heavy precipitation.\n\nReady mixed concrete is measured in cubic yards and specifically batched or produced for customers’ construction projects and then typically transported by mixer trucks and poured at the project site. The aggregate used for ready mixed concrete is a washed material with limited amounts of fines (such as dirt and clay). As of December 31, 2024, the Company operated 72 ready mixed concrete plants in Arizona and Texas. Asphalt is most commonly used in surfacing roads and parking lots and consists of liquid asphalt, or bitumen (the binding medium), and aggregates. Similar to ready mixed concrete, each asphalt batch is produced to customer specifications. As of December 31, 2024, the Company operated 38 asphalt plants in Arizona, California, Colorado and Minnesota. The Company also offers paving services in California and Colorado. Market dynamics for these downstream product lines include a highly competitive environment and lower barriers to entry compared with aggregates and cement.\n\nThe Company conducts its Building Materials business through two reportable segments, organized by geography: East Group and West Group. The East Group provides aggregates and asphalt products. The West Group provides aggregates, cement, downstream products and paving services. The Company’s Magnesia Specialties business is reported as a separate segment and includes its magnesia-based chemicals and dolomitic lime businesses. For more information on the organization and geographic area of the Company’s business segments, see\nNote A: Accounting Policies\nNotes to Financial Statements\nof the Company’s consolidated financial statements, which appear in\n\nGiven high fixed costs, low capacity utilization can negatively affect the segment’s results from operations. Management has shifted the strategic focus of the magnesia-based business to grow and diversify the specialty chemicals product portfolio to reliably produce at volume levels that support efficient operations. Accordingly, these products are less dependent on the steel industry than the dolomitic lime product line. Management expects future organic profit growth to result from increased pricing, commercialization of new products, entry into new or adjacent markets and optimization of overall product mix.\n\nSustainability Opportunities\nNotwithstanding the foregoing risks and uncertainties relating to climate change, there may also be opportunities for the Company to increase its business or revenues through sustainability opportunities. For example, warm and/or moderate temperatures in March and November allow the construction season to start earlier and end later, respectively, which could have meaningfully positive impacts on the Company’s first- and fourth-quarter results, respectively. From a regulatory standpoint, the Infrastructure Investment and Jobs Act (IIJ Act), which was signed into law in November 2021, provides billions of dollars in new funding for roads, bridges and other major infrastructure projects which require aggregates and cement for construction. New public transit and clean energy projects that address climate change may also result in ",
  "item7_clean": "A significant portion of the Magnesia Specialties business’ costs is of a fixed or semi-fixed nature. The production process requires the use of natural gas, coal and petroleum coke; therefore, fluctuations in their pricing directly affect operating results. To help mitigate this risk, the Company has fixed-price agreements for 43% of its anticipated 2025 energy needs for coal, petroleum coke and natural gas. Given inherently high fixed costs, low capacity utilization can negatively affect the segment’s results of operations. Management expects future organic profit growth to result from increased pricing, commercialization of new products, entry into new markets and optimization of overall product mix.\n\nWage and benefit inflation as well as other increases in labor costs may be somewhat mitigated by enhanced productivity in an expanding economy. During economic downturns, the Company reviews its operations and, where practical, temporarily idles certain sites. The Company then serves these markets with other open and proximate facilities. In certain markets, management can create production “super crews” that work on a rotating basis at various locations. For example, within a market, a crew may work three days per week at one quarry and the other two workdays at another quarry. This has allowed the Company to responsibly manage headcount in periods of lower product demand.\n\nVariable costs are expenses that fluctuate with the level of production volume, while fixed costs are expenses that do not vary based on production or sales volume. Production is the key driver in determining the levels of variable costs, as it affects the number of hourly employees and related labor hours. Further, components of energy, supplies and repairs and maintenance costs also increase in connection with higher production volumes. Accordingly, the Company’s operating leverage can be meaningful.\n\nIn addition to federal appropriations, each state typically funds its infrastructure investment from specifically allocated amounts collected from various user fees, typically gasoline taxes and vehicle fees. States have assumed a significantly larger role in funding infrastructure investment, including initiating special-purpose taxes and raising state gas taxes. Management believes that financing at the state and local levels, such as bond issuances, toll roads, vehicle miles traveled fees and tax initiatives, will continue to grow and have a fundamental role in advancing infrastructure projects. State infrastructure investment generally leads to increased growth opportunities for the Company. The level of state public-works spending is varied across the nation and dependent upon individual state economies; the degree to which the Company could be affected by a reduction or slowdown in infrastructure spending varies by state. The state economies of the Building Materials business’ ten largest revenue-generating states may disproportionately affect the Company’s financial performance.\n\nLarge emitters (facilities that emit 25,000 metric tons or more per year) of greenhouse gases (GHG) must report GHG generation to comply with the USEPA’s Mandatory Greenhouse Gases Reporting Rule (GHG Rule). In 2024, the Company filed annual reports in accordance with the GHG Rule relating to operations at its cement plant in Texas, as well as its Magnesia Specialties facilities in Woodville, Ohio, and Manistee, Michigan, each of which emit certain GHG, including carbon dioxide, methane and nitrous oxide. If Congress passes additional legislation limiting GHG emissions, these operations will likely be subject to such legislation. The Company believes that any increased operating costs or taxes related to GHG emission limitations at its cement or Woodville operations would be passed on to its customers. The Manistee facility may have to absorb extra costs due to the regulation of GHG emissions to maintain competitive pricing in its markets. The Company cannot reasonably predict the amount of those potential increased costs.\n\nMaterials pricing for construction projects is generally based on terms committing to the availability of specified products of a stated quantity at an agreed-upon price during a definitive period. Because infrastructure projects often span multiple years, announced price changes can have a lag time before taking effect while the Company sells products under existing price agreements. Pricing escalators included in multi-year infrastructure contracts serve to somewhat mitigate this effect. However, during periods of heightened or rapid increases in production costs, multi-year infrastructure contract pricing may provide only nominal pricing growth. Additionally, the Company may implement multiple price increases throughout the year, on a market-by-market basis, where appropriate. Pricing is determined locally and is affected by supply and demand characteristics of the local market. For further information on pricing, see the discussion in the\n\nThe Company’s strategic planning process, or\nS\nO\nA\nR\neview (SOAR), provides the framework for execution of Martin Marietta’s long-term strategic plan. Guided by this framework and considering the cyclicality of the Building Materials business, the Company determines capital allocation priorities to maximize long-term shareholder value creation. The Company’s strategy includes ongoing evaluation of aggregates-led opportunities of scale in new domestic markets (\n, platform acquisitions) and expansion through acquisitions that complement existing operations (\n, bolt-on acquisitions). The Company finances such opportunities with the goal of preserving its financial flexibility by having a leverage ratio (consolidated net debt to consolidated earnings before interest, taxes, depreciation, depletion and amortization, earnings/loss from nonconsolidated equity affiliates and certain other adjustments as specified in the\nResults of Operations\nsection, or Adjusted EBITDA) within a range of 2.0 times to 2.5 times within a reasonable period of time (typically within 18 months) following the completion of a debt-financed transaction. SOAR also includes the identification and potential disposition of assets that are not consistent with stated strategic goals. Notably, the Company completed nearly $6.0 billion worth of portfolio-optimizing transactions in 2024, divesting non-strategic cement and related ready mixed concrete businesses and redeploying the net proceeds into aggregates-led acquisitions in attractive markets (see Note B to the consolidated financial statements).\n\nCosts of revenues for the Building Materials business are components of costs incurred at the quarries, mines, cement plants, ready mixed concrete plants, asphalt plants, paving operations and distribution yards and facilities. Cost of revenues also includes the cost of resale materials, freight expenses to transport materials from a producing quarry or cement plant to a distribution yard or facility (internal freight), third-party freight and delivery costs incurred by the Company and then billed to customers (external freight) and production overhead costs.\n\nThe Company’s rail shipments result in continued reliance on railroad operations, which are impacted by track congestion, crew and locomotive availability, the effects of adverse weather conditions and the ability to negotiate favorable railroad shipping contracts. Further, changes in the operating strategy of rail transportation providers can create operational inefficiencies and increased costs from the Company’s rail network.\n\nGenerally, when the Company invests capital in facilities and equipment, increased capacity and productivity reduce labor and repair costs serving to offset increased fixed depreciation costs. However, the increased productivity and related efficiencies may not be fully realized in a lower-demand environment, resulting in under-absorption of fixed costs.\n\nThe following discussion and analysis reflect management’s assessment of the financial condition and results of operations (MD&A) of the Company for continuing operations and should be read in conjunction with the audited consolidated financial statements (\n\nThe heavy-side construction business, inclusive of much of the Company’s operations, is conducted outdoors. Therefore, erratic weather patterns, precipitation and other weather-related conditions, including flooding, hurricanes, extreme hot and cold temperatures, earthquakes, droughts and wildfires, can significantly affect production schedules, shipments, costs, efficiencies and profitability. Generally, the financial results for the first and fourth quarters are influenced by the impacts of winter weather, while the second and third quarters can be subject to the impacts of heavy precipitation and excessive heat. The impacts of erratic weather patterns are more fully discussed in the\nBuilding Materials Business’ Key Considerations\n\nITEM 7 – MANAGEMENT’S DISCUSSI\nON AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS\n\nItem 7 – Management’s Discussion and Analysis of Financial Condition and Results of Operations\n\nItem 7 – Management’s Discussion and Analysis of Financial Condition and Results of Operations\n\nItem 7 – Management’s Discussion and Analysis of Financial Condition and Results of Operations\n\nItem 7 – Management’s Discussion and Analysis of Financial Condition and Results of Operations\n\nItem 7 – Management’s Discussion and Analysis of Financial Condition and Results of Operations\n\nItem 7 – Management’s Discussion and Analysis of Financial Condition and Results of Operations\n\nItem 7 – Management’s Discussion and Analysis of Financial Condition and Results of Operations\n\nItem 7 – Management’s Discussion and Analysis of Financial Condition and Results of Operations\n\nItem 7 – Management’s Discussion and Analysis of Financial Condition and Results of Operations\n\nItem 7 – Management’s Discussion and Analysis of Financial Condition and Results of Operations\n\nItem 7 – Management’s Discussion and Analysis of Financial Condition and Results of Operations\n\nItem 7 – Management’s Discussion and Analysis of Financial Condition and Results of Operations\n\nItem 7 – Management’s Discussion and Analysis of Financial Condition and Results of Operations\n\nmore aggregates intensive than construction of multi-family units. Therefore, the level of new subdivision starts, as well as new single-family housing permits, is a strong leading indicator of residential volumes. According to the United States Census Bureau, for the year ended December 31, 2024, seasonally-adjusted national single-family housing starts decreased 3% to approximately 1.1 million units compared with 2023 and seasonally-adjusted national single-family housing permits decreased 3% versus 2023. Housing demand far exceeds supply in the Company’s key markets; however, a housing recovery is not expected until mortgage rates decline and/or affordability headwinds recede.\n\nThe Magnesia Specialties business manufactures magnesia-based chemicals products for industrial, agricultural and environmental applications at its Manistee, Michigan facility. The chemical products business focuses on higher-margin specialty chemicals that can be produced at volumes that support efficient operations. The Magnesia Specialties business also produces and sells dolomitic lime from its Woodville, Ohio facility. Dolomitic lime products sold to external customers are primarily used by the domestic steel industry, while the remaining lime shipments are used internally as a raw material for the manufacturing of chemical products.\n\nState and local initiatives that support infrastructure funding, including gas tax increases, new funding mechanisms and other ballot initiatives, are increasing in size and number as these governments recognize the need for their expanded role in public infrastructure investment. In November 2024, 77% of all infrastructure funding measures up for vote were approved. These approved infrastructure initiatives are estimated to generate $41 billion in one-time and recurring revenues, with initiatives in Texas, the Company’s largest revenue-generating state, accounting for $5 billion of this total.\n\nThe Clean Air Act, originally passed in 1963 and periodically updated by amendments, is the United States’ national air pollution control program that granted the United States Environmental Protection Agency (USEPA) authority to set limits on the level of various air pollutants. To meet National Ambient Air Quality Standards, a defined geographic area must be below established limits for six pollutants. Environmental groups have been successful in proceedings against the federal and certain state departments of transportation, delaying highway construction in municipal areas not in compliance with the Clean Air Act. The USEPA designates geographic areas as nonattainment areas when the level of air pollutants exceeds the national standard. Nonattainment areas receive deadlines to reduce air pollutants by instituting various control strategies or otherwise face fines or control by the USEPA. Included as nonattainment areas are several major metropolitan areas in the Company’s markets, such as Houston/Brazoria/Galveston, Texas; Dallas/Fort Worth, Texas; Bexar County in San Antonio/New Braunfels, Texas; Denver, Colorado; Boulder, Colorado; Fort Collins/Greeley/Loveland, Colorado; Baltimore, Maryland; Los Angeles-San Bernardino Counties, California; Los Angeles – South Coast Basin, California; Phoenix/Mesa, Arizona; San Diego County, California; San Francisco Bay Area, California; San Joaquin Valley, California; and Sacramento County, California. Federal transportation funding has been directly tied to compliance with the Clean Air Act.\n\nTransportation investments generally boost the economy by creating jobs and enhancing mobility and access, which are priorities of many of the government’s economic plans. Public-sector construction related to transportation infrastructure is funded through a combination of federal, state and local sources. The federal highway bill, currently the IIJ Act, provides annual funding for public-sector highway construction projects and includes spending authorizations, which represent the maximum financial obligation that will result from the immediate or future outlays of federal funds for highway and transit programs. The federal government’s surface transportation programs are funded mostly through the receipts of highway user taxes placed in the Highway Trust Fund, which is divided into the Highway Account and the Mass Transit Account. Revenues credited to the Highway Trust Fund are primarily derived from a federal gas tax, a federal tax on certain other motor fuels and interest on the accounts’ accumulated balances. Of the currently imposed federal gas tax of $0.184 per gallon, which has been static since 1993, $0.15 is allocated to the Highway Account of the Highway Trust Fund.\n\nTypically, diesel fuel represents the single-largest component of energy costs for the Building Materials business. The average cost per gallon was $2.82 and $3.25 in 2024 and 2023, respectively. Changes in energy costs also affect the prices that the Company pays for related supplies, including explosives, conveyor belting and tires. Further, the Company’s contracts for shipping products on its rail and waterborne distribution network typically include provisions for escalations or reductions in the amounts paid by the Company if the price of fuel moves outside a stated range.\n\nPopulation growth and density are typically assessed based on a site’s proximity to one of the megaregions in the United States. Megaregions are large networks of metropolitan population centers covering thousands of square miles. According to\n, a planning and policy program of the Regional Plan Association, most of the nation’s population and economic growth through 2050 will occur in 11 megaregions. The C",
  "item2_clean": null
}