{
  "source_file": "mmc-20241231.htm",
  "form_type": "10-K",
  "item1_clean": "Individual high net worth clients and family offices are serviced by MMA in the U.S. and other Marsh personal lines businesses globally. These businesses provide a single-source solution for high net worth clients and are dedicated to sourcing protections across a broad spectrum of risk. Using a consultative approach, Marsh's HNW practices analyze exposures and customize programs to cover individual clients with complex asset portfolios.\nAdditional Services and Adjacent Businesses\nIn addition to insurance broking, Marsh provides certain other specialist advisory or placement services:\nis a global practice comprising specialists who use data and analytics, including through Marsh’s Blue[i] digital analytics platform. Marsh Advisory’s three main service areas (Consulting, Claims, and Analytics) advise clients on existing and emerging risk exposures, protecting critical business activities and developing strategies to optimize total cost of risk.\nMarsh Captive Solutions\na prominent part of the Marsh Specialty and Global Placement practice, helps organizations of all sizes retain risks through comprehensive and innovative captive solutions. This team is comprised of captive consultants, actuaries and captive management professionals which offer complete, end-to-end captive management services.\nis an international placement broker. This unit’s core strategy is to modernize risk transfer advice and solutions for clients. This is executed through a combination of data solutions, capacity creation vehicles, segmentation, placement platforms (on-shoring solutions within the network), and improved operational efficiency – all designed to yield a better client outcome and experience. The products Bowring Marsh places include property, casualty, terrorism, product recall, and special risks.\nMercer Marsh Benefits\nprovides health benefits brokerage and consulting services to clients of all sizes in numerous countries across the globe, outside of the U.S. As described below, Mercer and Marsh go to market together to provide strategic advice and services to help clients minimize risk, optimize benefits structure, drive efficiencies and maximize employee engagement.\nServices for Insurers\nInsurer Consulting Group (ICG)\nprovides services to insurance carriers. Through Marsh's patented electronic platform, MarketConnect, and sophisticated data analysis, ICG provides insurers with individualized preference setting and risk identification capabilities, as well as detailed performance data and metrics. Insurer consulting teams review performance metrics and preferences with insurers and provide customized consulting services to insurers designed to improve business planning and strategy implementation. ICG services are designed to improve the product offerings available to clients, assist insurers in identifying new opportunities and enhance insurers’ operational efficiency. The scope and nature of the services vary by insurer and by geography.\nGUY CARPENTER\nGuy Carpenter, the Company’s reinsurance intermediary and advisor, generated approximately\nof the Company's total revenue in 2024. Currently, approxi\narpenter colleagues provide clients with a combination of specialized reinsurance broking expertise, strategic advisory services and analytics solutions. Guy Carpenter creates and executes reinsurance and risk management solutions for clients worldwide through risk assessment analytics, actuarial services, highly-specialized product knowledge and trading relationships with reinsurance markets. Client services also include contract and claims management, reinsurance accounting and fiduciary services.\nActing as a broker or intermediary on all classes of reinsurance, Guy Carpenter places two main types of property casualty and life / health reinsurance: treaty reinsurance, which involves the transfer of a portfolio of risks; and facultative reinsurance, which involves the transfer of part or all of the coverage provided by a single insurance policy.\nGuy Carpenter provides reinsurance services in a broad range of centers of excellence, segments and specialties including: Automobile / Motor, Aviation, Captives, Crop/Agriculture, Cyber, Engineering / Construction, Financial Lines, InsurTech, Life / Accident / Health, Marine and Energy, Medical Professional, Personal Lines, Mortgage, Political Risk & Trade Credit, Primary & Excess Casualty, Managing General Agents and Program Manager Solutions, Property, Public Sector, Regional / Mutual, Retrocessional Reinsurance, Surety, Terror, and Workers Compensation / Employer Liability.\nGuy Carpenter also offers clients alternatives to traditional reinsurance, including industry loss warranties and, through its licensed affiliates, capital markets alternatives such as transferring catastrophe risk through the issuance of insurance-linked securities. GC Securities, the Guy Carpenter division of MMC Securities LLC and MMC Securities (Europe) Limited, offers corporate finance solutions, including mergers & acquisitions advice and private debt and equity capital raising, and capital markets-based risk transfer solutions that complement Guy Carpenter's strong industry relationships, analytical capabilities and reinsurance expertise.\nGuy Carpenter also provides its clients with reinsurance-related services, including actuarial, enterprise risk management, financial and regulatory consulting, portfolio analysis and advice on the efficient use of capital. Guy Carpenter's Global Analytics & Advisory (\"GAA\") unit helps clients better understand and quantify the uncertainties inherent in their businesses. Working in close partnership with Guy Carpenter account executives, GAA specialists help support clients' critical decisions in numerous areas, including reinsurance utilization, catastrophe exposure portfolio management, new product and market development, rating agency, regulatory and account impacts, loss reserve risk, capital adequacy and return on capital.\nCompensation for Services in Risk and Insurance Services\nMarsh and Guy Carpenter are compensated for brokerage and consulting services through commissions and fees. Commission rates and fees vary in amount and can depend on a number of factors, including the type of insurance or reinsurance coverage provided, the particular insurer or reinsurer selected, and the capacity in which the broker acts and negotiates with clients. In addition to compensation from its clients, Marsh also receives other compensation, separate from retail fees and commissions, from insurance companies. This other compensation includes, among other things, payments for consulting and analytics services provided to insurers; compensation for administrative and other services (including fees for underwriting services and services provided to or on behalf of insurers relating to the administration and management of quota shares, panels and other facilities in which insurers participate); and contingent commissions, which are paid by insurers based on factors such as volume or profitability of Marsh's placements, primarily driven by MMA and parts of Marsh's international operations.\nMarsh and Guy Carpenter receive interest income on certain funds (such as premiums and claims proceeds) held in a fiduciary capacity for others. For a more detailed discussion of revenue sources and factors affecting revenue in our Risk and Insurance Services segment, refer to Part II, Item 7 (\"Management's Discussion and Analysis of Financial Condition and Results of Operations\") of this report.\nCONSULTING\nThe Company's Consulting segment generated approximately\nof the Company's total revenue in 2024 and employs approxima\nolleagues worldwide. The Company conducts business in this segment through Mercer and Oliver Wyman Group\nMERCER\nMercer is a leading provider in delivering advice, solutions and products that help organizations meet the health, wealth and career needs of a changing workforce. Mercer has approximate\nly 23,300 colleagues based in 48 countries. Clients include a majority of the companies in the Fortune 1000 and FTSE\n100, as well as medium- and small-market organizations, public sector entities and individual customers. Mercer generated approximately\nof the Company's total revenue in 2024.\nMercer operates in the following areas:\nMercer helps public and private sector employers design and manage employee health and welfare programs; administer health benefits and flexible benefits programs, including benefits outsourcing; engage employees with their health benefits through a digital experience; and comply with local benefits-related regulations. Mercer provides a range of advice and solutions to clients, which, depending on the engagement, may include: total health and wellness management strategies; global health brokerage solutions; vendor performance and audit; life and disability management; and measurement of healthcare provider performance. These services are provided through fee-based consulting as well as commission-based brokerage services in connection with the selection of insurance companies and healthcare providers.\nMercer also provides consulting and actuarial services to U.S. state governments to support the purchase of healthcare through state Medicaid programs. Mercer offers clients tools to enhance employee engagement with their health benefits through its Darwin\nSM\nOutside of the U.S., Mercer and Marsh go to market together for Health benefits brokerage and consulting under the Mercer Marsh Benefits\nSM\n(MMB) brand, as described above.\nThrough its Wealth business, Mercer assists clients worldwide in the design, governance and risk management of defined benefit, defined contribution, hybrid retirement plans and other pools of assets, and with investment of those assets.\nMercer provides actuarial consulting, investment consulting, investment management and related services to the sponsors and trustees of pension plans and master trusts. Mercer also provides investment consulting and investment management services to foundations, endowments, sovereign wealth funds, U.S. public sector clients, insurance companies, financial intermediaries, family offices and individuals. Mercer provides retirement plan outsourcing, including administration and delivery of defined benefit and defined contribution retirement benefits.\nThe investment consulting and investment management services provided by Mercer and its affiliates (investment management services may also be referred to as \"investment solutions,\" \"delegated solutions,\" \"fiduciary management\" or \"outsourced Chief Investment Officer (OCIO) services\") cover a range of stages of the investment process, from investment research (through its Mercer-Insight service), asset allocation and implementation of investment strategies to ongoing portfolio management services. Mercer provides these services primarily to institutional and other sophisticated investors including retirement plans (e.g., defined benefit and defined contribution), master trusts, endowments and foundations, sovereign wealth funds, U.S. public sector clients, insurance companies and family offices, as well as wealth managers and other financial intermediaries, primarily through manager of manager strategies and funds sponsored and managed by Mercer. Mercer’s clients invest in both traditional asset classes (e.g., equities, fixed income and cash equivalents) and alternative or private market strategies (e.g., private equity, private debt, real estate, other real assets and hedge funds). As of December 31, 2024, Mercer and its global affiliates had assets under management of approximately\nMercer also provides services to individual retail clients, including financial planning, high net worth risk solutions and other discretionary investment services.\nMercer advises organizations on the engagement, skill assessment, management and reward of employees; the design of executive remuneration programs; people and workforce strategies du",
  "item7_clean": "Guy Carpenter's revenue\nincreased $104 million\n, or 5%, to $2.4 billion in 2024, compared to $2.3 billion in 2023. This reflects an increase of 8% on an underlying basis, partially offset by a decrease of 3% from acquisitions.\nAt Guy Carpenter, underlying revenue growth in 2024 was driven by growth across all regions and global specialties. Revenue in 2023 includes a gain from a legal settlement with a competitor for $58 million, excluding legal fees of approximately $10 million.\nRisk and Insurance Services segment completed\nacquisitions in 2024. Information regarding these acquisitions is included in Note 5, Acquisitions and Dispositions, in the notes to the consolidated financial statements.\nExpenses in the Risk and Insurance Services segment increased $886 million, or 9%, to $11.0 billion in 2024, compared to $10.1 billion in 2023. Expenses reflect a 3% increase\nfrom acquisitions, partially offset by a decrease of\nfrom the impact of foreign currency translation.\nExpenses in 2024 increased primarily due to compensation and benefits driven by higher base salaries and incentive compensation.\nIn 2024, the Company incurred a total of $148 million of restructuring costs in Risk and Insurance Services, compared to $177 million in 2023, primarily related to activities initiated in the fourth quarter of 2022, focused on workforce actions, rationalization of technology and functional services, and reductions in real estate.\nThe Company conducts business in its Consulting segment through Mercer and Oliver Wyman Group. Mercer delivers advice and technology-driven solutions that help organizations redefine the world of work, reshape retirement and investment outcomes, and unlock health and well-being for a changing workforce. Oliver Wyman Group serves as critical strategic, economic and brand advisor to private sector and governmental clients.\nThe major component of revenue in the Consulting business is fees paid by clients for advice and services. Mercer, principally through its health line of business, also earns revenue in the form of commissions received from insurance companies for the placement of group (and occasionally individual) insurance contracts, primarily life, health and accident coverages. Revenue for Mercer’s investment management business and certain of Mercer’s defined benefit and contribution administration services consists principally of fees based on assets under management or administration. For a majority of the Mercer-managed investment funds, revenue is recorded on a gross basis with sub-advisor fees included in other operating expenses.\nRevenue in the Consulting segment is affected by, among other things, global economic conditions, including changes in clients’ particular industries and markets. Revenue is also affected by competition due to the introduction of new products and services, broad trends in employee demographics, including levels of employment and the effect of government policies and regulations. Revenues from investment management services and retirement trust and administrative services are significantly affected by the level of assets under management or administration, which is impacted by securities market performance.\nThe results of operations for the Consulting segment are as follows:\n(In millions, except percentages)\nCompensation and benefits\nOther operating expenses\nOperating income margin\n\nin 2023. Interest expense increased $122 million in 2024, reflecting higher levels of debt from new debt issuances and higher interest rates compared to the prior year. Interest expense in 2024 includes $26 million of financing costs, primarily related to customary upfront fees for the Commitment Letter.\nThe caption \"Investment income\" in the consolidated statements of income comprises realized and unrealized gains and losses from investments. It includes, when applicable, other than temporary declines in the value of securities, mark-to-market increases or decreases in equity investments with readily determinable fair values and equity method gains or losses on its investments in private equity funds. The Company's investments may include direct investments in insurance, consulting or other strategically linked companies and investments in private equity funds. The Company recorded net investment\nincome of $12 million in 2024, compared to $5 million in 2023. The increase in 2024 is primarily driven by higher mark-to-market gains from the Company's investments compared to the prior year.\nIncome and Other Taxes\nThe Company's consolidated effective tax rate for 2024 and 2023 was 24.9% and 24.3%, respectively.\nThe tax rates in both years reflect the impact of discrete tax matters such as excess tax benefits related to share-based compensation, enacted tax legislation, changes in uncertain tax positions, deferred tax adjustments, non-taxable adjustments related to contingent consideration for acquisitions, return to provision adjustments, and valuation allowances for certain tax credits. The 2024 effective tax rate reflects the full impact of the previously enacted change in the U.K. corporate income tax rate from 19% to 25%, which was effective April 1, 2023. The blended U.K. statutory tax rate for 2023 was 23.5%.\nIn 2023, the Company released valuation allowances related to its non-U.S. operations. Management determined that there was sufficient positive evidence to conclude that it was more likely than not that deferred tax assets were realizable, primarily due to the sustained profitability of its operations. The release of valuation allowances resulted in a decrease to tax expense of $94 million in 2023.\nThe effective tax rate may vary significantly from period to period. The effective tax rate is sensitive to the geographic mix of earnings and the cost to repatriate the Company's earnings, which may result in higher or lower effective tax rates. Therefore, a shift in the mix of profits among jurisdictions, or changes in the Company's repatriation strategy to access offshore cash, can affect the effective tax rate. In 2024, pre-tax income in the U.K., Canada, Ireland, India, Bermuda, Germany, Australia, United Arab Emirates, Japan, and Singapore accounted for\napproximately 65% of the Company's total non-U.S. pre-tax income, with effective rates in those countries of 25.0%, 28.0%, 16.3%, 27.9%, 0.0%, 30.9%, 36.7%, 17.6%, 38.2%, and 18.0%, respectively.\nIn addition, losses in certain jurisdictions cannot be offset by earnings from other operations and may require valuation allowances that affect the rate in a particular period, depending on estimates of the value of associated deferred tax assets which can be realized. A valuation allowance was recorded to reduce deferred tax assets to the amount that the Company believes is more likely than not to be realized. Details are provided in Note 7, Income Taxes, in the notes to the consolidated financial statements. The effective tax rate is also sensitive to changes in unrecognized tax benefits, including the impact of settled tax audits and expired statutes of limitations.\nThe Company has established liabilities for uncertain tax positions in relation to potential assessments in the jurisdictions in which it operates. In the third quarter of 2024, the Company received closure notices and assessments from the U.K. tax authority in relation to its 2016-2020 examinations which disallowed certain interest expense deductions. The Company has appealed the assessments and resolving this matter through litigation or alternative dispute resolution may take several years. The Company believes the resolution of tax matters will not have a material effect on the consolidated financial position of the Company. However, an adverse resolution of tax matters from current or future audits or tax litigation could have a material impact on the Company's net income or cash flows and on its effective tax rate in a particular future period.\nChanges in tax laws, rulings, policies, or related legal and regulatory interpretations occur frequently and may have significant favorable or adverse impacts on our effective tax rate. In 2021, the Organization for Economic Cooperation and Development's (\"OECD\") released model rules for a 15% global minimum tax, known as Pillar Two. Pillar Two has now been enacted by most key non-U.S. jurisdictions where the Company operates, including the U.K. and Ireland. This minimum tax is treated as a period cost beginning in 2024 and does not have a material impact on the Company's financial results of operations for the current period. The Company continues to monitor legislative developments, as well as additional guidance from countries that have enacted Pillar Two legislation and will ensure it complies with any changes.\nAs a U.S.-domiciled parent holding company, the Company is the issuer of essentially all of the Company's external indebtedness, and incurs the related interest expense in the U.S. The Company’s interest expense deductions are not currently limited. Further, most senior executive and oversight functions are conducted in the U.S. and the associated costs are incurred primarily in the U.S. Some of these expenses may not be deductible in the U.S., which may impact the effective tax rate.\nChanges to the U.S. tax law in recent years have allowed the Company to repatriate foreign earnings without incurring additional U.S. federal income tax costs as foreign income is generally already taxed in the U.S. However, permanent reinvestment continues to be a component of the Company's global capital strategy. The Company continues to evaluate its global investment and repatriation strategy considering its capital requirements and potential costs of repatriation, which are generally limited to local country withholding taxes.\nLiquidity and Capital Resources\nThe Company is organized as a legal entity separate and distinct from its operating subsidiaries. As the Company does not have significant operations of its own, the Company is dependent upon dividends and other payments from its operating subsidiaries to pay principal and interest on its outstanding debt obligations, pay dividends to shareholders, repurchase its shares and pay corporate expenses. The Company can also provide financial support to its operating subsidiaries for acquisitions, investments and certain parts of their business that require liquidity, such as the capital markets business of Guy Carpenter. Other sources of liquidity include borrowing facilities discussed below in the Financing Cash Flows section.\nThe Company derives a significant portion of its revenue and operating profit from operating subsidiaries located outside of the U.S. Funds from those operating subsidiaries are regularly repatriated to the U.S. out of annual earnings. At December 31, 2024, the Company had approximately $1.4 billion of cash and cash equivalents in its foreign operations, which includes $428 million of operating funds required to be maintained for regulatory requirements or as collateral under certain captive insurance arrangements. The Company expects to continue its practice of repatriating available funds from its non-U.S. operating subsidiaries out of current annual earnings. Where appropriate, a portion of the current year earnings will continue to be permanently reinvested.\nIn 2024, the Company recorded foreign currency translation adjustments which decreased net equity by $569 million. Continued strengthening of the U.S. dollar against foreign currencies would further decrease the translated U.S. dollar value of the Company’s net investments in its non-U.S. subsidiarie\ns, as well as the translated U.S. dollar value of cash repatriations from those subsidiaries.\nCash and cash equivalents on our consolidated balance sheets includes funds available for general corporate purposes. Fiduciary assets are shown separately in the consolidated balance sheets as cash and cash equivalents held in a fiduciary capacity, with a corresponding amount in current liabilities. Fiduciary assets cannot be used for general corporate purposes and should not be considered as a source of liquidity for the Company.\nOperating Cash Flows\nThe Company provided $4.3 billion of cash from operations both in 2024 and in 2023. These amounts reflect the net income of the Company during those periods, excluding gains or losses from investments, adjusted for non-cash charges, and changes in working capital which relate primarily to the timing of payme\nnts of accrued liabilities, including incentive compensation, or receipts of receivables and pension contributions. The Company used cash of $270 million and $271 million related to its restructuring activities in 2024 and 2023, respectively.\nPension Related Items\nThe Company's policy for funding its tax-qualified defined benefit plans is to contribute amounts at least sufficient to meet the funding requirements set forth in accordance with applicable law.\nIn 2024, the Company contributed $34 million to its U.S. defined benefit pension plans and $59 million to its non-U.S. defined benefit pension plans. In 2023, the Company contributed $33 million to its U.S. defined benefit pension plans and $78 million to its non-U.S. defined benefit pension plans.\nIn the U.S., contributions to the tax-qualified defined benefit plans are based on Employee Retirement Income Security Act (\"ERISA\") guidelines and the Company generally expects to maintain a funded status of 80% or more of the liability determined in accordance with the ERISA guidelines. In 2024, the Company made contributions of $32 million to its non-qualified plans and expects to contribute approximately $35 million in\n. The Company also made required contributions of\nto its U.S. qualified plans in 2024. In 2025, the Company is expected to be required to make contributions totaling $2 million to its U.S. qualified plans.\nOutside the U.S., the Company has a large number of non-U.S. defined benefit pension plans, the largest of which are in the U.K., which comprise approximately 78% of non-U.S. plan assets at December 31, 2024. Contribution rates for non-U.S. plans are generally base\nd on local funding practices and statutory requirements, which may differ significantly from measurements in accordance with U.S. GAAP.\nIn the U.K., the assumptions used to determine pension contributions are the result of legally prescribed negotiations between the Company and the plans' trustee that typically occur every three years in conjunction with the actuarial valuation of the plans. Currently, this results in a lower funded status compared to U.S. GAAP and may result in contributions irrespective of the U.S. GAAP funded status.\nIn 2021, the JLT Pension Scheme was merged into the MMC U.K. Pension Fund with a new segregated JLT section created (referred to as the \"JLT section\").\nThe Company contributed $21 million to its U.K. plans, including the JLT section, in 2024. The Company's contributions to its U.K. plans, including the JLT section, for 2025 are expected to be approximately $1 million. The Company made deficit contributions of $20 million to the JLT section in\nand is not required to make any deficit contributions to the JLT section in 2025.\nFor the MMC U.K. Pension Fund, excluding the JLT section, an agreement was reached with the trustee in the fourth quarter of 2022, based on the surplus funding position at December 31, 2021. In accordance with the agreement, no deficit funding is at the earliest required until 2026. The funding level will be re-assessed during 2025 as part of the December 31, 2024 actuarial valuation to determine if contributions are required in 2026. In December 2022, the Company renewed its agreement to support annual deficit contributions that may be required by the U.K. operating companies under certain circumstances, up to £450 million (or $566 million) over a seven-year period. This is part of an agreement which gives the Company greater influence over asset allocation a",
  "item2_clean": null
}