{
  "source_file": "mo-20241231.htm",
  "form_type": "10-K",
  "item1_clean": "sold by USSTC. In addition, the oral tobacco products segment includes\noral nicotine pouches sold by Helix. Substantially all of the oral tobacco products are manufactured and sold to customers in the United States. Total oral tobacco products segment’s shipment volume was 774.7 million units in 2024, a decrease of 1.0% from 2023.\nNJOY contracts with third-party importers to supply all of its products and sells its e-vapor products to customers in the United States.\nNJOY ACE\nis the principal e-vapor product of NJOY. NJOY’s commercialized product portfolio of tobacco and menthol e-vapor products is fully covered by marketing granted orders (“MGO”) from the U.S. Food and Drug Administration (“FDA”).\nOther tobacco products:\nIn connection with the joint venture agreement with JTIUH, Horizon will market and commercialize HTS products, which are defined in the joint venture agreement as products that include both (i) a tobacco heating device intended to heat the consumable without combusting and (ii) a consumable that meets the definition of a cigarette under the U.S. Federal Cigarette Labeling and Advertising Act. Horizon is responsible for the U.S. commercialization of current and future HTS products owned by either party and, upon authorization by the FDA of a pre-market tobacco application (“PMTA”), will become the exclusive entity through which the parties market and commercialize HTS products in the United States. Upon PMTA authorization of\nHTS products, JTIUH will supply\nHTS devices and PM USA will manufacture\nHTS consumables for U.S. commercialization. As of February 26, 2025, there are no products in the U.S. marketplace from the joint venture.\nOn April 30, 2024, we assigned the exclusive U.S. commercialization rights to the\nIQOS Tobacco Heating System\nIQOS\nSystem”) to Philip Morris International Inc. (“PMI”) pursuant to the terms of a purchase agreement entered into with PMI in October 2022. For further discussion of the agreement with PMI see Note 6.\nGoodwill and Other Intangible Assets, net\nto our consolidated financial statements in Item 8 (“Note 6”).\nDistribution, Competition and Raw Materials:\nOur tobacco subsidiaries sell their tobacco products principally to wholesalers (including distributors) and large retail organizations, including chain stores.\nThe market for tobacco products is highly competitive, characterized by brand recognition and loyalty, with product quality, taste, price, product innovation, marketing, packaging and distribution constituting the significant methods of competition. Promotional activities include, in certain instances and where permitted by law, allowances, the distribution of incentive items, price promotions, product promotions, coupons and other discounts.\nIn the United States, under a contract growing program, PM USA purchases the majority of its burley and flue-cured leaf tobaccos directly from domestic tobacco growers. Under the terms of this program, PM USA agrees to purchase the amount of tobacco specified in the grower contracts that meets PM USA’s grade and quality standards. PM USA also purchases a portion of its tobacco requirements through leaf merchants.\nUSSTC purchases dark fire-cured, dark air-cured and burley leaf tobaccos from domestic tobacco growers under a contract growing program. Under the terms of this program, USSTC agrees to purchase the amount of tobacco specified in the grower contracts that meets USSTC’s grade and quality standards.\nMiddleton purchases burley, dark air-cured and flue-cured leaf tobaccos through leaf merchants. Middleton does not have a contract growing program.\nHelix, through an affiliate, and NJOY purchase tobacco-derived nicotine materials from suppliers and believe their suppliers can satisfy current and anticipated future production requirements.\nOur tobacco subsidiaries believe there is an adequate supply of tobacco in the world markets to satisfy their current and anticipated production requirements.\nFor a discussion of our largest customers, including their percentages of our consolidated net revenues for the years ended December 31, 2024, 2023 and 2022, see Note 17.\nExecutive Officers of Altria:\nThe disclosure regarding executive officers is included in Item 10. Directors, Executive Officers and Corporate Governance -\nInformation about Our Executive Officers as of February 14, 2025\nHuman Capital Resources:\nWe believe our workforce is critical to achieving our Vision. Attracting, developing, retaining and deploying the best talent with the skills to make significant progress toward our Vision is a key business priority. Moreover, we recognize the importance of doing business the right way. We believe culture influences employee actions and decision making. This is why we dedicate resources to promoting a vibrant, inclusive workplace; attracting, developing, retaining and deploying talented employees to build a high-performing and diverse talent pipeline; promoting a culture of compliance and integrity; creating a safe workplace; and rewarding and recognizing employees for both the results they deliver and, importantly, how they deliver them.\nOversight and Management\nOur Human Resources department is responsible for managing employment-related matters, including recruiting and hiring, onboarding, compensation and benefits design and implementation, performance management, career management and succession planning and professional and learning development. Our inclusion, diversity and equity efforts are managed by our Corporate Citizenship department. Our Board of Directors (“Board of Directors” or “Board”) and the Compensation and Talent Development Committee provide oversight of human capital matters, including reviewing initiatives and programs related to corporate culture and enterprise-wide talent development.\n“Supporting our People and our Communities” is one of our Responsibility Focus Areas, which includes two goals related to developing a high-performing and diverse talent pipeline: (i) enhance the diversity of our organization and leadership teams while building an inclusive and equitable culture; and (ii) build employee capability and well-being to succeed in uncertain and rapidly changing environments.\nCompensation and Benefits\nOur compensation and benefits programs are designed to help us attract, retain and motivate strong talent. However, we recognize that the decreasing social acceptance of tobacco usage may impact our ability to attract and retain talent with skills necessary for us to achieve our Vision. We work to manage this risk by, among other things, targeting total compensation packages to be above peer companies with which we compete for talent. Depending on employee level, total compensation includes different elements – base salary, annual cash incentives, long-term equity and cash incentives and benefits.\nWe are committed to pay equity across our companies. Based on the most recent annual analysis we conducted in 2024, for employees performing the same or similar duties regardless of any differentiating factors, such as performance and tenure, salaries of our female employees were 98.2% of those of our male employees, and salaries of our employees of color were 98.2% of those of our white employees. If we adjust for differentiating factors that legitimately influence pay, salaries of our female employees were 99.8% of those of our male employees, and salaries of our employees of color were 99.9% of those of our white employees.\nIn addition to cash and equity compensation, we offer generous employee benefits such as significant company contributions to deferred profit sharing plans, consumer-driven health plan coverage, vacation and holiday pay, disability and life insurance. We also offer up to 12 weeks paid family leave to bond with a newborn child, the placement of a child for adoption or foster care, or to care for a family member who has a serious health condition. Our benefits also include physical, emotional and financial wellness programs and family creation assistance benefits, such as reimbursement of surrogacy, adoption assistance and doula expenses. While there is some variability in employee benefits across our companies, the examples we provide are available to most employees.\nWe are also committed to investing in the educational development of our workforce through a tuition refund program for job-related courses or company-related degrees. We also provide eligible employees with a company-funded contribution applied to the employee’s qualified higher education student loans to help reduce student loan debt.\nAttracting, Developing, Retaining and Deploying Talent\nWe are focused on identifying the most qualified talent and investing in leader and employee development to build a diverse talent pipeline prepared and willing to lead at every level. Additionally, we are dedicated to being an inclusive place to work for all employees, regardless of personal background or work function. We recognize the critical importance of these efforts toward pursuing our Vision and believe in the value of a workforce composed of a broad and diverse spectrum of backgrounds, skills, experiences and cultures.\nOur salaried entry-level recruitment efforts focus on building relationships with university students, internship opportunities and partnerships with organizations that support a broad range of students. We complement these recruiting efforts with hiring experienced employees with demonstrated skills and/or leadership capabilities.\nTo help our employees succeed in their roles and develop in their careers, we emphasize ongoing training and leadership development opportunities. Building skills that drive innovation and aligning our employees to our Vision is important for our long-term success. The Human Resources department leads our learning and development efforts partnering with learning professionals embedded in functions throughout our operating and services companies. Employees have access to a wide variety of development programs, including new employee onboarding, in-person, virtual and self-guided training programs, technical training, including training to maintain professional certifications, and our educational refund program for continuing education.\nWe also have an employee recognition program that allows leaders and employees to reward and recognize colleagues for their outstanding performance and everyday excellence.\nWe regularly conduct confidential employee engagement surveys to seek feedback on a variety of topics, including employee satisfaction, support from leadership, corporate culture and culture of compliance. In addition, in 2024, these quarterly employee surveys sought feedback on topics such as workplace flexibility, workload, inclusion, equal opportunity, development opportunities, management support, compliance and understanding of business strategy. Survey results, including comparisons to prior results, are shared with our employees and our Board and are used to modify or enhance our human capital management programs.\nWe also monitor our progress toward building a diverse organization through various metrics, including comparisons to external benchmarks, and report workforce data annually. Our data-driven efforts focus on removing barriers to equal opportunity in compliance with applicable law.\nAs part of our multi-phase\nOptimize & Accelerate\ninitiative (“Initiative”), we plan to increase our organization’s speed, efficiency and effectiveness by centralizing work, outsourcing certain transactional tasks and streamlining, automating and standardizing processes. Our Accelerated Business Solutions (“ABS”) organization will be responsible for driving efficiency and process improvement across our companies in partnership with external service providers. We are implementing organizational design changes to support our enhanced business processes. In addition, we are supporting the workforce with change management plans at the enterp",
  "item7_clean": "Non-GAAP Financial Measures\nWe report our financial results in accordance with GAAP. However, our management also reviews certain financial results, including OCI, OCI margins, net earnings and diluted EPS, on an adjusted basis, which excludes certain income and expense items that our management believes are not part of underlying operations. These items may include, for example, loss on early extinguishment of debt, restructuring charges, asset impairment charges, acquisition, disposition and integration-related items, equity investment-related special items, certain income tax items, charges associated with tobacco and health and certain other litigation items, and resolutions of certain non-participating manufacturer (“NPM”) adjustment disputes under the Master Settlement Agreement (“NPM Adjustment Items”). In addition, our management reviews the ratio of debt-to-Consolidated EBITDA, which we use as a factor to determine our ability to access the capital markets and make investments in pursuit of our Vision. Consolidated EBITDA is calculated in accordance with our Credit Agreement (defined below in\nLiquidity and Capital Resources\n) and includes certain adjustments. Our management does not view any of these special items to be part of our underlying results as they may be highly variable, may be unusual or infrequent, are difficult to predict and can distort underlying business trends and results. Our management also reviews income tax rates on an adjusted basis, which may exclude certain income tax items from our reported effective tax rate.\nDiscussion and Analysis\nCritical Accounting Estimates\nSummary of Significant Accounting Policies\nto our consolidated financial statements in Item 8 (“Note 2”) includes a summary of the significant accounting policies and methods used in the preparation of our consolidated financial statements. In most instances, we must use an accounting policy or method because it is the only policy or method permitted under GAAP.\nThe preparation of financial statements includes the use of estimates and assumptions that affect the reported amounts of assets and liabilities, the disclosure of contingent liabilities at the dates of the financial statements and the reported amounts of net revenues and expenses during the reporting periods. If actual amounts are ultimately different from previous estimates, the revisions are included in our consolidated results of operations for the period in which the actual amounts become known. Historically, the aggregate differences, if any, between our estimates and actual amounts in any year have not had a significant impact on our consolidated financial statements.\nT\nThe following is a review of the more significant assumptions and estimates, as well as the accounting policies and methods, used in the preparation of our consolidated financial statements:\nRevenue Recognition:\nOur businesses generate substantially all of their revenue from sales contracts with customers. Our businesses define net revenues as revenues, which include excise taxes and shipping and handling charges billed to customers, net of cash discounts for prompt payment, sales returns (also referred to as returned goods) and sales incentives. Our businesses exclude from the transaction price sales taxes and value-added taxes imposed at the time of sale.\nOur businesses record sales incentives, which consist of consumer incentives and trade promotion activities, as a reduction to revenues (a portion of which is based on amounts estimated as being due to wholesalers, retailers and consumers at the end of a period) based principally on historical volume, utilization and redemption rates. We include expected payments for sales incentives in accrued marketing liabilities on our consolidated balance sheets.\nFor further discussion, see Note 4.\nRevenues from Contracts with Customers\nto our consolidated financial statements in Item 8.\nDepreciation, Amortization, Impairment Testing and Asset Valuation:\nWe depreciate property, plant and equipment and amortize our definite-lived intangible assets using the straight-line method over the estimated useful lives of the assets. We depreciate machinery and equipment over periods up to 20 years, and buildings and building improvements over periods up to 50 years. We amortize definite-lived intangible assets over their estimated useful lives up to 25 years.\nWe review long-lived assets, including definite-lived intangible assets, for impairment whenever events or changes in business circumstances indicate that the carrying value of the assets may not be fully recoverable. We perform undiscounted operating cash flow analyses to determine if an impairment exists. For purposes of recognition and measurement of an impairment for assets held for use, we group assets and liabilities at the lowest level for which cash flows are separately identifiable. If we determine that an impairment exists, any related impairment loss is calculated based on fair value. We base impairment losses on assets to be disposed of, if any, on the estimated proceeds to be received, less costs of disposal. We also review the estimated remaining useful lives of long-lived assets whenever events or changes in business circumstances indicate the lives may have changed.\nWe conduct a required annual review of goodwill and indefinite-lived intangible assets for potential impairment as of October 1 of each year, and more frequently if an event occurs or circumstances change that would require us to perform an interim review. We have the option of first performing a qualitative assessment to determine whether it is more likely than not that the fair value of a reporting unit or indefinite-lived intangible asset is less than its carrying amount as a basis for determining whether it is necessary to perform a quantitative impairment test. If necessary, we will perform a single step quantitative impairment test. Additionally, we have the option to unconditionally bypass the qualitative assessment and perform a single step quantitative assessment. If the carrying value of a reporting unit that includes goodwill exceeds its fair value, which is determined using discounted cash flows, goodwill is considered impaired. We measure the amount of impairment loss as the difference between the carrying value and the fair value of a reporting unit; however, the amount of the impairment loss is limited to the total amount of goodwill allocated to a reporting unit. If the carrying value of an indefinite-lived intangible asset exceeds its fair value, which is determined using discounted cash flows, we consider the intangible asset to be impaired and reduce the carrying value to fair value in the period identified.\nWe use an income approach to estimate the fair value of our reporting units and trademarks using information available as of the impairment testing date. The income approach reflects the discounting of expected future cash flows at a rate of return that incorporates the risk-free rate for the use of those funds, the expected rate of inflation and the risks associated with realizing expected future cash flows.\nGoodwill by reporting unit and indefinite-lived intangible assets at December 31, 2024 were as follows:\n\ncontrols in connection with the JUUL investment; and (iii) the New York State Office of the Attorney General and the Commonwealth of Massachusetts Office of the Attorney General, separately, issued independent subpoenas to us seeking documents relating to our former investment in and provision of services to JUUL. For a discussion of our disposition of our former investment in JUUL, see Note 8.\nIn April 2023, January 2024, February 2024 and April 2024, we agreed to settle the lawsuits relating to our former investment in JUUL initiated by the attorneys general of Minnesota, Alaska, Hawaii and New Mexico, respectively.\nPrivate Sector Activity on Tobacco Products\nA number of retailers, including national chains, have discontinued the sale of all tobacco products, and others have discontinued the sale of e-vapor products. Reasons for the discontinuation include change in corporate policy and, with respect to e-vapor products, reported illnesses and the uncertain regulatory environment. Furthermore, third-party digital platforms, such as app stores, have restricted, and in some cases prohibited, communications with adult tobacco consumers concerning tobacco products. It is possible that if this private sector activity becomes more widespread it could have an adverse effect on our business, results of operations, cash flows or financial position.\nIllicit Trade in Tobacco Products\nIllicit trade in tobacco products has had, and could continue to have, an adverse impact on our businesses, including the sales volumes and market shares of our operating companies’ innovative and smoke-free products and traditional tobacco products. Illicit trade can take many forms, including the sale of counterfeit tobacco products; the sale of tobacco products that do not comply with the FSPTCA and FDA regulations; the sale of tobacco products in the United States that are intended for sale outside the country; the sale of untaxed tobacco products over the Internet and by other means designed to avoid the collection of applicable taxes; and diversion into one taxing jurisdiction of tobacco products intended for sale in another. Counterfeit tobacco products, for example, are manufactured by unknown third parties in unregulated environments. Counterfeit versions of our products can negatively affect adult tobacco consumer experiences with and opinions of those brands. Illicit disposable e-vapor and oral nicotine pouch products may be designed to appeal to youth and are manufactured without scientific standards, exposing consumers to undocumented risks. Illicit trade in tobacco products also harms law-abiding wholesalers and retailers by depriving them of lawful sales and undermines the significant investment we have made in legitimate distribution channels. Moreover, illicit trade in tobacco products results in federal, state and local governments losing tax revenues. Losses in tax revenues can cause such governments to take various actions, including increasing excise taxes, imposing\nT\nlegislative or regulatory requirements, or asserting claims against manufacturers of tobacco products or members of the trade channels through which such tobacco products are distributed and sold, each of which could have an adverse effect on our business, results of operations, cash flows or financial position.\nWe communicate with wholesale and retail trade members regarding illicit trade in tobacco products and how we can help prevent such activities, enforce wholesale and retail trade programs and policies that address illicit trade in tobacco products and, when necessary, litigate to protect our trademarks. We also engage with the FDA and other government agencies to advocate for a well-regulated U.S. tobacco industry that embraces harm reduction and the enforcement of existing regulatory frameworks.\nProhibitory policies, such as California’s ban on the sale of flavored tobacco products, which went into effect in 2022, can have unintended negative consequences, including the proliferation of counterfeit and unregulated products. We actively engage with regulators, state and federal lawmakers, our trade partners and other stakeholders to bring awareness to these issues. When appropriate, we also take legal action to protect our lawful e-vapor product business, such as the lawsuit we have filed in federal court in California against manufacturers of illicit e-vapor products.\nIn June 2024, the U.S. Department of Justice (“DOJ”) and the FDA announced the creation of a federal multi-agency task force to combat the illegal marketing and sale of e-vapor products in the United States. The announcement noted that, in addition to the DOJ and the FDA, the task force will leverage the criminal and civil law enforcement capabilities of the U.S. Bureau of Alcohol, Tobacco, Firearms and Explosives, U.S. Customs and Border Protection, the U.S. Marshals Service, the U.S. Postal Inspection Service and the FTC and that additional agencies may join the task force in the future. The DOJ and the FDA stated that the task force will focus on many topics, such as investigating and prosecuting new criminal, civil, seizure and forfeiture actions under various U.S. laws, including the FSPTCA.\nPrice, Availability and Quality of Tobacco, Other Raw Materials, Ingredients and Component Parts\nShifts in crops (such as those driven by economic conditions, adverse weather patterns and natural disasters), government restrictions and mandated prices, production control programs, economic trade sanctions, import duties and tariffs, international trade disruptions, labor disruptions, inflation, geopolitical instability, climate and environmental changes and disruptions due to man-made or natural disasters may increase the cost or reduce the supply or quality of tobacco and other raw materials, ingredients and component parts used to manufacture our operating companies’ products. Any significant change in the nature or consequences of these factors could negatively impact our ability to continue manufacturing and marketing existing products, increase our costs or negatively impact adult tobacco consumer product acceptability and have a material adverse effect on our business and profitability.\nAs with other agricultural commodities, tobacco price, quality and availability can be influenced by variations in weather patterns and natural disasters, including those caused by climate change, and macroeconomic conditions and imbalances in supply and demand, among other factors. For varieties of tobacco only available in limited geographies, government-mandated prices and production control programs, political instability or government prohibitions on the import or export of tobacco in certain countries pose additional risks to price, availability and quality. As consumer demand increases for innovative smoke-free products and decreases for combustible and MST products, the volume of tobacco leaf required for production of these products has decreased, resulting in reduced tobacco leaf demand. Reduced demand for tobacco leaf may result in the reduced supply and availability of domestic tobacco and increased costs, as growers divert resources to other crops or cease farming. Macroeconomic factors, such as tariffs, may exacerbate reductions in demand for tobacco leaf by increasing the cost of purchasing tobacco leaf from a supplier in another country. The unavailability or unacceptability of any one or more particular varieties of tobacco leaf or the unavailability of nicotine extract necessary to manufacture our operating companies’ products could negatively impact our ability to continue marketing existing products or impact adult tobacco consumer product acceptability, which could have a material adverse effect on our business and profitability. In addition, the nicotine used in our operating companies’ innovative smoke-free products is extracted from tobacco produced in one country. If we are unable to identify alternate sources of nicotine for our operating companies’ innovative products, we could be exposed to supply risk.\nCurrent geopolitical and macroeconomic conditions (including tariffs, inflation, high interest rates, labor shortages, supply and demand imbalances and international armed conflict) and adverse weather events have caused and continue to cause worldwide disruptions and delays to supply chains and commercial markets, which limit access to, and increase the cost of, raw materials, ingredients and component parts (for example, wood tips used in our cigar products and aluminum used in our packaging). As consumer demand increases for innovative smoke-free products and decreases for combustible and MST products, the volume of raw materials, ingre",
  "item2_clean": null
}