{
  "source_file": "mo-20250930.htm",
  "form_type": "10-Q",
  "item1_clean": null,
  "item7_clean": null,
  "item2_clean": "Prior period amounts have been recast to conform with current period presentation for amortization of intangibles, which we did not previously identify as a special item and we now exclude from our adjusted financial measures. See\nNon-GAAP Financial Measures\nFor a discussion of special items and other business drivers affecting the comparability of statements of earnings amounts and reconciliations of adjusted earnings and adjusted diluted EPS, see\nConsolidated Operating Results\nFewer Shares Outstanding:\nFewer shares outstanding were due to shares we repurchased under our share repurchase programs.\nThe increase of $35 million in operations (which excludes the impact of special items shown in the table above) was due primarily to higher OCI.\nFor further details, see\nConsolidated Operating Results\nOperating Results by Business Segment\nNon-GAAP Financial Measures\nWe report our financial results in accordance with GAAP. However, our management also reviews certain financial results, including OCI, OCI margins, net earnings and diluted EPS, on an adjusted basis, which excludes certain income and expense items that our management believes are not part of underlying operations. These items may include, for example, loss on early extinguishment of debt, restructuring charges, asset impairment charges, acquisition, disposition and integration-related items,\nequity investment-related special items, certain income tax items, charges associated with tobacco and health and certain other litigation items, resolutions of certain non-participating manufacturer (“NPM”) adjustment disputes under the Master Settlement Agreement (“NPM Adjustment Items”) and amortization expense associated with definite-lived intangible assets (“amortization of intangibles”). In addition, our management reviews the ratio of debt-to-Consolidated EBITDA, which we use as a factor to determine our ability to access the capital markets and make investments in pursuit of our Vision. Consolidated EBITDA is calculated in accordance with our Credit Agreement (defined below in\nLiquidity and Capital Resources\n) and includes certain adjustments. Our management does not view any of these special items to be part of our underlying results as they may be highly variable, may be unusual or infrequent, are difficult to predict and can distort underlying business trends and results. Our management also reviews income tax rates on an adjusted basis, which may exclude certain income tax items from our reported effective tax rate.\nBeginning in the first quarter of 2025, we changed our treatment of our amortization of intangibles that we previously included in our adjusted results, including adjusted net earnings and adjusted diluted EPS, and now treat this expense as a special item and exclude it from our adjusted results. Amortization of intangibles is significantly impacted by the timing, frequency and size of acquisitions, each with unique facts and circumstances, which could result in amortization charges that could be inconsistent in size and timing. Net revenues generated from these definite-lived intangible assets during the periods presented, if applicable, are included in our adjusted financial measures.\nDiscussion and Analysis\nCritical Accounting Estimates\nGoodwill and Other Intangible Assets Impairment Testing\nWe conduct a required annual review of goodwill and indefinite-lived intangible assets for potential impairment, and more frequently if an event occurs or circumstances change that would require an interim quantitative impairment assessment. There have been no events or changes in circumstances that indicate an interim quantitative impairment assessment was required for the three months ended September 30, 2025. We will perform our annual impairment testing during the fourth quarter of 2025.\nE-Vapor Reporting Unit Goodwill\nAt December 31, 2024, the estimated fair value of the e-vapor reporting unit exceeded its carrying value by approximately 28% ($0.3 billion). As further discussed in Note 4.\nGoodwill and Other Intangible Assets, net\n(“Note 4”), we determined the estimated fair value of the e-vapor reporting unit as of March 31, 2025 was below its carrying value and recorded a non-cash goodwill impairment of $873 million for the three months ended March 31, 2025 in our condensed consolidated statements of earnings. As of March 31, 2025, after recording the goodwill impairment, the carrying value of goodwill within the e-vapor reporting unit was $895 million. In addition, the carrying value of the e-vapor reporting unit’s net assets (including the effect of intercompany debt), which was negative, approximated its estimated fair value.\nAt March 31, 2025, we used an income approach to estimate the fair value of the e-vapor reporting unit. Due to the uncertainties discussed below, our discounted cash flows are based on a range of scenarios that consider certain potential regulatory and market outcomes. In performing the discounted cash flow analysis, we made various judgments, estimates and assumptions, the most significant of which were volume, revenue, income, operating margins, perpetual growth rate and discount rates. The discount rates used in performing the valuation ranged from 12.0% to 15.0%.\nAdditionally, in determining these significant assumptions, we made judgments regarding our expectations for the future state of the e-vapor category and NJOY’s business, including the (i) timing and extent of effective enforcement against illicit flavored disposable e-vapor products; (ii) timing and likelihood of regulatory authorizations of e-vapor products, including of NJOY’s products; (iii) timing of the commercialization of NJOY e-vapor products in the United States; (iv) long-term growth of the e-vapor category; and (v) conversion rates of illicit flavored disposable e-vapor consumers to lawful e-vapor products and, specifically, NJOY’s e-vapor products. Fair value calculations are sensitive to changes in these estimates and assumptions, some of which relate to broader macroeconomic conditions and governmental actions outside of our control.\nAlthough our discounted cash flow analyses are based on assumptions that we consider reasonable using the best available information as of March 31, 2025, we used significant judgment in determining future cash flows. In addition to the judgments discussed above, the following factors also have the potential to impact our assumptions and, therefore, our impairment conclusions: general macroeconomic conditions; governmental actions, including FDA regulatory actions and inaction; changes in the e-vapor category growth (decline) rates as a result of changing adult tobacco consumer preferences; success of planned new product extensions; competitive activity; unfavorable outcomes with respect to litigation proceedings, including actions brought against us alleging patent infringement; and income and excise taxes. For further discussion of these factors, see\nOperating Results by Business Segment - Business Environment\nWe believe that the estimated fair value of the e-vapor reporting unit at March 31, 2025 remains reasonable and there are no events or circumstances indicating an impairment for the three months ended September 30, 2025. If the assumptions or judgments regarding the expectations for the future state of the e-vapor category and NJOY’s business discussed above fail to materialize as anticipated, if we experience unfavorable outcomes with respect to litigation proceedings (including actions alleging patent infringement), or if the discount rate used to estimate the fair value increases, we could have additional non-cash impairments of our e-vapor reporting unit goodwill in future periods, which could be material. A hypothetical 1% increase to the discount rate used to estimate the fair value of the e-vapor reporting unit as of March 31, 2025 would have resulted in an additional goodwill impairment charge of approximately $275 million in the first quarter of 2025.\nSkoal Trademark Indefinite-Lived Intangible Asset\nAt December 31, 2024, the estimated fair value of the\ntrademark exceeded its carrying value by approximately 7% ($0.3 billion). MST products, including\n, continued to be negatively impacted due in part to evolving adult tobacco consumer preferences, which have continued to contribute to reductions in sales volumes for MST products, including\n. For further discussion, see\nTrends and Developments\nOperating Results by Business Segment - Business Environment - Summary\nWe believe that the estimated fair value of the\ntrademark at December 31, 2024 remains reasonable and there are no events or circumstances indicating an impairment for the three months ended September 30, 2025. If the decline in sales volume for\nis higher than currently estimated and results in material revenue declines, we believe there may be a material adverse effect on the significant assumptions used in performing our valuation. If\n’s actual revenue and income or long-term outlook are significantly unfavorable compared to forecasted performance used to estimate the fair value or if the discount rate used to estimate the fair value increases, we could have material non-cash impairments of the\ntrademark in future periods. Based on the 2024 annual impairment test, a hypothetical 1% increase to the discount rate used would have resulted in a pre-tax impairment charge to the\nintangible asset of approximately $85 million.\nFor further discussion of goodwill and other intangible assets, including the impairments of the e-vapor reporting unit goodwill in the first quarter of 2025 and the\ntrademark in the second quarter of 2024, see Note 4.\nConsolidated Operating Results\nFor the Nine Months Ended September 30,\nFor the Three Months Ended September 30,\n\nBusiness Environment - Summary\nNine Months Ended September 30, 2025 Compared with Nine Months Ended September 30, 2024\nOur oral tobacco products segment’s reported domestic shipment volume decrease"
}