{
  "source_file": "moh-20241231.htm",
  "form_type": "10-K",
  "item1_clean": "minimum loss ratio thresholds and adjustments for permissible rate variations by age, geographic area, and variations in plan design. In the year ended December 31, 2024, Marketplace program PMPM premium rates ranged from $400 to $1,980.\nMember Enrollment and Marketing\nOur Marketplace members enroll in our plans with the assistance of insurance agents employed by Molina, outside brokers, vendors, direct to consumer marketing, and via the Internet.\nWhile our Marketplace sales activities are regulated by CMS (such as eligibility determinations), our marketing activities are regulated by the individual states in which we operate. Some states require us to obtain prior approval of our marketing materials, others simply require us to provide them with copies of our marketing materials, and some states do not request our marketing materials. We are able to freely contact our members and provide them with marketing materials as long as those materials are fair and do not discriminate.\nOur Marketplace sales and marketing strategy is to provide high quality, affordable, compliant and consumer-centric Marketplace products through a variety of distribution channels. Our Marketplace products are displayed on the Federally Facilitated Marketplace (“FFM”) and the State Based Marketplace (“SBM”) in the states in which we participate in the Marketplace. We also contract with independent, licensed insurance agents to market our Marketplace products. The activities of our independently licensed insurance agents are also regulated by both\nCMS and the departments of insurance in the states in which we participate. Our sales cycle typically peaks during the annual Open Enrollment Period (“OEP”) as defined and regulated by CMS and the applicable FFM and SBM\nTRENDS AND UNCERTAINTIES\nREGULATORY DEVELOPMENTS AND RELATED TRENDS\nFederal Economic Stabilization and Other Programs\nThe COVID-19 pandemic was the worst public health crisis of the last 100 years, and a national public health emergency (“PHE”) was declared. The surge of COVID-19 cases, hospitalizations, and testing requirements put increased pressure on medical costs in 2020 and 2021. The increases were more than offset by a reduction in non-COVID related costs, including the postponement and cancellation of elective procedures; however, many of our state Medicaid partners implemented medical cost risk corridors, which resulted in increased rebate payments back to the states. The impact of the pandemic began to decrease in 2022, as the high levels of vaccination, widespread population immunity, and available treatments significantly reduced the risk of severe COVID-19 disease, hospitalization, and death.\nThe Consolidated Appropriations Act of 2023 authorized states to resume redeterminations and terminate coverage for ineligible enrollees starting on April 1, 2023, irrespective of the status of the PHE. Consequently, all states in which we operate had begun disenrolling members, resulting in a loss of members that were gained due to the suspension of redetermination for Medicaid eligibility during the PHE.\nThe PHE officially ended on May 11, 2023. There are several healthcare programs tied to the PHE which were impacted by this change in policy. These include coverage of COVID-19 testing and vaccines, changes to the Medicare fee schedule for COVID-related treatments, and free coverage of at-home COVID-19 diagnostic tests. Per federal statutory and regulatory requirements, some of these programs concluded with the end of the PHE, while some continued through 2024, and some are expected to remain in place permanently.\nEnrollment and Premium Revenue\nExcluding acquisitions and our exit from Puerto Rico, we estimate we added approximately one million new Medicaid members since March 31, 2020, when we first began to report on the impacts of the pandemic. We believe this membership increase was mainly due to the suspension of redeterminations for Medicaid eligibility. Due to the resumption of redeterminations discussed above, we estimate we lost approximately 675,000 members, based on our experience to date. The medical cost profile of members who have been disenrolled is more favorable than the Medicaid segment average, and when combined with higher utilization in our continuing population, our Medicaid MCR for the year ended December 31, 2024 was higher than our expectations and above our long-term target. Based on the experience to date, we expect that we will ultimately retain approximately 30% of the membership gained since March 31, 2020.\nLEGISLATIVE AND POLITICAL ENVIRONMENT\nPRESSURES ON FUNDING\nDue to states’ budget challenges and political agendas at both the state and federal levels, there are a number of different legislative proposals being considered, some of which would involve significantly reduced federal or state spending on the Medicaid and Medicare programs, constitute a fundamental change to the federal role in healthcare and, if enacted, could have a material adverse effect on our business, financial condition, cash flows, or results of operations. These proposals include elements such as the following, as well as numerous other potential changes and reforms:\nChanges in the entitlement nature of Medicaid (and perhaps Medicare as well) by capping future increases in federal health spending for these programs, reducing the FMAP, paid to states by the federal government, overall or solely for the ACA Medicaid expansion population in states, and shifting much more of the risk for health costs in the future to states and consumers;\nReversing the ACA’s expansion of Medicaid that enables states to cover low-income childless adults;\nChanging Medicaid to a state block grant program, including potentially capping spending on a per-enrollee basis;\nRequiring Medicaid beneficiaries to work;\nLimiting the amount of lifetime benefits for Medicaid beneficiaries;\nRaising Medicare eligibility to age 67; and\nIn some states, shifting to an alignment of Medicaid and Medicare for dual eligible members.\nRecently, members of the U.S. House of Representatives have started to weigh a series of legislative proposals targeting Medicaid, Medicare, and other entitlement programs as part of a broader campaign to reduce federal spending, and they may pursue these spending cuts in exchange for their support of raising the debt ceiling, the legal cap that allows the U.S. government to borrow money to pay its bills. In addition, President Trump has issued a number of executive orders intended to reduce government spending, and we expect there will be continued proposals targeting reimbursement methodologies and the number of individuals eligible for government healthcare programs.\nAFFORDABLE CARE ACT\nIn addition to past proposals calling for the full repeal of the Affordable Care Act - proposals which could be renewed again in the future - proposed changes and reforms to the ACA have included, or may include, the following:\nEliminating or reducing the advanced premium tax credits and cost sharing reductions for low-income individuals who purchase their health insurance through the Marketplaces;\nExpanding and encouraging the use of private health savings accounts;\nProviding for insurance plans that offer fewer and less extensive health insurance benefits than under the ACA’s essential health benefits package, including broader use of catastrophic coverage plans, or short-term health insurance;\nEstablishing and funding high risk pools or reinsurance programs for individuals with chronic or high-cost conditions; and\nAllowing insurers to sell insurance across state lines.\nThe passage of any of these changes or other reforms could have a material adverse effect on our business, financial condition, cash flows, or results of operations.\nOPERATIONS\nQUALITY\nOur long-term success depends, to a significant degree, on the quality of the services we provide. We are focused on providing our members effective and appropriate access to care at the right time and in the right setting, including preventive health and wellness and care management. We offer our government customers, members and providers reliable service and a seamless experience.\nAs of December 31, 2024, 19 of our health plans were accredited by the National Committee for Quality Assurance (“NCQA”), and 17 of our health plans have earned NCQA’s Health Equity Accreditation, which is awarded to organizations that lead the market in providing culturally and linguistically sensitive services and work to reduce disparities in health care. Additionally, eight health plans earned NCQA’s Long Term Services and Supports Distinction. We believe that these objective measures of quality are important to state Medicaid agencies, as a growing number of states link reimbursement and patient assignment to quality scores.\nIn October 2022, CMS published its updated Medicare 2023 Star Ratings based on plan year 2021 data. For the 2023 Star Ratings, five of our plans had a decrease of 0.5 Stars, two of our plans had a decrease of 1 Star, one plan had a decrease of 1.5 Stars, and two plans either maintained or increased Star Ratings by 0.5. The decreases to the 2023 Star Ratings impacted the 2024 bonus year payments.\nIn October 2023, CMS published its updated Medicare 2024 Star Ratings based on plan year 2022 data. For the 2024 Star Ratings, three of our plans had a decrease of 0.5 Stars, one of our plans had a decrease of 1 Star, four plans maintained their ratings, and one plan had an increase of 0.5 Stars. The decreases to the 2024 Star Ratings impact the 2025 bonus year payments.\nIn October 2024, CMS published its updated Medicare 2025 Star Ratings based on plan year 2023 data. For the 2025 Star Ratings, six plans maintained their ratings, two plans had an increase of 0.5 Stars, and one plan had an increase of 1 Star, and three of our plans had a decrease of 0.5 Stars. The 2025 Star Rating included an additional plan reaching 3.5 Stars, strengthening our 2026 rebates.\nApproximately 45% of our 2025 Medicare premium revenue is not impacted by Star Ratings. We are actively working on improvement plans and remain committed to invest in these programs to improve our quality Star scores with a focus on member experience and access measures.\nFor the states where our health plans are accredited by the NCQA and/or have Medicare Star Ratings, the table below presents such health plans’ NCQA status, as well as their current scores as part of the Medicare Star Ratings, which measures the quality of Medicare plans across the country using a 5-star rating system.\nPROVIDERS\nWe arrange healthcare services for our members through contracts with a vast network of providers, including independent physicians and physician groups, hospitals, ancillary providers, and pharmacies. We strive to ensure that our providers have the appropriate expertise and cultural and linguistic experience.\nThe quality, depth and scope of our provider network are essential if we are to ensure quality, cost-effective care for our members. In partnering with quality, cost-effective providers, we utilize clinical and financial information derived by our medical informatics function, as well as the experience we have gained in serving Medicaid members, to gain insight into the needs of both our members and our providers.\nWe contract with both primary care physicians and specialists, many of whom are organized into medical groups or independent practice associations. Primary care physicians provide office-based primary care services. Primary care physicians may be paid under capitation or fee-for-service contracts and may receive additional compensation by providing certain preventive care services. Under capitation payment arrangements, healthcare providers receive fixed, pre-arranged monthly payments per enrolled member, whereas under fee-for-service payment arrangements, healthcare providers are paid a fee for each particular service rendered. Our specialists care for pa",
  "item7_clean": "(In millions, except per-share amounts)\nLess: medical care costs\nMCR\nGeneral and administrative expenses\nPremium tax expenses\nDepreciation and amortization\nIncome before income tax expense\nNet income per diluted share\nDiluted weighted average shares outstanding\nOther Key Statistics:\nEffective income tax rate\nMCR represents medical care costs as a percentage of premium revenue.\nG&A ratio represents general and administrative expenses as a percentage of total revenue.\nAfter-tax margin represents net income as a percentage of total revenue.\nCONSOLIDATED RESULTS\nNET INCOME AND OPERATING INCOME\nNet income amounted to $1,179 million, or $20.42 per diluted share in 2024, compared with net income of $1,091 million, or $18.77 per diluted share, in 2023.\nOperating income was $1,707 million in 2024, compared with $1,573 million in 2023. The increase in operating income was mainly due to the impact of increased premiums and medical margin stemming from our membership growth, improved G&A expense ratio, and increased investment income, partially offset by an increase in the consolidated MCR. In addition, the 2023 results reflect a $41 million credit loss related to 2022 Marketplace risk adjustment receivables.\nPREMIUM REVENUE\nPremium revenue increased $6.1 billion, or 19%, in 2024, when compared with 2023. The higher premium revenue reflects the impact of a balanced combination of the new Medicaid contract wins, acquisitions, and growth in our current footprint, partially offset by the impact of Medicaid redeterminations.\nMEDICAL CARE RATIO\nThe consolidated MCR increased to 89.1% in 2024, compared with 88.1% in 2023, or 100 basis points, and was slightly above our long-term range. The increase is driven mainly by our Medicaid segment, mainly reflecting the continued impact of redetermination-related acuity shifts, higher utilization among our continuing population, particularly in the second half of 2024, and higher initial MCRs related to new contracts, expansion and the My Choice acquisition, partially offset by minimum MLRs and medical cost corridors, continued disciplined medical cost management and year-over-year improvement in our Medicaid and Marketplace segments. See further discussion in “Reportable Segments—Segment Financial Performance,” below.\nPrior year reserve development has been favorable in 2024, but its impact on earnings has been mostly absorbed by minimum MLRs and medical cost corridors.\nPREMIUM TAX REVENUE AND EXPENSES\nThe premium tax ratio increased to 3.7% in 2024, compared with 3.2% in 2023, due mainly to the reinstatement of the California MCO tax by the state’s Department of Health Care Services effective April 1, 2023, and changes in business mix.\nINVESTMENT INCOME\nInvestment income increased to $452 million in 2024, compared with $394 million in 2023. The increase was primarily driven by an increase in invested assets.\nOTHER REVENUE\nOther revenue increased slightly to $85 million in 2024, compared with $80 million in 2023. Other revenue mainly includes service revenue associated with long-term services and supports consultative services we provide in Wisconsin.\nGENERAL AND ADMINISTRATIVE (“G&A”) EXPENSES\nThe G&A ratio was 6.7% in 2024, compared to 7.2% in 2023. The G&A ratio in 2024 reflects operating discipline, including labor cost management and vendor management, and the continued benefit of fixed cost leverage as we grow our business, partially offset by new business implementation costs associated with the Nebraska and California Medicaid contracts that started in January 2024 and the New Mexico Medicaid contract that started on July 1, 2024.\nDEPRECIATION AND AMORTIZATION\nDepreciation and amortization was $186 million in 2024, compared with $171 million in 2023. The increase is due to impacts of the My Choice Wisconsin and Bright Health Medicare acquisitions.\nOTHER OPERATING EXPENSES\nOther operating expenses totaled $100 million in 2024, compared with $128 million in 2023. The change is primarily due to the $41 million credit loss on 2022 Marketplace risk adjustment receivables recorded in the third quarter of 2023. This was partially offset by increases in non-recurring costs associated with acquisitions. Other operating expenses also include service costs associated with long-term services and supports consultative services we provide in Wisconsin, as noted above.\nINTEREST EXPENSE\nInterest expense was $118 million in 2024, compared with $109 million in 2023. The increase is due to borrowings under the Credit Facility occurring in the third quarter of 2024 and the new $750 million 6.250% Notes due 2033 that were issued in November 2024.\nINCOME TAXES\nIncome tax expense amounted to $410 million in 2024, or 25.8% of pretax income, compared with income tax expense of $373 million in 2023, or 25.5% of pretax income. The difference in the effective tax rate is primarily due to an increase in state and local income taxes and differences in discrete tax benefits recognized in the respective periods, net of a decrease in nondeductible expenses.\nREPORTABLE SEGMENTS\nAs of December 31, 2024, we served approximately 5.5 million members eligible for Medicaid, Medicare, and other government-sponsored healthcare programs for low-income families and individuals, including Marketplace members, most of whom receive government premium subsidies.\nWe currently have reportable segments consisting of: 1) Medicaid; 2) Medicare; 3) Marketplace; and 4) Other.\nThe Medicaid, Medicare, and Marketplace segments represent the government-funded or sponsored programs under which we offer managed healthcare services. The Other segment, which is insignificant to our consolidated results of operations, includes long-term services and supports consultative services in Wisconsin.\nSee \"Item 1. Business,” for further description of our segments.\nHOW WE ASSESS PERFORMANCE\nWe derive our revenues primarily from health insurance premiums. Our primary customers are state Medicaid agencies and the federal government.\nThe key metrics used to assess the performance of our Medicaid, Medicare, and Marketplace segments are premium revenue, medical margin and medical care ratio (“MCR”). MCR represents the amount of medical care costs as a percentage of premium revenue. Therefore, the underlying medical margin, or the amount earned by the Medicaid, Medicare, and Marketplace segments after medical costs are deducted from premium revenue, represents the most important measure of earnings reviewed by management, and is used by our chief executive officer, who is our chief operating decision maker, to review results, assess performance, and allocate resources. The key metric used to assess the performance of our Other segment is service margin. The service margin is equal to service revenue minus cost of service revenue.\nManagement’s discussion and analysis of the change in medical margin is discussed below under “Segment Financial Performance.” For more information, see Notes to Consolidated Financial Statements, Note 16, “Segments.”\nTRENDS AND UNCERTAINTIES\nFor a discussion of the trends, uncertainties and other developments that affected our reportable segments, refer to “Item 1. Business—Our Business,” “—Trends and Uncertainties,” “—Legislative and Political Environment,” “—Operations—Medical Management,” and “—Regulation.”\nSEGMENT FINANCIAL PERFORMANCE\nThe following table summarizes our membership by segment as of the dates indicated:\nThe tables below summarize premium revenue, medical margin, and MCR by segment for the periods indicated (dollars in millions):\nYear Ended December 31,\nMCR\nMCR\nKey factors affecting results for this segment include:\nOur growth initiatives, including acquisitions and expansion into new states, drove an increase in member months during the year, despite the impact of redeterminations, and changes in membership mix;\nImpact of redetermination, including the loss of approximately 675,000 members, and a moderate impact from the effect of acuity shifts, net of the beneficial impact of risk corridors; and\nContinued focus on managing medical costs amid higher-than-expected utilization, particularly in LTSS, pharmacy and behavioral health services.\nMedicaid premium revenue increased $4.3 billion, or 16% in 2024, when compared with 2023. The higher premium revenue reflects new contract wins in Iowa (commenced in July 2023), Nebraska (commenced in January 2024), and New Mexico (commenced in July 2024), expansions in California and Texas that commenced in January 2024, and September 2024, respectively, and the My Choice acquisition that closed in September 2023. These increases were partially offset by the impact of Medicaid redetermination.\nThe medical margin of our Medicaid program increased $6 million in 2024, when compared with 2023. The change was driven by the impact of increased premium revenues associated with the membership growth discussed above, partially offset by an increase in the MCR, as discussed below.\nThe Medicaid MCR increased 160 basis points to 90.3% in 2024, from 88.7% in 2023. The increase was mainly attributable to the continued impact of redetermination-related acuity shifts, higher utilization among our continuing population, particularly in the second half of the year, and a temporal dislocation between premium rates and medical trend. Also, approximately 30 basis points of the increase is driven by the higher initial MCR associated with the start of new contracts and the My Choice acquisition, and approximately 20 basis points was due to a prior year retroactive premium rate reduction in our California business. The increase was partially offset by minimum MLR and medical cost corridors, and medical cost management. Excluding new contracts and the My Choice acquisition, our legacy Medicaid MCR for the year ended December 31, 2024 is above our long-term target range.\nKey factors affecting results for this segment include:\nPricing and benefit design changes implemented in 2024;\nIncreased utilization of LTSS benefits, high-cost drugs, and outpatient services; and\nThe impact of risk-adjusted premiums that are more commensurate with the acuity of our membership.\nMedicare premium revenue increased $1.4 billion, or 33%, in 2024 compared to 2023. The increase was primarily due to the Bright Health Medicare acquisition that closed on January 1, 2024, the impact of MAPD and D-SNP membership expansion and organic membership growth in existing states, and increased premiums that are more commensurate with the acuity of our population.\nThe medical margin for Medicare increased $215 million in 2024 compared to 2023. The increase was mainly due to the year-over-year growth in membership and premium revenues combined with the decrease in MCR discussed below.\nThe Medicare MCR decreased to 89.1% in 2024, from 90.7% in 2023, or 160 basis points, primarily driven by higher risk adjustment premiums that are commensurate with the acuity of our membership, pricing and benefit design changes implemented in 2024 and operational improvements, partially offset by elevated LTSS and pharmacy costs and higher outpatient utilization within our D-SNP population. The Medicare MCR for the year ended December 31, 2024 is above our long-term target range.\nKey factors affecting results for this segment include:\nExecution of our product and pricing strategy, to achieve growth and repositioning in the metallic tier membership mix, while maintaining target margins; and\nAchievement of member risk scores and associated risk-adjusted premium that are commensurate with the health status, or acuity, of our Marketplace members.\nMarketplace premium revenue increased $483 million in 2024 compared to 2023. The increase was mainly due to an increase in membership. Our Marketplace membership as of December 31, 2024, amounted to 403,000 members, representing an increase of 122,000 members compared to December 31, 2023, which is in line with our\nproduct and pricing strategy to achieve growth, while maintaining target margins in this segment, and membership gained from redeterminations this year.\nThe Marketplace medical margin increased $118 million in 2024, primarily due to the growth in premiums and margin associated with the higher membership and the impact of MCR changes discussed below.\nThe Marketplace MCR was 75.4% in 2024 and 75.3% in 2023. The MCR in each year reflects our product and pricing strategy to achieve growth and maintain target margins, changes in membership mix, risk adjustment premiums that are more commensurate with the acuity of our membership, and continued operational improvements. Our 2024 Marketplace MCR was well below our long-term target range.\nThe Other segment includes service revenues and costs associated with the long-term services and supports consultative services we provide in Wisconsin, and also includes certain corporate amounts not allocated to the Medicaid, Medicare, or Marketplace segments. Such amounts were immaterial to our consolidated results of operations for 2024 and 2023.\nLIQUIDITY, FINANCIAL CONDITION AND CAPITAL RESOURCES\nLIQUIDITY\nWe manage our cash, investments, and capital structure to meet the short- and long-term obligations of our business while maintaining liquidity and financial flexibility. We forecast, analyze, and monitor our cash flows to enable prudent investment management and financing within the confines of our financial strategy.\nWe maintain liquidity at two levels: 1) the regulated health plan subsidiaries; and 2) the parent company.\nOur regulated health plan subsidiaries’ primary liquidity requirements include payment of medical claims and other health care services; payment of certain settlements with our state and federal customers, such as minimum medical loss ratio and risk corridors and Marketplace risk transfers on behalf of CMS; general and administrative costs directly incurred or paid through an administrative services agreement to the parent company; and federal tax payments to the parent company under an intercompany tax sharing agreement. Our regulated health plan subsidiaries meet their liquidity needs by generating cash flows from operating activities, primarily from premium revenue; cash flows from investing activities, including investment income and sales of investments; and capital contributions received from our parent company.\nOur regulated health plan subsidiaries are each subject to applicable state regulations that, among other things, require the maintenance of minimum levels of capital and surplus. We continue to maintain levels of aggregate excess statutory capital and surplus in our regulated health plan subsidiaries that we believe are appropriate. See further discussion under “Regulatory Capital and Dividend Restrictions” below. When available and as permitted by applicable regulations, cash in excess of the capital needs of our regulated health plan subsidiaries is generally paid in the form of dividends to our parent company to be used for general corporate purposes. The regulated health plan subsidiaries paid dividends to the parent company amounting to $997 million in 2024 and $705 million in 2023.\nParent company liquidity requirements generally consist of payment of administrative costs not directly incurred by our regulated operations, including, but not limited to, staffing costs, lease payments, branding and certain information technology services; capital contributions paid to our regulated health plan subsidiaries, including funding for newer health plans; capital expenditures; debt service; funding for common stock purchases, acquisitions and other growth-related activities; and federal tax payments. The parent company contributed capital of $490 million and $221 million in 2024 and 2023, respectively, to our regulated health plan subsidiaries to satisfy statutory capital and surplus requirements. The higher contributions in 2024 were mainly attributed to fund our California, Iowa, Nebraska, and Wisconsin health plans. Our",
  "item2_clean": null
}