{
  "source_file": "mos-20250930.htm",
  "form_type": "10-Q",
  "item1_clean": null,
  "item7_clean": null,
  "item2_clean": "Gross margin as a percent of net sales\nSales volume (in thousands of metric tonnes)\nPhosphate produced in Brazil\nPotash produced in Brazil\nPurchased nutrients for distribution\nTotal Mosaic Fertilizantes Segment Tonnes\nRealized prices ($/tonne)\nAverage finished product selling price\nBrazil MAP price (delivered price to third party)\nPurchases ('000 tonnes)\nPotash from Mosaic/Canpotex\nAverage cost per unit consumed in cost of goods sold:\nAmmonia (metric tonne)\nBlended rock (metric tonne)\nProduction volume (in thousands of metric tonnes)\n______________________________\nExcludes internally produced volumes used in purchased nutrients for distribution.\nAverage finished product selling price is calculated as finished goods sales revenue divided by finished goods sales volumes. The prior year amount has been recast to exclude revenue from non-finished goods.\nThree months ended September 30, 2025 and September 30, 2024\nThe Mosaic Fertilizantes segment’s net sales increased to $1.6 billion for the three months ended September 30, 2025, from $1.4 billion during the same period of the prior year. The $193.0 million increase in net sales was driven by approximately $190 million of higher finished product sales prices, partially offset by slightly lower sales volumes, which unfavorably impacted net sales by approximately $20 million. Additionally, both higher sales prices and volumes of other products, primarily gypsum, contributed positively, adding approximately $20 million to net sales.\nOur average finished product selling price was $518 per tonne for the three months ended September 30, 2025, compared to $447 per tonne for the same period a year ago due to the factor discussed in the Overview.\nThe Mosaic Fertilizantes segment’s sales volumes of finished products decreased 3% for the three months ended September 30, 2025, compared to the same period a year ago.\nGross margin for the Mosaic Fertilizantes segment increased to $182.4 million for the three months ended September 30, 2025, from $127.9 million in the same period of the previous year. This increase was primarily driven by higher average selling prices during the current year period, which contributed approximately $190 million compared to the prior year period. This benefit\nwas partially offset by higher product costs of approximately $140 million in our distribution operations, along with a decrease in sales volumes, which reduced gross margin by approximately $25 million. Additionally, foreign currency changes positively impacted gross margin by approximately $40 million in the current year period.\nThe average consumed price for ammonia for our Brazilian operations increased to $576 per tonne for the three months ended September 30, 2025, compared to $572 per tonne in the prior year period. The average consumed sulfur price for our Brazilian operations increased to $325 per long ton for the three months ended September 30, 2025, compared to $170 per long ton in the prior year period. The purchase prices of ammonia and sulfur are driven by global supply and demand, and also include transportation, transformation and storage costs.\nThe Mosaic Fertilizantes segment’s production of crop nutrient dry concentrates and animal feed ingredients increased 6% for the three months ended September 30, 2025, compared to the prior year period. For the three months ended September 30, 2025, our phosphate operating rate increased to 84%, compared to 78% in the same period of the prior year.\nFor the three months ended September 30, 2025 and 2024, our Brazilian phosphate rock production was 1.1 million tonnes. We are temporarily idling our Patrocínio mine in Brazil for the months of November and December due to elevated ore inventory levels.\nNine months ended September 30, 2025 and 2024\nThe Mosaic Fertilizantes segment’s net sales were $3.7 billion for the nine months ended September 30, 2025, compared to $3.3 billion in the same period of the prior year. The current period's net sales benefited by approximately $290 million in higher average finished goods sales prices and by approximately $50 million of higher finished goods sales volumes for distribution, compared to the prior year period. Additionally, both higher sales prices and volumes of other products, primarily gypsum, contributed positively, adding approximately $30 million to net sales\nThe average finished product selling price increased $42 per tonne, to $486 per tonne for the nine months ended September 30, 2025, compared to $444 per tonne in the prior year period, primarily due to the continued improvement in global prices mentioned in the Overview and the mix of products sold.\nThe Mosaic Fertilizantes segment’s sales volume increased to 6.9 million tonnes for the nine months ended September 30, 2025, from 6.8 million tonnes in the same period a year ago.\nGross margin for the nine months ended September 30, 2025 increased to $471.1 million from $304.9 million in the same period in the prior year. This improvement was primarily driven by approximately $290 million in higher average selling prices. This benefit was partially offset by approximately $160 million of higher costs for distribution products and approximately $60 million from the impact of lower sales volumes in the current year period. Current period gross margin benefited by approximately $10 million due to lower maintenance turnaround costs. Favorable foreign currency changes contributed approximately $60 million in the current year period, and improved margins on other products contributed approximately $10 million.\nThe Mosaic Fertilizantes segment’s production of crop nutrient dry concentrates and animal feed ingredients increased 6% compared to the prior year period. Our phosphate operating rate increased to 82% for the nine months ended September 30, 2025 compared to 77% in the same period of the prior year.\nFor the nine month period ended September 30, 2025, our Brazilian phosphate rock production increased to 3.1 million tonnes, from 3.0 million tonnes in the prior year period.\nCorporate, Eliminations and Other\nIn addition to our three operating segments, we assign certain costs to Corporate, Eliminations and Other, which is presented separately in Note 18 to our Notes to Condensed Consolidated Financial Statements. Corporate, Eliminations and Other includes the results of the China and India distribution businesses, intersegment eliminations, including profit on intersegment sales, unrealized mark-to-market gains and losses on derivatives and debt expenses.\nFor the three months ended September 30, 2025, gross margin for Corporate, Eliminations and Other was $(9.9) million, compared to $24.7 million for the same period in the prior year. Gross margin in the current year was unfavorably impacted by approximately $27 million from net unrealized loss on derivatives, primarily on foreign currency derivatives, compared to a net\nunrealized gain of approximately $38 million in the prior year period. Sales in China and India, collectively, resulted in revenue of $112.4 million and gross margin of $13.2 million in the current year period, compared to revenue of $111.1 million and gross margin of $15.9 million in the prior year period. The China and India gross margin was unfavorably impacted by lower sales volumes in India in the current year period, compared to the prior year period.\nFor the nine months ended September 30, 2025, gross margin for Corporate, Eliminations and Other was $60.1 million, compared to $(70.3) million for the same period in the prior year. Gross margin in the current year was favorably impacted by approximately $83 million from net unrealized gains on derivatives, primarily on foreign currency derivatives, compared to a net unrealized loss of approximately $21 million in the prior year. Sales in China and India, collectively, resulted in revenue of $392.3 million and gross margin of $53.2 million\nin the current year period, compared to revenue of $361.2 million and gross margin of $25.9 million in the prior year period. The China and India gross margin was favorably impacted by higher average selling prices in the current year period, compared to the prior year period.\nOther Income Statement Items\nSelling, general and administrative expenses\nOther operating expense\nInterest expense, net\nForeign currency transaction gain (loss)\nNM\nNM\nOther income (expense)\nNM\nNM\nProvision for income taxes\nNM\nEquity in net earnings of nonconsolidated companies\nSelling, General and Administrative Expenses\nSelling, general and administrative expenses for the three months ended September 30, 2025 decreased by $22.7 million compared to the same period of prior year. The current year quarter includes approximately $8 million in higher consulting and professional services costs, while the prior year quarter reflected the addition of a $32 million bad debt reserve in our Mosaic Fertilizantes segment.\nSelling, general and administrative expenses for the nine months ended September 30, 2025 increased $31.9 million compared to the same period of prior year, primarily driven by higher incentive compensation and employee benefit costs of approximately $27 million and higher consulting and professional services costs of approximately $7 million.\nOther Operating Expense\nFor the three months ended September 30, 2025, other operating expenses were $87.0 million, down from $153.2 million reported for the same period of the prior year. Other operating expenses for the current period were approximately $100 million lower than the prior year, primarily due to the timing of annual annual asset retirement obligation (“\nARO\n”) revisions, which will be recorded in the fourth quarter of the current year. The current year period also benefited from reduced environmental and legal reserves of approximately $20 million compared to the current year period. The current year amount includes an impairment loss of approximately $73 million related to the planned sale of the Taquari"
}