{
  "source_file": "mpc-20241231.htm",
  "form_type": "10-K",
  "item1_clean": "Our Canton refinery is located south of Cleveland, Ohio. The Canton refinery processes sweet and sour crude oils, including production from the nearby Utica Shale, into gasoline, distillates, asphalt, propane, NGLs and petrochemicals and heavy fuel oil. The Canton refinery has earned designation as an OSHA VPP Star site.\nMandan, North Dakota Refinery (71 mbpcd)\nOur Mandan refinery is located outside of Bismarck, North Dakota. The Mandan refinery processes primarily sweet domestic crude oil from North Dakota into gasoline, distillates, heavy fuel oil, propane and NGLs and petrochemicals.\nSalt Lake City, Utah Refinery (68 mbpcd)\nOur Salt Lake City refinery is the largest in Utah and is located north of downtown Salt Lake City. The Salt Lake City refinery processes crude oil from Utah, Colorado, Wyoming and Canada into gasoline, distillates, heavy fuel oil, NGLs and petrochemicals and propane.\nWest Coast Region (552 mbpcd\nLos Angeles, California Refinery (365 mbpcd)\nOur Los Angeles refinery is located in Los Angeles County, near the Los Angeles Harbor. The Los Angeles refinery is the largest refinery on the West Coast and is a major producer of cleaner burning CARB fuels. The Los Angeles refinery processes heavy crude oil from California’s San Joaquin Valley and Los Angeles Basin, as well as crude oils from the Alaska North Slope, South America, West Africa and other international sources, into CARB gasoline and CARB diesel fuel, as well as conventional gasoline, distillates, NGLs and petrochemicals, propane and heavy fuel oil.\nAnacortes, Washington Refinery (119 mbpcd)\nOur Anacortes refinery is located north of Seattle on Puget Sound. The Anacortes refinery processes Canadian crude oil, domestic crude oil from North Dakota and the Alaska North Slope and international crude oils into gasoline, distillates, heavy fuel oil, propane and NGLs and petrochemicals.\nKenai, Alaska Refinery (68 mbpcd)\nOur Kenai refinery is located on the Cook Inlet, southwest of Anchorage. The Kenai refinery processes mainly Alaska domestic crude oil, domestic crude oil from North Dakota, along with limited international crude oil into distillates, gasoline, heavy fuel oil, asphalt, NGLs and petrochemicals and propane.\nRefined Product Yields\nThe following table sets forth our refinery production by product group for each of the last three years.\nNGLs and petrochemicals\nT\nWe obtain the crude oil we refine through negotiated term contracts and purchases or exchanges on the spot market. Our term contracts generally have market-related pricing provisions. The following table provides information on our sources of crude oil for each of the last three years. The crude oil sourced outside of North America was acquired from various foreign national oil companies, production companies and trading companies.\nOur refineries receive crude oil and other feedstocks and distribute our refined products through a variety of channels, including pipelines, trucks, railcars, ships and barges.\nRefined Product Sales\nOur refined products are sold to independent retailers, wholesale customers, our brand jobbers and direct dealers. In addition, we sell refined products for export to international customers. As of December 31, 2024, there were 7,738 brand jobber outlets in 39 states, the District of Columbia and Mexico where independent entrepreneurs primarily maintain Marathon-branded outlets. We also have long-term supply contracts for 1,161 direct dealer locations primarily in Southern California, largely under the ARCO\nbrand. We believe we are one of the largest wholesale suppliers of gasoline and distillates to resellers and consumers within our market area.\nThe following table sets forth our refined product sales volumes by product group for each of the last three years.\nNGLs and petrochemicals\nRefined product sales include volumes marketed directly to end-users and trading/supply volumes such as bulk sales to large unbranded resellers and other downstream companies. Marketed volumes directly to end-users, including branded retail stations, were 2,429 mbpd, 2,385 mbpd and 2,356 mbpd for the years ended December 31, 2024, 2023 and 2022, respectively.\nRefined Product Sales Destined for Export\nWe sell gasoline, distillates and asphalt for export, primarily out of our Garyville, Galveston Bay, Anacortes and Los Angeles refineries. The following table sets forth our refined product sales destined for export by product group for the past three years.\nGasoline and Distillates\nWe sell gasoline, gasoline blendstocks and distillates (including No. 1 and No. 2 fuel oils, jet fuel, kerosene and diesel) to wholesale customers, branded jobbers, direct dealers and on the spot market. In addition, we sell diesel fuel and gasoline for export to international customers. The demand for gasoline and distillates is seasonal in many of our markets, with demand typically at its highest levels during the summer months.\nNGLs and Petrochemicals\nWe are a producer and marketer of NGLs and petrochemicals. Product availability varies by refinery and includes, among others, propylene, butane, xylene, benzene, cumene and toluene. We market these products domestically to customers in the chemical,\nT\nagricultural and fuel-blending industries. In addition, we produce fuel-grade coke at our Garyville, Detroit, Galveston Bay and Los Angeles refineries, which is used for power generation and in miscellaneous industrial applications, and anode-grade coke at our Los Angeles and Robinson refineries, which is used to make carbon anodes for the aluminum smelting industry.\nWe have refinery-based asphalt production capacity of 143 mbpcd, which includes asphalt cements, polymer-modified asphalt, emulsified asphalt, industrial asphalts and roofing flux. We have a broad customer base, including asphalt-paving contractors, resellers, government entities (states, counties, cities and townships) and asphalt roofing shingle manufacturers. We sell asphalt in the domestic and export wholesale markets via rail, barge and vessel.\nWe produce propane at all of our refineries. Propane is primarily used for home heating and cooking, as a feedstock within the petrochemical industry, for grain drying and as a fuel for trucks and other vehicles. Our propane sales are split approximately 80 percent and 20 percent between the home heating market and industrial/petrochemical consumers, respectively.\nWe produce and market heavy residual fuel oil or related components, including slurry, at all of our refineries. Heavy residual fuel oil is primarily used in the utility and ship bunkering (fuel) industries, though there are other more specialized uses of the product.\nRefining & Marketing Joint Ventures\nWe hold a 49.9 percent ownership interest in ethanol production facilities in Albion, Michigan; Logansport, Indiana; Greenville, Ohio and Denison, Iowa. These plants have a combined ethanol production capacity of approximately 405 million gallons per year and are managed by our joint venture partner, The Andersons, Inc. (“The Andersons”).\nWe hold a 49.9 percent equity interest in LF Bioenergy, an emerging producer of renewable natural gas (“RNG”) in the U.S. LF Bioenergy has been focused on developing and growing a portfolio of dairy farm-based, low carbon intensity RNG projects. Currently, there are four facilities in operation, with three additional facilities under construction that are expected to come online over the next 12 months.\nTerminals and Transportation\nWe transport, store and distribute crude oil, feedstocks and refined products through pipelines, terminals and marine fleets owned by MPLX and third parties in our market areas.\nWe own a fleet of transport trucks and trailers for the movement of refined products and crude oil. In addition, we maintain a fleet of leased and owned railcars for the movement and storage of refined products.\nThe locations and detailed information about our Refining & Marketing assets are included under Item 2. Properties and are incorporated herein by reference.\nCompetition, Market Conditions and Seasonality\nThe downstream petroleum business is highly competitive, particularly with regard to accessing crude oil and other feedstock supply and the marketing of refined products. We compete with a number of other companies to acquire crude oil for refinery processing and in the distribution and marketing of a full array of refined products.\nWe compete in four distinct markets for the sale of refined products—wholesale, including exports, spot, branded and retail distribution. Our marketing operations compete with numerous other independent marketers, integrated oil companies and high-volume retailers. We compete with companies in the sale of refined products to wholesale marketing customers, including private-brand marketers and large commercial and industrial consumers; companies in the sale of refined products on the spot market; and refiners or marketers in the supply of refined products to refiner-branded independent entrepreneurs. In addition, we compete with producers and marketers in other industries that supply alternative forms of energy and fuels to satisfy the requirements of our industrial, commercial and retail consumers.\nMarket conditions in the oil and gas industry are cyclical and subject to global economic and political events and new and changing governmental regulations. Our operating results are affected by price changes in crude oil, natural gas and refined products, as well as changes in competitive conditions in the markets we serve. Price differentials between sweet and sour crude oils, ANS, WTI and MEH crude oils and other market structure impacts also affect our operating results.\nDemand for gasoline, diesel fuel and asphalt is higher during the spring and summer months than during the winter months in most of our markets, primarily due to seasonal increases in highway traffic and construction. As a result, the operating results for our Refining & Marketing segment for the first and fourth quarters may be lower than for those in the second and third quarters of each calendar year.\nT\nThe Midstream segment primarily includes the operations of MPLX, our sponsored MLP, and certain related operations retained by MPC.\nMPLX\nMPLX owns and operates a network of crude oil, natural gas and refined product pipelines and has joint ownership interests in crude oil, refined products and other pipelines. MPLX also owns and operates light products terminals, storage assets and maintains a fleet of owned and leased towboats and barges in support of fuels distribution on behalf of MPC. MPLX’s assets also include natural gas gathering systems and natural gas processing and NGL fractionation complexes.\nMPC-Retained Midstream Assets and Investments\nWe own four Jones Act medium range product tankers, three Jones Act 750 Series ATB vessels and have ownership interests in several crude oil and refined products pipeline systems and pipeline companies.\nThe locations and detailed information about our Midstream assets are included under Item 2. Properties and are incorporated herein by reference.\nCompetition, Market Conditions and Seasonality\nOur Midstream operations face competition for natural gas gathering, crude oil transportation and in obtaining natural gas supplies for our processing and related services; in obtaining unprocessed NGLs for gathering, transportation and fractionation; and in marketing our products and services. Competition for natural gas supplies is based primarily on the location of gas gathering systems and gas processing plants, operating efficiency and reliability, residue gas and NGL market connectivity, the ability to obtain a satisfactory price for products recovered and the fees charged for the services supplied to the customer. Competition for oil supplies is based primarily on the price and scope of services, location of gathering/transportation and storage facilities and connectivity to the best priced markets. Competitiv",
  "item7_clean": "MPLX\nBaa2 (stable outlook)\nBBB (stable outlook)\nBBB (stable outlook)\nThe ratings reflect the respective views of the rating agencies and should not be interpreted as a recommendation to buy, sell or hold MPLX securities. Although it is our intention to maintain a credit profile that supports an investment-grade rating for MPLX, there is no assurance that these ratings will continue for any given period of time. The ratings may be revised or withdrawn entirely by the rating agencies if, in their respective judgments, circumstances so warrant. A rating from one rating agency should be evaluated independently of ratings from other rating agencies.\nThe agreements governing MPLX’s debt obligations do not contain credit rating triggers that would result in the acceleration of interest, principal or other payments in the event that MPLX credit ratings are downgraded. However, any downgrades of MPLX senior unsecured debt to below investment grade ratings could increase the applicable interest rates, yields and other fees payable under such agreements. In addition, a downgrade of MPLX senior unsecured debt ratings to below investment-grade levels may limit MPLX’s ability to obtain future financing, including to refinance existing indebtedness.\nSee Item 8. Financial Statements and Supplementary Data – Note 19 for further discussion of MPLX’s debt.\nCapital Requirements\nMPC’s capital investment outlook for 2025 totals approximately $1.25 billion for capital projects and investments, excluding capitalized interest, potential acquisitions, if any, and MPLX’s capital investment plan. MPC’s 2025 capital investment outlook\nT\nincludes all of the planned capital spending for Refining & Marketing, Renewable Diesel and Corporate as well as a portion of the planned capital investments for Midstream. The remainder of the planned capital spending for Midstream reflects the capital investment plan for MPLX. We continuously evaluate our capital plan and make changes as conditions warrant. The 2025 capital investment outlook for MPC and MPLX and capital expenditures and investments for each of the last three years are summarized by segment below.\n(Millions of dollars)\nCapital expenditures and investments:\nRefining & Marketing\nTotal MPC, excluding MPLX\nCapital expenditures include changes in capital accruals.\nExcludes capitalized interest of $56 million, $55 million and $103 million for 2024, 2023 and 2022, respectively. The 2025 capital investment plan excludes capitalized interest.\nThe 2025 capital investment outlook for Midstream - MPLX excludes $242 million of capital expenditures, which is expected to be incurred primarily by MPC and other MPLX customers on MPLX’s behalf. This reimbursable capital will be included in the 2025 MPC Midstream capital expenditures.\nRefining & Marketing\nThe Refining & Marketing segment’s forecasted 2025 capital spending and investments is approximately $1.20 billion. This amount includes approximately $100 million of value enhancing capital for multi-year low carbon initiatives. At our Los Angeles refinery, we are advancing improvements to enhance the competitiveness of the refinery by improving reli\nability and lowering costs. The improvements focus on integrating and modernizing utility systems and increasing energy efficiency, with the added benefit of addressing upco\nming regulation mandating further reductions in emissions. The improvements are expected to be completed by the end of 2025. There is also $750 million of value enhancing capital, which includes a multi-year project to upgrade high sulfur distillate to ULSD and maximize distillate volume expansion at our Galveston Bay refinery, which is expected to be completed by the end of 2027, a project at our Robinson refinery to shift yields to higher value products including the flexibility to maximize jet production to meet growing demand, which is expected to be completed by the end of 2026, and other traditional projects that will enhance the yields of our refineries, improve energy efficiency, and lower our costs as well as investments in our branded marketing footprint. Maintenance capital is expected to be approximately $350 million, which is essential to maintain the safety, integrity and reliability of our assets.\nMajor capital projects completed over the last three years have focused on refinery optimization, production of higher value products, increased capacity to upgrade residual fuel oil and expanded export capacity. We also focused on projects such as the STAR project at our Galveston Bay refinery and projects expected to reduce future operating costs.\nMPLX’s capital investment outlook totals approximately $2.0 billion, net of reimbursements and excluding capitalized interest and potential acquisitions, if any, and includes approximately $1.7 billion of growth capital and $300 million of maintenance capital. MPLX’s growth plans are focused on expanding its Permian to Gulf Coast integrated value chain, progressing long-haul pipeline value enhancing projects to support producer activity, and investing in new gas processing plants in the Marcellus and Permian. The remainder of its capital plan targets the expansion of crude gathering pipelines in the Permian and Bakken basins, and the debottlenecking of existing assets to meet customer demand.\nMajor capital projects over the last three years included investments for the development of natural gas and natural gas liquids infrastructure to support MPLX’s producer customers, primarily in the Marcellus, Utica and Permian regions and development of various crude oil and refined petroleum products infrastructure projects.\nThe Renewable Diesel segment’s forecasted 2025 capital spending and investments is approximately $5 million. Major projects over the last three years included investments in the Martinez Renewables joint venture and the Green Bison Soy Processing joint venture.\nT\nThe 2025 capital forecast includes approximately $45 million to support corporate and other activities. Major projects over the last three years included upgrades to information technology systems.\nFrom January 1, 2012 through December 31, 2024, our board of directors approved $60.05 billion in total share repurchase authorizations and we have repurchased a total of $52.30 billion of our common stock. As of December 31, 2024, MPC had $7.75 billion remaining under its share repurchase authorizations, which reflects the repurchase of 203,173 common shares for $28 million that were transacted in the fourth quarter of 2024 and settled in the first quarter of 2025. The table below summarizes our total share repurchases for the last three years. See Item 8. Financial Statements and Supplementary Data – Note 9 for further discussion of the share repurchase plans.\n(In millions of dollars, except per share data)\nNumber of shares repurchased\nCash paid for shares repurchased\nAverage cost per share\nWe may utilize various methods to effect the repurchases, which could include open market repurchases, negotiated block transactions, tender offers, accelerated share repurchases or open market solicitations for shares, some of which may be effected through Rule 10b5-1 plans. The timing and amount of future repurchases, if any, will depend upon several factors, including market and business conditions, and such repurchases may be suspended or discontinued at any time.\nMPLX Unit Repurchases\nThe table below summarizes MPLX’s total unit repurchases for the last three years.\n(In millions of dollars, except per unit data)\nNumber of common units repurchased\nCash paid for common units repurchased\nAverage cost per unit\nAs of December 31, 2024, MPLX had approximately $520 million remaining under its unit repurchase authorization. The repurchase authorization has no expiration date.\nMPLX may utilize various methods to effect the repurchases, which could include open market repurchases, negotiated block transactions, accelerated unit repurchases, tender offers or open market solicitations for units, some of which may be effected through Rule 10b5-1 plans. The timing and amount of future repurchases, if any, will depend upon several factors, including market and business conditions, and such repurchases may be discontinued at any time.\nSee Item 8. Financial Statements and Supplementary Data – Note 5 for further discussion of the MPLX unit repurchase program.\nMaterial Cash Commitments\nContractual Obligations\nWe have purchase commitments primarily consisting of obligations to purchase and transport crude oil and feedstocks used in our refining operations. As of December 31, 2024, we had purchase obligations for crude oil, NGLs and renewable feedstocks of $17.18 billion, with $14.50 billion payable within 12 months, and crude oil transportation obligations of $7.98 billion, with $892 million payable within 12 months. These contracts include variable price arrangements. For purposes of this disclosure, we have estimated prices to be paid primarily based on futures curves for the commodities to the extent available. Our contractual obligations do not include our contractual obligations to MPLX under various fee-based commercial agreements as these transactions are eliminated in the consolidated financial statements.\nAt December 31, 2024, we had non-cancelable obligations to acquire property, plant and equipment of $260 million, which is all payable within 12 months.\nAt December 31, 2024, we had an aggregate principal amount of outstanding senior notes of $26.90 billion, with $2.95 billion payable within 12 months, and interest on the debt of $16.49 billion, with $1.17 billion payable within 12 months. See Item 8. Financial Statements and Supplementary Data – Note 19 for additional information on our debt. We intend to repay the short-term maturities with existing cash on hand and/or with the proceeds of new long-term debt, depending on, among other things, market conditions.\nT\nOur other contractual obligations primarily consist of pension and post-retirement obligations, finance and operating leases and environmental credits liabilities, for which additional information is included in Item 8. Financial Statements and Supplementary Data – Notes 24, 26 and 22, respectively.\nOther Cash Commitments\nOn January 24, 2025, we announced our board of directors approved a $0.91 per share dividend, payable March 10, 2025 to shareholders of record at the close of business on February 19, 2025.\nWe may, from time to time, repurchase our senior notes and preferred units in the open market, in tender offers, in privately-negotiated transactions or otherwise in such volumes, at such prices and upon such other terms as we deem appropriate.\nTRANSACTIONS WITH RELATED PARTIES\nSee Item 8. Financial Statements and Supplementary Data – Note 7 for discussion of activity with related parties.\nENVIRONMENTAL MATTERS AND COMPLIANCE COSTS\nWe have incurred and may continue to incur substantial capital, operating and maintenance, and remediation expenditures as a result of environmental laws and regulations. If these expenditures, as with all costs, are not ultimately reflected in the prices of our products and services, our operating results will be adversely affected. We believe that substantially all of our competitors must comply with similar environmental laws and regulations. However, the specific impact on each competitor may vary depending on a number of factors, including the age and location of its operating facilities, marketing areas, production processes and whether it is also engaged in the petrochemical business or the marine transportation of crude oil and refined products.\nLegislation and regulations pertaining to fuel specifications, climate change and GHG emissions have the potential to materially adversely impact our business, financial condition, results of operations and cash flows, including costs of compliance and permitting delays. The extent and magnitude of these adverse impacts cannot be reliably or accurately estimated at this time because specific regulatory and legislative requirements have not been finalized and uncertainty exists with respect to the measures being considered, the costs and the time frames for compliance, and our ability to pass compliance costs on to our customers.\nOur environmental expenditures, including non-regulatory expenditures, for each of the last three years were:\n(Millions of dollars)\nOperating and maintenance\nBased on the American Petroleum Institute’s definition of environmental expenditures.\nThese amounts include spending charged against remediation reserves, where permissible, but exclude non-cash provisions recorded for environmental remediation.\nWe accrue for environmental remediation activities when the responsibility to remediate is probable and the amount of associated costs can be reasonably estimated. As environmental remediation matters proceed toward ultimate resolution or as additional remediation obligations arise, charges in excess of those previously accrued may be required.\nNew or expanded environmental requirements, which could increase our environmental costs, may arise in the future. It is not possible to predict all of the ultimate costs of compliance, including remediation costs that may be incurred and penalties that may be imposed.\nOur environmental capital expenditures accounted for 22 percent, 12 percent and 7 percent of capital expenditures for 2024, 2023 and 2022, respectively, excluding acquisitions. Our environmental capital expenditures are expected to be approximately $298 million, or 9 percent, of total planned capital expenditures in 2025. Actual expenditures may vary as the number and scope of environmental projects are revised as a result of improved technology or changes in regulatory requirements and could increase if additional projects are identified or additional requirements are imposed.\nFor more information on environmental regulations that impact us, or could impact us, see Item 1. Business\nRegulatory Matters and Item 1A. Risk Factors.\nT\nCRITICAL ACCOUNTING ESTIMATES\nThe preparation of financial statements in accordance with GAAP requires us to make estimates and assumptions that affect the reported amounts of assets and liabilities and the disclosure of contingent assets and liabilities as of the date of the consolidated financial statements and the reported amounts of revenues and expenses during the respective reporting periods. Accounting estimates are considered to be critical if (1) the nature of the estimates and assumptions is material due to the levels of subjectivity and judgment necessary to account for highly uncertain matters or the susceptibility of such matters to change; and (2) the impact of the estimates and assumptions on financial condition or operating performance is material. Actual results could differ from the estimates and assumptions used. See Item 8. Financial Statements and Supplementary Data – Note 2 for additional information on these policies and estimates, as well as a discussion of additional accounting policies and estimates.\nFair Value Estimates\nFair value is the price that would be received to sell an asset or paid to transfer a liability in an orderly transaction between market participants at the measurement date. There are three approaches for measuring the fair value of assets and liabilities: the market approach, the income approach and the cost approach, each of which includes multiple valuation techniques. The market approach uses prices and other relevant information generated by market transactions involving identical or comparable assets or liabilities. The income approach uses valuation techniques to measure fair value by converting future amounts, such as cash flows or earnings, into a single present value amount using current market expectations about those future amounts. The cost approach is based on the amount that would currently be required to replace the service capacity of an asset. This is often referred",
  "item2_clean": null
}