{
  "source_file": "mrk-20250930.htm",
  "form_type": "10-Q",
  "item1_clean": null,
  "item7_clean": null,
  "item2_clean": "(pembrolizumab and berahyaluronidase alfa-pmph) injection for subcutaneous administration across most solid tumor indications for\n, and subsequently approved\nfor the treatment of certain adult patients with resectable locally advanced HNSCC so that\nis now approved across all solid tumor indications for\nLynparza is an oral poly (ADP-ribose) polymerase (PARP) inhibitor being developed and commercialized as part of a collaboration with AstraZeneca PLC (AstraZeneca) (see Note 3 to the condensed consolidated financial statements). Lynparza is approved for the treatment of certain types of advanced or recurrent ovarian, early or metastatic breast, metastatic pancreatic and metastatic castration-resistant prostate cancers. Alliance revenue related to Lynparza increased 12% in both the third quarter and first nine months of 2025, primarily due to higher demand in the U.S. and certain international markets. In January 2025, China’s NMPA approved Lynparza as adjuvant treatment for adult patients with germline\nBRCA\n-mutated, HER2-negative high-risk early breast cancer, based on the OlympiA trial.\nLenvima (lenvatinib) is an oral receptor tyrosine kinase inhibitor being developed and commercialized as part of a collaboration with Eisai Co., Ltd. (Eisai) (see Note 3 to the condensed consolidated financial statements). Lenvima is approved for the treatment of certain types of thyroid cancer, RCC, hepatocellular carcinoma (HCC), in combination with everolimus for certain patients with advanced RCC, and in combination with\nfor certain patients with advanced endometrial carcinoma or advanced RCC. Alliance revenue related to Lenvima increased 3% in both the third quarter and first nine months of 2025, primarily due to higher sales in the U.S. reflecting increased demand that was partially offset by lower net pricing. In June 2025, Lenvima plus\nwas approved in China in combination with transarterial chemoembolization for the treatment of patients with unresectable, non-metastatic HCC based on the LEAP-012 clinical trial.\n, for the treatment of adult patients with certain von Hippel-Lindau (VHL) disease-associated tumors, certain adult patients with previously treated advanced RCC, and certain patients with pheochromocytoma and paraganglioma, rose 42% in both the third quarter and first nine months of 2025 primarily due to higher demand in the U.S. and continued launch uptake in certain international markets, particularly in the EU, partially offset by lower net pricing in the U.S.\nhas received the following regulatory approvals thus far in 2025.\nEC conditional approval as monotherapy for the treatment of adult patients with VHL disease who require therapy for associated, localized RCC, central nervous system hemangioblastomas, or pancreatic neuroendocrine tumors, and for whom localized procedures are unsuitable, based on the LITESPARK-004 trial.\nEC conditional approval for the treatment of adult patients with advanced clear cell RCC that progressed following two or more lines of therapy that included a PD-1 or PD-L1 inhibitor and at least two vascular endothelial growth factor targeted therapies, based on the LITESPARK-005 trial.\nFDA approval for the treatment of adult and pediatric patients (12 years and older) with locally advanced, unresectable, or metastatic pheochromocytoma and paraganglioma, based on the LITESPARK-015 trial.\nJapan’s MHLW approval as monotherapy for the treatment of adult patients with VHL disease-associated tumors, based on the LITESPARK-004 trial.\nJapan’s MHLW approval for the treatment of adults with radically unresectable or metastatic RCC that has progressed after chemotherapy, based on the LITESPARK-005 trial.\nThe EC conditional approvals of\nnoted above will be valid for one year, subject to yearly renewal, pending certain additional clinical data. Timing for commercial availability of\nin individual EU countries will depend on multiple factors, including the completion of national reimbursement procedures.\nReblozyl (luspatercept-aamt) is a first-in-class erythroid maturation recombinant fusion protein that is being commercialized through a global collaboration with Bristol-Myers Squibb Company (BMS) (see Note 3 to the condensed consolidated financial statements). Reblozyl is approved for the treatment of anemia in certain rare blood disorders. Alliance revenue related to this collaboration (consisting of royalties) increased 36% and 39% in the third quarter and first nine months of 2025, respectively, primarily due to strong underlying sales performance.\nKoselugo is an oral, selective MEK inhibitor approved for the treatment of patients with neurofibromatosis type 1 who have symptomatic inoperable plexiform neurofibromas. Koselugo is part of a collaboration with AstraZeneca. The increase in alliance revenue in both the third quarter and first nine months of 2025 is due to the recognition of a $150 million upfront payment and a $50 million milestone due to an amendment to the collaboration agreement that (subject to an annual election by AstraZeneca) discontinued the revenue and cost sharing provisions of the collaboration, and changed the payment structure. See Note 3 to the condensed consolidated financial statements for additional information.\nM-M-R\nII\nCombined worldwide sales of\n9, vaccines to help prevent certain cancers and other diseases caused by certain types of human papillomavirus (HPV), declined 24% and 40% in the third quarter and first nine months of 2025, respectively. The sales declines were primarily driven by lower demand in China (discussed below) and in Japan, reflecting in part that the last date to initiate the first dose in Japan’s national immunization program catch-up cohort was in March 2025. The declines were partially offset by higher sales in the U.S. due to higher net pricing, favorable U.S. Centers for Disease Control and Prevention (CDC) purchasing patterns and, for the year-to-date period, higher demand. In the first nine months of 2025, higher demand in certain international markets also partially offset the sales decline. Beginning in mid-2024, the Company observed a significant decline in shipments from its distributor and commercialization partner in China, Chongqing Zhifei Biological Products Co., Ltd. (Zhifei), to disease and control prevention institutions and correspondingly into the points of vaccination compared with prior quarters of 2024, resulting in above normal inventory levels at Zhifei. Accordingly, the Company shipped less than its contracted doses to Zhifei in the latter part of 2024. Lower demand in China persisted and, at the end of 2024, overall channel inventory levels in China remained elevated at above normal levels. Therefore, the Company made a decision to temporarily pause shipments to China beginning in February 2025 and, given continued lower demand and elevated inventory levels in China, in mid-2025, the Company determined it would not make any further shipments to China through at least the end of 2025. As a result, combined sales of\n9 will decline significantly in 2025 compared with 2024. In January 2025, China’s NMPA approved\nfor use in males 9-26 years of age to help prevent certain HPV-related cancers and diseases. In April 2025, China’s NMPA approved\n9 for use in males 16-26 years of age to help prevent certain HPV-related cancers and diseases. In May 2025, a nine-valent HPV vaccine produced by a local manufacturer received regulatory approval in China for use in females 9-45 years of age. In August 2025, the Company’s nine-valent HPV vaccine was approved for use in males nine years of age and older in Japan where it will be marketed under the trademark\n9 is currently indicated in the U.S. for a two-dose regimen in adolescents aged 9-14 and a three-dose regimen for those aged 15-45. In June 2024, the CDC’s Advisory Committee on Immunization Practices (ACIP) announced the formation of an HPV vaccines workgroup. In October 2024, the ACIP workgroup stated that it intends to discuss and, potentially, vote on a change to the dose recommendation, which could include a reduction in the number of recommended doses. A number of countries outside the U.S., predominately low- and middle-income countries, have implemented a reduced dosing schedule for HPV vaccination.\nThe Company is a party to license agreements pursuant to which the Company pays royalties on sales of\n9. Under the terms of the more significant of these agreements, Merck pays a 7% royalty on net sales of\n9 in the U.S.; this royalty expires in December 2028. The royalty expenses are included in\n(Measles, Mumps, Rubella and Varicella Virus Vaccine Live), a pediatric combination vaccine to help protect against measles, mumps, rubella and varicella, were relatively flat in the third quarter of 2025 and declined 7% in the first nine months of 2025. As a result of manufacturing delays, in January 2025, the Company borrowed doses of\nfrom the CDC Pediatric Vaccine Stockpile (CDC Stockpile), which are being used to support routine vaccination in the U.S. The Company partially replenished the borrowing in the second quarter of 2025. The net effect of the borrowing and partial replenishment resulted in a $49 million reduction of\nsales in the first nine months of 2025. Worldwide sales of\nM-M-R\nII (Measles, Mumps and Rubella Virus Vaccine Live), a vaccine to help protect against measles, mumps and rubella, in the third quarter of 2025 were comparable to sales in the third quarter of 2024. Sales of\nM-M-R\nII grew 12% in the first nine months of 2025 primarily due to higher sales in the U.S. largely reflecting higher net pricing and increased demand due to measles outbreaks. Global sales of\n(Varicella Virus Vaccine Live), a vaccine to help prevent chickenpox (varicella), declined 4% and 6% in the third quarter and first nine months of 2025, respectively, primarily due to lower sales in the U.S. largely driven by lower demand and, for the year-to-date period, unfavorable CDC Stockpile activity, p"
}