{
  "source_file": "mrna-20241231.htm",
  "form_type": "10-K",
  "item1_clean": "Our RSV patent portfolio includes multiple families of differing patent breadth\n. A non-exhaustive list of granted patents covering our RSV vaccine can be found in the following table.\nComposition of Matter\nComposition of Matter\nComposition of Matter\nComposition of Matter and Method of Use\nComposition of Matter\nComposition of Matter\nComposition of Matter\nComposition of Matter\nComposition of Matter\nComposition of Matter\nComposition of Matter and Method of Use\nComposition of Matter\n* Selected granted patents in the U.S. and Europe only. Additional granted and pending patents in the U.S., Europe and other countries may be available.\n** Expiration dates listed here include any granted or anticipated patent term adjustment (PTA), but not any patent term extension (PTE) or supplementary protection certificates (SPC).\nWe have multiple patent families spanning different levels of breadth, design and antigen valency pending in the U.S.,\nand around the world, including several granted patents.\nHuman metapneumovirus (hMPV) is a single-stranded RNA virus that is used in a combination program. We have patent applications covering our hMPV vaccine pending in the U.S. and Europe, with a granted patent in the U.S.\nWe have vaccine programs and patent applications directed to diseases caused by various latent viruses, including CMV, EBV, HSV and VZV, in some cases, using both preventative vaccines targeting the acute phase and therapeutic vaccines for treating the latent diseases in those who do become infected.\nCMV\nThe patent coverage for our human CMV vaccine candidate is extensive and is based on a vaccine with six mRNAs encoding a pentamer surface glycoprotein complex and the gB surface glycoprotein. Both pentamer and gB facilitate entry of the virus into different cell types and therefore immune responses targeting these proteins can block virus entry, spread and reactivation. The current patent portfolio contains both compositions of matter and methods of treating subjects using the vaccine. In the U.S., our CMV vaccine is covered by multiple issued U.S. patents of differing breadth. Each family has counterparts consisting of pending applications and issued patents in non-U.S. jurisdictions, including, in some cases, Europe and Japan. A separate family of CMV patents, which includes mRNA-1647 plus mRNA-1443 for use in CMV vaccines for transplant indications, is also yielding patents and applications in foreign jurisdictions are pending.\nSimilar to CMV, we have filed patent applications, and in some cases multiple patent families, for each of EBV, HSV and VZV, e.g., covering prophylactic and/or therapeutic indications. In addition to patent applications filed in the United States, certain of these patent families have foreign counterparts, such as\nPublic health vaccines\nWe maintain a multi-program effort at developing vaccines for potential future pandemics and for use in parts of the world with less well-established health care systems. This group of programs include infectious diseases such as flaviviruses such as Zika and dengue viruses, HIV, Nipah virus, and the Mpox virus. In addition, programs are ongoing in many bacterial diseases. While patent applications are filed on some potential public health targets, in some scenarios, platform patents rather than target specific patents may be used to provide patent protection for public health target vaccines.\nINT\nComposition of matter and method claims are being pursued to protect programs within our oncology therapeutics franchise. Proprietary methods around the making and therapeutic use of our INTs and resulting vaccine compositions are described and claimed in one granted U.S. patent, eight pending U.S. patent applications, six pending European patent applications, one granted patent and five pending patent applications in Japan, three pending patent applications and one granted patent in China, and several pending patent applications in New Zealand, South Africa, Asian and South American countries, as well as one PCT application. These applications also relate to various vaccine design formats, in particular, polyepitopic vaccine formats, and methods of treating cancer with such INTs. We also possess substantial know-how and trade secrets relating to the development and commercialization of our cancer vaccine programs, including related manufacturing process and technology.\nWe have programs featuring expression of therapeutic proteins, e.g., intracellular enzymes for the treatment of rare diseases. For our rare disease programs, we generally pursue patent protection featuring composition of matter and method of use claims, for example, pharmaceutical composition and method of treatment claims. We have patent applications granted, pending and/or published for our most advanced rare disease development candidates targeting PA and MMA. In addition, we have patent applications granted, pending and/or published for our other rare disease candidates targeting Glycogen Storage Disorder, Type 1a (GSD1a), PKU, Crigler-Najjar Syndrome Type 1 (CN-1) and ornithine transcarbamylase deficiency (OTC).\nAny U.S. and foreign patents that may issue from these patent families would be expected to expire in 2036 for the earliest of the MMA patents and 2038 to 2042 for the remaining MMA, PA, PKU, GSD1a and CN-1 patents, excluding any patent term adjustments, any patent term extensions and any terminal disclaimers.\nAs further described below, as we continue the development of our intended products, we continue to identify additional means of protecting our assets that would potentially enhance commercial success, including possible patent protection for additional methods of use, formulation, or manufacture.\nOur CF development candidate is covered by pending U.S., European and PCT patent applications.\nOur gene editing program currently has one filed patent family that includes issued patents in the U.S., Europe and Japan, and also pending applications in these jurisdictions. We plan to file patent applications on development candidates and other aspects of gene editing technology as we continue to innovate both internally and through strategic collaborations.\nOur trademark portfolio currently contains at least 1,250 trademark registrations, including at least 30 registrations in the United States and the remaining in Canada, the European Union, the United Kingdom, Israel, China, Japan, Australia, and elsewhere. In addition, we have at least 360 pending trademark applications in more than 55 jurisdictions, including in the aforementioned locations and additional countries throughout Africa, Asia, and South America.\nIn-licensed intellectual property\nWhile we develop and manufacture our potential mRNA medicines using our internally created mRNA technology platform, we also seek out and evaluate third party technologies and IP that may be complementary to our platform.\nPatent sublicense agreements with Cellscript and mRNA RiboTherapeutics\nThe Trustees of the University of Pennsylvania owns several issued U.S. patents, granted European patents and pending U.S. patent applications directed, in part, to nucleoside-modified mRNAs and their uses (the Penn Modified mRNA Patents). mRNA RiboTherapeutics, Inc. (MRT) obtained an exclusive license to the Penn Modified mRNA Patents and granted its affiliate, Cellscript, LLC (Cellscript), a sublicense to the Penn Modified mRNA Patents in certain fields of use.\nIn June 2017, we entered into two sublicense agreements, one with Cellscript, and one with MRT, which agreements we collectively refer to as the Cellscript-MRT Agreements. Together, the Cellscript-MRT Agreements grant us a worldwide, sublicensable sublicense to the Penn Modified mRNA Patents to research, develop, make, and commercialize products covered by the Penn Modified mRNA Patents (licensed products), for all\nuses in humans and animals, including therapeutic, prophylactic, and diagnostic applications. The Cellscript-MRT Agreements are non-exclusive, although Cellscript and MRT are subject to certain time restrictions on granting additional sublicenses for\nuses in humans under the Penn Modified mRNA Patents. The Cellscript-MRT Agreements require us to pay royalties based on annual net sales of licensed products at rates in the low single digits for therapeutic, prophylactic, and diagnostic uses, and royalties based on annual net sales of licensed products sold for research uses at rates in the mid-single digits, subject to certain reductions, with an aggregate minimum floor.\nThe Cellscript-MRT Agreements will terminate upon the expiration or abandonment of the last to expire or become abandoned of the Penn Modified mRNA Patents. Cellscript or MRT, as applicable, may terminate its respective Cellscript-MRT Agreement if we fail to make required payments or otherwise materially breach the applicable agreement, subject to specified notice and cure provisions. Cellscript or MRT, as applicable, may also terminate the applicable Cellscript-MRT Agreement upon written notice in the event of our bankruptcy or insolvency or if we challenge the validity or enforceability of the Penn Modified mRNA Patents. We have the right to terminate each Cellscript-MRT Agreement at will upon 60 days’ prior notice to Cellscript or MRT, as applicable, provided that we cease all development and commercialization of licensed products upon such termination. If rights to MRT or Cellscript under the Penn Modified mRNA Patents are terminated (e.g., due to bankruptcy of MRT or Cellscript), the terminated party will assign its interest in the respective Cellscript-MRT Agreement to the licensor from which it received rights under the Penn Modified mRNA Patents and our rights will continue under the new licensor.\nPatent license agreements with NIAID\nIn December 2022, we entered into a non-exclusive patent license agreement with the National Institute of Allergy and Infectious Diseases (NIAID), an Institute or Center of the National Institutes of Health (NIH), to license certain patent rights concerning stabilizing prefusion coronavirus spike proteins and the resulting stabilized proteins for use in COVID vaccine products. Pursuant to the agreement, we have agreed to pay low single-digit royalties on future net sales, a minimum annual royalty payment and certain contingent development, regulatory and commercial milestone payments on a licensed product-by-licensed product basis.\nIn January 2025, we entered into a non-exclusive patent license agreement with NIAID to license certain patent rights concerning prefusion RSV F proteins and their use. Pursuant to the agreement, we have agreed to pay tiered, low-to-mid single-digit royalties on net sales of our RSV vaccine, a minimum annual royalty payment, and certain contingent development, regulatory and commercial milestone payments on a licensed product-by-licensed product basis.\nFormulation technology in-licenses\nOur development candidates use internally developed formulation technology that we own. We do, however, have rights to use and exploit multiple issued and pending patents covering formulation technologies under licenses from other entities. If in the future we elect to use or to grant our strategic collaborators sublicenses to use these in-licensed formulation technologies, we or our strategic collaborators may be liable for milestone and royalty payment obligations arising from such use. We consider the commercial terms of these licenses and their provisions regarding diligence, insurance, indemnification and other similar matters, to be reasonable and customary for our industry.\nHUMAN CAPITAL\nWe had approximately 5,800 full-time employees in 18 countries as of\nWe operate in a highly competitive environment for talent, particularly as we seek to attract and retain talent with experience in the biotechnology and pharmaceutical sectors. Our workforce is highly educated, and as of December 31, 2024, 43% of our employees hold Ph.D., Doctorat",
  "item7_clean": "Other revenue comprises grant revenue, collaboration revenue, and licensing and royalty revenue. Grant and collaboration revenues have been primarily derived from government-sponsored and private organizations including the Biomedical Advanced Research and\nDevelopment Authority (BARDA), the Defense Advanced Research Projects Agency (DARPA) and the Gates Foundation and from strategic alliances with Merck & Co., Inc (Merck), Vertex Pharmaceuticals Incorporated and Vertex Pharmaceuticals (Europe) Limited (together, Vertex) and others to discover, develop, and commercialize potential mRNA medicines. Licensing and royalty revenue is related to our out-licensing agreement for mRNA COVID related intellectual property in Japan, executed in 2024.\nThe following table summarizes other revenue for the periods presented (in millions):\nYears Ended December 31,\nCollaboration revenue\nLicensing and royalty revenue\nCost of sales includes raw materials, personnel and facility and other costs associated with manufacturing our commercial products. These costs include production materials, production costs at our manufacturing facilities, third-party manufacturing costs, and final formulation and packaging costs. Cost of sales also includes shipping costs, indirect overhead costs associated with our product sales during the period, third-party royalties on net sales of our products, and charges for inventory valuation, excess and obsolete inventory and losses on firm purchase commitments.\nResearch and development expenses\nThe nature of our business and primary focus of our activities generate a significant amount of research and development costs.\nResearch and development expenses represent costs incurred by us for the following:\ncost to develop our platform;\ndiscovery efforts leading to development candidates;\npreclinical, nonclinical, and clinical development costs for our programs;\ncost to develop our manufacturing technology and infrastructure; and\ndigital infrastructure costs related to our drug discovery efforts and clinical trials.\nThe costs above comprise the following categories:\npersonnel-related expenses, including salaries, benefits, and stock-based compensation expense;\nexpenses incurred under agreements with third parties, such as consultants, investigative sites, contract research organizations (CROs), that conduct our preclinical studies and clinical trials, and in-licensing arrangements;\nexpenses associated with developing manufacturing, modification of formulation or design of a product or process, advancing the design to meet specific functional and economic requirements for manufacture and obtaining materials for preclinical studies, clinical trials and pre-launch inventory from internal and third-party contract manufacturing organizations (CMOs);\nexpenses incurred for the procurement of materials, laboratory supplies, and non-capital equipment used in the research and development process;\nupfront fees and milestones paid to third-parties for licenses and technologies that had not reached technological feasibility and did not have an alternative future use; and\nfacilities, depreciation, and amortization, and other direct and allocated expenses incurred as a result of research and development activities.\nWe use our employee and infrastructure resources for the advancement of our platform, and for discovering and developing programs. Due to the number of ongoing programs and our ability to use resources across several projects, indirect or shared operating costs incurred for our research and development programs are generally not recorded or maintained on a program- or therapeutic area-specific basis.\nThe following table reflects our research and development expenses, including direct program specific expenses summarized by therapeutic area and indirect or shared operating costs summarized under other research and development expenses during the years ended December 31, 2024, 2023, and 2022 (in millions):\nYears Ended December 31,\nProgram-specific expenses by therapeutic area:\nRespiratory vaccines\nLatent and other virus vaccines\nRare disease and other therapeutics\nTotal program-specific expenses by therapeutic area\nOther research and development expenses:\nDiscovery and platform research\nTechnical development and manufacturing expenses\nShared discovery and development expenses\nStock-based compensation\nTotal research and development expenses\nIncludes a total of 34 development candidates at December 31, 2024, 42 development candidates at December 31, 2023, and 45 development candidates at December 31, 2022. Program-specific expenses are reflected as of the beginning of the period in which the program was internally advanced to development.\nThe program-specific expenses by therapeutic area summarized in the table above include external development costs, such as fees paid to outside consultants, central laboratories, investigative sites, and CROs in connection with our preclinical studies and clinical trials. We generally do not allocate personnel-related costs, including stock-based compensation, costs associated with our general platform research, technical development, and other shared costs on a program-specific basis. These costs were therefore excluded from the summary of program-specific expenses by therapeutic area.\nDiscovery and platform research expenses include costs associated with early-stage research activities for preclinical programs and the development of technical advances in mRNA science, delivery science, and manufacturing process design. These costs include external CRO and lab services, personnel-related costs, computer equipment, facilities, and other administrative costs.\nTechnology development and manufacturing expenses are primarily related to manufacturing process development and manufacturing costs, including expenses for acquiring and manufacturing pre-launch inventory, mRNA supply for preclinical studies and clinical trials.\nShared discovery and development expenses are research and development costs such as personnel-related costs and other costs, such as the purchase of priority review vouchers. These expenses are not otherwise included in development programs, discovery and platform research, technical development, manufacturing expenses, or stock-based compensation.\nHistorically, we have made substantial investments in research and development activities, including development of our platform, mRNA technologies, and manufacturing technologies. We expense research and development costs as incurred and cannot reasonably estimate the nature, timing, and estimated costs required to complete the development of the development candidates and investigational medicines we are currently developing or may develop in the future.\nChanges in expectations or outcomes of any of the known or unknown risks and uncertainties may materially impact our expected research and development expenditures. Continued research and development is central to the ongoing activities of our business. Investigational medicines in later stages of clinical development, such as our norovirus vaccine, seasonal flu vaccine, new generations of COVID vaccines, combination vaccines, CMV vaccine, and our INT program, generally have higher development costs than those in earlier stages of clinical development, primarily due to the increased size and duration of later-stage clinical trials. We expect our research and development costs to be substantial in the near term as our investigational medicines advance through development phases and as we identify and develop additional programs.\nThere are numerous factors associated with the successful commercialization of any of our investigational medicines, including future trial design and various regulatory requirements, many of which cannot be determined with accuracy at this time due to the early stage of development of many of our investigational medicines. Moreover, future commercial and regulatory factors beyond our control will impact our clinical development programs and plans.\nSelling, general and administrative expenses\nSelling, general and administrative expenses consist primarily of personnel-related costs, including stock-based compensation, for executives, finance, legal, human resources, business development, commercial, marketing, and other administrative and operational functions, professional fees, accounting and legal services, information technology and facility-related costs, and expenses associated with obtaining, maintaining, and defending intellectual property (IP). These costs relate to the operation of the business, unrelated to the research and development function, or any individual program.\nPrior to 2024, selling, general and administrative expenses increased annually as we expanded our commercial infrastructure to support the global commercialization of our COVID vaccine. These increases were driven by investments in building regulatory, sales, and marketing teams, establishing subsidiaries in multiple countries, and supporting operational growth. In 2024, selling, general and administrative expenses decreased significantly by $375 million, or 24%, compared to 2023. This decline reflects our focus on productivity improvements, cost-saving initiatives, and targeted investments that strengthen our overall efficiency.\nInterest income consists of interest generated from our investments in cash and cash equivalents, money market funds, and high-quality fixed income securities.\nOther expense, net consists of interest expense, gains or losses related to the sale of investments in marketable securities, changes in fair value of investments in equity securities, foreign currency transactions, remeasurements and hedges, and other income and expense unrelated to our core operations. Interest expense is primarily derived from our finance leases related to our Moderna Technology Center prior to its acquisition in December 2024, and certain contract manufacturing service agreements.\nCritical accounting policies and significant judgments and estimates\nOur management’s discussion and analysis of our financial condition and results of operations is based on our consolidated financial statements, which have been prepared in accordance with U.S. generally accepted accounting principles. The preparation of these consolidated financial statements requires us to make judgments and estimates that affect the reported amounts of assets, liabilities, revenues, and expenses and the disclosure of contingent assets and liabilities in our consolidated financial statements. We base our estimates on historical experience, known trends and events, and various other factors that we believe to be reasonable under the circumstances, the results of which form the basis for making judgments about the carrying values of assets and liabilities that are not readily apparent from other sources. Actual results may differ from these estimates under different assumptions or conditions. On an ongoing basis, we evaluate our judgments and estimates in light of changes in circumstances, facts, and experience. The effects of material revisions in estimates, if any, are reflected in the consolidated financial statements prospectively from the date of change in estimates.\nconsolidated financial statements require the most significant judgments and estimates.\nPrior to the third quarter of 2023, we sold our COVID vaccine to the U.S. Government, foreign governments and organizations. The agreements and related amendments with these entities generally do not include variable consideration, such as discounts, rebates or returns. In the third quarter of 2023, we commenced sales of our latest COVID vaccine to the U.S. commercial market, in addition to continuing sales to foreign governments and organizations. We also commenced sales of our RSV vaccine in the third quarter of 2024. In the U.S., our COVID vaccine and RSV vaccine are sold primarily to wholesalers and distributors, and to a lesser extent, directly to retailers and healthcare providers.\nWe recognize net product sales when control of the product transfers to the customer, typically upon delivery. Net product sales are recognized net of estimated wholesaler chargebacks, invoice discounts for prompt payments and pre-orders, provisions for sales\nreturns, government rebates, and other related deductions. These provisions are recorded based on contractual terms, our estimate of returns for product sold, and other relevant considerations, during the period, using the expected value method or the most likely amount method. Estimates are assessed each period and adjusted as required to revise information or actual experience. Please refer to\nto our consolidated financial statements for further discussion and analysis of each significant category of product sales provisions and the accounting policy.\nThe application of our critical accounting policies necessitates substantial management judgment and estimation, particularly when determining the amount of variable consideration to recognize. The subjectivity of this process is heightened when assessing factors outside our direct control such as the limited historical data, constrained third-party information, and evolving market dynamics. Among all variables, estimating returns presents the most significant judgment due to the broad range of potential outcomes and the current lack of established return trends. While we now have one year of data on our product returns, this remains insufficient to establish reliable patterns. We will continue to enhance our projections as additional information becomes available. The actual results could differ from our estimates, and such differences could have a material impact to our financial statements.\nRecently issued accounting pronouncements\n- Summary of Significant Accounting Policies, to the consolidated financial statements, under the caption “Recently Issued Accounting Standards”.\nResults of operations\nThe following table summarizes our consolidated statements of operations for the periods presented (in millions):\nYears Ended December 31,\nChange 2024 vs. 2023\nResearch and development\nSelling, general and administrative\nTotal operating expenses\nLoss from operations\nLoss before income taxes\n(Benefit from) provision for income taxes\nTotal revenue decreased by $3.6 billion, or 53%, in 2024, primarily attributable to a significant reduction in net product sales of our COVID vaccine. Net product sales decreased by $3.6 billion, or 53%, in 2024, mainly due to lower sales volumes in Europe and the rest of the world. This decline reflects the transition to a seasonal commercial market for COVID vaccine, as revenue from these regions was previously generated largely through advance purchase agreements with foreign governments and international organizations during the pandemic. In the United States, sales remained relatively consistent compared to 2023. However, 2024 sales include an approximately $216 million benefit related to a reversal of prior-year sales provisions. Excluding this adjustment, product sales volume in the United States declined compared to 2023, primarily due to lower vaccination rates and increased market\ncompetition. Although we commenced sales of our RSV vaccine in the third quarter of 2024, these sales did not have a significant impact on our overall product sales for the year. Other revenue decreased by $50 million, or 28%, in 2024, primarily due to lower grant and collaboration revenue, partially offset by license and royalty revenue related to the licensing agreement for mRNA COVID-related intellectual property in Japan, executed in 2024.\nProduct sales are expected to decline further in 2025, driven by a potential reduction in vaccination rates, lower sales under advanced purchase agreements as most have been fulfilled, and increasing competitive pressures in the market.\nOur cost of sales was $1.5 billion, or 47% of our net product s",
  "item2_clean": null
}