{
  "source_file": "msci-20250930.htm",
  "form_type": "10-Q",
  "item1_clean": "Index segment Adjusted EBITDA expenses increased 14.0% for the nine months ended September 30, 2025, primarily driven by increases in compensation and benefits costs as a result of increased headcount costs as well as higher severance costs. The increase was also driven by non-compensation expenses reflecting higher information technology costs and professional fees. Adjusting for the impact of foreign currency exchange rate fluctuations, Index segment Adjusted EBITDA expenses would have increased by 14.1%.\nThe following table presents the results for the Analytics segment for the periods indicated:\nRecurring subscriptions\nOperating revenues total\nAdjusted EBITDA expenses\nAdjusted EBITDA margin %\nAnalytics operating revenues increased 5.7% for the three months ended September 30, 2025, primarily driven by growth from recurring subscriptions related to both Equity Analytics and Multi-Asset Class products. Adjusting for the impact of foreign currency exchange rate fluctuations, Analytics operating revenues would have increased 5.6%.\nAnalytics segment Adjusted EBITDA expenses increased 12.2% for the three months ended September 30, 2025, primarily driven by increases in compensation and benefits costs as a result of increased headcount costs as well as higher severance costs. The increase was also driven by higher information technology costs. Adjusting for the impact of foreign currency exchange rate fluctuations, Analytics segment Adjusted EBITDA expenses would have increased 11.5%.\nAnalytics operating revenues increased 5.9% for the nine months ended September 30, 2025, primarily driven by growth from recurring subscriptions related to both Equity Analytics and Multi-Asset Class products. Adjusting for the impact of foreign currency exchange rate fluctuations, Analytics operating revenues would have increased 5.8%.\nAnalytics segment Adjusted EBITDA expenses increased 5.9% for the nine months ended September 30, 2025, primarily driven by increases in compensation and benefits costs as a result of increased headcount costs as well as higher severance costs. Adjusting for the impact of foreign currency exchange rate fluctuations, Analytics segment Adjusted EBITDA expenses would have increased 6.3%.\nSustainability and Climate Segment\nThe following table presents the results for the Sustainability and Climate segment for the periods indicated:\nRecurring subscriptions\nOperating revenues total\nAdjusted EBITDA expenses\nAdjusted EBITDA margin %\nSustainability and Climate operating revenues increased 7.7% for the three months ended September 30, 2025, primarily driven by growth from recurring subscriptions related to Ratings and Climate products, with growth primarily attributable to EMEA. Adjusting for the impact of foreign currency exchange rate fluctuations, Sustainability and Climate operating revenues would have increased 5.1%.\nSustainability and Climate segment Adjusted EBITDA expenses increased 3.1% for the three months ended September 30, 2025, primarily driven by higher benefits and compensation costs as a result of increased headcount costs as well as higher severance\ncosts. Adjusting for the impact of foreign currency exchange rate fluctuations, Sustainability and Climate segment Adjusted EBITDA expenses would have increased 2.0%.\nSustainability and Climate operating revenues increased 9.2% for the nine months ended September 30, 2025, primarily driven by growth from recurring subscriptions related to Ratings and Climate products, with growth primarily attributable to EMEA. Adjusting for the impact of foreign currency exchange rate fluctuations, Sustainability and Climate operating revenues would have increased 7.1%.\nSustainability and Climate segment Adjusted EBITDA expenses increased 4.2% for the nine months ended September 30, 2025, primarily driven by higher benefits and compensation costs as a result of increased headcount costs as well as higher severance costs. The increase was also driven by non-compensation expenses reflecting higher information technology costs. Adjusting for the impact of foreign currency exchange rate fluctuations, Sustainability and Climate segment Adjusted EBITDA expenses would have increased 4.2%.\nAll Other – Private Assets\nThe following table presents the results for All Other – Private Assets for the periods indicated:\nRecurring subscriptions\nOperating revenues total\nAdjusted EBITDA expenses\nAdjusted EBITDA margin %\nAll Other – Private Assets operating revenues increased 9.7% for the three months ended September 30, 2025, primarily driven by growth from recurring subscriptions in Private Capital Solutions related to Total Plan Portfolio Management and Private Capital Intel products. Adjusting for the impact of foreign currency exchange rate fluctuations, All Other – Private Assets operating revenues would have increased 8.3%.\nAll Other – Private Assets Adjusted EBITDA expenses increased 6.6% for the three months ended September 30, 2025, primarily driven by increases in compensation and benefits costs as a result of increased headcount costs as well as higher severance costs. Adjusting for the impact of foreign currency exchange rate fluctuations, All Other - Private Assets Adjusted EBITDA expenses would have increased 5.4%.\nAll Other – Private Assets operating revenues increased 8.0% for the nine months ended September 30, 2025, primarily driven by growth from recurring subscriptions in Private Capital Solutions related to Private Capital Intel, Total Plan Portfolio Management and Transparency Data products, as well as growth from recurring subscription in Real Assets related to Index Intel products. Adjusting for the impact of foreign currency exchange rate fluctuations, All Other – Private Assets operating revenues would have increased 7.2%.\nAll Other – Private Assets Adjusted EBITDA expenses increased 5.6% for the nine months ended September 30, 2025, primarily driven by increases in compensation and benefits costs as a result of increased headcount costs as well as higher severance costs. Adjusting for the impact of foreign currency exchange rate fluctuations, All Other - Private Assets Adjusted EBITDA expenses would have increased 5.2%.\nA substantial portion of MSCI’s operating revenues is derived from recurring subscriptions or licenses for products and services that are ongoing in nature and provided over contractually agreed periods, which are subject to renewal or cancellation upon the expiration of the then-current term. In addition, we generate non-recurring revenues from one-time sales and other transactions or services that are discrete in nature or that have a defined life. The operating metrics defined below help management assess the\nstability and growth of this recurring-revenue base and track non-recurring revenues. There have been no changes to the methodologies used to compute these metrics compared with prior periods.\nRun Rate estimates, at a specific point in time, the annualized value of the recurring portion of executed client contracts (“Client Contracts”) expected to generate revenues over the next 12 months, assuming that all such Client Contracts are renewed and using fixed foreign exchange rates. Run Rate includes new Client Contracts upon execution, even if the license start date and related revenue recognition occur later.\nFor Client Contracts where fees are linked to an investment product’s assets or trading volume or fees (referred to as “Asset-based Fees”), the Run Rate calculation is based on:\nFor exchange-traded funds (“ETFs”): assets under management as of the last trading day of the period;\nFor non-ETF products: the most recent client-reported assets under management; and\nFor listed futures and options contracts: the most recent quarterly volumes and/or reported exchange fees.\nRun Rate excludes fees associated with one-time or other non-recurring transactions.\nWe remove from Run Rate the annualized fee value associated with products or services under any Client Contracts when (i) we have received a notice of termination, reduction in fees, non-renewal or other clear indication that the client does not intend to continue its subscription at then current fees; and (ii) management has determined that such notice or indication reflects the client’s final decision to terminate, not renew or renew at a lower fee the applicable products or services, even if such termination or non-renewal is not yet effective (each such event, a “Subscription Cancellation”).\nIn general, when a client reduces the fees paid to MSCI associated with a reduction in the number of products or services to which it subscribes within a segment, or a switch between products or services within a segment, unless the client switches to a product or service that management considers a replacement, such reduction or switch is treated as a Subscription Cancellation, including for purposes of calculating MSCI’s Retention Rate (as detailed below). In the cases where the client switches products or services to a replacement service, only the net decrease, if any, is reported as a cancellation.\nIn the Analytics and Sustainability and Climate operating segments, substantially all such product or service switches are treated as replacements and are netted accordingly.\nIn contrast, in the Index, Real Assets, and Private Capital Solutions operating segments, such netting treatment is applied only in limited circumstances.\nRun Rate may differ from revenues recognized in accordance with Accounting Standards Codification (“ASC”) Topic 606, Revenue from Contracts with Customers. Changes in our recurring revenues typically lag changes in Run Rate. Key factors include, but are not limited to:\nImmediate recognition of the annualized value of newly executed recurring Client Contracts;\nImmediate removal of the annualized value of Subscription Cancellations on Client Contracts;\nImmediate updates to reflect modifications to existing Client Contracts, including changes in price or scope of services;\nTiming differences between the effective date of service delivery and contract execution (e.g., Client Contracts with implementation periods, fee waivers or future-dated start terms);\nVariability in revenues driven by exogenous factors, such as changes in reference asset values, currency exchange rates or investment flows;\nVariability in revenues tied to trading volumes of futures and options contracts linked to MSCI indexes; and\nThe effects of acquisitions and divestitures.\nMulti-period agreements with contractual price escalators where the total revenue is recognized ratably over the contract period.\nOrganic recurring subscription Run Rate growth is defined as the period-over-period growth in Run Rate, excluding:\nThe impact of changes in foreign currency exchange rates;\nThe impact of acquisitions during the first 12 months following the transaction date; and\nThe impact of divestitures, where Run Rate from divested businesses are excluded from prior period Run Rates.\nThe following table presents Run Rates as of the dates indicated and the growth percentages over the periods indicated:\nOrganic Run Rate Growth %\nRecurring subscriptions\nSustainability and Climate\nAll Other - Private Assets\nRecurring subscriptions total\nTotal Run Rate increased 10.1%, driven by a 8.0% increase from recurring subscriptions, primarily driven by increases in the asset manager, banks and broker-dealer, hedge fund and asset owner client segments, as well as a 17.0% increase from asset-based fees.\nRun Rate from Index recurring subscriptions increased 9.0%, primarily driven by growth from market cap-weighted and custom Index products. The increase reflected growth across all regions and client segments.\nRun Rate from Index asset-based fees increased 17.0%, primarily driven by higher AUM in both ETFs linked to MSCI equity indexes and non-ETF indexed funds linked to MSCI indexes.\nRun Rate from Analytics products increased 7.4%, primarily driven by growth in both Equity Analytics and Multi-A",
  "item7_clean": null,
  "item2_clean": "Item 2. Management’s Discussion and Analysis of Financial Condition and Results of Operations\nINDEX TO MANAGEMENT’S DISCUSSION AND ANALYSIS\nCritical Accounting Estimates\nResults of Operations\nLiquidity and Capital Resources\nExcept as the context otherwise indicates, the terms “MSCI,” the “Company,” “we,” “our” and “us” refer to MSCI Inc., together with its subsidiaries.\nWe are a leading provider of critical decision support tools and solutions for the global investment community. Our mission-critical offerings help investors navigate the complexities of a dynamic and evolving investment landscape. Leveraging our deep knowledge of the global investment process and our expertise in research, data and technology, we enable our clients to understand and analyze key drivers of risk and return and build portfolios more effectively. The Company has five operating segments: Index, Analytics, Sustainability and Climate, Real Assets and Private Capital Solutions which\nare presented as the following three reportable segments: Index, Analytics, and Sustainability and Climate. For reporting purposes, the Real Assets and Private Capital Solutions operating segments are combined and presented as All Other – Private Assets, as they did not meet the required thresholds for separate reportable segment disclosure.\nOur growth strategy includes: (a) extending leadership in research-enhanced content across asset classes, (b) leading the enablement of sustainability and climate investment integration, (c) enhancing distribution and content-enabling technology, (d) expanding solutions that empower client customization, (e) strengthening client relationships and expanding our presence in key geographic areas and (f) executing strategic partnerships and acquisitions with complementary data, content and technology companies. For more information about our Company’s operations, see “\nAs of September 30, 2025, we served approximately 6,900\nclients in more than 95 countries.\nOur principal business model is generally to license annual, recurring subscriptions for the majority of our Index, Analytics and Sustainability and Climate products and services for a fee due in advance of the service period. Private Assets products are also licensed annually through subscriptions, which are generally recurring, for a fee which is paid in advance when products are generally delivered ratably over the subscription period or in arrears after the product is delivered. A portion of our fees comes from clients who use our indexes as the basis for index-linked investment products. Such fees are primarily based on a client’s assets under management (“AUM”), trading volumes and fee levels.\nIn evaluating our financial performance, we focus on revenue and profit growth, including results accounted for under generally accepted accounting principles in the United States (“GAAP”), as well as non-GAAP measures, for the Company as a whole and by operating segment.\nWe present revenues disaggregated by types and by segments, which represent our major product lines. We also review expenses by activity, which provides more transparency into how resources are being deployed. In addition, we utilize operating metrics including Run Rate, subscription sales and Retention Rate to manage and assess performance and to provide deeper insights into the recurring portion of our business.\nRepresents the aggregate of all related clients under their respective parent entity. At acquisition, we align an acquired company’s client count to our methodology.\nIn the first quarter of 2025, we renamed our “ESG and Climate” operating and reportable segment to “Sustainability and Climate” to reflect the breadth of our product offerings. There were no changes to the composition of our reportable segments or information reviewed by the chief operating decision maker and no impact on our historical segment operating results.\nIn the discussion that follows, we provide certain variances excluding the impact of foreign currency exchange rate fluctuations and acquisitions. Foreign currency exchange rate fluctuations reflect the difference between the current period results as reported compared to the current period results recalculated using the foreign currency exchange rates in effect for the comparable prior period. While operating revenues adjusted for the impact of foreign currency fluctuations includes asset-based fees that have been adjusted for the impact of foreign currency fluctuations, the underlying AUM, which is the primary component of asset-based fees, is not adjusted for foreign currency fluctuations. Approximately three-fifths of the AUM is invested in securities denominated in currencies other than the U.S. dollar, and accordingly, any such impact is excluded from the disclosed foreign currency-adjusted variances.\nFor the nine months ended September 30, 2025, our largest client organization by revenue, BlackRock, accounted for 10.6% of our consolidated operating revenues, with 96.4% of the operating revenues from BlackRock coming from fees based on the assets in BlackRock’s ETFs and non-ETF products that are based on our indexes.\nThe discussion of our results of operations for the three and nine months ended September 30, 2025 and 2024 are presented below. The results of operations for interim periods may not be indicative of future results.\nCritical Accounting Policies and Estimates\nWe recognize goodwill in business combination transactions when the purchase price exceeds the fair value of the acquired net tangible and separately identifiable intangible assets. We test goodwill for impairment annually on July 1 or when interim triggers arise at the reporting unit level. When testing goodwill for impairment, we first assess qualitative factors to determine whether it is necessary to perform the quantitative goodwill impairment test; however, on a periodic basis, we may elect to bypass the qualitative assessment and proceed directly to the quantitative test.\nAs of July 1, 2025, the Company has selected to bypass the optional qualitative assessment for the Real Assets and Private Capital Solutions (“PCS”) reporting units. This decision was based on the relatively low excess of fair value over carrying value observed in the prior year’s analysis. Therefore, a quantitative goodwill impairment test was performed for both Real Assets and PCS. For the Index, Analytics, and Sustainability and Climate reporting units, the company performed a qualitative assessment. The quantitative test for impairment used an equal weighting of the income approach and the market approach to estimate the fair value of the Real Assets and PCS reporting units.\nThe income approach requires significant judgments in estimating future cash flows, including assumptions, amongst others, about revenue growth rates and EBITDA margins, and the selection of an appropriate discount rate, which reflects the reporting unit’s cost of capital. Forecasted future cash flows are estimated based on a combination of historical experience and assumptions regarding future growth and profitability of each reporting unit. Discount rates are selected for each reporting unit being valued based on each reporting unit’s estimated weighted-average cost of capital. The weighted-average cost of capital is estimated based on both the capital structure that we believe a market participant would utilize as well as the discount rates of guideline public companies that have similar characteristics to each reporting unit being valued, adjusted for the risk inherent in each reporting unit. Terminal growth rates are selected based on growth rates used during the reporting unit’s forecast period in combination with economic conditions.\nThe market approach utilizes valuation multiples of revenue and cash flows derived from guideline public companies that have similar characteristics to each reporting unit being valued. Selecting appropriate guideline companies, valuation multiples and other key assumptions such as revenue growth rates and discount rates requires significant management judgment, and changes to these estimates could materially impact the fair value determination of each reporting unit. We perform sensitivity analyses around key assumptions in order to assess the reasonableness of the assumptions and the impact on the estimated fair value.\nImpairment occurs when the estimated fair value of the reporting unit is below the carrying value. As of July 1, 2025, all reporting units had fair values exceeding their carrying values. As a result, no goodwill impairment was recorded as of this date.\nAt September 30, 2025, the carrying value of goodwill of the Real Assets and Private Capital Solutions reporting units were $691.3 million and $617.8 million, respectively. As of July 1, 2025, the fair value of the Real Assets and Private Capital Solutions reporting units exceeded their carrying values by appr\noximately 39% and 15%,\nrespectively. If we experience a prolonged downturn in the business environment or financial markets, weaker-than-expected performance of one of our businesses or a sustained decline in our common stock price, our goodwill could be impaired in the future, which may be material to our results of operations and financial position.\nFor the Real Assets and PCS reporting units, individually, a hypothetical decrease in revenue growth rates by 100 basis points or a hypothetical 100 basis point increase in the weighted average cost of capital would not result in an impairment. See Note 6, “Goodwill and Intangible Assets, Net” of the Notes to the Condensed Consolidated Financial Statements included herein for additional information on goodwill.\nResults of Operations\nOur operating revenues are grouped by the following types: recurring subscriptions, asset-based fees and non-recurring. We also group operating revenues by major product as follows: Index, Analytics, Sustainability and Climate and\nAll Other – Private Assets\nThe followin"
}