{
  "source_file": "msci-20241231.htm",
  "form_type": "10-K",
  "item1_clean": "enhance our multi-asset class and total portfolio capabilities.\nWe also integrate our private assets data and analytics in other MSCI products offered by our other operating segments, including indexes, climate risk models, MAC models and other MSCI solutions.\nOur Real Assets offerings include:\nReal Capital Analytics\n. RCA aggregates timely transaction data and provides valuable information on market pricing, capital flows and investment trends in more than 170 countries. Our clients use this unique data to formulate strategies, source new opportunities and execute deals.\nPortfolio Performance Insights.\nOur Portfolio Performance Insights application offers an interactive, integrated solution to analyze the drivers of performance across investments, as well as review exposures and concentrations across markets, asset types and portfolios.\nPortfolio Climate Insights.\nOur Portfolio Climate Insights solution provides forward-looking and return-based valuation assessments to measure climate-related risks for real estate assets in an investment portfolio.\nPortfolio Income Insights.\nOur Portfolio Income Insights solution enables investors to proactively measure and manage income risk. This offering uses intuitive dashboards, bond-equivalent rating scores and a proprietary global tenant grading system to enable investors to better understand the likelihood of current and future tenant risk across assets and portfolios.\nOur Index Intel offering is an extensive private real estate database that is used by institutional investors, asset managers, banks, custodians and investment consultants to drive allocation decisions, research and strategy developments, and portfolio and risk management.\n. Our Property Intel offering provides web-based services for the analysis of commercial real estate in the Nordics and offers extensive information on rental levels, property holdings, transactions, ownership, occupiers, footfall, lease data and the ability to simulate market values.\nOur Private Capital Solutions offerings include:\n. The Private i Platform merges analytical tools and powerful reporting to help investment, risk and operations teams consistently and accurately monitor, measure and report on their private asset portfolios and associated investment activity.\n. The Total Plan Platform is an industry-leading, multi-asset class investment analytics platform. It provides a comprehensive view of the drivers of performance and risk in both public and private investments in total portfolios.\nCarbon Footprinting of Private Equity and Debt Funds\n. Carbon Footprinting of Private Equity and Debt Funds offers extensive data and analytics for estimating and monitoring greenhouse gas emissions within private equity and debt portfolios.\n. Our Private Capital Transparency Data offering provides investment teams with information on the holdings of private capital funds that is gathered from original source documents provided by managers and augmented with extensive research.\n. The Universe Analytics offering provides private capital performance data that is used by asset allocators as a source of official institutional benchmarks and as a basis for asset allocation, research, due diligence and compensation decisions.\nFor the year ended December 31, 2024, 9.0% of our revenues were attributable to our private assets offerings.\nResearch and Development\nWe apply an integrated team approach to developing content across our operating segments. Our research and development, product management, data operations and technology, and application development teams are at the center of this process. Our content is developed by a research and development team comprised of mathematicians, economists, statisticians, financial engineers, investment professionals and industry experts. Content created in one segment can often be used for the creation of products in another segment. For example, the MAC models created in our Analytics segment offer a view of risk across market and asset classes, including private assets, by incorporating content generated in our private assets offerings. In addition, our MSCI ESG and Climate indexes and our climate reporting analytics product are constructed using data from our ESG and Climate operating segment.\nThrough our relationships with the world’s largest investment institutions, we monitor investment trends and their drivers globally and support instrument valuation, risk modeling, portfolio construction, portfolio attribution, asset allocation and value-at-risk simulation. An important way we monitor global investment trends and their implications for our business is through direct public consultations and client advisory panels and through the forum provided by our Advisory Council, which discusses current and emerging investment industry trends and is comprised of senior investment professionals from around the world and senior members of our research and development team.\nTechnology plays a pivotal role in our operations and our ability to innovate and launch products and services. Current areas of focus include:\nImproving the client experience\nby enhancing the way clients access, interact with and use our data, applications and other tools. We continue to develop and launch open-architecture offerings and improve integration with clients’ ecosystems via APIs.\nAdvancing data processing\nthrough data science, machine learning and AI. These technologies enable more efficient data collection, enhance content and support quality-control processes, allowing us to scale operations and enhance our products. AI is also central to developing new solutions like AI Portfolio Insights and GeoSpatial Asset Intelligence, which provide innovative ways for clients to analyze portfolios and assess risks.\nEnhancing information security\nby further strengthening our technology infrastructure and software security processes. We implement upgrades and maintain processes designed to reduce cyber risk and improve employee awareness of cyber and information security issues through training.\nModernizing our workplace\nto better support a remote and hybrid workforce that can collaborate and productively work from anywhere.\nMigrating products, data and services onto cloud platforms\nto reduce data center risks and accelerate the delivery of new capabilities that help clients more efficiently manage data and understand drivers of risk and performance.\nMany industry participants compete with us by offering one or more indexes in similar categories. Such indexes vary widely in scope, including by geographic region, business sector and weighting methodology, and may be used by clients in a variety of ways in many different markets around the world. Among our Index competitors are S&P Dow Jones Indices LLC (a joint venture\nof S&P Global Inc. and CME Group Inc.); FTSE Russell, a subsidiary of the London Stock Exchange Group plc; Nasdaq Inc; Bloomberg Finance L.P. (“Bloomberg”); and Solactive AG.\nCompetition also exists from industry participants, including asset managers and investment banks, that create their own indexes, often in cooperation with index providers who provide some form of calculation agent service. Some asset managers also manage funds, including ETFs, based on their proprietary indexes, and some investment banks launch structured products or create over-the-counter derivatives based on their proprietary indexes. This is often referred to as self-indexing.\nOur Analytics offerings compete with those from a range of competitors, including Axioma (part of SimCorp), BlackRock Solutions, Bloomberg, and FactSet Research Systems Inc. Additionally, some of the larger broker-dealers have developed proprietary analytics tools for their clients. Similarly, some of the large global investment organizations, such as custodians, have developed internal risk management and performance analytics tools that they offer to their clients.\nOur ESG and Climate offerings compete with a growing number of companies that issue ESG and climate data, ratings or research. For example, our ESG and Climate offerings compete with those from a range of competitors, including Sustainalytics Holding B.V. (a part of Morningstar, Inc.), Institutional Shareholder Services Inc. (majority owned by Deutsche Börse AG), S&P Global Inc., Refinitiv (a London Stock Exchange Group business) and Bloomberg.\nAll Other – Private Assets.\nWe have a variety of competitors for our offerings that provide data, market intelligence, indexes, and performance and risk attribution services relating to private assets. Our private assets data and analytics products also compete with a variety of products and tools that provide transaction-, fund- and asset-level data for private assets and across asset classes.\nIntellectual Property, Other Proprietary Rights and Sources of Data\nWe consider many aspects of our offerings, processes and services to be proprietary. We have registered “MSCI” and other marks as trademarks or service marks in the United States and in certain other countries. We will continue to evaluate the registration of additional trademarks and service marks as appropriate. We have also at times filed patent applications to seek to protect our proprietary rights. Additionally, many of our offerings, processes and services require the use of intellectual property that we license for use from third parties. It may be necessary in the future to seek or renew licenses relating to various aspects of our offerings and services. Our ownership and protection of intellectual property and other proprietary rights and our ability to obtain the rights to use third-party intellectual property are important to our business and contribute in part to our overall success.\nIn addition to our intellectual property, we rely on third-party data to create and deliver our products and services. For example, we require certain stock exchange data to construct equity indexes. Termination of or disputes regarding our rights to receive or use such data could limit the information available for us to use or distribute in connection with our products and services.\nCorporate Responsibility\nAs a leader in providing sustainability and climate solutions to investors, we aim to demonstrate leading corporate responsibility practices that benefit our business and align with practices meaningful to our stakeholders, including our clients, employees and shareholders. The Governance and Corporate Responsibility Committee of our Board of Directors (“Board”) oversees our corporate responsibility strategy and activities and receives regular updates from MSCI management.\nWe are committed to reporting on our corporate responsibility efforts. We have published reports aligned with a number of international frameworks, including the “Carbon Disclosure Project (CDP),” the Task Force on Climate-related Financial Disclosures (TCFD) and the Sustainability Accounting Standard Board (SASB).\nHuman Capital Management\nMSCI is committed to creating a performance culture and meritocracy with a high degree of employee engagement. Our talent and leadership development programs are designed to ensure we have the best people with the necessary skills to deliver on MSCI’s strategy, facilitated by a culture of inclusion where all employees are able to perform their best.\nThe Compensation, Talent and Culture Committee of our Board has oversight over talent management matters, including efforts relating to succession/progression planning, career progression and retention strategies, and learning and leadership development. In addition, this Committee oversees efforts relating to our corporate culture, such as our employee engagement and\ninclusion strategies. Our management reports to our Board regularly on our work towards enhancing corporate culture and our talent management strategies. We also regularly engage with our shareholders on these aspects of our human capital management strategies.\nThe Board ",
  "item7_clean": "Item 7. Management’s Discussion and Analysis of Financial Condition and Results of Operations\nINDEX TO MANAGEMENT’S DISCUSSION AND ANALYSIS\nCurrent Trends Affecting MSCI\nKey Financial and Operating Metrics and Drivers\nNon-GAAP Financial Measures and Operating Metrics, definitions\nCritical Accounting Estimates\nFactors Affecting Comparability of Results\nResults of Operations\nLiquidity and Capital Resources\nContractual Obligations\nRecent Accounting Standards Updates\nWe are a leading provider of critical decision support tools and solutions for the global investment community. Our mission-critical offerings help investors navigate the complexities of a dynamic and evolving investment landscape. Leveraging our deep knowledge of the global investment process and our expertise in research, data and technology, we enable our clients to understand and analyze key drivers of risk and return and build portfolios more effectively. The Company has five operating segments: Index, Analytics, ESG and Climate, Real Assets and Private Capital Solutions which\nare presented as the following three reportable segments: Index, Analytics, and ESG and Climate. For reporting purposes, the Real Assets and Private Capital Solutions operating segments are combined and presented as All Other – Private Assets, as they did not meet the required thresholds for separate reportable segment disclosure.\nOur growth strategy includes: (a) extending leadership in research-enhanced content across asset classes, (b) leading the enablement of sustainability and climate investment integration, (c) enhancing distribution and content-enabling technology, (d) expanding solutions that empower client customization, (e) strengthening client relationships and expanding our presence in key geographic areas and (f) executing strategic partnerships and acquisitions with complementary data, content and technology companies. For more information about our Company’s operations, see “\nCurrent Trends Affecting MSCI\nTrends in Sustainability and Climate Investment Strategies\nWe believe sustainability and climate risks are investment risks that significantly impact many investment decisions, regulatory frameworks and corporate strategies. In Europe, disclosure requirements continue to drive demand for sustainability and climate tools to meet both regulatory and investor expectations. In the United States, political debate has led to some scrutiny of the use of sustainability and climate considerations in investment and risk management decisions.\nThe Company’s growth in this space depends on rising global demand for sustainability and climate solutions, which may be influenced by potential regulatory uncertainty or political opposition in certain markets. While some markets may face greater near-\nterm challenges and uncertainty, we believe the long-term shift toward integrating financially material sustainability and climate factors into investment and risk management processes will support continued adoption of our sustainability and climate focused tools.\nAsset Management Industry Dynamics\nIn recent periods, the asset management industry—a key client segment for the Company—has undergone fee pressure and consolidation, driven by structural shifts, intensifying competition and evolving investor preferences. While industry fee pressure and consolidation may result in cost-cutting and vendor consolidation, firms may require more sophisticated and a broader array of investment tools across use cases and asset classes, driving demand for the Company’s offerings.\nThe impact of this fee pressure and consolidation remains uncertain, as client cost pressures could lead to contract adjustments or terminations, while asset managers may expand their use of the Company’s products and services, including for additional investment strategies. The extent to which these dynamics will impact the Company’s growth, client retention and revenue generation will depend on the pace of industry fee pressure and consolidation, evolving client priorities and the Company’s ability to adapt to shifting market demands.\n. Business—Industry Trends and Competitive Advantages\nRisk Factors—Client Risks\nKey Financial and Operating Metrics and Drivers\nIn evaluating our financial performance, we focus on revenue and profit growth, including results accounted for under generally accepted accounting principles in the United States (“GAAP”) as well as non-GAAP measures, for the Company as a whole and by segment.\nWe present revenues disaggregated by types and by segments, which represent our major product lines. We also review expenses by activity, which provides more transparency into how resources are being deployed. In addition, we utilize operating metrics including Run Rate, Subscription Sales and Retention Rate to manage and assess performance and to provide deeper insights into the recurring portion of our business.\nIn the discussion that follows, we provide certain variances excluding the impact of foreign currency exchange rate fluctuations and acquisitions. Foreign currency exchange rate fluctuations reflect the difference between the current period results as reported compared to the current period results recalculated using the foreign currency exchange rates in effect for the comparable prior period. While operating revenues adjusted for the impact of foreign currency fluctuations includes asset-based fees that have been adjusted for the impact of foreign currency fluctuations, the underlying AUM, which is the primary component of asset-based fees, is not adjusted for foreign currency fluctuations. Approximately three-fifths of the AUM is invested in securities denominated in currencies other than the U.S. dollar, and any such impact is excluded from the disclosed foreign currency-adjusted variances.\nOur revenues are presented by type and by segment. For each segment, we present revenues disaggregated by the nature of the revenues, which are recurring subscriptions, asset-based fees and non-recurring revenues.\nRecurring subscription revenues represent fees earned from clients primarily under renewable contracts and are generally recognized ratably over the term of the license or service pursuant to the contract terms. The fees are recognized as we provide the product and service to the client over the license period and are generally billed in advance, prior to the license start date.\nAsset-based fees represent fees earned that are variable in nature, as they are primarily calculated based on the AUM linked to our indexes. Asset-based fees also include revenues related to futures and options contracts linked to our indexes, which are based on trading volumes and fee levels.\nNon-recurring revenues primarily represent fees earned on products and services where we typically do not have renewal clauses within the contract. Examples of such products and services include one-time license fees, certain derivative financial products, certain implementation services, historical data sets and, occasionally, fees for unlicensed usage of our content in historical periods. Based on the nature of the services provided, non-recurring revenues are generally billed either in advance or after delivery and recognized point in time or over the service period.\nSee Note 1, “Introduction and Basis of Presentation” and Note 3, “Revenue Recognition” of the Notes to the Consolidated Financial Statements included herein for additional information on revenue recognition.\nWe group our operating expenses into the following activity categories:\nSelling and marketing;\nResearch and development (“R&D”);\nGeneral and administrative (“G&A”);\nAmortization of intangible assets; and\nDepreciation and amortization of property, equipment and leasehold improvements.\nCosts are assigned to these activity categories based on the nature of the expense or, when not directly attributable, an estimated allocation based on the type of effort involved. Cost of revenues, selling and marketing, R&D and G&A all include both compensation as well as non-compensation related expenses.\nCost of revenues expenses consist of costs related to the production and servicing of our products and services and primarily includes related information technology costs, including data center, cloud service, platform and infrastructure costs; costs to acquire, produce and maintain market data information; costs of research to support and maintain existing products; costs of product management teams; costs of client service and consultant teams to support customer needs; as well as other support costs directly attributable to the cost of revenues including certain human resources, finance and legal costs.\nSelling and Marketing\nSelling and marketing expenses consist of costs associated with acquiring new clients or selling new products or product renewals to existing clients and primarily includes the costs of our sales and marketing teams, as well as costs incurred in other departments associated with acquiring new business, including product management, research, technology and sales operations.\nResearch and Development\nR&D expenses consist of costs to develop new or enhanced products and the costs to develop new or enhanced technologies and service platforms for the delivery of our products and services and primarily include the costs of development, research, product management, project management and the technology support directly associated with these activities.\nGeneral and Administrative\nG&A expenses consist of costs primarily related to finance operations, human resources, office of the CEO, legal, corporate technology, corporate development, impairment charges associated with right of use assets and certain other administrative costs that are not directly attributed, but are instead allocated, to a product or service.\nAmortization of Intangible Assets\nAmortization of intangible assets expense relates to definite-lived intangible assets arising from past acquisitions and capitalization of internally developed software projects. Intangibles arising from past acquisitions consist of customer relationships, proprietary data, trademarks and trade names and technology and software. We amortize definite-lived intangible assets over their estimated useful lives. See Note 1, “Introduction and Basis of Presentation” and Note 9, “Goodwill and Intangible Assets, Net” of the Notes to the Consolidated Financial Statements included herein for additional information on intangible assets and amortization expense.\nDepreciation and Amortization of Property, Equipment and Leasehold Improvements\nDepreciation and amortization of property, equipment and leasehold improvements consists of expenses related to depreciating or amortizing the cost of computer and related equipment, leasehold improvements, software and furniture and fixtures over the estimated useful life of the assets.\nOther Expense (Income), Net\nOther expense (income), net consists primarily of interest we pay on our outstanding indebtedness, including losses on early extinguishment of debt, income and losses associated with our previous equity method investment, foreign currency exchange rate gains and losses, interest we collect on cash and short-term investments, as well as other non-operating income and expense items that may arise from time to time.\nNon-GAAP Financial Measures\n“Adjusted EBITDA,” a non-GAAP measure used by management to assess operating performance, is defined as net income before (1) provision for income taxes, (2) other expense (income), net, (3) depreciation and amortization of property, equipment and leasehold improvements, (4) amortization of intangible assets and, at times, (5) certain other transactions or adjustments, including, when applicable, impairment related to sublease of leased property and certain acquisition-related integration and transaction costs.\n“Adjusted EBITDA expenses,” a non-GAAP measure used by management to assess operating performance, is defined as operating expenses less depreciation and amortization of property, equipment and leasehold improvements and amortization of intangible assets and, at times, certain other transactions or adjustments, including, when applicable, impairment related to sublease of leased property and certain acquisition-related integration and transaction costs.\n“Adjusted EBITDA margin” is defined as Adjusted EBITDA divided by operating revenues.\nAdjusted EBITDA, Adjusted EBITDA expenses and Adjusted EBITDA margin are believed to be meaningful measures for management to assess the operating performance of the Company because they adjust for significant one-time, unusual or non-recurring items as well as eliminate the accounting effects of certain capital spending and acquisitions that do not directly affect what management considers to be the Company’s ongoing operating performance in the period. All companies do not calculate adjusted EBITDA, adjusted EBITDA margin and adjusted EBITDA expenses in the same way. These measures can differ significantly from company to company depending on, among other things, long-term strategic decisions regarding capital structure, the tax jurisdictions in which companies operate and capital investments. Accordingly, the Company’s computation of the Adjusted EBITDA, Adjusted EBITDA margin and Adjusted EBITDA expenses measures may not be comparable to similarly titled measures computed by other companies.\nRun Rate is a key operating metric and is important because an increase or decrease in our Run Rate ultimately impacts our future operating revenues over time. At the end of any period, we generally have recurring subscription and investment product license agreements in place for a large portion of total revenues for the following 12 months. We measure the fees related to these agreements and refer to this as “Run Rate.” See “—\n” below for additional information on the calculation of this metric.\nSubscription Sales is a key operating metric and is important to management because new Subscription Sales increase our Run Rate and represent future operating revenues that will be recognized over time. See “—\n” below for additional information.\nRetention Rate is a key operating metric and is important to management because subscription cancellations decrease our Run Rate and ultimately our future operating revenues over time. See “—\n” below for additional information on the calculation of this metric.\nCritical Accounting Estimates\nOur consolidated financial statements are prepared in accordance with GAAP. These accounting principles require us to make certain estimates and judgments that can affect the reported amounts of assets and liabilities as of the date of the consolidated financial statements, as well as the reported amounts of revenues and expenses during the periods presented. Significant estimates and judgments made by management include such examples as assessment of impairment of goodwill and intangible assets and income\ntaxes. We believe the estimates and judgments upon which we rely are reasonable based upon information available to us at the time these estimates and judgments are made. To the extent there are material differences between these estimates and actual results, our consolidated financial statements will be affected.\nWe recognize goodwill in business combination transactions when the purchase price exceeds the fair value of the acquired net tangible and separately identifiable intangible assets. We test goodwill for impairment annually on July 1 or when interim triggers arise. When testing goodwill for impairment, we first assess qualitative factors to determine whether it is necessary to perform the quantitative goodwill impairment test; however, on a periodic basis, we may elect to bypass the qualitative assessment and proceed directly to the quantitative test. During the year ended December 31, 2024 we elected to bypass the qualitative assessment and proceed directly to th",
  "item2_clean": null
}