{
  "source_file": "msft-20250630.htm",
  "form_type": "10-K",
  "item1_clean": "item1noteforwardlookingstatementsreportincludesestimatesprojectionsstatementsrelatingbusinessplansobjectivesexpectedoperatingresultsforwardlookingstatementswithinmeaningprivatesecuritieslitigationreformact1995section27asecuritiesact1933section21esecuritiesexchangeact1934forwardlookingstatementsappearthroughoutreportincludingfollowingsectionsbusinesspartiitem1form10kriskfactorspartiitem1aform10kmanagementdiscussionanalysisfinancialconditionresultsoperationspartiiitem7form10kforwardlookingstatementsgenerallyidentifiedwordsbelieveprojectexpectanticipateestimateintendstrategyfutureopportunityplanwouldcontinuelikelyresultsimilarexpressionsforwardlookingstatementsbasedcurrentexpectationsassumptionssubjectrisksuncertaintiescauseactualresultsdiffermateriallydescriberisksuncertaintiescouldcauseactualresultseventsdiffermateriallyriskfactorsmanagementdiscussionanalysisfinancialconditionresultsoperationsquantitativequalitativedisclosuresmarketriskpartiiitem7aform10kreaderscautionedplaceunduerelianceforwardlookingstatementsspeakdatemadeundertakeobligationupdaterevisepubliclyforwardlookingstatementswhethernewinformationfutureeventsotherwisepartiitem1businessgeneralmicrosofttechnologycompanycommittedmakingdigitaltechnologyartificialintelligenceaiavailablebroadlydoingresponsiblymissionempowereverypersoneveryorganizationplanetachievedevelopsupportbroadportfoliotechnologysolutionsindividualsbusinessesfocusingsecuretrustedinnovativeplatformstoolsmeetevolvingcustomerneedsacrosscloudcomputingproductivitycollaborationpersonalcomputingstrivecreateopportunitygrowthimpacteverycountryaroundworldaifundamentallytransformingproductivityeveryindividualorganizationindustrymicrosoftaiofferingsspaneverylayertechnologystackenablingtransformativeoutcomesacrosssectorsunlockingopportunityeverycountrycommunityindividualbelieveaiempoweringpowerfulrecommitteddesigningdeployingairesponsiblysafetysecurityoutsetofferfounded1975developsupportsoftwareservicesdevicessolutionsdelivernewvaluecustomershelppeoplebusinessesrealizefullpotentialofferarrayservicesincludingcloudbasedsolutionsprovidecustomerssoftwareservicesplatformscontentprovidesolutionsupportconsultingservicesdeliverrelevantonlineadvertisingglobalaudienceproductsincludeoperatingsystemscrossdeviceproductivitycollaborationapplicationsserverapplicationsbusinesssolutionapplicationsdesktopservermanagementtoolssoftwaredevelopmenttoolsvideogamesdesignselldevicesincludingpcstabletsgamingentertainmentconsolesintelligentdevicesrelatedaccessoriesdigitaltransformationadoptionaicontinuesrevolutionizebusinessworkstreamsorganizationseverysectoracrossglobeenterprisesdigitaltechnologyempowersemployeesoptimizesoperationsengagescustomerscaseschangescoreproductsservicesmicrosoftcloudprovidesintegrationacrosstechnologystackofferingopennessimprovingtimevaluereducingcostsincreasingagilitycloudbusinessbenefitsthreeeconomiesscaledatacentersdeploycomputationalresourcessignificantlylowercostunitsmalleronesdatacenterscoordinateaggregatediversecustomergeographicapplicationdemandpatternsimprovingutilizationcomputingstoragenetworkresourcesmultitenancylocationslowerapplicationmaintenancelaborcostsprioritizesecurityaboveelseoffercustomersintegratedaidrivenproductsaddressingsecuritycomplianceidentitymanagementprivacyacrosscustomersmulticloudapplicationdeviceassetsambitionsdriveusachievevisionresearchdevelopmenteffortsfocusthreeinterconnectedambitionsreinventproductivitybusinessprocesseshelporganizationsindividualsworkcollaboratesecurelyefficientlybuildintelligentcloudintelligentedgeplatformprovidefoundationcustomersdigitalworkloadsincludinghybridconsistencydeveloperproductivitydataaicapabilitiestrustedsecuritycompliancecreatepersonalcomputingenableusersinteracttechnologyintuitiveengagingdynamicwaysfutureopportunityfocusedhelpingcustomersusebreadthdepthmicrosoftcloudgetvaluedigitalspendleadingaiplatformwaveacrosssolutionareascontinuedevelopcompleteintelligentsolutionscustomersempowerpeopleproductivecollaboratesafeguardingbusinessessimplifyingmanagementgoalleadindustryseveraldistinctareastechnologylongtermexpecttranslatesustainedgrowthinvestingsignificantresourcestransformingworkplacebuildingrunningcloudbasedservicesapplyingaiambientintelligenceprovidingtraininggenerativeaiinventingnewgamingexperiencesleveragingwindowsfuelcloudbusinesstacklingsecurityintegratedendendsolutionscommitmentsustainabilitymicrosoftcommittedsustainabilityapproachaddressingclimatechangestartssustainabilitybusiness2020announcedgoalsbecomecarbonnegativewaterpositivezerowastecompany2030sinceannouncinggoalsmademeaningfulprogressseenmajorchangestechnologysectorunderstandingtakemeetgoalsprogresstowardgoalsfoundannualenvironmentalsustainabilityreportoperatingsegmentsoperatebusinessreportfinancialperformanceusingthreesegmentsproductivitybusinessprocessesintelligentcloudpersonalcomputingsegmentsprovidemanagementcomprehensivefinancialviewkeybusinessessegmentsenablealignmentstrategiesobjectivesacrossdevelopmentsalesmarketingservicesorganizationsprovideframeworktimelyrationalallocationresourceswithinbusinessespersonalcomputingpersonalcomputingsegmentconsistsproductsservicesputcustomerscenterexperiencetechnologysegmentprimarilycompriseswindowsdevicesgamingsearchnewsadvertising",
  "item7_clean": "Revenue increased $3.8 billion or 7%.\nWindows and Devices revenue increased $288 million or 2%. Windows OEM and Devices revenue increased 3% driven by growth in Windows OEM, offset in part by a decline in Devices.\nGaming revenue increased $2.0 billion or 9% driven by growth in Xbox content and services, offset in part by a decline in Xbox hardware. Xbox content and services revenue increased 16% driven by the impact of the Activision Blizzard acquisition and Xbox Game Pass. Xbox hardware revenue decreased 25% driven by lower volume of consoles sold.\nSearch and news advertising revenue increased $1.6 billion or 13%. Search and news advertising revenue excluding traffic acquisition costs increased 20% driven by higher search volume and higher revenue per search.\nOperating income increased $2.2 billion or 18%.\nCost of revenue increased $346 million or 1% driven by growth in Search and news advertising.\nGross margin increased $3.5 billion or 13% with growth across all businesses. Gross margin percentage increased with improvement across all businesses.\nOperating expenses increased $1.3 billion or 9% driven by Gaming, including the impact of the Activision Blizzard acquisition.\nOPERATING EXPENSES\nResearch and Development\n\nRevenue increased $14.0 billion or 13%.\nMicrosoft 365 Commercial products and cloud services revenue increased $10.8 billion or 14%. Microsoft 365 Commercial cloud revenue grew 15% with Microsoft 365 Commercial seat growth of 6% driven by small and medium businesses and frontline worker offerings, as well as growth in revenue per user. Microsoft 365 Commercial products revenue grew 7% driven by the Windows Commercial on-premises components of Microsoft 365 suite sales and an increase in Office transactional purchasing with the launch of Office 2024.\nMicrosoft 365 Consumer products and cloud services revenue increased $756 million or 11%. Microsoft 365 Consumer cloud revenue grew 11% driven by Microsoft 365 Consumer subscriber growth of 8% to 89.0 million, as well as growth in revenue per user from the price increase announced in January 2025.\nLinkedIn revenue increased $1.4 billion or 9% with growth across all lines of business.\nDynamics products and cloud services revenue increased $996 million or 15% driven by growth in Dynamics 365, offset in part by a decline in Dynamics on-premises products. Dynamics 365 revenue grew 19% with growth across all workloads.\nOperating income increased $10.1 billion or 17%.\nCost of revenue increased $2.8 billion or 14% driven by growth in Microsoft 365 Commercial cloud.\nGross margin increased $11.2 billion or 13% driven by growth in Microsoft 365 Commercial cloud. Gross margin percentage decreased slightly primarily driven by the impact of scaling our AI infrastructure, offset in part by efficiency gains in Microsoft 365 Commercial cloud.\nOperating expenses increased $1.1 billion or 4% driven by investments in cloud and AI engineering and commercial sales.\n\nThe investments we are making in cloud and AI infrastructure and devices will continue to increase our operating costs and may decrease our operating margins. We continue to identify and evaluate opportunities to expand our datacenter locations and increase our server capacity to meet the evolving needs of our customers, particularly given the growing demand for AI services. Our datacenters depend on the availability of permitted and buildable land, predictable energy, networking supplies, and servers, including graphics processing units (“GPUs”) and other components. Our devices are primarily manufactured by third-party contract manufacturers. For the majority of our products, we have the ability to use other manufacturers if a current vendor becomes unavailable or unable to meet our requirements. However, some of our products contain certain components for which there are very few qualified suppliers. Extended disruptions at these suppliers could impact our ability to manufacture devices on time to meet consumer demand.\n\nRevenue increased $18.8 billion or 21%.\nServer products and cloud services revenue increased $18.6 billion or 23% driven by Azure and other cloud services. Azure and other cloud services revenue grew 34% driven by demand for our portfolio of services. Server products revenue decreased 3% driven by a decrease in transactional purchasing with continued customer shift to cloud offerings.\nEnterprise and partner services revenue increased $166 million or 2% driven by growth in Enterprise Support Services, offset in part by a decline in Industry Solutions.\nOperating income increased $6.8 billion or 18%.\nCost of revenue increased $10.6 billion or 36% driven by growth in Azure.\nGross margin increased $8.2 billion or 14% driven by growth in Azure. Gross margin percentage decreased driven by the impact of scaling our AI infrastructure, offset in part by efficiency gains in Azure.\nOperating expenses increased $1.5 billion or 7% driven by investments in cloud and AI engineering.\nMore Personal Computing\n\nOur consolidated financial statements and accompanying notes are prepared in accordance with GAAP. Preparing consolidated financial statements requires management to make estimates and assumptions that affect the reported amounts of assets, liabilities, revenue, and expenses. Critical accounting estimates are those estimates that involve a significant level of estimation uncertainty and could have a material impact on our financial condition or results of operations. We have critical accounting estimates in the areas of revenue recognition, impairment of investment securities, goodwill, research and development costs, legal and other contingencies, and income taxes.\n\nWe generate revenue by offering a wide range of cloud-based solutions, content, and other services to people and businesses; licensing and supporting an array of software products; delivering relevant online advertising to a global audience; and designing and selling devices. Our most significant expenses are related to compensating employees; supporting and investing in our cloud-based services, including datacenter operations; designing, manufacturing, marketing, and selling our other products and services; and income taxes.\nHighlights from fiscal year 2025 compared with fiscal year 2024 included:\nMicrosoft Cloud revenue increased 23% to $168.9 billion.\nMicrosoft 365 Commercial products and cloud services revenue increased 14% driven by Microsoft 365 Commercial cloud revenue growth of 15%.\nMicrosoft 365 Consumer products and cloud services revenue increased 11% driven by Microsoft 365 Consumer cloud revenue growth of 11%.\nLinkedIn revenue increased 9%.\nDynamics products and cloud services revenue increased 15% driven by Dynamics 365 revenue growth of 19%.\nServer products and cloud services revenue increased 23% driven by Azure and other cloud services revenue growth of 34%.\nWindows OEM and Devices revenue increased 3%.\nXbox content and services revenue increased 16%.\nSearch and news advertising revenue excluding traffic acquisition costs increased 20%.\nIndustry Trends and Opportunities\nOur industry is dynamic and highly competitive, with frequent changes in both technologies and business models. Each industry shift is an opportunity to conceive new products, new technologies, or new ideas that can further transform the industry and our business. At Microsoft, we push the boundaries of what is possible through a broad range of research and development activities that seek to identify and address the changing demands of customers and users, industry trends, and competitive forces.\nMicrosoft and OpenAI maintain a long-term strategic partnership originally established in 2019. Microsoft is a major investor in OpenAI, and the companies have reciprocal revenue-sharing arrangements. We hold rights to OpenAI’s intellectual property, including models and infrastructure, for integration into our products. The OpenAI API is exclusive to Azure, runs on Azure, and is available through the Azure OpenAI Service. We also have a right of first refusal on OpenAI's new capacity needs.\n\nOur success is highly dependent on our ability to attract and retain qualified employees. We hire a mix of university and industry talent worldwide. We compete for talented individuals globally by offering an exceptional working environment, broad customer reach, scale in resources, the ability to grow one’s career across many different products and businesses, and competitive compensation and benefits.\nOur international operations provide a significant portion of our total revenue and expenses. Many of these revenue and expenses are denominated in currencies other than the U.S. dollar. As a result, changes in foreign exchange rates may significantly affect revenue and expenses. Fluctuations in the U.S. dollar relative to certain foreign currencies did not have a material impact on reported revenue and expenses from our international operations in fiscal year 2025.\nFurther, global, regional, and local economic developments and changes in global trade policies such as restrictions on international trade, including tariffs and other controls on imports or exports, could result in increased supply chain challenges, cost volatility, and consumer and economic uncertainty which may adversely affect our results of operations.\nOur revenue fluctuates quarterly and is generally higher in the fourth quarter of our fiscal year. Fourth quarter revenue is driven by a higher volume of multi-year contracts executed during the period.\n\nOur effective tax rate for both fiscal years 2025 and 2024 was 18%. Our effective tax rate for the fiscal year ended June 30, 2025 was primarily impacted by changes in the mix of our earnings and tax expenses between the U.S. and foreign countries.\nOur effective tax rate was lower than the U.S. federal statutory rate, primarily due to earnings taxed at lower rates in foreign jurisdictions resulting from producing and distributing our products and services through our foreign regional operations center in Ireland.\nThe mix of income before income taxes between the U.S. and foreign countries impacted our effective tax rate as a result of the geographic distribution of, and customer demand for, our products and services. In fiscal year 2025, our U.S. income before income taxes was $69.2 billion and our foreign income before income taxes was $54.4 billion. In fiscal year 2024, our U.S. income before income taxes was $62.9 billion and our foreign income before income taxes was $44.9 billion.\nThe Organisation for Economic Co-operation and Development (“OECD”) published its model rules “Tax Challenges Arising From the Digitalisation of the Economy - Global Anti-Base Erosion Model Rules (Pillar Two)” which established a global minimum corporate tax rate of 15% for certain multinational enterprises. Many countries have implemented or are in the process of implementing the Pillar Two legislation, which applies to Microsoft beginning in fiscal year 2025. While we do not currently estimate a material impact to our consolidated financial statements, we continue to monitor the impact as countries implement legislation and the OECD provides additional guidance.\nWe are currently assessing the One Big Beautiful Bill Act (“OBBBA”) which was enacted on July 4, 2025. The OBBBA provides a U.S. global intangible low-taxed income effective tax rate of 14% effective fiscal year 2027 for Microsoft. It also provides bonus depreciation for certain assets placed into service after January 19, 2025 and an election to expense U.S. incurred research or experimental expenditures.\nUncertain Tax Positions\nWe remain under audit by the IRS for tax years 2014 to 2017. With respect to the audit for tax years 2004 to 2013, on September 26, 2023, we received Notices of Proposed Adjustment (“NOPAs”) from the IRS. The primary issues in the NOPAs relate to intercompany transfer pricing. In the NOPAs, the IRS is seeking an additional tax payment of $28.9 billion plus penalties and interest. As of June 30, 2025, we believe our allowances for income tax contingencies are adequate. We disagree with the proposed adjustments and will vigorously contest the NOPAs through the IRS’s administrative appeals office and, if necessary, judicial proceedings. We do not expect a final resolution of these issues in the next 12 months. Based on the information currently available, we do not anticipate a significant increase or decrease to our income tax contingencies for these issues within the next 12 months.\nWe are subject to income tax in many jurisdictions outside the U.S., some of which are currently under audit by local tax authorities. The resolution of these audits is not expected to be material to our consolidated financial statements. Our operations in Ireland remain subject to examination for tax years 2020 and thereafter.\n\nGross margin percentage decreased slightly driven by Intelligent Cloud, offset in part by More Personal Computing.\nMicrosoft Cloud gross margin percentage decreased to 69% driven by the impact of scaling our AI infrastructure, offset in part by efficiency gains in Azure.\nOperating expenses increased $3.8 billion or 6% driven by investments in cloud and AI engineering and Gaming, including the impact of the Activision Blizzard acquisition.\nOperating income increased $19.1 billion or 17% with growth across each of our segments.\n\nSales and marketing expenses include payroll, employee benefits, stock-based compensation expense, and other headcount-related expenses associated with sales and marketing personnel, and the costs of advertising, promotions, trade shows, seminars, and other programs.\nFiscal Year 2025 Compared with Fiscal Year 2024\nSales and marketing expenses increased $1.2 billion or 5% driven by investments in commercial sales and Gaming, including the impact of the Activision Blizzard acquisition.\nGeneral and Administrative\n\nCash from operations increased $17.6 billion to $136.2 billion for fiscal year 2025, primarily due to an increase in cash received from customers, offset in part by an increase in cash paid to suppliers and employees and cash used to pay income taxes. Cash used in financing increased $13.9 billion to $51.7 billion for fiscal year 2025, primarily due to a $9.5 billion increase in cash used for repayments of debt, net of proceeds. Cash used in investing decreased $24.4 billion to $72.6 billion for fiscal year 2025, primarily due to a $63.2 billion decrease in cash used for acquisitions of companies, net of cash acquired and divestitures, and purchases of intangible and other assets, offset in part by a $22.3 billion increase in cash used in net investment purchases, sales, and maturities, and a $20.1 billion increase in additions to property and equipment.\n\nFiscal Year 2025 Compared with Fiscal Year 2024\nInterest and dividends income decreased primarily due to lower portfolio balances. Interest expense decreased primarily due to maturities of commercial paper and higher capitalization of debt interest expense, offset in part by higher finance lease interest expense. Net recognized losses on investments increased primarily due to higher impairments, offset in part by higher gains on equity investments in the current period. Net losses on derivatives increased primarily due to higher losses on equity derivatives in the current period. Other, net primarily reflects net recognized losses on equity method investments, including OpenAI.\nINCOME TAXES\n\nGeneral and administrative expenses include payroll, employee benefits, stock-based compensation expense, employee severance expense incurred as part of a corporate program, and other headcount-related expenses associated with finance, legal, facilities, certain human resources and other administrative personnel, certain taxes, and legal and other administrative fees.\nFiscal Year 2025 Compared with Fiscal Year 2024\nGeneral and administrative expenses decreased $386 million or 5% driven by Gaming, including t",
  "item2_clean": null
}