{
  "source_file": "mtch-20241231.htm",
  "form_type": "10-K",
  "item1_clean": "Match Group, Inc., through its portfolio companies, is a leading provider of digital technologies designed to help people make meaningful connections. Our global portfolio of brands includes Tinder\n, Pairs™, Plenty Of Fish\n, BLK\n, and more, each built to increase our users’ likelihood of connecting with others. Through our trusted brands, we provide tailored services to meet the varying preferences of our users. Our services are available in over 40 languages to our users all over the world.\nAs used herein, “Match Group,” the “Company,” “we,” “our,” “us,” and similar terms refer to Match Group, Inc. and its subsidiaries, unless the context indicates otherwise.\nThe business of creating meaningful connections\nOur goal is to spark meaningful connections for users around the world. Consumers’ preferences vary significantly, influenced in part by demographics, geography, cultural norms, religion, and intent (for example, seeking friendship, casual dating, or more serious relationships). As a result, the market for social connection apps is fragmented, and no single service has been able to effectively serve all of those seeking social connections.\nPrior to the proliferation of the internet and mobile devices, human connections traditionally were limited by social circles, geography, and time. People met through work colleagues, friends and family, in school, at church, at social gatherings, in bars and restaurants, or in other social settings. Today, the adoption of mobile technology and the internet has significantly expanded the ways in which people can create new interactions, and develop meaningful connections and relationships. Additionally, the ongoing adoption of technology into more aspects of daily life continues to further erode biases and stigmas across the world that previously served as barriers to individuals using technology to help find and develop those connections.\nWe believe that technologies that bring people together serve as a natural extension of the traditional means of meeting people and provide a number of benefits for users, including:\n: Social connection apps provide users access to a large pool of people they otherwise would not have a chance to meet.\n: The search and recommending features, as well as the profile information available on social connection apps, allow users to filter a large number of individuals in a short period of time, increasing the likelihood that users will make a connection with someone.\nMore comfort and control\n: Compared to the traditional ways that people meet, social connection apps provide an environment that reduces the awkwardness around identifying and reaching out to new people who are interested in connecting. This leads to many people who would otherwise be passive participants taking a more active role.\nSafely meet new people:\nSocial connection apps can offer a safer way to contact new people for the first-time by allowing people to limit the amount of personal information exchanged and providing an opportunity to vet a new connection before meeting in person, including via video communication.\n: The nature of the internet and the proliferation of mobile devices allow users to connect with new people at any time, regardless of where they are.\nDepending on a person’s circumstances at any given time, social connection apps can act as a supplement to, or substitute for, traditional means of meeting people. When selecting a social connection app, we believe that users consider the following attributes:\nBrand recognition and scale\n: Brand is very important. Users generally associate strong brands with a higher likelihood of success and more tools to help the user connect safely and securely. Generally, successful brands depend on large, active communities of users, strong algorithmic filtering technology, and awareness of successful usage among similar users.\nSuccessful experiences\n: Demonstrated success of other users attracts new users through word-of-mouth recommendations. Successful experiences also drive repeat usage.\nCommunity identification\n: Users typically look for social connection apps that offer a community or communities to which the user can relate. By selecting a social connection app that is focused on a particular demographic, religion, geography, or intent, users can increase the likelihood that they will make a connection with someone with whom they identify.\nService features and user experience\n: Users tend to gravitate towards social connection apps that offer features and user experiences that resonate with them, such as question-based matching algorithms, location-based features, or search capabilities. User experience is also driven by the type of user interface (for example, using our patented Swipe\ntechnology versus scrolling), a particular mix of free and paid features, ease of use, privacy, and security. Users expect every interaction with a social connection app to be seamless and intuitive.\nGiven varying consumer preferences, we have adopted a brand portfolio approach, through which we attempt to offer social connection apps that collectively appeal to the broadest spectrum of consumers. We believe that this approach maximizes our ability to attract additional users.\nwas launched in 2012 and has since risen to scale and popularity faster than any other service in the online dating category. Tinder’s patented Swipe\ntechnology has led to significant adoption, particularly among 18 to 25 year-old users, who were historically underserved by the online dating category. Tinder employs a freemium model, through which users are allowed to enjoy many of the core features of Tinder for free, including limited use of the Swipe Right\nfeature with unlimited communication with other users. However, to enjoy premium features, such as unlimited use of the Swipe Right feature, a Tinder user must subscribe to one of several subscription offerings: Tinder Plus\n, or Tinder Platinum\n. Tinder users and subscribers may also pay for certain premium features, such as Super Likes™ and Boosts, on a pay-per-use basis. Tinder Explore is an additional feature available for users to discover and interact with others in ways that are non-traditional to Tinder.\nlaunched in 2012 and has grown to be a popular app for relationship-minded individuals, particularly among the millennial and younger generations, in English speaking countries and several other European markets. Hinge is a mobile-only experience and employs a freemium model. Hinge is Designed to be Deleted® and focuses on users with a higher level of intent to enter into a relationship and its services are designed to reinforce that purpose. Hinge has Video Prompts, Voice Prompts, and Voice Notes, which allows users to better showcase who they are through text, photos, video, and voice at different points in their dating journey. Hinge offers two premium subscription offerings: Hinge+ and HingeX.\nEvergreen & Emerging (“E&E”)\nOur collections of brands within E&E include well-known pioneers in online relationships (which we refer to as Evergreen brands) and newer brands which target specific demographics (which we refer to as Emerging brands). The following brands are included in E&E:\nplatform was launched in 1995 and helped create the online dating category with the ability to search profiles and receive algorithmic recommendations. Match is a brand that focuses on users with a higher level of intent to enter into a serious relationship and its services and marketing are designed to reinforce that purpose.\n, a leading European online dating brand based in France, was launched in 2001. Meetic is the most recognized dating app for singles over age 35 in Europe. Meetic is a brand that focuses on users with a higher level of intent to enter into a serious relationship and its service and marketing are designed to reinforce that purpose. Meetic also has online audio and video chat rooms available for users.\nservice was launched in 2004 and has attracted users through a Q&A approach to the dating category. OkCupid relies on a freemium model and has a loyal, culturally progressive user base predominately located in larger metropolitan areas in English-speaking markets.\ndating service launched in 2003. Among its distinguishing features is the ability to both search profiles and receive algorithmic recommendations. Plenty Of Fish has grown in popularity over the years and relies on a freemium model. Plenty Of Fish has broad appeal in the United States, Canada, the United Kingdom, and a number of other international markets.\nBLK.\nBLK\nfeature made popular by Tinder to the Black community.\nMatch Group Asia (“MG Asia”)\nThe focus of the MG Asia brands has primarily been to serve various Asian and Middle Eastern markets. Recently, Azar has expanded into European and U.S. markets. The following brands are included in MG Asia:\nPairs™ app was launched in 2012 and is a leading provider of online dating services in Japan, with a presence in Taiwan and South Korea. Pairs is a dating platform that was specifically designed to address social barriers generally associated with the use of dating services in Japan.\nwas launched in 2014 and acquired in 2021 through our acquisition of Hyperconnect. Azar is a one-to-one video chat service that allow users to meet and interact with a variety of people across the globe in their native language. Azar is primarily focused in the Middle East region, with growth in Western Europe and recent expansion into the U.S.\nOur Portfolio Strategy\nWe strive to empower individual brand leaders with the authority and incentives to grow their respective brands. Our brands compete with each other and with third-party businesses on brand characteristics, service features, and business model, however we also work to apply a centralized discipline and share best practices across our brands in order to quickly introduce new services and features, optimize marketing, increase growth, reduce costs, improve user safety, and maximize profitability. Additionally, we centralize certain other administrative functions, such as legal, accounting, finance, treasury, real estate and facilities, and tax. We attempt to centrally facilitate excellence and efficiency across the entire portfolio by:\ncentralizing operational functions across certain brands where we have strength in personnel and sufficient commonality of business interest (for example, ad sales, online marketing, and business technology are centralized across some, but not all, brands);\ndeveloping talent across the portfolio to allow for development of specific proficiencies and promoting career advancement while maintaining the ability to deploy the best talent in the most critical positions across the company at any given time; and\nsharing analytics to leverage services and marketing successes across our businesses rapidly for competitive advantage.\nThe industry for social connection apps is competitive and has no single, dominant brand globally. We compete with a number of other companies that provide similar technologies for people to meet each other, including other online dating platforms; other social media platforms and social-discovery apps, such as Facebook, Instagram (owned by Meta), Snap, TikTok, Twitter/X, LinkedIn (owned by Microsoft), Twitch (owned by Amazon), and YouTube (owned by Alphabet); offline dating services, such as in-person matchmakers; and other traditional means of meeting people.\nWe believe that our ability to attract new users to our brands as well as retain existing users will depend primarily upon the following factors:\nour ability to increase consumer acceptance and adoption of technologies to meet other people, particularly among younger generations being first introduced to our services and in emerging markets and parts of the world where the associated stigma has not yet fully eroded;\ncontinued growth in internet access and smart phone adoption in certain regions of the world, pa",
  "item7_clean": "(Dollars in thousands)\nTotal Revenue, as reported\nForeign exchange effects\nTotal Revenue excluding foreign exchange effects\nTinder Direct Revenue, as reported\nForeign exchange effects\nTinder Direct Revenue, excluding foreign exchange effects\nHinge Direct Revenue, as reported\nForeign exchange effects\nHinge Direct Revenue, excluding foreign exchange effects\nE&E Direct Revenue, as reported\nForeign exchange effects\nE&E Direct Revenue, excluding foreign exchange effects\nMG Asia Direct Revenue, as reported\nForeign exchange effects\nMG Asia Direct Revenue, excluding foreign exchange effects\nFINANCIAL POSITION, LIQUIDITY AND CAPITAL RESOURCES\nCash and cash equivalents:\nTotal cash and cash equivalents\nShort-term investments\nTotal cash and cash equivalents and short-term investments\nLong-term debt, net:\nCredit Facility due March 20, 2029\nTerm Loan due February 13, 2027\n5.00% Senior Notes due December 15, 2027\n4.625% Senior Notes due June 1, 2028\n5.625% Senior Notes due February 15, 2029\n4.125% Senior Notes due August 1, 2030\n3.625% Senior Notes due October 1, 2031\n2026 Exchangeable Notes due June 15, 2026\n2030 Exchangeable Notes due January 15, 2030\nTotal long-term debt\nLess: Unamortized original issue discount\nLess: Unamortized debt issuance costs\nTotal long-term debt, net\n______________________\nThe maturity date of the Credit Facility is the earlier of (x) March 20, 2029 and (y) the date that is 91 days prior to the maturity date of the Term Loan or the existing senior notes due 2027, 2028, or 2029, or any new indebtedness used to refinance the Term Loan or such senior notes that matures prior to the date that is 91 days after March 20, 2029, in each case if and only if at least $250 million in aggregate principal amount of such debt is outstanding on such date.\nFor a detailed description of long-term debt, see “Note 7—Long-term Debt, net” to the consolidated financial statements included in “Item 8. Consolidated Financial Statements and Supplementary Data.”\nCash Flow Information\nIn summary, the Company’s cash flows from continuing operations are as follows:\nYears ended December 31,\nNet cash provided by operating activities attributable to continuing operations\nNet cash used in investing activities attributable to continuing operations\nNet cash used in financing activities attributable to continuing operations\nNet cash provided by operating activities attributable to continuing operations in 2024 includes adjustments to earnings consisting primarily of $267.4 million of stock-based compensation expense; $87.5 million of depreciation; $74.2 million of impairments and amortization of intangibles; deferred income taxes of $15.0 million; and other adjustments of $2.0 million, which includes amortization of deferred financing costs of $6.5 million. The decrease in cash from changes in working capital primarily consists of a decrease in deferred revenue of $43.1 million as weekly subscriptions have increased and an increase in accounts receivable of $29.8 million primarily related to the timing of receipts and an increase in revenue from app stores. These decreases in cash were partially offset by an increase from other assets of $25.3 million, primarily related to amortization of certain assets, and an increase in income taxes payable of $22.2 million due to the timing of tax payments.\nNet cash used in investing activities attributable to continuing operations in 2024 consists primarily of capital expenditures of $50.6 million that are primarily related to internal development of software and purchases of computer hardware.\nNet cash used in financing activities attributable to continuing operations in 2024 is primarily due to purchases of treasury stock of $752.7 million and payments of $11.4 million of withholding taxes paid on behalf of employees for net-settled stock-based awards. These uses of cash were partially offset by $13.6 million of proceeds from the issuance of common stock pursuant to stock-based awards.\nNet cash provided by operating activities attributable to continuing operations in 2023 includes adjustments to earnings consisting primarily of $232.1 million of stock-based compensation expense; $61.8 million of depreciation; $47.7 million of impairments and amortization of intangibles; deferred income taxes of $26.6 million; and other adjustments of $9.9 million, which includes amortization of deferred financing costs of $6.5 million. The decrease in cash from changes in working capital primarily consists of an increase in accounts receivable of $107.4 million primarily related to the timing of receipts and an increase in revenue from app stores, and a decrease in deferred revenue of $41.2 million as weekly subscriptions have increased. These decreases in cash were partially offset by an increase from other assets of $25.1 million.\nNet cash used in investing activities attributable to continuing operations in 2023 consists primarily of capital expenditures of $67.4 million that are primarily related to internal development of software and computer hardware to support our services.\nNet cash used in financing activities attributable to continuing operations in 2023 is primarily due to purchases of treasury stock of $546.2 million and payments of $5.9 million of withholding taxes paid on behalf of employees for net-settled stock-based awards. These uses of cash were partially offset by $19.9 million of proceeds from the issuance of common stock pursuant to stock-based awards.\nNet cash provided by operating activities attributable to continuing operations in 2022 includes adjustments to earnings consisting primarily of $366.3 million of impairments and amortization of intangibles; $203.9 million of stock-based compensation expense; $43.6 million of depreciation; and other adjustments of $7.0 million, which includes amortization of deferred financing costs of $6.7 million. Partially offsetting these\nadjustments was a deferred income tax benefit of $30.0 million. The decrease in cash from changes in working capital primarily consists of a decrease in accounts payable and other liabilities of $472.6 million due mainly to the settlement payment for\nRad, et al. v. IAC/InterActiveCorp, et al.\nand related arbitrations, and timing of other payments; an increase in accounts receivable of $6.7 million primarily related to increased revenue from mobile applications; and a decrease in deferred revenue of $6.5 million. These uses of cash were partially offset by an increase from other assets of $59.6 million primarily due to the amortization of prepaid hosting services.\nNet cash used in investing activities attributable to continuing operations in 2022 consists primarily of capital expenditures of $49.1 million that are primarily related to internal development of software and computer hardware to support our services, and cash used in an acquisition, net of cash acquired, of $25.7 million.\nNet cash used in financing activities attributable to continuing operations in 2022 is primarily due to purchases of treasury stock of $482.0 million, payments of $176.3 million to settle the outstanding 2022 Exchangeable Notes, payments of $109.3 million of withholding taxes paid on behalf of employees for net-settled stock-based awards, purchases of non-controlling interests for $10.6 million, and payments of $7.5 million to settle outstanding warrants associated with the 2022 Exchangeable Notes. These uses of cash were partially offset by proceeds of $75.9 million related to the settlement of certain note hedges associated with the 2022 Exchangeable Notes, and $20.5 million of proceeds from the issuance of common stock pursuant to stock-based awards.\nLiquidity and Capital Resources\nThe Company’s principal sources of liquidity are its cash and cash equivalents as well as cash flows generated from operations. At December 31, 2024, $499.4 million was available under the Credit Facility.\nThe Company has various obligations related to long-term debt instruments and operating leases. For additional information on long-term debt, including maturity dates and interest rates, see “Note 7—Long-term Debt, net” to the consolidated financial statements included in “Item 8—Consolidated Financial Statements and Supplementary Data.” For additional information on the operating leases, including a schedule of obligations by year, see “Note 13—Leases” to the consolidated financial statements included in “Item 8—Consolidated Financial Statements and Supplementary Data.” The Company believes it has sufficient cash flows from operations to satisfy these future obligations.\nOn January 21, 2025, the Company repaid the Term Loan in full utilizing cash on hand.\nThe Company anticipates that it will need to make capital and other expenditures in connection with the development and expansion of its operations. The Company expects that 2025 cash capital expenditures will be between $45 million and $50 million, flat to 2024 cash capital expenditures.\nWe have entered into various purchase commitments, primarily consisting of web hosting services that are currently committed through January 2028. Our obligations under these various purchase commitments, which were impacted by usage rates in 2024, are $68.6 million for 2025, $8.7 million for 2026, $9.8 million for 2027, and $9.0 million for 2028.\nThe Company does not have any off-balance sheet arrangements at December 31, 2024, other than those described above.\nIn January 2024, the Board of Directors of the Company approved a share repurchase program of up to $1.0 billion in aggregate value of shares of Match Group stock (the “January Share Repurchase Program”). On December 10, 2024, the Board of Directors authorized a new repurchase program of up to $1.5 billion in aggregate value of shares of Match Group common stock (the “December Share Repurchase Program”). The December Share Repurchase Program will take effect when the January Share Repurchase Program, of which $247 million in aggregate value of shares of Match Group common stock remains available as of December 31, 2024, is exhausted. Under both the January and December Share Repurchase Programs, shares of our common stock may be purchased on a discretionary basis from time to time, subject to general business and market conditions and other investment opportunities, through open market purchases, privately negotiated transactions or other means, including through Rule 10b5-1 trading plans. Both the January and December Share Repurchase Programs may be commenced, suspended or discontinued at any time. During the year ended\nDecember 31, 2024, we repurchased 22.2 million shares for $752.7 million under the January Share Repurchase Program.\nBeginning mid-January 2025, the Company settles substantially all equity awards on a net basis. Assuming all equity awards outstanding on January 31, 2025 were net settled at the closing price on that date, we would issue 8.5 million shares of common stock (of which 0.6 million are related to vested awards and 7.9 million are related to unvested awards) and, assuming a 50% withholding rate, would remit $302.5 million in cash for withholding taxes (of which $20.7 million is related to vested awards and $281.8 million is related to unvested awards). If we did not settle awards on a net basis and instead issued a sufficient number of shares to cover the $302.5 million employee withholding tax obligation, 8.5 million additional shares would be issued by the Company.\nAt December 31, 2024, most of the Company’s international cash can be repatriated without significant tax consequences.\nOur indebtedness could limit our ability to: (i) obtain additional financing to fund working capital needs, acquisitions, capital expenditures, debt service, or other requirements; and (ii) use operating cash flow to pursue acquisitions or invest in other areas, such as developing properties and exploiting business opportunities. The Company may need to raise additional capital through future debt or equity financing to make additional acquisitions and investments or to provide for greater financial flexibility. Additional financing may not be available on terms favorable to the Company or at all.\nCRITICAL ACCOUNTING POLICIES AND ESTIMATES\nThe following disclosure is provided to supplement the descriptions of Match Group’s accounting policies contained in “Note 2—Summary of Significant Accounting Policies” to the consolidated financial statements included in “Item 8—Consolidated Financial Statements and Supplementary Data” in regard to significant areas of judgment. Management of the Company is required to make certain estimates, judgments and assumptions during the preparation of its consolidated financial statements in accordance with GAAP. These estimates, judgments and assumptions impact the reported amount of assets, liabilities, revenue and expenses and the related disclosure of contingent assets and liabilities. Actual results could differ from these estimates. Because of the size of the financial statement elements to which they relate, some of our accounting policies and estimates have a more significant impact on our consolidated financial statements than others. What follows is a discussion of some of our more significant accounting policies and estimates.\nBusiness Combinations\nAcquisitions have historically been an important part of our growth strategy. The purchase price of each acquisition is attributed to the assets acquired and liabilities assumed based on their fair values at the date of acquisition, including identifiable intangible assets that either arise from a contractual or legal right or are separable from goodwill. The fair value of these intangible assets is based on valuations that use information and assumptions provided by management. The excess purchase price over the net tangible and identifiable intangible assets is recorded as goodwill and is assigned to the reporting unit that is expected to benefit from the combination as of the acquisition date.\nRecoverability of Goodwill and Indefinite-Lived Intangible Assets\nGoodwill is the Company’s largest asset with a carrying value of $2.3 billion at each of December 31, 2024 and 2023, representing 52% of the Company’s total assets on both dates. Indefinite-lived intangible assets, which consist of certain of the Company’s acquired trade names and trademarks, have a carrying value of $96.9 million and $183.1 million at December 31, 2024 and 2023, respectively.\nThe Company assesses goodwill on its four reporting units and indefinite-lived intangible assets for impairment annually as of October 1, or more frequently if an event occurs or circumstances indicate that it is more likely than not the fair value of a reporting unit or the fair value of an indefinite-lived intangible asset is below its carrying value.\nWhen the Company elects to perform a qualitative assessment and concludes it is not more likely than not that the fair value of the reporting unit is less than its carrying value, no further assessment of that reporting unit’s goodwill is necessary; otherwise, a quantitative assessment is performed to further assess if any goodwill impairment exists.\nIf the Company concludes that it is more likely than not that there may be an impairment, the fair value of each reporting unit will be determined and compared to its carrying value, including goodwill. If the fair value of a reporting unit exceeds its carrying value, goodwill of the reporting unit is not impaired. If the carrying value of a reporting unit exceeds its estimated fair value, an impairment loss equal to the excess is recorded.\nAs a result of the change to our operating segments in the third quarter of 2024, we reassessed our reporting units and determined that the four operating segments are also our reporting units for the purpose of evaluating goodwill for impairment. The Company re-allocated goodwill to each of the four reporting units based on their relative fair values as of September 30, 20",
  "item2_clean": null
}