{
  "source_file": "mtch-20250930.htm",
  "form_type": "10-Q",
  "item1_clean": null,
  "item7_clean": null,
  "item2_clean": "Management’s Discussion and Analysis of Financial Condition and Results of Operations\nUpdated Financial Metrics\nWe have updated the title of our primary non-GAAP measure to “Adjusted EBITDA” from our previous title “Adjusted Operating Income.” We believe this updated title better aligns with our peers. Numerically, Adjusted EBITDA is the same as Adjusted Operating Income; however the starting point of the reconciliation to the most comparable GAAP financial measure has changed from operating income to net income. See “Non-GAAP Financial Measures” below for the full definition of Adjusted EBITDA and a reconciliation of net income attributable to Match Group, Inc. shareholders to Adjusted EBITDA.\nOperating and financial metrics:\nconsists of the world-wide activity of the brand Tinder\nconsists of the world-wide activity of the brand Hinge\nEvergreen & Emerging (“E&E”)\nconsists of the world-wide activity of our Evergreen brands, which include Match®, Meetic®, OkCupid®, Plenty Of Fish®, and a number of demographically focused brands, and our Emerging brands, which include BLK®, Chispa™, The League®, Archer®, Upward®, Yuzu™, Salams\n, HER™, and other smaller brands.\nMatch Group Asia (“MG Asia”)\nconsists of the world-wide activity of the brands primarily focused on Asia and the Middle East, including Pairs™ and Azar®, which has expanded into Europe and the U.S.\nCorporate and unallocated costs\nincludes 1) corporate expenses (such as executive management, investor relations, corporate development, board of directors and public company listing fees), 2) portions of corporate services (such as legal, human resources, accounting, and tax), and 3) certain centrally managed services and technology that have not been allocated to the individual business segments (such as central trust and safety operations and certain shared software).\nis revenue that is received directly from end users of our services and includes both subscription and à la carte revenue.\nis revenue that is not received directly from an end user of our services, a majority of which is advertising revenue.\nare unique users at a brand level in a given month from whom we earned Direct Revenue. When presented as a quarter-to-date or year-to-date value, Payers represents the average of the monthly values for the respective period presented. At a consolidated level and a business unit level to the extent a business unit consists of multiple brands, duplicate Payers may exist when we earn revenue from the same individual at multiple brands in a given month, as we are unable to identify unique individuals across brands in the Match Group portfolio.\nRevenue Per Payer (“RPP”)\nis the average monthly revenue earned from a Payer and is Direct Revenue for a period divided by the Payers in the period, further divided by the number of months in the period.\nOperating costs and expenses:\nconsists primarily of the amortization of in-app purchase fees, Variable Expenses (defined below), and employee compensation expense and stock-based compensation expense for personnel engaged in data center and customer care functions.\nSelling and marketing expense\nconsists primarily of cost of acquisition expense and employee compensation expense and stock-based compensation expense for personnel engaged in selling and marketing, sales support, and public relations functions.\nGeneral and administrative expense\nconsists primarily of employee compensation expense and stock-based compensation expense for personnel engaged in executive management, finance, accounting, legal, tax, and human resources, fees for professional services (including transaction-related costs for acquisitions), and facilities costs.\nProduct development expense\nconsists primarily of employee compensation expense and stock-based compensation expense that are not capitalized for personnel engaged in the design, development, testing, and enhancement of service offerings and related technology.\nIn-app purchase fees\nconsists of the amortization of in-app purchase fees, which are monies paid to Apple and Google in connection with the processing of in-app purchases of subscriptions and service features through the in-app payment systems provided by Apple and Google.\nconsists primarily of hosting fees, credit card processing fees, and rent, energy, and bandwidth costs associated with data centers.\nconsists primarily of advertising expenditures, including online marketing (fees paid to search engines and social media sites), offline marketing, including television and print advertising, and production of advertising content.\nEmployee compensation expense\nconsists primarily of compensation expense (excluding stock-based compensation expense) and other employee-related costs that are not capitalized.\nStock-based compensation expense\nconsists principally of expense, that is not otherwise capitalized, associated with awards of restricted stock units (“RSUs”), performance-based RSUs, and market-based awards. These expenses are not paid in cash.\n- The revolving credit facility under the credit agreement of MG Holdings II. As of September 30, 2025 and December 31, 2024, there was $0.6 million outstanding in letters of credit and $499.4 million of availability under the Credit Facility.\n- The former term loan facility under the credit agreement of MG Holdings II. At December 31, 2024, the Term Loan bore interest at a term secured overnight financing rate plus an applicable adjustment (“Adjusted Term SOFR”), plus 1.75%, and the then applicable rate was 6.22%. On January 21, 2025, we repaid the $425 million Term Loan in full utilizing cash on hand.\n- MG Holdings II’s 5.00% Senior Notes due December 15, 2027, with interest payable each June 15 and December 15, which were issued on December 4, 2017. As of September 30, 2025, $450 million aggregate principal amount was outstanding.\n- MG Holdings II’s 4.625% Senior Notes due June 1, 2028, with interest payable each June 1 and December 1, which were issued on May 19, 2020. As of September 30, 2025, $500 million aggregate principal amount was outstanding.\n- MG Holdings II’s 5.625% Senior Notes due February 15, 2029, with interest payable each February 15 and August 15, which were issued on February 15, 2019. As of September 30, 2025, $350 million aggregate principal amount was outstanding.\n- MG Holdings II’s 4.125% Senior Notes due August 1, 2030, with interest payable each February 1 and August 1, which were issued on February 11, 2020. As of September 30, 2025, $500 million aggregate principal amount was outstanding.\n- MG Holdings II’s 3.625% Senior Notes due October 1, 2031, with interest payable each April 1 and October 1, which were issued on October 4, 2021. As of September 30, 2025, $500 million aggregate principal amount was outstanding.\n- MG Holdings II’s 6.125% Senior Notes due September 15, 2033, with interest payable each March 15 and September 15, commencing on March 15, 2026, which were issued on August 20, 2025. As of September 30, 2025, $700 million aggregate principal amount was outstanding.\n2026 Exchangeable Notes\n- The 0.875% Exchangeable Senior Notes due June 15, 2026 issued by Match Group FinanceCo 2, Inc., a subsidiary of the Company, which are exchangeable into shares of the Company's common stock. Interest is payable each June 15 and December 15. On September 8, 2025, we repurchased $76.4 million of 2026 Exchangeable Notes. As of September 30, 2025, $499 million aggregate principal amount was outstanding and is presented as a current liability.\n2030 Exchangeable Notes\n- The 2.00% Exchangeable Senior Notes due January 15, 2030 issued by Match Group FinanceCo 3, Inc., a subsidiary of the Company, which are exchangeable into shares of the Company's common stock. Interest is payable each January 15 and July 15. As of September 30, 2025, $575 million aggregate principal amount was outstanding.\nNon-GAAP financial measure:\nAdjusted Earnings Before Interest, Taxes, Depreciation and Amortization (“Adjusted EBITDA”)\n- is a Non-GAAP financial measure. See “Non-GAAP Financial Measures” below for the definition of Adjusted EBITDA and a reconciliation of net income attributable to Match Group, Inc. to Adjusted EBITDA.\nMatch Group, Inc., through its portfolio companies, is a leading provider of digital technologies designed to help people make meaningful connections. Our global portfolio of brands includes Tinder\n, Pairs™, Plenty Of Fish\n, BLK®, and more, each built to increase our users’ likelihood of connecting with others. Through our trusted brands, we provide tailored services to meet the varying preferences of our users. Our services are available in over 40 languages to our users all over the world.\nWe manage our portfolio of brands in four business units: Tinder, Hinge, Evergreen and Emerging, and Match Group Asia.\nAs used herein, “Match Group,” the “Company,” “we,” “our,” “us,” and similar terms refer to Match Group, Inc. and its subsidiaries, unless the context indicates otherwise.\nAdditional Information\nInvestors and others should note that we announce material financial and operational information to our investors using our investor relations website at\n, our newsroom website at\nhttps://mtch.com/news\n, Tinder’s newsroom website at\nwww.tinderpressroom.com\n, Hinge’s newsroom website at\nhttps://hinge.co/press\nResults of Operations for the three and nine months ended September 30, 2025 compared to the three and nine months ended September 30, 2024\nThree Months Ended September 30,\nNine Months Ended September 30,\n(In thousands, except RPP)\nEvergreen & Emerging\nTotal Direct Revenue\nEvergreen & Emerging\n(Change calculated using non-rounded numbers)\nRPP:\nEvergreen & Emerging\nFor the three months ended September 30, 2025 compared to the three months ended September 30, 2024\nTinder Direct Revenue declined $12.6 million, or 3%, in 2025 versus 2024. The decrease in Direct Revenue was driven by a 7% decrease in Payers, partially offset by a 5% increase in RPP, which was positively impacted"
}