{
  "source_file": "mtd-20250930.htm",
  "form_type": "10-Q",
  "item1_clean": null,
  "item7_clean": null,
  "item2_clean": "On May 30, 2024, we entered into a $1.35 billion Credit Agreement (the Credit Agreement), which amended our $1.25 billion Amended and Restated Credit Agreement (the Prior Credit Agreement), that is further described in Note 8 of our consolidated financial statements.\nAs of September 30, 2025, we had $472.4 million of additional borrowings available under our Credit Agreement, and we maintained $69.1 million of cash and cash equivalents.\nChanges in exchange rates between the currencies in which we generate cash flows and the currencies in which our borrowings are denominated affect our liquidity. In addition, because we borrow in a variety of currencies, our debt balances fluctuate due to changes in exchange rates. Further, we do not have any downgrade triggers relating to ratings from rating agencies that would accelerate the maturity dates of our debt. We were in compliance with our debt covenants as of September 30, 2025.\nIn January 2025, we entered into an agreement to issue and sell EUR 100 million 10 1/2-year Senior Notes with a fixed interest rate of 3.8% (3.8% Euro Senior Notes) in a private placement, which will mature in July 2035. The 3.8% Euro Senior Notes are unsecured obligations of the Company and the terms are consistent with the previous Notes as disclosed in Note 10 to our consolidated financial statements for the year ended December 31, 2024. We used the proceeds from the sale of the Notes to refinance existing indebtedness and for other general corporate purposes.\nOther Local Arrangements\nIn April 2018, two of our non-U.S. pension plans issued loans totaling $39.6 million (Swiss franc 38 million) to a wholly owned subsidiary of the Company. The loans have the same terms and conditions which include an interest rate of SARON plus 87.5 basis points. The loans were renewed for one year in April 2025.\nShare Repurchase Program\nIn November 2025, the Company's Board of Directors authorized an additional $2.75 billion to be added to our share repurchase program, which had $1.1 billion of remaining availability as of September 30, 2025. The share repurchases are expected to be funded from cash generated from operating activities, borrowings, and cash balances. Repurchases will be made through open market transactions, and the amount and timing of purchases will depend on business and market conditions, the stock price, trading restrictions, the level of acquisition activity, and other factors.\nWe have purchased 32.9 million shares at an average price per share of $317.56 since the inception of the program in 2004 through September 30, 2025. During the nine months ended September 30, 2025 and 2024, we spent $656.2 million and $637.5 million on the repurchase of 542,416 and 482,413 shares at an average price per share of $1,209.84 and $1,321.46, respectively. We also reissued 21,400 shares and 58,909 shares held in treasury upon the exercise of stock options and vesting of restricted stock units during the nine months ended September 30, 2025 and 2024, respectively. In addition, we incurred $2.2 million and $1.8 million of excise tax during the three months ended September 30, 2025 and 2024, respectively, and $6.3 million and $5.8 million of excise tax during the nine months ended September 30, 2025 and 2024, respectively related to the Inflation Reduction Act which is reflected as a reduction in shareholders' equity in our consolidated financial statements.\nEffect of Currency on Results of Operations\nOur earnings are affected by changes in exchange rates. We are most sensitive to changes in the exchange rates between the Swiss franc, euro, Chinese renminbi, and U.S. dollar. We have more Swiss franc expenses than we do Swiss franc sales because we develop and manufacture products in Switzerland that we sell globally, and have a number of corporate functions located in Switzerland. When the Swiss franc strengthens against our other trading currencies, particularly the U.S. dollar and euro, our earnings decrease. We also have significantly more sales in the euro than we do expenses. When the euro weakens against the U.S. dollar and Swiss franc, our earnings also decrease. We estimate a 1% strengthening of the Swiss franc against the euro would reduce our earnings before tax by approximately $2.6 million to $2.9 million annually.\nWe also conduct business in many geographies throughout the world, including Asia Pacific, the United Kingdom, Eastern Europe, Latin America, and Canada. Fluctuations in these currency exchange rates against the U.S. dollar can also affect our operating results. The most significant of these currency exposures is the Chinese renminbi. The impact on our earnings before tax of the Chinese renminbi weakening 1% against the U.S. dollar is a reduction of approximately $2.1 million to $2.4 million annually.\nIn addition to the effects of exchange rate movements on operating profits, our debt levels can fluctuate due to changes in exchange rates, particularly between the U.S. dollar, the Swiss franc and the euro. Based on our outstanding debt at September 30, 2025, we estimate that a 5% weakening of the U.S. dollar against the currencies in which our debt is denominated would result in an increase of approximately $53.1 million in the reported U.S. dollar value of our debt.\nForward-Looking Statements Disclaimer\nYou should not rely on forward-looking statements to predict our actual results. Our actual results or performance may be materially different than reflected in forward-looking\nstatements because of various risks\nand uncertainties. You can identify forward-looking statements by terminology such as “may,” “will,” “could,” “would,” “should,” “expect,” “plan,” “anticipate,” “intend,” “believe,” “estimate,” “predict,” “potential,” or “continue.”\nWe make forward-looking statements in this Quarterly Report about future events or our future financial performance, including sales and earnings growth, earnings per share, strategic plans and contingency plans, growth opportunities or economic downturns, our ability to respond to changes in market conditions, planned research and development efforts and product introductions, adequacy of facilities, access to and the costs of raw materials, shipping and supplier costs, gross margins, customer demand, our competitive position, pricing, capital expenditures, cash flow, share repurchases, tax-related matters, the impact of foreign currencies, compliance with laws, effects of acquisitions, the impact of inflation, ongoing developments related to global trade disputes/tariffs, governmental policies, the geopolitical environment, the conflict in Ukraine and continuing instability in the Middle East on our business.\n\nResearch and development\nSelling, general and administrative\nRestructuring charges\nOther charges (income), net\nEarnings before taxes\nRecent developments in global trade disputes/tariffs\nIn 2025, the U.S. government enacted incremental tariff rates at various levels ranging from 10% to 145% on U.S. imports from certain foreign countries. In response to the U.S. tariffs, the Chinese government implemented an additional tariff of 125% on imports from the U.S. that has been reduced to 10%. We estimate we will incur costs before mitigation actions from the incremental 2025 tariff rates of approximately $50 million in 2025. We are implementing various actions to fully offset the effect of the current incremental tariffs in 2026. Incremental tariff rates during 2025 are currently 39% on imports from Switzerland, 25% on non-USMCA imports from Mexico, 30% on imports from China, 15% on imports from the European Union and 10% on imports from the United Kingdom. The U.S. government has indicated it may make further changes to tariff rates in the future, especially related to China, that may adversely impact our financial results in future periods.\nThe recent escalation in global trade disputes/tariffs has increased economic uncertainty in\nNet sales were $1.0 billion and $954.5 million for the three months ended September 30, 2025, and 2024, respectively, and $2.9 billion and $2.8 billion for nine month periods ended September 30, 2025 and 2024, respectively. Sales in U.S. dollars increased 8% for the three month period and 2% for the nine month period ended September 30, 2025. Excluding the effect of currency exchange rate fluctuations, or in local currencies, net sales increased 6% for the three month period and 2% for the nine month period ended September 30, 2025. Net sales in local currencies increased 5% for the three month period ended September 30, 2025 excluding acquisitions. We estimate that net sales growth for the nine months ended September 30, 2025 was reduced approximately 2% from the recovery of previously disclosed shipping delays during the three months ended March 31, 2024 related to a new external European logistics service provider.\nExcluding this impact, sales increased 4% in local currency for the nine months ended September 30, 2025 compared to the corresponding period in 2024.\nNet sales by geographic destination for the three months ended September 30, 2025 in U.S. dollars increased 10% in the Americas, 13% in Europe, and 1% Asia/Rest of World. In local currencies, our net sales by geographic destination increased 10% in the Americas, 6% in Europe, and 1%\nAsia/Rest of World. Net sales in the Americas benefited approximately 1% from acquisitions for the three months ended September 30, 2025. Our net sales by geographic destination for the nine months ended September 30, 2025 in U.S. dollars increased 4% in the Americas, 3% in Europe, and 1% in Asia/Rest of World. Net sales by geographic destination for the nine months ended September 30, 2025 in local currencies increased 4% in the Americas and 1%\n\nAsia/Rest of World, and were flat in Europe. Net sales in Asia/Rest of World in local currency includes an increase of 2% and flat sales in China during the three and nine months ended September 30, 2025. Excluding the impact of "
}