{
  "source_file": "mtd-20241231.htm",
  "form_type": "10-K",
  "item1_clean": "We are a leading global supplier of precision instruments and services. We have strong leadership positions in all of our businesses and believe we hold global number-one market positions in most of them. We are recognized as an innovation leader and our solutions are critical in key research and development, quality control, and manufacturing processes for customers in a wide range of industries including life sciences, food, and chemicals. Our sales and service network is one of the most extensive in the industry. Our products are sold in more than 140 countries and we have a direct presence in approximately 40 countries. With proven growth strategies and a focus on execution, we have achieved a long-term track record of strong financial performance.\nOur business is geographically diversified, with net sales in 2024 derived 42% from North and South America, 28% from Europe, and 30% from Asia and other countries. Our customer base is also diversified by industry and by individual end-customer.\nMettler-Toledo International Inc. was incorporated as a Delaware corporation in 1991 and became a publicly traded company with its initial public offering in 1997.\nWe have five reportable segments: U.S. Operations, Swiss Operations, Western European Operations, Chinese Operations, and Other Operations. See Note 18 to the consolidated financial statements and Item 7. Management’s Discussion and Analysis of Financial Condition and Results of Operations under “Results of Operations by Reportable Segment” for detailed results by segment and geographic region.\nWe manufacture a wide variety of precision instruments and provide value-added services to our customers. Our principal products and services are described below. We also describe our customers and distribution, sales and service, research and development, manufacturing, and certain other matters. These descriptions apply to substantially all of our products and related reportable segments.\nLaboratory Instruments\nWe make a wide variety of precision laboratory instruments for sample preparation, synthesis, analytical bench top, material characterization, and in-line measurement. Our portfolio includes laboratory balances, liquid pipetting solutions, automated laboratory reactors including real-time analytics, titrators, pH meters, process analytics sensors and analyzer technology, physical value analyzers including density and refractometry instruments, thermal analysis systems, and other analytical instruments such as UV/VIS spectrophotometers, moisture analyzers, and cell counters. Our laboratory instruments have leading-edge embedded software and we also offer LabX, our laboratory software platform to manage and analyze data generated by our instruments. The laboratory instruments and related service business accounted for approximately 56% of our net sales in 2024, 55% in 2023, and 57% in 2022.\nOur laboratory balances have weighing ranges from one ten-millionth of a gram up to 64 kilograms. To respond to a wide range of customer needs and value/price points, we market our balances in a range of product tiers offering different levels of functionality. We also provide filter weighing and automated powder and liquid dosing systems. Based on the same weighing technology platform, we manufacture mass comparators, which are used by weights and measures officials as well as National Measurement Institute laboratories to ensure the accuracy of reference weights. Laboratory balances are primarily used\nin the pharmaceutical, biotechnology, testing lab, food, chemical, cosmetics, academia, and other industries.\nPipettes are used in life science research laboratories for dispensing small volumes of liquids. We develop, manufacture, and distribute advanced pipettes, including single- and multi-channel manual and electronic pipettes. We also develop and produce high-value consumables such as pipette tips. We maintain service centers in key markets where customers periodically send their pipettes for certified recalibrations. These service centers, combined with our advanced asset management solutions, provide our customers with innovative solutions to maintain their instruments and meet regulatory compliance. Our principal end-markets are pharmaceutical, biotech, and academia.\nAnalytical Instruments\nTitrators measure the chemical composition of samples and are used in environmental and research laboratories as well as in quality control labs in the pharmaceutical, testing lab, food and beverage, and other industries. Our high-end titrators are multi-tasking models, which can perform two determinations simultaneously on multiple vessels. Our offering includes robotics to automate routine work in quality control applications.\nThermal analysis systems measure material properties as a function of temperature, such as weight, dimension, energy flow, and viscoelastic properties. Thermal analysis systems are used in nearly every industry, but primarily in plastics and polymer industries and academia and increasingly in the pharmaceutical and advanced materials industries.\npH meters measure acidity in laboratory samples. We also manufacture and sell density and refractometry instruments, which measure chemical concentrations in solutions. In addition, we manufacture and sell moisture analyzers, which precisely determine the moisture content of a sample by utilizing the loss on drying method, and UV/VIS spectrophotometers that optimize spectroscopic workflows. We also manufacture and sell microplate readers to measure chemical and biological assays and automated cell counting and viability assessment instruments.\nLabX, our laboratory software platform, manages and analyzes data generated by our balances, titrators, pH meters, physical value analyzers, and other analytical instruments like UV/VIS spectrophotometers. LabX provides full network capability; assists with workflow automation; has efficient, intuitive protocols; and enables customers to collect and archive data in compliance with the U.S. Food and Drug Administration’s traceability and data integrity requirements for electronically stored data (also known as 21 CFR Part 11).\nAutomated Chemistry Solutions\nOur automated chemistry solutions focus on select applications in the chemical and drug discovery process. Our automated lab reactors and in situ analysis systems are considered integral to the process development and scale-up activities of our customers. Our on-line measurement technologies, based on infrared and laser light scattering, enable customers to monitor chemical reactions and crystallization processes in real time in the lab and plant. In situ samples allow overnight sampling and testing. Additionally, we provide industry-leading software solutions that enable our customers to manage, optimize, and improve experiments as well as production scale-up. We believe that our portfolio of integrated technologies can bring significant efficiencies to the development process, enabling our customers to bring new drugs and chemicals to market faster.\nOur process analytics business provides instruments for the in-line measurement of liquid and gas parameters used primarily in the production process of pharmaceutical, biotech, beverage, micro-electronics, chemical, and refining companies, as well as power plants. More than half of our process analytics sales are to the pharmaceutical and biotech markets, where our customers need fast and secure scale-up and production that meet the validation processes required for GMP (Good Manufacturing Processes) and other regulatory standards like the USP (U.S. Pharmacopeia) regulations for ultrapure water quality.\nWe are a leading solution provider for liquid analytical measurement to control and optimize production processes. Our solutions include sensor and analyzer technology for measuring pH, dissolved oxygen, carbon dioxide, conductivity, turbidity, ozone, total organic carbons, pressure, bioburden, sodium, and silica, as well as laser analyzers for gas measurement. Intelligent sensor diagnostics capabilities enable improved asset management solutions for our customers to reduce process downtime and maintenance costs. Our instruments offer leading multi-parameter capabilities and plant-wide control system integration, which are key for integrated measurement of multiple parameters to secure production quality and efficiency. With a worldwide network of specialists, we support customers in critical process applications, compliance, and systems integration questions.\nIndustrial Instruments\nWe manufacture numerous industrial weighing instruments and related terminals and offer dedicated software solutions for the pharmaceutical, chemical, food, discrete manufacturing, and other industries. In addition, we manufacture metal detection, x-ray, checkweighing, and other end-of-line product inspection systems used in production and packaging. We supply automatic identification and data capture solutions, which integrate in-motion weighing, dimensioning, and identification technologies for transport, shipping, and logistics customers. We also offer heavy industrial scales and related software. The industrial instruments and related service business accounted for approximately 39% of our net sales in 2024 and 2023 and 38% in 2022.\nIndustrial Weighing Instruments\nWe offer a comprehensive line of industrial scales and weighing devices, such as bench scales, floor scales, and weigh modules, for weighing loads from a few grams to several thousand kilograms in applications ranging from measuring materials in production to quality completeness control in manufacturing to weighing packages at the end of the line. Our products are used in a wide range of industrial applications, such as filling, formulating and mixing ingredients, counting, and quality control.\nIndustrial Terminals\nOur industrial scale terminals collect data and integrate it into manufacturing processes, helping to control and automate them. Our terminals allow users to remotely download formulation recipes or access setup data and can minimize downtime through predictive rather than reactive maintenance.\nTransportation and Logistics\nWe supply automatic dimensional measurement and data capture solutions, which integrate in-motion weighing, dimensioning, and identification technologies. With these solutions, customers can measure the weight and cubic volume of packages for appropriate billing, load management, and quality control. Our solutions also integrate into customers’ information systems.\nVehicle Scale Systems\nOur primary heavy industrial products are scales for weighing trucks or railcars (i.e., weighing bulk goods as they enter or leave a factory or at a toll station). Heavy industrial scales are capable of measuring weights up to 500 tons and permit accurate weighing under extreme environmental conditions. We also offer advanced computer software that can be used with our heavy industrial scales to facilitate a broad range of customer solutions and provides a complete system for managing vehicle transaction processing.\nWe offer software that can be used with our industrial instruments. Examples include FreeWeigh.Net, statistical quality control software; FormWeigh.Net, formulation/batching software; and DataBridge, which supports the operation of vehicle scales. FreeWeigh.Net and FormWeigh.Net provide full network capability and enable customers to collect and archive data in compliance with U.S. Food and Drug Administration requirements, 21 CFR Part 11.\nIncreasing safety and consumer protection requirements are driving the need for more sophisticated end-of-line product inspection systems (e.g., for use in food processing and packaging, pharmaceutical, packaged consumer goods, and other industries). We are a leading global provider of metal detectors, x-ray systems, checkweighers, and camera-based imaging equipment that are used in these industries. Metal detectors are most commonly used",
  "item7_clean": "We also continue to benefit from market trends in automation and digitalization and also expect to benefit from customer on/near-shoring activities in the future. Our core industrial-related products are also especially sensitive to changes in economic growth. China and emerging market economies have historically been an important source of growth based upon the expansion of their domestic economies, and we expect this to also be a source of long-term growth. Product inspection experienced solid growth in 2024, and we expect our product inspection end-market to continue to benefit from our customers’ focus on brand protection, food safety, and productivity.\nOur food retailing sales decreased significantly during 2024 primarily due to strong project activity in 2023, especially in the Americas. Traditionally, the spending levels in this sector have experienced more volatility than our other end-markets due to the timing of customer project activity and new regulations.\nIn 2025, we will continue to pursue the overall business growth strategies which we have followed in recent years:\nGaining Market Share.\nInnovation is essential to gaining market share and is fundamental in all aspects of our business including sales and marketing and technology leadership\nOur global sales and marketing initiative, Spinnaker, continues to be an important growth strategy. We aim to gain market share by implementing sophisticated sales and marketing programs, leveraging our extensive customer databases, product offering, and installed base. While this initiative is broad-based, efforts to improve these processes include the use of advanced data analytics to identify, prioritize, and pursue growth opportunities; the implementation of more effective pricing related to value-based selling strategies and processes; improved sales force guidance, training, and effectiveness; cross-selling; increased segment marketing; and leads generation and nurturing activities. We also have added resources to pursue under-penetrated market opportunities and continue to adapt our Go-to-Market approaches with additional inside and telesales resources, while also increasing digital customer interaction. We continue to benefit from digitalization tools to gain efficiencies and increase the effectiveness of our field sales force.\nIn addition, our comprehensive service offerings, and our initiatives to globalize and harmonize these offerings, help us further penetrate developed markets. We estimate that we have the largest installed base of weighing instruments in the world, and we continue to leverage advanced data analytics and invest in sales and marketing activities to increase the proportion of our installed base that is under service contract, or sell new products that replace old products in our installed base. In addition to traditional repair and maintenance, our service offerings continue to expand into value-added services for a range of market needs, including regulatory compliance. We have also improved our service model to incorporate remote service, depot drop-off/pickup, and other approaches.\nFaster-Growing Markets.\nEmerging markets, comprising Asia (excluding Japan), Eastern Europe, Latin America, the Middle East, and Africa, account for approximately 34% of our total net sales of which 16% relates to China. We have a two-pronged strategy in emerging markets: first, to capitalize on long-term growth opportunities in these markets, and second, to leverage our low-cost manufacturing operations in China. We have more than a 35-year track record in China, and our sales in Asia have grown more than 10% on a compound annual growth basis in local currencies since 1999. Over the years, we also have broadened our product offering to the Asian markets. India has also been a source of emerging market sales growth in past years due to increased life science research activities. Overall, versus the prior year, we experienced a 1% decrease in emerging market local currency sales by destination during 2024, which included an 11% local currency sales decline in China and a 10% local currency sales increase in other emerging markets. Following particularly strong growth in 2022 and 2021, market conditions in\nChina declined significantly during the second half of 2023, and challenging market conditions persisted in 2024. Going forward, we continue to redeploy resources and sales and marketing efforts to pharma, food manufacturing, chemical, and new energy. We believe the long-term growth of these segments will be favorably impacted by the Chinese government’s emphasis on science, high-value industries, product quality, and food safety. We expect our laboratory and product inspection businesses will particularly benefit from our focus on these segments. We also continue to pursue growth in under-penetrated emerging markets. However, emerging market sales can be volatile as we experienced in China over the past several years. China has historically been volatile, and market conditions may change unfavorably due to various factors. In addition to China and emerging markets, we also pursue other faster-growth vertical markets. While rather small, these markets present outsized growth potential. Segments include semiconductors, advanced materials, and new energy. The components of these faster-growing segments will change as various markets develop, and we will continue to leverage the breadth and scope of our product offering as new opportunities emerge.\nExtending Our Technology Lead.\nWe continue to focus on product innovation. In the last three years, we spent approximately 5% of net sales on research and development, reflecting a total of $551 million. We seek to improve our product offerings and their capabilities with additional integrated technologies and software, which we believe supports our pricing differentiation and accelerates product replacement cycles. In addition, we aim to create value for our customers by having thorough knowledge of their processes via our significant installed product base.\nExpanding Our Margins.\nWe continue to strive to improve our margins by enhancing our value proposition via innovation, more effectively pricing our products and services, optimizing our cost structure, and improving our mix in higher-margin businesses such as service. For example, sophisticated data analytic tools provide us new insights to further refine our price strategies and processes. We have also implemented productivity and cost savings initiatives over the past two years to mitigate our reduced volume, while also focusing on reallocating resources to better align our cost structure to support our investments in market penetration initiatives, higher-growth/profitable areas, and opportunities for margin improvement.\nWe also have implemented global procurement and supply chain management programs over the last several years aimed at lowering costs and have increased our focus on these programs with our SternDrive initiative. SternDrive is our global operational excellence program for continuous improvement efforts within our supply chain, manufacturing, and back-office operations. Blue Ocean is also an important enabler of our various margin expansion initiatives. Our move to standardized business processes, systems, and data structures throughout our global organization provides greater data transparency and faster access to real-time data. Our cost leadership and productivity initiatives are also focused on continuously improving our invested capital efficiency, such as reducing our working capital levels, improving our order to cash cycle, and ensuring appropriate returns on our expenditures.\nPursuing Strategic Acquisitions.\nWe seek to pursue \"bolt-on\" acquisitions that may leverage our global sales and service network, respected brand, extensive distribution channels, and technological leadership. We have identified life sciences and process analytics as key areas for acquisitions. For example, in 2021, we acquired all the membership interests of Mayfair Technology, LLC (PendoTECH), a manufacturer and distributor of single-use sensors, transmitters, control systems, and software for measuring, monitoring, and data collection primarily in bioprocess applications. PendoTECH serves biopharmaceutical manufacturers and life science laboratories and is located in the United States. In 2021, we also acquired Scale-up Systems Inc., a leading software provider for scale-up and reaction modeling serving the biopharma and chemical markets.\nResults of Operations — Consolidated\nNet sales were $3.9 billion for the year ended December 31, 2024, compared to $3.8 billion in 2023 and $3.9 billion in 2022. This represents an increase of 2% in 2024 and a decrease of 3% in 2023 in U.S. dollars and an increase of 3% in 2024 and a decrease of 3% in 2023 in local currencies. Net sales in 2023 were negatively impacted by approximately $58 million from our previously disclosed shipping delays related to a new external European logistics service provider, which were largely recovered in the first quarter of 2024. We estimate local currency net sales were flat in 2024 and decreased approximately 1% in 2023 excluding the impact of the delayed shipments. In 2024, we experienced soft market demand, particularly in China. We continue to benefit from the execution of our global sales and marketing programs, our innovative product portfolio, and investments in our field organization, particularly surrounding digital tools and techniques. However, there continues to be uncertainty in our end-markets, the economic environment and geopolitics, and market conditions may change quickly.\nIn 2024, our net sales by geographic destination increased in U.S. dollars compared to 2023 by 8% in Europe, 2% in the Americas, and decreased by 3% in Asia/Rest of World. In local currencies, our net sales by geographic destination increased in 2024 by 8% in Europe, 3% in the Americas, and decreased by 1% in Asia/Rest of World, with an 11% decline in China. A discussion of sales by operating segment is included below.\nAs described in Note 3 to our consolidated financial statements, our net sales comprise product sales of precision instruments and related services. Service revenues are primarily derived from repair and other services, including regulatory compliance qualification, calibration, certification, preventative maintenance, and spare parts.\nNet sales of products increased 1% in both U.S. dollars and local currencies during 2024 and decreased 7% in U.S. dollars and 6% in local currencies in 2023. Service revenue (including spare parts) increased 7% in both U.S. dollars and local currencies in 2024 and increased 10% in both U.S. dollars and local currencies in 2023.\nNet sales of our laboratory products and services, which represented approximately 56% of our total net sales in 2024, increased 6% in both U.S. dollars and local currencies during 2024. Laboratory net sales in 2024 benefited approximately 4% and were reduced by 2% in 2023 from the previously disclosed shipping delays. The local currency increase in net sales of our laboratory-related products during 2024 includes an increase in most product categories, especially analytical instruments. Laboratory results were also negatively impacted by a decline in China.\nNet sales of our industrial products and services, which represented approximately 39% of our total net sales in 2024, were flat in U.S. dollars and increased 1% in local currencies during 2024. Industrial net sales in 2024 benefited approximately 1% and were reduced by 1% in 2023 from the previously disclosed shipping delays. The local currency increase in net sales of our industrial-related products during 2024 includes solid growth in product inspection, offset in part by a decline in core-industrial products, especially in China.\nNet sales of our food retailing products and services, which represented approximately 5% of our total net sales in 2024, decreased 14% in both U.S. dollars and local currencies during 2024. Retail net sales in 2024 benefited approximately 3% and were reduced by 2% in 2023 from previously disclosed shipping delays. The local currency decrease in net sales of our food retailing products during 2024 related to particularly strong project activity in 2023, especially in the Americas.\nGross profit as a percentage of net sales was 60.1% for 2024, 59.2% for 2023, and 58.9% for 2022.\nGross profit as a percentage of net sales for products was 62.1% for 2024, compared to 60.6% for both 2023 and 2022. Gross profit as a percentage of net sales for services (including spare parts) was 53.7% for 2024, compared to 54.3% for 2023 and 52.0% for 2022.\nThe gross profit as a percentage of net sales for 2024 primarily reflects favorable price realization that benefits from our innovative product portfolio, benefits from our productivity, and cost savings initiatives and business mix, offset in part by investments in our service organization.\nResearch and development and selling, general, and administrative expenses\nResearch and development expenses as a percentage of net sales were 4.9% for 2024, compared to 4.9% for 2023, and 4.5% for 2022. Research and development expenses in U.S. dollars increased 2% in 2024 and 5% in 2023, and in local currencies increased 2% in 2024 and 3% in 2023.\nSelling, general, and administrative expenses as a percentage of net sales were 24.2% for 2024, compared to 23.9% for both 2023 and 2022. Selling, general, and administrative expenses increased 4% in both U.S. dollars and local currencies in 2024 and decreased 4% in both U.S. dollars and local currencies in 2023. The increase during 2024 primarily includes higher variable compensation, offset in part by benefits from our cost savings initiatives.\nAmortization expense\nAmortization expense was $72.9 million in 2024, compared to $72.2 million and $66.2 million in 2023 and 2022, respectively. The increase in amortization expense during 2024 relates to our investments in information technology, primarily from our Blue Ocean program.\nRestructuring charges\nDuring the past few years, we initiated various cost reduction measures. Restructuring charges were $19.8 million in 2024, compared to $32.7 million and $9.6 million in 2023 and 2022, respectively. Restructuring expenses are primarily comprised of employee-related costs.\nOther charges (income), net\nOther charges (income), net consisted of net income of $4.6 million, $4.1 million, and $9.3 million in 2024, 2023, and 2022, respectively. Other charges (income), net includes non-service pension costs (benefits), net (gains) losses from foreign currency transactions and hedging activities, interest income, and other items. Non-service pension benefits were $7.7 million, $7.6 million, and $16.9 million in 2024, 2023, and 2022, respectively. Other charges (income), net also includes acquisition costs, for which there were $0.3 million in 2024 and $0.9 million in 2022.\nInterest expense and taxes\nInterest expense was $74.6 million in 2024, compared to $77.4 million in 2023 and $55.4 million in\n\n2022. The decrease in interest expense is primarily related to lower debt levels throughout the year.\nOur reported tax rate was 16.8% in 2024, compared to 19.0% and 18.5% in 2023 and 2022, respectively. The reported tax rate in 2024 includes a non-cash discrete tax benefit of $23 million resulting from the reduction of uncertain tax position liabilities related to the settlement of a tax audit.\nResults of Operations — by Operating Segment\nThe following is a discussion of the financial results of our operating segments. We currently have five reportable segments: U.S. Operations, Swiss Operations, Western European Operations, Chinese Operations, and Other Operations. A more detailed description of these segments is outlined in Note 18 to our consolidated financial statements.\nU.S. Operations (amounts in thousands)\nNet sales to external custo",
  "item2_clean": null
}