{
  "source_file": "mu-20250828.htm",
  "form_type": "10-K",
  "item1_clean": "2025 10-K\nWe have commenced expansion of our production capacity in the United States and in other regions where we operate. Semiconductor fabs are complex, capital-intensive projects and require specialized knowledge, expertise, experience, and skill sets to construct and operate. Our construction projects are highly dependent on available sources of materials and specialized equipment, as well as labor, skilled sub-contractors, and other service providers. Increasing demand, supply constraints, inflation, and other market conditions could result in shortages and higher costs. Additionally, difficulties in obtaining labor, skilled sub-contractors, and other service providers or other resources could result in delays in completion of our construction projects and cost increases, including costs to operate these facilities. In the United States and in certain other regions, fab building has been uncommon in recent years. Concurrent semiconductor expansion projects across the industry introduce significant competition for the limited pool of construction talent with requisite expertise and experience in these regions. As such, expanding production capacity in the United States and certain other regions may introduce more challenges than we would experience in geographies with more established ecosystems.\nSupply Chain, Materials, and Third-Party Service Providers\nOur supply chain and operations are dependent on the availability of materials that meet exacting standards and the use of third parties to provide us with components and services. We generally have multiple sources of supply for our materials and services. However, only a limited number of suppliers are capable of delivering certain materials, components, and services that meet our standards and, in some cases, materials, components, or services are provided by a single or sole source, and we may be unable to qualify new suppliers on a timely basis. The availability of materials or components, such as chemicals, silicon wafers, gases, photoresists, semiconductors, substrates, lead frames, printed circuit boards, targets, and reticle glass blanks is impacted by various factors. These factors could include a shortage of raw materials or a disruption in the processing or purification of those raw materials into finished goods. Shortages or increases in lead times have occurred in the past, are currently occurring with respect to some materials and components, and may occur from time to time in the future because of the nature of the industry. Constraints within our supply chain for certain materials and integrated circuit components could limit our bit shipments, which could have a material adverse effect on our business, results of operations, or financial condition.\nOur manufacturing processes are also dependent on our relationships with third-party manufacturers of controllers, analog integrated circuits, and other components used in some of our products and with outsourced semiconductor foundries, assembly and test providers, contract manufacturers, logistics carriers, and other service providers, including providers of maintenance for our advanced semiconductor manufacturing equipment and providers of electricity and other utilities. Although we have certain long-term contracts with some of our suppliers, many of these contracts do not provide for long-term capacity or pricing commitments. To the extent we do not have firm commitments from our third-party suppliers over a specific time period or for any specific capacity, quantity, and/or pricing, our suppliers may allocate capacity to their other customers and capacity and/or materials may not be available when needed or at reasonable prices. Inflationary pressures may continue to increase costs for materials, supplies, and services. Regardless of contract structure, large swings in demand may exceed our contracted supply and/or our suppliers’ capacity to meet those demand changes, resulting in a shortage of parts, materials, or capacity needed to manufacture our products. In periods of shortage, we may be required to incur increased costs in order to meet our contractual commitments and demand from our customers or experience a decrease in revenue. In addition, if any of our suppliers were to cease operations or become insolvent, this could impact their ability to provide us with necessary supplies, and we may not be able to obtain the needed supply in a timely manner or at all from other providers.\n\nITEM 1. BUSINESS\nWe are an industry leader in innovative memory and storage solutions transforming how the world uses information to enrich life\n. With a relentless focus on our customers, technology leadership, and manufacturing and operational excellence, Micron delivers a rich portfolio of high-performance DRAM, NAND, and NOR memory and storage products through our Micron® and Crucial® brands. Every day, the innovations that our people create fuel the data economy, enabling advances in artificial intelligence (AI) and compute-intensive applications that unleash opportunities — from the data center to the intelligent edge and across the client and mobile user experience.\nWe manufacture our products at wholly-owned facilities and also utilize subcontractors for certain manufacturing processes. Our global network of manufacturing centers of excellence not only allows us to benefit from scale while streamlining processes and operations, but it also brings together some of the world’s brightest talent to work on the most advanced memory technology. Centers of excellence bring expertise together in one location, providing an efficient support structure for end-to-end manufacturing, with quicker cycle times, in partnership with teams, such as R&D, product development, human resources, procurement, and supply chain. For our locations in Singapore and Taiwan, this is also a combination of bringing fabrication and back-end manufacturing together. We continue to make significant investments to develop proprietary product and process technology, which generally increases bit density per wafer and reduces per-bit manufacturing costs of each generation of product. We continue to introduce new generations of products that offer improved performance characteristics, including higher data transfer rates, advanced packaging solutions, lower power consumption, improved read/write reliability, and increased memory density.\nWe face intense competition in the semiconductor memory and storage markets. To remain competitive, we must continuously develop and implement new products and technologies and decrease manufacturing costs in spite of inflationary pressures, changing technologies, rapid market changes, and regulatory uncertainty. Our success is largely dependent on obtaining returns on our R&D investments, efficient utilization of our manufacturing infrastructure, development and integration of advanced product and process technologies, market acceptance of our diversified portfolio of semiconductor-based memory and storage solutions, and efficient capital spending.\nIn the fourth quarter of 2025, we reorganized our business units. All prior-period segment amounts have been retrospectively adjusted to reflect this reorganization. We have the following four business units, which are our reportable segments:\nCloud Memory Business Unit (“CMBU”):\nFocused on memory solutions for large hyperscale cloud customers, and HBM for all data center customers.\nCore Data Center Business Unit (“CDBU”):\nFocused on memory solutions for mid-tier cloud, enterprise, and OEM data center customers and storage solutions for all data center customers.\nMobile and Client Business Unit (“MCBU”):\nFocused on memory and storage solutions for the mobile and client segments.\nAutomotive and Embedded Business Unit (“AEBU”):\nFocused on memory and storage solutions for the automotive, industrial, and consumer segments.\n\nSolid State Drives (“SSDs”)\nSSD storage products incorporate NAND, a controller, and firmware to offer significant performance and features over hard disk drives, including smaller form factors, faster read and write speeds, higher reliability, and lower power consumption needed to address the growing demands of data-centric workloads, ever-increasing expectations of client users, and the stringent requirements of automotive and industrial applications.\nManaged NAND combines NAND flash with a sophisticated controller and firmware in a single package. This integration allows the memory to manage itself, handling tasks like wear leveling, bad block management, and error correction internally, freeing the host system from these tasks. Products such as embedded MultiMediaCards (“e.MMC”) and universal flash storage (“UFS”) offer solutions that are compact and reliable, making them widely used across the mobile, automotive, and industrial markets.\nMulti-Chip Packages (“MCPs”)\nDesigned to provide high-performance, compact, and efficient memory solutions by integrating multiple types of memory, generally LPDDR and NAND, into a single package. MCPs are used in embedded internet of things (“IoT”) applications, automotive systems, mobile devices, and industrial devices where space and power efficiency are critical.\nTotal reported NAND revenue was $8.50 billion in 2025, $7.23 billion in 2024, and $4.21 billion in 2023.\nNOR:\nNOR products are non-volatile, re-writable semiconductor memory devices that provide fast read speeds. NOR is most commonly used for reliable code storage (e.g., boot, application, operating system, and execute-in-place code in an embedded system) and for frequently changing small data storage and is ideal for automotive, industrial, and consumer applications.\nProducts by Business Unit and Market\nCloud Memory Business Unit (“CMBU”)\nCMBU is focused on memory solutions for large hyperscale cloud customers, and HBM for all data center customers. In addition to HBM, CMBU sales include DDR, LPDDR, and GDDR.\nCMBU sales to the data center end market are driven by server demand across the cloud market and includes our portfolio of HBM, high-capacity dual in-line memory modules (“DIMMs”), and low-power server DRAM solutions.\nOverall cloud growth continues to be driven by the shift of both infrastructure and workloads from on-premises to the cloud. Cloud-native workloads are driving growth through use cases such as AI-enabled intelligent edge devices and augmented reality platforms that store and access data in the cloud or rely on the cloud for compute capability. Cloud servers supporting AI and data-centric workloads require significantly increasing quantities of DRAM, including HBM, and NAND as the task of turning data into insight becomes increasingly memory-centric.\nIn 2024, we began volume production of our 8-high 24GB HBM3E with increased bandwidth and superior power efficiency enabled by our advanced 1β process node. In the fourth quarter of 2025, HBM3E 12-high represented the majority of our HBM shipments. This enhanced version of HBM delivers faster data rates, improved thermal response, and a higher monolithic die density within the same package footprint as previous generations. In 2025, we delivered samples of HBM4 36GB 12-high to multiple key customers to power next-generation AI platforms.\nAs modern servers pack more processing cores into central processing units (“CPUs”), the memory bandwidth per CPU core has been decreasing. Our DDR5 alleviates this bottleneck by providing higher bandwidth than previous generations, enabling improved performance and scaling. In 2024, we qualified and began shipping our 128GB DDR5 server module, built on a monolithic 32GB DRAM die and powered by our 1ß node. This innovative product provides an industry alternative to existing 3D TSV-based solutions to address the rigorous speed and capacity demands of memory-intensive generative AI applications. In 2025, we began volume production of LPDDR5 in a small outline compression attached memory module (“SOCAMM”",
  "item7_clean": "ITEM 7. MANAGEMENT’S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS\nThis discussion should be read in conjunction with the consolidated financial statements and accompanying notes for the year ended August 28, 2025. All period references are to our fiscal periods unless otherwise indicated. Our fiscal year is the 52\nor 53-week period ending on the Thursday closest to August 31. Fiscal 2025, 2024, and 2023 each contained 52 weeks. All tabular dollar amounts are in millions, except per share amounts.\nFor an overview of our business, see Part I, Item 1. Business, Overview.\nAI-driven demand is accelerating and is outpacing industry supply. In 2025, we benefited from substantial improvements in DRAM pricing, volumes and margins as compared to 2024, reflecting strong demand growth, driven in part by the continued advancement of AI. During 2025, we shifted a portion of our DRAM supply to the data center and hyperscale cloud markets to meet the strong demand fueled by AI, with emphasis on HBM products, resulting in a revenue mix weighted more prominently toward segments experiencing higher growth. The pivot to higher-growth segments, together with our strong execution, robust overall industry DRAM demand, and constrained supply, has led to improved profitability across our DRAM portfolio. In 2025, NAND revenue increased from 2024 on higher bit shipments due to demand growth. The 2025 NAND gross margin percentage increased from 2024 due to cost reductions. We continue to prudently manage our NAND business to ensure we align our supply growth and technology node cadence with our projections of the demand environment.\nThroughout 2024, we experienced substantial improvements in pricing and margins due to improving market conditions as compared to 2023. Increasing demand growth, driven in part by deployment of AI and mostly normal customer inventories, combined with industry-wide supply discipline, resulted in an industry supply and demand balance that substantially improved from downturn conditions in memory and storage markets during 2023. In connection with improved market conditions in 2024, we reinstated our bonuses and phased out certain other temporary cost-saving measures that were implemented in 2023.\nIn 2023, China’s Cyberspace Administration (the “CAC”) conducted a cybersecurity review of our products sold in China and decided that our products presented a cybersecurity risk. The CAC determined that critical information infrastructure operators in China may not purchase Micron products. The CAC decision has impacted our business, particularly in the domestic data center and networking markets in China, and we have been working to mitigate that impact.\n\n2025 10-K\nResults of Operations\nConsolidated Results\nResearch and development\nSelling, general, and administrative\nRestructure and asset impairments\nOther operating (income) expense, net\nOperating income (loss)\nInterest income (expense), net\nOther non-operating income (expense), net\nIncome tax (provision) benefit\nEquity in net income (loss) of equity method investees\nTotal revenue was impacted by the factors described in the section titled “Industry Conditions” above. These conditions drove substantial improvements in average selling prices throughout 2025 and 2024.\nTotal revenue for 2025 increased 49% as compared to 2024 primarily due to increases in sales of both DRAM and NAND products.\nSales of DRAM products increased 62% primarily due to a low-40% range increase in average selling prices and a mid-teen percentage increase in bit shipments.\nSales of NAND products increased 18% primarily due to a high-teen percentage increase in bit shipments.\nTotal revenue for 2024 increased 62% as compared to 2023 primarily due to increases in sales of both DRAM and NAND products.\nSales of DRAM products increased 60% primarily due to a mid-40% range increase in bit shipments and a low-teen percentage range increase in average selling prices.\nSales of NAND products increased 72% primarily due to a low-30% range increase in bit shipments and a low-30% percentage range increase in average selling prices.\nConsolidated Gross Margin:\nOur consolidated gross margin has been impacted by the factors described in the section titled “Industry Conditions” above and the effects of 2023 inventory write-downs on our 2024 and 2023 gross margin, as detailed in the table below. Our consolidated gross margin percentage improved to 40% for 2025 from 22% for 2024 as a result of improvements in margins for both DRAM and NAND products. DRAM margins improved primarily due to increases in average selling prices, an increased mix of higher-margin products, including HBM, and manufacturing cost reductions driven by improvements in product and process technology. NAND margins improved primarily due to manufacturing cost reductions. Our consolidated gross margin for 2024 reflected $987 million of benefit due to lower costs from the sale of inventories written down to their net realizable value in 2023 (as detailed in “Inventory NRV Write-Downs” below).\nOur consolidated gross margin percentage improved to 22% for 2024 from negative 9% for 2023 as a result of improvements in margins for both DRAM and NAND products, primarily due to increases in average selling prices, manufacturing cost reductions, the effects of charges to write down inventories to their NRV in 2023, and lower costs in 2024 from the sale of inventories written down in 2023 (as detailed in “Inventory NRV Write-Downs” below).\n\nPercentages reflect operating income (loss) as a percentage of revenue for each business unit.\nChanges in operating income or loss for each business unit for 2025 as compared to 2024 were as follows:\nCMBU operating income increased primarily due to higher bit shipments and increases in average selling prices driven by robust AI demand in cloud server markets, particularly for HBM, DIMMs, and low-power server DRAM products. CMBU operating income benefited from a shift of our DRAM supply to meet the strong demand in high-value data center markets. These improvements were partially offset by higher R&D expenses.\nCDBU operating income increased primarily due to increases in data center average selling prices, higher bit shipments, and manufacturing cost reductions.\nMCBU operating income (loss) improved primarily due to increases in DRAM average selling prices, manufacturing cost reductions, and higher NAND bit shipments, partially offset by decreases in NAND average selling prices. MCBU operating income (loss) was also adversely impacted by decreases in DRAM bit shipments as MCBU product supply was constrained to meet demand from higher-value segments.\nAEBU operating income increased primarily due to manufacturing cost reductions and higher bit shipments, partially offset by declines in average selling prices.\nChanges in operating income or loss for each business unit for 2024 as compared to 2023 were as follows:\nCMBU operating income (loss) improved primarily due to higher bit shipments, increases in average selling prices, and manufacturing cost reductions.\nCDBU operating income (loss) improved primarily due to higher NAND and DRAM bit shipments, increases in average selling prices, and manufacturing cost reductions, partially offset by higher R&D expenses.\nMCBU operating income (loss) improved primarily due to increases in average selling prices, higher bit shipments, and manufacturing cost reductions.\nAEBU operating income decreased primarily due to declines in average selling prices, partially offset by manufacturing cost reductions and higher bit shipments.\nOperating Expenses and Other\nResearch and Development:\nR&D expenses vary primarily with the number of development and pre-qualification wafers processed and end-product solutions developed, personnel costs, and the cost of advanced equipment dedicated to new product and process development. Because of the lead times necessary to manufacture our products, we typically begin to process wafers before completion of performance and reliability testing. Development of a product is deemed complete when it is qualified through internal reviews and tests for performance, functionality, and reliability. R&D expenses can vary significantly depending on the timing of product qualification and product specifications.\nR&D expenses for 2025 increased 11% as compared to 2024 primarily due to increases in employee compensation, depreciation expense, and higher volumes of development and pre-qualification wafers. R&D expenses for 2024 increased 10% as compared to 2023 primarily due to an increase in employee compensation and higher volumes of development and pre-qualification wafers, partially offset by an increase in government incentives.\nSelling, General, and Administrative:\nSG&A expenses for 2025 increased 7% as compared to 2024 primarily due to an increase in employee compensation and professional services. SG&A expenses for 2024 increased 23% as compared to 2023 primarily due to an increase in employee compensation.\n\nIn addition to the CHIPS Act direct funding, we receive a 35% investment tax credit on qualified investments in U.S. semiconductor manufacturing under the CHIPS Act. We have also signed a non-binding term sheet with the State of New York that provides for up to $5.5 billion in funding for the planned four-fab facility over the next 20-plus years through a combination of tax credits for qualified capital investments and incentives for eligible new job wages.\nOutside the U.S., we are investing in manufacturing technologies, facilities and equipment, and R&D, and advancing our global back-end assembly and test network. These investments support our product portfolio and extend our ability to meet global market demand in the future. Planned investments and those underway include the following:\nour construction is progressing for the assembly and test facility in Gujarat to address demand in the latter half of this decade;\nwe are modernizing our Hiroshima manufacturing facility to support the production of DRAM using EUV lithography;\nwe broke ground on an HBM advanced packaging facility to meaningfully expand our total advanced packaging capacity beginning in calendar 2027; and\nwe are modernizing our production capacity for DRAM and HBM products to meet rising market demand.\nSee Item 8. Financial Statements and Supplementary Data, Notes to Consolidated Financial Statements, Note 20. Government Incentives.\nOur Board of Directors has authorized the discretionary repurchase of up to $10 billion of our outstanding common stock through open-market purchases, block trades, privately-negotiated transactions, derivative transactions, and/or pursuant to Rule 10b5-1 trading plans. The repurchase authorization has no expiration date, does not obligate us to acquire any common stock, and is subject to market conditions, restrictions applicable under our CHIPS Act direct funding agreements, and our ongoing determination of the best use of available cash. Through August 28, 2025, we had repurchased an aggregate of $7.19 billion under the authorization. See Item 8. Financial Statements and Supplementary Data, Notes to Consolidated Financial Statements, Note 15. Equity, as well as Note 20. Government Incentives.\nOn September 23, 2025, our Board of Directors declared a quarterly dividend of $0.115 per share, payable in cash on October 21, 2025, to shareholders of record as of the close of business on October 3, 2025. The declaration and payment of any future cash dividends are at the discretion and subject to the approval of our Board of Directors. Our Board of Directors’ decisions regarding the amount and payment of dividends will depend on many factors, including, but not limited to, our financial condition, results of operations, capital requirements, business conditions, debt service obligations, contractual restrictions, industry practice, legal requirements, regulatory constraints, and other factors that our Board of Directors may deem relevant.\nWe expect that our cash and investments, cash flows from operations, funding from government incentives, and available financing will be sufficient to meet our requirements at least through the next 12 months and thereafter for the foreseeable future.\nNet cash provided by operating activities\nNet cash used for investing activities\nNet cash provided by (used for) financing activities\nEffect of changes in currency exchange rates on cash, cash equivalents, and restricted cash\nNet increase (decrease) in cash, cash equivalents, and restricted cash\nOperating Activities:\nCash provided by operating activities reflects net income (loss) adjusted for certain non-cash items, including depreciation expense, amortization of intangible assets, stock-based compensation, inventory write-downs, and asset impairments, and the effects of changes in operating assets and liabilities\n\nInvesting Activities:\nFor 2025, net cash used for investing activities consisted primarily of $15.86 billion of expenditures for property, plant, and equipment and $192 million of net outflows from purchases, maturities, and sales of available-for-sale securities, partially offset by $2.01 billion of proceeds from government incentives to offset capital expenditures.\nFor 2024, net cash used for investing activi\nties consisted primarily of $8.39 billion of expenditures for property, plant, and equipment, and $205 million of net outflows from purchases, maturities, and sales of available-for-sale securities, partially offse\nt by $315 million of proceeds from government incentives to offset capital expenditures.\nFor 2023, net cash used for investing activities consisted primarily of $7.68 billion of expenditures for property, plant, and equipment, partially offset by $710 million of proceeds from government incentives to offset capital expenditures, and $868 million of net inflows from maturities, sales, and purchases of available-for-sale securities.\nFinancing Activities:\nFor 2025, net cash used for financing activities consisted primarily of $4.62 billion of repayments of debt, which included the prepayment of the 2026 Notes, 2026 Term Loan A, 2027 Notes, 2027 Term Loan A, and a portion of the 2029 Term Loan A borrowings; and $522 million for payments of dividends to shareholders; partially offset by approximately $4.43 billion of proceeds from the issuance of the 2029 Term Loan A, 2032 Notes, 2035 A Notes, and 2035 B Notes. See Item 8. Financial Statements and Supplementary Data, Notes to Consolidated Financial Statements, Note 12. Debt.\nFor 2024, net cash used for financing activi\nties consisted primarily of $1.90 billion of repayments of debt, which included the prepayment of the 2024 Term Loan A and the 2025 Term Loan A borrowings, $513 million for paym\nents of dividends to shareholders,\nfor the acquisition of 3.2 million shares of our common stock under our share repurchase authorization, an\npayments on equipment purchase contracts, partially offset by approximately $1.00 billion of proceeds from the issuance of the 2031 Notes.\nFor 2023, net cash provided by financing activities consisted primarily of $3.20 billion of proceeds from our 2025, 2026, and 2027 Term Loan A borrowings, $1.27 billion from the issuance of the 2029 B Notes, $896 million from the issuance of the 2033 B Notes, $749 million from the issuance of the 2033 A Notes, and $599 million from the issuance of the 2028 Notes. Cash used for financing activities included $761 million for repayments of debt, $504 million for payments of dividends to shareholders, $425 million for the acquisition of 8.6 million shares of our common stock under our share repurchase authorization, and $138 million of payments on equipment purchase contracts.\nCritical Accounting Estimates\nThe preparation of financial statements and related disclosures in conformity with U.S. GAAP requires management to make estimates and judgments that affect the reported amounts of assets, liabilities, revenue",
  "item2_clean": null
}