{
  "source_file": "mu-20250529.htm",
  "form_type": "10-Q",
  "item1_clean": null,
  "item7_clean": null,
  "item2_clean": "Liquidity and Capital Resources\nOur primary sources of liquidity are cash generated from operations and financing obtained from capital markets and financial institutions. Cash generated from operations is highly dependent on selling prices for our products, which can vary significantly from period to period. Cash and marketable investments totaled $12.21 billion as of May 29, 2025, and $9.15 billion as of August 29, 2024. Our cash and investments consist primarily of bank deposits, money market funds, and liquid investment-grade, fixed-income securities, which are diversified among industries and individual issuers. To mitigate credit risk, we invest through high-credit-quality financial institutions and by policy generally limit the concentration of credit exposure by restricting the amount of investments with any single obligor. As of May 29, 2025, $4.80 billion of our cash and marketable investments was held by our foreign subsidiaries.\nWe continuously evaluate alternatives for efficiently funding our capital expenditures and ongoing operations. We expect to engage in a variety of financing transactions, from time to time, for such purposes as well as to refinance our existing indebtedness, including the issuance of securities. As of May 29, 2025, $3.50 billion was available to draw under our Revolving Credit Facility. Funding of certain significant capital projects is also dependent on the receipt of government incentives, which are subject to various conditions and may not be obtained.\nTo develop new product and process technology, support future growth, achieve operating efficiencies, and maintain product quality, we must continue to invest in manufacturing technologies, facilities and equipment, and R&D. We estimate capital expenditures in 2025 for property, plant, and equipment, net of proceeds from government incentives, to be approximately $14 billion. Actual amounts for 2025 will vary depending on market conditions and may vary from quarter to quarter due to the timing of expenditures and proceeds from government incentives. As of May 29, 2025, we had purchase obligations of approximately $1.69 billion for the acquisition of property, plant, and equipment, substantially all of which is expected to be paid within one year. For a description of other contractual obligations, such as leases and debt, see “Item 1. Financial Statements – Notes to Consolidated Financial Statements – Leases,” and “ – Debt.”\nTo support projected memory demand in the second half of the decade, we will need to add new DRAM wafer capacity. Following the enactment of the CHIPS Act, we announced plans to invest in leading-edge memory manufacturing sites in Idaho and New York, based on CHIPS Act support through grants and investment tax credits.\nAs part of this plan, in September 2022, we broke ground on a leading-edge memory manufacturing fab in Boise, Idaho. Construction of the fab began in October 2023, with first DRAM wafer output projected in the second half of calendar 2027. In June 2025, in connection with certain amendments to our CHIPS Act agreements, we announced plans for a second leading-edge memory manufacturing fab in Idaho to serve growing market demand fueled by AI.\nOur announced plan for New York includes construction of a leading-edge DRAM memory manufacturing site, consisting of up to four fabs to be built over the next 20-plus years, in Clay, New York. We expect site preparation to begin in calendar 2025, with production anticipated to ramp after the completion of the second Idaho fab. We expect these new fabs to be key to meeting our requirements for additional wafer capacity, in line with industry demand trends and our objective of maintaining stable bit share.\nOn December 9, 2024, we entered into direct funding agreements with the U.S. Department of Commerce for up to $6.1 billion in direct funding pursuant to the CHIPS Act for a planned fab in Boise, Idaho and two planned fabs in Clay, New York. On June 11, 2025, we entered into amendments to the direct funding agreements to add a second planned fab in Boise, Idaho and allocate certain award funding to the second planned Idaho fab from the $6.1 billion grants previously awarded. The direct funding for up to $6.1 billion remains unchanged. We elected not to pursue the federal loans previously disclosed as included in the non-binding preliminary memorandum of terms for the Boise, Idaho and Clay, New York fabs. On June 11, 2025, we also entered into a direct funding agreement with the U.S. Department of Commerce for up to $275 million in direct funding to expand and modernize our fab in Manassas, Virginia. The grants under the funding agreements represent total CHIPS Act grants of up to $6.4 billion in connection with our U.S. manufacturing expansion and modernization projects. In addition, we announced plans to bring advanced HBM packaging capabilities to the U.S. See “Item 1. Financial Statements – Notes to Consolidated Financial Statements – CHIPS Act Funding Agreements.”\nIn addition to the CHIPS Act direct funding, we receive a 25% investment tax credit on qualified investments in U.S. semiconductor manufacturing under the CHIPS Act. We have also signed a non-binding term sheet with the State of\n\n2025 Q3 10-Q\nNOR\nNOR products are non-volatile, re-writable semiconductor memory devices that provide fast read speeds. NOR is most commonly used for reliable code storage (e.g., boot, application, operating system, and execute-in-place code in an embedded system) and for frequently changing small data storage and is ideal for automotive, industrial, and consumer applications.\nIn the third quarter of 2025, DRAM revenue improved from the prior quarter due to improvements across end markets, in particular strong sequential growth in consumer-oriented and data center markets, especially for HBM products. During the first nine months of 2025 compared to the first nine months of 2024, we have shifted our supply to meet the strong demand in data center DRAM resulting in a portfolio mix weighted more towards high-growth segments. In 2024 and for the first nine months of 2025, we experienced substantial improvements in revenue, pricing, and margins as compared to 2023, reflecting demand growth, driven in part by deployment of AI, which resulted in a substantially improved industry supply and demand balance.\nIn the third quarter of 2025, NAND revenue improved from the prior quarter due to improvements across end markets, in particular strong bit growth in consumer-oriented markets due to reduced customer inventories. We saw reduced demand from NAND customers in the first two quarters of 2025 as customers reduced inventory to align with their end customers. We continue to prudently manage our NAND supply, including the levels of our capital investment, the pace of ramp of our new technology node, and fab utilization consistent with our demand growth.\n\nResults of Operations\nConsolidated Results\nResearch and development\nSelling, general, and administrative\nOther operating (income) expense, net\nOperating income (loss)\nInterest income (expense), net\nOther non-operating income (expense), net\nIncome tax (provision) benefit\nEquity in net income (loss) of equity method investees\nTotal revenue for the third quarter of 2025 and first nine months of 2025 was impacted by the factors described in the section titled “Industry Conditions” above.\nTotal revenue for the third quarter of 2025 increased 15% as compared to the second quarter of 2025 primarily due to increases in sales of both DRAM and NAND products.\nSales of DRAM products increased 15% primarily due to an over 20% increase in bit shipments, partially offset by a low-single-digit percent range decrease in average selling prices primarily due to a higher consumer-oriented revenue mix.\nSales of NAND products increased 16% primarily due to a mid-20% range increase in bit shipments, partially offset by a high-single-digit percent range decrease in average selling prices.\nTotal revenue for the third quarter of 2025 increased 37% as compared to the third quarter of 2024 primarily due to increases in sales of both DRAM and NAND products.\nSales of DRAM products increased 51% primarily due to a mid-20% range increase in average selling prices and an increase in bit shipments in the low-20% range.\nSales of NAND products increased 4% primarily due to a low-30% range increase in bit shipments, partially offset by a low-20% range decrease in average selling prices.\nTotal revenue for the first nine months of 2025 increased 50% as compared to the first nine months of 2024 due to increases in both DRAM and NAND sales.\nSales of DRAM products increased 60% primarily due to a high-40% range increase in average selling prices and a high-single-digit percent range increase in bit shipments.\nSales of NAND products increased 29% primarily due to a high-teen percentage range increase in bit shipments and a high-single-digit percent range increase in average selling prices.\n\nOur consolidated gross margin has been impacted by the factors described in the section titled “Industry Conditions” above. Our consolidated gross margin percentage increased to 38% for the third quarter of 2025 from 37% for the second quarter of 2025, primarily due to an improvement in margins for DRAM products, partially offset by a decrease in margins for NAND products. DRAM margins improved primarily due to an increased mix of HBM and manufacturing cost reductions driven by improvements in product and process technology. NAND margins declined primarily due to decreases in average selling prices. Our consolidated gross margin percentage improved to 38% for the third quarter of 2025 from 27% for the third quarter of 2024 and improved to 38% for the first nine months of 2025 from 17% for the first nine months of 2024. Improvements in our consolidated gross margins for the third quarter and first nine months of 2025 compared to corresponding periods of 2024 were primarily due to "
}