{
  "source_file": "nclh-20241231x10k.htm",
  "form_type": "10-K",
  "item1_clean": "Onboard and Other Revenue\nAll three brands generate onboard and other revenue for additional products and services which are not included in the cruise fare, including casino operations, certain food and beverage, shore excursions, gift shop purchases, spa services, communication services and other similar items. Food and beverage, casino operations and shore excursions are generally managed directly by us while retail shops, spa services, art auctions and communication services may be managed through contracts with third-party concessionaires. These contracts generally entitle us to a percentage of the gross sales derived from these concessions. Norwegian’s ticket prices typically include meals in certain dining facilities and many onboard activities such as entertainment, pool-side activities and various sports programs. To maximize onboard revenue, all three brands use various cross-marketing and promotional tools which are supported by point-of-sale systems permitting “cashless” transactions for the sale of these products and services. Oceania Cruises’ ticket prices include specialty dining, entertainment, Starlink Wi-Fi, laundry, gratuities and certain other amenities. Regent’s ticket prices typically include onboard amenities such as unlimited complimentary shore excursions, beverages including fine wines and liquors, entertainment, specialty dining, Starlink Wi-Fi, valet laundry, gratuities and more.\nOur operations are seasonal and results for interim periods are not necessarily indicative of the results for the entire fiscal year. Historically, demand for cruises has been strongest during the Northern Hemisphere’s summer months, which has resulted in fluctuations by quarter in our revenue and results of operations. The seasonality of our results is increased due to ships being taken out of service for regularly scheduled Dry-docks, which we typically schedule during non-peak demand periods.\nOur primary competition includes operators such as Carnival and Royal Caribbean as well as other cruise lines such as MSC Cruises, Viking Ocean Cruises and Virgin Voyages. In addition, we compete with land-based vacation alternatives, such as hotels and resorts, vacation ownership properties, casinos, and tourist destinations throughout the world.\nShip Operations and Cruise Infrastructure\nShip Maintenance and Logistics\nSophisticated and efficient maintenance and operations systems support the technical capabilities and modern look of our fleet. In addition to routine repairs and maintenance performed on an ongoing basis and in accordance with applicable requirements, each of our ships is generally taken out of service, approximately every 24 to 60 months, for a period of one or more weeks for scheduled maintenance work, repairs and improvements performed in Dry-dock. Dry-dock interval is a statutory requirement controlled under IMO requirements reflected in chapters of the International Convention of the Safety of Life at Seas (“SOLAS”) and to some extent the International Load Lines Convention. Under these regulations, it is required that a passenger ship Dry-dock once in five years (depending on age of vessel) or twice in five years (depending on flag state and age of vessel), and the maximum interval between each Dry-dock cannot exceed three years (depending on flag state and age of vessel). However, most of our international ships qualify under a special exemption provided by The Bahamas and/or Marshall Islands (flag state), as applicable, after meeting certain criteria set forth by the ship’s flag state to Dry-dock once every five years. To the extent practical, each ship’s crew, catering and hotel staff remain with the ship during the Dry-dock period and assist in performing repair and maintenance work. Accordingly, Dry-dock work is typically performed during non-peak demand periods to minimize the adverse effect on revenue that results from ships being out of service. Dry-docks are typically scheduled in spring or autumn and depend on shipyard availability. We typically take this opportunity to upgrade the vessels in all areas of both guest-facing services and innovative compliance technology.\nOur largest capital expenditures are for ship construction and acquisition. Our largest operating expenditures are for payroll and related (including our contract with a third party who provides certain crew services), fuel, airfare, food and\n\nNorwegian’s ships cater to a variety of travelers with up to 20 dining options; various attractions, including the world’s only racetracks at sea; a wide array of entertainment options; full-service spas at sea; and a diverse range of accommodations, including luxury suites in The Haven, studio staterooms designed and priced for the solo traveler and everything in between. Oceania Cruises’ award-winning onboard dining, with multiple open seating dining venues, is a central highlight of its cruise experience. Regent’s all-inclusive fare includes unlimited shore excursions in every port, a one-night pre-cruise hotel package in Concierge Suites and higher, specialty dining, unlimited premium beverages, including fine wines and spirits, pre-paid gratuities, unlimited Starlink Wi-Fi, valet laundry service and other amenities. Regent also offers an Ultimate All-Inclusive Air option, which includes the previously stated amenities plus flights with the flexibility to choose the desired air class, transfers between airport and ship and a private executive chauffer credit for private transfers.\nUpscale Guest Demographic\nOur target demographic consists primarily of high-net-worth travelers who appreciate upscale experiences. This customer base has proven to be resilient during economic downturns and demonstrates strong repeat booking patterns.\nDiversified Itinerary Mix\nWe have a wide variety of itineraries to over 700 ports around the world. Our brands offer diverse itineraries to worldwide destinations including Europe, Asia, Australia, New Zealand, South America, Africa, Canada, Bermuda, the Caribbean, Alaska and Hawaii.\nStrong Growth Profile\nWe believe our strategic fleet expansion program, including new ship orders and the modernization of existing vessels, positions us for sustained growth. We maintain a disciplined approach to capacity growth while focusing on yield optimization and cost control.\nOur business model has demonstrated resilience through various market cycles. We maintain strong relationships with travel partners, have sophisticated revenue management strategies, and focus on operational excellence to drive shareholder value.\nReduce leverage and optimize our balance sheet\nIn 2024 and 2025, we continued to take actions to improve our capital structure as part of our long-term financial strategy.\nIn September 2024, NCLC issued $315.0 million aggregate principal amount of 6.250% senior unsecured notes due 2030. The net proceeds, together with cash on hand, were used to redeem $315.0 million aggregate principal amount of the 3.625% senior unsecured notes due 2024, including to pay any accrued and unpaid interest thereon.\nIn January 2025, the full amount of outstanding borrowings under the Breakaway one loan, Breakaway two loan, Marina newbuild loan and Riviera newbuild loan, plus any accrued and unpaid interest thereon, was repaid.\nAlso in January 2025, NCLC issued $1.8 billion aggregate principal amount of 6.750% senior unsecured notes due 2032. The net proceeds, together with cash on hand, were used to redeem $600.0 million aggregate principal amount of 8.375% senior secured notes due 2028 and $1.2 billion aggregate principal amount of 5.875% senior unsecured notes due 2026, together with any accrued and unpaid interest thereon, and to pay any related transaction premiums, fees and expenses.\n\nIn 2024, the Company announced our Charting the Course strategy, setting People Excellence as the first strategic pillar furthering our commitment to fostering a culture based on our value anchors of Collaboration, Innovation, Transparency and Passion while supporting our team members to reach their full potential. We believe this commitment ultimately results in significant value to our Company and its shareholders.\nAs of December 31, 2024, we employed approximately 5,200 full-time employees worldwide in our shoreside operations and approximately 36,500 shipboard employees. Regent and Oceania Cruises’ ships use a third party to provide additional hotel and restaurant staffing onboard. We refer you to “Item 1A—Risk Factors— Our failure or inability to recruit or retain qualified personnel or the loss of key personnel or employee relations issues may materially adversely affect our business, financial condition and results of operations” for more information regarding our relationships with union employees and our collective bargaining agreements that are currently in place.\nCompensation and Benefits\nCritical to our success is identifying, recruiting and retaining top talent and incentivizing existing and future team members. We attract and retain talented team members by offering competitive compensation and benefits. Our pay-for-performance compensation philosophy for our shoreside team is based on rewarding each team member’s individual contributions. We use a combination of fixed and variable pay components including base salary, bonus, equity, commissions and merit increases. We maintain a long-term incentive plan for our manager-level team members and above that allows us to provide share-based compensation to enhance our pay-for-performance culture and to support our attraction, retention and motivational goals. We have established an $18 per hour minimum wage for our non-commission U.S.-based shoreside employees. We also issued an appreciation bonus of up to 10 days of pay to non-management employees not eligible under other bonus or incentive programs. The Company also consistently reviews salary levels in order to remain competitive in recruiting and retaining talent for shoreside and shipboard employees. We believe our compensation programs for our shipboard team are competitive and for the majority of this team, negotiated with various unions and documented in collective bargaining agreements.\nThe success of our Company is connected to the well-being of our team members, such that we offer a competitive benefits package including physical, financial and emotional well-being benefits. We offer our full-time U.S. shoreside team members a choice of Company-subsidized medical and dental programs to meet their needs and those of their families. In addition, we offer health savings and flexible spending accounts, vision cover, paid time off, employee assistance programs, short term disability and voluntary long-term disability insurance, term life and business travel insurance. We offer a 401(k) retirement savings plan and education assistance benefits. In 2024, following feedback from employees, we announced the increase of our 401(k) company match cap for 2025. Our benefits vary by location and are designed to meet or exceed local requirements and to be competitive in the marketplace. As we strive to be an employer of choice, the Company continues with a 4/1 flexible work model for shoreside team members globally. The flexible model allows most employees to work in-office Monday through Thursday and remotely on Friday.\nWe proudly offer Family Care Benefits to our eligible shoreside employees that includes paid leave at 100% of an employee’s salary for maternity, paternity, and adoption leaves. Family planning assistance for fertility/surrogacy services and adoption support are also offered. In 2024, As a result of productive focus groups and listening sessions that took place with workplace parents, enhancements to NCLH’s Family Care Benefits, particularly the maternity program, were reviewed and approved for implementation in 2024. A maternity return to work transition program was established to provide a smooth transition to the office f",
  "item7_clean": "positively impacts our net income, we believe changes in Adjusted Gross Margin, Net Yield, Net Cruise Cost and Adjusted Net Cruise Cost Excluding Fuel to be the most relevant indicators of our performance.\nWe believe that Adjusted EBITDA is appropriate as a supplemental financial measure as it is used by management to assess operating performance. We also believe that Adjusted EBITDA is a useful measure in determining our performance as it reflects certain operating drivers of our business, such as sales growth, operating costs, marketing, general and administrative expense and other operating income and expense. In addition, management uses Adjusted EBITDA as a performance measure for our incentive compensation. Adjusted EBITDA is not a defined term under GAAP nor is it intended to be a measure of liquidity or cash flows from operations or a measure comparable to net income, as it does not take into account certain requirements such as capital expenditures and related depreciation, principal and interest payments and tax payments and it includes other supplemental adjustments.\nIn addition, Adjusted Net Income and Adjusted EPS are non-GAAP financial measures that exclude certain amounts and are used to supplement GAAP net income and EPS. We use Adjusted Net Income and Adjusted EPS as key performance measures of our earnings performance. We believe that both management and investors benefit from referring to these non-GAAP financial measures in assessing our performance and when planning, forecasting and analyzing future periods. These non-GAAP financial measures also facilitate management’s internal comparison to our historical performance. In addition, management uses Adjusted EPS as a performance measure for our incentive compensation. The amounts excluded in the presentation of these non-GAAP financial measures may vary from period to period; accordingly, our presentation of Adjusted Net Income and Adjusted EPS may not be indicative of future adjustments or results. For example, for the year ended December 31, 2024, we had a benefit of $161.9 million related to the reversal of the majority of our U.S. deferred tax asset valuation allowance. We included this as an adjustment in the reconciliation of Adjusted Net Income since the benefit is not representative of our day-to-day operations, and this adjustment did not occur and is not included in the comparative period presented within this Annual Report.\nYou are encouraged to evaluate each adjustment used in calculating our non-GAAP financial measures and the reasons we consider our non-GAAP financial measures appropriate for supplemental analysis. In evaluating our non-GAAP financial measures, you should be aware that in the future we may incur expenses similar to the adjustments in our presentation. Our non-GAAP financial measures have limitations as analytical tools, and you should not consider these measures in isolation or as a substitute for analysis of our results as reported under GAAP. Our presentation of our non-GAAP financial measures should not be construed as an inference that our future results will be unaffected by unusual or non-recurring items. Our non-GAAP financial measures may not be comparable to other companies. Please see a historical reconciliation of these measures to the most comparable GAAP measure presented in our consolidated financial statements below in the “Results of Operations” section.\nFinancing Transactions and Newbuild Orders\nIn February 2024, NCLC and the Commitment Parties entered into the third amended commitment letter, which became effective in March 2024. Pursuant to the third amended commitment letter, the Commitment Parties have agreed to purchase from NCLC an aggregate principal amount of $650 million of senior unsecured notes due five years after the issue date at NCLC’s option, which option is available through March 2025 and we do not expect to extend. In connection with the execution of the third amended commitment letter, NCLC agreed to repurchase all of the outstanding $250 million aggregate principal amount of 9.75% senior secured notes due 2028 at a negotiated premium plus accrued and unpaid interest thereon. See Note 9 – “Long-Term Debt” for more information.\nIn April 2024, we obtained export credit financing for 80% of the contract price of two new Regent Seven Seas Cruises ship orders and two new Oceania Cruises ship orders as well as related premiums. Contemporaneously, the ship orders became effective. The Norwegian brand also placed a four-ship order, for which the shipbuilding contracts were finalized in February 2025 and financing is still being finalized. We refer you to “—Liquidity and Capital Resources— Future Capital Commitments” and “—Liquidity and Capital Resources— Material Cash Requirements” for details regarding our newbuild orders.\nAdditionally, in April 2024, a €200 million commitment became available that can be used for future newbuild payments. See Note 9 – “Long-Term Debt” for more information.\n\nIn September 2024, NCLC issued $315.0 million aggregate principal amount of 6.250% senior unsecured notes due 2030. The net proceeds, together with cash on hand, were used to redeem $315.0 million aggregate principal amount of the 3.625% senior unsecured notes due 2024, including to pay any accrued and unpaid interest thereon. See Note 9 – “Long-Term Debt” for more information.\nIn January 2025, the full amount of outstanding borrowings under the Breakaway one loan, Breakaway two loan, Marina newbuild loan and Riviera newbuild loan, plus any accrued and unpaid interest thereon, was repaid with funds drawn from the Revolving Loan Facility. NCLC also issued $1.8 billion aggregate principal amount of 6.750% senior unsecured notes due 2032. The net proceeds, together with cash on hand, were used to redeem $600.0 million aggregate principal amount of 8.375% senior secured notes due 2028 and $1.2 billion aggregate principal amount of 5.875% senior unsecured notes due 2026, together with any accrued and unpaid interest thereon, and to pay any related transaction premiums, fees and expenses. Concurrently, the Revolving Loan Facility was increased from $1.2 billion to $1.7 billion with the maturity date extended to 2030 and the collateral of the Revolving Loan Facility and the 8.125% senior secured notes due 2029 were modified. See Note 9 – “Long-Term Debt” for more information.\nThe Company continues to experience strong consumer demand for its offerings across itineraries and brands throughout 2025 and into 2026. As a result, the Company remains at the upper range of its optimal booked position on a 12-month forward basis.\nMargin Enhancement Initiative\nDuring 2024, we continued to see improvements in operating costs from our ongoing margin enhancement initiative. The Company continues to prioritize identifying and evaluating a variety of initiatives to improve its cost structure and margin profile, while preserving its brand equity and optimal guest satisfaction levels. However, global macroeconomic events have created volatility and disruptions in the past that have adversely impacted our costs and they may do so again in the future. Furthermore, we are exposed to fluctuations in the euro exchange rate for certain portions of ship construction contracts and various exchange rates for customer deposits that have not been hedged. See “Item 1A—Risk Factors” in our Annual Report for additional information.\nWe believe the increasing focus on climate change, including the Company’s targets for greenhouse gas reductions, and evolving regulatory requirements will materially impact our future capital expenditures and results of operations. We have set interim targets to guide us on our path to net zero and provide more details about them in our annual Sail & Sustain Report (which does not constitute a part of, and shall not be deemed incorporated by reference into, this Report). We expect to incur significant expenses related to these regulatory requirements and commitments, which have and will include expenses related to GHG emissions reduction initiatives, including modifications to our ships, and have and will include the purchase of emissions allowances, among other things. During 2024, we spent $47.7 million on capital expenditures for projects that are intended to reduce carbon emissions from our existing fleet. We have changed and may continue to be required to change certain operating procedures, for example slowing the speed of our ships, to meet regulatory requirements, which could adversely impact our operations. We are also evaluating the effects of global climate change related requirements, which are still evolving, including our ability to mitigate certain future expenses through initiatives to reduce GHG emissions; consequently, the full impact to the Company is not yet known. During 2024, we recognized $19.3 million of expense related to compliance with the E.U. ETS, a portion of which was collected directly from passengers through revenue. Additionally, our ships, port facilities, corporate offices and island destinations have in the past and may again be adversely affected by an increase in the frequency and intensity of adverse weather conditions caused by climate change. For example, certain ports have become temporarily unavailable to us due to hurricane damage and other destinations have either considered or implemented restrictions on cruise operations due to environmental concerns. Refer to “Impacts related to climate change may adversely affect our business, financial condition and results of operations” in “Item 1A—Risk Factors” for further information.\n\nItem 7. Management’s Discussion and Analysis of Financial Condition and Results of Operations\nFinancial Presentation\nThe following discussion and analysis contains forward-looking statements within the meaning of the federal securities laws, and should be read in conjunction with the disclosures we make concerning risks and other factors that may affect our business and operating results. You should read this information in conjunction with the consolidated financial statements and the notes thereto included in this Annual Report. See also “Cautionary Statement Concerning Forward-Looking Statements” immediately prior to Part I, Item 1 in this Annual Report.\nWe categorize revenue from our cruise and cruise-related activities as either “passenger ticket” revenue or “onboard and other” revenue. Passenger ticket revenue and onboard and other revenue vary according to product offering, the size of the ship in operation, the length of cruises operated and the markets in which the ship operates. Our revenue is seasonal based on demand for cruises, which has historically been strongest during the Northern Hemisphere’s summer months. Passenger ticket revenue primarily consists of revenue for accommodations, meals in certain restaurants on the ship, certain onboard entertainment, government taxes, fees and port expenses and includes revenue for service charges and air and land transportation to and from the ship to the extent guests purchase these items from us. Onboard and other revenue primarily consists of revenue from casino, beverage sales, shore excursions, specialty dining, retail sales, spa services and Wi-Fi services. Our onboard revenue is derived from onboard activities we perform directly or that are performed by independent concessionaires, from which we receive a share of their revenue.\nOur cruise operating expense is classified as follows:\nCommissions, transportation and other primarily consists of direct costs associated with passenger ticket revenue. These costs include travel advisor commissions, air and land transportation expenses, related credit card fees, certain government taxes, fees and port expenses and the costs associated with shore excursions and hotel accommodations included as part of the overall cruise purchase price.\nOnboard and other primarily consists of direct costs incurred in connection with onboard and other revenue, including casino, beverage sales and shore excursions.\nPayroll and related consists of the cost of wages, benefits and logistics for shipboard employees and costs of certain inventory items, including food, for a third party that provides crew and other hotel services for certain ships.\nFuel includes fuel costs, the impact of certain fuel hedges and fuel delivery costs.\nFood consists of food costs for passengers and crew on certain ships.\nOther consists of repairs and maintenance (including Dry-dock costs), ship insurance and other ship expenses.\nCritical Accounting Policies\nOur consolidated financial statements have been prepared in accordance with U.S. GAAP. The preparation of these consolidated financial statements requires us to make estimates, judgments and assumptions that affect the reported amounts of assets and liabilities and disclosure of contingent assets and liabilities at the date of our consolidated financial statements and the reported amounts of revenue and expenses during the periods presented. We rely on historical experience and on various other assumptions that we believe to be reasonable under the circumstances to make these estimates and judgments. Actual results could differ materially from these estimates. We believe that the following critical accounting policies reflect the significant estimates and assumptions used in the preparation of our consolidated financial statements. These critical accounting policies, which are presented in detail in our notes to our audited consolidated financial statements, relate to ship accounting and asset impairment.\n\nmore likely than not (i.e., more than 50%) that the estimated fair value of a reporting unit is less than its carrying value. For trade names we also provide a qualitative assessment to determine if there is any indication of impairment.\nIn order to make this evaluation, we consider whether any of the following factors or conditions exist:\nChanges in general macroeconomic conditions, such as a deterioration in general economic conditions; limitations on accessing capital; fluctuations in foreign exchange rates; or other developments in equity and credit markets;\nChanges in industry and market conditions such as a deterioration in the environment in which an entity operates; an increased competitive environment; a decline in market-dependent multiples or metrics (in both absolute terms and relative to peers); a change in the market for an entity’s products or services; or a regulatory or political development;\nChanges in cost factors that have a negative effect on earnings and cash flows;\nDecline in overall financial performance (for both actual and expected performance);\nEntity and reporting unit specific negative events such as changes in management, key personnel, strategy, or customers; litigation; or a change in the composition or carrying amount of net assets; and\nDecline in share price (in both absolute terms and relative to peers).\nIt is at our discretion whether to perform the qualitative test and we may bypass the qualitative test in any period and proceed directly to the quantitative impairment test. We may also, at our discretion, resume performing the qualitative assessment in any subsequent period.\nWe believe our estimates and judgments with respect to our long-lived assets, principally ships, goodwill, trade names and other indefinite-lived intangible assets are reasonable. Nonetheless, if there was a material change in assumptions used in the determination of such fair values or if there is a material change in the conditions or circumstances that influence such assets, we could be required to record an impairment charge. If a material change occurred or the result of the qualitative assessment indicated it is more likely than not that the estimated fair value of the asset is less than its carrying value, we would conduct a quantitative assessment comparing the fair value to its carryin",
  "item2_clean": null
}