{
  "source_file": "ndaq-20241231.htm",
  "form_type": "10-K",
  "item1_clean": "then provide the information to subscribers. After deducting costs, the plan administrators distribute the tape revenues to the respective plan participants based on a formula required by Regulation NMS that takes into account both trading and quoting activity.\nIn Canada, we operate an exchange with three independent markets for the trading of Canadian-listed securities: Nasdaq Canada CXC, Nasdaq Canada CX2 and Nasdaq Canada CXD.\nIn Europe, we operate exchanges in Tallinn (Estonia), Riga (Latvia) and Vilnius (Lithuania) as Nasdaq Baltic and exchanges in Stockholm (Sweden), Copenhagen (Denmark), Helsinki (Finland), and Reykjavik (Iceland) together with the clearing operations of Nasdaq Clearing, as Nasdaq Nordic.\nCollectively, the Nasdaq Nordic and Nasdaq Baltic exchanges offer trading in cash equities, depository receipts, warrants, convertibles, rights, fund units and ETFs, as well as trading and clearing of derivatives and clearing of resale and repurchase agreements. Our platform allows the exchanges to share the same trading system, which enables efficient cross-border trading and settlement, cross-exchange membership and a single source for Nordic data products. Settlement and registration of cash equity trading takes place in Sweden, Finland, and Denmark via the local central securities depositories. In addition, Nasdaq owns a central securities depository that provides notary, settlement, central maintenance and other services in the Baltic countries and Iceland.\nIn Europe, Nasdaq Nordic offers trading in derivatives, such as stock options and futures and index options and futures. Nasdaq Clearing offers CCP clearing services for stock options and futures and index options and futures.\nNasdaq Fixed Income, or NFI, provides a wide range of products and services, such as trading and clearing, for fixed income products in Sweden, Denmark, Finland, Iceland, Estonia, Lithuania and Latvia. Nasdaq is the largest bond listing venue in the Nordics, with more than 5,600 listed retail and institutional bonds. In addition, Nasdaq Nordic facilitates the trading and clearing of Nordic fixed income derivatives in a unique market structure. Buyers and sellers agree to trades in fixed income derivatives through bilateral negotiations and then report those trades to Nasdaq Clearing. Nasdaq Clearing offers CCP clearing services for fixed-income options and futures and interest rate swaps. Nasdaq Clearing also operates a clearing service for the resale and repurchase agreement market.\nNasdaq Commodities is the brand name for Nasdaq’s European commodity-related products and services such as trading and clearing. Nasdaq Commodities’ offerings include derivatives in power, natural gas and carbon emission\nmarkets, seafood and electricity certificates. These products are listed on Nasdaq Oslo ASA, except for seafood, which is listed on Fish Pool, a third-party platform. In June 2023, we entered into an agreement to sell our Nordic power trading and clearing business, which was subsequently terminated in June 2024. In January 2025, we entered into a new agreement to transfer existing open positions in our Nordic power derivatives trading and clearing business to a European exchange. The completion of this transaction is subject to customary regulatory approvals. Additionally, beginning in January 2025, Nasdaq no longer offered seafood derivatives clearing.\nNasdaq Oslo ASA is the commodity derivatives exchange for European products. All trades with Nasdaq Oslo ASA are subject to clearing with Nasdaq Clearing, which offers CCP clearing services for commodities options and futures.\nWe also own a majority stake in Puro.earth, a Finnish-based leading platform for carbon removal. Puro.earth offers engineered carbon removal instruments that are verified and tradable through an open, online platform. Puro.earth’s marketplace capabilities add to our suite of sustainability-focused technologies and workflow solutions and give our clients further resources to achieve their sustainability objectives.\nENABLERS, DIFFERENTIATORS AND COMPETITION\nWe are focused on amplifying the impact that AI has on the business and in our products. We continue to develop products and services using AI, including generative AI, and the use of AI in product development remains a priority for us in 2025. We are currently leveraging AI to further develop products and solutions in areas such as investment analytics, investor relations and fraud and anti-money laundering, as well as to modernize markets with the SEC approval of the first AI-powered order type. For example, we are working on developing AI systems to track financial transactions across the ecosystem to determine potential fraud, money laundering, or other actions. These solutions can be utilized by our clients, including banks, other exchanges and brokers firms that use our solutions to reduce or eliminate threats.\nWe are committed to the ethical and responsible use of AI in our products, services and business operations. Our AI governance structure aligns the application of AI with our core values through a framework that addresses the new and unique risks that AI technology presents, while enabling us to explore innovation and take advantage of opportunities that AI presents to better serve our customers, advance our business objectives and bring value to our shareholders. Our AI governance framework applies risk management across AI-related product development and business usage in the company through a multi-disciplinary approach. The framework puts into practice Nasdaq’s responsible AI usage principles and considers the U.S. National Institute of Standards and Technology AI Risk Management Framework. It is administered through company-wide policies, procedures and supporting preventative and detective controls.\nWe believe that our focus on AI to enhance features of our existing offerings and in the development of new solutions, together with our significant proprietary data sets and our use of AI to drive internal operating efficiencies, provides us with a competitive advantage.\nDuring 2024, Nasdaq continued its shift from traditional on-premises deployments by utilizing and deploying cloud infrastructure. We believe that migrating our exchanges to the cloud, through our partnership with AWS, will result in improved performance and increased flexibility for our customers. We expect to move additional markets to the cloud with AWS during the next several years. The shift to cloud-based markets enables Nasdaq to provide its clients access to enhanced capabilities, including virtual connectivity services, market analytics and machine learning. We also expect to continue to leverage the cloud-based infrastructure for our market technology clients, assisting such clients in developing their own platforms and customizing their offerings for their local, rapidly changing industry dynamics. Additionally, we expanded our existing colocation facility to meet the growing demand of market participants that seek proximity to the Nasdaq trading systems. Our expanded and enhanced facility is designed to provide the optimal environment for the next generation of compute workloads and offer clients access to a wider range of services and capabilities.\nTo facilitate the exchange migration to AWS, Nasdaq will also leverage its Fusion technology platform. Fusion positions Nasdaq’s North American and European markets to manage, operate and deploy a common platform that can be used across our nine Nasdaq derivative markets, while enabling our markets for cloud deployment\nCompetitive Strengths\nWe are a global, client-focused technology company with expertise in markets and financial technology. We deploy robust technology capabilities and have developed innovative solutions to further address client needs across the financial ecosystem. Our business segments complement each other and we believe that our strong competitive position in large, high-growth markets positions us for sustained growth.\nOur Value Proposition\nWe operate leading platforms that can improve the liquidity, transparency, and integrity of the global financial ecosystem, allowing us to:\nDevelop efficient and reliable technologies to facilitate and protect the financial system across asset classes;\nEmpower our clients to effectively navigate the capital markets, achieve their sustainability goals, and maintain corporate governance excellence; and\nProvide data, tools and insights that drive sound decision making while complying with evolving regulatory requirements.\nTechnological Strength\nThe strength and resiliency of our technology, enhanced by our Financial Technology segment, in meeting the advancing demands of our global customer base is vital to the continued success of our business and distinguishes us from our competitors.\nWe strive to be a trusted partner to a diverse range of clients that participate across the global financial ecosystem, including:\nBanks and Financial Institutions:\nProviding banks and financial institutions with safety and integrity through a suite of trade surveillance, cloud-native fraud and anti-money laundering solutions and robust regulatory reporting software.\nMarket Infrastructure Operators:\nAssisting market infrastructure operators in increasing efficiency, meeting customer needs, and growing revenue across the trade lifecycle.\nBrokers and Traders:\nHelping brokers and traders to confidently plan, optimize, manage risk and execute their business vision.\nMarket Participants:\nProviding market participants with access to liquidity and enabling them to efficiently consume, monitor, analyze\nand capitalize on real-time market changes.\nEnabling companies to access capital markets effectively, manage stakeholders and leverage technology to operate and govern effectively.\nInvestors and Asset Managers:\nOffering products and services to assist investors and asset managers in optimizing their portfolios and offerings.\nCapital Access Platforms\nOur Data business includes proprietary data products. Proprietary data products are made up exclusively of data derived from each exchange’s systems. Competition in the data business is influenced by rapidly changing technology and the creation of new product and service offerings.\nOur proprietary data products face competition globally from alternative exchanges and trading venues that offer similar products. Our data business competes with other exchanges and third-party vendors to provide information to market participants.\nOur Listing Services business in both the U.S. and Europe provides a means of facilitating capital formation through public capital markets. There are competing ways of raising capital, and we seek to demonstrate the benefits of listing shares on our exchange. Our primary competitor for larger company stock share listings in the U.S. is NYSE. The Nasdaq Stock Market competes with local and international markets located outside the U.S. for listings of equity securities of both U.S. and non-U.S. companies that choose to list (or dual-list) outside of their home country. For example, The Nasdaq Stock Market competes for listings with exchanges in Europe and Asia. Additionally, we face competition from private equity firms that may elect to keep their portfolio companies as private companies.\nThe Listings Services business in Europe is characterized by a large number of exchanges competing for new or secondary listings. Each country has one or more national exchanges, which are often the first choice of companies in each respective country. For those considering an alternative, competing European exchanges that frequently attract many listings from outside their respective home countries include LSE, Euronext N.V. and Deutsche Börse AG. In addition to the larger exchanges, companies seeking capital or liquidity from public capital markets are able to raise capital without a regulated market listing and can consider trading their shar",
  "item7_clean": "Net cash provided by (used in):\nOperating activities\nInvesting activities\nFinancing activities\nNet Cash Provided by Operating Activities\nNet cash provided by operating activities primarily consists of net income adjusted for certain non-cash items, including, but not limited to, depreciation and amortization expense, expense associated with share-based compensation, deferred income taxes and the effects of changes in working capital. Changes in working capital include changes in accounts receivable and deferred revenue which are impacted by the timing of customer billings and related collections from our customers; accounts payable and accrued expenses due to timing of payments; accrued personnel costs, which are impacted by employee performance targets and the timing of payments related to employee bonus incentives; and Section 31 fees payable to the SEC, which is impacted by the changes in SEC fee rates and the timing of collections from customers and payments to the SEC.\nNet cash provided by operating activities increased $243 million for the year ended December 31, 2024 compared with the same period in 2023. The increase was primarily driven by an increase in net income and the impact of certain non-cash items on net income, primarily an increase in amortization expense due to acquired intangibles related to the Adenza acquisitions offset by a decrease in deferred income tax liabilities.\nThe changes in our operating assets and liabilities primarily included higher Section 31 fees payable to the SEC due to changes in Section 31 fee rate between periods, partially offset by higher cash outflows from accounts payable and accrued expenses, primarily due to interest paid relating to the senior unsecured notes and the settlement of a legal matter, and higher cash outflows from higher receivables, net, primarily due to higher Market Services receivables driven by higher Section 31 fee rate as well as higher billings.\nNet Cash Used in Investing Activities\nNet cash used in investing activities for the year ended December 31, 2024 related to net purchases of investments related to default funds and margin deposits of $707 million, purchases of property and equipment of $207 million, other investing activities primarily related to our corporate venture program of $32 million and net purchases of trading securities, net, of $7 million.\nNet cash used in investing activities for the year ended December 31, 2023 related to $5,766 million paid for the acquisition of Adenza, net of cash and cash equivalents acquired, purchases of property and equipment of $158 million, net purchases of investments related to default funds and margin deposits of $74 million and $3 million from other investing activities, partially offset by proceeds from the sale and redemption of trading securities, net of $7 million.\nNet Cash Provided by (Used in) Financing Activities\nNet cash used in financing activities for the year ended December 31, 2024 primarily related to a decrease in default funds and margin deposits of $1,030 million, dividend payments to our shareholders of $541 million, 2023 Term Loan repayment of $340 million, net repayments of our commercial paper of $291 million, repayments of debt and credit commitments of $181 million and repurchases of common stock of $145 million.\nNet cash provided by financing activities for the year ended December 31, 2023 primarily related to $5,608 million in proceeds from issuances of senior unsecured notes and the 2023 Term Loan, in connection with the Adenza acquisition, net of debt issuance costs partially offset by dividend payments to our shareholders of $441 million, repayments of our commercial paper, net of $371 million, repurchases of common stock of $269 million and partial repayment of the 2023 Term Loan of $260 million.\nSee Note 9, “Debt Obligations,” to the consolidated financial statements for further discussion of our debt obligations.\nSee “Share Repurchase Program,” and “Cash Dividends on Common Stock,” of Note 12, “Nasdaq Stockholders’ Equity,” to the consolidated financial statements for further discussion of our share repurchase program and cash dividends declared and paid on our common stock.\nFinancial Investments\nOur financial investments totaled $184 million as of December 31, 2024 and $188 million as of December 31, 2023. Of these securities, $171 million as of December 31, 2024 and $168 million as of December 31, 2023 are assets primarily utilized to meet regulatory capital requirements, mainly for our clearing operations at Nasdaq Clearing. See Note 6, “Investments,” to the consolidated financial statements for further discussion.\nRegulatory Capital Requirements\nClearing Operations Regulatory Capital Requirements\nWe are required to maintain minimum levels of regulatory capital for the clearing operations of Nasdaq Clearing. The level of regulatory capital required to be maintained is dependent upon many factors, including market conditions and creditworthiness of the counterparty. As of December 31, 2024, our required regulatory capital of $129 million was primarily comprised of highly rated European government debt securities that are included in financial investments in the Consolidated Balance Sheets.\nBroker-Dealer Net Capital Requirements\nOur broker-dealer subsidiaries, Nasdaq Execution Services, NFSTX, LLC, and Nasdaq Capital Markets Advisory, are subject to regulatory requirements intended to ensure their general financial soundness and liquidity. These requirements obligate these subsidiaries to comply with minimum net capital requirements. As of December 31, 2024, the combined required minimum net capital totaled $1 million and the combined excess capital totaled $24 million, substantially all of which is held in cash and cash equivalents in the Consolidated Balance Sheets. The required minimum net capital is included in restricted cash and cash equivalents in the Consolidated Balance Sheets.\nNordic and Baltic Exchange Regulatory Capital Requirements\nThe entities that operate trading venues in the Nordic and Baltic countries are each subject to local regulations and are required to maintain regulatory capital intended to ensure their general financial soundness and liquidity. As of December 31, 2024, our required regulatory capital of $35 million was primarily invested in European government bills and mortgage bonds that are included in financial investments in the Consolidated Balance Sheets and cash, which is included in restricted cash and cash equivalents in the Consolidated Balance Sheets.\nOther Capital Requirements\nWe operate several other businesses which are subject to local regulation and are required to maintain certain levels of regulatory capital. As of December 31, 2024, other required regulatory capital of $12 million, primarily related to Nasdaq Central Securities Depository, was primarily invested in European government debt securities that are included in financial investments in the Consolidated Balance Sheets.\nEquity and dividends\nShare Repurchase Program\nSee “Share Repurchase Program,” of Note 12, “Nasdaq Stockholders’ Equity,” to the consolidated financial statements for further discussion of our share repurchase program.\nCash Dividends on Common Stock\nThe following table presents our quarterly cash dividends paid per common share on our outstanding common stock:\nSee “Cash Dividends on Common Stock,” of Note 12, “Nasdaq Stockholders’ Equity,” to the consolidated financial statements for further discussion of the dividends.\nThe debt obligations, by contractual maturity, at December 31, 2024 are as follows (in U.S. Dollar millions):\nIn the fourth quarter of 2024, we repurchased an aggregate amount of $181 million of outstanding notes, primarily related to the 2025 Notes, 2028 Notes and 2034 Notes. In February 2025, Nasdaq commenced a cash tender offer to repurchase up to an aggregate principal amount of $200 million of our 2028, 2034 and 2052 Notes.\nFor the year ended December 31, 2024, the weighted average interest rate on our debt obligations was approximately 3.95%. This rate can fluctuate based on changes in interest rates for our variable rate debts, changes in foreign currency exchange rates and changes in the amount and duration of outstanding debt. In addition to the 2022 Revolving Credit Facility, we also have other credit facilities primarily to support our Nasdaq Clearing operations in Europe, as well as to provide a cash pool credit line. These European credit facilities, which are available in multiple currencies, totaled $174 million as of December 31, 2024 and $191 million as of December 31, 2023 in available liquidity, none of which was utilized.\nFinancing of the Adenza Acquisition\nIn June 2023, Nasdaq issued six series of notes for total proceeds of $5,016 million, net of debt issuance costs of $38 million, with various maturity dates ranging from 2025 to 2063. The net proceeds from these notes were used to finance the majority of the cash consideration due in connection with the Adenza acquisition.\nIn addition, in connection with the financing of the Adenza acquisition, we entered into the 2023 Term Loan agreement. The 2023 Term Loan provided us with the ability to borrow up to $600 million to finance a portion of the cash consideration for the Adenza acquisition and other amounts incurred in connection with this transaction. On November 1, 2023, we borrowed $599 million, net of fees, under this term loan, which was used towards payment of the cash consideration due in connection with the Adenza acquisition, a portion of which had been repaid in the fourth quarter of 2023. The term loan was fully repaid in 2024.\nAs of December 31, 2024, we were in compliance with the covenants of all of our debt obligations.\nSee Note 9, “Debt Obligations,” to the consolidated financial statements for further discussion of our debt obligations.\nCONTRACTUAL OBLIGATIONS AND CONTINGENT COMMITMENTS\nNasdaq has contractual obligations to make future payments under debt obligations by contract maturity, operating lease payments, and other obligations. The following table summarizes material cash requirements for known contractual and other obligations as of December 31, 2024, and the estimated timing thereof.\nPayments Due by Period\nDebt obligation by contractual maturity\nOperating lease obligations\nPurchase obligations\nDebt obligations by contractual maturity include both principal and interest obligations. For our Euro denominated notes interest is calculated on an actual basis while all other debt obligations were primarily calculated on a 365-day basis at the contractual fixed rate multiplied by the aggregate principal amount as of December 31, 2024. See Note 9, “Debt Obligations,” to the consolidated financial statements for further discussion.\nOperating lease obligations represent our undiscounted operating lease liabilities as of December 31, 2024, as well as legally binding minimum lease payments for leases signed but not yet commenced. See Note 16, “Leases,” to the consolidated financial statements for further discussion of our leases.\nPurchase obligations primarily represent minimum outstanding obligations due under software license agreements. The balance as of December 31, 2024 is primarily comprised of our multi-year AWS partnership contract.\nOFF-BALANCE SHEET ARRANGEMENTS\nFor discussion of off-balance sheet arrangements see:\n• Note 15, “Clearing Operations,” to the consolidated financial statements for further discussion of our non-cash default fund contributions and margin deposits received for clearing operations; and\n• Note 18, “Commitments, Contingencies and Guarantees,” to the consolidated financial statements for further discussion of:\nGuarantees issued and credit facilities available;\nOther guarantees; and\nRouting brokerage activities.\nQUANTITATIVE AND QUALITATIVE DISCLOSURES ABOUT MARKET RISK\nAs a result of our operating, investing and financing activities, we are exposed to market risks such as interest rate risk and foreign currency exchange rate risk. We are also exposed to credit risk as a result of our normal business activities.\nWe have implemented policies and procedures to measure, manage, monitor and report risk exposures, which are reviewed regularly by management and the board of directors. We identify risk exposures and monitor and manage such risks on a daily basis.\nWe perform sensitivity analyses to determine the effects of market risk exposures. We may use derivative instruments solely to hedge financial risks related to our financial positions or risks that are incurred during the normal course of business. We do not use derivative instruments for speculative purposes.\nWe are subject to the risk of fluctuating interest rates in the normal course of business. Our exposure to market risk for changes in interest rates relates primarily to our financial investments and debt obligations, which are discussed below. Substantially all of our debt obligations are fixed-rate obligations. We may enter into transactions that expose us to interest rate risk, for which we may utilize interest rate swap agreements to manage that risk.\nFinancial Investments\nAs of December 31, 2024, our investment portfolio was primarily comprised of highly rated European government debt securities, which pay a fixed rate of interest. These securities are subject to interest rate risk and the fair value of these securities will decrease if market interest rates increase. The impact of an immediate increase to market interest rates, uniformly, by a hypothetical 100 basis points from levels as of December 31, 2024, would not have a material impact on our financial statements.\nAs of December 31, 2024, substantially all of our debt obligations are fixed-rate obligations. Interest rates on certain tranches of notes are subject to adjustment to the extent our debt rating is downgraded below investment grade, as further discussed in Note 9, “Debt Obligations,” to the consolidated financial statements. While changes in interest rates will have no impact on the interest we pay on fixed-rate obligations, we are exposed to changes in interest rates as a result of the borrowings under our 2022 Revolving Credit Facility, as this facility has a variable interest rate. We are also exposed to changes in interest rates as a result of the amounts outstanding from the sale of commercial paper under our commercial paper program, which have variable interest rates. As of December 31, 2024, there were no outstanding borrowings under our 2022 Revolving Credit Facility or commercial paper program.\nForeign Currency Exchange Rate Risk\nWe are subject to foreign currency exchange rate risk. Our primary transactional exposure to foreign currency denominated revenues less transaction-based expenses and operating income for the years ended December 31, 2024 and 2023 is presented in the following tables:\nOther Foreign Currencies\n(in millions, except currency rate)\nYear Ended December 31, 2024\nAverage foreign currency rate to the U.S. dollar\nN/A\nPercentage of revenues less transaction-based expenses\nPercentage of operating income\nImpact of a 10% adverse currency fluctuation on revenues less transaction-based expenses\nImpact of a 10% adverse currency fluctuation on operating income\nOther Foreign Currencies\n(in millions, except currency rate)\nYear Ended December 31, 2023\nAverage foreign currency rate to the U.S. dollar\nN/A\nPercentage of revenues less transaction-based expenses\nPercentage of operating income\nImpact of a 10% adverse currency fluctuation on revenues less transaction-based expenses\nImpact of a 10% adverse currency fluctuation on operating income\n# Represents multiple foreign currency rates.\nThe adverse impacts shown in the preceding tables should be viewed individually by currency and not in aggregate due to the correlation between changes in exchange rates for certain currencies. Additionally, the table does not include the offsetting impact of our hedg",
  "item2_clean": null
}