{
  "source_file": "ndsn-20241031.htm",
  "form_type": "10-K",
  "item1_clean": "Components and devices for minimally invasive interventional surgical procedures, including cannulas, catheters and medical balloons. Products also include proprietary single-use plastic components in medical applications, including biopharmaceutical, patient care/surgical and diagnostic systems.\n– Precision manual and semi-automated dispensers and highly engineered single-use plastic molded syringes, cartridges, tips and fluid connection components. Products are used within critical medical and industrial production processes and for applying and controlling the flow of adhesives, sealants and lubricants. Key strategic markets include electronics, industrial, medical and animal health.\nOn August 21, 2024, Nordson acquired Atrion Corporation, a Delaware corporation (“Atrion”), pursuant to the Agreement and Plan of Merger (the “Merger Agreement”), dated as of May 28, 2024, among Nordson, Alpha Medical Merger Sub, Inc., a Delaware corporation and a wholly owned subsidiary of Nordson (“Merger Sub”) and Atrion. Headquartered in Allen, Texas, Atrion is a manufacturer of proprietary medical products and generated approximately $169 million in annual revenue in 2023. Established in 1944, Atrion supports customers globally through three FDA registered U.S. Food and Drug Administration manufacturing facilities located in the United States. Atrion’s portfolio is included in the Company's Medical and Fluid Solutions segment. It consists of three key businesses that we believe will significantly expand Nordson’s addressable market in infusion and cardiovascular therapies:\nHalkey Roberts is a leader in infusion fluid delivery solutions, including single-use original equipment manufacturer (\"OEM\") medical components such as swabable needle free and pressure relief valves.\nAtrion Medical is a leading provider of OEM interventional inflation devices for balloon catheterization, stent deployment and fluid delivery in structural heart, ears, nose and throat and gastrointestinal procedures.\nQuest Medical’s highly differentiated myocardial protection devices and single-use consumables deliver real-time precise drug administration during cardiovascular surgery.\nAdvanced Technology Solutions\nThis segment integrates our proprietary product technologies into the progressive stages of a customer’s production processes, such as surface treatment, precisely controlled dispensing of material and pre- and post-dispense test and inspection to ensure quality. This segment predominantly serves customers in the electronics end markets.\nAutomated dispensing systems for high-speed, accurate application of a broad range of attachment, protection and coating fluids, and related gas plasma treatment systems for cleaning and conditioning surfaces prior to dispense. Key strategic markets include the breadth of the electronics industry manufacturing supply chain that produces semiconductor, printed circuit board assemblies and electronic components.\nBond testing and automated optical, acoustic microscopy and x-ray inspection systems used in the semiconductor and printed circuit board industries. Key strategic markets include mobile phones, tablets, personal computers, wearable technology, liquid crystal displays, micro hard drives, microprocessors, printed circuit boards, flexible circuits, micro mechanical systems and semiconductor packaging.\nManufacturing, Raw Materials and Other Resources\nOur production operations include machining, molding and assembly. We manufacture specially designed parts and assemble components into finished equipment. Many components are made in standard modules that can be used in more than one product or in combination with other components for a variety of models. We have principal manufacturing operations and\nNordson Corporation 6\nsources of supply in the United States in Ohio, Georgia, California, Colorado, Connecticut, Illinois, Michigan, Minnesota, Pennsylvania, Rhode Island, Tennessee, Florida, Texas, Alabama and Wisconsin; as well as in the People’s Republic of China, Germany, Ireland, India, Israel, Italy, Mexico, the Netherlands and the United Kingdom.\nPrincipal materials used to make our products are metals and plastics, typically in sheets, bar stock, castings, forgings, tubing and pellets. We also purchase many electrical and electronic components, fabricated metal parts, high-pressure fluid hoses, packings, seals and other items integral to our products. Suppliers are competitively selected based on cost, quality and service. Most significant raw materials that we use are available through multiple sources. We purchase most raw materials and other components on the open market and rely on third parties to provide certain finished goods. While these items are generally available from multiple sources, the cost of products sold may be affected by changes in the market price of raw materials and tariffs on certain raw materials, particularly imports from China, as well as disruptions in availability of raw materials, components and sourced finished goods.\nWe monitor and investigate alternative suppliers and materials based on numerous attributes including quality, service, financial stability and price. We currently source raw materials and components from a number of suppliers, but our ongoing efforts to improve service and manage compliance requirements and the cost effectiveness of our products may result in a reduction in the number of our suppliers.\nSenior operating management supervises an extensive quality control program for our equipment, machinery and systems, and manufacturing processes.\nNatural gas, electricity and other fuels are our primary energy sources. However, standby capacity for alternative sources is available if needed.\nWe continue to see a stabilization of the global supply chain, improved lead times and lower inflation risk. We enhanced our risk mitigation and sourcing efforts as a result of the COVID-19 pandemic and geopolitical tensions. Logistics flows have improved, and global forwarding rates have returned closer to pre-pandemic levels, except for Asia-origin shipments, which continue to be more volatile. We continue to see moderate rate increases on parcel and domestic trucking activity.\nIntellectual Property\nWe rely on a combination of intellectual property rights, including patents, trademarks, copyrights, trade secrets and contractual provisions to protect our intellectual property. Our worldwide intellectual property portfolio is strengthened through innovation and brand recognition, and our comprehensive approach for protection and enforcement. We enter into confidentiality and intellectual property agreements with our employees that require them to disclose any inventions created in the scope of employment, convey all rights to those inventions to us and restrict the distribution of proprietary information. Risk factors associated with our intellectual property are discussed in Item 1A, \"Risk Factors.\"\nWe protect and promote our intellectual property portfolio and take those actions we deem appropriate to enforce our intellectual property rights and to defend our rights to sell our products both domestically and internationally. Although in the aggregate, our global portfolio of more than 2,100 granted and pending patents and more than 1,000 trademarks are valuable assets that are important to our operations, we believe that our competitive advantage is also largely attributable to the technical, marketing and sales competence and capabilities of our employees, rather than on any individual patent or trademark. Therefore, we do not consider the expiration or loss of any single patent, trademark or intellectual property right, to be material to our business as a whole.\nSeasonal Variation in Business\nHistorically, the highest volume of sales occurs in the second half of the fiscal year due in large part to the timing of customers’ capital spending programs. Accordingly, fiscal first quarter sales volume is typically the lowest of the year due to timing of customers’ capital spending programs and customer holiday shutdowns.\nCompetitive Conditions\nWe operate in a competitive global marketplace and compete with many large, well-established and highly competitive manufacturers and service providers. Our business is affected by a range of macroeconomic conditions, including industry capacity changes, global competition and economic conditions in the U.S. and abroad, as well as fluctuations in currency exchange rates. Our equipment is sold in competition with a wide variety of alternative bonding, sealing, finishing, coating, processing, testing, inspecting and fluid control techniques. Potential uses for our equipment include any production processes that require preparation, modification or curing of surfaces; dispensing, application, processing or control of fluids and materials; or testing and inspecting for quality.\nNordson Corporation 7\nMany factors influence our competitive position, including pricing, product quality and service. We maintain a leadership position in our business segments by delivering high-quality, innovative products and technologies, as well as global service and technical support. Working with customers to understand their processes and developing the application solutions that help them meet their production requirements also contributes to our leadership position. Our worldwide network of direct sales and technical resources also is a competitive advantage.\nCompliance with Governmental Regulations\nOur global operations are subject to a variety of federal, state, local and international laws, regulations and compliance obligations relating to the manufacturing, designing and servicing of highly complex products and solutions. Examples of such regulations include, but are not limited to, import and export controls, data privacy, environmental, product safety, corruption, bribery, employment and labor. To support our policy of compliance in every jurisdiction we do business, we have robust internal controls, quality management systems, and management systems of compliance that govern our internal actions and mitigate our risk of non-compliance. We also have safeguards established to identify non-compliance concerns through internal and external audits and risk assessments, as well as an ethics helpline reporting system. The following describes certain significant regulations that may impact our business. For additional information about the risks associated with these laws and regulations, see Part I, Item 1A, \"Risk Factors.\"\nWe transact with customers and suppliers in numerous geographies around the world and are required to comply with U.S. and non-U.S. import, export and sanctions laws (collectively “Trade Laws”). We have developed compliance programs and training to prevent violations of Trade Laws, and we regularly monitor and adjust our programs and training to reflect changes in Trade Laws or changes in our business. Geopolitical events may result in changes to Trade Laws that may impact our ability to transact business involving certain countries, certain items or certain counterparties, or may impose additional costs or complexity relating to tariffs, taxes, duties or adjustments to our compliance programs, training, or personnel requirements.\nWe are also required to comply with increasingly complex and changing laws and regulations enacted to protect business and personal data in the United States and other jurisdictions regarding privacy, data protection and data security, including those related to the collection, storage, use, transmission and protection of personal information and other consumer, customer, vendor or employee data. The risk of data privacy breaches cannot be entirely eliminated, creating risks of fines and penalties. Additionally, privacy and data protection laws and regulations, including with respect to the European Union’s General Data Protection Regulation (\"GDPR\"), and the Californi",
  "item7_clean": "Item 7. Management's Discussion and Analysis of Financial Condition and Results of Operations\nNOTE REGARDING AMOUNTS AND FISCAL YEAR REFERENCES\nIn this annual report, all amounts related to United States dollars and foreign currency and to the number of Nordson Corporation’s common shares, except for per share earnings and dividend amounts, are expressed in thousands. Unless the context otherwise indicates, all references to “we,” “us,” “our,” or the “Company” mean Nordson Corporation.\nUnless otherwise noted, all references to years relate to our fiscal year ending October 31.\nCritical Accounting Policies and Estimates\nOur Consolidated Financial Statements and accompanying notes have been prepared in accordance with accounting principles generally accepted in the United States. The preparation of these financial statements requires management to make estimates, judgments and assumptions that affect reported amounts of assets, liabilities, revenues and expenses. On an ongoing basis, we evaluate the accounting policies and estimates that are used to prepare financial statements. We base our estimates on historical experience and assumptions believed to be reasonable under current facts and circumstances. Actual amounts and results could differ from these estimates used by management.\nCertain accounting policies that require significant management estimates and are deemed critical to our results of operations or financial position are discussed below. On a regular basis, critical accounting policies are reviewed with the Audit Committee of the board of directors.\nRevenue recognition -\nA contract exists when it has approval and commitment from both parties, the rights of the parties are identified, payment terms are identified, the contract has commercial substance and collectability of the consideration is probable. Revenue is recognized when performance obligations under the terms of the contract with a customer are satisfied. Generally, our revenue results from short-term, fixed-price contracts and is recognized as of a point in time when the product is shipped or at a later point when the control of the product transfers to the customer. Refer to Note 1 to the Consolidated Financial Statements for further discussion regarding the Company's revenue recognition policy.\nBusiness combinations -\nThe acquisitions of our businesses are accounted for under the acquisition method of accounting. The amounts assigned to the identifiable assets acquired and liabilities assumed in connection with acquisitions are based on estimated fair values as of the date of the acquisition, with the remainder, if any, recorded as goodwill. The fair values are determined by management, taking into consideration information supplied by the management of the acquired entities, and other relevant information. Such information typically includes valuations obtained from independent appraisal experts, which management reviews and considers in its estimates of fair values. The valuations are generally based upon future cash flow projections for the acquired assets, discounted to present value. Determining the fair value of assets acquired and liabilities assumed requires management’s judgment and often involves the use of significant estimates and assumptions, including assumptions with respect to future revenue growth rates and EBITDA margins, discount rates, customer attrition rates, and asset lives, among other items. This judgment could result in either a higher or lower value assigned to amortizable or depreciable assets. The impact could result in either higher or lower amortization and/or depreciation expense.\nGoodwill is the excess of purchase price over the fair value of tangible and identifiable intangible net assets acquired in various business combinations. Goodwill is not amortized but is tested for impairment annually at the reporting unit level, or more often if indications of impairment exist.\nWe test goodwill in accordance with Accounting Standards Codification (\"ASC\") 350. We did not record any goodwill impairment charges in 2024. We use an independent valuation specialist to assist with refining our assumptions and methods used to determine fair values. To test for goodwill impairment, we estimate the fair value of each of our reporting units using a combination of the discounted cash flow method (\"Income Approach\") and the Market Approach.\nThe Income Approach uses assumptions for revenue growth, operating margin and working capital turnover that are based on management’s strategic plans tempered by performance trends and reasonable expectations about those trends. Terminal value calculations employ a published formula known as the Gordon Growth Model Method that essentially captures the present value of perpetual cash flows beyond the last projected period assuming a constant Weighted Average Cost of Capital (\"WACC\") methodology and growth rate. For each reporting unit, a sensitivity analysis is performed to vary the discount and terminal growth rates in order to provide a range of reasonableness for detecting impairment. Discount rates are developed using a WACC methodology.\nThe WACC represents the blended average required rate of return for equity and debt capital based on observed market return data and company specific risk factors. For 2024, the WACC rates used ranged from 8.0 percent to 9.0 percent depending upon the reporting unit's size, end market volatility and projection risk. See Note 5 to the Consolidated Financial Statements for further details regarding the valuation methodologies used.\nNordson Corporation 26\nIn 2024, 2023 and 2022, the results of our annual impairment tests indicated no impairment.\nThe fair value (\"FV\") was compared to the carrying value (\"CV\") for each reporting unit. Based on the results shown in the table below and based on our measurement date of August 1, 2024, our conclusion is that no goodwill was impaired in 2024. Potential events or circumstances, such as a sustained downturn in global economies, could have a negative effect on estimated fair values.\nWACC\nIndustrial Precision Solutions Segment - Adhesives\nIndustrial Precision Solutions Segment - Industrial Coating Systems\nAdvanced Technology Solutions Segment - Electronics Systems\nAdvanced Technology Solutions Segment - Test & Inspection\nMedical and Fluid Solutions Segment - Fluid Management\nPension plan in the United States\n- The measurement of the liabilities related to our domestic pension plan is based on management’s assumptions related to future factors, including interest rates, return on pension plan assets, compensation increases, mortality and turnover assumptions and health care cost trend rates. The liabilities associated with the Company's international pension plans and OPEB are not as materially sensitive to changes in assumptions as the pension plan in the United States.\nThe weighted-average discount rate used to determine the present value of our domestic pension plan obligations was 5.27 percent at October 31, 2024 and 6.08 percent at October 31, 2023. The discount rate used was determined by using quality fixed income investments with a duration period approximately equal to the period over which pension obligations are expected to be settled.\nIn determining the expected return on plan assets, we consider both historical performance and an estimate of future long-term rates of return on assets similar to those in our plans. We consult with and consider the opinions of financial and actuarial experts in developing appropriate return assumptions. The expected rate of return (long-term investment rate) on domestic pension assets used to determine net benefit costs was 6.50 percent and 6.40 percent in 2024 and 2023, respectively.\nThe assumed rate of compensation increases used to determine the present value of our domestic pension plan obligations was 3.96 percent and 3.92 percent at October 31, 2024 and October 31, 2023, respectively.\nAnnual expense amounts are determined based on the discount rate used at the end of the prior year. Differences between actual and assumed investment returns on pension plan assets result in actuarial gains or losses that are amortized into expense over a period of years.\nEconomic assumptions have a significant effect on the amounts reported. The effect of a one percent change in the discount rate, expected return on assets and compensation increase is shown in the table below. Bracketed numbers represent decreases in expense and obligation amounts.\nEffect on total net periodic pension cost in 2024\nEffect on pension obligation as of October 31, 2024\nExpected return on assets:\nEffect on total net periodic pension cost in 2024\nCompensation increase:\nEffect on total net periodic pension cost in 2024\nEffect on pension obligation as of October 31, 2024\n– Income taxes are estimated based on income for financial reporting purposes. Deferred income taxes reflect the net tax effect of temporary differences between the carrying amounts of assets and liabilities for financial reporting purposes and the amounts used for income tax purposes and certain changes in valuation allowances. We provide valuation allowances against deferred tax assets if, based on available evidence, it is more likely than not that some portion or all of the deferred tax assets will not be realized.\nNordson Corporation 27\nManagement believes the valuation allowances are adequate after considering future taxable income, allowable carryforward periods and ongoing prudent and feasible tax planning strategies. In the event we were to determine that we would be able to realize the deferred tax assets in the future in excess of the net recorded amount (including the valuation allowance), an adjustment to the valuation allowance would increase income in the period such determination was made. Conversely, should we determine that we would not be able to realize all or part of the net deferred tax asset in the future, an adjustment to the valuation allowance would be expensed in the period such determination was made.\nFurther, at each interim reporting period, we estimate an effective income tax rate that is expected to be applicable for the full year. Significant judgment is involved regarding the application of global income tax laws and regulations and when projecting the jurisdictional mix of income. Additionally, interpretation of tax laws, court decisions or other guidance provided by taxing authorities influences our estimate of the effective income tax rates. As a result, our actual effective income tax rates and related income tax liabilities may differ materially from our estimated effective tax rates and related income tax liabilities. Any resulting differences are recorded in the period they become known.\nOn August 21, 2024, the Company completed the acquisition of Atrion, pursuant to the terms of the Merger Agreement with Merger Sub and Atrion. Pursuant to the Merger Agreement, Merger Sub merged with and into Atrion (the “Merger”), with Atrion surviving the Merger as a wholly owned subsidiary of Nordson. Atrion is a leader in\nproprietary medical infusion fluid delivery and niche cardiovascular solutions and will operate within our Medical and Fluid Solutions segment.\nThe all-cash acquisition of Atrion of $789,996, net of cash acquired, was funded using borrowings under our revolving credit facility, and the 364-day term loan agreement with a group of banks for a delayed draw term loan facility in the aggregate principal amount of $500,000 (the \"364-Day Term Loan Agreement\") (see Note 8 to the Consolidated Financial Statements for additional details) and cash on hand. Based on the fair value of the assets acquired and the liabilities assumed, a preliminary purchase price allocation resulted in the recognition of $494,279 of goodwill and $129,600 of identifiable intangible assets. The identifiable intangible assets consist primarily of $40,100 of tradenames (amortized over 15 years), $24,900 of technology (amortized over 15 years), and $64,600 of customer relationships (amortized over 19 years). The financial results of the Atrion acquisition are not expected to have a material impact on our Consolidated Financial Statements.\nResults of Operations\nAs used throughout this annual report, geographic regions include the Americas (United States, Canada, Mexico and Central and South America), Asia Pacific and Europe.\nConsolidated Financial Results\nConsolidated financial results for the years ended October 31, 2024, 2023 and 2022 were as follows:\n(In thousands except for per-share amounts)\n\nbasis points due to an unfavorable acquisition impact and severance costs. MFS operating margin declined\nfees, severance, and non-cash inventory charges associated with the Atrion acquisition which offset improvements in operating efficiencies. ATS operating margin improved by\non lower sales volumes due to cost reduction actions and favorable mix.\nInterest and Other expenses\nInterest expense in 2024 was $88,924, an increase of $29,419, or 49.4 percent, from\n. The increase reflects higher average debt levels compared to the prior year due to funding of acquisitions. Other expense in 2024 was $4,509 compared to other expense of $597 in\n. Included in other expense in 2024 were $5,499 in net foreign currency losses, which were partially offset by pension gains. Included in the prior year’s other expense were $7,742 in foreign currency losses, which were largely offset by pension gains.\nNordson Corporation 29\nIncome tax expense in 2024 was $118,197, or 20.2 percent of pre-tax income, as compared to $127,846, or 20.8 percent of pre-tax income in\n. The effective tax rate decreased 60 basis points primarily due to a decline in the impact of foreign tax rate variances. The income tax provision for 2024 included a tax benefit of $4,037 due to our share-based payment transactions. Our income tax provision for 2023 included a tax benefit of $4,286 due to our share-based payment transactions.\nNet income was $467,284, or $8.11 per diluted share, in 2024, compared to net income of $487,493, or $8.46 per diluted share, in 2023. This represented a 4.1 percent decrease in net income and a 4.1 percent decrease in diluted earnings per share. The decrease of $0.35 per diluted share was primarily driven by higher interest expense in 2024 compared to 2023.\nLiquidity and Capital Resources\nCash and cash equivalents increased $273 in 2024 to $115,952 as of October 31, 2024 compared to $115,679 as of October 31, 2023. Approximately 81 percent of our consolidated cash and cash equivalents were held at various foreign subsidiaries as of October 31, 2024.\nA comparison of cash flow changes from 2024 to 2023 as follows:\nNet Income and non-cash items\nChanges in operating assets and liabilities\nNet cash provided by operating activities\nAdditions to property, plant and equipment\nAcquisitions of businesses, net of cash acquired\nNet cash used in investing activities\nIssuance of long-term debt\nRepayment of finance lease obligations\nIssuance of common shares\nPurchase of treasury shares\nNet cash provided by financing activities\nThe changes in operating assets and liabilities were principally driven by decreases in customer advance payments and income taxes payable. Additions to property, plant and equipment were largely driven by productivity and growth projects, including a new manufacturing facility.\nWe have a $1,150,000 unsecured multi-currency credit facility with a group of banks that provides for a term loan facility in the aggregate principal amount of $300,000, maturing in June 2026, and a multicurrency revolving credit facility in the aggregate principal amount of $850,000, maturing in June 2028. In anticipation of the ARAG acquisition, the Company entered into a €760,000 senior unsecured term loan facility with a group of banks in August 2023 (the \"364-Day Term Loan Facility\"). On September 13, 2023, the Company completed an underwritten public offerin",
  "item2_clean": null
}