{
  "source_file": "ndsn-20250731.htm",
  "form_type": "10-Q",
  "item1_clean": null,
  "item7_clean": null,
  "item2_clean": "f foreign currency losses. Included in other-net for the nine months ended July 31, 2024 were pension and postretirement income of $3,085 and $2,411 in foreign currency losses.\nWe record our interim provision for income taxes based on our estimated annual effective tax rate, as well as certain items discrete to the current period. Significant judgment is involved regarding the application of global income tax laws and regulations and when projecting the jurisdictional mix of income. We have considered several factors in determining the probability of realizing deferred income tax assets including forecasted operating earnings, available tax planning strategies and\nthe time period over which the temporary differences will reverse. We review our tax positions on a regular basis and adjust the balances as new information becomes available. The effective tax rates for both the three and nine months ended July 31, 2025 were 21.0% and 19.7%, respectively, compared to 21.5% and 21.1%, respectively, for the same periods in 2024. Excluding a discrete tax impact related to the divestiture and related charges taken in the third quarter of 2025, the effective tax rates for the three and nine months ended July 31, 2025 were 19.4% and 19.2%, respectively. The effective tax rate for the nine months ended July 31, 2025 is lower than the U.S. tax rate of 21% primarily due to the foreign-derived intangible income deduction.\nNet income was $125,784, or $2.22 per diluted share, for the three months ended July 31, 2025, compared to net income of $117,327, or $2.04 per diluted share, in the same period of 2024. This represented a 7.2 percent increase in net income and a 8.8 percent increase in diluted earnings per share. The increase in net income and increase of $0.18 per diluted share was primarily driven by higher operating profit, partially offset by higher interest expense due to prior year's acquisitions and the divestiture and related charges associated with exiting the medical contract manufacturing business.\nNet income was $332,840, or $5.83 per diluted share, for the nine months ended July 31, 2025, compared to net income of $345,116, or $5.99 per diluted share, in the same period of 2024. This represented a 3.6 percent decrease in net income and a 2.7 percent decrease in diluted earnings per share. The decrease in net income and decrease of $0.16 per diluted share was primarily driven by higher interest expense due to prior year's acquisition and the divestiture and related charges associated with exiting the medical contract manufacturing business.\nForeign Currency Effects\nIt is not possible to precisely measure the impact on operating results arising from foreign currency exchange rate changes, because of changes in selling prices, sales volume, product mix and cost structure in each country in which we operate. However, if transactions for the three months ended July 31, 2025 were translated at exchange rates in effect during the same period of 2024, we estimated that sales would have been approximately $13,000 lower while costs of sales and selling and administrative expenses would have been approximately $8,000 lower. If transactions for the nine months ended July 31, 2025 were translated at exchange rates in effect during the same period of 2024, we estimated that sales would have been approximately $3,000 higher while costs of sales and selling and administrative expenses would have been approximately $500 lower.\nChanges in trade policies, tariffs, and other import/export regulations of the U.S. and other nations did not have a material impact on our financial results for the nine months ended July 31, 2025. However, the Company does have sales and purchases that could be negatively impacted by recent tariff actions. The Company continues to actively work to minimize the impact of these changes and mitigate risk.\nLiquidity and Capital Resources\nCash and cash equivalents increased $31,836 during the nine months ended July 31, 2025. Approximately 82 percent of our consolidated cash and cash equivalents were held at various foreign subsidiaries as of July 31, 2025.\nA comparison of cash flow changes for the nine months ended July 31, 2025 to the nine months ended July 31, 2024 is as follows:\nNet Income and non-cash items\n\nITEM 2. MANAGEMENT’S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS\nNordson is an innovative precision technology company that leverages a scalable growth framework expected to deliver top tier growth with leading margins and returns. We engineer, manufacture and market differentiated products and systems used for precision dispensing, applying and controlling of adhesives, coatings, polymers, sealants, biomaterials, and other fluids, to test and inspect for quality, and to treat and cure surfaces and various medical products such as: catheters, cannulas, medical balloons and medical tubing. These products are supported with extensive application expertise and direct global sales and service. We serve a wide variety of consumer non-durable, consumer durable and technology end markets including packaging, electronics, medical, appliances, energy, transportation, precision agriculture, building and construction, and general product assembly and finishing.\nOur strategy for long-term growth is based on solving customers’ needs globally. We were incorporated in the State of Ohio in 1954 and are headquartered in Westlake, Ohio. Our products are marketed through a network of direct operations in more than 35 countries.\nAs of July 31, 2025, we had approximately 7,700 employees worldwide. We have principal manufacturing operations and sources of supply in the United States in Ohio, Georgia, California, Colorado, Connecticut, Illinois, Michigan, Minnesota, Pennsylvania, Rhode Island, Tennessee, Florida, Texas, Alabama, South Carolina and Wisconsin; as well as in the People’s Republic of China, Germany, Ireland, India, Israel, Italy, Mexico, the Netherlands and the United Kingdom.\nCritical Accounting Policies and Estimates\nResults of Operations\nBelow is a detailed comparison of our results of operations for the three and nine months ended July 31, 2025 and July 31, 2024.\nConsolidated Financial Results\nConsolidated financial results for the three months ended July 31, 2025 and July 31, 2024 were as follows:\n(In thousands except for per-share amounts)\n\nPurchase of treasury shares\nNet cash used in financing activities\nAdditions to property, plant and equipment were largely driven by productivity and growth projects, including a new manufacturing facility.\nWe have a $1,150,000 unsecured multi-currency credit facility with a group of banks that provides for a term loan facility in the aggregate principal amount of $300,000, maturing in June 2026, and a multicurrency revolving credit facility in the aggregate principal amount of $850,000, maturing in June 2028. At July 31, 2025, we had $280,000 outstanding on the term loan facility and $243,000 outstanding on the revolving credit facility.\nOur operating performance, balance sheet position and financial ratios for nine months ended July 31, 2025 remained strong. The Company is well-positioned to manage liquidity needs that arise from working capital requirements, capital expenditures and contributions related to pension and postretirement obligations, as well as principal and interest payments on our outstanding debt. Our primary sources of capital to meet these needs, as well as other opportunistic investments, are a combination of cash on hand, which was $147,788 as of July 31, 2025, cash provided by operations, which was $516,264 for the nine months ended July 31, 2025, and available borrowings under our loan agreements and unused bank lines of credit, which totaled $824,120 as of July 31, 2025. Cash from operations, which, when combined with our available borrowing capacity and ready access to capital markets, is expected to be more than adequate to fund our liquidity needs over the twelve months and the foreseeable future thereafter. The Company believes it has the ability to generate and obtain adequate amounts of cash to meet its long-term needs for cash. However, the impact of changes in trade policies, tariffs, and other import/export regulations of the U.S. and other nations could negatively impact our cash flow from operations and liquidity in future periods.\nSafe Harbor Statements Under the Private Securities Litigation Reform Act of 1995\nIn light of these risks and uncertainties, actual events and results may vary significantly from those included in or contemplated or implied by such forward-looking statements. Readers are cautioned not to place undue reliance on such forward-looking statements. These forward-looking statements speak only as of the date made. We undertake no obligation to publicly update or revise any forward-looking statements, whether as a result of new information, future events or otherwise, except as required by law.\n\nThe IPS organic sales decrease of 2.0 percent was driven by weaker systems demand in polymer processing partially offset by broad based growth in most other product lines. MFS organic sales decreased 0.4 percent inclusive of the contract manufacturing business that is held for sale. Excluding the pending divestiture in both periods, organic sales increased 4 percent driven by medical fluid components and fluid solutions product lines. The inorganic growth of MFS is due to the acquisition of Atrion. The ATS organic sales increase of 14.6 percent was driven by robust growth in electronics dispense product lines, offset by weakness in x-ray inspections systems.\nNine Months Ended July 31, 2025\nThe IPS organic sales decrease of 5.7 percent was driven primarily by weaker systems demand in polymer processing and industrial coatings product lines, which was partially offset by broad based growth in most other product lines. MFS organic sales decreased 7.1 percent inclusive of the contract manufacturi"
}