{
  "source_file": "nee-20241231.htm",
  "form_type": "10-K",
  "item1_clean": "NEER provides commodities-related products to customers, engages in energy-related commodity marketing and trading activities and includes the operations of a retail electricity provider and ownership interests in natural gas and oil shale formations located primarily in the South region of the U.S. Through NextEra Energy Resources' subsidiary, NextEra Energy Marketing, LLC, NEER:\nmanages risk associated with fluctuating commodity prices and optimizes the value of NEER's power generation and natural gas and oil production assets through the use of swaps, options, futures and forwards;\nsells output from NEER's plants that is not sold under long-term contracts and procures fuel for use by NEER's generation fleet;\nprovides full energy and capacity requirements to customers; and\nmarkets and trades energy-related commodity products, including power and fuel, as well as marketing and trading services to customers.\nMARKETS AND COMPETITION\nElectricity markets in the U.S. and Canada are regional and diverse in character. All are extensively regulated, and competition in these markets is shaped and constrained by regulation. The nature of the products offered varies based on the specifics of regulation in each region. Generally, in addition to the natural constraints on pricing freedom presented by competition, NEER may also face specific constraints in the form of price caps, or maximum allowed prices, for certain products. NEER's ability to sell the output of its generation facilities may also be constrained by available transmission capacity, which can vary from time to time and can have a significant impact on pricing.\nThe degree and nature of competition is different in wholesale markets than in retail markets. A majority of NEER's revenues are derived from sales of energy, capacity, credits and ancillary products under long-term PPAs to customers located in wholesale electricity markets. Wholesale power generation is a capital-intensive, commodity-driven business with numerous industry participants. NEER primarily competes on the basis of price, but believes the green attributes of NEER's generation assets, its track record of completing projects on schedule, its creditworthiness and its ability to offer and manage reliable customized risk solutions to wholesale customers are competitive advantages. Wholesale power generation is a regional business that is highly fragmented relative to many other commodity industries and diverse in terms of industry structure. As such, there is a wide variation in terms of the capabilities, resources, nature and identity of the companies NEER competes with depending on the market. In wholesale markets, customers' needs are met through a variety of means, including long-term bilateral contracts, standardized bilateral products such as full requirements service and customized supply and risk management services.\nIn general, U.S. and Canadian electricity markets encompass three classes of services: energy and related energy credits, capacity and ancillary services. Energy services relate to the physical delivery of power; capacity services relate to the availability of MW capacity of a power generation asset; and ancillary services are other services that relate to power generation assets, such as load regulation and spinning and non-spinning reserves. The exact nature of these classes of services is defined in part by regional tariffs. Not all regions have a capacity services class, and the specific definitions of ancillary services vary from region to region.\nRTOs and ISOs exist throughout much of North America to coordinate generation and transmission across wide geographic areas and to run markets. NEER operates in all RTO and ISO jurisdictions. At December 31, 2024, NEER also had generation facilities with a total net generating capacity of approximately 9,196 MW that fall within reliability regions that are not under the jurisdiction of an established RTO or ISO, including 5,806 MW within the Western Electricity Coordinating Council and 2,909 MW within the SERC Reliability Corporation. Although each RTO and ISO may have differing objectives and structures, some benefits of these entities include regional planning, managing transmission congestion, developing larger wholesale markets for energy and capacity, maintaining reliability and facilitating competition among wholesale electricity providers.\nNEER has operations that fall within the following RTOs and ISOs\nNEER competes in different regions to differing degrees, but in general it seeks to enter into long-term bilateral contracts for the full output of its generation facilities. At December 31, 2024, approximately 94% of NEER's net generating capacity was committed under long-term contracts. Where long-term contracts are not in effect, NEER sells the output of its facilities into daily spot markets. In such cases, NEER will frequently enter into shorter term bilateral contracts, typically of less than three years duration, to hedge the price risk associated with selling into a daily spot market. Such bilateral contracts, which may be hedges either for physical delivery or for financial (pricing) offset, serve to protect a portion of the revenue that NEER expects to derive from the associated generation facility. Contracts that serve the economic purpose of hedging some portion of the expected revenue of a generation facility but are not recorded as hedges under GAAP are referred to as “non-qualifying hedges” for adjusted earnings purposes. See Management's Discussion – Overview – Adjusted Earnings.\nCertain facilities within the NEER wind and solar generation portfolio produce RECs and other environmental attributes which are typically sold along with the energy from the plants under long-term contracts, or may be sold separately from wind and solar generation not sold under long-term contracts. The purchasing party is solely entitled to the reporting rights and ownership of the environmental attributes.\nWhile the majority of NEER's revenue is derived from the output of its generation facilities, NEER is also an active competitor in several regions in the wholesale full requirements business and in providing structured and customized power and fuel products and services to a variety of customers. In the full requirements service, typically, the supplier agrees to meet the customer's needs for a full range of products for every hour of the day, at a fixed price, for a predetermined period of time, thereby assuming the risk of fluctuations in the customer's volume requirements.\nExpanded competition in a frequently changing regulatory environment presents both opportunities and risks for NEER. Opportunities exist for the selective acquisition of generation assets and for the construction and operation of efficient facilities\nthat can sell power in competitive markets. NEER seeks to reduce its market risk by having a diversified portfolio by fuel type and location, as well as by contracting for the future sale of a significant amount of the electricity output of its facilities.\nNEER REGULATION\nThe energy markets in which NEER operates are subject to domestic and foreign regulation, as the case may be, including local, state and federal regulation, and other specific rules.\nAt December 31, 2024\n, essentially all of NEER's generation facilities\nlocated in the U.S. have received exempt wholesale generator status as defined under the Public Utility Holding Company Act of 2005. Exempt wholesale generators own or operate a facility exclusively to sell electricity to wholesale customers. They are barred from selling electricity directly to retail customers. While projects with exempt wholesale generator status are exempt from various restrictions, each project must still comply with other federal, state and local laws, including, but not limited to, those regarding siting, construction, operation, licensing, pollution abatement and other environmental laws.\nAdditionally, most of the NEER facilities located in the U.S. are subject to FERC regulations and market rules and the NERC's mandatory reliability standards. All of NEER's facilities are subject to environmental laws and the EPA's environmental regulations, and its nuclear facilities are also subject to the jurisdiction of the NRC. See FPL – FPL Regulation for additional discussion of FERC, NERC, NRC and EPA regulations. Rates of NEER's rate-regulated transmission businesses are set by regulatory bodies as noted in Clean Energy and Other Operations – Other Operations – Rate-Regulated Transmission. With the exception of facilities located in ERCOT, the FERC has jurisdiction over various aspects of NEER's business in the continental U.S., including the oversight and investigation of competitive wholesale energy markets, regulation of the transmission and sale of natural gas, and oversight of environmental matters related to natural gas projects and major electricity policy initiatives. The PUCT has jurisdiction, including the regulation of rates and services, oversight of competitive markets, and enforcement of statutes and rules, over NEER facilities located in ERCOT. In addition, certain of NEER's sales to retail customers are subject to consumer protection laws and other regulations related to consumer activities.\nCertain entities within the NEER segment and their affiliates are also subject to federal and provincial or regional regulations in Canada related to energy operations, energy markets and environmental standards. In Canada, activities related to owning and operating wind and solar projects and participating in wholesale and retail energy markets are regulated at the provincial level. In Ontario, for example, electric generation facilities must be licensed by the OEB and may also be required to complete registrations and maintain market participant status with the IESO, in which case they must agree to be bound by and comply with the provisions of the market rules for the Ontario electricity market as well as the mandatory reliability standards of the NERC.\nIn addition, NEER is subject to environmental laws and regulations as described in the NEE Environmental Matters section below. In order to better anticipate potential regulatory changes, NEER continues to actively monitor and participate in regional market stakeholder processes and other forums where changes to existing rules for the interconnection of renewable energy resources and the purchase and sale of energy commodities are under consideration.\nIn addition to regulation associated with operating assets, the development of energy infrastructure also involves additional and often extensive approvals and permitting requirements at the local, state and federal levels for items such as disturbing wetlands, obtaining no hazard determinations from the Federal Aviation Administration, interacting with wildlife, making wholesale sales of electricity, and other clearances. These requirements may change from time to time. For example, a federal executive order was issued in January 2025 that calls for a pause in federal land leasing, permitting and approvals for wind development facilities pending completion of a review of the federal rules providing for leasing, permitting and approvals for wind projects. This or similar initiatives could limit NEER’s and FPL's ability to obtain or renew necessary approvals, rights-of-way, permits, leases or loans for wind or other energy projects.\nNEER HUMAN CAPITAL\nNEER had approximately 7,400 employees at December 31, 2024. NEER has collective bargaining agreements with the IBEW, the Utility Workers Union of Amer\nica and the Security Police and Fire Professionals of America, which collectively repr\nesent approximately 6% of NEER's employees. The collective bargaining agreements have approximately\nthree-to-four-year terms and expire between September 2025 and October 2028.\nNEE ENVIRONMENTAL MATTERS\nNEE and its subsidiaries, including FPL, are sub",
  "item7_clean": "Item 7. Management's Discussion and Analysis of Financial Condition and Results of Operations\nMISO\nMidcontinent Independent System Operator\nOne million British thermal units\nmortgage and deed of trust dated as of January 1, 1944, from FPL to Deutsche Bank Trust Company Americas, as supplemented and amended\nMW\nNEE\nNextEra Energy, Inc.\nNEECH\nNextEra Energy Capital Holdings, Inc.\nNEER\nan operating segment comprised of NextEra Energy Resources and NEET\nNEET\nNextEra Energy Transmission, LLC\nNERC\nNorth American Electric Reliability Corporation\nnet ownership interest in pipeline(s) capacity\nnet generating capacity\nnet ownership interest in plant(s) capacity\nnet ownership interest in plant(s) generation\nNote __ to consolidated financial statements\nNextEra Energy Resources\nNextEra Energy Resources, LLC\nNRC\nU.S. Nuclear Regulatory Commission\nNYISO\nNew York Independent System Operator\nother operations and maintenance expenses in the consolidated statements of income\nOEB\nOntario Energy Board\nOTC\nOTTI\nother than temporary impairment or other than temporarily impaired\nPJM\nPJM Interconnection, LLC\nPoint Beach Nuclear Power Plant\nPPA\npurchased power agreement(s)\nPTC\nproduction tax credit\nPUCT\nPublic Utility Commission of Texas\nrenewable energy tax credits\nproduction tax credits and investment tax credits collectively\nreturn on common equity as determined for regulatory purposes\nRPS\nrenewable portfolio standards\nRTO\nregional transmission organization\nSEC\nstorm protection plan\nstorm protection plan cost recovery clause, as established by the FPSC\nXPLR\nXPLR Infrastructure, LP (formerly known as NextEra Energy Partners, LP)\nXPLR Infrastructure Operating Partners, LP (formerly known as NextEra Energy Operating Partners, LP)\nU.S.\nUnited States of America\nNEE, FPL, NEECH, NextEra Energy Resources and NEET each has subsidiaries and affiliates with names that may include NextEra Energy, FPL, NextEra Energy Resources, NextEra Energy Transmission, NextEra, FPL Group, FPL Energy, FPLE and similar references. For convenience and simplicity, in this report the terms NEE, FPL, NEECH, NextEra Energy Resources, NEET and NEER are sometimes used as abbreviated references to specific subsidiaries, affiliates or groups of subsidiaries or affiliates. The precise meaning depends on the context.\nForward-Looking Statements\nPART I\nUnresolved Staff Comments\nMine Safety Disclosures\nPART II\nMarket for Registrants' Common Equity, Related Stockholder Matters and Issuer Purchases of Equity Securities\nR\nManagement's Discussion and Analysis of Financial Condition and Results of Operations",
  "item2_clean": null
}