{
  "source_file": "nem-20250930.htm",
  "form_type": "10-Q",
  "item1_clean": null,
  "item7_clean": null,
  "item2_clean": "ITEM 2. MANAGEMENT’S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS.\n(dollars in millions, except per share, per ounce and per pound amounts, unless otherwise noted)\nThe following Management’s Discussion and Analysis of Consolidated Financial Condition and Results of Operations (“MD&A”) provides information that management believes is relevant to an assessment and understanding of the consolidated financial condition and results of operations of Newmont Corporation, a Delaware corporation, and its subsidiaries (collectively, “Newmont,” the “Company,” “our” and “we”). Please refer to Non-GAAP Financial Measures, below, for the non-GAAP financial measures used in this MD&A by the Company.\nNewmont is the world’s leading gold company and is the only gold company included in the S&P 500 Index and the Fortune 500 list of companies. We have been included in the Dow Jones Sustainability Index-World since 2007 and have adopted the World Gold Council’s Conflict-Free Gold Policy. In September 2025, Newmont continued to be the top mining company in TIME's listing of the world's most sustainable companies. Since 2015, Newmont has been ranked as one of the mining and metal sector's top gold miners by the S&P Global Corporate Sustainability Assessment. Newmont was ranked the top miner in 3BL Media’s 100 Best Corporate Citizens list which ranks the 1,000 largest publicly traded U.S. companies on ESG transparency and performance. We are primarily engaged in the exploration for and acquisition of gold properties, some of which may contain copper, silver, lead, zinc or other metals. We have significant operations and/or assets in the U.S., Canada, Mexico, Dominican Republic, Peru, Suriname, Argentina, Chile, Australia, Papua New Guinea, Ecuador, and Ghana. Our goal is to create value and improve lives through sustainable and responsible mining.\nRefer to the Consolidated Financial Results, Results of Consolidated Operations, Liquidity and Capital Resources and non-GAAP Financial Measures for information about the continued impacts from inflationary pressures, effects of certain countermeasures taken by central banks, and supply chain disruptions, with particular consideration on the outlook for increased costs specific to labor, materials, consumables and fuel and energy on operations, as well as impacts on the timing and cost of capital expenditures and the risk of potential impairment to certain assets. Refer to discussion of Risk and Uncertainties within Note 2 to the Condensed Consolidated Financial Statements for further information.\nDivestiture of Non-Core Assets\nBased on a comprehensive review of the Company’s portfolio of assets following the Newcrest acquisition, the Company’s Board of Directors approved a portfolio optimization program to divest six non-core assets and a development project in February 2024. The non-core assets to be divested included CC&V, Musselwhite, Porcupine, Éléonore, Telfer, Akyem, and the Coffee development project in Canada and were presented as held for sale in the first quarter of 2024.\nThe Company completed the sale of the assets of the Telfer reportable segment in the fourth quarter of 2024, the sale of the CC&V, Musselwhite, and Éléonore reportable segments in the first quarter of 2025, and the sale of the Porcupine and Akyem reportable segments in the second quarter of 2025. In the third quarter of 2025, the Company entered into a definitive agreement to sell the Coffee development project, which closed in the fourth quarter of 2025 and remained designated as held for sale at September 30, 2025.\nAssets classified as held for sale are recorded at the lower of the carrying value or fair value, less costs to sell and are periodically valued until sale occurs with any resulting gain or loss recognized in\n(Gain) loss on sale of assets held for sale\n. Additionally, gains or losses recognized on the completion of the sale are recognized in\n(Gain) loss on sale of assets held for sale\nAs a result, for the three months ended September 30, 2025 a gain of $99 was recognized within\n(Gain) loss on sale of assets held for sale,\nprimarily resulting from a partial reversal of a prior period write-down on assets held for sale. For the nine months ended September 30, 2025, a gain of $1,074 was recognized within\n(Gain) loss on sale of assets held for sale,\n\nOur Merian mine is located in Suriname and is a USD functional currency entity. In 2021, the Central Bank took steps to stabilize the local currency, while the government introduced new legislation to narrow the gap between government revenues and spending. The measures to increase government revenue mainly consist of tax increases; however, Newmont and the Republic of Suriname have a Mineral Agreement in place that supersedes such measures. The Central Bank of Suriname adopted a controlled floating rate system, which resulted in a concurrent devaluation of the Surinamese dollar. The majority of Merian’s activity has historically been denominated in USD; as a result, the devaluation of the Surinamese dollar has resulted in an immaterial impact on our financial statements. Therefore, future devaluation of the Surinamese dollar is not expected to have a material impact on our financial statements.\nLiquidity and Capital Resources\nWe have a disciplined capital allocation strategy of maintaining financial flexibility to execute our capital priorities and generate long-term value for our stockholders. Consistent with that strategy, we aim to self-fund development projects and make strategic partnerships focused on profitable growth, while reducing our debt and returning cash to stockholders through dividends and share repurchases.\nThe Company continues to experience the impacts from geopolitical and macroeconomic pressures. With the resulting volatile environment, we continue to monitor inflationary conditions, the effects of certain countermeasures taken by central banks, and the potential for further supply chain disruptions, as well as an uncertain and evolving labor market and trade environment including tariff and regulatory changes. Depending on the duration and extent of the impact of these events, or changes in commodity prices, the prices for gold and other metals, and foreign exchange rates, we could continue to experience volatility; transportation industry disruptions could occur, including limitations on shipping produced metals; our supply chain could continue to experience disruption; cost inflation rates could further increase; or we could incur credit related losses of certain financial assets, which could materially impact our results of operations, cash flows and financial condition.\nAs of September 30, 2025, we believe our available liquidity allows us to manage the short- and, possibly, long-term material adverse impacts of these events on our business. Refer to Note 2 to the Condensed Consolidated Financial Statements for further discussion on risks and uncertainties.\nAt September 30, 2025, the Company had $5,639 of\nCash and cash equivalents.\nThe majority of our cash and cash equivalents are invested in a variety of highly liquid and low-risk investments with original maturities of three months or less that are available to fund our operations as necessary. We may have investments in prime money market funds that are classified as cash and cash equivalents; however, we continually monitor the need for reclassification under the SEC requirements for money market funds, and the potential that the shares of such funds could have a net asset value of less than their par value. We believe that our liquidity and capital resources are adequate to fund our operations and corporate activities.\nAt September 30, 2025, $1,761 of\nCash and cash equivalents\nwas held in foreign subsidiaries and is primarily held in USD-denominated accounts with the remainder in foreign currencies readily convertible to USD.\nCash and cash equivalents\ndenominated in Argentine peso are subject to regulatory restrictions. Refer to Foreign Currency Exchange Rates above for further information. At September 30, 2025, $1,493 in consolidated cash and cash equivalents was held at certain foreign subsidiaries that, if repatriated, may be subject to withholding taxes. We expect that there would be no additional tax burden upon repatriation after considering the cash cost associated with any potential withholding taxes.\nWe believe our existing consolidated\nCash and cash equivalents\n, available capacity on our revolving credit facility, and cash generated from continuing operations will be adequate to satisfy working capital needs, fund future growth, meet debt obligations and meet other liquidity requirements for the foreseeable future. At September 30, 2025, our borrowing capacity on our revolving credit facility was $4,000 and we had no borrowings outstanding. We continue to remain compliant with covenants and do not currently anticipate any events or circumstances that would impact our ability to access funds available on this facility. Refer to Note 15 to the Condensed Consolidated Financial Statements for further information on our\nOur financial position was as follows:\nCash and cash equivalents\nCash and cash equivalents included in assets held for sale\nAvailable borrowing capacity on revolving credit facilities\n____________________________\nDuring the first quarter of 2024, certain non-core assets were determined to meet the criteria for assets held for sale. As a result, the related\nCash and cash equivalents\nAssets held for sale\n. At September 30, 2025, no amounts relating to\nCash and cash equivalents\n\nForeign currency exchange rates can increase or decrease profits to the extent costs are paid in foreign currencies. Approximately 61% and 60% of\nCosts applicable to sales\nwere paid in currencies other than the USD during both the three and nine months ended September 30, 2025, as follows:\nPapua New Guinean Kina\nVariations in the local currency exchange"
}