{
  "source_file": "nflx-20250930.htm",
  "form_type": "10-Q",
  "item1_clean": null,
  "item7_clean": null,
  "item2_clean": "Management’s Discussion and Analysis of Financial Condition and Results of Operations\nForward-Looking Statements\nInvestors and others should note that we announce material financial and other information to our investors using our investor relations website (\n), SEC filings, press releases, public conference calls and webcasts. We use these channels, as well as social media and blogs to communicate with our members and the public about our company, our services and other issues. It is possible that the information we post on social media and blogs could be deemed to be material information. Therefore, we encourage investors, the media, and others interested in our company to review the information we post on the social media channels and blogs listed on our investor relations website.\nWe are one of the world’s leading entertainment services offering TV series, films and games across a wide variety of genres and languages. Members can play, pause and resume watching as much as they want, anytime, anywhere, and can change their plans at any time.\nOur core strategy is to grow our business globally within the parameters of our operating margin target. We strive to continuously improve our members' experience by offering compelling content that delights them and attracts new members. We aim to offer a range of pricing plans, including our ad-supported subscription plan, to meet a variety of consumer needs. We seek to drive conversation around our content to further enhance member joy, and we are continuously enhancing our user interface to help our members more easily choose content that they will find enjoyable.\nResults of Operations\nThe following represents our consolidated performance highlights\n(in thousands, except percentages)\nConstant currency change in revenues\n“Non-GAAP Constant Currency Information”\nsection below for additional details on our use of constant currency revenue.\nOperating margin for the three months ended September 30, 2025 decreased by approximately one percentage point as compared to the prior comparative period. The decrease in operating margin was primarily driven by the growth in cost of revenues and sales and marketing expenses outpacing the growth in revenues, partially offset by a slower rate of growth in technology and development expenses and general and administrative expenses relative to revenue growth.\nr the three months ended September 30, 2025 increased $183 million as compared to the prior comparative period, primarily due to a $339 million increase in operating income, driven by a $1,686 million increase in revenues and partially offset by a $1,044 million increase in cost of revenues primarily due to the increase in other cost of revenues and content amortization. The impact of higher operating income was partially offset by a $223 million increase in the provision for income taxes.\nWe primarily derive revenues from monthly membership fees for services related to streaming content to our members. We offer a variety of streaming membership plans, the price of which varies by country and the features of the plan. As of September 30, 2025, pricing on our plans ranged from the U.S. dollar equivalent of $1 to $35 per month, and pricing on our extra member sub accounts ranged from the U.S. dollar equivalent of $2 to $9 per month. We expect that from time to time the prices of our membership plans in each country may change and we may test other plan and price variations.\nWe also earn revenues from advertisements presented on our streaming service, consumer products, live experiences and various other sources. Revenues earned from sources other than monthly membership fees were not a material component of revenues for the three and nine months ended September 30, 2025 and September 30, 2024.\nThree months ended September 30, 2025 as compared to the three months ended September 30, 2024\n\n(in thousands, except percentages)\nUnited States and Canada (UCAN)\nEurope, Middle East, and Africa (EMEA)\nLatin America (LATAM)\nNon-GAAP Constant Currency Information\nWe believe the non-GAAP financial measure of constant currency revenue is useful in analyzing period-to-period comparisons in revenues absent foreign currency fluctuations. However, this non-GAAP financial measure should be considered in addition to, not as a substitute for, or superior to other financial measures prepared in accordance with GAAP.\nIn order to exclude the effect of foreign currency rate fluctuations on revenue, we calculate current period revenue assuming foreign exchange rates had remained constant with foreign exchange rates from each of the corresponding months of the prior-year period and exclude the impact of hedging gains or losses realized as revenues. Constant currency percentage change in revenues is calculated as the percentage change between current period constant currency revenue and the prior comparative period revenue. The impact of hedging gains or losses is excluded from both the current and prior periods.\nThe tables below summarize constant currency revenues by region for the three and nine months ended September 30, 2025 and the constant currency percentage change in revenues by region for the three and nine months ended September 30, 2025 as compared to the three and nine months ended September 30, 2024:\nConstant Currency Adjustment\nHedging (Gains) Losses Included in Revenues\nConstant Currency Revenues\nHedging (Gains) Losses Included in Revenues\nConstant Currency Change\n(in thousands, except percentages)\nUCAN\nEMEA\nLATAM\nAPAC\nConstant Currency Adjustment\nHedging (Gains) Losses Included in Revenues\nConstant Currency Revenues\nHedging (Gains) Losses Included in Revenues\nConstant Currency Change\n(in thousands, except percentages)\nUCAN\nEMEA\nLATAM\nAPAC\nCost of revenues primarily consists of the amortization of content assets. Other costs of revenues include expenses associated with the acquisition, licensing and production of content, streaming delivery costs, and other operating costs.\nExpenses related to the acquisition, licensing and production of content not included in content amortization may include payroll, stock-based compensation, facilities, and other personnel-related expenses, costs associated with obtaining rights to music included in our content, overall deals with talent, miscellaneous production-related costs and participations and residuals. Streaming delivery costs are primarily related to our global content delivery network (“Open Connect”). We have built our own Open Connect network to help us efficiently stream a high volume of content to our members over the internet. Delivery expenses, therefore, include equipment costs related to Open Connect, payroll and related personnel expenses and all third-party costs, such as cloud computing costs, associated with delivering content over the internet. Other operating costs include customer service and payment processing fees, including those we pay to our integrated payment partners, as well as other costs directly incurred in making our content available to members.\nThree months ended September 30, 2025 as compared to the three months ended September 30, 2024\n(in thousands, except percentages)\nAs a percentage of revenues\nThe increase in cost of revenues was primarily due to an increase in other cost of revenues, driven primarily by the accrual of a loss of $619 million related to non-income tax assessments in Brazil, coupled with a $303 million increase in content amortization relating to our existing and new content. We do not expect that non-income taxes incurred in Brazil will materially impact our results of operations in future periods. See Note 8\nCommitments and Contingencies\nin the accompanying notes to our consolidated financial statements for further detail on our non-income tax matters.\nNine months ended September 30, 2025 as compared to the nine months ended September 30, 2024\n(in thousands, except percentages)\nAs a percentage of revenues\nThe increase in cost of revenues was primarily due to an increase in other cost of revenues, driven primarily by the accrual of a loss of $619 million related to non-income tax assessments in Brazil, coupled with a $518 million increase in content amortization relating to our existing and new content. We do not expect that non-income taxes incurred in Brazil will materially impact our results of operations in future periods. See Note 8\nCommitments and Contingencies\nin the accompanying notes to our consolidated financial statements for further detail on our non-income tax matters.\nSales and marketing expenses consist primarily of expenses for promotional activities such as digital and television advertising, and certain payments made to marketing and advertising sales partners. Our marketing partners include consumer electronics manufacturers, multichannel video programming distributors, mobile operators, and internet service providers. Our advertising sales partners include advertising technology providers and advertising agencies. Sales and marketing expenses also include payroll, stock-based compensation, facilities, and other related expenses for personnel that support advertising sales and marketing activities.\nThree months ended September 30, 2025 as compared to the three months ended September 30, 2024\n(in thousands, except percentages)\nAs a percentage of revenues\nThe increase in sales and marketing expenses was primarily driven by a $104 million increase in marketing expenses, coupled with a $41 million increase in personnel-related costs due to the growth in advertising sales headcount.\nNine months ended September 30, 2025 as compared to the nine months ended September 30, 2024\n(in thousands, except percentages)\nAs a percentage of revenues\nThe increase in sales and marketing expenses was primarily driven by a $114 million increase in personnel-related costs due to the growth in advertising sales headcount, coupled with a $98 million increase in other marketing expenses, and a $44 million"
}