{
  "source_file": "nke-20250531.htm",
  "form_type": "10-K",
  "item1_clean": "ITEM 1. BUSINESS\nGENERAL\nOur principal business activity is the design, development and worldwide marketing and selling of athletic footwear, apparel, equipment, accessories and services. NIKE is the largest seller of athletic footwear and apparel in the world. We sell our products through NIKE Direct operations, which are comprised of both NIKE-owned retail stores and sales through our digital platforms (also referred to as \"NIKE Brand Digital\") and to wholesale accounts, which include a mix of independent distributors, licensees and sales representatives in nearly all countries around the world. We also offer interactive consumer services and experiences. Nearly all of our products are manufactured by independent contractors. Nearly all footwear and apparel products are manufactured outside the United States, while equipment products are manufactured both in the United States and abroad.\nAll references to fiscal 2025, 2024 and 2023 are to NIKE, Inc.'s fiscal years ended May 31, 2025, 2024 and 2023, respectively. Any references to other fiscal years refer to a fiscal year ending on May 31 of that year.\nPRODUCTS\nWe offer our products under the NIKE, Jordan and Converse brands. Our strategy is to achieve sustainable, profitable long-term growth by leading with sport, creating innovative, “must-have” products, building deep personal consumer connections with our brands and delivering compelling consumer experiences through digital platforms and at retail. We believe this approach will allow us to create products that better meet individual consumer needs while accelerating our largest growth opportunities.\nNIKE's athletic footwear products are designed primarily for specific athletic use, although a large percentage of the products are worn for casual or leisure purposes. We place considerable emphasis on innovation and high-quality construction in the development and manufacturing of our products.\nWe also sell sports apparel, which features the same trademarks and are sold predominantly through the same marketing and distribution channels as athletic footwear. Our sports apparel, similar to our athletic footwear products, is designed primarily for athletic use, although many of the products are worn for casual or leisure purposes, and demonstrates our commitment to innovation and high-quality construction. We often market footwear, apparel and accessories in \"collections\" of similar use. We also market apparel with licensed college and professional team and league logos.\nWe sell a line of performance equipment and accessories under the NIKE Brand name, including bags, socks, sport balls, eyewear, timepieces, digital devices, bats, gloves, protective equipment and other equipment designed for sports activities. We also sell small amounts of various plastic products to other manufacturers through our wholly-owned subsidiary, doing business as Air Manufacturing Innovation.\nOur Jordan Brand designs, distributes and licenses athletic and casual footwear, apparel and accessories predominantly focused on sport performance and streetwear using the Jumpman trademark. Sales and operating results for Jordan Brand products are reported within the respective NIKE Brand geographic operating segments.\nOur wholly-owned subsidiary brand, Converse, headquartered in Boston, Massachusetts, designs, distributes and licenses casual sneakers, apparel and accessories under the Converse, Chuck Taylor, All Star, One Star, Star Chevron and Jack Purcell trademarks. Operating results of the Converse brand are reported on a stand-alone basis.\nIn addition to the products we sell to our wholesale customers and directly to consumers through our NIKE Direct operations, we have also entered into license agreements that permit unaffiliated parties to manufacture and sell, using NIKE-owned trademarks, certain apparel, digital devices and applications and other equipment designed for sports activities.\nWe also offer interactive consumer services and experiences, including sport focused events and activations; fitness and activity apps; sport, fitness and wellness content; and digital services and features in retail stores that enhance the consumer experience.\n\nSALES AND MARKETING\nWe experience moderate fluctuations in aggregate sales volume during the year. Historically, revenues in the first and fourth fiscal quarters have slightly exceeded those in the second and third fiscal quarters. However, the mix of product sales may vary considerably as a result of changes in seasonal and geographic demand for particular types of footwear, apparel and equipment, as well as other macroeconomic, strategic, operating and logistics-related factors.\nBecause NIKE is a consumer products company, the relative popularity and availability of various sports and fitness activities, as well as changing design trends and consumer preferences, affect the demand for our products. We must, therefore, respond to trends and shifts in consumer preferences by adjusting the mix of existing product offerings and channels, developing new products, styles and categories and influencing sports and fitness preferences through extensive marketing. Failure to respond in a timely and adequate manner could have a material adverse effect on our sales and profitability. This is a continuing risk. Refer to Item 1A. Risk Factors.\nOUR MARKETS\nWe report our NIKE Brand operations based on our internal geographic organization. Each NIKE Brand geographic segment operates predominantly in one industry: the design, development, marketing and selling of athletic footwear, apparel and equipment. The Company's reportable operating segments for the NIKE Brand are: North America; Europe, Middle East & Africa (\"EMEA\"); Greater China; and Asia Pacific & Latin America (\"APLA\"), and include results for the NIKE and Jordan brands.\nConverse is also a reportable operating segment and operates predominately in one industry: the design, marketing, licensing and selling of casual sneakers, apparel and accessories. Converse direct to consumer operations, including digital commerce, are reported within the Converse operating segment results.\nUNITED STATES MARKET\nFor fiscal 2025, NIKE Brand and Converse sales in the United States accounted for approximately 43% of total revenues, compared to 42% and 43% for fiscal 2024 and fiscal 2023, respectively. We sell our products to wholesale accounts in the United States, including a mix of footwear stores, sporting goods stores, athletic specialty stores, department stores, skate, tennis and golf shops and other wholesale accounts. In the United States, we utilize NIKE sales offices to solicit such sales. During fiscal 2025, our three largest United States customers accounted for approximately 25% of sales in the United States.\nOur NIKE Direct and Converse direct to consumer operations sell our products to consumers through various digital platforms, as well as through the following number of retail stores in the United States:\nU.S. RETAIL STORES\nNUMBER\nNIKE Brand factory stores\nNIKE Brand in-line stores (including employee-only stores)\nConverse stores (including factory stores)\nTOTAL\n\nof total NIKE Brand apparel, respectively. For fiscal 2025, two apparel contract manufacturers accounted for more than 10% of apparel production, and the top five contract manufacturers in the aggregate accounted for approximately 51% of NIKE Brand apparel production.\nNIKE's contract manufacturers buy raw materials for the manufacturing of our footwear, apparel and equipment products from Tier 2 suppliers. Most raw materials are available and purchased by those contract manufacturers in the countries where manufacturing takes place.\nThe principal materials used in our footwear products are natural and synthetic rubber, plastic compounds, foam cushioning materials, natural and synthetic leather, nylon, polyester and natural fiber textiles, as well as polyurethane films used to make NIKE Air-Sole cushioning components. During fiscal 2025, Air Manufacturing Innovation, a wholly-owned subsidiary, with facilities near Beaverton, Oregon, in Dong Nai Province, Vietnam, and St. Charles, Missouri, as well as contract manufacturers in China and Vietnam, were our suppliers of NIKE Air-Sole and other cushioning components used in footwear.\nThe principal materials used in our apparel products are natural and synthetic fabrics, yarns, trims and threads (both virgin and recycled); specialized performance fabrics designed to efficiently wick moisture away from the body, retain heat and repel rain and/or snow; and plastic and metal hardware.\nFrom time to time, certain materials used in the production of our products experience periods of high demand, shortages and price volatility. In fiscal 2025, contract manufacturers were able to source sufficient quantities of raw materials for use in our footwear and apparel products. Refer to Item 1A. Risk Factors, for additional discussion of the impact of sourcing risks on our business.\nSince 1972, Sojitz Corporation of America (\"Sojitz America\"), a large Japanese trading company and the sole owner of our redeemable preferred stock, has performed import-export financing services for us.\nINTERNATIONAL OPERATIONS AND TRADE\nOur international operations and sources of supply are subject to the usual risks of doing business abroad, such as the implementation of, or potential changes in, foreign and domestic trade policies, increases in import duties, anti-dumping measures, quotas, trade agreement enforcement practices, safeguard measures, trade restrictions, restrictions on the transfer of funds and, in certain parts of the world, political tensions, instability, conflicts, nationalism and terrorism, and resulting sanctions and other measures imposed in response to such issues.\nIn 2025 and in other recent years, uncertain global and regional economic and political conditions have affected international trade and increased protectionist actions around the world. These trends are affecting many global manufacturing and service sectors, and the footwear and apparel industries, as a whole, are not immune. Companies in our industry are facing trade protectionism in many different regions, and, in nearly all cases, we are working together with industry groups to address trade issues and reduce the impact to the industry, while observing applicable competition laws. Notwithstanding our efforts, protectionist measures have resulted in increases in the cost of our products, and additional measures, if implemented, will adversely affect sales and/or profitability for NIKE, as well as the imported footwear and apparel industry as a whole, possibly materially.\nWe monitor protectionist trends and developments throughout the world that may materially impact our industry, and we engage in administrative and judicial processes to mitigate trade restrictions. We are actively monitoring actions that may result in additional anti-dumping measures and could affect our industry. We are also monitoring for other impediments that may limit or delay customs clearance for imports of footwear, apparel and equipment and advocating for trade facilitation. NIKE also advocates for trade liberalization for footwear and apparel in a number of bilateral and multilateral free trade agreements. Changes in, and responses to, U.S. trade policies, including the imposition of tariffs or penalties on imported goods or retaliatory measures by other countries, have negatively affected, and could in the future materially negatively affect, U.S. corporations, including NIKE, with business operations and/or consumer markets in those countries, which could also make it necessary for us to change the way we conduct business, either of which may have an adverse effect on our business, financial condition or our results of operations. In addition, we work with a broad coalition of global businesses and trade associations representing a wide variety of sectors to help support the ",
  "item7_clean": "ITEM 7. MANAGEMENT'S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS\nOVERVIEW\nNIKE designs, develops, markets and sells athletic footwear, apparel, equipment, accessories and services worldwide. We are the largest seller of athletic footwear and apparel in the world. We sell our products through two distribution channels: NIKE Direct operations, which are comprised of both NIKE-owned retail stores and sales through our digital platforms (also referred to as \"NIKE Brand Digital\"), and to wholesale accounts, which include a mix of independent distributors, licensees and sales representatives in nearly all countries around the world. Our goal is to deliver value to our shareholders by building a profitable global portfolio of branded footwear, apparel, equipment and accessories.\nOur strategy is to achieve sustainable, profitable long-term revenue growth by leading with sport, creating innovative, \"must-have\" products, building deep personal consumer connections with our brands and delivering compelling consumer experiences through digital platforms and at retail.\nFISCAL 2025 FINANCIAL HIGHLIGHTS\nNIKE, Inc. Revenues for fiscal 2025 were $46.3 billion compared to $51.4 billion for fiscal 2024\nNIKE Direct revenues declined 13% from $21.5 billion in fiscal 2024 to $18.8 billion in fiscal 2025, and represented approximately 42% of total NIKE Brand revenues for fiscal 2025\nNIKE Brand wholesale revenues decreased 7% on a reported basis and 6% on a currency-neutral basis\nGross margin decreased 190 basis points to 42.7%, primarily due to higher discounts, changes in channel mix and higher inventory obsolescence reserves, partially offset by lower product costs\nInventories as of May 31, 2025 were $7.5 billion, flat compared to the prior year\nWe returned $5.3 billion to our shareholders in fiscal 2025 through share repurchases and dividends\nReturn on Invested Capital (\"ROIC\") was 20.2% as of May 31, 2025, compared to 34.9% as of May 31, 2024. ROIC is considered a non-GAAP financial measure, see \"Use of Non-GAAP Financial Measures\" for additional information.\nOur results for fiscal 2025 reflected a decrease in traffic across NIKE Direct and our actions to reduce supply of certain footwear products in the marketplace through increased markdowns across NIKE Direct and discounts and higher sales returns with our wholesale partners, which negatively impacted our Revenues and gross margin.\n\ndecreased 9% on both a reported and currency-neutral basis. The decrease, on a currency-neutral basis, was due to lower revenues in Men's, the Jordan Brand, Women's and Kids'.\nNIKE Brand footwear revenues decreased 11% on a currency-neutral basis. Unit sales of footwear decreased 8%, while lower average selling price (\"ASP\") per pair reduced footwear revenues by approximately 3 percentage points. Lower ASP per pair was primarily due to higher discounts and changes in channel mix, partially offset by strategic pricing actions.\nNIKE Brand apparel revenues decreased 5% on a currency-neutral basis. Unit sales of apparel decreased 5%, while ASP per unit was flat as strategic pricing actions were offset by changes in channel mix and higher discounts.\nNIKE Brand wholesale revenues decreased 7% on a reported basis and 6% on a currency-neutral basis, compared to fiscal 2024. The decrease, on a currency-neutral basis, was driven by lower revenues across all geographies.\nNIKE Direct revenues were $18.8 billion in fiscal 2025 compared to $21.5 billion in fiscal 2024. On a currency-neutral basis, NIKE Direct revenues decreased 12% due to declines in NIKE Brand Digital sales of 20% from $12.1 billion in fiscal 2024 to $9.6 billion in fiscal 2025, while NIKE store sales were flat. Comparable store sales decreased 1%. For additional information regarding comparable store sales, including the definition, see \"Comparable Store Sales\".\nGROSS MARGIN\nFISCAL 2025 COMPARED TO FISCAL 2024\nFor fiscal 2025, our consolidated gross profit decreased 14% to $19,790 million compared to $22,887 million for fiscal 2024. Gross margin decreased 190 basis points to 42.7% for fiscal 2025 compared to 44.6% for fiscal 2024 due to the following:\nLower NIKE Brand ASP (decreasing gross margin approximately 180 basis points), primarily due to higher discounts and changes in channel mix, partially offset by strategic pricing actions;\nHigher other costs (decreasing gross margin approximately 90 basis points), including higher inventory obsolescence reserves;\nLower gross margin from Converse (decreasing gross margin approximately 20 basis points); and\nUnfavorable changes in net foreign currency exchange rates, including hedges (decreasing gross margin approximately 10 basis points).\nThis was partially offset by:\nLower NIKE Brand product costs (increasing gross margin approximately 80 basis points);\nLower warehousing and logistics costs (increasing gross margin approximately 20 basis points); and\nRestructuring charges in the prior year (increasing gross margin approximately 10 basis points).\nTOTAL SELLING AND ADMINISTRATIVE EXPENSE\n(Dollars in millions)\nFISCAL 2025\nFISCAL 2024\n% CHANGE\nFISCAL 2023\n% CHANGE\nDemand creation expense\nOperating overhead expense\nTotal selling and administrative expense\nDemand creation expense consists of brand marketing expense and sports marketing expense. Brand marketing expense includes advertising and promotion costs such as production and media costs, digital marketing expense, brand events and retail brand presentation costs. Sports marketing expense includes expenses related to endorsement contracts, complimentary product and sports marketing events.\nOperating overhead expense consists primarily of wage and benefit-related expenses and other administrative expenses, such as research and development costs, bad debt expense, rent, depreciation and amortization and costs related to professional services, certain technology investments, meetings and travel.\nFISCAL 2025 COMPARED TO FISCAL 2024\nDemand creation expense increased 9%, due to higher brand marketing expense, reflecting investment in key sports events, and higher sports marketing expense. Changes in foreign currency exchange rates did not have a material impact on Demand creation expense.\nOperating overhead expense decreased 7%, due to restructuring charges in the prior year, lower wage-related expenses and lower other administrative costs. Changes in foreign currency exchange rates did not have a material impact on Operating overhead expense.\n\nFISCAL 2025 COMPARED TO FISCAL 2024\nNorth America revenues decreased 8% on a currency-neutral basis primarily due to lower revenues in the Jordan Brand, Men's and Women's. Wholesale revenues decreased 5%. NIKE Direct revenues decreased 12% due to declines in digital sales of 19% and store sales of 1%. Comparable store sales decreased 1%.\nFootwear revenues decreased 13% on a currency-neutral basis. Unit sales of footwear decreased 10%, while lower ASP per pair reduced footwear revenues by approximately 3 percentage points. Lower ASP per pair was primarily due to higher discounts and changes in channel mix, partially offset by product mix.\nApparel revenues decreased 2% on a currency-neutral basis. Unit sales of apparel decreased 1%, while lower ASP per unit reduced apparel revenues by approximately 1 percentage point. Lower ASP per unit was primarily due to higher discounts and changes in channel mix, partially offset by product mix.\nReported EBIT decreased 19% reflecting lower revenues and the following:\nGross margin contraction of 90 basis points primarily due to lower ASP and higher inventory obsolescence reserves, partially offset by lower product costs. Lower ASP primarily reflects higher discounts and changes in channel mix.\nDemand creation expense increased 9% primarily due to higher brand marketing expense, reflecting investment in key sports events.\nOperating overhead expense decreased 2% due to lower wage-related expenses and lower other administrative costs.\nEUROPE, MIDDLE EAST & AFRICA\n(Dollars in millions)\nFISCAL 2025\nFISCAL 2024\n% CHANGE\n% CHANGE EXCLUDING CURRENCY CHANGES\nFISCAL 2023\n% CHANGE\n% CHANGE EXCLUDING CURRENCY CHANGES\nTOTAL REVENUES\n\nEMEA revenues decreased 10% on a currency-neutral basis due to lower revenues in Men's, the Jordan Brand, Kids' and Women's. Wholesale revenues decreased 6%. NIKE Direct revenues decreased 16% due to a decline in digital sales of 30%, partially offset by an increase in store sales of 5%. Comparable store sales increased 5%.\nFootwear revenues decreased 10% on a currency-neutral basis. Unit sales of footwear decreased 8%, while lower ASP per pair reduced footwear revenues by approximately 2 percentage points. Lower ASP per pair was primarily due to changes in channel mix and higher discounts, partially offset by strategic pricing actions and product mix.\nApparel revenues decreased 9% on a currency-neutral basis. Unit sales of apparel decreased 6%, while lower ASP per unit reduced apparel revenues by approximately 3 percentage points. Lower ASP per unit was primarily due to changes in channel mix, product mix and higher discounts.\nReported EBIT decreased 24% reflecting lower revenues and the following:\nGross margin contraction of 100 basis points primarily due to lower ASP, partially offset by lower warehousing, logistics and product costs. Lower ASP primarily reflects changes in channel mix and higher discounts, partially offset by strategic pricing actions.\nDemand creation expense increased 10% primarily due to higher brand marketing expense, reflecting investment in key sports events, and higher sports marketing expense.\nOperating overhead expense decreased 3% primarily due to lower wage-related expenses.\n\nGreater China revenues decreased 12% on a currency-neutral basis due to lower revenues in Men's, the Jordan Brand, Women's and Kids'. Wholesale revenues decreased 13%. NIKE Direct revenues decreased 12% due to declines in digital sales of 22% and store sales of 6%. Comparable store sales decreased 7%.\nFootwear revenues decreased 13% on a currency-neutral basis. Unit sales of footwear decreased 11%, while lower ASP per pair reduced footwear revenues by approximately 2 percentage points. Lower ASP per pair was primarily due to higher discounts and changes in channel mix, partially offset by strategic pricing actions.\nApparel revenues decreased 12% on a currency-neutral basis. Unit sales of apparel decreased 17%, while higher ASP per unit contributed approximately 5 percentage points of apparel revenue growth. Higher ASP per unit was primarily due to strategic pricing actions, partially offset by higher discounts.\nReported EBIT decreased 31% reflecting lower revenues and the following:\nGross margin contraction of approximately 420 basis points, primarily due to unfavorable changes in standard foreign currency exchange rates and higher inventory obsolescence reserves, partially offset by higher ASP. Higher ASP primarily reflects strategic pricing actions, partially offset by higher discounts.\nDemand creation expense increased 2% primarily due to higher sports marketing expense and higher brand marketing expense.\nOperating overhead expense decreased 5% primarily due to lower wage-related expenses and lower other administrative costs.\nASIA PACIFIC & LATIN AMERICA\n(Dollars in millions)\nFISCAL 2025\nFISCAL 2024\n% CHANGE\n% CHANGE EXCLUDING CURRENCY CHANGES\nFISCAL 2023\n% CHANGE\n% CHANGE EXCLUDING CURRENCY CHANGES\nTOTAL REVENUES\n\nFISCAL 2025 COMPARED TO FISCAL 2024\nAsia Pacific & Latin America (\"APLA\") revenues decreased 3% on a currency-neutral basis primarily due to lower revenues in Southeast Asia & India and Korea, partially offset by higher revenues in Mexico. Revenues decreased primarily due to lower revenues in the Jordan Brand and Men's. Wholesale revenues decreased 3%. NIKE Direct revenues decreased 3% due to a decline in digital sales of 9%, partially offset by an increase in store sales of 4%. Comparable store sales increased 1%.\nFootwear revenues decreased 4% on a currency-neutral basis. Unit sales of footwear decreased 2%, while lower ASP per pair reduced footwear revenues by approximately 2 percentage points. Lower ASP per pair was primarily due to higher discounts and changes in channel mix.\nApparel revenues decreased 1% on a currency-neutral basis. Unit sales of apparel decreased 3%, while higher ASP per unit contributed approximately 2 percentage points of apparel revenue growth. Higher ASP per unit was primarily due to strategic pricing actions, partially offset by higher discounts.\nReported EBIT decreased 19% reflecting lower revenues and the following:\nGross margin contraction of approximately 190 basis points primarily due to unfavorable changes in standard foreign currency exchange rates, lower ASP and higher warehousing and logistics costs. Lower ASP reflects product mix, higher discounts and changes in channel mix, partially offset by strategic pricing actions.\nDemand creation expense increased 3%, due to higher brand marketing expense and higher sports marketing expense, partially offset by favorable changes in foreign currency exchange rates.\nOperating overhead expense was flat due to higher wage-related expenses and higher other administrative costs, offset by favorable changes in foreign currency exchange rates.\n\n(1) Other revenues consist of territories serviced by third-party licensees who pay royalties to Converse for the use of its registered trademarks and other intellectual property rights. We do not own the Converse trademarks in Japan and accordingly do not earn revenues in Japan.\nFISCAL 2025 COMPARED TO FISCAL 2024\nConverse revenues decreased 18% on a currency-neutral basis driven by revenue declines across all territories. Unit sales decreased 12%, while lower ASP reduced revenues by approximately 6 percentage points. Lower ASP per unit primarily reflects higher discounts in direct to consumer.\nWholesale revenues decreased 20% on a currency-neutral basis, as declines in Western Europe and Asia were partially offset by growth in North America.\nDirect to consumer revenues decreased 17% on a currency-neutral basis due to reduced traffic in all territories and lower ASP due to higher discounts.\nReported EBIT decreased 49% reflecting lower revenues and the following:\nGross margin contraction of approximately 380 basis points due to lower ASP and higher warehousing and logistics costs, partially offset by lower product costs. Lower ASP primarily reflects higher discounts.\nDemand creation expense increased 11% primarily due to higher brand marketing expense.\nOperating overhead expense decreased 11% primarily due to lower wage-related expenses and lower other administrative costs.\nCORPORATE\n(Dollars in millions)\nFISCAL 2025\nFISCAL 2024\n% CHANGE\nFISCAL 2023\n% CHANGE\nDemand creation expense\nOperating overhead expense\nTotal selling and administrative expense\nEARNINGS (LOSS) BEFORE INTEREST AND TAXES\n\nFOREIGN CURRENCY EXPOSURES AND HEDGING PRACTICES\nOVERVIEW\nAs a global company with significant operations outside the United States, in the normal course of business we are exposed to risk arising from changes in currency exchange rates. Our primary foreign currency exposures arise from the recording of transactions denominated in non-functional currencies and the translation of foreign currency denominated results of operations, financial position and cash flows into U.S. Dollars.\nOur foreign exchange risk management program is intended to lessen both the positive and negative effects of currency fluctuations on our consolidated results of operations, financial position and cash flows. We manage global foreign exchange risk centrally on a portfolio basis to address those risks material to NIKE, Inc. We manage these exposures by taking advantage of natural offsets and currency correlations existing within the portfolio and, where practical and material, by hedging a portion of the remaining exposures using derivative instruments such as forward contrac",
  "item2_clean": null
}