{
  "source_file": "now-20241231.htm",
  "form_type": "10-K",
  "item1_clean": "We primarily sell our services to large enterprise customers, and we host and support large, enterprise-wide deployments for our customers. As of December 31, 2024, we had approximately 8,400 customers. Our customers operate in a wide variety of industries. The portion of our revenues generated by sales to government customers has also increased over time. See “Risk Factors—Doing business with the public sector and heavily-regulated entities subjects us to risks related to the government procurement process, regulations, and contracting requirements” for additional information about our sales to government customers.\nResearch and Development\nOur research and development organization is responsible for the design, development, testing and validation of our solutions. We focus on innovating and developing new services and core technologies and further enhancing the functionality, reliability and performance of our existing solutions. Using emerging technologies, we can anticipate customer demands and then bring new services and new versions of existing services to market quickly in order to remain competitive in the marketplace. We have made, and will continue to make, significant investments in research and development to broaden our platform capabilities, strengthen our existing applications, expand the number of applications on our platform, enhance our user experience and develop additional mobile, automation, AI and machine intelligence technologies.\nAcquisitions and Investments\nWe have acquired and invested in companies and technologies as part of our business strategy and will continue to evaluate and enter into potential strategic transactions, including, among other things, acquisitions of or investments in businesses, technologies, services, products and other assets. These transactions are intended to, among other things, expand or improve our service offerings and functionality, go-to-market and sales efforts, our operations or our ability to source necessary expertise and provide services in international locations.\nOur business is highly competitive, rapidly evolving and fragmented, and subject to disruptive technologies with low barriers to entry, to shifting customer needs and to frequent introductions of new products and services. As our business expands and the industries in which we operate evolve, we increasingly find ourselves in competition with solutions and alternative approaches to solving customer needs, including, among others:\nenterprise application software vendors (including cloud-based and traditional on-premises vendors) such as Oracle, SAP, Salesforce and Workday;\nnew technologies and entrants (including both point-solutions and platform solutions covering a wide range of functionalities);\ncustom development and in-house solutions;\ntechnology consultants;\nsystems integrators; and\nFor additional information about competition, see “Risk Factors—A failure to innovate in response to rapidly evolving technological changes and in the midst of an intensely competitive market may harm our competitive position and business prospects.”\nIntellectual Property\n\nITEM 1.\nBUSINESS\nServiceNow was founded on a simple premise: to make work flow better. Our intelligent platform—the Now Platform—is a cloud-based solution that helps enterprises and organizations across public and private sectors digitize workflows, in line with our purpose of making the world work better for everyone. Organizations are increasingly turning to digital investments to streamline business-critical processes, drive deeper collaboration, increase employee productivity and power better customer experiences. The Now Platform helps business leaders realize value from these investments by incorporating advanced technology into the flow of work, end-to-end across the enterprise, for every department and persona.\nThe workflow applications built on the Now Platform are organized in four primary areas: Technology, Customer and Industry, Employee and Creator. Our Technology Workflows empower Information Technology (“IT”) departments to plan, build, operate and service the IT needs of the business enterprise. Our Customer and Industry Workflows help organizations reimagine their customer experience by empowering their customers with personalized self-service and providing organizations with greater ability to anticipate their customer needs by providing real-time insights. Our Employee Workflows help customers simplify how their employees access services they need, creating a consumer-like experience. Our Creator Workflows enable customers to automate processes by quickly creating their own custom workflows on the Now Platform.\nArtificial Intelligence (“AI”), particularly Generative AI (“GenAI”) and agentic AI, is driving a new wave of technology transformation. We are an early leader in applying AI to enterprise workflows and are working to remain at the forefront of AI as we continue to execute our product roadmap. As an AI platform for business transformation, the Now Platform has embedded Now Assist, our AI solution available for certain products at an additional cost, to help enhance user productivity and efficiency, thereby accelerating our customers’ return on investment in the Now Platform. For example, with Now Assist, customer service agents can solve customers’ problems quickly with AI-produced case summaries and next step suggestions; employees can obtain faster and more accurate answers using AI-powered self-service, increasing their productivity and engagement; customers can receive enhanced self-service options and improved experiences from live support agents; and developers can generate code and create apps, saving time to focus on more complex matters. We believe that with Now Assist, even customers with limited technical background can leverage AI to meaningfully contribute to their businesses’ digital transformation. Our customers have given us feedback that these enhanced products significantly improve the efficiency and fidelity of their workflows.\nAgentic AI, the next evolution of GenAI, involves AI agents that act and interact in smart and autonomous ways with humans providing oversight and guardrails. With agentic AI, humans can be supported by multiple AI agents trained to perform specific tasks, rather than, for example, a single AI assistant or chatbot relying on a human’s specific prompts or queries. Agentic AI is available to our customers as a Now Assist feature, where they can easily create agentic skills tailored to their unique needs. AI agents can use these skills to work together with humans to help augment and accelerate workflow outcomes by performing and completing actions on the human’s behalf.\nThe Now Platform, utilized by over 85% of the Fortune 500 and nearly 60% of the Global 2000, is a platform of consequence that puts AI to work for people, delivering tangible results while upholding a trustworthy, human‑centered approach to deploying products and services at scale. Many of our customers recognize the advantages of the Now Platform and have developed multi-year digital transformation plans that expand over time the use of ServiceNow products and services for their business. As we gain our customers’ trust by delivering products that provide great experiences and value across our customers’ entire enterprise, we feel immensely proud that “The World Works with ServiceNow.”\nServiceNow’s product portfolio—which spans our Technology, Customer and Industry, Employee, Creator and other Workflows—is delivered on the Now Platform. Each year, two major platform upgrades are released, delivering new standard functionality and standalone products to further simplify the way our customers work and enhance productivity. Since launching AI-powered versions of our products, we have continued to expand the Now Assist product portfolio and plan to continue to embed AI capabilities in our portfolio in the future.\nThe Now Platform is the AI platform for digital transformation. We help customers leverage emerging AI-based technologies to improve enterprise workflows. We believe AI-enabled workflows allow our customers to enhance their digital transformation and business impact. Transformations enabled by the Now Platform rapidly automate business processes across an entire enterprise by seamlessly connecting disparate departments, systems and silos to unlock productivity and improve experiences for both employees and customers. As the foundation for how we deliver our cross-enterprise digital workflows, the Now Platform orchestrates work across our customers’ cloud platforms and systems of choice, allowing them to get work done regardless of their current and future systems of record and collaboration platforms, across any data and system.\nOur one platform, one architecture and one data model approach can provide a “single pane of glass” that connects people, processes, data and devices. It offers a one-stop shop for automation and simplification of manual processes and is highly flexible, scalable and extensible. Enterprises can leverage our platform’s consumer-like user interface to help them deliver seamless experiences. For example, the Now Platform empowers users to independently resolve issues and seek answers through intelligent self-service portals. To illustrate, a customer may need to reset a password or update a shipping address, or an employee may want to know how many vacation days she has remaining. Because the Now Platform contains access to all of this information and the context of the user’s request in a single environment, users can easily access the information or services they need and find their own customized answers without outside help or even knowing which system or department has the answer they need. We believe better service, end-user experience and organizational agility are the ultimate desired outcomes of digital transformation.\nThe Now Platform is uniquely positioned to bring the full potential of GenAI and agentic AI to the enterprise. With our recent software releases, we have combined the power of the Now Platform with new GenAI and agentic AI features, offered through Now Assist, to provide intelligent workflows throughout our customers’ businesses. Customers have the flexibility to tailor their AI transformation to their unique needs and expand the value of their workflows by using ServiceNow’s large language models (“LLMs”), which include models that can process different types of data, such as text, images, audio and video, and they can incorporate third-party LLMs and their own LLMs. We regularly test these models on platform-representative data to give customers confidence that the models deliver optimal performance for their intended use cases on the Now Platform. We also provide AI governance tools, including built-in monitoring and guardrails, dataset creation management and benchmarking capabilities, and visibility into adoption, usage and performance analytics. These tools are designed to allow customers to securely and responsibly build, test and deploy new use cases and applications leveraging these models. With a single data model and integrated data layer, the Now Platform enables customers to operationalize their AI strategy and transform their business with speed, scale and security. This flexibility helps create more intuitive, efficient and seamless workflows aligned to our customers’ needs. In addition to AI, business process automation on the Now Platform can be further enhanced by other functionality, including machine learning, robotic process automation, process mining, analytics and low-code/no-code development tools.\nTechnology Workflows\nTechnology Workflows enable IT departments to serve their customers, manage their IT infrastructure, identify and remediate security vulnerabilities and threats, gain visibility across their IT resources and asset lifecycles, optimize IT costs and reduce time spent on admini",
  "item7_clean": "Net cash provided by operating activities\nPurchases of property and equipment\nBusiness combination and other related costs\nWe have historically seen higher collections in the quarter ended March 31 due to seasonality in timing of entering into customer contracts, which is significantly higher in the quarter ended December 31. Additionally, we have historically seen higher disbursements in the quarters ended March 31 and September 30 due to payouts under our annual commission plans, purchases under our employee stock purchase plan, payouts under our bonus plans and coupon payments related to our 2030 Notes.\nNon-GAAP consolidated income from operations.\nNon-GAAP consolidated income from operations is identified as an additional measure of profit or loss. This non-GAAP measure is used by the chief operating decision maker to allocate resources and assess performance. We define non-GAAP consolidated income from operations as income from operations excluding certain non-cash or non-recurring items, including stock-based compensation expense, amortization of purchased intangibles, legal settlements and business combination and other related costs. We believe these adjustments provide useful supplemental information to investors and facilitate the analysis of our operating results and comparison of those results across reporting periods. The following table shows the reconciliation of our reported consolidated income from operations to non-GAAP consolidated income from operations.\nYear Ended December 31,\nGAAP income from operations\nStock-based compensation\nAmortization of purchased intangibles\nBusiness combination and other related costs\nNon-GAAP income from operations\nWe calculate our renewal rate by subtracting our attrition rate from 100%. Our attrition rate for a period is equal to the ACV from customers lost during the period, divided by the sum of (i) the total ACV from all customers that renewed during the period, excluding changes in price or users, and (ii) the total ACV from all customers lost during the period. Accordingly, our renewal rate is calculated based on ACV and is not based on the number of customers that have renewed. Further, our renewal rate does not reflect increased or decreased purchases from our customers to the extent such customers are not lost customers or lapsed renewals. A lost customer is a customer that did not renew an expiring contract and that, in our judgment, will not be renewed. Typically, a customer that reduces its subscription upon renewal is not considered a lost customer. However, in instances where the subscription decrease represents the majority of the customer’s ACV, we may deem the renewal as a lost customer. For our renewal rate calculation, we define a customer as an entity with a separate production instance of our service and an active subscription contract as of the measurement date, instead of an entity with a unique GULT or DUNS number. We adjust our renewal rate for acquisitions, consolidations and other customer events that cause the merging of two or more accounts occurring at the time of renewal. Our renewal rate was 98% for each of the years ended December 31, 2024, 2023 and 2022. As our renewal rate is impacted by the timing of renewals, which could occur in advance of, or subsequent to the original contract end date, period-to-period comparison of renewal rates may not be meaningful.\nCritical Accounting Policies and Significant Judgments and Estimates\nOur management’s discussion and analysis of financial condition and results of operations is based on our consolidated financial statements, which have been prepared in accordance with GAAP. The preparation of these consolidated financial statements requires us to make estimates and assumptions that affect the reported amounts of assets and liabilities and the disclosure of contingent assets and liabilities at the date of the consolidated financial statements, as well as the reported revenues and expenses during the reporting periods. These items are monitored and analyzed by us for changes in facts and circumstances, and material changes in these estimates could occur in the future. We base our estimates on historical experience and on various other factors that we believe are reasonable under the circumstances, the results of which form the basis for making judgments about the carrying value of assets and liabilities that are not readily apparent from other sources. Changes in estimates are reflected in reported results for the period in which they become known. Actual results may differ from these estimates under different assumptions or conditions and such differences could be material.\nWe derive our revenues predominately from subscription revenues, which are primarily comprised of subscription fees that give customers access to the ordered subscription service, related support and updates, if any, to the subscribed service during the subscription term. For our cloud services, we recognize subscription revenues ratably over the contract term beginning on the commencement date of each contract, the date we make our services available to our customers. Our contracts with customers typically include a fixed amount of consideration and are generally non-cancellable and without any refund-type provisions.\nSubscription revenues also include revenues from self-hosted offerings in which customers deploy, or we grant customers the option to deploy without significant penalty, our subscription service internally or contract with a third party to host the software. For these contracts, we account for the software element separately from the related support and updates as they are distinct performance obligations. The transaction price is allocated to separate performance obligations on a relative standalone selling price (“SSP”) basis. The transaction price allocated to the software element is recognized when transfer of control of the software to the customer is complete. The transaction price allocated to the related support and updates are recognized ratably over the contract term.\nWe enter into contracts that can include various combinations of products and services, which are generally capable of being distinct and accounted for as separate performance obligations. For these contracts, the transaction price is allocated to the separate performance obligations on a relative SSP basis. Evaluating the terms and conditions included within our customer contracts for appropriate revenue recognition and determining whether products and services are considered distinct performance obligations that should be accounted for separately versus together may require significant judgment.\nDeferred Commissions\nDeferred commissions are the incremental selling costs that are associated with acquiring customer contracts and consist primarily of sales commissions paid to our sales organization and referral fees paid to independent third parties. Commissions and referral fees earned upon the execution of initial and expansion contracts are primarily deferred and amortized over a period of benefit that we have determined to be five years consistent with prior year. Commissions earned upon the renewal of customer contracts are deferred and amortized over the average renewal term. Additionally, for self-hosted offerings, consistent with the recognition of subscription revenues for self-hosted offerings, a portion of the commission cost is expensed upfront when the self-hosted offering is made available. Determining the period of benefit, including average renewal term, requires judgment for which we take into consideration our customer contracts, our technology life cycle and other factors.\n\nOur annual tax rate is based on our income, statutory tax rates and tax planning opportunities available to us in the various jurisdictions in which we operate. Tax laws are complex and subject to different interpretations by the taxpayer and respective government taxing authorities. Significant judgment is required in determining our tax expense (benefit) and in evaluating our tax positions, including evaluating uncertainties and the complexity of taxes on foreign earnings. We review our tax positions quarterly and adjust the balances as new information becomes available.\nDeferred tax assets represent amounts available to reduce income taxes payable on taxable income in future years. Such assets arise because of temporary differences between the financial reporting and tax bases of assets and liabilities, as well as from net operating loss and tax credit carryforwards. We evaluate the recoverability of these future tax deductions and credits by assessing the adequacy of future expected taxable income from all sources, including future growth, forecasted earnings, future taxable income, the mix of earnings in the jurisdictions in which we operate, historical earnings, taxable income in prior years, if carryback is permitted under the law, carryforward periods and prudent and feasible tax planning strategies. A valuation allowance is established if it is more likely than not that all or a portion of the deferred tax asset will not be realized. To the extent sufficient positive evidence becomes available, we may release all or a portion of our valuation allowance in one or more future periods. A release of the valuation allowance, if any, would result in the recognition of certain deferred tax assets and a material income tax benefit for the period in which such release is recorded.\nOur tax positions are subject to income tax audits by multiple tax jurisdictions throughout the world. We recognize the tax benefit of an uncertain tax position only if it is more likely than not the position is sustainable upon examination by the taxing authority based on the technical merits. We measure the tax benefit recognized as the largest amount of benefit which is more likely than not to be realized upon settlement with the taxing authority. We recognize interest accrued and penalties related to unrecognized tax benefits in our tax provision. Significant judgment is required to evaluate uncertain tax positions. Our evaluations are based upon a number of factors, including changes in facts or circumstances, changes in tax law or guidance, correspondence with tax authorities during the course of audits and effective settlement of audit issues. Changes in the recognition or measurement of uncertain tax positions could result in material increases or decreases in our income tax expense in the period in which we make the change, which could have a material impact on our effective tax rate and operating results.\nWe calculate the current and deferred income tax provision based on estimates and assumptions that could differ from the actual results reflected in income tax returns filed in subsequent years and record adjustments based on filed income tax returns when identified. The amount of income taxes paid is subject to examination by U.S. federal, state and foreign tax authorities. The estimate of the potential outcome of any uncertain tax issue is subject to management’s assessment of relevant risks, facts and circumstances existing at that time. To the extent the assessment of such tax position changes, we record the change in estimate in the period in which we make the determination.\nChange in Accounting Estimate\nComponents of Results of Operations\n\nSubscription revenues\n. Subscription revenues are primarily comprised of fees that give customers access to the ordered subscription service for both self-hosted offerings and cloud-based subscription offerings, and related standard and enhanced support and updates, if any, to the subscription service during the subscription term. For our cloud-based offerings, we recognize revenue ratably over the subscription term. For self-hosted offerings, a substantial portion of the sales price is recognized upon delivery of the software, which may cause greater variability in our subscription revenues and subscription gross margin. Pricing includes multiple instances, hosting and support services, data backup and disaster recovery services, as well as future updates, when and if available, offered during the subscription term. We typically invoice our customers for subscription fees in annual increments upon execution of the initial contract or subsequent renewal. Our contracts are generally non-cancellable during the subscription term, though a customer can terminate for breach if we materially fail to perform.\nProfessional services and other revenues\n. Our arrangements for professional services are primarily on a time-and-materials basis, and we generally invoice our customers monthly in arrears for the professional services based on actual hours and expenses incurred. Some of our professional services arrangements are on a fixed-fee basis. Professional services revenues are recognized as services are delivered. Other revenues primarily consist of fees from customer training delivered on-site or through publicly available classes. Typical payment terms require our customers to pay us within 30 days of invoice.\nWe sell our subscription services primarily through our direct sales organization. We also sell services through managed service providers and resale partners. We also generate revenues from certain professional services and from training of customers and partner personnel, through both our direct team and indirect sales channel. Revenues from our direct sales organization represented 78% of our total revenues for the year ended December 31, 2024 and 79% of our total revenues for each of the years ended December 31, 2023 and 2022. For purposes of calculating revenues from our direct sales organization, revenues from systems integrators and managed services providers are included as part of the direct sales organization.\n. We have historically experienced seasonality in terms of when we enter into customer agreements. We sign a significantly higher percentage of agreements with new customers, as well as expansion with existing customers, in the fourth quarter of each year. The increase in customer agreements for the fourth quarter is primarily a result of both large enterprise account buying patterns typical in the software industry, which are driven primarily by the expiration of annual authorized budgeted expenditures, and the terms of our commission plans, which incentivize our direct sales organization to meet their annual quotas by December 31. Furthermore, we usually sign a significant portion of these agreements during the last month, and often the last two weeks, of each quarter. This seasonality of entering into customer agreements is sometimes not immediately apparent in our revenues, due to the fact that we recognize subscription revenues from our cloud offering contracts over the term of the subscription agreement, which is generally 12 to 36 months. In addition, we continue to see an increase in the number of 12-month agreements entered into with the U.S. federal government throughout the year, with the highest number of agreements entered into in the third quarter, driven primarily by the timing of their annual budget expenditures. This larger mix of contracts with 12-month renewal terms in the third quarter will generally cause variability in our RPO and cRPO in subsequent quarters until they are renewed. Although these seasonal factors may be common in the technology industry, historical patterns should not be considered a reliable indicator of our future sales activity or performance.\nCost of subscription revenues\n. Cost of subscription revenues consists primarily of expenses related to hosting our services and providing support to our customers. These expenses are comprised of data center capacity costs, which include colocation costs associated with our data centers as well as interconnectivity between data centers, depreciation related to our infrastructure hardware equipment dedi",
  "item2_clean": null
}