{
  "source_file": "now-20250930.htm",
  "form_type": "10-Q",
  "item1_clean": null,
  "item7_clean": null,
  "item2_clean": "Timing of contract renewals\n. While customers typically renew their contracts at the end of the contract term, from time to time, customers may do so either before or after the scheduled expiration date. For example, in cases where we are successful in selling additional products or services to an existing customer, a customer may decide to renew its existing contract early to ensure that all its contracts expire on the same date. In other cases, prolonged negotiations or other factors may result in a contract not being renewed until after it has expired.\n. While we typically enter into multi-year subscription services, the duration of our contracts varies. Further, we continue to see an increase in the number of 12-month agreements entered into with the U.S. federal government throughout the year, with the highest number of agreements entered into in the quarter ended September 30, driven primarily by timing of their annual budget expenditures. We sometimes also enter into contracts with durations that have a 12-month or shorter term to enable the contracts to co-terminate with the existing contract. The contract duration will cause variability in our RPO.\nNumber of customers with ACV greater than $5 million.\nWe count the total number of customers with annual contract value (“ACV”) greater than $5 million as of the end of the period. We had 553 and 469 customers with ACV greater than $5 million as of September 30, 2025 and 2024, respectively. For purposes of customer count, a customer is defined as an entity that has a unique Dunn & Bradstreet Global Ultimate (“GULT”) Data Universal Numbering System (“DUNS”) number and an active subscription contract as of the measurement date. The DUNS number is a global standard for business identification and tracking. We make exceptions for holding companies, government entities and other organizations for which the GULT, in our judgment, does not accurately represent the ServiceNow customer. For example, while all U.S. government agencies roll up to “Government of the United States” under the GULT, we count each government agency that we contract with as a separate customer. Our customer count is subject to adjustments for acquisitions, spin-offs and other market activity; accordingly, we restate previously disclosed number of customers with ACV greater than $5 million calculations to allow for comparability. ACV is calculated based on the foreign exchange rate in effect at the time the contract was signed. Foreign exchange rate fluctuations could cause some variability in the number of customers with ACV greater than $5 million. We believe information regarding the total number of customers with ACV greater than $5 million provides useful information to investors because it is an indicator of our growing customer base and demonstrates the value customers are receiving from the Now Platform.\nWe define free cash flow, a non-GAAP financial measure, as GAAP net cash provided by operating activities plus cash outflows for legal settlements and business combination and other related costs including compensation expense, reduced by purchases of property and equipment. Purchases of property and equipment are otherwise included in cash used in investing activities under GAAP. We believe information regarding free cash flow provides useful information to investors because it is an indicator of the strength and performance of our business operations. However, our calculation of free cash flow may not be comparable to similar measures used by other companies. A calculation of free cash flow is provided below:\nNine Months Ended September 30,\n(dollars in millions)\nGAAP net cash provided by operating activities\nPurchases of property and equipment\nBusiness combination and other related costs\nNon-GAAP free cash flow\nWe have historically seen higher collections in the quarter ended March 31 due to seasonality in timing of entering into customer contracts, which is significantly higher in the quarter ended December 31. Additionally, we have historically seen higher disbursements in the quarters ended March 31 and September 30 due to payouts under our annual commission plans, purchases under our employee stock purchase plan, payouts under our bonus plans and coupon payments related to our 2030 Notes.\nNon-GAAP consolidated income from operations.\nNon-GAAP consolidated income from operations is identified as an additional measure of profit or loss. This non-GAAP measure is used by the chief operating decision maker to allocate resources and assess performance. We define non-GAAP consolidated income from operations as income from operations excluding certain non-cash or non-recurring items, including stock-based compensation expense, amortization of purchased intangibles, legal settlements, business combination and other related costs including compensation expense, impairment of assets and severance costs. We believe these adjustments provide useful supplemental information to investors and facilitate the analysis of our operating results and comparison of those results across reporting periods. The following table shows the reconciliation of our reported consolidated income from operations to non-GAAP consolidated income from operations.\nThree Months Ended September 30,\nNine Months Ended September 30,\n(dollars in millions)\n(dollars in millions)\nGAAP income from operations\nStock-based compensation\nAmortization of purchased intangibles\nBusiness combination and other related costs\nImpairment of assets\nNon-GAAP income from operations\nWe calculate our renewal rate by subtracting our attrition rate from 100%. Our attrition rate for a period is equal to the ACV from customers lost during the period, divided by the sum of (i) the total ACV from all customers that renewed during the period, excluding changes in price or users, and (ii) the total ACV from all customers lost during the period. Accordingly, our renewal rate is calculated based on ACV and is not based on the number of customers that have renewed. Further, our renewal rate does not reflect increased or decreased purchases from our customers to the extent such customers are not lost customers or lapsed renewals. A lost customer is a customer that did not renew an expiring contract and that, in our judgment, will not be renewed. Typically, a customer that reduces its subscription upon renewal is not considered a lost customer. However, in instances where the subscription decrease represents the majority of the customer’s ACV, we may deem the renewal as a lost customer. For our renewal rate calculation, we define a customer as an entity with a separate production instance of our service and an active subscription contract as of the measurement date, instead of an entity with a unique GULT or DUNS number. We adjust our renewal rate for acquisitions, consolidations and other customer events that cause the merging of two or more accounts occurring at the time of renewal. Our renewal rate was 97% for the three months ended September 30, 2025 and 98% for the nine months ended September 30, 2025 and each of the three and nine months ended September 30, 2024. As our renewal rate is impacted by the timing of renewals, which could occur in advance of, or subsequent to the original contract end date, period-to-period comparison of renewal rates may not be meaningful.\nComponents of Results of Operations\n\n(dollars in millions)\nOther income (expense), net\nPercentage of revenues\nOther income increased by $17 million for the three months ended September 30, 2025 compared to the three months ended September 30, 2024 and other expense decreased by $21 million for the nine months ended September 30, 2025 compared to the nine months ended September 30, 2024, primarily driven by unrealized gains on strategic investments.\nTo mitigate our risks associated with fluctuations in foreign currency exchange rates, we enter into foreign currency forward contracts with maturities of 12 months or less to hedge a portion of our net outstanding monetary assets and liabilities. These hedging contracts may reduce, but cannot entirely eliminate, the impact of adverse currency exchange rate movements. The gains recognized for foreign currency forward contracts from derivatives not designated as hedging instruments in other income (expense), net of $100 million, primarily offset the remeasurement losses of the related foreign currency denominated assets and liabilities of $114 million for the nine months ended September 30, 2025. The gains (losses) recognized for foreign currency forward contracts from derivatives not designated as hedging instruments were immaterial for the three months ended September 30, 2025 and each of the three and nine months ended September 30, 2024.\nProvision for Income Taxes\n\nServiceNow was founded on a simple premise: to make work flow better. Our intelligent platform, the Now Platform, is a cloud-based solution that helps enterprises and organizations across public and private sectors digitize workflows, in line with our purpose of making the world work better for everyone. Our workflow applications built on the Now Platform are organized along four primary areas: Technology, CRM and Industry, Core Business and Creator. The Now Platform is the AI platform for digital transformation. Transformations enabled by the Now Platform rapidly automate business processes across an entire enterprise by seamlessly connecting disparate departments, systems and silos to unlock productivity and improve experiences for both employees and customers.\nWe are closely monitoring the ongoing conflicts in Russia/Ukraine and the Middle East. While these events are still evolving and the outcomes remain highly uncertain, we do not believe these conflicts will have a material impact on our business and results of operations. However, if the conflicts continue or worsen, leading to greater global economic disruptions and uncertainty, our business and results of operations co"
}