{
  "source_file": "nrg-20241231.htm",
  "form_type": "10-K",
  "item1_clean": "NRG Energy, Inc., or NRG or the Company, is a leading energy and smart home company fueled by market-leading brands, proprietary technologies and complementary sales channels. Across the U.S. and Canada, NRG delivers innovative, sustainable solutions, predominately under brand names such as NRG, Reliant, Direct Energy, Green Mountain Energy and Vivint, while also advocating for competitive energy markets and customer choice. The Company has a customer base that includes approximately 8 million residential customers (comprised of 6 million retail energy customers and 2 million smart home customers) in addition to commercial, industrial, and wholesale customers, supported by approximately 13 GW of generation as of December 31, 2024.\nof electricity and 1,833 MMDth of natural gas in 2024, making it one of the largest competitive energy retailers in the U.S. As of the end of 2024, NRG had recurring electricity and/or natural gas sales in 25 U.S. states, the District of Columbia, and 8 provinces in Canada, and Vivint Smart Home served customers in all 50 U.S. states. NRG's retail brands, collectively, have the largest share of competitively served residential electric customers in Texas and is one of the largest business-to-business providers of power and natural gas in North America, including to manufacturing, industrial, and data center facilities.\nNRG's strategy is to maximize shareholder value by being a leader in the emerging convergence of energy and smart automation in the home and business. Through a diversified supply strategy, the Company sells reliable electricity and natural gas to its customers in the markets it serves, while also providing innovative home solutions to customers. NRG's unique combination of assets and capabilities enables the Company to develop and sell highly differentiated offerings that bring together every day essential services like powering and securing the home through a seamless and integrated experience. This strategy is intended to enable the Company to optimize its unique integrated platform to delight customers, generate recurring cash flow, significantly strengthen earnings and cost competitiveness, and lower risk and volatility. Sustainability is a philosophy that underpins NRG’s strategy and facilitates value creation across NRG's business.\nTo effectuate the Company’s strategy, NRG is focused on: (i) serving the energy needs of end-use residential, commercial and industrial, and wholesale counterparties in competitive markets and optimizing on additional revenue opportunities through its multiple brands and channels; (ii) offering a variety of energy products and smart home products and services that are differentiated by innovative features, premium service, integrated platforms, sustainability and loyalty/affinity programs; (iii) excellence in operating performance of its assets; (iv) achieving the optimal mix of supply to serve its customer load requirements through a diversified supply strategy; and (v) engaging in disciplined and transparent capital allocation.\nIn 2024, NRG entered into a definitive partnership agreement with Renew Home, a Virtual Power Plant platform (“VPP”) formed by the combination of Google’s Nest Renew and OhmConnect. Leveraging Google Cloud’s AI and cloud platforms, NRG and Renew Home plan to develop a VPP portfolio of up to 1 GW of load management capacity, with instantaneous dispatch value during peak events and tight supply conditions.\nThe Company’s core businesses are the sale of electricity and natural gas to residential, commercial and industrial and wholesale customers, supported by the Company's wholesale electric generation, as well as the sale of smart home products and services. NRG manages its electricity and natural gas operations based on the combined results of the retail, wholesale and generation businesses with a geographical focus. Vivint Smart Home operations are reported within the Vivint Smart Home segment.\nThe Company's business is segmented as follows:\nTexas, which includes all activity related to customer, plant and market operations in Texas, other than Cottonwood;\nEast, which includes all activity related to customer, plant and market operations in the East;\nWest/Services/Other, which primarily includes the following assets and activities: (i) all activity related to customer, plant and market operations in the West and Canada, and (ii) activity related to the Cottonwood facility and other investments;\nVivint Smart Home; and\nCorporate activities.\n\nThe integrated model consists of three core functions in each geographic segment above: Customer Operations, Market Operations and Plant Operations.\nCustomer Operations is responsible for growing and retaining the customer base and delivering an outstanding customer experience. This includes acquisition and retention of all of NRG’s residential, small commercial, commercial and industrial, and government customers. NRG employs a multi-brand strategy that leverages a wide array of sales and partnership channels, direct face-to-face sales channels, call centers, websites, and brokers. Go-to-market activities include market strategy planning and development, product innovation, offer design, campaign execution, marketing and creative services, and selling. Customer portfolio maintenance and retention activities include fulfillment, billing, payment processing, collections, customer service, issue resolution, and contract renewals. NRG provides energy and related services at either fixed, indexed or month-to-month prices. Home customers typically contract for terms ranging from one month to five years, while Business customers typically contract for terms ranging from one year to five years in length and extended contractual terms are available. Throughout all Customer Operations activities, the customer experience is kept at the forefront to inform decision-making and optimize retention, while creating supporters and advocates for NRG’s brands in the market. Customer Operations primarily comprises two end-use customer facing teams: NRG Home, which serves residential customers, and NRG Business, which serves business customers.\nNRG sells a variety of products to residential and small commercial customers, in a wide variety of sales channels, including retail electricity and energy management, natural gas, line and surge protection products and home protection products, repair and maintenance, and carbon offsets. Home customers make purchase decisions based on a variety of factors, including price, incentive, customer service, brand, innovative offers/features and referrals from friends and family. Through its broad range of service offerings and value propositions, NRG seeks to attract, retain, and increase the value of its customer relationships. NRG's brands are recognized for exemplary customer service, innovative smart energy and environmentally-friendly solutions.\nThe Company provides power and natural gas to the business-to-business markets in North America, as well as retail services, including demand response, commodity sales, energy efficiency and energy management solutions to Business customers. The Company is an integrated provider of supply and distributed energy resources and focuses on distributed products as businesses seek greater reliability, cleaner power and other benefits that they cannot obtain from the grid. These solutions include system power, distributed generation, renewable and low-carbon products, carbon management and specialty services, backup generation, storage and distributed solar, demand response, and energy efficiency and advisory services.\nMarket Operations has two primary objectives: to supply energy to customers in the most cost-efficient manner and to maximize the value of the Company's assets in satisfying its customer load requirements. These objectives are intended to reduce supply costs and maximize earnings with predictable cash flows.\nPower and natural gas are the two main commercial groups within Market Operations.\nThe power commercial group is responsible for end-use electricity supply including power plant optimization and certain fuel supply. To meet the market operations objectives, NRG enters into supply, power and gas hedging agreements via a wide range of products and contracts, including (i) physical and financial commodity instruments, (ii) fuel supply and transportation contracts, (iii) PPAs and Renewable PPAs, and (iv) capacity and other contracted revenue or supply sources, as further discussed below.\nIn addition, because changes in power prices in the markets where NRG operates are generally correlated to changes in natural gas prices, NRG uses hedging strategies that may include power and natural gas forward purchases and sales contracts to manage commodity price risk.\nPhysical and Financial Commodity Instruments\nNRG trades power, natural gas, environmental, weather and other physical and financial commodity related products, including forwards, futures, options and swaps. NRG enters into these instruments primarily to manage price and delivery risk,\n\noptimize physical and contractual assets in the portfolio, manage working capital requirements, reduce the carbon exposure in its business and comply with laws and regulations.\nFuel Supply and Transportation Contracts\nNRG's fuel requirements consist of various forms of fossil fuel. The prices of fossil fuels can be volatile. The Company obtains its fossil fuels from multiple suppliers and through multiple transporters. Although availability is generally not an issue, localized shortages, transportation availability, delays arising from extreme weather conditions and supplier financial stability issues can and do occur. The preceding factors related to the sources and availability of raw materials are fairly uniform across the Company's business and fuel products used. NRG's primary fuel requirements consist of the following:\n— NRG operates a fleet of mid-merit and peaking natural gas plants. Fuel needs are managed by the natural gas commercial group, generally on a spot basis, as the Company does not believe it is prudent to forward purchase natural gas for these types of units as the dispatch is highly unpredictable. Natural gas storage and transportation contracts are utilized to reduce daily volatility.\n— NRG actively manages its coal requirements based on forecasted generation, market volatility and its inventory on site. The Company believes it is adequately hedged, using forward coal supply agreements, for its domestic coal consumption for 2025. As of December 31, 2024, NRG had purchased forward contracts to provide fuel for the Company's expected requirements for 2025. For the domestic fleet, NRG purchased approximately 13 million tons of coal in 2024, all of which was Powder River Basin coal. For fuel transport, NRG has entered into various rail transportation and rail car lease agreements with varying tenures, which will provide for the Company's transportation requirements of Powder River Basin coal for the next four years.\nThe Company's strategy is to procure mid to long-term renewable generation through power purchase agreements. NRG has entered into Renewable PPAs totaling approximately 1.9 GW with third-party project developers and other counterparties, of which all are operational as of December 31, 2024. The remaining average tenure of these agreements is nine years. The Company expects to continue evaluating and executing similar agreements that support the needs of the business. The total GW entered into through Renewable PPAs may be impacted by contract terminations when they occur.\nCapacity and Other Contracted Revenue or Supply Sources\nNRG's revenues and/or cash flows, primarily in the East and West, benefit from capacity/demand payments and other contracted revenue sources, originating from market clearing capacity prices, tolling arrangements and other long-term contractual arrangements.\nThe natural gas comm",
  "item7_clean": "Item 7 — Management's Discussion and Analysis of Financial Condition and Results of Operations\nThe discussion and analysis below has been organized as follows:\nExecutive Summary, including the business environment in which the Company operates, a discussion of regulation, weather, competition and other factors that affect the business, and other significant events that are important to understanding the results of operations and financial condition;\nResults of operations for the years ended December 31, 2024 and December 31, 2023, including an explanation of significant differences between the periods in the specific line items of NRG's Consolidated Statements of Operations;\nLiquidity and capital resources including liquidity position, financial condition addressing credit ratings, material cash requirements and commitments, and other obligations; and\nCritical accounting estimates that are most important to both the portrayal of the Company's financial condition and results of operations, and require management's most difficult, subjective, or complex judgments.\nBeginning in the third quarter of 2024, the Company is recording the amortization of capitalized contracts costs within depreciation and amortization. This change, along with additional financial statement disclosures, is meant to address investor inquiries by enhancing transparency to easier match expenses with revenues. The Company previously recorded amortization of capitalized contract costs related to fulfillment in cost of operations and amortization of capitalized contract costs related to customer acquisition primarily in selling, general and administrative costs in the consolidated statements of operations. Amounts for prior years were adjusted for comparative purposes. See Item 15 — Note 2 ,\nSummary of Significant Accounting Policies\nfor further detail. The adjustments had no impact on the Company’s total operating costs and expenses, and total cash flows.\nThe Company has elected to omit discussion of the earliest of the three years covered by the consolidated financial statements presented. A discussion and analysis of fiscal year 2022 may be found in Part II, Item 7\nThe following discussion and analysis also contains forward-looking statements, including, without limitation, statements relating to NRG’s plans, strategies, objectives, expectations, intentions, and resources. Such forward-looking statements should be read in conjunction with the disclosures under Item 1A —\nNRG Energy, Inc., or NRG or the Company, is a leading energy and smart home company fueled by market-leading brands, proprietary technologies and complementary sales channels. Across the U.S. and Canada, NRG delivers innovative, sustainable solutions, predominately under the brand names such as NRG, Reliant, Direct Energy, Green Mountain Energy, and Vivint, while also advocating for competitive energy markets and customer choice. The Company has a customer base that includes approximately 8 million residential customers (comprised of 6 million retail energy customers and 2 million smart home customers) in addition to commercial, industrial, and wholesale customers, supported by approximately 13 GW of generation as of December 31, 2024.\nBusiness Environment\nThe industry dynamics and external influences affecting the Company, its businesses, and the retail energy and power generation industry in 2024 and for the future medium term include:\n— The price of natural gas plays an important role in setting the price of electricity in many of the regions where NRG operates. Natural gas prices are driven by variables including demand from the industrial, residential, and electric sectors, productivity across natural gas supply basins, costs of natural gas production, changes in pipeline infrastructure, global liquified natural gas demand, exports of natural gas, and the financial and hedging profile of natural gas customers and producers. In 2024, the average natural gas price at Henry Hub was $2.27 per MMBtu compared to $2.74 per MMBtu in 2023, representing a decrease of 17%.\nNRG may experience impacts to gross margins due to significant, rapid changes in current natural gas prices, the impact those prices have on power prices, and the lag in its ability to make a corresponding adjustment to the retail rates it charges customers on term and month to month contracts. The Company hedges its load commitments in order to mitigate the impact of changes in commodity prices, and as a result, these gross margin impacts would be realized in future periods until it is able to make the corresponding adjustments to the retail customer rates.\n\nReversal of previously recognized unrealized (gains)/losses on settled positions related to economic hedges\nReversal of acquired (gain) positions related to economic hedges\nNet unrealized gains on open positions related to economic hedges\nTotal mark-to-market gains in revenues\nMark-to-market results in operating costs and expenses\nReversal of previously recognized unrealized (gains) on settled positions related to economic hedges\nReversal of acquired loss/(gain) positions related to economic hedges\nNet unrealized gains/(losses) on open positions related to economic hedges\nTotal mark-to-market gains/(losses) in operating costs and expenses\nMark-to-market results consist of unrealized gains and losses on contracts that are yet to be settled. The settlement of these transactions is reflected in the same revenue or cost caption as the items being hedged.\nThe reversals of acquired gain or loss positions were valued based upon the forward prices on the acquisition date.\nFor the year ended December 31, 2024, the $3 million loss in revenues from economic hedge positions was driven by the reversal of previously recognized unrealized gains on contracts that settled during the period, largely offset by an increase in the value of open positions as a result of decreases in New York capacity and MISO power prices. The $209 million gain in operating costs and expenses from economic hedge positions was driven primarily by the reversal of previously recognized unrealized losses on contracts that settled during the period, as well as an increase in the value of open positions as a result of increases in natural gas and Northeast power prices. This was partially offset by a decrease in the value of open positions as a result of decreases in CAISO and Alberta power prices.\nFor the year ended December 31, 2023, the $144 million gain in revenues from economic hedge positions was driven by an increase in the value of open positions as a result of decreases in power prices. The $3.0 billion loss in operating costs and expenses from economic hedge positions was driven primarily by the reversal of previously recognized unrealized gains on contracts that settled during the period, as well as a decrease in the value of East and West/Other open positions as a result of decreases in natural gas and power prices. This was partially offset by an increase in the value of Texas open positions as a result of increases in ERCOT power prices.\nIn accordance with ASC 815, the following table represents the results of the Company's financial and physical trading of energy commodities for the years ended December 31, 2024 and 2023. The realized and unrealized financial and physical trading results are included in revenue. The Company's trading activities are subject to limits within the Company's Risk Management Policy.\n\nOperations and Maintenance Expenses\nOperations and maintenance expenses are comprised of the following:\nYear Ended December 31, 2024\nYear Ended December 31, 2023\n(a) Includes results of operations following the acquisition date of March 10, 2023\nOperations and maintenance expenses increased by $216 million for the year ended December 31, 2024, compared to the same period in 2023, due to the following:\nIncrease primarily due to the prior year partial property insurance claim for the extended outage at W.A. Parish\nIncrease in planned major maintenance expenditures associated with the scope and duration of outages at the Texas coal and gas facilities, and Powerton\nIncrease due to the acquisition of Vivint Smart Home in March 2023\nIncrease driven by higher Vivint Smart Home operations costs\nIncrease driven by higher retail operations costs\nDecrease primarily due to the sale of STP in November 2023\nDecrease driven by a reduction in deactivation and asset retirement expenditures primarily in the East\nDecrease due to the sale of Airtron in September 2024\nIncrease in operations and maintenance expense\nOther Cost of Operations\nOther Cost of operations are comprised of the following:\nYear Ended December 31, 2024\nYear Ended December 31, 2023\n(a) Includes results of operations following the acquisition date of March 10, 2023\nOther cost of operations increased by $2 million for the year ended December 31, 2024, compared to the same period in 2023, due to the following:\nIncrease in retail gross receipt taxes in Texas and East\nIncrease due to changes in current year ARO cost estimates at Midwest Generation and Jewett Mine\nIncrease due to higher insurance premiums\nDecrease primarily due to the sale of STP in November 2023\nIncrease in other cost of operations\nDepreciation and Amortization\nDepreciation and amortization expenses are comprised of the following:\nYear Ended December 31, 2024\nYear Ended December 31, 2023\n(a) Includes results of operations following the acquisition date of March 10, 2023\n\nDepreciation and amortization expense increased by $108 million for the year ended December 31, 2024, compared to the same period in 2023, primarily due to an increase in amortization of capitalized contract costs, partially offset by a decrease in amortization driven by the expected roll of the acquired Vivint Smart Home intangibles.\nDuring the year ended December 31, 2024, the Company recorded impairment losses related to property plant and equipment and other assets of $7 million, and $29 million in the Texas and West/Services/Other segments, respectively.\nDuring the year ended December 31, 2023, the Company recorded impairment losses related to property plant and equipment and leases of $2 million, $4 million and $20 million in the Texas, East and West/Services/Other segments, respectively.\nRefer to Item 15 — Note 10,\n, to the Consolidated Financial Statements for further discussion\nSelling, General and Administrative Costs\nSelling, general and administrative costs are comprised of the following:\nCorporate/ Eliminations\nYear Ended December 31, 2024\nYear Ended December 31, 2023\n(a) Includes results of operations following the acquisition date of March 10, 2023\nSelling, general and administrative costs increased by $188 million for the year ended December 31, 2024 compared to the same period in 2023, due to the following:\nIncrease due to the acquisition of Vivint Smart Home in March 2023\nIncrease due to reserves for legal matters in 2024 and partially offset by the favorable resolution of legal matters in 2023\nIncrease in personnel costs primarily driven by an increase in accruals as part of the Company's annual incentive plan reflecting financial outperformance for the year\nIncrease in equity linked compensation primarily driven by a higher share price in 2024\nIncrease in marketing and media expenses\nDecrease in consulting and legal expenses\nDecrease driven by the sale of STP in November 2023\nIncrease in selling, general and administrative costs\nProvision for Credit Losses\nProvision for credit losses are comprised of the following:\nYear Ended December 31, 2024\nYear Ended December 31, 2023\n(a) Includes results of operations following the acquisition date of March 10, 2023\nProvision for credit losses increased by $63 million for the year ended December 31, 2024, compared to the same period in 2023, due to the following:\nIncrease primarily due to higher Texas Home retail revenues and customer payment behavior\nIncrease due to the acquisition of Vivint Smart Home in March 2023\nIncrease in provision for credit losses\n\nthe sensitivity of the Company's portfolio to potential changes in market prices using VaR, a statistical model which attempts to predict risk of loss based on market price and volatility. NRG's risk management policy places a limit on one-day holding period VaR, which limits the Company's net open position. As the Company's trade-by-trade derivative accounting results in a gross-up of the Company's derivative assets and liabilities, the net derivative assets and liability position is a better indicator of NRG's hedging activity. As of December 31, 2024, NRG's net derivative asset was $992 million, an increase to total fair value of $344 million as compared to December 31, 2023. This increase was primarily driven by gains in fair value and roll-off of trades that settled during the period.\nBased on a sensitivity analysis using simplified assumptions, the impact of a $0.50 per MMBtu increase or decrease in natural gas prices across the term of the derivative contracts would result in a change of approximately $1.0 billion in the net value of derivatives as of December 31, 2024.\nCritical Accounting Estimates\nThe Company's discussion and analysis of the financial condition and results of operations are based upon the Consolidated Financial Statements, which have been prepared in accordance with GAAP. The preparation of these financial statements and related disclosures in compliance with GAAP requires the application of appropriate technical accounting rules and guidance as well as the use of estimates and judgments that affect the reported amounts of assets, liabilities, revenues and expenses, and related disclosures of contingent assets and liabilities. The application of appropriate technical accounting rules and guidance involves judgments regarding future events, including the likelihood of success of particular projects, legal and regulatory challenges, and the fair value of certain assets and liabilities. These judgments, in and of themselves, could materially affect the financial statements and disclosures based on varying assumptions, which may be appropriate to use. In addition, the financial and operating environment may also have a significant effect, not only on the operation of the business, but on the results reported through the application of accounting measures used in preparing the financial statements and related disclosures, even if the accounting guidance has not changed.\nNRG evaluates these estimates, on an ongoing basis, utilizing historic experience, consultation with experts and other methods the Company considers reasonable. In any event, actual results may differ substantially from the Company's estimates. Any effects on the Company's business, financial position or results of operations resulting from revisions to these estimates are recorded in the period in which the information that gives rise to the revision becomes known.\nThe Company identifies its most critical accounting estimates as those that are the most pervasive and important to the portrayal of the Company's financial position and results of operations, and require the most difficult, subjective, and/or complex judgments by management about matters that are inherently uncertain.\n\nIncrease due to the acquisition of Vivint Smart Home\nHigher gross margin driven by growth in subscribers, or $77 million, higher revenue rates of $1.55 per subscriber or $33 million, partially offset by lower non-recurring sales revenue of $37 million\nLower gross margin due to recognition of fees associated with licensing products and services\nIncrease in economic gross margin\nIncrease in depreciation and amortization\nIncrease in gross margin\n(a) Includes results of operations following the acquisition date of March 10, 2023\nMark-to-market for Economic Hedging Activities\nMark-to-market for economic hedging activities includes asset-backed hedges that have not been designated as cash flow hedges. Total net ma",
  "item2_clean": null
}