{
  "source_file": "nsc-20250930.htm",
  "form_type": "10-Q",
  "item1_clean": null,
  "item7_clean": null,
  "item2_clean": "Domestic volume decreased in both periods driven by reduced traffic originating on the West Coast and reduced premium shipments. International volume was flat in the third quarter but increased for the first nine months primarily driven by increased volume during the first six months in anticipation of potential changes to tariffs.\nCoal revenues declined in both periods due to lower average revenue per unit, driven by reduced pricing, adverse mix, and lower fuel surcharge revenue. Volume decreased in the third quarter but increased for the first nine months.\nCoal tonnage (in thousands) by market was as follows:\n\nOur third quarter financial results reflected continued improvements in labor productivity and fuel efficiency while also delivering revenue growth driven by increased automotive and chemicals traffic. Significantly impacting the comparison of our financial results to the prior year is the absence of $380 million in gains on sales of railway lines that occurred in 2024. Additionally, net benefits related to the Eastern Ohio Incident (as defined further and described in Note 15 in the Notes to Consolidated Financial Statements) were lower in the current year. For the third quarter, we achieved an operating ratio (a measure of the amount of operating revenues consumed by operating expenses) of 64.6%, and an adjusted operating ratio of 63.3% (see our non-GAAP reconciliations beginning on page 29). We remain committed to being a safe, productive, resilient, and efficient railroad with industry-competitive margins.\nSUMMARIZED RESULTS OF OPERATIONS\n($ in millions, except per share amounts)\nRailway operating revenues\nRailway operating expenses\nIncome from railway operations\nDiluted earnings per share\nRailway operating ratio (percent)\nIncome from railway operations, net income, and diluted earnings per share decreased in the third quarter but increased for the first nine months. The decrease in the third quarter was the result of higher railway operating expenses as 2024 included significant gains on sales of railway lines and higher insurance recoveries related to the Eastern Ohio Incident. For the first nine months, railway operating expenses were lower. In 2025, insurance and other recoveries resulting from the Incident exceeded incremental Incident-related costs. Additionally, expenses associated with restructuring activities were lower. Partially offsetting those items were lower gains from the sales of railway lines and properties. Both periods reflect higher railway operating revenues, driven by a combination of improved traffic mix, favorable pricing, and increased volume, which was partially offset by lower fuel surcharge revenue.\nThe following tables adjust our GAAP financial results for the third quarter and first nine months of 2025 to exclude Merger-related expenses, restructuring and other charges, and the overall impact on operating expenses resulting from costs and recoveries associated with the Incident. The following tables adjust our GAAP financial results for the third quarter and first nine months of 2024 to exclude gains on railway line sales, restructuring and other charges, and costs and recoveries associated with the Incident. Additionally, the adjusted results for the first nine months of 2024 exclude shareholder advisory costs and a deferred income tax adjustment. The income tax effects of these non-GAAP adjustments were calculated based on the applicable tax rates to which the non-GAAP adjustments related. We use these non-GAAP financial measures internally and believe this information provides useful supplemental information to investors to facilitate making period-to-period comparisons by excluding these items. While we believe that these non-GAAP financial measures are useful in evaluating our business, this information should be considered as supplemental in nature and is not meant to be considered in isolation from, or as a substitute for, the related financial information prepared in accordance with GAAP. In addition, these non-GAAP financial measures may not be the same as similar measures presented by other companies.\nNon-GAAP Reconciliation for Third Quarter 2025\nMerger - Related Expenses\nRestructuring and Other Charges\nEastern Ohio Incident\n($ in millions, except per share amounts)\nRailway operating expenses\nIncome from railway operations\nDiluted earnings per share\nRailway operating ratio (percent)\nNon-GAAP Reconciliation for Third Quarter 2024\nGains on Railway Line Sales\nRestructuring and Other Charges\nEastern Ohio Incident\n($ in millions, except per share amounts)\nRailway operating expenses\nIncome from railway operations\nDiluted earnings per share\nRailway operating ratio (percent)\nIn the table below, references to the results for the third quarters of 2025 and 2024 and related comparisons use the adjusted, non-GAAP results from the reconciliations in the tables above.\n($ in millions, except per share amounts)\nRailway operating expenses\nIncome from railway operations\nDiluted earnings per share\nRailway operating ratio (percent)\nNon-GAAP Reconciliation for First Nine Months 2025\nMerger - Related Expenses\nRestructuring and Other Charges\nEastern Ohio Incident\n($ in millions, except per share amounts)\nRailway operating expenses\nIncome from railway operations\nDiluted earnings per share\nRailway operating ratio (percent)\nNon-GAAP Reconciliation for First Nine Months 2024\nGains on Railway Line Sales\nEastern Ohio Incident\nShareholder Advisory Costs\nDeferred Income Tax Adjustment\n($ in millions, except per share amounts)\nIn the table below, references to the results for the first nine months of 2025 and 2024 and related comparisons use the adjusted, non-GAAP results from the reconciliation in the tables above.\n($ in millions, except per share amounts)\nRailway operating expenses\nIncome from railway operations\nDiluted earnings per share\nRailway operating ratio (percent)\nOn an adjusted basis, income from railway operations increased in both periods. Railway operating revenues were higher in both periods, driven by a combination of improved traffic mix, favorable pricing, and increased volume, which was partially offset by lower fuel surcharge revenue. Adjusted railway operating expenses increased in the third quarter but decreased for the first nine months. Both periods reflect higher expenses in compensation and benefits, equipment rents, claims, and materials, which were partially offset by higher gains from the sales of operating property in the current year. The first nine months includes the impact of lower fuel prices, while the third quarter reflects higher fuel prices.\nDETAILED RESULTS OF OPERATIONS\n\nApproximately 95% of our revenue base is covered by contracts that include negotiated fuel surcharges. Revenues associated with these surcharges totaled $208 million and $238 million in the third quarters of 2025 and 2024, respectively, and $613 million and $757 million for the first nine months of 2025 and 2024, respectively. The decrease in fuel surcharge revenues is driven by lower fuel commodity prices.\nMerchandise revenues increased in both periods due to higher volume and increased average revenue per unit, driven by increased pricing and favorable mix partially offset by lower fuel surcharge revenue.\nAgriculture, forest and consumer products volume decreased in third quarter but was flat for the first nine months. Corn shipments declined in the third quarter due to decreased demand for shipments to the southeast over the prior year.\nChemicals volume rose in both periods, primarily due to increased natural gas liquids and sand shipments, where the mix of traffic had an unfavorable impact on revenue per unit. Natural gas liquids volume rose due to increased demand for product bound for export markets. Sand volume increased due to strong demand to support natural gas drilling.\nMetals and construction volume increased in the third quarter but was flat for the first nine months. Scrap metal and iron and steel volume increased in both periods due to stronger demand. Weather-related impacts earlier in the year negatively impacted shipments of aggregates.\nAutomotive volumes increased in both periods, driven by shippers increasing volume in anticipation of potential changes to tariffs, growth with existing customers and the absence of customer production issues seen in the prior year.\n\nUtility tonnage increased in both periods due to higher electricity demand and higher natural gas prices. Export tonnage decreased in both periods due to soft global demand and unfavorable seaborne coal pricing. Domestic metallurgical tonnage decreased in the third quarter due to customer outages. Industrial coal tonnage increased for the first nine months as a result of increased demand.\nRailway Operating Expenses\nRailway operating expenses summarized by major classifications follow ($ in millions):\nCompensation and benefits\nMerger-related expenses\nRestructuring and other charges\nEastern Ohio incident\nCompensation and benefits\nexpense increased in both periods as follows:\nincentive and stock-based compensation (up $52 million for the quarter and $105 million for the first nine months),\npay rates (up $17 million for the quarter and $60 million for the first nine months),\nhealth and welfare benefits (down $9 million for the quarter and $32 million for the first nine months),\nemployee activity levels (down $8 million for the quarter and $76 million for the first nine months), and\nother (down $4 million for the quarter and $14 million for the first nine months).\nAverage rail headcount for the quarter was down by approximately 510 compared with the third quarter of 2024.\nincludes the costs of services purchased from external vendors and contractors, including the net costs of operating joint facilities with other railroads. These expenses increased in the third quarter but decreased in the first nine months. The third quarter increase was due to higher derailment-related and bridge repair expenses. The de"
}