{
  "source_file": "ntrs-20241231.htm",
  "form_type": "10-K",
  "item1_clean": "ITEM 1 – BUSINESS\nNorthern Trust Corporation\nNorthern Trust Corporation (the “Corporation”) is a leading provider of wealth management, asset servicing, asset management and banking solutions to corporations, institutions, families and individuals. The Corporation is a financial holding company conducting business through various U.S. and non-U.S. subsidiaries, including The Northern Trust Company (Bank).\nThe Bank is an Illinois banking corporation headquartered in Chicago and the Corporation’s principal subsidiary. Founded in 1889, the Bank conducts its business through its U.S. operations and its various U.S. and non-U.S. branches and subsidiaries. At December 31, 2024, the Bank had consolidated assets of $154.9 billion and common bank equity capital of $10.8 billion.\nThe Corporation was formed as a holding company for the Bank in 1971. The Corporation has a global presence with offices in 24 U.S. states and Washington, D.C., and across 22 locations in Canada, Europe, the Middle East and the Asia-Pacific region. At December 31, 2024, the Corporation had consolidated total assets of $155.5 billion and stockholders’ equity of $12.8 billion.\nThe Corporation expects that the Bank will continue in the foreseeable future to be the major source of the Corporation’s consolidated assets, revenues, and net income. Except where the context otherwise requires, references to “Northern Trust,” “we,” “us,” “our,” “its,” or similar terms mean Northern Trust Corporation and its subsidiaries on a consolidated basis.\nNorthern Trust focuses on managing and servicing client assets through its two client-focused reporting segments: Asset Servicing and Wealth Management. Asset management and related services are provided to Asset Servicing and Wealth Management clients primarily by the Asset Management business. The revenue and expenses of Asset Management and certain other support functions are allocated fully to Asset Servicing and Wealth Management. Northern Trust reports certain income and expense items not allocated to Asset Servicing and Wealth Management in a third reporting segment, Other.\nASSET SERVICING\nAsset Servicing (AS) is a leading global provider of asset servicing and related services to corporate and public retirement funds, foundations, endowments, fund managers, insurance companies, sovereign wealth funds, and other institutional investors around the globe. Asset servicing and related services encompass a full range of capabilities including but not limited to: custody; fund administration; investment operations outsourcing; investment management; investment risk and analytical services; employee benefit services; securities lending; foreign exchange; treasury management; brokerage services; transition management services; banking; and cash management. Client relationships are managed through the Bank and the Bank’s and the Corporation’s other subsidiaries, including support from locations in North America, Europe, the Middle East, and the Asia-Pacific region. At December 31, 2024, total Asset Servicing assets under custody/administration (AUC/A), assets under custody, and assets under management (AUM) were $15.6 trillion, $12.2 trillion, and $1.2 trillion, respectively.\nWEALTH MANAGEMENT\nWealth Management (WM) focuses on high-net-worth individuals and families, business owners, executives, professionals, retirees, and established privately-held businesses in its target markets. In supporting these targeted segments, Wealth Management provides trust, investment management, custody, and philanthropic services; financial consulting; guardianship and estate administration; family business consulting; family financial education; brokerage services; and private and business banking. Wealth Management also includes Global Family Office, which provides customized services, including but not limited to: investment management; global custody; fiduciary; private banking; family office consulting; and technology solutions to meet the complex financial and reporting needs of ultra-high-net-worth individuals and family offices across the globe.\nWealth Management is one of the largest providers of advisory services in the United States, with AUC/A, assets under custody, and AUM of $1.1 trillion, $1.1 trillion, and $450.7 billion, respectively, at December 31, 2024. Wealth Management services are delivered by multidisciplinary teams through a network of offices in 19 U.S. states and Washington, D.C., as well as offices in London, Guernsey, Singapore, and Abu Dhabi.\n2024 ANNUAL REPORT | NORTHERN TRUST CORPORATION\nASSET MANAGEMENT\nAsset Management, through the Corporation’s various subsidiaries, supports the Asset Servicing and Wealth Management reporting segments by providing a broad range of asset management and related services and other products to clients around the world. Investment solutions are delivered through separately managed accounts, bank common and collective funds, registered investment companies, exchange traded funds, non-U.S. collective investment funds, and unregistered private investment funds. Asset Management’s capabilities include active and passive equity; active and passive fixed income; cash management; multi-asset and alternative asset classes (such as private equity and hedge funds of funds); and multi-manager advisory services and products. Asset Management’s activities also include overlay services and other risk management services. Asset Management operates internationally through subsidiaries and distribution arrangements and its revenue and expense are fully allocated to Asset Servicing and Wealth Management. As discussed above, Northern Trust managed $1.6 trillion in assets as of December 31, 2024, including $1.2 trillion for Asset Servicing clients and $450.7 billion for Wealth Management clients.\nNorthern Trust faces intense competition in all aspects and areas of its business. Competition comes from both regulated and unregulated financial services organizations, whose products and services span the local, national, and global markets in which Northern Trust conducts operations. Our competitors include a broad range of financial institutions and service companies, including other custodial banks, investment counseling firms, deposit-taking institutions, asset management firms, benefits consultants, trust companies, investment banking firms, insurance companies, and various financial technology companies, including software providers and data services firms. As our businesses grow and markets evolve, we may encounter increasing and new forms of competition around the world.\nNorthern Trust’s business strategy is to provide exceptional quality financial services to targeted market segments in which it believes it has a competitive advantage to offer clients a unique value proposition. As part of this strategy, Northern Trust seeks to differentiate itself from its competitors with premier, holistic solutions and exceptional experiences tailored to meet clients’ needs. In addition, Northern Trust emphasizes the development and growth of recurring and scalable sources of fee-based income and continual productivity improvements. Northern Trust also seeks to maintain its foundational strength with a strong, conservative balance sheet and a globally respected brand.\nEconomic Conditions And Government Policies\nThe earnings of Northern Trust are affected by numerous external influences. Chief among these are general economic conditions, both domestic and international, and actions that governments and their central banks take in managing their economies. These general conditions affect all of Northern Trust’s businesses, as well as the quality, value, and profitability of its loan and investment portfolios.\nThe Board of Governors of the Federal Reserve System (Federal Reserve Board) implements monetary policy through its open market operations in United States Government securities, its setting of the discount rate at which member banks may borrow from Federal Reserve Banks, and its changes in the reserve requirements for deposits. The policies adopted by the Federal Reserve Board directly affect interest rates and therefore what banks earn on their loans and investments and what they pay on their savings and time deposits and other purchased funds.\nSupervision and Regulation\nNorthern Trust is subject to extensive regulation and supervision under state and federal laws in the United States and in each of the jurisdictions in which it does business. The descriptions below outline significant elements of selected laws and regulations applicable to Northern Trust and are qualified in their entirety by reference to the particular statutory or regulatory provisions summarized. These descriptions do not summarize all laws and regulations applicable to Northern Trust or all possible or proposed changes to such laws or regulations and are not intended to be a substitute for the related statutes or regulatory provisions.\nChanges in laws or regulations applicable to Northern Trust may have a material effect on its businesses and results of operations. The scope of the laws and regulations, and the intensity of the supervision to which Northern Trust is subject have increased in recent years, initially in response to the financial crisis, and more recently in light of other factors, including the banking turmoil in early 2023, technological factors, market changes, and climate change concerns. Regulatory enforcement and fines have also increased across the banking and financial services sector. Northern Trust expects that its business will remain subject to extensive regulation and heightened supervision.\n2024 ANNUAL REPORT | NORTHERN TRUST CORPORATION\nFINANCIAL HOLDING COMPANY REGULATION\nUnder U.S. law, the Corporation is a bank holding company that has elected to be a financial holding company subject to the supervision, examination, and regulation of the Federal Reserve Board. A financial holding company is permitted to engage in a broader range of financial activities than a bank holding company. The Federal Reserve Board has authority to limit the activities that a financial holding company may conduct if any depository institution controlled by the financial holding company is found to no longer be “well-capitalized” and “well-managed” or has not received at least a “satisfactory” rating in its most recent Community Reinvestment Act (CRA) examination. Failure to meet one or more of these requirements may result in restrictions on the Corporation’s ability to exercise powers granted to financial holding companies, to engage in new activities, to continue current activities, or to make acquisitions. The Bank Holding Company Act also requires a bank holding company to obtain prior approval from the Federal Reserve Board before it acquires substantially all the assets of any bank, or ownership or control of more than 5% of the voting shares of any bank.\nSUBSIDIARY REGULATION\nThe Bank is a member of the Federal Reserve System, with deposits insured by the Federal Deposit Insurance Corporation (FDIC), and is subject to regulation by both agencies. As an Illinois banking corporation, the Bank is also subject to Illinois state laws and regulations and to examination and supervision by the Division of Banking of the Illinois Department of Financial and Professional Regulation. The Bank is also registered as a transfer agent with the Federal Reserve Board and is registered as a swap dealer with the U.S. Commodity Futures Trading Commission (CFTC) under the Commodity Exchange Act. As a result, the Bank is subject to supervision, examination and enforcement by certain other regulatory bodies, including the CFTC and the National Futures Association (NFA). The Corporation’s nonbanking affiliates are subject to examination by the Federal Reserve Board and, in certain circumstances, other functional regulators, as discussed in greater detail below.\nENHANCED PRUDENTIAL STANDARDS\nU",
  "item7_clean": "Compensation expense, the largest component of Noninterest Expense, increased in 2024 from 2023, primarily due to higher severance-related charges and an increase to base pay adjustments. Severance-related charges were $81.8 million in 2024 as compared to $36.7 million in 2023. Full-time equivalent employees totaled approximately 23,300 at December 31, 2024, up 1% from approximately 23,100 at December 31, 2023.\nOutside Services expense in 2024 increased from 2023, primarily reflecting higher consulting services and higher technical services.\nEquipment and Software\nEquipment and Software expense in 2024 increased from 2023, primarily due to higher software amortization and higher software support and rental expense.\nOccupancy expense in 2024 decreased from 2023, primarily due to charges related to early lease exists recorded during the prior-year period.\nOther Operating Expense\nOther Operating Expense in 2024 decreased from 2023 primarily due to an $84.6 million FDIC special assessment and a $25.6 million charge related to the write-off of an investment in a client capability, both recorded in the prior year, partially offset by a $70.0 million charitable contribution, a $10.6 million legal settlement, and $14.7 million of additional expense related to the FDIC special assessment, recorded in the current year. Please refer to Note 24, “Commitments and Contingent Liabilitie\nincluded under Item 8, “Financial Statements and Supplementary Data,” for additional details related to the FDIC special assessment.\nPlease refer to Note 19, “Other Operating Expense” included under Item 8, “Financial Statements and Supplementary Data,” for additional details related to other operating expenses.\nProvision for Income Taxes\nThe 2024 Provision for Income Taxes was $628.4 million, representing an effective rate of 23.6%. This compares with a Provision for Income Taxes of $357.5 million and an effective rate of 24.4% in 2023.\nSee Note 20, “Income Taxes,” provided in Item 8, “Financial Statements and Supplementary Data,” for more information on income taxes.\n2024 ANNUAL REPORT | NORTHERN TRUST CORPORATION\nMANAGEMENT’S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS\nREPORTING SEGMENTS AND RELATED\nINFORMATION\nNorthern Trust is organized around its two client-focused reporting segments: Asset Servicing and Wealth Management. Asset management and related services are provided to Asset Servicing and Wealth Management clients primarily by the Asset Management business. The revenue and expenses of Asset Management and certain other support functions are allocated fully to Asset Servicing and Wealth Management.\nReporting segment financial information, presented on an internal management-reporting basis, is determined by accounting systems used to allocate revenue and expense to each segment, and incorporates processes for allocating assets, liabilities, equity and the applicable interest income and expense utilizing a funds transfer pricing (FTP) methodology. Under the methodology, assets and liabilities receive a funding charge or credit that considers interest rate risk, liquidity risk, and other product characteristics on an instrument level. Additionally, segment information is presented on an FTE basis as management believes an FTE presentation provides a clearer indication of net interest income. The adjustment to an FTE basis has no impact on Net Income.\nEquity is allocated to the reporting segments based on a variety of factors including, but not limited to, risk, regulatory considerations, and internal metrics. Allocations of equity and certain corporate expense may not be representative of levels that would be required if the segments were independent entities. The accounting policies used for management reporting are consistent with those described in Note 1, “Summary of Significant Accounting Policies.” Transfers of income and expense items are recorded at cost; there is no consolidated profit or loss on sales or transfers between reporting segments. Northern Trust’s presentations are not necessarily consistent with similar information for other financial institutions.\nRevenues, expenses and average assets are allocated to Asset Servicing and Wealth Management, with the exception of non-recurring activities such as certain corporate transactions and costs incurred associated with acquisitions, divestitures, litigation, restructuring, and tax adjustments not directly attributable to a specific reporting segment, which are reported within the Other segment.\nReporting segment results are subject to reclassification when organizational changes are made. The results are also subject to refinements in revenue and expense allocation methodologies, which are typically reflected on a prospective basis.\nEffective January 2024, Northern Trust implemented certain enhancements to its FTP methodology, impacting the allocation of Net Interest Income to the Asset Servicing and Wealth Management segments. As a result, the approximate impact on the Asset Servicing and Wealth Management segments was a $132.0 million decrease and a $132.0 million increase in Net Interest Income, respectively, for the year ended December 31, 2024. Prior-year segment results have not been revised to reflect this methodology change.\nThe following tables reflect the earnings contribution and certain average balances of Northern Trust’s reporting segments for the years ended December 31, 2024, 2023, and 2022.\n2024 ANNUAL REPORT | NORTHERN TRUST CORPORATION\nMANAGEMENT’S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS\nTABLE 22: RESULTS OF REPORTING SEGMENTS\nASSET SERVICING\nWEALTH MANAGEMENT\nFOR THE YEAR ENDED DECEMBER 31\nTrust, Investment and Other Servicing Fees\nForeign Exchange Trading Income (Loss)\nOther Noninterest Income\nTotal Noninterest Income\nProvision for Credit Losses\nTotal Noninterest Expense\nIncome before Income Taxes\nProvision for Income Taxes\nPercentage of Consolidated Net Income\nFinancial measures stated on an FTE basis.\nOther Segment Items include Occupancy, Equipment & Software and Other Operating Expense.\nOTHER\nTOTAL CONSOLIDATED\nFOR THE YEAR ENDED DECEMBER 31\nTrust, Investment and Other Servicing Fees\nForeign Exchange Trading Income\nOther Noninterest Income (Loss)\nTotal Noninterest Income\nProvision for Credit Losses\nTotal Noninterest Expense\nIncome before Income Taxes\nProvision for Income Taxes\nPercentage of Consolidated Net Income\nOther Segment Items include Occupancy, Equipment & Software and Other Operating Expense.\n2024 ANNUAL REPORT | NORTHERN TRUST CORPORATION\nMANAGEMENT’S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS\nSegment results are stated on an FTE basis which has no impact on Net Income. Net Interest Income on an FTE basis includes FTE adjustments of $31.8 million, $57.5 million, and $45.6 million for 2024, 2023, and 2022, respectively. A reconciliation of total consolidated revenue, Net Interest Income and net interest margin on a GAAP basis to revenue, Net Interest Income and net interest margin on an FTE basis, respectively, (each of which is a non-GAAP financial measure) is provided in “Supplemental Information—Reconciliation to Fully Taxable Equivalent” within this “Management’s Discussion and Analysis of Financial Condition and Results of Operations” section.\n\nAsset Servicing is a leading global provider of asset servicing and related services to corporate and public retirement funds, foundations, endowments, fund managers, insurance companies, sovereign wealth funds, and other institutional investors around the globe. Asset servicing and related services encompass a full range of capabilities including but not limited to: custody; fund administration; investment operations outsourcing; investment management; investment risk and analytical services; employee benefit services; securities lending; foreign exchange; treasury management; brokerage services; transition management services; banking; and cash management. Client relationships are managed through the Bank and the Bank’s and the Corporation’s other subsidiaries, including support from locations in North America, Europe, the Middle East, and the Asia-Pacific region.\nAsset Servicing Trust, Investment and Other Servicing Fees\nFor an explanation of Asset Servicing Trust, Investment, and Other Servicing Fees, please see the “Trust, Investment, and Other Servicing Fees” section within the Consolidated Results of Operations section.\nAsset Servicing Foreign Exchange Trading Income\nForeign Exchange Trading Income for 2024 increased from 2023, primarily driven by higher client volumes.\nAsset Servicing Provision for Credit Losses\nThere was a negative Provision for Credit Losses of $4.6 million for 2024 compared to a Provision for Credit Losses of $0.5 million for 2023. The 2024 negative Provision for Credit Losses was primarily in the Commercial and Institutional (C&I) portfolio, driven by an improvement in credit quality. The Provision for Credit Losses during 2023 primarily reflected a deterioration in credit quality on a small number of loans at the time, offset by a better overall macroeconomic outlook.\nAsset Servicing Noninterest Expense\nAsset Servicing Noninterest Expense, which includes the direct expense of the reporting segment, indirect expense allocations for product and operating support, and indirect expense allocations for certain corporate support services, increased in 2024 from 2023. The increase primarily reflects higher expense allocations and an increase in Compensation expense due to higher severance related charges.\nWealth Management focuses on high-net-worth individuals and families, business owners, executives, professionals, retirees, and established privately-held businesses in its target markets. In supporting these targeted segments, Wealth Management provides trust, investment management, custody, and philanthropic services; financial consulting; guardianship and estate administration; family business consulting; family financial education; brokerage services; and private and business banking. Wealth Management also includes Global Family Office, which provides customized services, including but not limited to: investment management; global custody; fiduciary; and private banking; family office consulting, and technology solutions, to meet the complex financial and reporting needs of ultra-high-net-worth individuals and family offices across the globe. Wealth Management is one of the largest providers of advisory services in the United States with AUC/A, assets under custody, and AUM of $1.1 trillion, $1.1 trillion, and $450.7 billion, respectively, at December 31, 2024. Wealth Management services are delivered by multidisciplinary teams through a network of offices in 19 U.S. states and Washington, D.C., as well as offices in London, Guernsey, Singapore and Abu Dhabi.\nWealth Management Trust, Investment and Other Servicing Fees\nFor an explanation of Wealth Management Trust, Investment, and Other Servicing Fees, please see the “Trust, Investment, and Other Servicing Fees” section within the Consolidated Results of Operations section.\nWealth Management Other Noninterest Income\nOther Noninterest Income for 2024 decreased from 2023, primarily due to lower credit-related fees and swap fees; partially offset by an increase in core brokerage related fees.\n2024 ANNUAL REPORT | NORTHERN TRUST CORPORATION\nMANAGEMENT’S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS\nWealth Management Net Interest Income\nNet Interest Income on an FTE basis for 2024 increased from 2023, primarily due to the change in reporting segment allocation methodology beginning in 2024 noted above and higher deposit balances. Net interest margin on an FTE basis increased to 2.63% for 2024 from 2.20% in 2023.\nWealth Management Provision for Credit Losses\nThere was a Provision for Credit Losses of $8.8 million for 2024 compared to a Provision for Credit Losses of $24.0 million in 2023. The Provision for Credit Losses during 2024 was primarily due to an increase in the collective reserve, primarily in the C&I portfolio, driven by a small number of downgrades and increased duration, and the CRE portfolio, driven by exposure and portfolio quality; partially offset by a decrease in individual reserves, driven by a Commercial loan charge-off. The Provision for Credit Losses during 2023 reflected an increase in the reserve evaluated on a collective basis relating to the CRE portfolio, driven by an increase in exposure and duration of the portfolio, weaker economic projections for the industry, methodology updates, and portfolio quality at the time.\nWealth Management Noninterest Expense\nWealth Management Noninterest Expense, which includes the direct expense of the reporting segment, indirect expense allocations for product and operating support, and indirect expense allocations for certain corporate support services, increased in 2024 from 2023. The increase primarily reflects higher expense allocations and Compensation expense due to headcount and base pay adjustments.\nOther includes expenses for Asset Management, corporate and support functions not directly incurred by, but ultimately allocated back to, our two client-focused reporting segments. Income and expenses associated with non-recurring activities such as certain costs associated with acquisitions, divestitures, litigation, restructuring, and tax adjustments are retained within Other. Other also includes the FTE adjustments of $31.8 million, $57.5 million, and $45.6 million for 2024, 2023, and 2022, respectively, in order to reconcile the segment results that are reported on an internal management-reporting basis into consolidated results.\nOther—Noninterest Income (Loss)\nNoninterest Income (Loss) in 2024 primarily reflected the gain related to the net impact from the Visa-related transactions and the gain related to the sale of an equity investment, partially offset by the loss on sale of available for sale debt securities arising from a repositioning of the portfolio in the first quarter of 2024. In the prior year, there was $169.5 million of losses on sales of available for sale debt securities recognized in Investment Security Gains (Losses), net, in conjunction with repositionings of the portfolio.\nOther—Noninterest Expense\nNoninterest Expense in 2024 included a $70.0 million charitable contribution to the Northern Trust Foundation, a $14.7 million expense related to the FDIC special assessment, a $10.6 million legal settlement, and non-allocated occupancy expense primarily arising from early lease exits.\nAsset Management, through the Corporation’s various subsidiaries, supports the Asset Servicing and Wealth Management reporting segments by providing a broad range of asset management and related services and other products to clients around the world. Investment solutions are delivered through separately managed accounts, bank common and collective funds, registered investment companies, exchange traded funds, non-U.S. collective investment funds, and unregistered private investment funds. Asset Management’s capabilities include active and passive equity; active and passive fixed income; cash management; multi-asset and alternative asset classes (such as private equity and hedge funds of funds); and multi-manager advisory services and products. Asset Management’s activities also include overlay services and other risk management services. Asset Management operates internationally through subsidiaries and distribution arrangements and its revenue and expense are allocated fully to Asset Servicing and Wealth Management.\n2024 ANNUAL REPORT | NORTHERN TRUST CORPORATION\nMANAGEMENT’S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS\nAt December 31, 2024, Northern Trust managed $1.6 trillion in assets for personal and institutional clients, including $1.2 trillion for Asset Servicing clients and $450.7 bill",
  "item2_clean": null
}