{
  "source_file": "nue-20251004.htm",
  "form_type": "10-Q",
  "item1_clean": null,
  "item7_clean": null,
  "item2_clean": "The largest driver of the decrease in earnings in the first nine months of 2025 as compared to the first nine months of 2024 was the decreased earnings of the steel products segment. The steel products segment’s earnings decreased in the first nine months of 2025 as compared to the first nine months of 2024 due to lower average selling prices, with the most impactful decrease at our joist and deck business. Earnings in the steel mills segment decreased in the first nine months of 2025 as compared to the first nine months of 2024 due to lower average selling prices and margin compression caused by higher conversion costs, particularly in the first quarter of 2025. During the first nine months of 2025, average selling prices in the steel mills segment increased from the first quarter to the second quarter and stayed relatively flat in the third quarter as compared to the second quarter. This contrasts with the trend in average selling prices for the steel mills segment in the previous year, which decreased each consecutive quarter during the first nine months of 2024. Earnings in the raw materials segment increased in the first nine months of 2025 as compared to the first nine months of 2024 due to the prior year nine months including the previously mentioned $83 million impairment charge and the improved profitability of our DRI facilities.\nThe following discussion provides a greater quantitative and qualitative analysis of Nucor’s performance in the third quarter and first nine months of 2025 as compared to the third quarter and first nine months of 2024.\n\nWe expect earnings in the fourth quarter of 2025 to be lower than the third quarter of 2025. In the steel mills segment, the expected decrease is primarily due to lower overall volumes, along with lower average selling prices in our sheet mills. In the steel products segment, the expected decrease is mainly due to lower volumes. In the raw materials segment, the expected decrease is primarily due to lower realized pricing as well as planned outages at our DRI facilities.\nNucor’s largest exposure to market risk is in our steel mills and steel products segments. Our largest single customer in the third quarter of 2025 represented approximately 5% of sales and has consistently paid within terms. In the raw materials segment, we are exposed to price fluctuations related to the purchase of scrap and scrap substitutes, pig iron and iron ore. Businesses within the steel mills segment account for the majority of the raw materials segment’s sales.\n\nand processor; Nu-Iron Unlimited and Nucor Steel Louisiana LLC (\"Nucor Steel Louisiana\"), two facilities that produce DRI used by the steel mills; and our natural gas production operations.\nThe average utilization rates of all operating facilities in the steel mills, steel products and raw materials segments were approximately 83%, 62% and 72%, respectively, in the first nine months of 2025 compared with approximately 77%, 59% and 73%, respectively, in the first nine months of 2024.\nResults of Operations\nNucor reported net earnings attributable to Nucor stockholders of $607 million, or $2.63 per diluted share, for the third quarter of 2025, which represented an increase compared to net earnings attributable to Nucor stockholders of $250 million, or $1.05 per diluted share, for the third quarter of 2024.\nEarnings in the steel mills segment increased in the third quarter of 2025 as compared to the third quarter of 2024 due to increased metal margins and increased volumes amidst an improved demand environment compared to the prior year period. The steel products segment had similar earnings in the third quarter of 2025 as compared to the third quarter of 2024, the latter of which included $40 million of losses and impairments of assets. Excluding the impairment charge, earnings in the steel products segment decreased in the third quarter of 2025 as compared to the third quarter of 2024 primarily due to the decreased earnings of our joist and deck business and, to a lesser extent, decreased earnings of our metal buildings and rebar fabrication businesses. Earnings in the raw materials segment increased in the third quarter of 2025 as compared to the third quarter of 2024. Included in the third quarter of 2024 raw materials segment’s earnings was an $83 million impairment charge related to a long-term note receivable that management determined was no longer collectible. The increase in the raw materials segment’s earnings in the third quarter of 2025 as compared to the third quarter of 2024 was due to the absence of any impairment charges in the third quarter of 2025 and the improved profitability of our scrap brokerage and scrap processing operations.\n\nScrap prices are driven by the global supply and demand for scrap and other iron-based raw materials used to make steel. As we enter the fourth quarter of 2025, scrap prices are comparable to the third quarter of 2025.\nGross margins in the steel products segment decreased in the third quarter of 2025 compared to the third quarter of 2024, primarily due to decreases at our joist and deck business, and to a lesser extent, our metal buildings and rebar fabrication businesses.\nPre-operating and start-up costs of new facilities were approximately $103 million in the third quarter of 2025 and approximately $168 million in the third quarter of 2024. Pre-operating and start-up costs in the third quarter of 2025 primarily included costs related to the sheet mill under construction in West Virginia and the melt shop expansion in Arizona. Pre-operating and start-up costs in the third quarter of 2024 primarily included costs related to the sheet mill under construction in West Virginia, the plate mill in Kentucky, and the melt shop expansion in Arizona. Nucor defines pre-operating and start-up costs, all of which are expensed, as the losses attributable to facilities or major projects that are either under construction or in the early stages of operation. Once these facilities or projects have attained a utilization rate that is consistent with our similar operating facilities, Nucor no longer considers them to be in start-up.\n\nGross margins in the raw materials segment increased in the third quarter of 2025 as compared to the third quarter of 2024 primarily due to the increased earnings of our scrap brokerage and scrap processing operations.\nNucor recorded gross margins of $3.02 billion (12%) in the first nine months of 2025, which was a decrease compared to $3.48 billion (15%) in the first nine months of 2024.\nThe largest driver of the decrease in gross margins in the first nine months of 2025 as compared to the first nine months of 2024 was the decreased earnings of the steel products segment, which was primarily due to the decreased profitability of our joist and deck businesses.\nIn the steel mills segment, gross margins decreased in the first nine months of 2025 as compared to the first nine months of 2024 due to the previously mentioned decrease in average selling prices and higher conversion costs, particularly in the first quarter of 2025. The average scrap and scrap substitute cost per gross ton used in the first nine months of 2025 was $396, a 1% decrease compared to $399 in the first nine months of 2024.\nPre-operating and start-up costs of new facilities decreased to approximately $408 million in the first nine months of 2025 from approximately $430 million in the first nine months of 2024. Pre-operating and start-up costs in the first nine months of both 2025 and 2024 primarily included costs related to the plate mill in Kentucky, the sheet mill under construction in West Virginia, the melt shop expansion in Arizona and the rebar micro mill in North Carolina.\nGross margins in the raw materials segment increased in the first nine months of 2025 as compared to the first nine months of 2024 primarily due to the increased earnings of our DRI operations.\n\nCash used in financing activities in the first nine months of 2025 was $1.27 billion as compared to $2.60 billion in the first nine months of 2024. The primary uses of cash were repayments of long-term debt of $1.01 billion in the first nine months of 2025 as compared to $5 million in the first nine months of 2024. Additionally, stock repurchases used cash of $600 million in the first nine months of 2025 as compared to $1.90 billion in the first nine months of 2024, a decrease of $1.30 billion. The primary source of cash in the first nine months of 2025 was proceeds from the issuance and sale of long-term debt, net of discount to the public, of $997 million. In the first quarter of 2025, Nucor issued and sold $500 million aggregate principal amount of its 4.650% Notes due 2030 and $500 million aggregate principal amount of its 5.100% Notes due 2035. Net proceeds from the issuance and sale of these Notes were used to redeem all of the outstanding $500 million aggregate principal amount of our 2.000% Notes due 2025 and $500 million aggregate principal amount of our 3.950% Notes due 2025 (collectively, the \"2025 Notes\") pursuant to the terms of the indenture governing the 2025 Notes.\n\nCash used in investing activities in the first nine months of 2025 was $2.51 billion as compared to $2.77 billion in the first nine months of 2024, a decrease of $261 million. Cash used for capital expenditures of $2.62 billion in the first nine months of 2025 increased by $326 million as compared to the same period of 2024 primarily due to the sheet mill under construction in West Virginia and the construction of two manufacturing locations to expand Nucor Towers & Structures (\"NTS\"). Capital expenditures for 2025 are estimated to be approximately $3.30 billion as compared to $3.17 billion in 2024. The projects that we anticipate will have the largest capital expenditures in 2025 are the sheet mill under construction in West Virginia, the construction of two manufacturing locations to expand NTS, and the galvanizing line at our sheet mill in South Carol"
}