{
  "source_file": "nvda-20251026.htm",
  "form_type": "10-Q",
  "item1_clean": null,
  "item7_clean": null,
  "item2_clean": "Due in one to five years\nDue in five to ten years\nDue in greater than ten years\nUnamortized debt discount and issuance costs\nLess short-term portion\nTotal long-term portion\nWe have a $575 million commercial paper program to support general corporate purposes. As of October 26, 2025, we had no commercial paper outstanding.\nMaterial Cash Requirements and Other Obligations\nUnrecognized tax benefits were $3.2 billion, which includes related interest and penalties, and were recorded in non-current income tax payable as of October 26, 2025. We are unable to estimate the timing of any potential tax liability, interest payments, or penalties in individual years due to uncertainties in the underlying income tax positions and the timing of the effective settlement of such tax positions. Refer to Note 4 of the Notes to Condensed Consolidated Financial Statements for further information.\nWe expect to continue investing in strategic partnerships. In the third quarter of fiscal year 2026, we committed to invest $5 billion in Intel Corporation, subject to regulatory approval, and we entered into a letter of intent with an opportunity to invest in OpenAI. In November 2025, we entered into an agreement, subject to certain closing conditions, to invest up to $10 billion in Anthropic. There is no assurance that any investment will be completed on expected terms, if at all. Refer to Item 1A. Risk Factors for additional information regarding our investments.\nTo date, there has been no material impact to our results of operations associated with global sustainability regulations, compliance, costs from sourcing renewable energy or climate-related business trends.\nAdoption of New and Recently Issued Accounting Pronouncements\nThere has been no adoption of any new and recently issued accounting pronouncements.\n\nAll references to “NVIDIA,” “we,” “us,” “our” or the “Company” mean NVIDIA Corporation and its subsidiaries.\n© 2025 NVIDIA Corporation. All rights reserved.\nOur Company and Our Businesses\nNVIDIA pioneered accelerated computing to help solve the most challenging computational problems. Since our original focus on PC graphics, we have expanded to several other large and important computationally intensive fields. Fueled by the sustained demand for exceptional 3D graphics and the scale of the gaming market, NVIDIA has leveraged its GPU architecture to create platforms for scientific computing, AI, data science, autonomous vehicles, robotics, and digital twin applications.\nHeadquartered in Santa Clara, California, NVIDIA was incorporated in California in April 1993 and reincorporated in Delaware in April 1998.\nRecent Developments, Future Objectives and Challenges\nRevenue growth in the third quarter was driven by data center compute and networking platforms for accelerated computing and AI solutions. Our Blackwell architectures are the majority of our Data Center revenue.\nThe availability of data centers, energy, and capital to support the buildout of NVIDIA AI infrastructure by our customers is crucial, and any shortage of these resources could impact our future revenue and financial performance. Expanding energy capacity to meet demand is a complex, multi-year process that involves significant regulatory, technical, and construction challenges. In addition, access to capital can be particularly constrained for less-capitalized companies, which may face difficulties securing financing for large-scale infrastructure projects. These limitations could delay customer deployments or reduce the scale of accelerated computing and AI adoption.\nWe continue to execute Data Center compute product introductions, bringing new advanced architectures on a one-year product cadence. We began shipping production units of our new Blackwell Ultra platforms including GB300 in the second quarter of fiscal year 2026 and continue to sell prior generation architecture. The complexity of our product transitions and sophisticated system configurations may cause delays in production or create challenges in managing supply and demand. This could result in revenue volatility, quality issues, increased inventory provisions, and/or increased warranty costs. Customers may postpone purchasing new architectures or may adopt new technologies more gradually than anticipated, affecting our revenue timing and supply chain expenses.\nIn April 2025, the U.S. government, or USG, informed us that a license is required for exports of our H20 product into the China market. As a result of these new requirements, we incurred a $4.5 billion charge in the first quarter of fiscal year 2026 associated with H20 for excess inventory and purchase obligations, as the demand for H20 diminished. In August 2025, the USG granted licenses that would allow us to ship certain H20 products to certain China-based customers, but to date, we have generated approximately $50 million in H20 revenue under those licenses. USG officials have expressed an expectation that the USG will receive 15% or more of the revenue generated from licensed sales of our products, but to date, the USG has not published a regulation codifying such requirement.\nIn January 2025, the USG published the “AI Diffusion” Interim Final Rule, or IFR, in the Federal Register. The IFR would have imposed a worldwide licensing requirement on our most recent data center products, such as our H200, GB200 and GB300. In May 2025, the USG announced that it would rescind the AI Diffusion IFR and implement a replacement rule. The scope, timing, and requirements of the forthcoming rule remain uncertain. The replacement rule may impose new restrictions on our products or operations and/or add license requirements that could have a material impact on our business, operating results, and financial condition. For example, in October 2025, the Senate passed the “GAIN AI Act” in the National Defense Authorization Act, or the NDAA. The GAIN AI Act would restrict the Trump Administration’s ability to adapt the Biden Administration’s export control rules and could also allow private U.S. persons to review and overturn licensing and foreign policy decisions made by the Trump Administration.\nThe recent rise in high-quality open-source foundation models is making advanced AI capabilities broadly accessible. Open-source AI is dependent on developer adoption and if deployed on our competitors’ platforms, it could reduce demand for our products and services.\nThe rapid evolution of global trade policies, such as export controls and tariffs, has added complexity and increased costs throughout our supply chain, and these challenges are likely to persist. Ongoing uncertainty regarding the scope and application of such measures may adversely affect investment decisions by us and our partners, disrupt supply chain operations, and impact the timing and volume of customer purchases due to challenges in forecasting future costs and demand.\nWe are increasing our U.S.-based manufacturing and investing in specialized equipment and processes to support domestic production. This move is expected to strengthen our supply chain, add resiliency and redundancy, and meet the growing demand for AI infrastructure. Our ability to increase manufacturing capabilities will depend on the domestic manufacturing ecosystem's capacity to ramp production supply to the required volume and on a timely basis.\nMacroeconomic factors, including tariffs, inflation, interest rate changes, capital market volatility, global supply chain constraints, and global economic and geopolitical developments, have direct and indirect impacts on our results of operations, particularly demand for our products. While difficult to isolate and quantify, these macroeconomic factors impact our supply chain and manufacturing costs, employee wages, costs for capital equipment and value of our investments. Our product and solution pricing generally does not fluctuate with short-term changes in our costs. Within our supply chain, we continuously manage product availability and costs with our vendors.\nRefer to “Item 1A. Risk Factors” for a discussion of these factors and other risks.\nThird Quarter of Fiscal Year 2026 Summary\nQuarter-over-Quarter Change\nYear-over-Year Change\n\nCompute & Networking\nCompute & Networking revenue\n– The year over year increase in the third quarter and first nine months of fiscal year 2026 was driven by three platform shifts –accelerated computing, powerful AI models, and agentic applications. Revenue from Data Center computing grew 59% year-on-year compared to the first nine months of fiscal year 2025, driven by demand for our Blackwell computing platform. Revenue from Data Center networking grew 105% year-on-year compared to the first nine months of fiscal year 2025 driven by the introduction and continued growth of NVLink compute fabric for GB200 and GB300 systems, the growth of XDR InfiniBand products, and adoption of Ethernet for AI solutions.\n– The year over year increase in the third quarter and first nine months of fiscal year 2026 was driven by sales of our Blackwell architecture.\nReportable segment operating income\n– The year over year increase in Compute & Networking segment operating income in the third quarter of fiscal year 2026 was driven by growth in revenue. The year over year increase in Compute & Networking segment operating income in the first nine months of fiscal year 2026 was driven by the growth in revenue, partially offset by a $4.5 billion charge associated with H20 excess inventory and purchase obligations in the first quarter of fiscal year 2026. The year over year increase in Graphics segment operating income in the third quarter and first nine months of fiscal year 2026 was driven by the growth in revenue.\nConcentration of Revenue\nWe refer to customers who purchase products directly from NVIDIA as direct customers, such as add-in board manufacturers, distributors, ODMs, OEMs, CSPs, hyperscale companies, and system integrators. Certain direct customers may use ei"
}