{
  "source_file": "nvr-20250930.htm",
  "form_type": "10-Q",
  "item1_clean": null,
  "item7_clean": null,
  "item2_clean": "Loan closing volume for the three and nine months ended September 30, 2025 decreased by approximately $116,700, or 7%, and $36,600, or 1%, respectively, from the same periods in 2024. The decrease in loan closing volume during the three and nine months ended September 30, 2025 was primarily attributable to a lower number of loans closed in the respective periods resulting from fewer homebuilder settlements.\nSegment profit for the three months ended September 30, 2025 decreased by approximately $3,000, or 8%, from the same period in 2024. This decrease was primarily due to a reduction of approximately $6,100, or 11%, in mortgage banking fees, driven by lower gains on loan sales. This was partially offset by a $3,200 decline in SG&A expenses compared to the same period in the prior year.\nSegment profit for the nine months ended September 30, 2025 decreased by approximately $14,300, or 13%, from the same period in 2024. This decrease was primarily attributable to a decrease of approximately $14,900, or 9%, in mortgage banking fees due to a decrease in gains on sales of loans.\nWe historically have experienced variability in our quarterly results, generally having higher New Order activity in the first half of the year and higher home settlements, revenue and net income in the second half of the year. However, in recent years our typical seasonal trends have been affected by significant changes in market conditions. As a result, our quarterly results of operations are not necessarily indicative of the results that may be expected for the full year.\nOur effective tax rate for the three and nine month periods ended September 30, 2025 was 22.8% and 24.5%, respectively, compared to 20.3% and 20.6% for the three and nine months ended September 30, 2024, respectively. The increase in the effective tax rate in the three and nine month periods ended September 30, 2025 compared to the same periods in 2024 was primarily attributable to a lower income tax benefit recognized for excess tax benefits from stock option exercises, which totaled approximately $13,400 and $19,700 for the three and nine months ended September 30, 2025, respectively, and approximately $23,100 and $73,700 for the three and nine months ended September 30, 2024, respectively.\nWe expect continued tax rate volatility in future periods attributable to the recognition of excess tax benefits from equity-based awards activity and distributions from the deferred compensation plans. Given the limited number of participants in our deferred compensation plan, the retirement of a participant could result in a significant distribution of the rabbi trust shares and corresponding tax deduction for the Company.\nOn July 4, 2025, the One Big Beautiful Bill Act (the \"Act\") was signed into law, implementing several changes to U.S. federal tax law. The Company has evaluated the provisions of the Act and does not expect the Act to have a material impact on its consolidated financial statements.\nLiquidity and Capital Resources\nWe fund our operations primarily from our current cash holdings and cash flows generated by operating activities. In addition, we have available a short-term unsecured working capital revolving credit facility and revolving mortgage repurchase facility, as further described below. As of September 30, 2025, we had approximately $2,000,000 in cash and cash equivalents, approximately $289,800 in unused committed capacity under our revolving credit facility and $150,000 in unused committed capacity under our revolving mortgage repurchase facility.\nMaterial Cash Requirements\nWe believe that our current cash holdings, cash generated from operations, and cash available under our short-term unsecured credit agreement and revolving mortgage repurchase facility, as well as the public debt and equity markets, will be sufficient to satisfy both our short term and long term cash requirements for working capital to support our daily operations and meet commitments under our contractual obligations with third parties. Our material contractual obligations primarily consist of the following:\n(i) Payments due to service our debt and interest on that debt. Our Senior Notes have an outstanding aggregate principal balance of $900,000 and mature in May 2030. Future interest payments on our outstanding Senior Notes total $131,550, with $27,000 due within the next twelve months.\n(ii) Payment obligations totaling approximately $640,900 under existing LPAs for deposits to be paid to land developers, assuming that contractual development milestones are met by the developers and we exercise our option to acquire finished lots under those LPAs. We expect to make the majority of these payments within the next three years.\n\nNorth Carolina, South Carolina, Tennessee, Florida, Georgia and Kentucky\nOur lot acquisition strategy is predicated upon avoiding the financial requirements and risks associated with direct land ownership and development. We generally do not engage in land development (see discussion below of our land development activities). Instead, we typically acquire finished building lots from various third party land developers pursuant to fixed price finished lot purchase agreements (“LPAs”). These LPAs require deposits, typically ranging up to 10% of the aggregate purchase price of the finished lots, in the form of cash or letters of credit that may be forfeited if we fail to perform under the LPA. This strategy has allowed us to maximize inventory turnover, which we believe enables us to minimize market risk and to operate with less capital, thereby enhancing rates of return on equity and total capital.\nIn addition to constructing homes primarily on a pre-sold basis and utilizing what we believe is a conservative lot acquisition strategy, we focus on obtaining and maintaining a leading market position in each market we serve. This strategy allows us to gain valuable efficiencies and competitive advantages in our markets, which we believe contributes to minimizing the adverse effects of regional economic cycles and provides growth opportunities within these markets. Our continued success is contingent upon our ability to control an adequate supply of finished lots on which to build.\nIn certain specific strategic circumstances, we deviate from our historical lot acquisition strategy and engage in joint venture arrangements with land developers or directly acquire raw ground already zoned for its intended use for development. Once we acquire control of raw ground, we determine whether to sell the raw parcel to a developer and enter into an LPA with the developer to purchase the finished lots or to hire a developer to develop the land on our behalf. While joint venture arrangements and direct land development activity are not our preferred method of acquiring finished building lots, we may enter into additional transactions in the future on a limited basis where there exists a compelling strategic or prudent financial reason to do so. We expect, however, to continue to acquire substantially all our finished lot inventory using LPAs with forfeitable deposits.\nAs of September 30, 2025, we controlled approximately 175,300 lots as described below.\nLot Purchase Agreements\nWe controlled approximately 166,050 lots under LPAs with third parties through deposits in cash and letters of credit totaling approximately $907,600 and $4,000, respectively. Included in the number of controlled lots are approximately 15,000 lots for which we have recorded a contract land deposit impairment allowance of approximately $85,400 as of September 30, 2025.\nJoint Venture Limited Liability Corporations (“JVs”)\nWe had an aggregate investment totaling approximately $66,500 in\nJVs, expected to produce approximately 7,300 lots. Of the lots to be produced by the JVs, approximately 6,950 lots were controlled by us and approximately 350 were either under contract with unrelated parties or currently not under contract. We had additional JV funding commitments totaling approximately $11,700 as of September 30, 2025.\nLand Under Development\nWe owned land with a carrying value of approximately $38,000 that we intend to develop into approximately 2,300 finished lots.\nSee Notes 2, 3 and 4 to the condensed consolidated financial statements included herein for additional information regarding LPAs, JVs and land under development, respectively.\nRaw Land Purchase Agreements\nIn addition, we have certain properties under contract with land owners that are expected to yield approximately 47,100 lots, which are not included in the number of total lots controlled. Some of these properties may require rezoning or other approvals to achieve the expected yield. As of September 30, 2025, these properties are controlled with deposits in cash totaling approximately $46,100, of which approximately $10,400 is refundable if certain contractual conditions are not met. We generally expect to assign the raw land contracts to a land developer and simultaneously enter into an LPA with the assignee if the project is determined to be feasible.\nKey Financial Results\nOur consolidated revenues for the third quarter of 2025 totaled $2,609,505, a 5% decrease from the third quarter of 2024. Net income for the third quarter ended September 30, 2025 was $342,688, or $112.33 per diluted share. For the third quarter ended September 30, 2025, net income decreased 20% and diluted earnings per share decreased 14% when compared to net income and diluted earnings per share for the third quarter of 2024, respectively. Our homebuilding gross profit margin percentage decreased to 21.0% in the third quarter of 2025 from 23.4% in the third quarter of 2024. New orders, net of cancellations (“New Orders”) decreased by 16% in the third quarter of 2025 compared to the third quarter of 2024. The New Order cancellation rate for the third quarter of 2025 increased to 19.4% from 14.5% in the same period in 2024. The average sales price for New Orders in the third qua"
}