{
  "source_file": "nws-20250930.htm",
  "form_type": "10-Q",
  "item1_clean": null,
  "item7_clean": null,
  "item2_clean": "ITEM 2. MANAGEMENT’S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS\nINTRODUCTION\nNews Corporation (together with its subsidiaries, “News Corporation,” “News Corp,” the “Company,” “we” or “us”) is a global diversified media and information services company comprised of businesses across a range of media, including: information services and news, digital real estate services and book publishing.\nThe unaudited consolidated financial statements are referred to herein as the “Consolidated Financial Statements.” The consolidated statements of operations are referred to herein as the “Statements of Operations.” The consolidated balance sheets are referred to herein as the “Balance Sheets.” The consolidated statements of cash flows are referred to herein as the “Statements of Cash Flows.” The Consolidated Financial Statements have been prepared in accordance with generally accepted accounting principles in the United States of America (“GAAP”).\nManagement’s discussion and analysis of financial condition and results of operations is intended to help provide an understanding of the Company’s financial condition, changes in financial condition and results of operations. This discussion is organized as follows:\nOverview of the Company’s Businesses\n—This section provides a general description of the Company’s businesses, as well as developments that occurred to date during fiscal 2026 that the Company believes are important in understanding its results of operations and financial condition or to disclose known trends.\nResults of Operations\n—This section provides an analysis of the Company’s results of operations for the three months ended September 30, 2025 and 2024. This analysis is presented on both a consolidated basis and a segment basis. In addition, a brief description is provided of significant transactions and events that impact the comparability of the results being analyzed.\nLiquidity and Capital Resources\n—This section provides an analysis of the Company’s cash flows for the three months ended September 30, 2025 and 2024, as well as a discussion of the Company’s financial arrangements and outstanding commitments, both firm and contingent, that existed as of September 30, 2025.\nOVERVIEW OF THE COMPANY’S BUSINESSES\nThe Company manages and reports its businesses in the following five segments:\n—The Dow Jones segment consists of Dow Jones, a global provider of news and business information whose products target individual consumers and enterprise customers and are distributed through a variety of media channels including websites, mobile apps, newspapers, newswires, newsletters, magazines, proprietary databases, live journalism, video and podcasts. Dow Jones’s consumer products include premier brands such as\nThe Wall Street Journal\nInvestor’s Business Daily\n. Dow Jones’s professional information products, which target enterprise customers, include Dow Jones Risk & Compliance, a leading provider of data and other solutions to help customers identify and manage regulatory, corporate, geopolitical, security and reputational risk with tools focused on financial crime, sanctions, trade and other risks and compliance requirements, Dow Jones Energy, a leading provider of\npricing data, news, insights, analysis and other information for energy commodities and key base chemicals,\nFactiva, a leading provider of global business content, and Dow Jones Newswires, which distributes real-time business news, information and analysis to financial professionals and investors.\nDigital Real Estate Services\n—The Digital Real Estate Services segment consists of the Company’s 61.4% interest in REA Group and 80% interest in Move. The remaining 20% interest in Move is held by REA Group. REA Group is a market-leading digital media business specializing in property and is listed on the Australian Securities Exchange (“ASX”) (ASX: REA). REA Group advertises property and property-related services on its websites and mobile apps, including Australia’s leading residential, commercial and share property websites, realestate.com.au, realcommercial.com.au and Flatmates.com.au, property.com.au and Housing.com in India. In addition, REA Group provides property-related data to the financial sector and financial services through a digital property search and financing experience and a mortgage broking offering.\nMove is a leading provider of digital real estate services in the U.S. and primarily operates Realtor.com\n, a premier real estate information, advertising and services platform. Move offers real estate advertising solutions to agents and brokers, including its RealPRO Select\nSM\nSM\nPlus and Listing Toolkit products as well as its referral-based services, ReadyConnect Concierge\nSM\nTM\nSelling. Move also offers online tools and services to do-it-yourself landlords and tenants.\n—The Book Publishing segment consists of HarperCollins, the second largest consumer book publisher in the world, with operations in 15 countries and particular strengths in general fiction, nonfiction, children’s and religious publishing. HarperCollins owns more than 120 branded publishing imprints, including Harper, William Morrow, Mariner, HarperCollins Children’s Books, Avon, Harlequin and Christian publishers Zondervan and Thomas Nelson, and publishes works by well-known authors such as Harper Lee, George Orwell, Agatha Christie and Zora Neale Hurston, as well as global author brands including J.R.R. Tolkien, C.S. Lewis, Daniel Silva, Karin Slaughter and Dr. Martin Luther King, Jr. It is home to many beloved children’s books and series and a significant Christian publishing business.\n—The News Media segment consists primarily of News Corp Australia, News UK and the\nand the news.com.au website\n\n—Revenues increased $48 million, or 2%, for the three months ended September 30, 2025 as compared to the corresponding period of fiscal 2025.\nThe revenue increase for the three months ended September 30, 2025 was primarily due to higher revenues at the Dow Jones segment driven by higher circulation and subscription revenues and at the Digital Real Estate Services segment driven by higher revenues at Move and REA Group. These increases were partially offset by lower revenues at the Book Publishing segment driven by lower book sales. The impact of foreign currency fluctuations of the U.S. dollar against local currencies resulted in a revenue increase of $4 million for the three months ended September 30, 2025 as compared to the corresponding period of fiscal 2025.\nThe Company calculates the impact of foreign currency fluctuations for businesses reporting in currencies other than the U.S. dollar by multiplying the results for each quarter in the current period by the difference between the average exchange rate for that quarter and the average exchange rate in effect during the corresponding quarter of the prior year and totaling the impact for all quarters in the current period.\n—Operating expenses decreased $11 million, or 1%, for the three months ended September 30, 2025, as compared to the corresponding period of fiscal 2025.\nThe decrease in operating expenses for the three months ended September 30, 2025 was primarily due to lower expenses at the Book Publishing segment driven by lower costs related to lower sales volume and at the News Media segment driven by cost savings initiatives and lower Talk costs. The decrease was partially offset by higher expenses at the Digital Real Estate Services segment driven by higher employee costs. The impact of foreign currency fluctuations of the U.S. dollar against local currencies resulted in an Operating expense increase of $5 million, or 1%, for the three months ended September 30, 2025 as compared to the corresponding period of fiscal 2025.\nSelling, general and administrative\n—Selling, general and administrative increased $44 million, or 5%, for the three months ended September 30, 2025, as compared to the corresponding period of fiscal 2025.\nThe increase in Selling, general and administrative for the three months ended September 30, 2025 was primarily due to higher employee and marketing costs at the Dow Jones segment and a $13 million write-off of a customer receivable related to the expected closure of a book distributor and higher employee costs at the Book Publishing segment. The impact of foreign currency fluctuations of the U.S. dollar against local currencies resulted in a Selling, general and administrative increase of $1 million for the three months ended September 30, 2025 as compared to the corresponding period of fiscal 2025.\nDepreciation and amortization\n—Depreciation and amortization expense increased $5 million, or 4%, for the three months ended September 30, 2025, as compared to the corresponding period of fiscal 2025.\nImpairment and restructuring charges\n— During the three months ended September 30, 2025 and\n, the Company recorded impairment and restructuring charges of $19 million and $22 million, including restructuring charges of $14 million and $22 million, respectively.\nSee Note 4—Impairment and Restructuring Charges in the accompanying Consolidated Financial Statements.\nEquity losses of affiliates\n—Equity losses of affiliates improved by $1 million, or 33%, for the three months ended September 30, 2025, as compared to the corresponding period of fiscal 2025. See Note 5—Investments in the accompanying Consolidated Financial Statements.\nInterest income, net\n—Interest income, net improved by $6 million for the three months ended September 30, 2025 as compared to the corresponding period of fiscal 2025, primarily driven by higher interest income on cash balances and lower borrowings at REA Group. See Note 6—Borrowings and Note 8—Financial Instruments and Fair Value Measurements in the accompanying Consolidated Financial Statements.\n—For the three months ended September 30, 2025 and 2024, the Company recorded Other, net of $4 million and $22 million, respectively.\nSee Note 13—Additional Financial"
}