{
  "source_file": "nxpi-20250928.htm",
  "form_type": "10-Q",
  "item1_clean": null,
  "item7_clean": null,
  "item2_clean": "Item 2. Management’s Discussion and Analysis of Financial Condition and Results of Operations\n, and the Financial Statements and the related Notes that appear elsewhere in this document.\nQuarterly Financial Highlights\nRevenue was $3,173 million, down 2.4% year-on-year;\nGAAP gross margin was 56.3%, and GAAP operating margin was 28.1%;\nNon-GAAP gross margin was 57.0%, and non-GAAP operating margin was 33.8%;\nCash flow from operations was $585 million, with net capital expenditures on property, plant and equipment of $76 million, resulting in non-GAAP free cash flow of $509 million;\nDuring the third quarter of 2025, NXP returned capital to shareholders with the payment of $256 million in cash dividends and the repurchase of $54 million of its common shares, for a total capital return of $310 million.\nOn October 24, 2025, NXP closed the previously announced acquisition of 100% of Aviva Links for $243 million in cash, before closing adjustments. Aviva Links is a provider of Automotive SerDes Alliance (ASA) compliant in-vehicle connectivity solutions. The Aviva Links acquisition complements and expands NXP’s automotive networking solutions in the Automotive and Industrial & IoT end markets. We are currently evaluating the purchase price allocation for this transaction and expect to have our preliminary allocation completed in the fourth quarter of 2025.\nOn October 27, 2025, NXP closed the previously announced acquisition of 100% of Kinara, Inc. for $307 million in cash, before closing adjustments. Kinara is an industry leader in high performance, energy-efficient and programmable discrete neural processing units (NPUs). The Kinara acquisition complements and expands NXP’s solutions for AI-powered edge systems in the Industrial & IoT and Automotive end markets. We are currently evaluating the purchase price allocation for this transaction and expect to have our preliminary allocation completed in the fourth quarter of 2025.\nSee Note 3 to the consolidated financial statements for further information regarding NXP’s acquisition of TTTech Auto (acquired in Q2), Aviva Links, and Kinara, Inc.\nFollowing the previous announcement on April 28, 2025, Kurt Sievers has voluntarily retired as CEO and executive director of the Company effective October 28, 2025. The Company’s Board of Directors has unanimously appointed Rafael Sotomayor to succeed Mr. Sievers as President and CEO and temporary executive director of the Company effective as of October 28, 2025.\nQ3 2025 compared to Q2 2025\nRevenue for the three months ended September 28, 2025 was $3,173 million compared to $2,926 million for the three months ended June 29, 2025, an increase of $247 million or 8.4% quarter-on-quarter, in line with management's expectations. Within our end markets, the Automotive end market increased $108 million or 6.2%, the Mobile end market increased $99 million or 29.9%, the Industrial & IoT end market increased $33 million or 6.0%, and the Communication Infrastructure & Other end market increased $7 million or 2.2%.\nWhen aggregating all end markets together and reviewing sales channel performance, revenues through NXP's third party distribution partners was $1,866 million, an increase of $230 million or 14.1% compared to the previous period. Revenues through NXP's third party direct OEM and EMS customers was $1,269 million, an increase of $12 million or 1.0% versus the previous period.\nFrom a geographic perspective, revenue increased quarter-on-quarter in the China region by 13.0%, in the Americas region by 11.2%, in the Asia Pacific region by 7.7%, and in the EMEA region by 0.4%.\nOur gross profit percentage for the three months ended September 28, 2025 of 56.3% increased compared with 53.4% for the three months ended June 29, 2025, driven mainly by lower restructuring costs.\nOperating income for the three months ended September 28, 2025 was $893 million compared to $687 million for the three months ended June 29, 2025, an increase of $206 million or 30.0%. The sequential increase was mainly driven by higher revenue.\nResults of operations\nThe following table presents operating results for each of the three- and nine-month periods ended September 28, 2025 and September 29, 2024, respectively:\n($ in millions, unless otherwise stated)\nQ3 2025\nQ3 2024\nYTD 2025\nYTD 2024\nResearch and development\nSelling, general and administrative\nAmortization of acquisition-related intangible assets\nOther income (expense)\nOperating income (loss)\nFinancial income (expense)\nBenefit (provision) for income taxes\nResults relating to equity-accounted investees\nLess: Net income (loss) attributable to non-controlling interests\nNet income (loss) attributable to stockholders\nDiluted earnings per share\nQ3 2025 compared to Q3 2024\nRevenue for the three months ended September 28, 2025 was $3,173 million compared to $3,250 million for the three months ended September 29, 2024,\n\nQ3 2025 compared to Q3 2024\nThe effective tax rate of 18.6% for the third quarter of 2025 was lower than the EAETR due to the income tax benefit for discrete items of $1 million. The discrete items are primarily related to the impact of foreign currency on income tax related items, changes in estimates for previous years, and changes in the litigation accrual and related insurance reimbursements relating to the Motorola Personal Injury Lawsuits regarding previous years.\nYTD 2025 compared to YTD 2024\nFor the first nine months ended 2025, the effective tax rate of 19.4% was higher than 18.6% due to a net result of unfavorable discrete items of $14 million. These discrete items are primarily related to the impact of changes in estimates for previous years, and changes in the litigation accrual and related insurance reimbursements relating to the Motorola Personal Injury Lawsuits.\nThe effective tax rate of 19.4% for the first nine months of 2025 was higher compared to the rate for the first nine months ended 2024 of 18.6% due to a different mix of the benefit (provision) for income taxes in our operating locations and lower foreign tax incentives in the current period as a result of a decrease in qualifying income.\nOn July 4, 2025, the One Big Beautiful Bill Act (“OBBBA”) was enacted in the U.S. The OBBBA includes significant provisions, such as the permanent extension of certain expiring provisions of the Tax Cuts and Jobs Act, modifications to the international tax framework and the restoration of favorable tax treatment for certain business provisions. The legislation has multiple effective dates, with certain provisions effective in 2025 and others implemented as of 2026. We have assessed that there is effectively no material tax impact on our consolidated financial statements. We also note that there is still unclarity about what the G7 statement in relation to the US on global minimum taxes, as announced on June 28, 2025, could mean for the Company.\nResults Relating to Equity-accounted Investees\nQ3 2025 compared to Q3 2024\nResults relating to equity-accounted investees amounted to a loss of $1 million for the three months ended September 28, 2025, whereas the three months ended September 29, 2024 results relating to equity-accounted investees amounted to a loss of $6 million.\nYTD 2025 compared to YTD 2024\nResults relating to equity-accounted investees amounted to a loss of $33 million (which includes an impairment charge of $27 million related to our investment in SigmaSense) for the nine months ended September 28, 2025, whereas the nine months ended September 29, 2024 results relating to equity-accounted investees amounted to a loss of $10 million.\nNon-controlling Interests\nQ3 2025 compared to Q3 2024\nNon-controlling interests are related to the third-party share in the results of consolidated companies, predominantly SSMC. Their share of non-controlling interests amounted to a profit of $15 million for the three months ended September 28, 2025, compared to a profit of $11 million for the three months ended September 29, 2024.\nYTD 2025 compared to YTD 2024\nNon-controlling interests are related to the third-party share in the results of consolidated companies, predominantly SSMC. Their share of non-controlling interests amounted to a profit of $34 million for the nine months ended September 28, 2025, compared to a profit of $22 million for the nine months ended September 29, 2024.\nLiquidity and Capital Resources\nWe derive our liquidity and capital resources primarily from our cash flows from operations. We continue to generate strong positive operating cash flows. At the end of the third quarter of 2025, our cash balance was $3,454 million, an increase of $162 million compared to December 31, 2024. Taking into account the available amount of the unsecured revolving credit facility of $2,500 million (\"RCF\"), we had access to $5,954\n\nThe following tables present summarized financial information of the Obligor Group on a combined basis, with intercompany balances and transactions between entities of the Obligor Group eliminated and investments and equity in the earnings of the Non-Guarantor Subsidiaries excluded. The Obligor Group’s amounts due from, amounts due to, and intercompany transactions with Non-Guarantor Subsidiaries have been disclosed below the table, when material.\nSummarized Statements of Income\nFor the nine months ended\nSummarized Balance Sheets\nNon-current liabilities\nObligor's Group equity\nTotal liabilities and Obligor's Group equity\nNXP Semiconductors N.V. is the head of a fiscal unity for the corporate income tax and VAT that contains the most significant Dutch wholly-owned group companies. The Company is therefore jointly and severally liable for the tax liabilities of the tax entity as a whole, and as such the income tax expense of the Dutch fiscal unity has been included in the Net income of the Obligor Group.\nThe financial information of the Obligor Group includes sales executed through a Non-Guarantor Subsidiary single-billing entity as a sales agent on behalf of an entity in the Obl"
}