{
  "source_file": "o-20250930.htm",
  "form_type": "10-Q",
  "item1_clean": null,
  "item7_clean": null,
  "item2_clean": "Management’s Discussion and Analysis of Financial Condition and Results of Operations\nFORWARD-LOOKING STATEMENTS\nAdditional factors that may cause risks and uncertainties include those risks described in our Annual Report on\nReaders are cautioned not to place undue reliance on forward-looking statements. Forward-looking statements are not guarantees of future plans and performance and speak only as of the date this quarterly report was filed with the SEC. Past operating results and performance are provided for informational purposes and are not a guarantee of future results. There can be no assurance that historical trends will continue. Actual plans and operating results may differ materially from what is expressed or forecasted in this quarterly report and forecasts made in the forward-looking statements discussed in this quarterly report might not materialize. We do not undertake any obligation to update forward-looking statements or publicly release the results of any forward-looking statements that may be made to reflect events or circumstances after the date these statements were made.\nOVERVIEW\nRealty Income (NYSE: O), an S&P 500 company, is\nreal estate partner to the world's leading companies\n. Founded in 1969, we serve our clients as a full-service real estate capital provider. As of September 30, 2025, we have a portfolio of over 15,500 properties in all 50 states of the United States (\"U.S.\"), the United Kingdom (\"U.K.\"), and seven other countries in Europe. We are known as “The Monthly Dividend Company\n” and have a mission to invest in people and places to deliver dependable monthly dividends that increase over time. Since our founding, we have declared 664 consecutive monthly dividends and are a member of the S&P 500 Dividend Aristocrats\nindex for having increased our dividend for over 30 consecutive years.\nAs of September 30, 2025, we owned or held interests in 15,542 properties, with approximately\n\nproperties as of September 30, 2025 had a weighted average remaining lease term (excluding rights to extend a lease at the option of the client) of approximately 8.9 years. Total portfolio annualized base rent (defined as the monthly aggregate cash amount charged to clients, inclusive of monthly base rent receivables) on our leases as of September 30, 2025 was $5.22 billion.\nAs of September 30, 2025, approximately 31.5% of our total portfolio annualized base rent comes from properties leased to our investment grade clients, their subsidiaries or affiliated companies. As of September 30, 2025, our top 20 clients (based on percentage of total portfolio annualized base rent) represented approximately 36.2% of our annualized base rent and 10 of these clients have investment grade credit ratings or are subsidiaries or affiliates of investment grade companies. Approximately 91% of our annualized retail base rent as of September 30, 2025, is derived from our clients with a service, non-discretionary, and/or low price point component to their business.\nUnless otherwise specified, references to rental revenue in the Management's Discussion and Analysis of Financial Condition and Results of Operations are exclusive of reimbursements from clients for recoverable real estate taxes and operating expenses totaling $82.5 million and $74.3 million for the three months ended September 30, 2025 and 2024, respectively, and $257.3 million and $227.6 million for the nine months ended September 30, 2025 and 2024, respectively.\nRECENT DEVELOPMENTS\nIncreases in Monthly Dividends to Common Stockholders\nWe have continued our 56-year history of paying monthly dividends by increasing the dividend five times during 2025. As of October 2025, we have paid 112 consecutive quarterly dividend increases and increased the dividend 132 times since our listing on the New York Stock Exchange (“NYSE”) in 1994.\n2025 Dividend increases\nMonthly Dividend per share\nThe dividends paid per share during the nine months ended September 30, 2025 totaled $2.4085, as compared to $2.3350 during the nine months ended September 30, 2024, an increase of $0.074, or 3.1%.\nThe monthly dividend of $0.2695 per share represents a current annualized dividend of $3.234 per share, and an annualized dividend yield of 5.3% based on the last reported sale price of our common stock on the NYSE of $60.79 on September 30, 2025. Although we expect to continue our policy of paying monthly dividends, we cannot guarantee that we will maintain our current level of dividends, that we will continue our pattern of increasing dividends per share, or what our actual dividend yield will be in any future period.\nDuring the three months ended September 30, 2025, we invested $1.4 billion at an initial weighted average cash yield of 7.7%, including investments in 123 properties, properties under development or expansion, unconsolidated entities, and loans.\nDuring the nine months ended September 30, 2025, we invested $3.9 billion at an initial weighted average cash yield of 7.5%, including investments in 252 properties, properties under development or expansion, unconsolidated entities, and loans.\nInvestments in Real Estate,\n\nMaintenance of total unencumbered assets\n150% of unsecured debt\nOur debt service coverage ratio is calculated on a pro forma basis for the preceding four-quarter period on the assumptions that: (i) the incurrence of any Debt (as defined in the covenants) incurred by us since the first day of such four-quarter period and the application of the proceeds therefrom (including to refinance other Debt since the first day of such four-quarter period), (ii) the repayment or retirement of any of our Debt since the first day of such four-quarter period, and (iii) any acquisition or disposition by us of any asset or group since the first day of such four quarters and subject to certain additional adjustments. Such pro forma ratio has been prepared on the basis required by that debt service covenant, reflects various estimates and assumptions and is subject to other uncertainties, and therefore does not purport to reflect what our actual debt service coverage ratio would have been had transactions referred to in clauses (i), (ii) and (iii) of the preceding sentence occurred as of the first day of four-quarter period, nor does it purport to reflect our debt service coverage ratio for any future period.\n\n21, Subsequent Events\nto the consolidated financial statements for further details.\nPortfolio Discussion\nAs of September 30, 2025, we had 204 properties available for lease or sale out of 15,542 properties in our portfolio, which represents a 98.7% occupancy rate based on the number of properties in our portfolio. Our property-level occupancy rate excludes properties with ancillary leases only, such as cell towers and billboards, and properties with possession pending, and includes properties owned by unconsolidated joint ventures. Below is a summary of our portfolio activity for the periods indicated below:\nThree months ended September 30, 2025\nProperties available for lease as of June 30, 2025\nRe-leases to same client\nRe-leases to new client\nProperties available for lease as of September 30, 2025\nNine months ended September 30, 2025\nProperties available for lease as of December 31, 2024\nRe-leases to same client\nRe-leases to new client\nProperties available for lease as of September 30, 2025\nIncludes scheduled and unscheduled expirations (including leases rejected in bankruptcy), as well as future expirations resolved in the periods indicated above.\nDuring the three months ended September 30, 2025, the new annualized base rent on re-leased units was $70.65 million, as compared to the previous annual rent of $68.29 million on the same units, representing a rent recapture rate of 103.5% on the re-leased units.\nDuring the nine months ended September 30, 2025, the new annualized base rent on re-leased units was $213.70 million, as compared to the previous annual rent of $206.40 million on the same units, representing a rent recapture rate of 103.5% on the re-leased units.\nAs part of our re-leasing costs, we pay leasing commissions to unrelated, third-party real estate brokers consistent with the commercial real estate industry standard, and sometimes provide rent concessions to our clients. We do not consider the collective impact of the leasing commissions or rent concessions to our clients to be material to our financial position or results of operations.\nLeases generally provide for limited increases in rent as a result of fixed increases, increases in the consumer price index, retail price index in the case of certain leases in the U.K. (typically subject to ceilings), or increases in clients’ sales volumes. We expect that inflation will cause these lease provisions to result in rent increases over time. During times when inflation is greater than increases in rent, as provided for in the leases, rent increases may not keep up with the rate of inflation and other costs.\nMoreover, our strategic focus on the use of net lease agreements reduces our exposure to rising property expenses due to inflation because the client is responsible for property expenses. Even though the utilization of net leases reduces our exposure to rising property expenses due to inflation, substantial inflationary pressures and increased costs may have an adverse impact on our clients if increases in their operating expenses exceed increases in revenue, which may adversely affect our clients' ability to pay rent. Additionally, inflationary periods may cause us to experience increased costs of financing, make it difficult to refinance debt at attractive rates or at all, and may adversely affect the properties we can acquire if the cost of financing an acquisition is in excess of our anticipated earnings from such property, thereby limiting the properties that can be acquired.\nImpact of Real Estate and Capital Markets\nIn the commercial real estate market, property prices generally continue to fluctuate. Likew"
}