{
  "source_file": "o-20241231.htm",
  "form_type": "10-K",
  "item1_clean": "below) comes from properties leased to our investment grade clients, their subsidiaries or affiliated companies. At December 31, 2024, our top 20 clients (based on percentage of total portfolio annualized contractual rent) represented 36.4% of our annualized rent and 10 of these clients have investment grade credit ratings or are subsidiaries or affiliates of investment grade companies.\nAsset Management Strategy\nIn addition to pursuing new properties for investment, we seek to increase earnings and dividends through active asset management.\nGenerally, our asset management efforts seek to achieve:\nRent increases during and at the expiration of existing leases, when market conditions permit;\nOptimum exposure to certain clients, industries, and markets through re-leasing vacant properties and selectively selling properties;\nMaximum asset-level returns on properties that are renewed, re-leased or sold; and\nAdditional value creation opportunities from the existing portfolio by leveraging internal capabilities to enhance individual properties, pursue alternative uses, and derive ancillary revenue.\nAs part of our ongoing credit and predictive analytics research, we continually monitor our portfolio for any changes that could affect the performance of our clients, our clients’ industries, and the real estate locations in which we have invested. We also regularly analyze our portfolio with a view towards optimizing its returns and enhancing its overall credit quality.\nOur disposition strategy remains a function of our active investment management approach, supported by several data-driven tools, and aims at further enhancing our portfolio and maximizing portfolio returns through the sale of select assets when we believe the reinvestment of the sale proceeds will:\nGenerate higher returns;\nEnhance the credit quality of our real estate portfolio;\nExtend our average remaining lease term; and/or\nStrategically decrease client, industry, or geographic concentration.\nThe active management of the portfolio is an essential component of our long-term strategy of maintaining high occupancy.\nA primary objective of Realty Income is to deliver dependable monthly dividends to our stockholders that increase over time. To achieve this goal, we make a variety of capital allocation decisions, including with respect to our investments, leasing and releasing terms, and property development among other capital expenditures. We fund these expenditures by utilizing internally generated cash flow, dispositions, debt and equity issuances and term loan borrowings. Over the long term, we believe that common stock should represent the majority of our capital structure. We may issue common stock when we believe our share price supports accretive deployment of proceeds into additional properties, to permanently finance properties that were initially financed by our revolving credit facility, commercial paper programs, or shorter-term debt securities, and to repay or refinance debt. In addition, we continue to explore capital diversification initiatives, including the establishment of a fund business which we believe has the potential to expand our alternatives for sources of future capital. However, we cannot assure you that we will have access to these sources of capital at all times and at terms that are acceptable to us.\nWe put great effort into cultivating an inclusive company culture. We seek to hire talented employees with diverse backgrounds and perspectives and look to foster an environment that allows for regular, open communication where capable team members have fulfilling careers and are encouraged to engage with and make a positive impact on our Company, its operations, its business partners, and the communities in which we operate.\nEmployees operate as \"One Team\" and, together, we are committed to providing an engaging work environment centered on our values of:\nCelebrate Differences, and\nGive More than We Take.\nRecruitment, Development and Retention\nAt the heart of our corporate culture lie our dedicated employees, who form the foundation of our organization, representing our most valuable assets. As of December 31, 2024, our workforce comprises 468 professionals. The majority of our talented team members are recruited and hired from the communities in which we operate, embodying our commitment to local engagement. To extend the scope of our talent acquisition efforts, we have implemented various initiatives, including college and high school internship programs. Our comprehensive approach encompasses a wide range of strategies, such as engaging with affinity associations, and fostering employee referrals. These measures ensure that we continually attract and embrace a diverse pool of candidates. Furthermore, we recognize that internal mobility within our organization unlocks yet another great source of talent. By encouraging our current employees to expand their skills and take on new challenges, we tap into a rich reservoir of potential that enhances our workforce's capabilities and reinforces our corporate culture.\nWe offer leadership development programs and train on critical topics such as ethics, insider trading, anti-discrimination and harassment, anti-bribery, consumer privacy, cybersecurity, workplace violence prevention, safety, and other Company policies. We provide professional development opportunities for One Team members and provide assistance and support to employees who are pursuing job-related licenses, certifications, and continuing education.\nEmployee retention is essential for supporting a positive culture and productive workforce. Accordingly, we believe we offer competitive compensation and benefits packages. Benefits include medical, dental, and vision coverage for employees and their families, 401(k) or equivalent plans with Company matching opportunity; paid time-off or equivalent vacation; disability and life insurance; and, in years that the Company's performance meets certain goals, the ability to earn equity in the Company subject to applicable vesting periods.\nAdditional information regarding our human capital programs and initiatives is available in our annual Proxy Statement and Sustainability Report, both of which can be found on our website. Information on our website, including our Sustainability Report, is not incorporated by reference into this annual report.\nEmployee Health, Safety and Wellbeing\nWe prioritize the health, safety, and wellbeing of our team members. Our wellbeing program is thoughtfully designed to empower employees by fostering personal and professional growth through engaging activities and educational initiatives. Centered around five key pillars—purpose, social connection, financial health, community engagement, and physical wellness—our program provides a holistic approach to enhancing overall wellbeing. In fostering a healthy work environment, we promote work-life balance by offering flexible schedules and providing discounted fitness programs, paid family leave, parental leave, onsite lactation rooms, an infant-at-work program, employee health fairs, and an employee assistance program, among other programs and services.\nGovernment Regulation\nCompliance with various governmental regulations in the countries in which we operate has an impact on our business, including our capital expenditures, earnings and competitive position, which can be material. We incur costs to monitor and take actions to comply with applicable federal, international, state and local governmental regulations that are applicable to our business, which include, among others, U.S. federal securities laws and regulations, applicable stock exchange requirements, REIT and other tax laws and regulations, environmental and health and safety laws and regulations, local zoning, usage and other regulations relating to real property, anti-money laundering and anti-bribery and corruption laws and regulations, data privacy laws and regulations, sanctions restrictions, foreign laws and regulations, gaming laws and regulations and the Americans with Disabilities Act of 1990, (\"ADA\"). We believe that our properties generally have the necessary permits and approvals needed and are in compliance with applicable laws and regulations in the countries in which we operate.\nEnvironmental Matters\nInvestments in real property can create a potential for environmental liability. Federal, state and local environmental laws and regulations regulate releases of hazardous or toxic substances into the environment. While our tenants are generally primarily responsible for compliance with environmental laws and regulations, we as the property owner have faced and can face liability for environmental contamination created by the presence or discharge of hazardous substances on the property. We can face such liability regardless of our knowledge of the contamination; the timing of the contamination; the cause of the contamination; or the party responsible for the contamination of the property.\nSome of our properties contain, have contained, or are adjacent to or near properties that contain or have contained storage tanks for petroleum products or that involve or involved the use of hazardous or toxic substances. Under certain laws and regulations, a current or previous owner, operator or tenant may be required to investigate and clean-up hazardous or toxic substances or petroleum product releases or threats of releases, and may be held liable to a government entity or third parties for property damage and for investigation, clean-up and monitoring costs incurred by those parties in connection with actual or threatened contamination. These laws typically impose clean-up responsibility and liability without regard to fault, or whether or not the owner, operator or tenant knew of or caused the contamination. The liability may be joint and several for the full amount of the investigation, clean-up and monitoring costs incurred or to be incurred or actions to be undertaken, although a party held jointly and severally liable may seek contributions from other identified, solvent, responsible parties for their fair share toward these costs. In addition, strict environmental laws regulate a variety of activities that can occur on a property, including the storage of petroleum products or other hazardous or toxic substances, air emissions and water discharges. Such laws may impose fines or penalties for violations.\nEnvironmental laws also govern asbestos-containing materials (“ACM”). Federal regulations require building owners and those exercising control over a building’s management to identify and warn, through signs and labels, of potential hazards posed by workplace exposure to ACM in their building. The regulations also have employee training, record keeping and due diligence requirements pertaining to ACM. Significant fines can be assessed for violation of these regulations, and we could be subject to lawsuits if personal injury from exposure to ACM occurs. Federal, state and local laws and regulations also govern the removal, encapsulation, disturbance, handling and/or disposal of ACM when those materials are in poor condition or in the event of construction, remodeling, renovation or demolition of a building. These laws may impose liability for improper handling or a release into the environment of ACM and may provide for fines to, and for third parties to seek recovery from, owners or operators of real properties for personal injury or improper work exposure associated with ACM. In addition, our properties have contained and may contain in the future or develop harmful mold or other airborne contaminants. The presence of significant mold or other airborne contaminants at any of our properties has required us to and could require us to undertake in the future costly remediation to contain or remove the mold or other airborne contaminants from the affected property or increase indoor ventilation. Furthe",
  "item7_clean": "Derivative gain and loss are primarily related to mark-to-market adjustments on derivatives that do not qualify for hedge accounting and settlement of designated derivatives reclassified from Accumulated Other Comprehensive Income (\"AOCI\").\nForeign currency and derivative gain (loss), net was a $3.4 million gain for the year ended December 31, 2024 as compared $13.4 million loss with the same period in 2023, primarily due to the impact of foreign currency fluctuations on the remeasurement of intercompany debt.\nEquity in Earnings of Unconsolidated Entities\nEquity in earnings of unconsolidated entities was $7.8 million for the year ended December 31, 2024, compared to $2.5 million for the year ended December 31, 2023. The increase in equity in earnings of unconsolidated entities is due to an increase in our joint venture investments.\nOther income, net decreased by $0.2 million for the year ended December 31, 2024 as compared with the same period in 2023, primarily due to lower gains on insurance proceeds, largely offset by higher interest on short-term investments.\nIncome taxes primarily consist of international income taxes accrued or paid by us and our subsidiaries, as well as state and local taxes. The increase of $14.6 million in income taxes for the year ended December 31, 2024 as compared with the same period in 2023 is primarily attributable to higher taxable income in the U.K.\nPreferred Stock Dividends\nThe increase in preferred stock dividends of $7.8 million for the year ended December 31, 2024 as compared with the same period in 2023 is due to the issuance of Realty Income Series A Preferred Stock in connection with the Merger.\nExcess of Redemption Value over Carrying Value of Preferred Shares Redeemed\nIn September 2024, we redeemed all 6.9 million of Realty Income Series A Preferred Stock outstanding. The excess of the $25.00 liquidation price per share over the carrying value of Realty Income Series A Preferred Stock redeemed resulted in a loss on redemption of $5.1 million for the year ended December 31, 2024.\nCRITICAL ACCOUNTING POLICIES\nOur consolidated financial statements have been prepared in accordance with U.S. GAAP and are the basis for our discussion and analysis of financial condition and results of operations. Preparing our consolidated financial statements requires us to make a number of estimates and assumptions that affect the reported amounts and disclosures in the consolidated financial statements. We believe that we have made these estimates and assumptions in an appropriate manner and in a way that accurately reflects our financial condition. We continually test and evaluate these estimates and assumptions using our historical knowledge of the business, as well as other factors, to ensure that they are reasonable for reporting purposes. However, actual results may differ from these estimates and assumptions. This summary should be read in conjunction with the more complete discussion of our accounting policies and procedures included in note\n1, Summary of Significant Accounting Policies\n, to our consolidated financial statements in this annual report. In order to prepare our consolidated financial statements according to the rules and guidelines set forth by U.S. GAAP, many subjective judgments must be made with regard to critical accounting policies. We believe the following are our most critical accounting policies and estimates:\nAllocation of the Purchase Price of Real Estate Acquisitions\nManagement must make significant assumptions in determining the fair value of assets acquired and liabilities assumed. We evaluate whether or not substantially all of the value of acquired assets is concentrated in a single identifiable asset or group of identifiable assets to determine whether a transaction is accounted for as an asset acquisition or a business combination. A majority of our acquisitions qualify as asset acquisitions and the transaction costs associated with those acquisitions are capitalized. However, for transactions that qualify as business combinations, such as the Merger, we expense the transaction costs and categorize them as merger, transaction, and other costs, net in our consolidated statements of income and comprehensive income. For business combinations, we recognize the amount of any purchase consideration that exceeds the fair value of all identified assets acquired and liabilities assumed as goodwill and may record measurement period adjustments within one year of the acquisition date as permitted under ASC 805,\nBusiness Combinations\n(for more details see\n\nMerger with Spirit Realty Capital, Inc.\nto our consolidated financial statements contained in this annual report).\nFor asset acquisitions, we allocate the cost of real estate acquired, inclusive of transaction costs, to: (1) land, (2) building and improvements, and (3) identified intangible assets and liabilities, based in each case on their relative estimated fair values. For business combinations, all assets acquired and liabilities assumed are recorded at fair value. The difference between the purchase consideration and the aggregated fair value is recognized as goodwill or a gain on bargain purchase. Intangible assets and liabilities consist of above-market or below-market lease value and the value of in-place leases, as applicable. Additionally, above-market rents on leases acquired through sale-leaseback transactions under which we are a lessor are accounted for as financing receivables amortizing over the lease term, while below-market rents on leases under which we are a lessor are accounted for as prepaid rent. In an acquisition of multiple properties, we must also allocate the purchase price among the properties. The allocation of the purchase price is based on our assessment of estimated fair value of the land, building and improvements, and identified intangible assets and liabilities and is often based upon the various characteristics of the market where the property is located. In addition, any assumed mortgages are recorded at their estimated fair values. The estimated fair values of our mortgages payable have been calculated by discounting the future cash flows using applicable interest rates that have been adjusted for factors, such as industry type, client investment grade, maturity date, and comparable borrowings for similar assets. The use of different assumptions in the allocation of the purchase price of the acquired properties and liabilities assumed could affect the timing of recognition of the related revenue and expenses.\nProvisions for Impairment - Real Estate Assets\nManagement must make significant judgment as to if, and when, impairment losses should be taken on our properties when events or a change in circumstances indicate that the carrying amount of the asset may not be recoverable. If estimated future operating cash flows (undiscounted and without interest charges) plus estimated disposition proceeds (undiscounted) are less than the current book value of the property, a fair value analysis is performed and, to the extent the estimated fair value is less than the current book value, a provision for impairment is recorded to reduce the book value to estimated fair value. Key inputs that we utilize in this analysis include projected rental rates, estimated holding periods, capital expenditures, and property sales capitalization rates. If a property is held for sale, it is carried at the lower of carrying cost or estimated fair value, less estimated cost to sell. The carrying value of our real estate is the largest component of our consolidated balance sheets. Our strategy of primarily holding properties, long-term, directly decreases the likelihood of their carrying values not being recoverable, thus requiring the recognition of an impairment. However, if our strategy, or one or more of the above assumptions were to change in the future, an impairment may need to be recognized. If events should occur that require us to reduce the carrying value of our real estate by recording provisions for impairment, they could have a material impact on our results of operations.\nNON-GAAP FINANCIAL MEASURES\nAdjusted Earnings before Interest, Taxes, Depreciation and Amortization for Real Estate (\"Adjusted EBITDA\nNareit established an EBITDA metric for real estate companies (i.e., EBITDA for real estate, or EBITDA\n) it believed would provide investors with a consistent measure to help make investment decisions among REITs. Our definition of “Adjusted EBITDA\n” is generally consistent with the Nareit definition, other than our adjustment to remove foreign currency and derivative gain and loss and merger, transaction, and other costs, net. We define Adjusted EBITDAre, a non-GAAP financial measure, for the most recent quarter as earnings (net income) before (i) interest expense, (ii) income taxes, (iii) depreciation and amortization, (iv) provisions for impairment, (v) merger, transaction, and other costs, net, (vi) gain on sales of real estate, (vii) foreign currency and derivative gain and loss, net, and (viii) our proportionate share of adjustments from unconsolidated entities. Our Adjusted EBITDAre may not be comparable to Adjusted EBITDAre reported by other companies or as defined by Nareit, and other companies may interpret or define Adjusted EBITDA\ndifferently than we do. Management believes Adjusted EBITDA\nto be a meaningful measure of a REIT’s performance because it provides a view of our operating performance, analyzes our ability to meet interest payment obligations before the effects of income tax, depreciation and amortization expense, provisions for impairment, gain on sales of real estate and other items, as defined above, that affect comparability, including the removal of non-recurring and non-cash items that industry observers believe are less relevant to evaluating the operating performance of a company. In addition, EBITDA\nis widely followed by industry analysts, lenders, investors, rating agencies, and others as a means of evaluating the operational cash generating capacity of a company prior to servicing debt obligations. Management also believes the use of an annualized quarterly Adjusted EBITDA\nmetric, which we refer to as Annualized Adjusted EBITDA\n, is meaningful because it represents our current earnings run rate for the period presented. Annualized Adjusted EBITDA\nand Annualized Pro Forma Adjusted EBITDA\n, as defined below, are also used to determine the vesting of performance share awards granted to executive officers. Annualized Adjusted EBITDA\nshould be considered along with, but not as an alternative to net income as a measure of our operating performance. We define Annualized Pro Forma Adjusted EBITDA\nas Annualized Adjusted EBITDA\n, subject to certain adjustments to incorporate Adjusted EBITDA\nfrom investments we acquired or stabilized during the applicable quarter and to remove Adjusted EBITDA\nfrom investments we disposed of during the applicable quarter, and include transaction accounting adjustments in accordance with U.S. GAAP, giving pro forma effect to all transactions as if they occurred at the beginning of the applicable period. Our calculation includes all adjustments consistent with the requirements to present Adjusted EBITDA\non a pro forma basis in accordance with Article 11 of Regulation S-X. The Annualized Pro Forma Adjustments are consistent with the debt service coverage ratio calculated under financial covenants for our senior unsecured notes. We believe Annualized Pro Forma Adjusted EBITDA\nis a useful non-GAAP supplemental measure, as it excludes investments that were no longer owned at the balance sheet date and includes the annualized rent from investments acquired during the quarter. Management also uses our ratios of Net Debt/Annualized Adjusted EBITDA\nand Net Debt/Annualized Pro Forma Adjusted EBITDA\nas measures of leverage in assessing our financial performance, which is calculated as net debt (which we define as total debt per the consolidated balance sheets, excluding deferred financing costs and net premiums and discounts, but including our proportionate share of debt from unconsolidated entities, less cash and cash equivalents), divided by annualized quarterly Adjusted EBITDA\nand annualized Pro Forma Adjusted EBITDA\nThe following is a reconciliation of net income (which we believe is the most comparable U.S. GAAP measure) to Adjusted EBITDA\n\nproperties in our portfolio as of December 31, 2024, 15,316, or 98.0%, were single-client properties, and the remaining were multi–client properties. Our total portfolio had a weighted average remaining lease term (excluding rights to extend a lease at the option of the client) of approximately 9.3 years. Total portfolio annualized contractual rent (defined as the monthly aggregate cash amount charged to clients, inclusive of monthly base rent receivables) on our leases as of December 31, 2024 was $4.97 billion.\nAs of December 31, 2024, approximately 32.4% of our total portfolio annualized contractual rent came from properties leased to our investment grade clients, their subsidiaries or affiliated companies. As of December 31, 2024, our top 20 clients (based on percentage of total portfolio annualized contractual rent) represented approximately 36.4% of our annualized rent and 10 of these clients had investment grade credit ratings or were subsidiaries or affiliates of investment grade companies. Approximately 91% of our annualized retail contractual rent as of December 31, 2024, was derived from our clients with a service, non-discretionary, and/or low price point component to their business.\nUnless otherwise specified, references to rental revenue in the Management's Discussion and Analysis of Financial Condition and Results of Operations are exclusive of reimbursements from clients for recoverable real estate taxes and operating expenses totaling $303.1 million, $274.2 million, and $184.7 million for the years ended December 31, 2024, 2023, and 2022, respectively.\nRECENT DEVELOPMENTS\nIncreases in Monthly Dividends to Common Stockholders\nWe have continued our 56-year history of paying monthly dividends. In addition, we have increased the dividend five times during 2024 and twice during 2025. As of February 2025, we have paid 109 consecutive quarterly dividend increases and increased the dividend 129 times since our listing on the NYSE in 1994.\n2024 Dividend increases\nMonthly Dividend per share\n2025 Dividend increases\nThe dividends paid per share during the year ended December 31, 2024 totaled $3.126, as compared to $3.051 during the year ended December 31, 2023, an increase of $0.075, or 2.5%.\nThe monthly dividend of $0.2680 per share represents a current annualized dividend of $3.216 per share, and an annualized dividend yield of 6.0% based on the last reported sale price of our common stock on the NYSE of $53.41 on December 31, 2024. Although we expect to continue our policy of paying monthly dividends, we cannot guarantee that we will maintain our current level of dividends, that we will continue our pattern of increasing dividends per share, or what our actual dividend yield will be in any future period.\nClosing of Spirit Merger\nOn January 23, 2024, we closed on our previously announced stock-for-stock merger with Spirit. The Merger is further described in note\n2, Merger with Spirit Realty Capital, Inc.\nto the consolidated financial statements contained in this annual report.\nDuring the year ended December 31, 2024, we invested $3.9 billion at an initial weighted average cash yield of 7.4%, including an investment in 546 properties, properties under development or expansion, and investments in loans. See notes\nInvestments in Real Estate,\n\n, to the consolidated financial statements contained in this annual report for further details.\nRedemption of Preferred Stock\nOn September 30, 2024, we redeemed all 6.9 million shares outstanding of our 6.000% Series A Preferred Stock (“Realty I",
  "item2_clean": null
}