{
  "source_file": "odfl-20250930.htm",
  "form_type": "10-Q",
  "item1_clean": null,
  "item7_clean": null,
  "item2_clean": "Operating Costs and Other Expenses\nSalaries, wages and benefits decreased $18.2 million, or 2.7%, in the third quarter of 2025 as compared to the third quarter of 2024, due to a $17.2 million, or 3.5%, decrease in salaries and wages and a $1.0 million, or 0.5%, decrease in employee benefit costs. Salaries, wages and benefits decreased $40.2 million, or 2.0%, in the first nine months of 2025 as compared to the same period of 2024, due to a $50.7 million, or 3.4%, decrease in salaries and wages that was partially offset by a $10.5 million, or 1.9%, increase in employee benefit costs.\nThe decrease in salaries and wages in the third quarter and first nine months of 2025, as compared to the same periods of 2024, was primarily due to the decrease of 6.2% and 5.2%, respectively, in our average number of active full-time employees as we balanced our workforce with current shipping trends. Salaries and wages also decreased as a result of lower performance-based bonus compensation, the impacts of which were partially offset by the annual wage increase provided to our employees at the beginning of both September 2025 and 2024. Our productive labor costs, which include wages for drivers, platform employees, and fleet technicians, increased as a percent of revenue to 24.1% and 24.4%, respectively, in the third quarter and first nine months of 2025, as compared to 24.0% in both the third quarter and first nine months of 2024 as a result of the decrease in network density. Despite this decrease in network density that generally results from the decline in volumes, our team continued to deliver superior service to our customers while also focusing on operating efficiencies. Our other salaries and wages as a percent of revenue increased to 9.7% and 9.8%, respectively, in the third quarter and first nine months of 2025, as compared to 9.4% and 9.5%, respectively, in the same periods of 2024.\nOur costs attributable to employee benefits were negatively impacted by higher costs associated with our group health and dental plans during the third quarter and first nine months of 2025 due to increases in the average costs per claim as compared to the same periods of 2024. Our employee benefit costs were also impacted by decreases in retirement benefit plan costs directly linked to our net income as well as the reduction in our average number of active full-time employees. As a result, employee benefit costs as a percent of salaries and wages increased to 39.7% in the third quarter of 2025 from 38.6% in the comparable period of 2024 and increased to 39.2% in the first nine months of 2025 from 37.1% in the comparable period of 2024.\nOperating supplies and expenses decreased $12.0 million, or 7.7%, and $53.1 million, or 10.9%, in the third quarter and first nine months of 2025, respectively, as compared to the same periods of 2024, due to decreases in our costs for diesel fuel used in our vehicles as well as lower maintenance and repair costs. The cost of diesel fuel, excluding fuel taxes, represents the largest component of operating supplies and expenses, and can vary based on both average price per gallon and consumption. Our average cost per gallon of diesel fuel increased 2.3% in the third quarter of 2025 and decreased 6.7% in the first nine months of 2025 as compared to the same periods of 2024. We do not use diesel fuel hedging instruments; therefore, our costs are subject to market price fluctuations. Our gallons consumed decreased 8.6% and 7.7% in the third quarter and first nine months of 2025, respectively, as compared to the same periods of 2024, primarily due to a decrease in miles driven. Additionally, our other operating supplies and expenses decreased between the periods compared primarily due to lower maintenance and repair costs for our fleet.\nDepreciation and amortization costs increased $5.6 million, or 6.4%, and $16.3 million, or 6.4%, in the third quarter and first nine months of 2025, respectively, as compared to the same periods of 2024, primarily due to the increases in depreciation costs of the assets acquired as part of our 2024 and 2025 capital expenditure programs. We believe depreciation costs will continue to increase in future periods based on our 2025 capital expenditure plan. While our investments in real estate, equipment, and technology can increase our costs in the short-term, we believe these investments are necessary to support our continued long-term growth and strategic initiatives.\nMiscellaneous expenses, net increased $6.6 million, or 201.7%, and $11.6 million, or 64.8%, in the third quarter and first nine months of 2025, respectively, as compared to the same periods of 2024, primarily due to changes in gains and losses on the disposal of property and equipment.\nOur effective tax rate was 24.8% for both the third quarter and first nine months of 2025, as compared to 23.4% and 24.5%, respectively, for the third quarter and first nine months of 2024. Our effective tax rate generally exceeds the federal statutory rate due to the impact of state taxes and, to a lesser extent, certain other non-taxable or non-deductible items.\n\nfluctuations in the availability and price of diesel fuel and our ability to collect fuel surcharges, as well as the effectiveness of those fuel surcharges in mitigating the impact of fluctuating prices for diesel fuel and other petroleum-based products;\nseasonal trends in the less-than-truckload (“LTL”) industry, harsh weather conditions and disasters;\nthe availability and cost of capital for our significant ongoing cash requirements;\ndecreases in demand for, and the value of, used equipment;\nour ability to successfully consummate and integrate acquisitions;\nvarious risks arising from our international business relationships;\nthe costs and potential adverse impact of compliance with anti-terrorism measures on our business;\nthe competitive environment with respect to our industry, including pricing pressures;\nthe impact on our customers’ and suppliers’ businesses of various economic factors such as recessions, inflation, downturns in the economy, global uncertainty and instability, changes in international trade policies, changes in U.S. social, political, and regulatory conditions or a disruption of financial markets;\nthe negative impact of any unionization, or the passage of legislation or regulations that could facilitate unionization, of our employees;\nincreases in the cost of employee compensation and benefit packages used to address general labor market challenges and to attract or retain qualified employees, including drivers and maintenance technicians;\nour ability to retain our key employees and continue to effectively execute our succession plan;\npotential costs and liabilities associated with cyber incidents and other risks with respect to our information technology systems or those of our third-party service providers, including system failure, security breach, disruption by malware or ransomware or other damage;\nthe failure to adapt to new technologies implemented by our competitors in the LTL and transportation industry, which could negatively affect our ability to compete;\nthe failure to keep pace with developments in technology, any disruption to our technology infrastructure, or failures of essential services upon which our technology platforms rely, which could cause us to incur costs or result in a loss of business;\ndisruption in the operational and technical services (including software as a service) provided to us by third parties, which could result in operational delays and/or increased costs;\nthe Compliance, Safety, Accountability initiative of the Federal Motor Carrier Safety Administration (“FMCSA”), which could adversely impact our ability to hire qualified drivers, meet our growth projections and maintain our customer relationships;\nthe costs and potential adverse impact of compliance with, or violations of, current and future rules issued by the Department of Transportation, the FMCSA and other regulatory agencies;\nthe costs and potential liabilities related to compliance with, or violations of, existing or future governmental laws and regulations, including environmental laws;\nthe effects of legal, regulatory or market responses to climate change concerns;\nemissions-control and fuel efficiency regulations that could substantially increase operating expenses;\n\nCritical Accounting Policies\nOur tonnage levels and revenue mix are subject to seasonal trends common in our industry, although other factors, such as macroeconomic changes, could cause variation in these trends. Our revenue and operating margins in the first and fourth quarters are typically lower than those during the second and third quarters due to reduced shipments during the winter months. Harsh winter weather, hurricanes, tornadoes, floods and other natural disasters can also adversely impact our performance by reducing demand and increasing operating expenses. We believe seasonal trends will continue to impact our business.\n\nItem 2. Management’s Discussion and Analysis\nf Financial Condition and Results of Operations\nWe are one of the largest North American less-than-truckload (“LTL”) motor carriers. We provide regional, inter-regional and national LTL services through a single integrated, union-free organization. Our service offerings, which include expedited transportation, are provided through an expansive network of service centers located throughout the continental United States. Through strategic alliances, we also provide LTL services throughout North America. In addition to our core LTL services, we offer a range of value-added services including container drayage, truckload brokerage and supply chain consulting. More than 98% of our revenue has historically been derived from transporting LTL shipments for our customers, whose demand for our services is generally tied to industrial production and the overall health of the U.S. domestic economy.\nIn analyzing the components of o"
}