{
  "source_file": "oke-20241231.htm",
  "form_type": "10-K",
  "item1_clean": "- In our Natural Gas Liquids segment, NGLs extracted at our own and third-party natural gas processing plants are gathered by our NGL gathering pipelines. Gathered NGLs are directed to our downstream fractionators to be separated into Purity NGLs. Purity NGLs are stored or distributed to our customers, such as petrochemical companies, propane distributors, diluent users, ethanol producers, refineries and exporters.\nWe provide midstream services to producers of NGLs in the Rocky Mountain region, Mid-Continent region, Permian Basin and Gulf Coast region (including Louisiana) and deliver those products to the market. Our primary markets include the Mid-Continent in Conway, Kansas, the Gulf Coast in Mont Belvieu, Texas, Louisiana and the upper Midwest. The majority of the pipeline-connected natural gas processing plants in the Williston Basin, Oklahoma, Kansas and the Texas Panhandle as well as a large number in the Permian Basin, Barnett Shale, East Texas and Louisiana regions are connected to our NGL gathering\nsystems. Through our NGL gathering and distribution pipelines, and fractionation, terminal and storage facilities, we provide needed midstream services while connecting key supply and demand areas.\n- Our Natural Gas Liquids segment includes the following assets, which are wholly owned, except where noted, and exclude EnLink, which is shown separately below:\n9,300 miles of gathering pipelines;\n4,800 miles of distribution pipelines;\nNGL fractionators with combined operating capacity of 960 MBbl/d (includes interests in our proportional share of operating capacity), including 310 MBbl/d in the Mid-Continent region and 650 MBbl/d in the Mont Belvieu, Texas area, which were 92% and 98% utilized in 2024 and 2023, respectively;\none isomerization unit with operating capacity of 10 MBbl/d;\none ethane/propane splitter with operating capacity of 40 MBbl/d;\nNGL storage facilities with operating storage capacity of 30 MMBbl;\neight Purity NGLs terminals.\nWe completed the construction of our 125 MBbl/d MB-6 fractionator, which is included in the assets listed above. We are in the process of reconstructing our 210 MBbl/d fractionator in Medford, Oklahoma, which is excluded from the assets listed above.\nIn addition, we have access to 6 MMBbl of combined NGL storage capacity at facilities in Kansas and Texas and 60 MBbl/d of\nNGL fractionation capacity in the Gulf Coast through service agreements.\nThe following are the Natural Gas Liquids segment assets added as a result of the EnLink Acquisitions:\n800 miles of gathering pipelines (includes gross mileage of a consolidated, partially owned subsidiary);\nNGL fractionators with combined operating capacity of 235 MBbl/d;\nNGL storage facility with operating storage capacity of approximately 10 MMBbl.\nSee “Recent Developments” in Part II, Item 7, Management’s Discussion and Analysis of Financial Condition and Results of Operations, in this Annual Report for more information on our capital projects.\n- Earnings for our Natural Gas Liquids segment are derived primarily from fee-based services and commodity sales and purchases. We purchase NGLs and condensate from third parties, as well as from our Natural Gas Gathering and Processing segment. We also sell NGLs to our affiliate in the Refined Products and Crude segment. Our business activities are categorized as follows:\nExchange services - We utilize our assets to gather, transport, treat and fractionate NGLs, converting them into marketable Purity NGLs, and deliver them to a market center or customer-designated location. Some of these exchange volumes are under contracts with minimum volume commitments that provide a minimum level of revenues regardless of volumetric throughput. Our exchange services activities are primarily fee-based and include some rate-regulated tariffs; however, we also capture certain product price differentials through the fractionation process.\nTransportation and storage services - We transport Purity NGLs and certain Refined Products, primarily under regulated tariffs. Tariffs specify the maximum rates we may charge our customers and the general terms and conditions for transportation service on our pipelines. Our storage activities consist primarily of fee-based NGL storage services at our Mid-Continent and Gulf Coast storage facilities.\nOptimization and marketing - We utilize our assets, contract portfolio and market knowledge to capture location, product and seasonal price differentials through the purchase and sale of unfractionated NGLs and Purity NGLs. We transport Purity NGLs between the Mid-Continent region, upper Midwest and Gulf Coast regions to capture the location price differentials between market centers. Our marketing activities also include utilizing our NGL storage facilities to capture seasonal price differentials and serving marine, truck and rail markets. Our isomerization activities capture the price differential when normal butane is converted into the more valuable iso-butane at our isomerization unit in Conway, Kansas.\nIn the majority of our exchange services contracts, we purchase the unfractionated NGLs at the tailgate of the processing plant and deduct contractual fees related to the transportation and fractionation services we must perform before we can sell them as Purity NGLs. To the extent we hold unfractionated NGLs in inventory, the related contractual fees are not recognized until the unfractionated inventory is fractionated and sold.\nUnconsolidated Affiliates\n- We have a 50% ownership interest in Overland Pass, which operates an interstate NGL pipeline system extending 760 miles, originating in Wyoming and Colorado and terminating in Kansas. Our other unconsolidated affiliates in this segment are not material.\nSee Note O of the Notes to Consolidated Financial Statements in this Annual Report for additional discussion of unconsolidated affiliates.\nGovernment Regulation\n- The operations and revenues of our NGL pipelines are regulated by various state and federal government agencies. Our interstate NGL pipelines are regulated under the Interstate Commerce Act, which gives the FERC jurisdiction to regulate the terms and conditions of service, rates, including depreciation and amortization policies, and initiation of service. Certain aspects of our intrastate NGL pipelines that provide common carrier service are subject to the jurisdiction of various state agencies in the states where we operate.\nSee further discussion in the “Regulatory, Environmental and Safety Matters” section.\nNatural Gas Pipelines\nOverview of Operations\n- In our Natural Gas Pipelines segment, we receive residue natural gas from third parties and our own natural gas processing plants and interconnecting pipelines. Residue natural gas is transported or stored for end users, such as large industrial customers, natural gas and electric utilities serving commercial and residential consumers and can ultimately reach international markets through liquified natural gas exports and cross border pipelines.\nOur assets are connected to key supply areas and demand centers, including export markets in Mexico via Roadrunner and supply areas in Canada and the United States via our interstate and intrastate natural gas pipelines and Northern Border, which enables us to provide essential natural gas transportation and storage services. Growing demand from data centers and continued demand from local distribution companies, electric-generation facilities and large industrial companies support low-cost expansions that position us well to provide additional services to our customers when needed.\nIntrastate Pipelines and Storage\n- Our intrastate natural gas pipeline and storage assets are located in Oklahoma, Texas and Kansas. Our Oklahoma intrastate pipeline and storage assets have access to major natural gas production areas in the Mid-Continent region. Our Texas intrastate pipeline and storage assets have access to major natural gas producing formations in the Texas Panhandle. These assets provide shippers access to western markets, several markets to the southeast along the Gulf Coast, including the Houston Ship Channel, the Mid-Continent market to the north and exports to Mexico. Our storage facilities provide 61 Bcf of working gas storage capacity.\n\nSupply for each of our segments depends on crude oil and natural gas drilling and production activities, which are driven by the strength of the economy and impacts of geopolitical events; crude oil, natural gas, NGL and Refined\nProducts prices; the demand for each of these products from end users; changes in gas-to-oil ratios and the decline rate of existing production; refinery maintenance cycles; producer access to capital and investment in the industry; connections to pipelines and refineries; and producer firm commitments to transportation pipelines.\nDemand for gathering and processing services is dependent on natural gas and crude oil production by producers in the regions in which we operate. Demand for NGLs and the ability of natural gas processors to sustain their operations successfully and economically affect the volume of unfractionated NGLs produced by natural gas processing plants, thereby affecting the demand for NGL gathering, transportation and fractionation services. Natural gas and Purity NGLs are affected by the demand associated with the various industries that utilize the commodities, such as butanes and natural gasoline used by the refining industry as blending stocks for motor fuel, denaturant for ethanol and diluents for crude oil. Ethane, propane, butanes and natural gasoline are also used by the petrochemical industry to produce chemical components, used for a range of products that improve our daily lives and promote economic growth, including health care products, recyclable food packaging, clothing, technology, building materials, industrial, manufacturing and energy infrastructure, lightweight vehicle components and batteries. Propane is also used to heat homes and businesses. Demand for Refined Products is influenced by many factors, including driving patterns, consumer preferences, economic conditions, population changes, government regulations, changes in vehicle fuel efficiency and the development of alternative energy sources. The demand for Refined Products in the market areas served by our pipeline system has historically been stable. Demand for shipments on our crude oil pipelines is driven primarily by crude oil production and takeaway demand in the regions in which we operate. Demand for natural gas, NGLs, Refined Products and crude oil is also impacted by global macroeconomic factors.\n- Our earnings are primarily fee-based in all of our segments; however, we are exposed to some commodity price risk. As part of our hedging strategy, we use commodity derivative financial instruments and physical-forward contracts to reduce the impact of price fluctuations related to natural gas, NGLs, Refined Products and crude oil. Our Natural Gas Gathering and Processing segment is exposed to commodity price risk as a result of retaining a portion of the commodity sales proceeds associated with our fee with POP contracts and our POP contracts with take-in-kind rights. Our Natural Gas Gathering and Processing segment follows a programmatic approach to hedging commodity price risk and expects to hedge approximately 75% of its monthly equity volumes over time. Under certain fee with POP contracts, our contractual fees and POP percentage may increase or decrease if production volumes, delivery pressures or commodity prices change relative to specified thresholds. In our Natural Gas Liquids segment, we are exposed to commodity price risk associated with changes in the price of NGLs; the location differential between the Conway, Kansas, upper Midwest region, Mont Belvieu, Texas, and Louisiana; and the relative price differential between natural gas, NGLs and individual Purity NGLs, which affect our NGL purchases and sa",
  "item7_clean": "increase of $291 million due primarily to the interstate natural gas pipeline divestiture in 2024, higher transportation services and the operating income of EnLink;\nRefined Products and Crude\n- an increase of $934 million due to a full year of operating income following the Magellan Acquisition in 2023 and the operating income of Medallion and EnLink in 2024;\nConsolidated Transaction Costs\n- a decrease of $85 million due primarily to higher transaction costs related to the Magellan Acquisition in 2023.\nNet income increased due primarily to the items discussed above and higher equity in net earnings from investments, offset partially by higher interest expense due to higher debt balances resulting from the August 2023 $5.25 billion notes offering, the September 2024 $7.0 billion notes offering and the acquired debt balances from both the Magellan Acquisition in 2023 and the EnLink Controlling Interest Acquisition in 2024.\nDiluted EPS decreased due primarily to the impact of the insurance settlement gain in 2023 related to the Medford incident\nCapital expenditures increased due primarily to our capital projects. Please refer to the “Recent Developments” section of Management’s Discussion and Analysis of Financial Condition and Results of Operations in this Annual Report for additional information on our capital projects.\nAdditional information regarding our financial results and operating information is provided in the following discussion for each of our segments.\nSelected Financial Results and Operating Information for the Year Ended Dec. 31, 2023 vs. 2022\nNatural Gas Gathering and Processing\n- Our Natural Gas Gathering and Processing segment invests in capital projects in natural gas and NGL-rich areas across key basins where we operate. See “Capital Projects” in the “Recent Developments” section for more information on our capital projects.\nFor a discussion of our capital expenditure financing, see “Capital Expenditures” in the “Liquidity and Capital Resources” section.\nSelected Financial Results and Operating Information\n- The following tables set forth certain selected financial results and operating information for our Natural Gas Gathering and Processing segment for the periods indicated:\n\nLIQUIDITY AND CAPITAL RESOURCES\n- Our primary sources of cash inflows are operating cash flows, proceeds from our commercial paper program and our $3.5 Billion Credit Agreement, debt issuances and the issuance of common stock for our liquidity and capital resources requirements.\nWe expect our sources of cash inflows to provide sufficient resources to finance our operations, capital expenditures, quarterly cash dividends, maturities of long-term debt, share repurchases and contributions to unconsolidated affiliates. We believe we have sufficient liquidity due to our $3.5 Billion Credit Agreement, which expires in February 2030, and access to $1.0 billion available through our “at-the-market” equity program. As of Feb. 17, 2025, no shares have been sold through our “at-the-market” equity program.\nWe may manage interest-rate risk through the use of fixed-rate debt, floating-rate debt, Treasury locks and interest-rate swaps. For additional information on our interest-rate swaps, see Note E of the Notes to Consolidated Financial Statements in this Annual Report.\n- At Dec. 31, 2024, we had $733 million of cash and cash equivalents. For our wholly owned subsidiaries, we use a centralized cash management program that concentrates the cash assets of our wholly owned nonguarantor operating subsidiaries in joint accounts for the purposes of providing financial flexibility and lowering the cost of borrowing, transaction costs and bank fees. Our centralized cash management program provides that funds in excess of the daily needs of our operating subsidiaries are concentrated, consolidated or otherwise made available for use by other entities within our consolidated group. Our operating subsidiaries participate in this program to the extent they are permitted pursuant to FERC regulations or their operating agreements. Under the cash management program, depending on whether a participating subsidiary has short-term cash surpluses or cash requirements, we provide cash to the subsidiary or the subsidiary provides cash to us.\nIn December 2024, we entered into an agreement to provide revolving unsecured loans to EnLink through a promissory note at an interest rate of 4.85% at Dec. 31, 2024. This is a floating rate agreement which bears interest at ONEOK’s current short-term borrowing rate plus 0.25%. At Dec. 31, 2024, we held a promissory note receivable of $510 million, which was eliminated in consolidation. Interest earned on this agreement was not material. Following the EnLink Acquisition, completed on Jan. 31, 2025, we effectively terminated this agreement as EnLink operating subsidiaries are wholly owned and now participate in the cash management program described above.\n- ONEOK, ONEOK Partners, the Intermediate Partnership and Magellan (Obligated Group) have cross guarantees in place for ONEOK’s and ONEOK Partners’ indebtedness. These guarantees in place for our and ONEOK Partners’ indebtedness are full, irrevocable, unconditional and absolute joint and several guarantees to the holders of each series of outstanding securities. Liabilities under the guarantees rank equally in right of payment with all existing and future senior unsecured indebtedness. The Intermediate Partnership holds all of ONEOK Partners’ interests and equity in its subsidiaries, which are nonguarantors, and substantially all the assets and operations reside with nonguarantor operating subsidiaries. Magellan holds interests in its subsidiaries, which are nonguarantors, and substantially all the assets and operations reside with nonguarantor operating subsidiaries.\nAt Dec. 31, 2024, EnLink was a subsidiary of ONEOK, but did not guarantee ONEOK’s or ONEOK Partners’ indebtedness and was excluded from the Obligated Group. EnLink and EnLink Partners also had outstanding debt securities that were not guaranteed by ONEOK as of Dec. 31, 2024. At the completion of the EnLink Acquisition on Jan. 31, 2025, ONEOK assumed the outstanding debt of EnLink and EnLink Partners (the Assumed Debt) such that EnLink and EnLink Partners were each released from all debt obligations, and provided a guarantee for our and ONEOK Partners’ indebtedness to the holders of each series of outstanding securities, including for the Assumed Debt. EnLink and EnLink Partners are now included in the Obligated Group. As of the date of this report, the combined financial information of subsidiary issuers and parent guarantors, excluding our ownership of all interest in ONEOK Partners, Magellan and EnLink, reflect no material assets or liabilities or results of operations, apart from guaranteed indebtedness and therefore, we have excluded the summarized financial information for each issuer and guarantor.\nFor additional information on our indebtedness, please see Note H of the Notes to Consolidated Financial Statements in this Annual Report.\nShort-term Liquidity\n- Our principal sources of short-term liquidity consist of cash generated from operating activities, distributions received from our unconsolidated affiliates, proceeds from our commercial paper program and our recently executed $3.5 Billion Credit Agreement. In February 2025, we amended and restated our $2.5 Billion Credit Agreement to increase the size to $3.5 billion, extend the term to February 2030 and make other non-material modifications. All other terms and conditions remain substantially the same. As of Feb. 17, 2025, we had no borrowings under our $3.5 Billion Credit Agreement, and we are in compliance with all covenants. Upon closing of the EnLink Acquisition on Jan. 31, 2025, the EnLink Revolving Credit Facility was terminated.\nWe had working capital (defined as current assets less current liabilities) deficits of $481 million and $344 million as of Dec. 31, 2024, and Dec. 31, 2023, respectively, due primarily to current maturities of long-term debt. Generally, our working capital is influenced by several factors, including, among other things: (i) the timing of (a) debt and equity issuances, (b) the funding of capital expenditures, (c) scheduled debt payments, and (d) accounts receivable and payable; and (ii) the volume and cost of inventory and commodity imbalances. We may have working capital deficits in future periods as our long-term debt becomes current. We do not expect a working capital deficit of this nature to have a material adverse impact to our cash flows or operations.\nFor additional information on our $3.5 Billion Credit Agreement, see Note H of the Notes to Consolidated Financial Statements in this Annual Report.\n- In addition to our principal sources of short-term liquidity discussed above, we expect to fund our longer-term financing requirements by issuing long-term notes, as needed. Other options to obtain financing include, but are not limited to, issuing common stock, loans from financial institutions, issuance of convertible debt securities or preferred equity securities, asset securitization and the sale and lease-back of facilities.\nWe may, at any time, seek to retire or purchase our or ONEOK Partners’ outstanding debt through cash purchases and/or exchanges for equity or debt, in open-market repurchases, privately negotiated transactions or otherwise. Such repurchases and exchanges, if any, will be on such terms and prices as we may determine, and will depend on prevailing market conditions, or liquidity requirements, contractual restrictions and other factors. The amounts involved may be material.\n- In September 2024, we completed an underwritten public offering of $7.0 billion senior unsecured notes consisting of senior notes of the following tenors: $1.25 billion, 4.25% senior notes due 2027; $600 million, 4.4% senior notes due 2029; $1.25 billion, 4.75% senior notes due 2031; $1.6 billion, 5.05% senior notes due 2034; $1.5 billion, 5.7% senior notes due 2054; and $800 million, 5.85% senior notes due 2064. The net proceeds, after deducting underwriting discounts, commissions and offering expenses, were $6.9 billion. The net proceeds from this offering were used to fund the EnLink Controlling Interest Acquisition and the Medallion Acquisition, purchase additional interests in a Medallion joint venture owned by a separate third party, to pay fees and expenses related to the acquisitions and to repay outstanding indebtedness.\n- In December 2024, we repaid $120 million of borrowings under the Guardian Term Loan Agreement and $60 million of borrowings under the Viking Term Loan Agreement, plus accrued and unpaid interest, with cash on hand, as part of the interstate natural gas pipeline divestiture.\nIn December 2024, we redeemed our $500 million, 4.9% senior notes due March 2025 at 100% of the principal amount, plus accrued and unpaid interest, with cash on hand.\nSubsequent to the EnLink Controlling Interest Acquisition, we repaid $465 million of borrowings under the EnLink Revolving Credit Facility with cash on hand.\nSubsequent to the EnLink Controlling Interest Acquisition, we repaid $374 million of borrowings under the EnLink AR Facility with cash on hand and terminated the EnLink AR Facility.\nIn September 2024, we repaid the remaining $484 million of our $500 million, 2.75% senior notes at maturity with cash on hand.\n- On Jan. 31, 2025, we completed the EnLink Acquisition. Pursuant to the EnLink Merger Agreement, each common unit of EnLink was exchanged for a fixed ratio of 0.1412 shares of ONEOK Common stock, including EnLink Units that were exchanged for all previously outstanding Series B Preferred Units immediately prior to closing. We issued 41 million shares of common stock, with a fair value of $4.0 billion. There are no remaining Series B Preferred Units outstanding.\nOn Oct. 17, 2024, EnLink redeemed all outstanding Series C Preferred Units at $1,000 per Series C Preferred Unit, plus $8.28 per Series C Preferred Unit of unpaid distributions, for $365 million with proceeds received from borrowings under the EnLink Revolving Credit Facility. As of Dec. 31. 2024, there are no remaining Series C Preferred Units outstanding.\nShare Repurchase Program\n- In January 2024, our Board of Directors authorized a share repurchase program to buy up to $2.0 billion of our outstanding common stock. We expect shares to be acquired from time to time in open-market transactions or through privately negotiated transactions at our discretion, subject to market conditions and other factors. As of Feb. 17, 2025, we have repurchased 1.675 million shares for $172 million under the program with cash on hand. The program will terminate upon completion of the repurchase of $2.0 billion of common stock or on Jan. 1, 2029, whichever occurs first.\nMaterial Commitments\n- We have material cash commitments related to our capital expenditures, senior notes and corresponding interest payments, which we expect to fund through our sources of cash inflows discussed above. Our senior notes and interest payments are discussed in Note H of the Notes to Consolidated Financial Statements in this Annual Report. We also have cash commitments related to transportation, storage and other commercial contracts, as well as our financial and physical derivative obligations, which we expect to fund with cash from operations.\nCapital Expenditures\n\nof the Notes to Consolidated Financial Statements in this Annual Report.\nCRITICAL ACCOUNTING ESTIMATES\nThe preparation of our Consolidated Financial Statements and related disclosures in accordance with GAAP requires us to make estimates and assumptions with respect to values or conditions that cannot be known with certainty that affect the reported amounts of assets and liabilities, and the disclosure of contingent assets and liabilities at the date of the Consolidated Financial Statements. These estimates and assumptions also affect the reported amounts of revenue and expenses during the reporting period. Although we believe these estimates and assumptions are reasonable, actual results could differ from our estimates.\nThe following is a summary of our most critical accounting estimates, which are defined as those estimates most important to the portrayal of our financial condition and results of operations and requiring management’s most difficult, subjective or complex judgment, particularly because of the need to make estimates concerning the impact of inherently uncertain matters. We have discussed the development and selection of our critical accounting estimates with the Audit Committee of our Board of Directors. See Note A of the Notes to Consolidated Financial Statements in this Annual Report for the description of our accounting policies.\nFair Value Estimates in Business Combination Accounting\n- Business combination accounting requires that assets and liabilities be recorded at their estimated fair value in connection with the initial recognition of the transaction. Estimating the fair value of assets and liabilities in connection with business combination accounting requires management to make estimates, assumptions and judgments, and in some cases management may also utilize third-party specialists to assist and advise on those estimates.\nIn order to estimate the fair value of assets acquired and liabilities assumed, we utilized widely accepted valuation techniques that included discounted cash flow and cost methods. The discounted cash flow method utilizes assumptions that include, but are not limited to, estimated future cash flows, commodity margin growth rates, discount rates applied to estimated future cash flows, estimated rates of return and estimated customer attrition rates. Cost methods estimate the fair value of assets based on the estimated construction or replacement cost of the assets and requires the use of various inputs and assumptions. While we believe we have",
  "item2_clean": null
}