{
  "source_file": "omc-20250930.htm",
  "form_type": "10-Q",
  "item1_clean": null,
  "item7_clean": null,
  "item2_clean": "Item 2. Management's Discussion and Analysis of Financial Condition and Results of Operations\n(Dollars in tables in millions, except per share amounts.)\nFORWARD-LOOKING STATEMENTS\nrisks relating to the pending Merger (as defined below) with The Interpublic Group of Companies, Inc., or IPG, including: that the Merger may not be completed in a timely manner or at all; delays, unanticipated costs or restrictions resulting from regulatory review of the Merger, including the risk that Omnicom or IPG may be unable to obtain governmental and regulatory approvals required for the Merger, or that such approvals may result in the imposition of conditions that could adversely affect the combined company or the expected benefits of the Merger; uncertainties associated with the Merger may cause a loss of both companies’ management personnel and other key employees, and cause disruptions to both companies’ business relationships; the Merger Agreement (as defined below) subjects the Company and IPG to restrictions on business activities prior to the effective time of the Merger; the Company and IPG are expected to incur significant costs in connection with the Merger and integration; litigation risks relating to the Merger; the business and operations of both companies may not be integrated successfully in the expected time frame; the Merger may result in a loss of both companies’ clients, service providers, vendors, joint venture participants and other business counterparties; and the combined company may fail to realize all of the anticipated benefits of the Merger or fail to effectively manage its expanded operations;\nadverse economic conditions and disruptions, including geopolitical events, international hostilities, acts of terrorism, public health crises, inflation or stagflation, tariffs and other trade barriers, central bank interest rate policies in countries that comprise our major markets, labor and supply chain issues affecting the distribution of our clients’ products, or a disruption in the credit markets;\ninternational, national or local economic conditions that could adversely affect the Company or its clients;\nlosses on media purchases and production costs incurred on behalf of clients;\nreductions in client spending, a slowdown in client payments or a deterioration or disruption in the credit markets;\nthe ability to attract new clients and retain existing clients in the manner anticipated;\nchanges in client marketing and communications services requirements;\nfailure to manage potential conflicts of interest between or among clients;\nunanticipated changes related to competitive factors in the marketing and communications services industries;\nunanticipated changes to, or the ability to hire and retain, key personnel;\ncurrency exchange rate fluctuations;\nreliance on information technology systems and risks related to cybersecurity incidents;\neffective management of the risks, challenges and efficiencies presented by utilizing Artificial Intelligence (AI) technologies and related partnerships in our business;\nchanges in legislation or governmental regulations affecting the Company or its clients;\nrisks associated with assumptions the Company makes in connection with its acquisitions, critical accounting estimates and legal proceedings;\nthe Company’s international operations, which are subject to the risks of currency repatriation restrictions, social or political conditions and an evolving regulatory environment in high-growth markets and developing countries; and\nrisks related to environmental, social and governance goals and initiatives, including impacts from regulators and other stakeholders, and the impact of factors outside of our control on such goals and initiatives.\nEXECUTIVE SUMMARY\nAgreement to Acquire IPG\nOn December 8, 2024, Omnicom entered into an Agreement and Plan of Merger, or the Merger Agreement, by and among Omnicom, EXT Subsidiary Inc., a direct wholly owned subsidiary of Omnicom, or Merger Sub, and IPG, pursuant to which, subject to the terms and conditions of the Merger Agreement, Merger Sub will merge with and into IPG, or the Merger, with IPG surviving the Merger as a wholly owned subsidiary of Omnicom. On March 18, 2025, the shareholders of each of Omnicom and IPG approved the Merger. Under the terms of the Merger Agreement, IPG shareholders will receive 0.344 shares of Omnicom common stock for each share of IPG common stock they own. Following the closing of the Merger, Omnicom shareholders are expected to own approximately 60.6% of the combined company, and IPG shareholders are expected to own approximately 39.4%, on a fully diluted basis. The completion of the Merger is subject to customary closing conditions, including required regulatory approvals. If completed, the Merger is expected to have a material impact on our business, results of operations and financial condition. During the three and nine months ended September 30, 2025, we recorded acquisition related costs of $60.8 million and $160.6 million, respectively, in selling, general and administrative expenses. The results of IPG are not included in our 2025 or 2024 results of operations or financial position disclosed in these unaudited consolidated financial statements.\nWe have secured regulatory approvals for Omnicom’s pending acquisition of IPG in all required jurisdictions other than the European Union. We are continuing to pursue the required EU regulatory approval and expect that the acquisition will close by the end of November 2025.\nIn the third quarter of 2025, in connection with the pending acquisition of IPG, Omnicom offered to exchange up to $2.95 billion of IPG’s outstanding senior notes (the \"Existing IPG Notes\") for new Omnicom notes, and solicited consents to amend the indentures governing the Existing IPG Notes. Omnicom has received sufficient tenders and consents to consummate the exchange offer and consent solicitation, which is currently set to expire on October 31, 2025, subject to further extension. The consummation of the exchange offer and consent solicitation is subject to the closing of the Merger and certain other conditions and will include cash as a consent payment aggregating up to $2.7 million.\nRisks and Uncertainties\nGlobal economic conditions and disruptions, including geopolitical events, international hostilities, acts of terrorism, public health crises, inflation or stagflation, tariffs and other trade barriers, central bank interest rate policies in countries that comprise our major markets, labor and supply chain challenges affecting the distribution of our clients' products, or a disruption in the credit markets could cause economic uncertainty and volatility. The impact of these issues on our business will vary by geographic market and discipline. We monitor economic conditions closely, as well as client revenue levels and other factors. In response to reductions in revenue, we can take actions to align our cost structure with changes in client demand and manage our working capital. However, there can be no assurance as to the effectiveness of our efforts to mitigate any impact of the current and future adverse economic conditions, reductions in client revenue, changes in client creditworthiness and other developments.\nWe are a strategic holding company providing data-inspired, creative marketing and sales solutions to many of the largest global companies. Our portfolio of companies includes our global networks: Omnicom Advertising Group (OAG), Omnicom Media Group, the DAS Group of Companies, and the Communications Consultancy Network. OAG includes our creative brands BBDO, DDB, TBWA and the brands included within the Omnicom Advertising Collective. All of our global networks integrate their service offerings with the Omnicom branded practice areas, including Omnicom Health Group, Omnicom Precision Marketing Group, Omnicom Commerce Group, Omnicom Public Relations Group, Omnicom Brand Consulting Group, Flywheel Digital and Omnicom Production, as well as our Experiential businesses and Execution & Support businesses, which includes Omnicom Specialty Marketing Group.\nOn a global, pan-regional, and local basis, our networks, practice areas and agencies provide a comprehensive range of services in the following fundamental disciplines: Media & Advertising, Precision Marketing, Public Relations, Healthcare, Branding & Retail Commerce, Experiential, and Execution & Support. Media & Advertising includes creative services across digital and traditional media, strategic media planning and buying, performance media, data analytics services, and Omnicom Production. Precision Marketing includes digital and direct marketing, digital transformation consulting, e-commerce operations, media execution, market intelligence and data and analytics. Public Relations services include corporate communications, crisis management, public affairs and media and media relations services. Healthcare includes corporate communications and advertising and media services to global healthcare and pharmaceutical companies. Branding & Retail Commerce services include brand and product consulting, strategy and research and retail marketing. Experiential marketing services include live and digital events and experience design and execution. Execution & Support includes field marketing, sales support, digital and physical merchandising, point-of-sale and product placement, as well as other specialized marketing and custom communications services. Our geographic\n\nmarkets include the Americas, which includes North America and Latin America, Europe, the Middle East and Africa or EMEA, and Asia-Pacific.\nOur business model was built and continues to evolve around our clients. While our networks, practice areas and agencies operate under different names and frame their ideas in different disciplines, we organize our services around our clients. Our fundamental business principle is that our clients’ specific requirements are the "
}