{
  "source_file": "omc-20241231.htm",
  "form_type": "10-K",
  "item1_clean": "Agreement to Acquire IPG\nOn December 8, 2024, Omnicom entered into an Agreement and Plan of Merger, or the Merger Agreement, by and among Omnicom, EXT Subsidiary Inc., a direct wholly owned subsidiary of Omnicom, or Merger Sub, and IPG, pursuant to which, subject to the terms and conditions of the Merger Agreement, Merger Sub will merge with and into IPG, or the Merger, with IPG surviving the Merger as a wholly owned subsidiary of Omnicom. Under the terms of the Merger Agreement, IPG shareholders will receive 0.344 shares of Omnicom common stock for each share of IPG common stock they own. Following the close of the Merger, Omnicom shareholders are expected to own approximately 60.6% of the combined company and IPG shareholders are expected to own approximately 39.4%, on a fully diluted basis. The completion of the Merger is subject to customary closing conditions, including required regulatory approvals and the approval of the stockholders of both Omnicom and IPG. If completed, the Merger is expected to have a material impact on our business, results of operations and financial condition.\nWe are a strategic holding company providing data-inspired, creative marketing and sales solutions to many of the largest global companies. Our portfolio of companies includes our global networks, BBDO, DDB and TBWA, Omnicom Media Group, the DAS Group of Companies, and the Communications Consultancy Network. All of our global networks integrate their service offerings with the Omnicom branded practice areas, including Omnicom Health Group, Omnicom Precision Marketing Group, Omnicom Commerce Group, Omnicom Advertising Collective, Omnicom Public Relations Group, Omnicom Brand Consulting Group, Flywheel Digital and Omnicom Production, a practice area that brings together Omnicom’s global production capabilities, as well as our Experiential businesses and Execution & Support businesses, which includes Omnicom Specialty Marketing Group. In August 2024, we announced the formation of Omnicom Advertising Group, or OAG, a new global organization that aligns the world-class creative networks BBDO, DDB and TBWA, as well as leading agencies within the Omnicom Advertising Collective. OAG began operations in January 2025.\nWe operate in a highly competitive industry and compete against other global, national and regional advertising, marketing and communications services companies, as well as technology, social media and professional services companies. The proliferation of media channels, including the rapid development and integration of interactive technologies and media, has fragmented consumer audiences targeted by our clients. These developments make it more complex for marketers to reach their target audiences in a cost-effective way, causing them to turn to Omnicom for a customized mix of marketing and communications services designed to optimize their total marketing expenditure.\nOn a global, pan-regional, and local basis, our networks, practice areas and agencies provide a comprehensive range of services in the following fundamental disciplines: Media & Advertising, Precision Marketing, Public Relations, Healthcare, Branding & Retail Commerce, Experiential, and Execution & Support. Media & Advertising includes creative services across digital and traditional media, strategic media planning and buying, performance media, data analytics services, and Omnicom Production. Precision Marketing includes digital and direct marketing, digital transformation consulting, e-commerce operations, media execution, market intelligence and data and analytics. Public Relations services include corporate communications, crisis management, public affairs and media and media relations services. Healthcare includes corporate communications and advertising and media services to global healthcare and pharmaceutical companies. Branding & Retail Commerce services include brand and product consulting, strategy and research and retail marketing. Experiential marketing services include live and digital events and experience design and execution. Execution & Support includes field marketing, sales support, digital and physical merchandising, point-of-sale and product placement, as well as other specialized marketing and custom communications services. We operate in all major markets and have a large client base. Our geographic markets include the Americas, which includes North America and Latin America, Europe, the Middle East and Africa, or EMEA, and Asia-Pacific.\nOur business model was built and continues to evolve around our clients. While our networks, practice areas and agencies operate under different names and frame their ideas in different disciplines, we organize our services around our clients. Our fundamental business principle is that our clients’ specific requirements are the central focus of how we structure our service offerings and allocate our resources. This client-centric business model requires that multiple agencies within Omnicom collaborate in formal and informal virtual client networks utilizing our key client matrix organization structure. This collaboration allows us to cut across our internal organizational structures to execute our clients’ marketing requirements in a consistent and comprehensive manner. We use our client-centric approach to grow our business by expanding our service offerings to existing clients, moving into new markets and obtaining new clients. In addition, we pursue selective acquisitions of complementary companies with strong entrepreneurial management teams that fill gaps in our service delivery to our existing clients.\n\ncollaborating through our client service models, our agencies, practice areas and networks collaborate across internally developed technology platforms. Annalect and Omni, our proprietary data and analytics platforms, serve as the strategic resource for all of our agencies, practice areas and networks to share when developing client service strategies across our virtual networks. These platforms provide precision marketing and insights at scale across creative, media and other disciplines.\nWe believe generative AI will have a significant effect on how we provide services to our clients and how we enhance the productivity of our people. As with any new technology, we are working closely with our clients and technology partners to take advantage of the benefits of AI while being mindful of its limitations and risks, and privacy concerns. We are committed to responsible AI practices and collaboration to harness AI's potential, while evaluating related risks, such as ethical considerations, public perception and reputational concerns, intellectual property protection, regulatory compliance, privacy and data security concerns and our ability to effectively adopt this new emerging technology. The rapidly developing nature of AI technology makes it difficult to assess the full impact on our business at this time.\nDriven by our clients’ continuous demand for more effective and efficient marketing activities, we strive to provide an extensive range of marketing and communications services through various client-centric networks that are organized to meet specific client objectives.\nOur service offerings include:\nmedia planning and buying\nmerchandising and point of sale\ncorporate social responsibility consulting\ncrisis communications\nmulti-cultural marketing\nnon-profit marketing\norganizational communications\ndigital/direct marketing and post-production services\ndigital transformation consulting\npromotional marketing\nentertainment marketing\nexperiential marketing\nfinancial/corporate business-to-business advertising\nretail media and e-commerce\ngraphic arts/digital imaging\nsearch engine marketing\nhealthcare marketing and communications\ninteractive marketing\nsocial media marketing\nsports and event marketing\nCertain business trends have impacted our business and industry. These trends include clients increasingly expanding the focus of their brand strategies from national markets to pan-regional and global markets and integrating traditional and non-traditional marketing channels, as well as utilizing new communications technologies and emerging digital platforms. As clients increase their demands for marketing effectiveness and efficiency, they tend to pursue a strategy that covers all consumer touch points in an economically effective manner. Our portfolio of businesses provides clients with an array of strategic options and we have structured our business around these trends. We believe that our key client matrix organization structure approach to collaboration and integration of our services and solutions have provided a competitive advantage to our business in the past and we expect this to continue over the medium and long term. Our key client matrix organization structure facilitates superior client management and allows for greater integration across our service platforms. Our overarching strategy is to continue to use our virtual client networks to grow our business relationships with our largest clients by serving them across our networks, disciplines and geographies.\nWe continually evaluate our portfolio of businesses to identify areas for investment and acquisition opportunities, as well as to identify non-strategic or underperforming businesses for disposition. In\n\nOur clients operate in virtually every sector of the global economy. In many cases, multiple agencies, practice areas or networks serve different brands, product groups or both within the same client. For example, in 2024, our largest client represented 2.7% of revenue and was served by approximately 155 of our agencies. Our 100 largest clients, which represent many of the major marketers, represented approximately 54% of revenue and were each served, on average, by approximately 55 of our agencies. Although we have a large and diverse client base, we are not immune to general economic downturns.\nGovernment Regulations\nWe are subject to various federal, state and local laws and regulations in the countries in which we conduct business. Compliance with these laws and regulations in the normal course of business did not have a material effect on our business, results of operations or financial condition. Additional information regarding the impact of government regulations on our business is included in Item 1A, “Risk Factors -\n\nHuman Capital Resources and Environmental Sustainability Initiatives\nOur employees are our most important assets. We believe a critical component of our success depends on the ability to attract, develop and retain key personnel. The skill sets of our workforce across our agencies and within each discipline share many similarities. Common to all is the ability to understand the client’s brand or product and its selling proposition and to develop a unique message to communicate the value of the brand or product to the client’s target audience, whether through traditional channels or digital platforms. Recognizing the importance of this core competency, we support and develop our employees through training and development programs that build and strengthen employees’ leadership and professional skills.\nHuman capital management strategies are developed collectively by senior management, including the management teams of our networks, practice areas, and agencies, and are overseen by our Board of Directors. We are committed to efforts that ensure that the workplace is equitable, ethical, fosters an inclusive work environment across our global workforce and respects human rights. Our social and human capital management priorities include, among other things, adopting codes of conduct and business ethics, providing competitive wages and benefits, comprehensive training programs and succession planning.\nAt December 31, 2024, we employed approximately 74,900 people worldwide, including 31,200 people in the Americas, 26,800 people in EMEA, and 16,900 people in Asia-Pacific. The U",
  "item7_clean": "1) Reconciliation of Non-GAAP Financial Measures on page\n2) In 2024, operating expenses included $57.8 million ($42.9 million after-tax) of repositioning costs, primarily related to severance, recorded in the second quarter of 2024 (see Note 13 to the consolidated financial statements). Included in selling, general and administrative expenses in the fourth quarter of 2024 are acquisition transaction costs of $14.6 million ($13.1 million after-tax), related to the proposed merger with IPG (see Note 1 to the consolidated financial statements). The net impact of these items reduced operating income for 2024 by $72.4 million ($56.0 million after-tax) and reduced diluted net income per share - Omnicom Group Inc. by $0.28.\nIn 2023, operating expenses included real estate operating lease impairment charges, severance and other exit costs of $191.5 million ($145.5 million after-tax) related to repositioning actions we took in the first and second quarters of 2023 to reduce our real estate requirements, rebalance our workforce, and consolidate operations in certain markets. In addition, in the second quarter of 2023, we recorded a gain of $78.8 million ($55.9 million after-tax) on the disposition of certain of our research businesses in the Execution & Support discipline. Included in the fourth quarter of 2023 within selling, general and administrative expenses are acquisition transaction costs of $14.5 million ($13.0 million after-tax), primarily related to the purchase of Flywheel Digital in January 2024 (see Note 5 to the consolidated financial statements). The net impact of these items reduced operating income for 2023 by $127.2 million ($102.6 million after-tax) and reduced diluted net income per share - Omnicom Group Inc. by $0.50 (see Notes 13 and 14 to the consolidated financial statements).\nBeginning in 2024, EBITA is defined as earnings before interest, income taxes and amortization of acquired intangible assets and internally developed strategic platform assets. As a result, we reclassified the prior year to be consistent with the revised definition, which reduced EBITA from previously reported amounts. We believe EBITA is useful in evaluating the impact of amortization of acquired intangible assets and internally developed strategic platform assets on operating performance and allows for comparability between reporting periods, the after-tax impact on diluted net income per share- Omnicom Group Inc. for 2024 and 2023 was $0.32 and $0.23, respectively.\nCRITICAL ACCOUNTING ESTIMATES\nThe following summary of our critical accounting policies provides a better understanding of our financial statements and the related discussion in this MD&A. We believe that the following policies may involve a higher degree of judgment and complexity in their application than most of our accounting policies and represent the critical accounting policies used in the preparation of our financial statements. Readers are encouraged to consider this summary together with our consolidated financial statements and the related notes, including Note 2, for a more complete understanding of the critical accounting policies discussed below.\nWe prepare our financial statements in conformity with U.S. GAAP and are required to make estimates and assumptions that affect the amounts reported in the consolidated financial statements and accompanying notes. We use a fair value approach in testing our intangible assets, which primarily consist of goodwill, for impairment. Actual results could differ from those estimates and assumptions.\nAcquisitions and Goodwill\nWe have made and expect to continue to make selective acquisitions. The evaluation of potential acquisitions is based on various factors, including specialized know-how, reputation, geographic coverage, competitive position and service offerings of the target businesses, as well as our experience and judgment.\nOur acquisition strategy is focused on acquiring the expertise of an assembled workforce in order to continue to build upon the core capabilities of our various strategic business platforms and agency brands through the expansion of their geographic reach or their service capabilities to better serve our clients. Additional key factors we consider include the competitive position and specialized know-how of the acquisition targets. Accordingly, as is typical in most service businesses, a substantial portion of the assets we acquire are intangible assets primarily consisting of the know-how of the personnel, which is treated as part of goodwill and is not required to be valued separately under U.S. GAAP. For each acquisition, we undertake a detailed review to identify other intangible assets that are required to be valued separately. A significant portion of the identifiable intangible assets acquired is derived from customer relationships, including the related customer contracts, as well as trade names. In valuing these identified intangible assets, we typically use an income approach and consider comparable market participant measurements.\nWe evaluate goodwill for impairment at least annually at May 1 and whenever events or circumstances indicate the carrying value may not be recoverable. Under FASB ASC Topic 350,\nIntangibles - Goodwill and Other\n, we have the option of either assessing qualitative factors to determine whether it is more-likely-than-not that the carrying value of our reporting units exceeds their respective fair value (Step 0) or proceeding directly to the quantitative goodwill impairment test. While there were no trigger events that required us to perform a quantitative test, we performed the annual quantitative impairment test and compared the fair value of each of our reporting units to its respective carrying value, including goodwill. We identified our regional reporting units as components of our operating segments, which are our six global agency networks. The regional reporting units and practice areas monitor performance and are responsible for the agencies in their region. The regional reporting units report to the segment managers and facilitate the administrative and logistical requirements of our key client matrix organization structure for delivering services to clients in their regions. We have concluded that for each of our operating segments, their regional reporting units have similar economic characteristics and should be aggregated for purposes of testing goodwill for impairment at the operating segment level. Our conclusion was based on a detailed analysis of the aggregation criteria set forth in FASB ASC Topic 280,\n, and in FASB ASC Topic 350. Consistent with our fundamental business strategy, the agencies within our regional reporting units serve similar clients in similar industries, and in many cases the same clients. In addition, the agencies within our regional reporting units have similar economic characteristics, and the employees share similar skill sets. The main economic components of each agency are employee compensation and related costs, and direct service costs and occupancy and other costs, which include rent and occupancy costs, technology costs that are generally limited to personal computers, servers and off-the-shelf software and other overhead expenses. Finally, the expected benefits of our acquisitions are typically shared by multiple agencies in various regions as they work together to integrate the acquired business into our virtual client network strategy.\nGoodwill Impairment Review - Estimates and Assumptions\nWe use the following valuation methodologies to determine the fair value of our reporting units: (1) the income approach, which utilizes discounted expected future cash flows, (2) comparative market participant multiples for EBITDA (earnings before interest, taxes, depreciation and amortization) and (3) when available, consideration of recent and similar acquisition transactions.\nIn applying the income approach, we use estimates to derive the discounted expected cash flows (“DCF”) for each reporting unit that serves as the basis of our valuation. These estimates and assumptions include revenue growth and operating margin, EBITDA, tax rates, capital expenditures, weighted average cost of capital and related discount rates and expected long-term cash flow growth rates. All of these estimates and assumptions are affected by conditions specific to our businesses, economic conditions related to the industry we operate in, as well as conditions in the global economy. The assumptions that have the most significant effect on our valuations derived using a DCF methodology are: (1) the expected long-term growth rate of our reporting units' cash flows and (2) the weighted average cost of capital (“WACC”) for each reporting unit.\nThe long-term growth rate and WACC assumptions used in our evaluations:\nLong-Term Growth Rate\nWACC\n-term growth rate represents our estimate of the long-term growth rate for our industry and the geographic markets we operate in. For the past ten years, the average historical revenue growth rate of our reporting units and the Average Nominal GDP, or NGDP, growth of the countries comprising the major markets that account for substantially all of our revenue, was approximately 3.6% and 4.7%\n, respectively. We considered this history when determining the long-term growth rates used in our annual impairment test at May 1, 2024. Included in the 10-year history is the full year 2020, which included the negative impact of the COVID-19 pandemic on the global economy and our revenue. We believe marketing expenditures over the long term have a high correlation to NGDP, notwithstanding the volatility of inflationary environments. Based on our past performance, we also believe that our growth rate can exceed NGDP growth in the short-term in the markets we operate in, which are similar across our reporting units. Accordingly, for our annual test as of May 1, 2024, we used an estimated long-term growth rate of 3.5%.\nWhen performing the annual impairment test as of May 1, 2024 and estimating the future cash flows of our reporting units, we considered the current macroeconomic environment, as well as industry and market specific conditions in 2024. In the first half of 2024, our organic revenue increase was 4.6%, which excluded our net disposition activity and the impact from changes in foreign exchange rates.\nThe WACC is comprised of: (1) a risk-free rate of return, (2) a business risk index ascribed to us and to companies in our industry comparable to our reporting units based on a market derived variable that measures the volatility of the share price of equity securities relative to the volatility of the overall equity market, (3) an equity risk premium that is based on the rate of return on equity of publicly traded companies with business characteristics comparable to our reporting units, and (4) a current after-tax market rate of return on debt of companies with business characteristics similar to our reporting units, each weighted by the relative market value percentages of our equity and debt.\nOur six reporting units vary in size with respect to revenue and the amount of debt allocated to them. These differences drive variations in fair value among our reporting units. In addition, these differences as well as differences in book value, including goodwill, cause variations in the amount by which fair value exceeds book value among the reporting units. The goodwill balances and debt vary by reporting unit primarily because our three legacy agency networks were acquired at the formation of Omnicom and were accounted for as a pooling of interests that did not result in any additional debt or goodwill being recorded. The remaining three agency networks were built through a combination of internal growth and acquisitions that were accounted for using the acquisition method and as a result, they have a relatively higher amount of goodwill and debt. Finally, the allocation of goodwill when components are transferred between reporting units is based on relative fair value at the time of transfer.\nGoodwill Impairment Review - Conclusion\nBased on the results of our impairment test, we concluded that our goodwill as of May 1, 2024 was not impaired, because the fair value of each of our reporting units was in excess of its respective net book value. For our reporting units with negative book value, we concluded that the fair value of their total assets was in excess of book value. The minimum decline in fair value that one of our reporting units would need to experience in order to fail the goodwill impairment test was approximately 48%. Notwithstanding our belief that the assumptions we used for WACC and long-term growth rate in our impairment testing were reasonable, we performed a sensitivity analysis for each reporting unit. The results of this sensitivity analysis on our impairment test as of May 1, 2024 revealed that if the WACC increased by 1% and/or the long-term growth rate decreased by 1%, the fair value of each of our reporting units would continue to be in excess of its respective net book value and would pass the impairment test.\nWe will continue to perform our impairment test each year at May 1, unless events or circumstances trigger the need for an interim impairment test. There were no events through December 31, 2024 that would change our impairment assessment. The estimates used in our goodwill impairment test do not constitute forecasts or projections of future results of operations, but rather are estimates and assumptions based on historical results and assessments of macroeconomic factors affecting our reporting units as of the valuation date. We believe that our estimates and assumptions are reasonable, but they are subject to change from year-over-year. Actual results of operations and other factors will likely differ from the estimates used in our discounted cash flow valuation, and it is possible that differences could be significant. A change in the estimates we use could result in a decline in the estimated fair value of one or more of our reporting units from the amounts derived as of our latest valuation and could cause us to fail our goodwill impairment test if the estimated fair value for the reporting unit is less than the carrying value of the net assets of the reporting unit, including its goodwill. A large decline in estimated fair value of a reporting unit could result in a non-cash impairment charge and may have an adverse effect on our results of operations and financial position. Additional information about acquisitions and goodwill appears in Notes 2, 5 and 6 to the consolidated financial statements.\nRevenue is recognized when a customer obtains control and receives the benefit of the promised goods or services (the performance obligation) in an amount that reflects the consideration we expect to receive in exchange for those goods or services (the transaction price). We measure revenue by estimating the transaction price based on the consideration specified in the client arrangement. Revenue is recognized as the performance obligations are satisfied. Our revenue is primarily derived from the planning and execution of advertising, marketing, and communications services in the following fundamental disciplines: Media & Advertising, Precision Marketing, Public Relations, Healthcare, Branding & Retail Commerce, Experiential, and Execution & Support. Our client contracts are primarily fees for service on a rate per hour or per project basis. Revenue is recorded net of sales, use and value added taxes.\nPerformance Obligations.\nIn substantially all our disciplines, the performance obligation is to provide advisory and consulting services at an agreed-upon level of effort to accomplish the specified engagement. Our client contracts are comprised of diverse arrangements involving fees based on any one or a combination of the following: an agreed fee or rate per hour fo",
  "item2_clean": null
}