{
  "source_file": "on-20241231.htm",
  "form_type": "10-K",
  "item1_clean": "ON Semiconductor Corporation, together with its wholly and majority-owned subsidiaries, which operate under the onsemi\nTM\nbrand (\"onsemi,\" \"we,\" \"us,\" \"our,\" or the \"Company\"), was incorporated under the laws of the State of Delaware in 1992.\nWe provide intelligent power and intelligent sensing solutions with a primary focus towards automotive and industrial markets to help our customers solve challenging problems and create cutting-edge products for a better future. We are utilizing our extensive range of power technologies to help address the growing power demands of AI and data centers. Our intelligent power technologies enable the electrification of the automotive industry that allows for lighter and longer-range electric vehicles, empowers efficient fast-charging systems and propels sustainable energy for the highest efficiency solar strings and industrial power. Our intelligent power solutions for the automotive industry allow our customers to exceed range targets with lower weight and reduce system cost through efficiency. Our intelligent sensing technologies support the next generation industry, allowing for smarter factories and buildings while also enhancing the automotive mobility experience with imaging and depth sensing that make advanced vehicle safety and automated driving systems possible.\nWe believe the evolution of the automotive industry, with advancements in autonomous driving, ADAS, vehicle electrification, and the increase in electronics content for vehicle platforms, is reshaping the boundaries of transportation. Through sensing integration, we believe our intelligent power solutions achieve superior efficiencies compared to our peers. This integration allows lower temperature operation and reduced cooling requirements while saving costs and minimizing weight. In addition, our power solutions deliver power with less die per module, achieving higher range for a given battery capacity.\nBusiness Strategy Developments\nOur primary focus continues to be on revenue growth with stable gross margin by capturing high-growth megatrends in our focused end-markets of automotive and industrial infrastructure. We design products in highly-differentiated markets focused on customer needs while optimizing and right-sizing our manufacturing footprint to support growth with new product development and maintain gross margins through efficiencies. We are focused on achieving efficiencies in our operating and capital expenditures, capital allocation on research and development investments and resources to accelerate growth in high-margin products.\nOn January 14, 2025, we completed the previously announced acquisition of the Silicon Carbide Junction Field-Effect Transistor (\"SiC JFET\") technology business from Qorvo US, Inc., and certain of its subsidiaries, for $118.8 million in cash, subject to working capital adjustments. We believe the acquisition complements our EliteSiC power portfolio within the PSG reportable segment and enables us to help address the need for high energy efficiency and power density in the AC-DC stage in power supply units for AI data centers.\n2024 Business Realignment\npotential operating improvements and efficiencies.\n2023 Business Realignment\n1.625% Notes maturity and repayment\nOn October 16, 2023, we repaid $119.6 million of the remaining outstanding principal amount of the 1.625% Notes in cash and settled the excess over the principal amount by issuing 4.5 million shares of our common stock. Under the previously executed bond hedge agreements, we also repurchased an equivalent number of shares of our common stock, for no additional consideration, to effectively offset the issuance of shares.\nOn June 22, 2023, we entered into a new Credit Agreement to replace the Revolver due 2024, which was set to mature on June 28, 2024. We drew $375.0 million against the Revolving Credit Facility and repaid the entire outstanding balance under the Revolver due 2024. We had previously repaid $125.0 million of the outstanding balance under the Revolver due 2024 during the first quarter of 2023.\n0.50% Convertible Senior Notes due 2029\nOn February 28, 2023, we completed the offering of $1.5 billion aggregate principal amount of our 0.50% Notes and utilized the net proceeds along with cash generated from operations (i) to repay $1,086.0 million of the outstanding indebtedness under the Term Loan “B” Facility and the related transaction fees and expenses, (ii) to pay $171.5 million net cost of the related convertible note hedges after such costs were offset by the proceeds from the sale of warrants, and (iii) for general corporate purposes.\n2022 Acquisitions and Divestitures\nOn December 31, 2022, we completed the acquisition of EFK along with certain other assets and liabilities from GLOBALFOUNDRIES U.S. Inc. (\"GFUS\") for total consideration of $406.3 million. We paid GFUS $236.3 million, $100.0 million and $70.0 million during 2023, 2020 and 2019, respectively.\nDuring 2022, in line with our \"Fab Right\" strategy, we divested four wafer manufacturing facilities in Oudenaarde, Belgium, South Portland, Maine, Pocatello, Idaho and Niigata, Japan. We entered into wafer supply agreements with the respective buyers of these facilities to help minimize disruptions in our ability to meet customer demand for our products.\nRevenue-Generating Activities\nonsemi generates revenue primarily from the sale of semiconductor products to distributors and direct customers. We also generate revenue, to a much lesser extent, from product development agreements and manufacturing services provided to customers. We believe that our ability to offer a broad range of products, combined with our global manufacturing and logistics network, provides our customers with single source purchasing. In 2025, we expect to include SiC JFET in our product portfolio within the PSG segment.\nThe following table illustrates the product technologies under each of our segments based on our operating strategy:\nPSG\nAMG\nISG\nLogic and Isolation products\nImage Signal Processors\nPower Module products\nNon-Volatile Memory products\nSingle Photon Detectors\nFoundry products/services\nShort-Wavelength Infrared products\nGate Driver products\nIndirect Time of Flight sensors\nProducts and Technology\nThe following provides certain information regarding the products and technologies for each of our operating segments.\nPSG\nPSG offers a wide array of discrete, module and integrated semiconductor products that perform multiple application functions, including power switching, signal conditioning, and circuit protection. The trends driving growth within our end-user markets are primarily higher power efficiency and power density in power applications, the need for greater functionality, and faster data transmission rates in all communications. Enhancement of the current electrical infrastructure driven by demand for green energy, electrification of powertrains in EVs and HEVs, and increased power demands from AI drive demand for onsemi’s highly efficient power switching products. The recent increase in the use of WBG MOSFETs and diodes, including SiC and IGBT, is further expanding the use of semiconductor products.\nAMG\nAMG designs and develops analog, mixed-signal, Power Management ICs, Sensor Interface devices, Power Conversion, Signal Chain, and Voltage Regulation devices for a broad base of end-users in the automotive, industrial, computing and mobile end-markets. We implement a platform-based design approach to rapidly proliferate product portfolios. AMG offers technology that provides our customers system-level differentiation, such as multi-phase controllers, gate drivers, DC-DC converters, AC-DC converters, ultrasonic sensors, inductive sensors, audiology digital signal processors, analog front ends, Bluetooth Low Energy, wired connectivity, Amplifiers, LDOs, Logic, EEPROMs, Isolation and more.\nISG\nISG designs and develops CMOS image sensors, image signal processors, single photon detectors, including SiPM, SPAD arrays and short-wavelength infrared products, as well as actuator drivers for autofocus and image stabilization for a broad base of end-users in the different end-markets. Our broad range of product offerings delivers excellent pixel performance, sensor functionality and camera systems capabilities in which high quality visual imagery is becoming increasingly important to our customers and their end-users, particularly in automotive and factory automation and in applications powered by AI.\nWe sell our products to distributors and direct customers for ultimate use in a variety of end-products in different end-markets. In general, we have maintained long-term relationships with our key customers, and our sales agreements are renewable periodically and contain certain terms and conditions with respect to payment, delivery, warranty and supply. During 2024, certain long-term supply agreements with strategic end-customers were modified upon mutual agreement. These agreements are subject to our standard terms and conditions, and generally include minimum purchase commitments and provisions allowing for renegotiation upon mutual agreement.\nWe generally warrant that products sold to our customers will, at the time of shipment, be free from defects in workmanship and materials and conform to our approved specifications. Our standard warranty extends for a period of two years from the date of delivery, except in the case of image sensor products, which are warrantied for one year from the date of delivery. Unless otherwise agreed in writing, customers may cancel orders 120 days prior to shipment for standard products without penalty and, for custom products, prior to shipment, provided they pay onsemi's actual costs incurred as of the date we receive the cancellation notice. The loss of one of our large customers would have a material adverse effect on the operations of the respective segment and may have a material adverse effect on our consolidated results of operations.\nSales to distributors accounted for approximately 53%, 52% and 58% of our revenue in 2024, 2023 and 2022, respectively. We had one distributor whose revenue accounted for approximately 10% of the total revenue for the year ended December 31, 2024. There were no distributors whose revenue exceeded 10% or more of total revenue for the year ended December 31, 2023. We had one distributor whose revenue accounted for approximately 12% of the total revenue for the year ended December 31, 2022. Our distributors resell our products to OEMs, contract manufacturers, and other end-customers. Sales to distributors are typically made pursuant to agreements that provide return rights and stock rotation provisions permitting limited levels of product returns.\nSales to direct customers accounted for approximately 47%, 48% and 42% of our revenue in 2024, 2023 and 2022, respectively. Large multi-nationals and selected regional OEMs, which are significant in specific markets, form our core direct customers. Generally, these customers do not have the right to return our products following a sale other than pursuant to our warranty.\nonsemi is focused on innovation to create intelligent power and sensing technologies that solve the most challenging customer problems. Our product development efforts are directed towards the following:\n\nAMG principally competes on design experience, manufacturing capability, depth and quality of IP, ability to service customer needs from the design phase to the shipping of a completed product, length of design cycle, longevity of technology support and experience of sales and technical support personnel. Our competitive position with respect to the above is enhanced by long-standing relationships with leading direct customers.\nOur ability to compete successfully depends on internal and external variables. These variables include, but are not limited to, the timeliness with which we can develop new products and technologies, product performance a",
  "item7_clean": "Management’s Discussion and Analysis of Financial Condition and Results of Operations\nThis executive overview presents summarized information regarding our business and operating trends only. For further details, please read \"Management's Discussion and Analysis of Financial Condition and Results of Operations\" in its entirety.\nOur revenue for the year ended December 31, 2024 was $7,082.3 million, representing a decrease of 14.2% from $8,253.0 million for the year ended December 31, 2023. During 2024, we reported net income attributable to onsemi of $1,572.8 million compared to $2,183.7 million in 2023. Our operating income totaled $1,767.7 million during 2024 compared to $2,538.7 million during 2023. Our gross margin decreased by approximately 170 basis points to 45.4% in 2024 from 47.1% in 2023. The decrease in our operating results was primarily due to decreased demand in our automotive and industrial end-markets resulting in lower sales volumes and the corresponding underutilization of our manufacturing facilities. See discussion under \"Results of Operations\" for the reasons for the fluctuations year-over-year.\nBusiness and Macroeconomic Environment\nThe semiconductor industry has traditionally been highly cyclical, has often experienced significant downturns in connection with, or in anticipation of, declines in general economic conditions. During 2024, the semiconductor industry continued to experience a softening demand and uncertainty due to macroeconomic factors and the geopolitical environment. We are monitoring the economic environment and related forecasts for indicators that would suggest the global economic slowdown could continue for an extended period. Given the current conditions, we are actively managing and have taken corrective actions in our manufacturing capacity and spending to align with the forecasted demand. We intend to continue these actions during 2025; however, we believe the current volatility in general economic conditions is not expected to have a significant impact on our long-term strategic and growth initiatives.\nWe continue to evaluate cost-saving initiatives to be able to align our overall cost structure, capital investments and other expenditures with our expected revenue, spending and capacity levels to help offset softening demand, increased manufacturing and operating costs. We have taken, and continue to take actions, including but not limited to, exiting product lines that do not enhance gross margin or satisfy strategic objectives and aligning internal manufacturing capacity and resources to external demand.\nResults of Operations\nThe following table summarizes certain information relating to our operating results that has been derived from our audited consolidated financial statements (in millions):\n\nResearch and development\nSelling and marketing\nGeneral and administrative\nAmortization of acquisition-related intangible assets\nRestructuring, asset impairments and other charges, net\nTotal operating expenses\nOther income (expense), net:\nLoss on debt refinancing and prepayment\nLoss on divestiture of businesses\nOther income (expense), net\nOther income (expense), net\nIncome before income taxes\nIncome tax provision\nLess: Net income attributable to non-controlling interest\nNet income attributable to ON Semiconductor Corporation\nThe following table summarizes certain information relating to our segment results (in millions):\nPSG\nAMG\nISG\nPSG\nAMG\nISG\nPSG\nAMG\nISG\nDuring the first quarter of 2024, the Company reorganized certain reporting units and its segment reporting structure. As a result of the reorganization of divisions within PSG and AMG, the prior-period amounts have been reclassified to conform to current-period presentation.\nGross profit margin as a percent of respective segment revenue balances\nRevenue was $7,082.3 million and $8,253.0 million for 2024 and 2023, respectively. The decrease from 2023 to 2024 of $1,170.7 million, or 14.2%,\nas attributable to lower sales volumes across all segments, which are further explained below. We had one customer, a distributor, whose revenue accounted for approximately 10% of our total revenue for the year ended December 31, 2024. There was no customer whose revenue exceeded 10% of total revenue for the year ended December 31, 2023.\nRevenue from PSG decreased by $532.2 million, or approximately 13.7%, during 2024 compared to 2023. Revenue from our Multi-Market Power Division, Industrial Power Division and Automotive Power Division decreased by $250.8 million, $162.2 million and $119.1 million, respectively, primarily driven by a decrease in demand in the automotive and industrial end-markets.\nRevenue from AMG decreased by $448.0 million, or approximately 14.7%, during 2024 compared to 2023. Revenue from our Power Management Division, Sensor Interface Division and Integrated Circuit Division decreased by $269.1 million, $101.5 million and $77.4 million, respectively, also due to the decrease in demand in the automotive and industrial end-markets.\nRevenue from ISG decreased by $190.5 million, or approximately 14.5%, during 2024 compared to 2023, which was driven by a decrease in revenue from our Industrial and Consumer Solutions Division and Automotive Sensing Division of $107.8 million and $82.7 million, respectively, primarily due to the decrease in demand in the automotive and industrial end-markets\nRevenue by Geographic Location\nRevenue by geographic location, based on sales billed from the respective country or regions, was as follows (dollars in millions):\nCertain of the amounts may not total due to rounding of individual amounts.\nGross Profit and Gross Margin\nGross profit was $3,216.1 million and $3,883.5 million for 2024 and 2023, respectively, representing a decrease of $667.4 million or approximately 17.2%. This was primarily due to the decline in sales volume in both our existing products and new products which negatively impacted gross profit by approximately $630 million and $122 million, respectively. This was partially offset by a reduction in the lower-margin manufacturing services revenue at our EFK location which favorably impacted gross profit by approximately $85 million.\nOur gross margin decreased by 1.7 percentage points from 47.1% for the year ended December 31, 2023 to 45.4% for the year ended December 31, 2024, primarily due to the impact of the factors explained in the segment gross margin sections below.\nPSG gross profit decreased by $437.4 million, primarily driven by the decline in sales volume in both existing products and new products which negatively impacted gross profit by approximately $316 million and $121 million, respectively. PSG gross margin decreased by 5.6 percentage points to 41.3% from 47.0%, primarily as a result of the decline in volume, underutilization of our manufacturing facilities, and the related impact of unfavorable product mix.\nAMG gross profit decreased by $115.1 million, primarily driven by the decline in sales volume from existing products, which negatively impacted gross profit by approximately $200 million, partially offset by improved gross profit of approximately $85 million from the lower-margin manufacturing services at our EFK location. AMG gross margin increased by 3.6 percentage points to 50.1% from 46.5%, primarily due to the reduction in the lower-margin manufacturing services revenue at our EFK location.\nISG gross profit decreased by $114.9 million, primarily driven by the decline in sales volume from existing products. ISG gross margin decreased 2.0 percentage points to 46.7% from 48.7%, primarily driven by lower sales volumes and the related impact of the underutilization of our manufacturing facilities, along with unfavorable changes in product mix.\nResearch and Development\nResearch and development expenses were $612.7 million and $577.3 million, or approximately 9% and 7% of revenue for 2024 and 2023, respectively, representing an increase of $35.4 million, or approximately 6% year-over-year. The increase was primarily due to an increase in payroll-related expenses and production supplies, partially offset by a decrease in variable compensation.\nSelling and Marketing\nSelling and marketing expenses were $273.5 million and $279.1 million, or approximately 4% and 3% of revenue for 2024 and 2023, respectively, representing a decrease of $5.6 million, or approximately 2% year-over-year. The decrease was primarily related to a decrease in sales commissions and variable compensation.\nGeneral and Administrative\nGeneral and administrative expenses were $376.3 million and $362.4 million, or approximately 5% and 4% of revenue for 2024 and 2023, respectively, representing an increase of $13.9 million, or approximately 4% year-over-year. The increase was primarily due to increased consulting fees associated with information technology initiatives partially offset by a decrease in the bad debt provision with a strategic business partner which was recorded in the prior year.\nAmortization of Acquisition-Related Intangible Assets\nAmortization of acquisition-related intangible assets was $52.0 million and $51.1 million for 2024 and 2023, respectively, representing an increase of $0.9 million, or approximately 2%, year-over-year. Expenses were consistent between periods as there were no significant acquisitions or divestitures.\n\nRestructuring, Asset Impairments and Other Charges, net\nOther Income and Expenses\nInterest expense decreased by $12.5 million, or approximately 17%, to $62.3 million during 2024 compared to $74.8 million in 2023. The decrease was primarily due to the pay down of higher variable-rate debt and replacement by the 0.50% Notes in 2023. Our average gross amount of long-term debt balance (including current maturities) during 2024 and 2023 was $3,379.9 million and $3,304.1 million, respectively. Our weighted average interest rate on our gross amount of long-term debt (including current maturities) was 1.8% and 2.3% per annum in 2024 and 2023, respectively.\nInterest income increased by $18.3 million, or approximately 20%, to $111.4 million during 2024 compared to $93.1 million in 2023, primarily due to higher interest rates and increased balances in interest-bearing accounts.\nLoss on Debt Refinancing and Prepayment\nOther income (expense), net\nOther income (expense), net was income of $20.6 million in 2024, compared to expense of $7.2 million in\n. We received $9.5 million of dividend income in 2024 with no corresponding amounts in 2023. Actuarial gains on pension plans were $12.2 million compared to losses of $4.0 million during 2023 and fluctuations in foreign currencies resulting in increased transaction gains.\nIncome Tax Provision\nWe recorded an income tax provision of $262.8 million and $350.2 million in 2024 and 2023, respectively, representing effective tax rates of 14.3% and 13.8%.\nLiquidity and Capital Resources\nOur principal sources of liquidity are cash on hand, cash generated from operations, available borrowings under our Revolving Credit Facility as well as new debt and/or equity issuances. In the near term, we expect to fund our cash requirements by utilizing any or a combination of these principal sources. Our cash and cash equivalents and short-term investments were approximately $2,691.3 million and $300.0 million, respectively, as of December 31, 2024 and our Revolving Credit Facility had approximately $1.1 billion available for future borrowings as of December 31, 2024.\nWe require cash to: (i) fund our operating expenses, working capital requirements, outlays for strategic acquisitions and investments; (ii) service our debt, including principal and interest; (iii) incur capital expenditures; and (iv) repurchase our common stock. During the ordinary course of business, we evaluate our cash requirements and, if necessary, adjust our expenditures to reflect the current market conditions and our projected sales and demand. Future capital expenditures may be impacted by events and transactions that are not currently forecasted.\nWe believe that the key factors that could adversely affect our internal and external sources of cash include:\nchanges in demand for our products, competitive pricing pressures, supply chain constraints, effective management of our manufacturing capacity, our ability to achieve further reductions in operating expenses, our ability to make progress on the achievement of our business strategy and sustainability goals, the impact of our restructuring programs on our production and cost efficiency and our ability to make the research and development expenditures required to remain competitive in our business; and\nthe debt and equity capital markets could impact our ability to obtain needed financing on acceptable terms or to respond to business opportunities and developments as they arise, including interest rate fluctuations, macroeconomic conditions, sudden reductions in the general availability of lending from banks or the related increase in cost to obtain bank financing and our ability to maintain compliance with covenants under our debt agreements in effect from time to time.\nSources and Uses of Cash\nThe following are the significant sources and uses of cash during 2024:\nCash flows from operating activities of $1,906.4 million\nPurchase of property, plant & equipment of $694.0 million.\nRepurchases of approximately 9.1 million shares of common stock for an aggregate purchase price of approximately $650 million under the Share Repurchase Program.\nOperating Activities\nOur long-term cash generation is dependent on our ability to generate cash from our operations. Our cash flows from operating activities were $1,906.4 million, $1,977.5 million and $2,633.1 million for the years ended\nDecember 31, 2024, 2023 and 2022\nOur operating cash flows for the year ended December 31, 2024 decreased\nby $71.1 million, or 3.6%, compared to the year ended December 31, 2023 and was primarily attributable to a reduction in net income driven by lower end-market demand for our products partially offset by the timing of cash receipts and payments related to working capital balances.\nOur ability to maintain positive operating cash flows is dependent on, among other factors, our success in achieving our revenue goals and meeting manufacturing and operating cost targets. Management of our assets and liabilities, including both working capital and long-term assets and liabilities, also influences our operating cash flows.\nInvesting Activities\nOur cash flows used in investing activities were $1,009.8 million, $1,737.9 million and $705.4 million for the years ended\nDecember 31, 2024, 2023 and 2022\n, respectively. The decrease of $728.1 million\nfor the year ended December 31, 2024 compared to\nthe year ended December 31, 2023 was primarily attributable to a decrease in capital expenditures and payments for the acquisition of our EFK location during the year ended 2023, partially offset by the net impact of purchases and maturities of short-term investments. During the years ended\nDecember 31, 2024, 2023\n\nwas approximately 10%, 19% and 12%, respectively. In 2025, based on current plans, we expect capital expenditures to be approximately 5% of revenue.\nFinancing Activities\nOur cash flows used in financing activities were $683.8 million, $686.5 million and $370.0 million for the years ended December 31, 2024, 2023 and 2022, respectively. We used cash for share repurchases of $654.1 million for the year ended\nDecember 31, 2024 compared to\n$564.2 million in 2023. Additionally, during the year ended December 31, 2023, we had net cash outflows related to the establishment of our new Credit Agreement.\nDuring January 2025, we acquired 1.6 million shares for $100.0 million under the Share Repurchase Program, subject to a 10b5-1 trading arrangement. We expect to continue to opportunistically repurchase under our Share Repurchase Program subject to market conditions, the price of our shares and other factors (including liquidity needs). However, the Sh",
  "item2_clean": null
}