{
  "source_file": "on-20251003.htm",
  "form_type": "10-Q",
  "item1_clean": null,
  "item7_clean": null,
  "item2_clean": "Item 2. Management’s Discussion and Analysis of Financial Condition and Results of Operations\nWe offer intelligent power and intelligent sensing solutions that drive the transformation of automotive and industrial markets, while also meeting the increasing needs of AI and data centers. Our intelligent power technologies enable the electrification of the automotive industry that allows for lighter and longer-range electric vehicles, empowers efficient fast-charging systems and propels sustainable energy for the highest efficiency solar strings and industrial power. Our intelligent power solutions for the automotive industry allow our customers to exceed range targets with lower weight and reduce system cost through efficiency. Our intelligent sensing technologies support the next generation industry, allowing for smarter factories and buildings while also enhancing the automotive mobility experience with imaging and depth sensing that make advanced vehicle safety and automated driving systems possible.\nWe believe the evolution of the automotive industry, with advancements in autonomous driving, ADAS, vehicle electrification, and the increase in electronics content for vehicle platforms, is reshaping the boundaries of transportation. Through sensing integration, we believe our intelligent power solutions achieve superior efficiencies compared to our peers. This integration allows lower temperature operation and reduced cooling requirements while saving costs and minimizing weight. In addition, our power solutions deliver power with less die per module, achieving higher range for a given battery capacity.\nBusiness Strategy Developments\nWe are focused on generating operating cash and returning capital to our shareholders through our Share Repurchase Program. Our goal is to achieve revenue growth with stable gross margins by capitalizing on high-growth megatrends in our primary end-markets of automotive and industrial infrastructure. Despite the current challenges posed by geopolitical and macroeconomic factors, we continue to optimize and right-size our manufacturing footprint to align our capacity with anticipated long-term growth, while focused on generating efficiencies to manage these headwinds. We design products for differentiated markets, focusing on addressing customer needs. We aim to achieve efficiencies in our operating and capital expenditures and invest in research and development initiatives to accelerate growth in high-margin products.\n2025 Manufacturing Realignment Program\nDuring the first quarter of 2025, we announced restructuring and cost reduction initiatives based on an evaluation of our operating structure, business strategy, manufacturing technologies and internal capabilities to realign our internal manufacturing capacity and capabilities with anticipated long-term needs.\nWe expect to incur total severance costs and related benefit expenses of $67 million related to the termination of approximately 2,400 employees. Of this, approximately $2.8 million and $65.9 million was recognized during the quarter and nine months ended October 3, 2025, respectively. Additionally, we recorded non-cash impairment charges of $15.8 million and $487.9 million during the quarter and nine months ended October 3, 2025, respectively, related to previous investments in manufacturing equipment at certain manufacturing facilities pursuant to held-for-sale accounting guidance. Other charges of $1.0 million and $51.5 million for the quarter and nine months ended October 3, 2025, respectively, comprised of estimated costs associated with selling the equipment and contract termination costs, were incurred as a result of the above initiatives. The total of the aforementioned costs was included within Restructuring, Asset Impairments and Other, Net in the Consolidated Statement of Operations.\nAdditionally, during the nine months ended October 3, 2025, we recorded $235.8 million relating to excess and obsolete inventory charges, of which $230.3 million related to inventory primarily considered work in progress within the ISG reportable segment, as well as $45.7 million related to write-off of consumables, manufacturing supplies and obligations for certain unfulfilled purchase commitments due to the manufacturing capacity reduction actions associated with the 2025\nManufacturing Realignment Program. These charges were recorded within Cost of revenue in the Consolidated Statement of Operations.\nResults of Operations\nQuarter Ended October 3, 2025 compared to the Quarter Ended September 27, 2024\nThe following table summarizes certain information relating to our operating results that has been derived from our unaudited consolidated financial statements (in millions):\n\nResearch and development\nSelling and marketing\nGeneral and administrative\nAmortization of intangible assets\nRestructuring, asset impairments and other, net\nTotal operating expenses\nOther income (expense), net:\nOther income (expense)\nOther income (expense), net\nIncome before income taxes\nIncome tax provision\nLess: Net income attributable to non-controlling interest\nNet income attributable to ON Semiconductor Corporation\nThe following table summarizes certain information relating to our segment results (in millions):\nQuarter Ended October 3, 2025\nQuarter Ended September 27, 2024\nPSG\nAMG\nISG\nPSG\nAMG\nISG\nPSG\nAMG\nISG\nGross profit margin as a percentage of respective segment revenue balances.\nRevenue was $1,550.9 million and $1,761.9 million for the quarters ended October 3, 2025 and September 27, 2024, respectively, representing a decrease of $211.0 million, or approximately 12%, year over year. We had one customer, a distributor, whose revenue accounted for approximately 12% of our total revenue for the quarters ended October 3, 2025 and September 27, 2024 across all reportable segments.\nRevenue from PSG decreased by $91.8 million, or approximately 11%, for the quarter ended October 3, 2025 compared to the quarter ended September 27, 2024. Revenue from our Automotive Power Division, Multi-Market Power Division and Industrial Power Division decreased by $69.6 million, $19.6 million and $2.6 million, respectively, primarily due to the continued decrease in demand in the automotive and industrial end-markets.\nRevenue from AMG decreased by $70.4 million, or approximately 11%, for the quarter ended October 3, 2025 compared to the quarter ended September 27, 2024. Revenue from our Sensor Interface Division increased by $25.3 million primarily due to an increase in industrial demand offset by decreases within our Power Management Division and Integrated Circuit Division of $71.2 million and $24.5 million, respectively, primarily due to the continued decrease in demand in the automotive and other end-markets.\nRevenue from ISG decreased by $48.8 million, or approximately 18%, for the quarter ended October 3, 2025 compared to the quarter ended September 27, 2024. Revenue from our Industrial and Consumer Solutions Division and Automotive Sensing Division decreased by $0.7 million and $48.1 million, respectively, primarily due to the continued decrease in demand in the automotive and industrial end-markets.\nRevenue by Geographic Location\nRevenue by geographic location, based on sales billed from the respective country or region, was as follows (dollars in millions):\n\nQuarter Ended September 27, 2024\nCertain amounts may not total due to rounding of individual amounts.\nGross Profit and Gross Margin\nGross profit decreased by $212.2 million, or approximately 27%, to $587.2 million for the quarter ended October 3, 2025 compared to $799.4 million for the quarter ended September 27, 2024 primarily attributable to a continued decrease in sales volume from existing products and new products that negatively impacted gross profit by approximately $188.2 million and $24.0 million, respectively.\nPSG gross profit decreased by $134.7 million, primarily driven by the decline in sales volume from existing products and new products, which negatively impacted gross profit by approximately $110.7 million and $24.0 million, respectively. PSG gross margin decreased by 13.1 percentage points to 28.5% from 41.6% as a result of significant underutilization, decline in sales volume, impact of unfavorable product mix and market pressures.\nAMG gross profit decreased by $29.2 million, primarily driven by the decline in sales volume from existing products. AMG gross margin increased by 1.0 percentage point to 50.8% from 49.8%, primarily due to the reduction in lower-margin manufacturing services revenue at our EFK location.\nISG gross profit decreased by $48.3 million, primarily driven by the decline in sales volume from existing products. ISG gross margin decreased to 35.2% from 46.3%, primarily due to unfavorable product mix and market pressures as well as the result of certain strategy changes in connection with the 2025 Manufacturing Realignment Program.\nResearch and development expenses were $141.9 million for the quarter ended October 3, 2025, as compared to $151.0 million for the quarter ended September 27, 2024, representing a decrease of $9.1 million, or approximately 6%. The decrease was\nprimarily attributable to a decrease in production supplies and outside services.\nSelling and marketing expenses were $62.8 million for the quarter ended October 3, 2025, as compared to $65.4 million for the quarter ended September 27, 2024, representing a decrease of $2.6 million, or approximately 4%.\nThe decrease was primarily attributable to a decrease in payroll-related expenses.\nGeneral and administrative expenses were $87.3 million for the quarter ended October 3, 2025, as compared to $95.5 million for the quarter ended September 27, 2024, representing a decrease of $8.2 million, or approximately 9%. The decrease was\nprimarily attributable to an increase in payroll-related expenses offset by lower third-party acquisition-related costs.\nOther Operating Expenses\nAmortization of Intangible Assets\nAmortization of"
}