{
  "source_file": "orly-20250930x10q.htm",
  "form_type": "10-Q",
  "item1_clean": null,
  "item7_clean": null,
  "item2_clean": "2. Management’s Discussion and Analysis of Financial Condition and Results of Operations\nUnless otherwise indicated, “we,” “us,” “our,” and similar terms, as well as references to the “Company” or “O’Reilly,” refer to O’Reilly Automotive, Inc. and its subsidiaries.\nIn Management’s Discussion and Analysis, we provide a historical and prospective narrative of our general financial condition, results of operations, liquidity, and certain other factors that may affect our future results, including\nan overview of the key drivers and other influences on the automotive aftermarket industry;\nour results of operations for the three and nine months ended September 30, 2025 and 2024;\nour liquidity and capital resources;\nour critical accounting estimates; and\nrecent accounting pronouncements that may affect our Company.\nThe review of Management’s Discussion and Analysis should be made in conjunction with our condensed consolidated financial statements, related notes and other financial information, forward-looking statements, and other risk factors included elsewhere in this quarterly report.\nFORWARD-LOOKING STATEMENTS\nOVERVIEW\nWe are a specialty retailer of automotive aftermarket parts, tools, supplies, equipment, and accessories in the United States, Puerto Rico, Mexico, and Canada. We are one of the largest North American automotive aftermarket specialty retailers, selling our products to both DIY customers and professional service providers – our “dual market strategy.” Our goal is to achieve growth in sales and profitability by capitalizing on our competitive advantages, such as our dual market strategy, superior customer service provided by well-trained and technically proficient Team Members, and strategic distribution and hub store network that provides same day and over-night inventory access for our stores to offer a broad selection of product offerings. The successful execution of our growth strategy includes aggressively opening new stores, growing sales in existing stores, continually enhancing merchandising and store layouts, and implementing our Omnichannel initiatives. As of September 30, 2025, we operated 6,406 stores in 48 U.S. states and Puerto Rico, 107 stores in Mexico, and 25 stores in Canada.\nThe extensive product line offered in our stores consists of new and remanufactured automotive hard parts, maintenance items, accessories, a complete line of auto body paint and related materials, automotive tools, and professional service provider service equipment. Our extensive product line includes an assortment of products that are differentiated by quality and price for most of the product lines we offer. For many of our product offerings, this quality differentiation reflects “good,” “better,” and “best” alternatives. Our sales and total gross profit dollars are, generally, highest for the “best” quality category of products. Consumers’ willingness to select products at a higher point on the value spectrum is a driver of enhanced sales and profitability in our industry. We have ongoing\n\ninitiatives focused on marketing and training to educate customers on the advantages of ongoing vehicle maintenance, as well as “purchasing up” on the value spectrum.\nOur stores also offer enhanced services and programs to our customers, including used oil, oil filter, and battery recycling; battery, wiper, and bulb replacement; battery diagnostic testing; electrical and module testing; check engine light code extraction; loaner tool program; drum and rotor resurfacing; custom hydraulic hoses; professional paint shop mixing and related materials; and machine shops.\nOur business is influenced by a number of general macroeconomic factors that impact both our industry and consumers, including, but not limited to, inflation, tariffs, fuel and energy costs, unemployment trends, interest rates, and other economic factors. Future changes, such as continued broad-based inflation and rapid fuel cost increases that exceed wage growth, may negatively impact our consumers’ level of disposable income, and we cannot predict the degree these changes, or other future changes, may have on our business or industry.\nWe believe the key drivers of demand over the long-term for the products sold within the automotive aftermarket include the number of miles driven, number of registered vehicles, annual rate of light vehicle sales, and average vehicle age. Currently, our consolidated revenue is primarily generated within the United States.\nNumber of Miles Driven\nThe number of total miles driven in the U.S. influences the demand for repair and maintenance products sold within the automotive aftermarket. In total, vehicles in the U.S. are driven approximately three trillion miles per year, resulting in ongoing wear and tear and a corresponding continued demand for the repair and maintenance products necessary to keep these vehicles in operation. According to the U.S. Department of Transportation, the number of total miles driven in the U.S. increased 2.1% and 1.0% in 2023 and 2024, respectively, and year-to-date through July of 2025, miles driven have increased 0.9%. Total miles driven can be impacted by macroeconomic factors, including rapid increases in fuel cost, but we are unable to predict the degree of impact these factors may have on miles driven in the future.\nSize and Age of the Vehicle Fleet\nThe total number of vehicles on the road and the average age of the vehicle population heavily influence the demand for products sold within the automotive aftermarket industry. As reported by the Auto Care Association, the total number of U.S. registered vehicles increased 13.4% from 2014 to 2024, bringing the number of light vehicles on the road to 286 million by the end of 2024. For the year ended December 31, 2024, the seasonally adjusted annual rate of light vehicle sales in the U.S. (“SAAR”) was approximately 16.8 million vehicles, and for 2025, the SAAR is estimated to be approximately 16.4 million vehicles, contributing to the continued growth in the total number of registered vehicles on the road. From 2014 to 2024, U.S. vehicle scrappage rates have remained relatively stable, ranging from 4.1% to 5.6% annually. As a result, over the past decade, the average age of the U.S. vehicle population has increased 10.5%, from 11.4 years in 2014 to 12.6 years in 2024. While the annual changes to the vehicle population resulting from new vehicle sales and the fluctuation in vehicle scrappage rates in any given year represent a small percentage of the total light vehicle population and have a muted impact on the total number and average age of vehicles on the road over the short term, we believe our business benefits from rising average new and used vehicle prices, as consumers are generally more willing to continue to invest in their current vehicle.\nWe believe the increase in average vehicle age over the long term can be attributed to better engineered and manufactured vehicles, which can be reliably driven at higher mileages due to better quality power trains, interiors and exteriors, coupled with consumers’ willingness to invest in maintaining these higher-mileage, better built vehicles. As the average age of vehicles on the road increases, a larger percentage of miles are being driven by vehicles that are outside of a manufacturer warranty. These out-of-warranty, older vehicles generate strong demand for automotive aftermarket products as they go through more routine maintenance cycles, have more frequent mechanical failures, and generally require more maintenance than newer vehicles. We believe consumers will continue to invest in these reliable, higher-quality, higher-mileage vehicles, and these investments, along with an increasing total light vehicle fleet, will support continued demand for automotive aftermarket products.\nInflationary cost pressures impact our business; however, historically we have been successful, in many cases, in reducing the effects of merchandise cost increases, principally by taking advantage of supplier incentive programs and economies of scale resulting from increased volume of purchases. To the extent our acquisition costs increase due to base commodity price increases or other input cost increases affecting the entire industry, we have typically been able to pass along these cost increases through higher selling prices for the affected products. As a result, we do not believe inflation has had a material adverse effect on our operating results.\nTo some extent, our business is seasonal, primarily as a result of the impact of weather conditions on customer buying patterns. While we have historically realized operating profits in each quarter of the year, our store sales and profits have historically been higher in the second and third quarters (April through September) than in the first and fourth quarters (October through March) of the year.\n\nWe remain confident in our ability to gain market share in our existing markets and grow our business in new markets by focusing on our dual market strategy and the core O’Reilly values of hard work and excellent customer service.\nRESULTS OF OPERATIONS\nSales for the three months ended September 30, 2025, increased $341 million, or 8%, to $4.71 billion from $4.36 billion for the same period one year ago. Sales for the nine months ended September 30, 2025, increased $755 million, or 6%, to $13.37 billion from $12.61 billion for the same period one year ago. Comparable store sales increased 5.6% and 1.5% for the three months ended September 30, 2025 and 2024, respectively. Comparable store sales increased 4.5% and 2.4% for the nine months ended September 30, 2025 and 2024, respectively. Comparable store sales are calculated based on the change in sales for U.S. stores open at least one year and exclude sales of specialty machinery, sales to independent parts stores, and sales to Team Members, as well as sales from Leap Day in the nine months ended September 30, 2024. Online sales"
}