{
  "source_file": "orly-20241231x10k.htm",
  "form_type": "10-K",
  "item1_clean": "Strategic Regional Tiered Distribution Network:\nWe believe our commitment to a robust, regional, tiered distribution network provides superior replenishment and access to hard-to-find parts and enables us to optimize product availability and inventory levels throughout our store network. Our strategic, regional, tiered distribution network includes distribution centers (“DCs”) and Hub stores. Our inventory management and distribution systems electronically link each of our stores to one or more DCs, which provides for efficient inventory control and management. We currently operate 31 DCs, which typically provides our stores with same-day or overnight access to over 153,000 stock keeping units (“SKUs”), many of which are hard-to-find items not typically stocked by other auto parts retailers. To augment our robust distribution network, we operate a total of 396 Hub stores that also provide delivery service and same-day access to stores within the surrounding areas to an average of 55,000 SKUs, with Hubs in select markets carrying further enhanced inventory levels up to approximately 107,000 SKUs. More than 95% of our stores receive multiple same-day deliveries and deliveries on weekends of hard to find parts from our DCs and Hub stores. We believe this timely access to a broad range of products is a key competitive advantage in satisfying customer demand and generating repeat business.\nExperienced Management Team:\nAggressively Open New Stores:\nWe intend to continue to consolidate the fragmented automotive aftermarket. During 2024, we opened 198 net, new stores and acquired 23 stores in Canada. In 2025, we plan to open 200 to 210 net, new stores, which will increase our penetration in existing markets and allow for expansion into new, contiguous markets. The sites for these new stores have been identified, and to date, we have not experienced significant difficulties in locating suitable sites for construction of new stores or identifying suitable acquisition targets for conversion to O’Reilly stores. We typically open new stores by\nconstructing a new facility or renovating an existing facility on property we purchase or lease and stocking the new store with fixtures and inventory;\nacquiring an independently owned auto parts store (“jobber store”), typically by the purchase of substantially all of the inventory and other assets (other than realty) of such store; or\npurchasing multi-store chains.\nNew store sites are strategically located in clusters within geographic areas that complement our distribution network in order to achieve economies of scale in management, advertising, and distribution. Other key factors we consider in the site selection process include population density and growth patterns, demographic lifestyle segmentation, age and per capita income, vehicle traffic counts, vehicles in operation, number and type of existing automotive repair facilities, and competing auto parts stores within a predetermined radius.\nWe target both small and large markets for expansion of our store network. While we have, and continue to face, aggressive competition in the more densely populated markets, we believe we have competed effectively, and are well positioned to continue to compete effectively, in such markets in order to achieve our goal of continued profitable sales growth within these markets. We also believe that with our dual market strategy, we are better able to operate stores in less densely populated areas, which would not otherwise support a national chain store selling primarily to the retail automotive aftermarket. Therefore, we continue to pursue opening new stores in less densely populated market areas as part of our growth strategy.\nGrow Sales in Existing Stores:\nProfitable comparable store sales growth is also an important part of our growth strategy. To achieve improved sales and profitability at existing O’Reilly stores, we continually strive to improve the service provided to our customers. We believe that while competitive\n\nand arrangements with certain suppliers that provided for extended dating and payment terms for inventory purchases. As a whole, we consider our relationships with our suppliers to be very good.\nWe purchase automotive products in substantial quantities from over 645 suppliers, the five largest of which accounted for approximately 26% of our total purchases in 2024. Our largest supplier in 2024 accounted for approximately 8% of our total purchases and the next four largest suppliers each accounted for approximately 3% to 6% of our total purchases.\nRetail and Online Marketing:\nOur integrated marketing strategy and Omnichannel efforts include national media channels, in-store, digital, and social media activation, as well as personalized experiences through e-mail and text messaging and marketing the O’Reilly brand through automotive event sponsorships and on-site appearances throughout the country. Our O’Rewards loyalty program encourages repeat customers, as they accumulate points from their O’Reilly purchases that are redeemable for rewards at various purchase levels. Our marketing efforts also target the Spanish-speaking market through broadcast media, print, and sports marketing, as well as sponsorships of local and regional events.\nProfessional Marketing:\nTo develop our continued relationships with professional service providers and installers, we employ Territory Sales Managers in all major markets to ensure complete sales territory coverage and personalized service for professional customers. Flyers, quick reference guides, and catalogs are distributed on a regular basis to all professional service providers, including paint and body shops and fleet maintenance customers to encourage brand and program awareness. In addition, our professional customer program also offers a proprietary ordering mobile application, business ecommerce platform called www.OReillyPro.com, dedicated Professional Service Specialists in stores, multiple daily deliveries, and access to training opportunities, shop management, maintenance supplies, and the Certified Auto Repair program, which offers professional service providers with the business tools they need to profitably grow and market their business.\nINDUSTRY ENVIRONMENT\nThe automotive aftermarket industry includes all products and services purchased for light and heavy-duty vehicles after the original sale. The total size of the U.S. automotive aftermarket is estimated to be approximately $414 billion, according to the Auto Care Association. This market is made up of four segments: labor share of professional service provider sales, auto parts share of professional service provider sales, DIY sales, and tire sales. We estimate that O’Reilly’s U.S. addressable market within this industry is approximately $150 billion to $160 billion, which includes the auto parts share of professional service provider sales at wholesale and DIY sales at retail. We do not sell tires or perform for-fee automotive repairs or installations.\nThe sale of automotive aftermarket items is highly competitive in many areas, including customer service, product availability, store location, brand recognition, and price. We compete in both the DIY and professional service provider portions of the automotive aftermarket and are one of the largest specialty retailers within that market. We compete primarily with\nnational retail and wholesale automotive parts chains (such as AutoZone, Inc., Advance Auto Parts, CARQUEST, and NAPA);\nregional retail and wholesale automotive parts chains;\nwholesalers or jobber stores (some of which are associated with national automotive parts distributors or associations such as NAPA, CARQUEST, Bumper to Bumper, and Auto Value);\nautomobile dealers; and\nmass merchandisers and online retailers that carry automotive replacement parts, maintenance items, and accessories (such as Wal-Mart Stores, Inc. and Amazon.com, Inc.).\nWe compete on the basis of customer service, which includes merchandise selection and availability, technical proficiency, helpfulness of store personnel, price, store layout, the Omnichannel experience, and convenient and accessible store locations. Our dual market strategy requires significant capital, including the capital expenditures required for our distribution and store networks and working capital needed to maintain inventory levels necessary for providing products to both the DIY and professional service provider portions of the automotive aftermarket.\n\nGENERAL INFORMATION\nUnless otherwise indicated, “we,” “us,” “our,” and similar terms, as well as references to the “Company,” refer to O’Reilly Automotive, Inc. and its Subsidiaries. O’Reilly is one of the largest specialty retailers of automotive aftermarket parts, tools, supplies, equipment, and accessories in the United States (“U.S.”), selling our products to both do-it-yourself (“DIY”) and professional service provider customers, our “dual market strategy.” The business was founded in 1957 by Charles F. O’Reilly and his son, Charles H. “Chub’’ O’Reilly, Sr., and initially operated from a single store in Springfield, Missouri. Our common stock has traded on The Nasdaq Global Select Market under the symbol “ORLY” since April 22, 1993.\nOn January 22, 2024, the Company completed the previously announced strategic acquisition of Groupe Del Vasto (“Vast Auto”), an auto parts supplier headquartered in Montreal, Quebec, Canada. At the time of the acquisition, Vast Auto operated two distribution centers and six satellite warehouses that support a network of 23 company-owned stores and thousands of independent jobber and professional customers across Eastern Canada.\nAt December 31, 2024, we operated 6,265 stores in 48 states in the United States and Puerto Rico, 87 stores in Mexico, and 26 stores in Canada. Our stores carry an extensive product line, including\nnew and remanufactured automotive hard parts and maintenance items, such as alternators, batteries, brake system components, belts, chassis parts, driveline parts, engine parts, fuel pumps, hoses, starters, temperature control, water pumps, antifreeze, appearance products, engine additives, filters, fluids, lighting, oil, and wiper blades and\naccessories, such as floor mats, seat covers, and truck accessories.\nOur stores offer many enhanced services and programs to our customers, such as\nbattery diagnostic testing;\nbattery, wiper, and bulb replacement;\ncheck engine light code extraction, with diagnostic information, list of possible repair fixes, and referrals to trusted local repair shops provided;\ncustom hydraulic hoses;\ndrum and rotor resurfacing;\nelectrical and module testing;\nloaner tool program;\nprofessional paint shop mixing and related materials; and\nused oil, oil filter, and battery recycling.\nOUR BUSINESS\nOur goal is to continue to achieve growth in sales and profitability by capitalizing on our competitive advantages and executing our growth strategies. We remain confident in our ability to continue to gain market share in our existing markets and grow our business in new markets by focusing on our dual market strategy and the core O’Reilly values, including hard work, superior customer service, and expense control. Our mission is to be the dominant auto parts provider in all the markets we serve by providing a higher level of customer service and a better value position than our competitors to both DIY and professional service provider customers.\n\nCompetitive Advantages\nWe believe our effective dual market strategy, superior customer service, technically proficient store personnel, strategic distribution network, and experienced management Team make up our key competitive advantages, which cannot be easily duplicated.\nProven Ability to Execute Our Dual Market Strategy:\nFor more than 45 years, we have established a track record of effectively serving, at a high level, both DIY and professional service provider customers. We believe our proven ability to effectiv",
  "item7_clean": "of replacement parts is, on average, greater, which is a benefit to average ticket values. The decrease in DIY customer transaction counts was driven by decrease in repair frequency and pressured consumer spending on discretionary categories.\nSee Note 2 “Business Combination” to the Consolidated Financial Statements for further information concerning the recent acquisition of Vast Auto. See Note 14 “Revenue” to the Consolidated Financial Statements for further information concerning the Company’s sales.\nGross profit for the year ended December 31, 2024, increased 6% to $8.55 billion (or 51.2% of sales) from $8.10 billion (or 51.3% of sales) for the same period in 2023. The increase in gross profit dollars for the year ended December 31, 2024, was primarily the result of increase in comparable store sales at existing stores, sales from new and acquired stores, and one additional day due to Leap Day. The decrease in gross profit as a percentage of sales for the year ended December 31, 2024, was due to the inclusion of the lower gross margin sales from the acquired Vast Auto business and a greater percentage of our total sales mix being generated from professional service provider customers, which carry a lower gross margin than DIY sales, partially offset by improved acquisition costs.\nSelling, General and Administrative Expenses:\nSelling, general and administrative expenses (“SG&A”) for the year ended December 31, 2024, increased 8% to $5.30 billion (or 31.7% of sales) from $4.92 billion (or 31.1% of sales) for the same period in 2023. The increase in total SG&A dollars for the year ended December 31, 2024, was the result of additional Team Members and vehicles to support our increased sales and store count, an additional charge to adjust self-insurance reserves for historical auto liability claims, SG&A associated with the Vast Auto operations, and one additional day due to Leap Day. The increase in SG&A as a percentage of sales for the year ended December 31, 2024, was principally due to the self-insurance reserve adjustment, depreciation costs for accelerated refreshment of store related capital expenditures, and information technology investments.\nAs a result of the impacts discussed above, operating income for the year ended December 31, 2024, increased 2% to $3.25 billion (or 19.5% of sales) from $3.19 billion (or 20.2% of sales) for the same period in 2023.\nOther Income and Expense:\nTotal other expense for the year ended December 31, 2024, increased 13% to $206 million (or 1.2% of sales), from $182 million (or 1.1% of sales) for the same period in 2023. The increase in total other expense for the year ended December 31, 2024, was the result of increased interest expense on higher average outstanding borrowings, as compared to a decrease in the same period in 2023. See Note 10 “Financing” to the Consolidated Financial Statements for further information concerning the Company’s borrowings. See Note 4 “Fair Value Measurements” to the Consolidated Financial Statements for further information concerning the Company’s trading securities.\nOur provision for income taxes for the year ended December 31, 2024, was flat at $658 million compared to the same period in 2023. Our effective tax rate for the year ended December 31, 2024, decreased to 21.6% from 21.9% for the same period in 2023. The decrease in our effective tax rate for the year ended December 31, 2024, was primarily the result of a greater benefit from renewable energy tax credits and higher excess tax benefits from share-based compensation. See Note 18 “Income Taxes” to the Consolidated Financial Statements for further information concerning the Company’s income taxes.\nAs a result of the impacts discussed above, net income for the year ended December 31, 2024, increased to $2.39 billion (or 14.3% of sales), from $2.35 billion (or 14.8% of sales) for the same period in 2023.\nOur diluted earnings per common share for the year ended December 31, 2024, increased 6% to $40.66 on 59 million shares from $38.47 on 61 million shares for the same period in 2023.\n2023 Compared to 2022\n\nOVERVIEW\nWe are a specialty retailer of automotive aftermarket parts, tools, supplies, equipment, and accessories in the United States, Puerto Rico, Mexico, and Canada. We are one of the largest U.S. automotive aftermarket specialty retailers, selling our products to both DIY customers and professional service providers – our “dual market strategy.” Our goal is to achieve growth in sales and profitability by capitalizing on our competitive advantages, such as our dual market strategy, superior customer service provided by well-trained and technically proficient Team Members, and strategic distribution and hub store network that provides same day and over-night inventory access for our stores to offer a broad selection of product offerings. The successful execution of our growth strategy includes aggressively opening new stores, growing sales in existing stores, continually enhancing merchandising and store layouts, and implementing our Omnichannel initiatives. As of December 31, 2024, we operated 6,265 stores in 48 U.S. states and Puerto Rico, 87 stores in Mexico, and 26 stores in Canada.\nThe extensive product line offered in our stores consists of new and remanufactured automotive hard parts, maintenance items, accessories, a complete line of auto body paint and related materials, automotive tools, and professional service provider service equipment. Our extensive product line includes an assortment of products that are differentiated by quality and price for most of the product lines we offer. For many of our product offerings, this quality differentiation reflects “good,” “better,” and “best” alternatives. Our sales and total gross profit dollars are, generally, highest for the “best” quality category of products. Consumers’ willingness to select products at a higher point on the value spectrum is a driver of enhanced sales and profitability in our industry. We have ongoing initiatives focused on marketing and training to educate customers on the advantages of ongoing vehicle maintenance, as well as “purchasing up” on the value spectrum.\nOur stores also offer enhanced services and programs to our customers, including used oil, oil filter, and battery recycling; battery, wiper, and bulb replacement; battery diagnostic testing; electrical and module testing; check engine light code extraction; loaner tool program; drum and rotor resurfacing; custom hydraulic hoses; professional paint shop mixing and related materials; and machine shops.\nOur business is influenced by a number of general macroeconomic factors that impact both our industry and consumers, including, but not limited to, inflation, including rising consumer staples; fuel and energy costs; unemployment trends; interest rates; and other economic factors. Future changes, such as continued broad-based inflation and rapid fuel cost increases that exceed wage growth, may negatively impact our consumers’ level of disposable income, and we cannot predict the degree these changes, or other future changes, may have on our business or industry.\nWe believe the key drivers of demand over the long-term for the products sold within the automotive aftermarket include the number of U.S. miles driven, number of U.S. registered vehicles, annual rate of light vehicle sales, and average vehicle age.\nNumber of Miles Driven:\nThe number of total miles driven in the U.S. influences the demand for repair and maintenance products sold within the automotive aftermarket. In total, vehicles in the U.S. are driven approximately three trillion miles per year, resulting in ongoing wear and tear and a corresponding continued demand for the repair and maintenance products necessary to keep these vehicles in operation. According to the U.S. Department of Transportation, the number of total miles driven in the U.S. increased 0.9% and 2.1% in 2022, and 2023, respectively, and year-to-date through November of 2024, miles driven increased 1.0%. Total miles driven can be impacted by macroeconomic factors, including rapid increases in fuel cost, but we are unable to predict the degree of impact these factors may have on miles driven in the future.\n\nCalculated as net cash provided by operating activities, less capital expenditures, excess tax benefit from share-based compensation payments, and investment in tax credit equity investments for the period. See page\nfor the reconciliation of the calculation of free cash flow.\nCash and cash equivalents balances held outside of the U.S. were $17.2 million and $3.3 million as of December 31, 2024 and 2023, respectively, which was generally utilized to support the liquidity needs of foreign operations in Mexico and Canada.\n2024 Compared to 2023\nOperating Activities:\nThe increase in net cash provided by operating activities in 2024 compared to 2023 was primarily due to an increase in operating income, decrease in net inventory, compared to an investment in net inventory in 2023, a decrease in accounts receivable balance, and an increase in accrued benefits, partially offset by the timing of payments for the purchase of transferrable federal renewable energy tax credits.\nInvesting Activities:\nThe increase in net cash used in investing activities in 2024 compared to 2023 was primarily the result of the acquisition of Vast Auto and an increase in capital expenditures. The increase in capital expenditures was primarily due to an increase in distribution enhancement and expansion projects, as well as an increase in the number of owned new store openings.\nWe opened 198 and 186 net, new stores in 2024 and 2023, respectively. We plan to open 200 to 210 net, new stores in 2025. The costs associated with the expected openings of owned store locations in 2025, including the cost of land acquisition, building construction, fixtures, vehicles, net inventory investment, and computer equipment, are estimated to average approximately $3.0 million to $3.3 million per store. However, such costs may be significantly lower where we lease, rather than purchase, the store site and higher where we build a Hub, as they require a larger inventory investment and are generally larger in size.\nFinancing Activities:\nThe increase in net cash used in financing activities in 2024 compared to 2023 was primarily attributable to decreased net borrowings in 2024, partially offset by a lower level of repurchases of our common stock in 2024.\n2023 Compared to 2022\n\nCRITICAL ACCOUNTING ESTIMATES\nThe preparation of our financial statements in accordance with GAAP requires the application of certain estimates and judgments by management. Management bases its assumptions, estimates, and adjustments on historical experience, current trends, and other factors believed to be relevant at the time the consolidated financial statements are prepared. Management believes that the following policies are critical due to the inherent uncertainty of these matters and the complex and subjective judgments required in establishing these estimates. Management continues to review these critical accounting estimates and assumptions to ensure that the consolidated financial statements are presented fairly in accordance with GAAP. However, actual results could differ from our assumptions and estimates and such differences could be material.\nSelf-Insurance Reserves:\nWe use a combination of insurance and self-insurance mechanisms to provide for potential liabilities from workers’ compensation, general liability, vehicle liability, property loss, and Team Member health care benefits. With the exception of certain Team Member health care benefit liabilities, employment related claims and litigation, certain commercial litigation, and certain regulatory matters, we obtain third-party insurance coverage to limit our exposure for any individual workers’ compensation, general liability, vehicle liability, or property loss claim.\nWhen estimating our self-insurance liabilities, we consider a number of factors, including historical claims experience and trend-lines, projected medical and legal inflation, growth patterns, and exposure forecasts. The assumptions made by management as they relate to each of these factors represent our judgment as to the most probable cumulative impact of each factor to our future obligations. Certain of the self-insurance liabilities are determined at an estimate of their net present value, using the U.S. treasury risk-free rate. Our calculation of self-insurance liabilities requires management to apply a significant amount of subjective judgment to estimate the ultimate cost to resolve reported claims and claims incurred but not yet reported as of the balance sheet date. The application of alternative assumptions could result in a different estimate of these liabilities. Management believes the assumptions developed and used to determine the estimate for our self-insurance reserve are reasonable. Actual claim activity or development may vary from our assumptions and estimates, which may result in material losses or gains.\nAs we obtain additional information that affects the assumptions and estimates we used to recognize liabilities for claims incurred in prior accounting periods, we adjust our self-insurance liabilities to reflect the revised estimates based on this additional information. These liabilities are recorded at our estimate of their net present value. These liabilities do not have scheduled maturities, but we can estimate the timing of future payments based upon historical patterns. We could apply alternative assumptions regarding the timing of payments that could result in materially different estimates of the net present value of the liabilities.\nOur self-insurance reserve estimate included on our Consolidated Balance Sheets increased $54 million from 2023 to 2024, which is primarily due to inflation in claim development costs, as well as our growing operations, increases in healthcare costs, the number of vehicles, and the number of hours worked, partially offset by having resolved and paid out claims throughout 2024. If the underlying assumptions in management’s estimate changed self-insurance reserves by 10% from our estimated reserves at December 31, 2024, the financial impact would have been approximately $27 million or 0.9% of pretax income for the year ended December 31, 2024. See Note 1 “Summary of Significant Accounting Policies” to the Consolidated Financial Statements for further information on our self-insurance reserves.\n\nItem 7. Management’s Discussion and Analysis of Financial Condition and Results of Operations\nIn Management’s Discussion and Analysis, we provide a historical and prospective narrative of our general financial condition, results of operations, liquidity, and certain other factors that may affect our future results, including\nan overview of the key drivers and other influences on the automotive aftermarket industry;\nour results of operations for the years ended December 31, 2024 and 2023;\nour liquidity and capital resources;\nour critical accounting estimates; and\nrecent accounting pronouncements that may affect our Company.\nThe review of Management’s Discussion and Analysis should be made in conjunction with our consolidated financial statements, related notes and other financial information, forward-looking statements, and other risk factors included elsewhere in this annual report.\n\nSize and Age of the Vehicle Fleet:\nThe total number of vehicles on the road and the average age of the vehicle population heavily influence the demand for products sold within the automotive aftermarket industry. As reported by the Auto Care Association, the total number of registered vehicles increased 14.2% from 2013 to 2023, bringing the number of light vehicles on the road to 284 million by the end of 2023. For the year ended December 31, 2024, the seasonally adjusted annual rate of light vehicle sales in the U.S. (“",
  "item2_clean": null
}