{
  "source_file": "oxy-20241231.htm",
  "form_type": "10-K",
  "item1_clean": null,
  "item7_clean": "ITEM 7. MANAGEMENT’S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS\nINDEX\nPAGE\nCurrent Business Outlook and\nMidstream and Marketing Segment\nSegment Results of Operations and\nItems Affecting Comparability\nConsolidated Results of Operations\nLiquidity and Capital Resources\nLawsuits, Claims, Commitments and Contingencies\nCritical Accounting Policies and Estimates\nSafe Harbor Discussion Regarding Outlook and Other Forward-Looking Data\nOXY\nMANAGEMENT’S DISCUSSION AND ANALYSIS\nCURRENT BUSINESS OUTLOOK AND STRATEGY\nGENERAL\nOccidental’s operations, financial condition, cash flows and levels of expenditures are highly dependent on oil prices and, to a lesser extent, NGL and natural gas prices, Midland-to-Gulf-Coast oil spreads, chemical product prices and inflationary pressures in the macro-economic environment. In 2024, compared to 2023, the average annual WTI price per barrel decreased to $75.72 from $77.64, and the average annual Brent price per barrel decreased to $79.79 from $82.25. It is expected that the price of oil will be volatile for the foreseeable future given the current geopolitical risks, impact of the evolving macro-economic environment on energy demand, future actions by OPEC and non-OPEC oil producing countries, geopolitical risks, and the U.S. Government's management of the U.S. Strategic Petroleum Reserve. Seasonality is not a primary driver of changes in Occidental's consolidated quarterly earnings.\nOccidental works to manage inflation impacts by capitalizing on operational efficiencies, locking in pricing on longer term contracts and working closely with vendors to secure the supply of critical materials. As of December 31, 2024, approximately 89% of Occidental's outstanding debt was fixed rate.\nSTRATEGY\nOccidental is focused on delivering a unique shareholder value proposition with its portfolio of oil and gas, chemicals and midstream and marketing assets as well as its ongoing development of carbon management and storage solutions and GHG emissions reduction efforts. Occidental conducts its operations with a priority on HSE, sustainability and social responsibility. In order to maximize shareholder returns, Occidental will:\n■ Maintain production base to preserve asset base integrity and longevity;\n■ Deliver a sustainable and growing dividend;\n■ Enhance its asset base and reserves with investments in its cash-generative oil and gas and chemical businesses;\n■ Advance technologies and decarbonization solutions to develop a sustainable low-carbon business; and\n■ Prioritize excess cash flow and the proceeds from asset divestitures for deleveraging until principal debt is below $15 billion.\nCAPITAL INVESTMENT\nIn 2024, Occidental invested $7.0 billion in high-return assets to generate long-term free cash flow throughout the commodity cycle. In addition, Occidental completed its $12.4 billion acquisition of CrownRock. In 2025, Occidental intends to complete the full integration of CrownRock assets, personnel and systems, as well as make progress towards the completion of asset divestitures announced in conjunction with the CrownRock Acquisition.\nDEBT\nAs of December 31, 2024, principal debt outstanding was $24.4 billion, of which $1.0 billion is due in in 2025, $4.1 billion in 2026, $1.5 billion in 2027, $0.9 billion in 2028, and $16.9 billion due in 2029 and thereafter.\nIn connection with the CrownRock Acquisition, Occidental issued $9.7 billion in new debt in July 2024 and assumed $1.2 billion of existing CrownRock debt in August 2024. Occidental's credit ratings were reaffirmed by credit agencies concurrent with issuance of new debt. In 2024, Occidental used proceeds from divestitures and cash on hand to repay $4.5 billion of debt, which included the satisfaction and discharge of the 5.000% senior notes due 2029 that were assumed with the CrownRock Acquisition. For information on Occidental's debt activity, see\nSHAREHOLDER RETURN PRIORITIES\nCapital is returned to shareholders through Occidental’s dividend and share repurchases. In 2024, Occidental declared dividends to common shareholders of $814 million, or $0.88 per share. As of December 31, 2024, $1.2 billion remained of Occidental’s $3.0 billion share repurchase program, which the Board authorized in February 2023. Following the CrownRock Acquisition, Occidental’s shareholder return priorities are to provide a sustainable and growing dividend and reduce the principal of outstanding debt below $15 billion, before resuming share repurchases.\nSUSTAINABILITY STRATEGY\nOccidental’s sustainability strategy is organized around four pillars: principles of governance, people, planet, and prosperity. Occidental integrates these sustainability pillars into our strategic planning and investment decision-making processes.\nOXY\nMANAGEMENT’S DISCUSSION AND ANALYSIS\nIn 2020, Occidental was the first U.S. oil and gas company to announce goals to achieve net-zero GHG emissions for its total emissions inventory including use of sold products. These goals include achieving net-zero GHG emissions (i) from its operations and energy use before 2040, with an ambition to do so before 2035, and (ii) from its total carbon inventory, including the use of its sold products, with an ambition to do so before 2050. In 2020, Occidental also set various interim targets, including 2025 carbon and methane intensity targets, and Occidental was the first U.S. oil and gas company to endorse the World Bank’s initiative for zero routine flaring by 2030. In 2022, the Board of Directors adopted Occidental’s updated HSE and Sustainability Principles, based on engagement with shareholders, employees and other stakeholders. The Principles reinforce the alignment among Occidental’s core values, goals and strategies, underpin its Operating Management System, and help to guide the workforce across its businesses. In 2023, Oxy was an original signatory to the Oil and Gas Decarbonization Charter, committed funding to the World Bank’s Global Flaring and Methane Reduction Partnership, and established a new, medium-term 2030 methane intensity target.\nOccidental seeks to meet its sustainability and environmental goals through its development and commercialization of technologies that lower both GHG emissions from industrial processes and existing atmospheric concentrations of CO\n. Occidental believes that carbon removal technologies, including DAC and CCUS, can, with incentives necessary for their development and deployment, provide essential CO\nreductions to assist the world’s transition to a less carbon-intensive economy. Through fiscal year 2023, Occidental reduced estimated methane emissions by approximately 65% from 2019 and 16% from 2022, along with a 20% reduction in CO\nequivalent emissions since 2019. The following actions helped Occidental advance its low-carbon business strategy in 2024:\nSTRATOS construction is progressing on schedule, with commissioning and start-up of operations expected in mid-2025;\nActively progressed its sequestration hub plans, including drilling stratigraphic data wells at multiple sequestration hub site locations, submitting 21 cumulative Class VI CO\ninjection well permit applications across its five proposed hub sites by year-end 2024, and signing award contracts in 2024 with the DOE for two of Occidental’s sequestration hubs that were awarded grants under the DOE’s Carbon Storage Assurance Facility Enterprise Initiative in 2023; and\nAchieved a global 80% reduction in routine flaring of gas in 2024 from its 2020 baseline through a rich gas injection project that recovers flared gas for injection for enhanced oil production and commissioning additional compression in Oman in 2024 while U.S. oil and gas operations sustained zero routine flaring.\nThe future costs associated with emissions reduction, carbon removal and CCUS to meet Occidental’s long-term net-zero GHG goals may be substantial and the execution of its plans and net-zero pathway depends on securing third-party capital investments. As reflected by the joint venture with BlackRock, Occidental is pursuing multiple avenues to fund these projects including project financing, long-term carbon removal or CCUS agreements, and identifying business opportunities with stakeholders in carbon-intensive industries.\nKEY PERFORMANCE INDICATORS\nOccidental seeks to meet its strategic goals by continually measuring its success against key performance indicators that drive total stockholder return. In addition to efficient capital allocation and deployment discussed below in the section titled “\nOil and Gas Segment - Business Strategy\nOccidental believes its most significant performance indicators are:\nOPERATIONAL\nTotal spend per barrel - In 2025, Occidental will continue to focus on controlling total costs from a per-barrel perspective. Total spend per barrel is the sum of capital spending, general and administrative expenses, other operating and non-operating expenses and oil and gas lease operating costs divided by global oil, NGL and natural gas sales volumes.\nDaily production - Occidental seeks to maximize field operability and minimize production down-time.\nFINANCIAL\nCROCE - CROCE is calculated as (i) the cash flows from operating activities, before changes in working capital, plus distributions from WES classified as investing cash flows, divided by (ii) the average of the opening and closing balances of total equity plus total debt.\nCredit rating - Improve financial leverage to a level well within investment grade credit metrics.\nSUSTAINABILITY AND ENVIRONMENTAL\nSpecific interim emissions reduction and emissions intensity targets to advance the goal of net-zero operational and energy use emissions before 2040, with an ambition to achieve before 2035.\nMilestones in specific carbon removal and CCUS projects that advance a net-zero total emissions inventory, including use of sold products, with an ambition to achieve before 2050.\nFacilitate deployment of carbon removal, CCUS and other solutions to advance total carbon impact past 2050.\nOXY\nMANAGEMENT’S DISCUSSION AND ANALYSIS\nOIL AND GAS SEGMENT\nBUSINESS STRATEGY\nOccidental’s oil and gas segment focuses on long-term value creation in the key performance indicators noted above of total spend per barrel, field operability, daily production, and leadership through our HSE and sustainability initiatives. In each core operating area, Occidental’s operations benefit from scale, technical expertise, decades of high-margin inventory, HSE leadership and commercial and governmental collaboration. These attributes allow Occidental to bring additional production quickly to market, extend the life of older fields at lower costs and provide low-cost returns-driven growth opportunities with advanced technology.\nOccidental is one of the largest U.S. producers of liquids, which includes oil and NGL, enabling it to maximize cash margins on a per barrel basis. The advantages that Occidental’s portfolio provides, coupled with its advanced subsurface characterization expertise and the proven ability to execute, position it for full-cycle success in the years ahead. The oil and gas segment maximizes efficiencies to deliver lower breakeven costs and generate excess free cash flow and also strives to achieve low development and operating costs to maximize full-cycle value of the assets.\nThe oil and gas segment implements Occidental’s strategy primarily by:\nOperating and developing areas where reserves are known to exist and optimizing capital intensity in core areas, primarily in the Permian Basin, DJ Basin, Gulf of America, Algeria, Oman, Qatar and the UAE;\nMaintaining a disciplined and prudent approach to capital expenditures with a focus on high-return, short and mid-cycle, cash-flow-generating opportunities and an emphasis on creating value and further enhancing Occidental’s existing positions;\nFocusing Occidental’s subsurface characterization and technical activities on both conventional and unconventional resources;\nUsing secondary and tertiary recovery techniques in mature fields; and\nFocusing on cost-reduction efficiencies and innovative technologies to reduce carbon emissions.\nIn 2024, oil and gas capital expenditures, including exploration, were approximately $5.3 billion and primarily focused on Occidental’s assets in the Permian Basin, DJ Basin, Gulf of America and Oman. In 2025, Occidental plans to spend $5.8 billion to $6.0 billion to develop its oil and gas assets.\nIn August 2024, Occidental acquired CrownRock for total consideration of $12.4 billion, consisting of $9.4 billion of cash consideration (inclusive of certain working capital and other customary purchase price adjustments), 29.6 million shares of common stock of Occidental, and the assumption of $1.2 billion of existing debt of CrownRock, adding to Occidental's oil and gas portfolio in the Permian Basin.\nOIL AND GAS PRICE ENVIRONMENT\nOil and gas prices are the major variables that drive the industry’s financial performance. The following table presents the average daily WTI and Brent prices for oil and NYMEX natural gas prices for 2024 and 2023:\n\nThe Permian Basin’s concentration of large conventional reservoirs, strong CO\nflooding performance and the expansive CO\ntransportation and processing infrastructure has resulted in decades of high-value enhanced oil production.\nOXY\nMANAGEMENT’S DISCUSSION AND ANALYSIS\nfloods and over 50 years of experience, Permian EOR is the industry leader in Permian Basin CO\nflooding, which can increase ultimate oil recovery by 10% to 25%. Technology improvements, such as the recent trend toward vertical expansion of the CO\nflooded interval into residual oil zone targets, continue to yield more recovery from existing projects. Significant opportunities also remain to gain additional recovery by expanding Occidental’s existing CO\nprojects into new portions of reservoirs that have only been waterflooded. Permian EOR has 1.4 million net acres with a large inventory of future CO\nprojects, which could be developed over the next 20 years or accelerated, depending on market conditions. Permian EOR produced from approximately 12,600 gross wells in 2024.\nRockies and Other Domestic\nIn 2024, Occidental produced 310 Mboe/d and spent development capital of approximately $0.8 billion in the Rockies and Other Domestic locations. Production in the DJ Basin is derived from approximately 3,700 wells primarily focused in the Niobrara and Codell formations. The DJ Basin, including the North DJ Basin, comprises approximately 0.6 million total net acres and provides competitive economics, low breakeven costs and free cash flow generation through Occidental’s contiguous acreage position and royalty uplift.\nOperations in the DJ Basin are subject to regulations that impose siting requirements, or “setback,” on certain oil and gas drilling locations based on the distance of a proposed well pad to occupied structures. Occidental has dedicated stakeholder relations team that conducts regulatory and community outreach with respect to its permit applications and operations in Colorado with a focus on building trust and fostering open communication with those who live and work near its operations.\nOccidental has established a steady cadence of permit approvals from various agencies, local governments and the ECMC through robust community outreach, protective site selection, thoughtful facility design and planning, and best-in-class measures to mitigate potential impacts from operations. In 2024, Occidental submitted Oil and Gas Development Plans comprising approximately 200 wells to the ECMC. As of December 31, 2024, Occidental has permits for over 90% of the 2025 drilling schedule and over 70% of the 2026 drilling schedule with the remaining percentage of activity largely submitted and pending approval. Occidental continues to gain efficiencies in the permitting process and will continue to look for additional opportunities to do so in the future.\nOccidental has interests in ap",
  "item2_clean": null
}