{
  "source_file": "payc-20241231.htm",
  "form_type": "10-K",
  "item1_clean": null,
  "item7_clean": "Based on our total revenues, we have grown at a 22% compound annual growth rate from January 1, 2021 through December 31, 2024. Growing our business has resulted in, and will continue to result in, substantial investments in sales professionals, operating expenses, system development and programming costs and general and administrative expenses, which have increased and will continue to increase our expenses. Historically, our revenue growth and geographic expansion have driven increases in our employee headcount, which in turn precipitated increases in (i) salaries and benefits, (ii) stock-based compensation expense and (iii) facility costs related to the expansion of our corporate headquarters and operations facilities and additional sales office leases. Moving forward, this historical trend may be impacted by our ability to continue to leverage automation and other internal efficiencies. Furthermore, execution of our international expansion strategy requires considerable investment. As a result of the factors described above, we have experienced and expect to continue to experience pressure on our margins as we hire to support growth.\n\nOur target client size is organizations with 50 to 10,000 or more employees. While we continue to serve a diversified client base ranging from small businesses to organizations with many thousands of employees, the average size of our clients has grown significantly as we have organically grown our operations and increased the number of applications we offer. We believe larger employers, such as organizations with greater than 1,000 employees, represent a substantial opportunity to increase our revenues per client, with limited incremental cost to us. With the launch of our Global HCM solution and expansion of payroll services into certain international markets, we expect that our ability to serve organizations with international employees makes our solution more attractive to larger companies, many of which have a global presence. Because we charge our clients on a per employee basis for certain services we provide, any increase or decrease in the number of employees of our clients will have a positive or negative impact, respectively, on our results of operations. As a result, the performance of certain of our offerings is sensitive to changes in the labor market. In addition, a multitude of macroeconomic pressures, such as inflation and changes in interest rates, impact our clients’ hiring practices to varying degrees and, in turn, impact our revenues.\n\nAdministrative expenses consist of sales and marketing expenses, research and development expenses, general and administrative expenses and depreciation and amortization expenses. Sales and marketing expenses consist primarily of employee-related expenses for our direct sales and marketing staff (such as the amortization of commissions and bonuses and non-cash stock-based compensation expenses), marketing expenses and other related costs. Based on positive results from our advertising campaigns, we plan to continue to invest in our marketing program and may adjust spending levels in future periods as we see opportunities for favorable returns on our investments. Research and development expenses consist primarily of employee-related expenses (including non-cash stock-based compensation expenses) for our development staff, net of capitalized software costs for internally developed software. We expect to grow our research and development efforts as we continue to broaden our payroll and HR solution offerings and extend our technological solutions by investing in the development of new applications and enhancements for existing applications. General and administrative expenses consist of employee-related expenses for finance and accounting, legal, human resources and management information systems personnel (including non-cash stock-based compensation expenses), legal costs, professional fees and other corporate expenses. Depreciation and amortization expenses consist of (i) the amount of depreciation and amortization of property and equipment allocated to administrative expenses (based upon an estimate of assets used to support our selling, general and administrative functions) and (ii) amortization of intangible assets.\n\nAs we continue the ongoing development of our platform and product offerings, we generally expect research and development expenses (exclusive of stock-based compensation) to continue to increase, particularly as we hire more personnel to support our growth. While we expect this trend to continue on an absolute dollar basis and as a percentage of total revenues, we also anticipate the rate of increase to decline over time as we leverage our growth and realize additional economies of scale. As is customary for our business, we also expect fluctuations in research and development expense as a percentage of revenue on a quarter-to-quarter basis due to seasonal revenue trends, the introduction of new products, the amount and timing of research and development costs that may be capitalized and the timing of onboarding new hires and restricted stock vesting events.\n\nOur consolidated financial statements and accompanying notes have been prepared in accordance with U.S. GAAP. The preparation of these consolidated financial statements requires us to make estimates, judgments and assumptions that affect the reported amounts of assets, liabilities, revenues, costs and expenses, and related disclosures. Estimates made in accordance with U.S. GAAP that involve a significant level of estimation uncertainty and have had or are reasonably likely to have a material impact on our financial condition are described below. On an ongoing basis, we evaluate our estimates and assumptions to ensure that management believes them to be reasonable under the then-current facts and circumstances. Actual amounts and results may materially differ from these estimates made by management under different assumptions and conditions.\n\nWe recognize an asset for the incremental costs of obtaining a contract with a client if we expect the amortization period to be longer than one year. We also recognize an asset for the costs to fulfill a contract with a client if such costs are specifically identifiable, generate or enhance resources used to satisfy future performance obligations, and are expected to be recovered. We have determined that substantially all costs related to implementation activities are administrative in nature and also meet the capitalization criteria under Accounting Standards Codification 340-40, “Other Assets and Deferred Costs”. These capitalized costs to fulfill principally relate to upfront direct costs that are expected to be recovered through margin and that enhance our ability to satisfy future performance obligations. The assets related to both costs to obtain, and costs to fulfill, contracts with clients are accounted for utilizing a portfolio approach and are capitalized and amortized ratably over the expected period of benefit, which we have determined to be the estimated life of the client relationship of 10 years primarily because we incur no new costs to obtain, or costs to fulfill, a contract upon renewal. A change in our client life estimate could have a material impact on the timing and amounts recognized as amortization expense.\n\nmade to our clients’ employees and applicable taxing authorities on their behalf, a $163.8 million decrease in repurchases of common stock, a $29.0 million decrease in payments on long-term debt, and a $0.7 million decrease in payment of debt issuance costs. The increase in cash provided by financing activities was partially offset by a $20.0 million increase in dividends paid and a $7.8 million increase in withholding taxes paid related to net share settlements.\n\nRecurring revenues include revenues relating to the annual processing of payroll tax filing forms and ACA form filing requirements and revenues from processing unscheduled payroll runs (such as bonuses) for our clients. These payroll forms are typically processed in the first quarter of the year, and many of our clients are subject to ACA form filing requirements in the first quarter, which positively impacts first quarter revenues and margins. We anticipate our revenues will continue to exhibit this seasonal pattern related to ACA form filings for so long as the ACA (or replacement legislation) includes employer reporting requirements. In addition, our recurring revenues during the fourth quarter are positively impacted by unscheduled payroll runs for our clients that occur before the end of the year. Nonetheless, we expect the magnitude of these seasonal fluctuations in our revenues to decrease to the extent clients utilize more of our non-payroll applications.\n\nDuring the year ended December 31, 2024, sales and marketing expenses increased from the prior year by $16.8 million due to a $36.4 million increase in employee-related expenses, which was partially offset by a $19.6 million decrease in marketing and advertising expense.\n\nWe are a leading provider of a comprehensive, cloud-based human capital management solution delivered as Software-as-a-Service. We provide functionality and data analytics that businesses need to manage the complete employment lifecycle, from recruitment to retirement. Our solution requires virtually no customization and is based on a core system of record maintained in a single database for all human capital management (“HCM”) functions, including payroll, talent acquisition, talent management, human resources (“HR”) management and time and labor management applications. Our user-friendly software allows for easy adoption of our solution by employees, enabling self-management of their HCM activities in the cloud, which reduces the administrative burden on employers and increases employee productivity.\n\nCost of revenues consists of expenses related to hosting and supporting our applications, hardware costs, systems support and technology and depreciation and amortization. These costs include employee-related expenses (including non-cash stock-based compensation expenses) and other expenses related to client support, bank charges for processing ACH transactions, certain implementation expenses, delivery charges and paper costs. They also include our cost for time clocks sold and ongoing technology and support costs related to our systems. The amount of depreciation and amortization of property and equipment allocated to cost of revenues is determined based upon an estimate of assets used to support our operations.\n\nThe increase in recurring and other revenues for the year ended December 31, 2024 from the year ended December 31, 2023 was the result of the addition of new clients, increased revenue from sales of additional applications and services to existing clients, additions and increased usage of existing products and services, and the realization of pricing strategies. Client attrition, particularly among smaller clients, partially offset the favorable impact of these revenue drivers. Client-driven acceleration of payroll processing due to the public holiday on January 1, 2025 contributed to the increase in recurring and other revenue recognized for the year ended December 31, 2024, as compared to the prior year.\n\nThe assets related to both costs to obtain, and costs to fulfill, contracts with customers are presented as deferred contract costs in the accompanying consolidated balance sheets. Amortization expense related to costs to obtain and costs to fulfill a contract is included in sales and marketing expenses and general and administrative expenses in the accompanying consolidated statements of comprehensive income. We regularly review our assets recognized from the costs to obtain and costs to fulfill client contracts for potential impairment and did not recognize an impairment loss during the years ended December 31, 2024 or December 31, 2023.\n\nWe completed an expansion of our corporate headquarters, which was placed into service in the second quarter of 2024. As our business grows, we expect our capital expenditures related to research and development and other strategic expansion activities to increase. We anticipate that our capital expenditures in 2025, comprised of purchases of property and equipment and intangible assets, will be generally consistent with the prior year on a total dollar basis. Depending on certain growth opportunities, we may choose to accelerate investments in sales and marketing, acquisitions, technology and services. Actual future capital requirements will depend on many factors, including our future revenues, cash from operating activities and the level of expenditures in all areas of our business. In addition, we purchased the naming rights to the downtown Oklahoma City arena that is home to the Oklahoma City Thunder National Basketball Association franchise. Under the terms of the naming rights agreement, we committed to make payments escalating annually from $4.0 million in 2021 to $6.1 million in 2035. The payments are due in the fourth quarter of each year. Upon the conclusion of the initial term, the agreement may be extended upon the mutual agreement of both parties for an additional five-year period.\n\nRecurring revenues are derived primarily from our payroll, talent acquisition, talent management, HR management and time and labor management applications, fees charged for form ﬁlings and delivery of client payroll checks and reports, and revenues associated with background checks and income and employment verification services. Payroll includes Beti, Payroll and Payroll Tax Management, Vault, Everyday, Paycom Pay, Client Action Center, Expense Management, Garnishment Administration and GL Concierge applications. Talent acquisition includes our Applicant Tracking, Enhanced Background Checks, Onboarding, E-Verify and Tax Credits applications. Talent management includes our Employee Self-Service, Compensation Budgeting, Performance Management, Position Management and Paycom Learning applications. HR management includes our Manager on-the-Go, Direct Data Exchange, Ask Here, Documents and Checklists, Government and Compliance, Beneﬁts Administration, COBRA Administration, Personnel Action Forms and Performance Discussion Forms, Paycom Surveys, Enhanced ACA and Clue applications. Time and labor management includes Time and Attendance, Scheduling, Time-Off Requests featuring GONE, and Labor Allocation applications. In addition, with Global HCM, a number of our HCM applications and tools are available in 15 languages and dialects and are accessible to users in more than 190 countries.\n\nThe following table sets forth selected consolidated statements of income data and such data as a percentage of total revenues for each of the periods indicated, as well as year-over-year changes with respect to each line item. Refer to “Item 7. Management’s Discussion and Analysis of Financial Condition and Results of Operations” in the\n, for a discussion of results for the year ended December 31, 2022, including a discussion of the changes in our results of operations for the year ended December 31, 2023 compared to the year ended December 31, 2022.\n\nDuring the year ended December 31, 2024, operating expenses increased from the prior year by $43.7 million, primarily due to a $29.2 million increase in employee-related expenses, an $8.3 million increase in banking related fees, and a $6.1 million increase in shipping and supplies fees. Depreciation and amortization expense increased $14.6 million primarily due to the development of additional technology, purchases of other related fixed assets, and the impact of our corporate headquarters expansion that was not in service in the prior year.\n\nThe decrease in other income (expense), net for the year ended December 31, 2024, as compared to the prior year, was primarily attributable to a decrease in interest earned o",
  "item2_clean": null
}