{
  "source_file": "pcar-20250930.htm",
  "form_type": "10-Q",
  "item1_clean": null,
  "item7_clean": null,
  "item2_clean": "A contract modification that improves the past due status generally reduces the probability of default. The effect of modifications is included in the Company’s historical loss information used to determine the allowance for credit losses. Modifications of accounts in prior quarters that were more than 30 days past due at the time of modification are included in past dues if they were not performing under the modified terms at September 30, 2025, December 31, 2024 and September 30, 2024. For certain modifications to customers experiencing financial difficulties that are at-risk at September 30, 2025, December 31, 2024, and September 30, 2024, the allowance for credit losses is based on the value of the underlying collateral or a discounted cash flow analysis.\n\nITEM 2. MANAGEMENT'S DISCUSSION AND ANALYSIS OF\nFINANCIAL CONDITION AND RESULTS OF OPERATIONS\nOVERVIEW:\nPACCAR is a global technology company whose Truck segment includes the design and manufacture of high-quality light-, medium- and heavy-duty commercial trucks. In the U.S. and Canada, trucks are sold under the Kenworth and Peterbilt nameplates, in Europe, under the DAF nameplate and in Mexico, Australia and South America, under the Kenworth and DAF nameplates. The Parts segment includes the distribution of aftermarket parts for trucks and related commercial vehicles. The Company’s Financial Services segment derives its earnings primarily from financing or leasing PACCAR products in North America, Europe, Australia and South America. The Company’s Other business included the manufacturing and marketing of industrial winches through October 31, 2024, when PACCAR sold its industrial winch business.\nThird Quarter Financial Highlights:\nWorldwide net sales and revenues were $6.67 billion in 2025 compared to $8.24 billion in 2024, primarily due to lower truck revenues, partially offset by higher parts and financial services revenues.\nTruck sales were $4.38 billion in 2025 compared to $6.03 billion in 2024, due to lower truck deliveries, primarily in the U.S. and Canada and Mexico.\nParts sales were $1.72 billion in 2025 compared to $1.66 billion in 2024, reflecting higher sales in the U.S. and Canada and Europe.\nFinancial Services revenues were $565.3 million in 2025 compared to $536.1 million in 2024, primarily due to higher interest income driven by retail portfolio growth and higher portfolio yields.\nNet income was $590.0 million ($1.12 per diluted share) in 2025 compared to $972.1 million ($1.85 per diluted share) in 2024.\nCapital investments were $156.0 million in 2025 compared to $183.8 million in 2024.\nResearch and development (R&D) expenses were $111.0 million in 2025 compared to $115.0 million in 2024.\nFirst Nine Months Financial Highlights:\nWorldwide net sales and revenues were $21.62 billion in 2025 compared to $25.76 billion in 2024, primarily due to lower truck revenues, partially offset by higher parts and financial services revenues.\nTruck sales were $14.85 billion in 2025, compared to $19.15 billion in 2024, due to lower truck deliveries in all major markets.\nParts sales were $5.14 billion in 2025 compared to $5.00 billion in 2024, reflecting higher sales in the U.S. and Canada.\nFinancial Services revenues were $1.64 billion in 2025 compared to $1.56 billion in 2024,\n\nprimarily due to higher interest income driven by retail portfolio growth and higher portfolio yields.\nNet income was $1.82 billion ($3.45 per diluted share) in 2025 compared to $3.29 billion ($6.25 per diluted share) in 2024. In 2025, adjusted net income (non-GAAP), excluding a $264.5 million after-tax charge related to civil litigation in Europe was $2.08 billion ($3.95 per diluted share). See Reconciliation of GAAP to Non-GAAP Financial Measures on page\nCapital investments were $549.0 million in 2025 compared to $567.7 million in 2024.\nResearch and development (R&D) expenses were $339.3 million in 2025 compared to $337.6 million in 2024.\nPACCAR is finalizing construction of a new $92 million, 46,000 square-foot chassis frame painting facility which will increase capacity with robotic paint capabilities in Chillicothe, Ohio, to be opened in early 2026. PACCAR is also finalizing construction of a new $35 million, 50,000 square-foot engine remanufacturing facility in Columbus, Mississippi, to be opened in 2026. PACCAR will open a new 180,000 square-foot Parts Distribution Center (PDC) in Calgary, Canada, in 2026, to expedite parts delivery to dealers and customers in the region. In the third quarter 2025, Kenworth launched the T880S high horsepower vocational truck for heavy-haul, logging, and other high horsepower applications, featuring a set-forward front axle configuration to optimize weight distribution and bridge law compliance.\n\nprimarily reflecting higher tariff costs in the U.S. and higher regulatory and other truck content, partially offset by a higher mix of fleet trucks and lower product support cost.\nFactory overhead and other indirect costs decreased $58.1 million, primarily due to lower labor costs, repair and maintenance costs and factory supplies from lower truck build rates.\nExtended warranties, operating leases and other increased revenues by $8.2 million, primarily due to higher volume of extended warranty and R&M contracts. The increase in extended warranty, operating leases and other costs of $24.1 million reflects higher costs from extended warranty and R&M contracts and higher used truck costs.\nThe currency translation effect on sales and cost of sales primarily reflects an increase in the value of the euro and the Brazilian real relative to the U.S. dollar, partially offset by the decline in the value of the Australian dollar and Canadian dollar relative to the U.S. dollar.\nTruck gross margin was 5.8% in the third quarter of 2025 compared to 13.0% in the same period of 2024 due to the factors noted above.\nThe major factors for the Truck segment changes in net sales and revenues, cost of sales and revenues and gross margin between the nine months ended September 30, 2025 and 2024 are as follows:\n\nAftermarket parts sales volume decreased by $83.8 million and related cost of sales decreased by $43.3 million. The decrease in parts sales and costs reflects lower sales volume in most markets, primarily Mexico, Europe and Brasil.\nAverage aftermarket parts sales prices increased sales by $205.6 million, primarily due to price realization in the U.S. and Canada as well as tariff cost increases in the U.S.\nAverage aftermarket parts direct costs increased $144.3 million due to higher material costs and higher tariff costs, primarily in the U.S.\nWarehouse and other indirect costs increased $34.1 million, primarily due to higher indirect costs, including depreciation expense.\nThe currency translation effect on sales reflects an increase in the value of euro relative to the U.S. dollar, partially offset by a decrease in the value of the Brazilian real, Australian dollar and Canadian dollar relative to the U.S. dollar.\nParts gross margins in the first nine months of 2025 decreased to 30.0% from 31.0% in the first nine months of 2024 due to the factors noted above.\nParts SG&A expense increased in the third quarter of 2025 to $66.5 million from $62.5 million in the same period of 2024. For the first nine months, Parts SG&A increased to $192.0 million in 2025 from $186.4 million in the same period of 2024. The increase in both periods was primarily due to higher salaries and related expenses.\nAs a percentage of sales, Parts SG&A was 3.9% for the third quarter of 2025 and 3.8% for the same period of 2024, and 3.7% for the first nine months of both 2025 and 2024.\n\nThe increase in charge-offs in the U.S. and Canada reflected a soft truckload market and included several large fleet customers, which were provisioned for previously. The higher charge-offs in both periods also reflected higher average loss severity in all markets, primarily due to normalizing used truck market values when compared to previous periods.\nThe Company modifies loans and finance leases as a normal part of its Financial Services operations. The Company may modify loans and finance leases for commercial reasons or for credit reasons. Modifications for commercial reasons are changes to contract terms for customers that are not considered to be in financial difficulty. Insignificant delays are modifications extending terms up to three months for customers experiencing some short-term financial stress, but not considered to be in financial difficulty. Modifications for credit reasons are changes to contract terms for customers considered to be in financial difficulty. The Company’s modifications typically result in granting more time to pay the contractual amounts owed and charging a fee and interest for the term of the modification. When considering whether to modify customer accounts for credit reasons, the Company evaluates the creditworthiness of the customers and modifies those accounts that the Company considers likely to perform under the modified terms.\n\nCredit Lines and Other\nThe Company has line of credit arrangements of $5.69 billion, of which $5.26 billion were unused at September 30, 2025. Included in these arrangements are $4.00 billion of committed bank facilities, of which $1.50 billion expires in June 2026, $1.25 billion expires in June 2028 and $1.25 billion expires in June 2030. The Company intends to extend or replace these credit facilities on or before expiration to maintain facilities of similar amounts and duration. These credit facilities are maintained primarily to provide backup liquidity for commercial paper borrowings and maturing medium-term notes. There were no borrowings under the committed bank facilities for the nine months ended September 30, 2025.\nOn December 4, 2018, PACCAR’s Board of Directors approved the repurchase of up to $500.0 million of the Company’s outstanding common stock. As of September 30, 2025, the Company has repurchased $128.4 million of shares under thi"
}