{
  "source_file": "pcg-20241231.htm",
  "form_type": "10-K",
  "item1_clean": "The penalties for violation of these laws and requirements can be severe and may include significant fines, damages, and criminal or civil sanctions. These laws and requirements also may require the Utility, under certain circumstances, to interrupt or curtail operations. See Item 1A. Risk Factors. Generally, the Utility recovers most of the costs of complying with environmental laws and regulations through the Utility’s rates, subject to reasonableness review. Environmental costs associated with the clean-up of most sites that contain hazardous substances are subject to a ratemaking mechanism described in Note 15 of the Notes to the Consolidated Financial Statements in Item 8.\nHazardous Substance Compliance and Remediation\nThe Utility’s facilities are subject to various regulations adopted by the EPA, including the Resource Conservation and Recovery Act and the Comprehensive Environmental Response, Compensation and Liability Act of 1980, as amended. The Utility is also subject to the regulations adopted by other federal agencies responsible for implementing federal environmental laws. The Utility also must comply with environmental laws and regulations adopted by the State of California and various state and local agencies. These federal and state laws impose strict liability for the release of a hazardous substance on the (1) owner or operator of the site where the release occurred, (2) on companies that disposed of, or arranged for the disposal of, the hazardous substances, and (3) in some cases, their corporate successors. Under the Comprehensive Environmental Response, Compensation and Liability Act, these persons (known as “potentially responsible parties”) may be jointly and severally liable for the costs of cleaning up the hazardous substances, monitoring and paying for the harm caused to natural resources, and paying for the costs of health studies.\nThe Utility has a comprehensive program in place to comply with these federal, state, and local laws and regulations. Under federal and California laws, the Utility may be responsible for remediation of hazardous substances even if it did not deposit those substances on the site. The Utility’s remediation activities are overseen by the DTSC, several California regional water quality control boards, and various other federal, state, and local agencies. The Utility has incurred significant environmental remediation liabilities associated with former MGP sites, power plant sites, gas gathering sites, sites where natural gas compressor stations are located, and sites used by the Utility for the storage, recycling, or disposal of potentially hazardous substances. Groundwater at the Utility’s Hinkley and Topock natural gas compressor stations contains hexavalent chromium as a result of the Utility’s past operating practices. The Utility is responsible for remediating this groundwater contamination and for abating the effects of the contamination on the environment.\nFor more information about environmental remediation liabilities, see Note 15 of the Notes to the Consolidated Financial Statements in Item 8.\nAir Quality and the Clean Air Act\nThe Utility’s electric generation plants, natural gas pipeline operations, vehicle fleet, and fuel storage tanks are subject to numerous air pollution control laws, including the federal Clean Air Act, as well as state and local statutes. These laws and regulations cover, among other pollutants, those contributing to the formation of ground-level ozone, carbon dioxide (CO\n), sulfur dioxide (SO\n), nitrogen oxides (NO\n), particulate matter, and other emissions.\nAt the federal level, the EPA is charged with implementation and enforcement of the Clean Air Act, which it uses to address GHG emissions.\nFor information regarding regulation of greenhouse gas emissions, see “Sustainability and Resiliency” below.\nNuclear Fuel Disposal\nNuclear power plant operations produce gaseous, liquid, and solid radioactive wastes, which are covered by federal regulation. High-level radioactive wastes primarily include used nuclear fuel. Low-level waste consists primarily of demineralizer resins, paper, protective clothing, rags, tools, and equipment contaminated through use.\nUnder the Nuclear Waste Policy Act of 1982, the DOE and electric utilities with commercial nuclear power plants were authorized to enter into contracts under which the DOE would be required to dispose of the utilities’ spent nuclear fuel and high-level radioactive waste by January 1998, in exchange for fees paid by the utilities’ customers. The DOE has been unable to meet its contractual obligation with the Utility to dispose of nuclear waste from the Utility’s two nuclear generating units at DCPP and the retired nuclear facility at Humboldt Bay. As a result, the Utility constructed interim dry cask storage facilities to store its spent fuel onsite at DCPP and at Humboldt Bay until the DOE fulfills its contractual obligation to take possession of the spent fuel. The Utility and other nuclear power plant owners sued the DOE to recover the costs that they incurred to construct interim storage facilities for spent nuclear fuel.\nRatemaking Mechanisms\nThe Utility operates under a “cost-of-service” ratemaking model, which means that rates for electric and natural gas utility services are generally set at levels that are intended to allow the Utility to recover its costs of providing service and to earn a return on invested capital. To set rates, the CPUC and the FERC conduct proceedings to determine the amount that the Utility will be authorized to collect from its customers (“revenue requirements”). In the GRC proceedings, the CPUC also generally approves the level of spending on a forecasted basis. Revenue authorized by the CPUC through GRC proceedings is intended to provide the Utility a reasonable opportunity to recover its costs and earn a return on its investments in generation and distribution assets and general plant (also referred to as “rate base”). The Utility’s revenue requirements consist primarily of a base amount set to enable the Utility to recover its reasonable operating expenses (e.g., maintenance, administration, and general expenses) and capital costs (e.g., depreciation, and financing expenses).\nThe Utility’s costs of equity and long-term debt are generally approved in the CPUC’s cost of capital proceedings.\nAs a result, the Utility’s CPUC-jurisdictional revenue requirement is the sum of the following:\nthe product of the Utility’s rate of return (i.e., the cost of capital for long-term debt and equity) and its rate base.\nIn addition to the Utility’s revenue requirement, the CPUC authorizes the Utility to collect revenues to recover costs that the Utility is allowed to “pass through” to customers, including its costs to procure electricity and natural gas for customers and to administer public purpose and customer programs.\nFERC revenue requirements are set through a FERC-approved formula rate. The Utility’s rate of return on electric transmission assets is determined in the FERC TO proceedings.\nCustomer rates are determined by dividing the revenues that the Utility is authorized to collect from customers by the amount of power that the Utility is forecasted to sell. Increases in load spread the Utility’s revenue requirement over a larger usage base, which reduces customer rates, but also increases fuel costs, which are passed through to customers.\nOther than certain gas transmission and storage revenues, the Utility’s base revenues are “decoupled” from its sales volume through regulatory balancing accounts, or revenue adjustment mechanisms, that are designed to allow the Utility to collect its authorized base revenue requirements regardless of sales volume. As a result, the Utility’s base revenues are not impacted by fluctuations in sales resulting from, for example, weather or economic conditions. The Utility’s earnings primarily depend on its ability to manage its base operating and capital costs within its authorized base revenue requirements.\nDue to the seasonal nature of the Utility’s business and rate design, customer electric bills are generally higher during summer months (May to October) because of higher demand, driven by air conditioning loads. Customer bills related to gas service are generally higher during winter months (November to March) because of higher demand due to heating.\nFrom time to time, the CPUC may use incentive ratemaking mechanisms that provide the Utility an opportunity to earn additional revenues. For example, the Utility has earned incentives for the successful implementation of energy efficiency programs.\nSee “Regulatory Matters” in Item 7. MD&A for more information on specific CPUC proceedings.\nThe GRC is the primary proceeding in which the CPUC determines the amount of base revenue requirements that the Utility is authorized to collect from customers to recover the Utility’s anticipated costs related to its electric distribution, natural gas distribution, and Utility-owned electric generation operations and return on rate base. The CPUC conducts a GRC every four years that includes the Utility’s costs of its gas transmission and storage facilities. The CPUC approves the annual revenue requirements for the first year (or “test year”) of the GRC period and typically authorizes the Utility to receive annual increases in revenue requirements for the subsequent years of the GRC period (known as “attrition years”). Attrition year rate adjustments are generally authorized for cost increases related to invested capital and inflation. Parties to the Utility’s GRC include the Public Advocates Office of the CPUC (formerly known as Office of Ratepayer Advocates or ORA) and TURN, which generally represent the interests of residential customers, as well as numerous intervenors that represent other business, community, customer, environmental, and union interests. For more information about the Utility’s GRC, see “Regulatory Matters - 2023 General Rate Case” in Item 7. MD&A.\nCost of Capital Proceedings\nThe CPUC periodically conducts a cost of capital proceeding to authorize the Utility’s ratemaking capital structure (i.e., the relative weightings of common stock, preferred equity, and debt for ratemaking) and rates of return for its electric generation, electric and natural gas distribution, and natural gas transmission and storage rate base. The rate of return, or cost of capital, is the weighted average cost of debt, preferred equity, and common stock a utility has issued to finance its utility capital investments. The CPUC’s cost of capital proceedings generally take place in a consolidated proceeding with California’s other large investor-owned electric and gas utilities. For more information about the cost of capital proceedings, see “Regulatory Matters - Cost of Capital Proceedings” in Item 7. MD&A.\nElectricity Transmission Owner Rate Cases\nThe FERC determines the amount of authorized revenue requirements, including the rate of return on electric transmission assets, that the Utility may collect through rates in TO rate cases. In its TO rate cases, the Utility uses a formula rate methodology, which includes an authorized revenue requirement and rate base for a given year but also provides for an annual update of the previous year’s revenue requirement and rates in accordance with the terms of the FERC-approved formula. Under the formula rate mechanism, transmission revenue requirements are updated to the actual cost of service annually as part of the true-up process. Differences between amounts collected and determined under the formula rate are either collected from or refunded to customers. The FERC typically authorizes the Utility to charge new rates based on the requested revenue requirement, subject to refund, before the FERC has issued a final decision. The Utility bills and records revenue based on the amounts requested in its rate case filing and records a reserve for its estimate of the am",
  "item7_clean": "In connection with the WGSC application, the Utility also requested interim rate relief of $583 million. The remaining $105 million would be recovered after the CPUC issues a final decision. On March 7, 2024, the CPUC approved a final decision authorizing the Utility to recover $516 million in interim rates to be recovered over at least 12 months starting April 1, 2024.\nThe administrative law judge has adopted a schedule that would result in a proposed decision on the wildfire mitigation costs in the first half of 2025 and a final decision on the gas safety and electric modernization costs by June 2025.\nForward-Looking Rate Cases\nThe Utility routinely participates in forward-looking rate case applications before the CPUC and the FERC. Those applications include GRCs, where the revenue required for general operations (“base revenue”) of the Utility is assessed and reset. In addition, the Utility is periodically involved in “cost of capital” proceedings to adjust its regulated return on rate base. The Utility’s future earnings will depend on the revenue requirements authorized in such rate cases. The Utility also expects to file its SB 884 cost application with the CPUC after the OEIS approves guidelines. See “SB 884 10-Year Distribution Undergrounding Program” below.\nDecisions in GRC proceedings have historically been expected prior to the commencement of the period to which the rates would apply. In recent decades, decisions in GRC proceedings have been delayed. Delayed decisions may cause the Utility to develop its budgets based on possible outcomes, rather than authorized amounts. When decisions are delayed, the CPUC typically provides rate relief to the Utility effective as of the commencement of the rate case period (not effective as of the date of the delayed decision). Nonetheless, the Utility’s spending during the period of the delay may exceed the authorized amount, without an ability for the Utility to seek cost recovery of such excess. If the Utility’s spending during the period of the delay is less than the authorized amount, the Utility could be exposed to operational and financial risks associated with the lower level of work achieved compared to that funded by the CPUC.\nThe Utility’s forward-looking rate cases that are pending, have pending appeals, or were completed during the year ended December 31, 2024 are summarized in the following table:\n2023 GRC\nPhase 2: balancing account for additional energization costs\nFinal decision on Phase 2 issued July 2024 sets a cumulative expenditure cap at $2.26 billion for the period of 2024 to 2026.\n2023 Cost of Capital, Phase 2\nMaintain cost of capital adjustment mechanism\nFinal decision issued October 2024, changing the cost of capital adjustment mechanism and setting the Utility’s ROE at 10.28% effective January 1, 2025.\nTO18, TO19, and TO20\nSee Note 15 of the Notes to the Consolidated Financial Statements in Item 8\nSettlement approved by the FERC August 2024.\nTO21\nRevenue requirement of $2.78 billion for 2024\nAccepted December 2023, except as to CAISO adder. Settlement in principle reached December 2024. Appeal of FERC’s order regarding CAISO adder filed June 2024 and remains pending.\n2023 General Rate Case\nOn November 17, 2023, the CPUC issued a final decision on Phase 1.\nThe Utility is authorized to collect through rates the approved revenue requirement increases beginning January 1, 2024 and to amortize the incremental revenue increases related to 2023 for 24 months over the period of January 1, 2024 through December 31, 2025.\nThe final decision authorized the following:\nRevenue Requirement (in billions)\nRate Base (in billions)\nPhase 2 and Energization Timelines Order Instituting Rulemaking\nOn September 15, 2023, the Utility served opening testimony proposing to recover energization costs incremental to the forecasts of the Utility’s Phase 1 2023 GRC. Energization activities include new business connections and capacity-related work to allow for the connections and reduce energization timelines. On July 16, 2024, the CPUC issued a final decision approving a memorandum account with interim rate relief, subject to annual caps and reasonableness review in the 2027 GRC application. The overall expenditure cap was set at\n$2.26 billion for the period of 2024 to 2026. The decision also provides the Utility the ability to request revisions to the 2025 and 2026 cap amounts under certain conditions. On October 4, 2024, the Utility filed a motion to increase the 2025 and 2026 cap amounts by an aggregate $3.1 billion, which reflects approximately $300 million originally included in 2024, for a net increase of $2.8 billion.\nOn October 18, 2024, the assigned commissioner issued an amended scoping memo providing for a final decision in spring 2025.\nCost of Capital Proceedings\n2023 Cost of Capital Application\nOn December 19, 2022, the CPUC issued a final decision adopting a new cost of capital, ROE, cost of preferred stock, and cost of debt for the Utility’s electric generation, electric distribution, natural gas distribution, and natural gas transmission and storage rate base beginning on January 1, 2023. On October 22, 2024, the CPUC issued the decision in Phase 2 modifying the Cost of Capital mechanism and setting new returns on equity effective January 1, 2025.\nOn November 6, 2024, the Utility submitted an advice letter with updated 2025 cost of capital rates. On December 4, 2024, the CPUC approved the advice letter and the following cost of capital rates, which went into effect beginning January 1, 2025:\nReturn on Common Equity\nReturn on Preferred Equity\nReturn on Long-term debt\nThe Utility will file the next cost of capital application on March 20, 2025 for test year 2026.\nTransmission Owner Rate Cases\nTransmission Owner Rate Case for 2024 (the “TO21” rate case)\nOn October 13, 2023, the Utility filed its TO21 rate case with the FERC. In the filing, the Utility forecasted a 2024 retail electric transmission revenue requirement of $2.83 billion. The proposed amount reflects an approximately 11% decrease over the rate year 2023 retail revenue requirement of $3.18 billion, due in part to a refund to customers (see “Transmission Owner Rate Case Revenue Subject to Refund” in Note 15 of the Notes to the Consolidated Financial Statements in Item 8) and the transaction to lease entitlements associated with certain transmission assets (see “Liquidity and Financial Resources - Other Financings” above). The Utility made investments of approximately $1.22 billion in 2023 and forecasts that it will make investments of approximately $1.43 billion in 2024 for various capital projects to be placed in service before the end of 2024. The Utility requested that FERC approve a 12.37% base ROE as well as a 0.5% adder for its participation in the CAISO. The TO21 filing also addresses the Utility’s capital structure and several new issues including wildfire self-insurance recovery from transmission customers.\nOn December 29, 2023, the FERC issued an order accepting the TO21 filing subject to refund, establishing a January 1, 2024 effective date, and establishing a settlement and hearing process, but denying the 0.5% ROE adder for participation in the CAISO, which results in a forecast transmission revenue requirement of $2.78 billion. On January 29, 2024, the Utility filed a request for rehearing of the FERC’s denial of the 0.5% ROE adder for participation in the CAISO. On June 12, 2024, the FERC issued an order denying the Utility’s request for rehearing. On June 18, 2024, the Utility and California IOUs filed an appeal of the FERC’s order denying the Utility’s request for rehearing. The utilities’ joint opening brief was filed on September 11, 2024 and reply brief was filed on December 17, 2024.\nOn December 18, 2024, the settlement judge issued a status report to the FERC stating that the Utility and the other parties have reached a settlement in principle on all issues in the TO21 rate case. The parties will draft an offer of settlement to be filed with the FERC for approval.\nOther Regulatory Proceedings\n2023-2025 Wildfire Mitigation Plan\nOn March 27, 2023, the Utility submitted the 2023-2025 WMP. The 2023-2025 WMP addresses the Utility’s wildfire safety programs and initiatives focused on reducing the potential for catastrophic wildfires related to electrical equipment and reducing the customer impact of EPSS and PSPS events. On December 29, 2023, the OEIS issued a final decision approving the Utility’s 2023-2025 WMP. On February 15, 2024, the CPUC ratified the OEIS’s approval. On January 8, 2024, the Utility filed a change order request to update some of the forecasted work in the WMP for 2024. On May 31, 2024, the OEIS issued a decision approving in part and denying in part the change order request.\nThe Utility submitted an updated 2025 WMP on April 2, 2024, as directed by the OEIS. On November 19, 2024, the OEIS issued a final approval of the Utility’s 2025 WMP update. On January 16, 2025, the CPUC ratified the OEIS’s approval.\nExtension of Diablo Canyon Operations\nOn September 2, 2022, SB 846 became law. SB 846 supports the extension of operations at DCPP through no later than 2030, with the potential for an earlier retirement date. Under the legislation, the Utility continues to operate DCPP on behalf of all CPUC-jurisdictional LSEs, and all customers of those LSEs are responsible for the cost of extended operations.\nThe key steps to continued operations are NRC license renewal and approvals from California state agencies, including the CPUC, CEC, California State Lands Commission, California Coastal Commission, and other state agencies. As set forth below, many of these approvals have been received.\nOn February 28, 2023, and in consultation with the CAISO and CPUC, the CEC determined that it is prudent to extend the operation of DCPP to support electric system reliability through 2030.\nThe Utility leases land from the state for the water intake structure, breakwaters, cooling water discharge channel, and other structures on state land associated with DCPP. On June 5, 2023, the California State Lands Commission approved an extension of the Utility’s lease at DCPP through October 31, 2030.\nOn August 15, 2023, the California State Water Resources Control Board approved the Utility’s plan for once-through cooling at DCPP.\nOn November 7, 2023, the Utility submitted an application for license renewal with the NRC. On December 19, 2023, the NRC deemed the application sufficient, which allows continued operations at DCPP past the plant’s current licenses until the relicensing review is complete. The NRC’s schedule indicates that it will issue a final safety evaluation report and supplemental environmental impact statement by June 2025.\nOn December 14, 2023, the CPUC approved extended operations at DCPP until October 31, 2029 for Unit 1 and October 31, 2030 for Unit 2. The approval is subject to the following conditions: (1) the NRC continues to authorize DCPP operations; (2) the loan agreement authorized by SB 846 is not terminated; and (3) the CPUC does not make a future determination that DCPP extended operations are imprudent or unreasonable.\nOn May 3, 2024, the CEC issued a report concluding that no suitable supply-side resources can be brought online as alternatives to DCPP’s energy and capacity output prior to the planned retirement dates in 2024 and 2025.\nOn December 19, 2024, the CPUC issued a final decision. As a result, the Utility will recover $711 million through rates (compared to its request of $761 million) for net recovery of its costs to operate DCPP from 2023 through 2025.\nSB 884 10-Year Distribution Undergrounding Program\nOn March 7, 2024, the CPUC approved a resolution that establishes an expedited utility distribution infrastructure undergrounding program pursuant to Public Utilities Code Section 8388.5. The resolution addresses the process and requirements for the CPUC’s review of any large electrical corporation’s 10-year distribution infrastructure undergrounding plan and conditional approval of its related costs.\nThe OEIS issued draft guidelines on May 8, 2024, revised guidelines on September 10, 2024, and second revised guidelines on January 7, 2025.\nThe Utility expects to submit its undergrounding plan to the OEIS after final guidelines are issued before submitting its cost application to the CPUC, as directed in Public Utilities Code Section 8388.5.\nLEGISLATIVE AND REGULATORY INITIATIVES\nInflation Reduction Act\nIn 2022, the Inflation Reduction Act became law. The Inflation Reduction Act includes a 15% corporate alternative minimum tax on the AFSI of corporations with average AFSI exceeding $1.0 billion over a three-year period, effective January 1, 2023. The law also extends and modifies existing tax credits and creates new tax credits for qualifying investments on renewable and clean energy sources and energy storage. The U.S. Department of the Treasury and the IRS have broad authority to issue and have issued regulations and guidance to implement its provisions. PG&E Corporation and the Utility expect to pay corporate alternative minimum tax beginning in 2027, the amount of which may become substantial in future years. As of December 31, 2024, the law did not have a material impact on the PG&E Corporation’s and the Utility’s Consolidated Financial Statements.\nENVIRONMENTAL MATTERS\nThe Utility’s operations are subject to extensive federal, state, and local laws and permits relating to the protection of the environment and the safety and health of the Utility’s personnel and the public. These laws and requirements relate to a broad range of the Utility’s activities, including the remediation of hazardous substances; the reporting and reduction of carbon dioxide and other GHG emissions; the discharge of pollutants into the air, water, and soil; the reporting of safety and reliability measures for natural gas storage facilities; and the transportation, handling, storage, and disposal of spent nuclear fuel. See Item 1A. Risk Factors, “Environmental Regulation” in Item 1 and “Environmental Remediation Contingencies” in Note 15 of the Notes to the Consolidated Financial Statements in Item 8.\nRISK MANAGEMENT ACTIVITIES\nPG&E Corporation, mainly through its ownership of the Utility, and the Utility are exposed to risks associated with adverse changes in commodity prices, interest rates, and counterparty credit. The Utility actively manages market risk through risk management programs designed to support business objectives, discourage unauthorized risk-taking, reduce commodity cost volatility, and manage cash flows. The Utility uses derivative instruments only for non-trading purposes (i.e., risk mitigation) and not for speculative purposes.\nCommodity Price Risk\nThe Utility is exposed to commodity price risk as a result of its electricity and natural gas procurement activities, including the procurement of natural gas and nuclear fuel necessary for electricity generation and natural gas procurement for core customers. The Utility’s risk management activities include the use of physical and financial instruments such as forward contracts, futures, swaps, options, and other instruments and agreements. As long as the Utility can conclude that it is probable that its reasonably incurred wholesale electricity procurement costs and natural gas costs are recoverable, fluctuations in electricity and natural gas prices do not affect earnings. Such fluctuations, however, may impact cash flows. The Utility’s natural gas transportation and storage costs for core customers are also fully recoverable through a ratemaking mechanism.\nThe Utility does not have a balancing account for costs in excess of its revenue requirement for natural gas transportation and storage service to non-core customers. The Utility recovers these costs in its GRC through fixed reservation charges and volumetric charges from long-term contracts, resulting in price and volumetric risk.",
  "item2_clean": null
}