{
  "source_file": "pep-20250906.htm",
  "form_type": "10-Q",
  "item1_clean": null,
  "item7_clean": null,
  "item2_clean": "The reported tax rate\n1.1 percentage points,\nprimarily reflecting the unfavorable impact of a tax audit settlement in our LatAm Foods segment, partially offset by the reversal of deferred tax liability on undistributed earnings as a result of a tax election.\nOther pension and retiree medical benefits income decreased $64 million, primarily reflecting recognition of fixed income losses on plan assets and the impact of certain plan changes approved in 2020, as discussed in Note 7 to our consolidated financial statements in our Recast Segment Information, partially offset by higher prior-year recognition of special termination benefits due to restructuring actions as part of our 2019 Productivity Plan.\nNet interest expense and other increased\ndue to higher average debt balances, higher interest rates on average debt balances and lower interest rates on average cash balances, partially offset by higher average cash balances.\nThe reported tax rate\n0.6 percentage points, primarily reflecting the impact of a prior-year release of a valuation allowance in a foreign jurisdiction.\nResults of Operations – Segment Review\nEffective beginning with our first quarter of 2025, we realigned certain of our reportable segments to conform with changes to our organizational structure and how our Chief Executive Officer regularly reviews the performance of, and allocates resources to, these segments. Our historical segment reporting has been recast to reflect our current organizational structure.\nWhile our financial results in North America are reported on a 12-week basis, all of our international operations are reported on a monthly calendar basis for which the months of June, July and August are reflected in our results for the 12 weeks ended September 6, 2025 and September 7, 2024, and the months January through August are reflected in our results for the 36 weeks ended September 6, 2025 and September 7, 2024.\nIn the discussions of net revenue and operating profit below, “effective net pricing” reflects the year-over-year impact of discrete pricing actions, sales incentive activities and mix resulting from selling varying products in different package sizes and in different countries.\nSee “Our Business Risks,” “Non-GAAP Measures” and “Items Affecting Comparability” for a discussion of items to consider when evaluating our results and related information regarding measures not in accordance with GAAP.\n\nItem 2. Management’s Discussion and Analysis of Financial Condition and Results of Operations.\nFINANCIAL REVIEW\nOur discussion and analysis is intended to help the reader understand our results of operations and financial condition and is provided as an addition to, and should be read in connection with, our condensed consolidated financial statements and the accompanying notes. Unless otherwise noted, tabular dollars are presented in millions, except per share amounts. All per share amounts reflect common stock per share amounts, assume dilution unless otherwise noted, and are based on unrounded amounts. Percentage changes are based on unrounded amounts.\nOur Critical Accounting Policies and Estimates\nThe critical accounting policies and estimates below should be read in conjunction with those outlined in our Recast Segment Information.\nTotal Marketplace Spending\nWe offer sales incentives and discounts through various programs to customers and consumers. Total marketplace spending includes sales incentives, discounts, advertising and other marketing activities. Sales incentives and discounts are primarily accounted for as a reduction of revenue. A number of our sales incentives, such as bottler funding to independent bottlers and customer volume rebates, are based on annual targets, and accruals are established during the year, as products are delivered, for the expected payout, which may occur after year end once reconciled and settled.\nThese accruals are based on contract terms and our historical experience with similar programs and require management judgment with respect to estimating customer and consumer participation and performance levels. Differences between estimated expense and actual incentive costs are normally insignificant and are recognized in earnings in the period such differences are determined. In addition, certain advertising and marketing costs are also based on annual targets and recognized during the year as incurred.\nFor interim reporting, our policy is to allocate our forecasted full-year sales incentives for most of our programs to each of our interim reporting periods in the same year that benefits from the programs. The allocation methodology is based on our forecasted sales incentives for the full year and the proportion of each interim period’s actual gross revenue or volume, as applicable, to our forecasted annual gross revenue or volume, as applicable. Based on our review of the forecasts at each interim period, any changes in estimates and the related allocation of sales incentives are recognized beginning in the interim period that they are identified. In addition, we apply a similar allocation methodology for interim reporting purposes for certain advertising and other marketing activities.\nIn determining our quarterly provision for income taxes, we use an estimated annual effective tax rate which is based on our expected annual income, statutory tax rates and tax structure and transactions, including transfer pricing arrangements, available to us in the various jurisdictions in which we operate. Significant judgment is required in determining our annual tax rate and in evaluating our tax positions. Subsequent recognition, derecognition and measurement of a tax position taken in a previous period are separately recognized in the quarter in which they occur.\n\nRisks Associated with Climate Change\nCertain jurisdictions in which our products are made, manufactured, distributed or sold have either imposed, or are considering imposing, new or increased legal and regulatory requirements to reduce or mitigate the potential effects of climate change, including regulation of greenhouse gas emissions and potential carbon pricing programs. These new or increased legal or regulatory requirements, along with initiatives to meet our sustainability goals, could result in significant increased costs and additional investments in facilities and equipment. However, we are unable to predict the scope, nature and timing of any new or increased environmental laws and regulations and therefore cannot predict the ultimate impact of such laws and regulations on our business or financial results. We continue to monitor existing and proposed laws and regulations in the jurisdictions in which our products are made, manufactured, distributed and sold and to consider actions we may take to potentially mitigate the unfavorable impact, if any, of such laws or regulations.\nRisks Associated with International Operations\nIn the 12 weeks ended September 6, 2025, our financial results outside of North America reflect the months of June, July and August. In the 36 weeks ended September 6, 2025, our financial results outside of North America reflect the months of January through August. In the 36 weeks ended September 6, 2025, our operations outside of the United States generated 43% of our consolidated net revenue, with Mexico, Russia, Canada, China, the United Kingdom, Brazil and South Africa comprising approximately 24% of our consolidated net revenue. As a result, we are exposed to foreign exchange risk in the international markets in whi\nch our products are made, manufactured, distributed or sold. In the\n12 weeks ended September 6, 2025, favorable foreign exchange\nnet revenue performance by 0.5 percentage points primarily driven by an\nof the Russian ruble, euro, British pound and Polish zloty,\npartially offset by declines in the Turkish lira, Mexican peso and Argentine peso\n. In the 36 weeks ended September 6, 2025, unfavorable foreign exchange\nnet revenue performance by 1 percentage point primarily driven by\nin the Mexican peso, Turkish lira, Egyptian pound and Brazilian real, partially offset by an appreciation of the Russian ruble.\nCurrency declines against the U.S. dollar which are not offset could adversely impact our future financial results.\nIn addition, volatile economic, political, social and geopolitical conditions, civil unrest and wars and other military conflicts, acts of terrorism and natural disasters and other catastrophic events in certain markets in which our products are made, manufactured, distributed or sold, including in Argentina, Brazil, China, Mexico, the Middle East (including Egypt), Russia, Turkey and Ukraine, continue to result in challenging operating environments and have resulted in and could continue to result in changes in how we operate in certain of these markets. Debt and credit issues, currency controls or fluctuations, sanctions and export controls in certain of these international markets (including restrictions on the transfer of funds to and from certain markets) have also continued to impact our operations in certain of these international markets. We continue to closely monitor the economic, operating and political environment in the markets in which we operate, including risks of additional impairments or write-offs and currency fluctuation, and to identify actions to potentially mitigate any unfavorable impacts on our future results. Our operations in Russia accounted for 5.5% and 5% of our consolidated net revenue for the 12 and 36 weeks ended September 6, 2025, respectively. Russia accounted for 4.5% of our consolidated assets, including 15% of\n\nRisks Associated with Tariffs\nThe imposition of tariffs (including U.S. tariffs imposed or threatened to be imposed on China, the European Union, Canada and Mexico and other countries and any tariffs imposed by such countries) have impacted and could continue to impact our supply chain resulting in increased input costs, including the cost o"
}