{
  "source_file": "pfe-20241231.htm",
  "form_type": "10-K",
  "item1_clean": "section within MD&A and\nCOMMERCIAL OPERATIONS\nWe manage our commercial operations through a global structure consisting of three operating segments, each led by a single manager: Biopharma, PC1 and Pfizer Ignite. Biopharma, our innovative science-based biopharmaceutical business, is engaged in the discovery, development, manufacture, marketing, sale and distribution of biopharmaceutical products worldwide. PC1 is our contract development and manufacturing organization and a leading supplier of specialty active pharmaceutical ingredients. Pfizer Ignite is an offering that provides strategic guidance and end-to-end R&D services to select innovative biotech companies that align with our R&D focus areas. Biopharma is the only reportable segment. Our commercial divisions market, sell and distribute our products, and global operating functions are responsible for the research, development, manufacturing and supply of our products.\nThe commercial structure within our Biopharma reportable segment in 2024 was comprised of the Pfizer Oncology Division, the Pfizer U.S. Commercial Division, and the Pfizer International Commercial Division:\nPfizer Oncology Division combined the U.S. Oncology commercial organizations, global Oncology marketing organizations and global and U.S. Oncology medical affairs from both Pfizer and Seagen (which we acquired in December 2023).\nPfizer U.S. Commercial Division included the U.S. Primary Care and U.S. Specialty Care customer groups, the Chief Marketing Office, the Global Chief Medical Affairs Office and Global Access & Value.\nPfizer International Commercial Division included the ex-U.S. commercial and medical affairs organizations covering Pfizer’s entire product portfolio in all international markets.\nAs part of our continued focus on commercial execution, at the beginning of 2025, we made changes in our commercial structure, which included the transition of all activities within the Pfizer Oncology Division to other parts of Biopharma, among other changes. Specifically, within our Biopharma reportable segment, the U.S. Oncology commercial organization and the global Oncology marketing organization, which were part of the former Pfizer Oncology Division, are now part of the Pfizer U.S. Commercial Division. In 2025, the commercial structure within our Biopharma reportable segment is as follows:\nPfizer U.S. Commercial Division\nIncludes the U.S. commercial and medical affairs organizations covering Pfizer’s entire product portfolio (excluding Oncology medical affairs which is part of global R&D), as well as the Global Access & Value and Global Chief Marketing Office organizations.\nPrimary Care includes:\nInternal medicine product portfolio of brands in cardiovascular metabolic, as well as brands that have experienced patent-based expirations or loss of regulatory exclusivity.\nMigraine product portfolio.\nVaccines product portfolio across all ages with a pipeline focus on infectious diseases with significant unmet medical need, including COVID-19.\nTreatment for COVID-19.\nSpecialty Care includes:\nInflammation & immunology product portfolio of brands and biosimilars for chronic immune and inflammatory diseases.\nRare disease product portfolio of brands for a number of therapeutic areas with rare diseases, including amyloidosis, hemophilia and endocrine diseases.\nHospital product portfolio of sterile injectable and immunoglobulin medicines.\nInnovative oncology product portfolio of ADCs, small molecules, bispecifics and other immunotherapies that treat a wide range of cancers including certain types of breast cancer, genitourinary cancer and hematologic malignancies, as well as certain types of melanoma, gastrointestinal, gynecological and lung cancer.\nOncology biosimilars.\nPfizer International Commercial Division\nIncludes the ex-U.S. commercial and medical affairs organizations covering Pfizer’s entire product portfolio in all international markets.\nSelect Primary Care, Specialty Care and Oncology products include:\n: Eliquis, as well as other brands that have experienced patent-based expirations or loss of regulatory exclusivity.\n: Nurtec ODT/Vydura and Zavzpret\n: the Prevnar family, Comirnaty, Abrysvo, FSME/IMMUN-TicoVac, Nimenrix and Trumenba\nTreatment for COVID-19\nInflammation & immunology\n: Xeljanz, Enbrel (outside the U.S. and Canada), Inflectra, Abrilada, Cibinqo, Litfulo, Eucrisa and Velsipity\n: the Vyndaqel family, Genotropin, BeneFIX, Xyntha, Somavert, Ngenla and Hympavzi\n: Sulperazon, Zavicefta, Octagam, Zithromax, Medrol and Panzyga\n\nITEM 1.\nBUSINESS\nABOUT PFIZER\nPfizer Inc. is a research-based, global biopharmaceutical company. We apply science and our global resources to bring therapies to people that extend and significantly improve their lives through the discovery, development, manufacture, marketing, sale and distribution of biopharmaceutical products worldwide. We work across developed and emerging markets to advance wellness, prevention, treatments and cures that challenge the most feared diseases of our time. We collaborate with healthcare providers, governments and local communities to support and expand access to reliable, affordable healthcare around the world. The Company was incorporated under the laws of the State of Delaware on June 2, 1942.\nMost of our revenues come from the manufacture and sale of biopharmaceutical products. We believe that our medicines and vaccines provide significant value for healthcare providers and patients through improved treatment of diseases and improvements in health, wellness and productivity as well as by reducing other healthcare costs, such as emergency room visits or hospitalizations. We seek to enhance the value of our medicines and vaccines and actively engage in dialogues about how we can best work with patients, physicians and payors to prevent and treat disease and improve outcomes. We seek to maximize patient access and evaluate our pricing arrangements and contracting methods with payors to minimize adverse impact on our revenues within the current legal and pricing structures.\nWe are committed to fulfilling our purpose:\nBreakthroughs that change patients’ lives\n. Our purpose fuels everything we do and reflects both our passion for science and our commitment to patients. Our core business principles are:\nDisruption Calls for Innovation\nExecution Makes the Difference.\nOur 2025 key priorities are:\nImprove R&D productivity with sharpened focus\nExpand margins and maximize operational efficiency\nAchieve commercial excellence in our key categories\nOptimize capital allocation.\nWe are committed to strategically capitalizing on growth opportunities, primarily by advancing our own product pipeline and maximizing the value of our existing products, but also through various business development activities. We view our business development activity as an enabler of our strategies and seek to generate growth by pursuing opportunities and transactions that have the potential to strengthen our business and our\ncapabilities. We assess our business, assets and scientific capabilities/portfolio as part of our regular, ongoing portfolio review process and also continue to consider business development activities that will help advance our business strategy.\nFor a discussion of our strategy and our business development initiatives, see the\nOverview of Our Performance, Operating Environment, Strategy and Outlook\n\nIbrance, Xtandi, Padcev, Adcetris, Inlyta, Lorbrena, Bosulif, Tukysa, Braftovi, Mektovi, Orgovyx, Elrexfio, Tivdak and Talzenna\nFor additional information on our operating segments and products, including product revenues, see\nand for additional information on the key operational revenue drivers of our business, see the\nAnalysis of the Consolidated Statements of Operations\nsection within MD&A. For a discussion of the risks associated with our dependence on certain of our major products, see the",
  "item7_clean": null,
  "item2_clean": null
}