{
  "source_file": "pfg-20241231x10k.htm",
  "form_type": "10-K",
  "item1_clean": "Workplace Savings and Retirement Solutions (“WSRS”)\nWe offer a wide variety of investment and administrative products and services for defined contribution plans, including 401(k) and 403(b) plans; defined benefit plans; nonqualified executive benefit plans and stock services, including ESOPs and equity compensation.\nWSRS products respond to the needs of plan sponsors seeking both administrative and investment services for defined contribution plans or defined benefit plans. The investment component of both the defined contribution and defined benefit plans may be in the form of a guaranteed account, separate account, a mutual fund offering or a collective investment trust. In addition, defined contribution plan sponsors may also offer their own employer securities as an investment option under the plan.\nAs of December 31, 2024, we provided WSRS products to (a) over 43,000 defined contribution plans including $550.7 billion in assets and covering approximately 11.3 million eligible plan participants, and (b) to over 1,600 defined benefit plans, including $17.3 billion in assets and covering over 404,000 eligible plan participants. As of December 31, 2024, approximately 31% of our WSRS account values were managed by our Principal Asset Management segment, 65% were managed entirely by the third party asset managers that were not under contract to sub-advise a PFG product, 2% were sub-advised and 2% represented employer securities.\nMarkets and Distribution\nWe offer our WSRS products and services to plans, including qualified and nonqualified defined contribution plans and defined benefit plans. These products and services are offered to businesses of all sizes including plans sponsored by small and mid-sized businesses, which we believe remains underpenetrated, and large institutional clients. We distribute our WSRS products and services nationally, primarily through a captive retirement services sales force. Retirement services sales representatives are an integral part of the sales process alongside the referring consultant or independent advisor. We compensate retirement services sales representatives through a blend of salary and production-based incentives. We administer, on behalf of the plan, commission or fee payments to independent advisors, consultants and agents.\nIn addition, we have a staff of service and education specialists located across the U.S. These specialists play a key role in the ongoing servicing of plans by providing local services to our customers, such as reviewing plan performance, investment options and plan design; communicating the customers’ needs and feedback to us and helping employees understand the benefits of their plans. The following summarizes our distribution channels:\nWe distribute our annuity-based products through intermediaries who are primarily state licensed individuals.\nPrincipal Advantage platform is targeted at defined contribution plans through broker-dealer distribution channels. Principal Advantage gives us access to Financial Industry Regulatory Authority (“FINRA”) registered distributors who are not traditional sellers of annuity-based products and broadens opportunities for us in the investment advisor and broker-dealer distribution channels.\nThrough our Retire Secure strategy we provide financial education and other assistance to individual investors who are participants/members of employer-based accumulation solutions to help them achieve financial security.\nWe believe our approach to WSRS plan services distribution, which gives us a targeted sales and service presence, along with our offering of Principal\nÒ\nTotal Retirement Solutions differentiates us from many of our competitors. We have also established a number of marketing and distribution relationships to increase the sales of our products and services.\n\nDeposits to investment only products are predominantly in the form of single payments. As a result, the level of new deposits can fluctuate from one fiscal quarter to another. The amounts earned by us are derived in part from the difference between the investment income earned by us and the amount credited to the customer. The Principal Asset Management segment manages the assets supporting the contractual promises.\nMarkets and Distribution\nFunding agreements are issued directly to non-qualified institutions, the Federal Home Loan Bank of Des Moines (“FHLB Des Moines”) and unconsolidated special purpose entities. As part of our funding agreement-backed note programs, U.S. and foreign institutional investors purchase debt obligations from the special purpose entity which, in turn, purchases the funding agreement from us with terms similar to those of the debt obligations. The strength of this market is dependent on debt capital market conditions. As a result, our sales through this channel can vary widely from one quarter to another.\nPension Risk Transfer\nPension risk transfer products respond primarily to the needs of pension plan sponsors in the form of single premium group annuities, which are immediate or deferred annuities that provide a current or future specific income amount, fully guaranteed by us. The majority of our business originates from defined benefit plans that are being terminated. In these situations, the plan sponsor transfers all its obligations under the plan to an insurer by paying a single premium. Generally, plan sponsors restrict their purchases to insurance companies with superior or excellent financial quality ratings because the Department of Labor (“DOL”) has mandated that annuities be purchased only from the “safest available” insurers.\nSince premium received from pension risk transfer products is generally in the form of single payments, the level of premiums can fluctuate depending on the number of large-scale annuity sales in a particular quarter. The Principal Asset Management segment manages the assets supporting pension risk transfer account values.\nMarkets and Distribution\nOur primary distribution channel for pension risk transfer products is comprised of several specialized home office sales consultants working through consultants and brokers that specialize in this type of business. Our sales consultants also make sales directly to institutions. Our nationally dispersed retirement services sales representatives act as a secondary distribution channel for these products.\nBank and Trust Services\nPrincipal Bank is a U.S. federal savings bank that was formed in February 1998. As of December 31, 2024, Principal Bank had nearly 772,000 customers and approximately $8.8 billion in assets. Principal Bank operates under a limited purpose charter and may only accept deposits held in a fiduciary capacity and may not hold demand deposits. It also may not own commercial loans or originate loans.\nPrincipal Custody Solutions (“PCS”) is a division of Principal Bank that provides trust and/or custodial support services to clients in a variety of market segments including corporations, endowments, foundations, health care organizations, insurance and financial institutions, public entities and government institutions.\nPrincipal Trust Company (the trade name for Delaware Charter Guarantee & Trust) is a non-deposit trust company chartered in 1899 in the State of Delaware. As of December 31, 2024, Principal Trust Company has over 35,000 accounts and approximately $658.6 billion in assets under administration. Principal Trust Company provides trust and custodial services to certain retirement benefit plans and personal trusts.\nIndividual retirement accounts (“IRAs”) are provided by Principal Bank, primarily funded by retirement savings rolled over from qualified retirement plans. Principal Bank offers Federal Deposit Insurance Corporation (“FDIC”) insured cash solutions for customers in the form of savings accounts, money market accounts and certificates of deposit. The deposit products provide a relatively stable source of funding and liquidity for Principal Bank and are backed by purchases of investment securities and residential mortgage loans. In addition, Principal Bank serves as a trustee and/or custodian for institutional customers within its PCS division and facilitates cash sweep services for these customers as well as cash sweep services for customers of affiliates.\n\nPrincipal Trust Company provides a variety of comprehensive trust and administrative solutions for employee benefits plans and personal trusts. It also provides trustee services for some retirement plan customers of PCS.\nMarkets and Distribution\nPrincipal Bank offers products and services primarily to participants rolling out of qualified retirement plans largely serviced by affiliates of PFG. Principal Bank services customers by telephone, mail and internet. Principal Bank also serves as trustee and/or custodian for the non-retirement plan clients within the PCS business line.\nPrincipal Trust Company offers services through brokerage and financial institution relationships services primarily through affiliates of PFG and also leverages some unaffiliated partners. Principal Trust Company also acts as trustee and/or custodian for the retirement plan clients that fall into the PCS business line.\nIndividual Fixed Annuities\nIn 2021, we ceased sales of individual fixed annuity products and in 2022, we reinsured the block of business existing as of January 1, 2022. Annuitizations from existing products occurring after this date are not reinsured.\nPrincipal Asset Management Segment\nOur Principal Asset Management segment provides global investment solutions to institutional, retirement, retail and high net worth investors in the U.S. and select emerging markets.\nInvestment Management\nOur Investment Management operations manages assets for sophisticated investors around the world using global and local investment teams that provide diverse investment capabilities including equity, fixed income, asset allocation, real estate and other alternative investments. We focus on providing services to our other segments in addition to our retail mutual fund and third party institutional clients. Our products and services are provided for a fee as defined by client mandates. Our fees are generally driven by AUM. The Investment Management teams managed $559.1 billion in assets as of December 31, 2024.\nGlobal Investment Teams\nOur equity capabilities encompass large-cap stocks, mid-cap stocks, small-cap stocks and real estate investment trusts in developed and emerging markets worldwide.\nFixed Income Investments.\nOur experience in fixed income management spans multiple economic and credit market cycles and encompasses all major fixed income security types and sectors. Our research and risk management capabilities in worldwide debt markets provide a strong foundation for broadly diversified “multi-sector” portfolios, tailored to specific client objectives.\nAsset Allocation is a specialized asset allocation investment team offering multi-asset and/or multi-manager portfolio construction services that aim to deliver reliable, risk-adjusted investment outcomes to individual investors, institutional investors and participants in employer-sponsored plans.\nReal Estate and Other Alternative Investments.\nWe offer products and services through other alternative asset classes including managing private real estate equity, commercial mortgages, bridge/mezzanine loans, direct lending, infrastructure debt and timber investments.\nGlobal Markets and Distribution\nTo effectively reach and cater to a diverse range of investors, we employ a multi-channel distribution strategy. Our Global Institutional Advisory Services and Global Wealth Advisory Services teams, relationship managers and client service professionals collaborate with consultants and directly interact with investors to acquire and retain institutional, retail and other investors. These teams are organized into three geographic groups: U.S./Europe clients, Asia Pacific/Middle East clients and Latin Am",
  "item7_clean": "Benefits, claims and settlement expenses increased $530.0 million for the Retirement and Income Solutions segment primarily due to an increase in reserves, stemming from higher sales of single premium group annuities with life contingencies. Benefits, claims and settlement expenses increased $122.0 million for the Benefits and Protection segment due to growth in the Specialty Benefits business. This increase was partially offset by a $345.4 million decrease for the Benefits and Protection segment due to a favorable one-time impact of the YRT Reinsurance Transactions in 2024.\nThe liability for future policy benefits remeasurement (gain) loss change was primarily due to the unfavorable effect of changes in cash flow assumptions related to a $544.5 million one-time impact of the YRT Reinsurance Transactions in 2024 and a $131.6 million impact driven by actuarial assumption updates and model refinements.\nOperating expenses increased primarily due to a $148.4 million increase in compensation costs, an $85.9 million increase in nondeferrable commission expense and an $81.4 million increase in amounts credited to employee accounts in a nonqualified defined contribution pension plan.\nThe effective income tax rate increased to 15% for the year ended December 31, 2024 from 9% for the year ended December 31, 2023, primarily due to an increase in pre-tax income with no proportionate change in permanent tax differences. See Item 8. “Financial Statements and Supplementary Data, Notes to Consolidated Financial Statements, Note 14, Income Taxes” under the caption, “Effective Income Tax Rate” for further discussion.\nResults of Operations by Segment\nFor results of operations by segment see Item 8. “Financial Statements and Supplementary Data, Notes to Consolidated Financial Statements, Note 20, Segment Information.”\nRetirement and Income Solutions Segment\nRetirement and Income Solutions Trends\nSeveral key factors impact revenue and earnings growth in the Retirement and Income Solutions segment. These factors include: the ability of our distribution channels to generate new sales and retain existing business; pricing decisions that take account of competitive conditions, persistency, investment returns, mortality trends, and operating expense levels; investment management performance; equity market returns and interest rate changes. Profitability ultimately depends on our ability to price products and invest assets at a level that enables us to earn a margin over the cost of providing benefits and the expense of acquiring and administering those products.\nNet revenue and average monthly account values are key metrics used to understand Retirement and Income Solutions earnings growth. Net revenue, which is used only at the segment level, is defined as operating revenues less benefits, claims and settlement expenses; liability for future policy benefits remeasurement (gain) loss; market risk benefit remeasurement (gain) loss and dividends to policyholders. Net revenue is impacted by: (1) changes in the equity markets and interest rates and (2) the difference between investment income earned on the underlying general account assets and the interest rate credited to the contracts. Average monthly account values include the net balances that customers have accumulated within their account, along with future policy benefits for retirement payout products. Average monthly account values are primarily impacted by net customer cash flows and credit market performance.\nThe following table presents the Retirement and Income Solutions segment net revenue for the years indicated:\nFor the year ended December 31,\n\nThe Holding Companies: PFG and PFS.\nThe principal sources of funds available to our parent holding company, PFG, are dividends from subsidiaries as well as its ability to borrow funds at competitive rates and raise capital to meet operating and growth needs. These funds are used by PFG to meet its obligations, which include the payment of dividends on common stock, debt service and the repurchase of stock. The declaration and payment of common stock dividends is subject to the discretion of our Board and will depend on our overall financial condition, results of operations, capital levels, cash requirements, future prospects, receipt of dividends or other distributions from Principal Life (as described below), risk management considerations and other factors deemed relevant by the Board. No significant restrictions limit the payment of dividends by PFG, except those generally applicable to corporations incorporated in Delaware.\nDividends or other distributions from Principal Life, our primary subsidiary, are limited by Iowa law. Under Iowa law, Principal Life may pay dividends or make other distributions only from the earned surplus arising from its business and must receive the prior approval of the Commissioner of Insurance of the State of Iowa (the “Commissioner”) to pay stockholder dividends or make any other distribution if such distribution would exceed certain statutory limitations. Iowa law gives the Commissioner discretion to disapprove requests for distributions in excess of these limitations. Extraordinary dividends include those made, together with dividends and other distributions, within the preceding twelve months that exceed the greater of (i) 10% of statutory policyholder surplus as of the previous year-end excluding admitted disallowed interest maintenance reserve or (ii) the statutory net gain from operations from the previous calendar year, not to exceed earned surplus. Based on statutory results for the year ended December 31, 2024, the ordinary stockholder dividend limitation for Principal Life is approximately $1,313.1 million in 2025. However, because the dividend test is based on dividends previously paid over rolling twelve month periods, if paid before a specified date during 2025, some or all of such dividends may be extraordinary and require regulatory approval.\nTotal stockholder dividends paid by Principal Life to its parent in 2024 were $1,010.0 million, all of which was extraordinary and approved by the Commissioner. As of December 31, 2024, we had $1,941.5 million of cash and liquid assets held in our holding companies and other subsidiaries, which is available for corporate purposes. Corporate balances held in foreign holding companies meet the indefinite reinvestment exception.\nIn 2023, total stockholder dividends paid by Principal Life to its parent were $1,200.0 million, all of which was extraordinary and approved by the Commissioner.\nOur primary consolidated cash flow sources are premiums from insurance products, pension and annuity deposits, asset management fee revenues, administrative services fee revenues, income from investments and proceeds from the sales or maturity of investments. Cash outflows consist primarily of payment of benefits to policyholders and beneficiaries, income and other taxes, current operating expenses, payment of dividends to policyholders, payments in connection with investments acquired, payments made to acquire subsidiaries, payments relating to policy and contract surrenders, withdrawals, policy loans, interest payments and repayment of short-term debt and long-term debt. Our investment strategies are generally intended to provide adequate funds to pay benefits without forced sales of investments. For a discussion of our investment objectives and strategies, see “Investments.”\nCash flow activity, as reported in our consolidated statements of cash flows, provides relevant information regarding our sources and uses of cash. The following discussion of our operating, investing and financing portions of the cash flows excludes cash flows attributable to the separate accounts.\nNet cash provided by operating activities was $4,602.9 million and $3,792.4 million for the years ended December 31, 2024 and 2023, respectively. Our insurance business typically generates positive cash flows from operating activities, as premiums collected from our insurance products and investment income received exceed acquisition costs, benefits paid, redemptions and operating expenses. These positive cash flows are then invested to support the obligations of our insurance and investment products and required capital supporting these products. Our cash flows from operating activities are affected by the timing of premiums, fees and investment income received and benefits and expenses paid. The increase in cash provided by operating activities in 2024 compared to 2023 was primarily due to fluctuations in receivables and payables associated with the timing of settlements, and due to a one-time impact of the YRT Reinsurance Transactions in 2024.\nNet cash used in investing activities was $5,399.0 million and $1,346.9 million for the years ended December 31, 2024 and 2023, respectively. The increase in cash used in investing activities was due to higher net purchases of available-for-sale securities in 2024 as compared to 2023.\nNet cash provided by financing activities was $300.3 million for the year ended December 31, 2024, compared to net cash used in financing activities of $2,585.8 million for the year ended December 31, 2023. The increase in cash provided by financing activities was due to net investment contract deposits in 2024 as compared to net investment contract withdrawals in 2023 and an increase in banking operation deposits in 2024 as compared to a decrease in 2023. These were partially offset by higher acquisitions of treasury stock in 2024 as compared to 2023.\n\nOur profitability depends in large part upon our amount of AUM and our ability to:\nmanage the difference between the investment income we earn and the interest we credit to policyholders;\ngenerate fee revenues by providing trust and custody, administrative and investment management services;\nprice our insurance products at a level that enables us to earn a margin over the cost of providing benefits and the related expenses;\nmanage our investment portfolio to maximize investment returns and minimize risks such as interest rate changes or defaults or impairments of invested assets;\neffectively hedge fluctuations in foreign currency to U.S. dollar exchange rates on certain transactions and\nmanage our operating expenses.\nCritical Accounting Policies and Estimates\nThe increasing complexity of the business environment and applicable authoritative accounting guidance requires us to closely monitor our accounting policies. Our significant accounting policies are described in Item 8. “Financial Statements and Supplementary Data, Notes to Consolidated Financial Statements, Note 1, Nature of Operations and Significant Accounting Policies.” We have identified critical accounting policies that are complex and require significant judgment and estimates about matters that are inherently uncertain. A summary of our critical accounting policies is intended to enhance the reader’s ability to assess our financial condition and results of operations and the potential volatility due to changes in estimates and changes in guidance. The identification, selection and disclosure of critical accounting policies and estimates have been discussed with the Board Audit Committee.\nValuation and Allowance for Credit Loss of Fixed Income Investments\nFixed maturities include bonds, asset-backed securities (“ABS”), redeemable preferred stock and certain non-redeemable preferred securities. We classify our fixed maturities as either AFS or trading and, accordingly, carry them at fair value in the consolidated statements of financial position. Volatility in net income can result from changes in fair value of fixed maturities classified as trading. Volatility in other comprehensive income can result from changes in fair value of fixed maturities classified as AFS.\nWe measure the fair value of our financial assets and liabilities based on assumptions used by market participants in pricing the asset or liability, which may include inherent risk, restrictions on the sale or use of an asset, or nonperformance risk, including our own credit risk. For additional details concerning the methodologies, assumptions and inputs utilized see Item 8. “Financial Statements and Supplementary Data, Notes to Consolidated Financial Statements, Note 18, Fair Value Measurements” under the caption, “Determination of Fair Value.”\nThe fair values of our public fixed maturities are primarily based on market prices from third party pricing vendors. We have regular interactions with these vendors to ensure we understand their pricing methodologies and to confirm they are utilizing observable market information. In addition, 16% of our invested asset portfolio as of December 31, 2024, was invested in privately placed fixed maturities with no readily available market quotes to determine the fair market value. The majority of these assets are valued using a matrix pricing valuation approach that utilizes observable market inputs. In the matrix approach, securities are grouped into pricing categories that vary by sector, rating and average life. Each pricing category is assigned a risk spread based on observable public market data. The expected cash flows of the security are then discounted back at the current Treasury curve plus the appropriate risk spread. Although the matrix valuation approach provides a fair valuation of each pricing category, the valuation of an individual security within each pricing category may be impacted by company specific factors. This excludes privately placed securities subject to Rule 144A of the Securities Act of 1933 that are primarily based on market prices from third party pricing vendors, similar to public fixed maturities.\nIf we are unable to price a fixed maturity security using prices from third party pricing vendors or other sources specific to the asset class, we may obtain a broker quote or utilize an internal pricing model specific to the asset utilizing relevant market information, to the extent available and where at least one significant unobservable input is utilized. In addition, there may be certain securities managed by external managers where we obtain the valuation from the external manager when we are unable to obtain prices from third party pricing vendors or other sources. These are reflected in Level 3 in the fair value hierarchy and can include fixed maturities across all asset classes. As of December 31, 2024, approximately 3% of our total fixed maturities were Level 3 securities valued using internal pricing models. See Item 8. “Financial Statements and Supplementary Data, Notes to Consolidated Financial Statements, Note 18, Fair Value Measurements” for further discussion.\n\nFor short-duration contracts, significant changes in experience or assumptions may require us to provide for expected future losses on a product by establishing premium deficiency reserves. Our reserve levels are reviewed throughout the year using internal analysis including, among other things, experience studies, claim development analysis and annual loss recognition analysis. To the extent experience indicates potential loss recognition, we recognize losses on certain lines of business. The ultimate accuracy of the assumptions on these insurance products cannot be determined until the obligation of the entire block of business on which the assumptions were made is extinguished. Short-term variances of actual results from the assumptions used in the computation of the reserves are reflected in current period net income and can impact quarter-to-quarter net income.\nFuture policy benefits and claims also include reserves for incurred but unreported disability claims. We recognize claims costs in the period the service was provided to our policyholders. However, claims costs incurred in a particular period are not known with certainty until after we receive, process and pay the claims. We determine the amount of this liability using actuarial metho",
  "item2_clean": null
}