{
  "source_file": "pg-20250930.htm",
  "form_type": "10-Q",
  "item1_clean": null,
  "item7_clean": null,
  "item2_clean": "Management's Discussion and Analysis of Financial Condition and Results of Operations\nForward-Looking Statements\nCertain statements in this report, other than purely historical information, including estimates, projections, statements relating to our business plans, objectives and expected operating results, and the assumptions upon which those statements are based, are “forward-looking statements” within the meaning of the Private Securities Litigation Reform Act of 1995, Section 27A of the Securities Act of 1933 and Section 21E of the Securities Exchange Act of 1934. Forward-looking statements may appear throughout this report, including without limitation, in the following sections: “Management's Discussion and Analysis,” “Risk Factors” and \"Notes 4 and 9 to the Consolidated Financial Statements.\" These forward-looking statements generally are identified by the words “believe,” “project,” “expect,” “anticipate,” “estimate,” “intend,” “strategy,” “future,” “opportunity,” “plan,” “may,” “should,” “will,” “would,” “will be,” “will continue,” “will likely result” and similar expressions. Forward-looking statements are based on current expectations and assumptions, which are subject to risks and uncertainties that may cause results to differ materially from those expressed or implied in the forward-looking statements. We undertake no obligation to update or revise publicly any forward-looking statements, whether because of new information, future events or otherwise, except to the extent required by law.\nPurpose, Approach and Non-GAAP Measures\nThe purpose of Management's Discussion and Analysis (MD&A) is to provide an understanding of Procter & Gamble's financial condition, results of operations and cash flows by focusing on changes in certain key measures from year to year. The\nAmounts in millions of dollars except per share amounts or as otherwise specified.\n14 The Procter & Gamble Company\nMD&A is provided as a supplement to, and should be read in conjunction with, our Consolidated Financial Statements and accompanying Notes.\nThe MD&A is organized in the following sections:\nSummary of Results – Three Months Ended September 30, 2025\nEconomic Conditions and Uncertainties\nResults of Operations – Three Months Ended September 30, 2025\nSegment Results – Three Months Ended September 30, 2025\nLiquidity and Capital Resources\nMeasures Not Defined by U.S. GAAP\nThroughout the MD&A we refer to measures used by management to evaluate performance, including unit volume growth, net sales, net earnings, diluted net earnings per common share (diluted EPS) and operating cash flow. We also refer to a number of financial measures that are not defined under U.S. GAAP, consisting of organic sales growth, Core earnings per share (Core EPS), adjusted free cash flow and adjusted free cash flow productivity. The explanation at the end of the MD&A provides the definition of these non-GAAP measures, details on the use and the derivation of these measures, as well as reconciliations to the most directly comparable U.S. GAAP measure.\nManagement also uses certain market share and market consumption estimates to evaluate performance relative to competition despite some limitations on the availability and comparability of share and consumption information. References to market share and consumption in the MD&A are based on a combination of vendor-purchased traditional brick-and-mortar and online data in key markets as well as internal estimates. All market share references represent the percentage of sales of our products in dollar terms on a constant currency basis relative to all product sales in the category. The Company measures quarter and fiscal year to date market share through the most recent period for which market share data is available, which typically reflects a lag time of one or two months as compared to the end of the reporting period. Management also uses unit volume growth to evaluate drivers of changes in net sales. Organic volume growth reflects year-over-year changes in unit volume excluding the impacts of acquisitions and divestitures and certain one-time items, if applicable, and is used to explain changes in organic sales. In the presentation of data in tables or other charts, certain columns and rows may not add due to rounding.\nOVERVIEW\nP&G is a global leader in the fast-moving consumer goods industry, focused on providing branded consumer packaged goods of superior quality and value to our consumers around the world. Our products are sold in about 180 countries and territories, primarily through mass merchandisers, e-commerce (including social commerce) channels, grocery stores, membership club stores, drug stores, department stores, distributors, wholesalers, specialty beauty stores (including airport duty-free stores), high-frequency stores, pharmacies, electronics stores and professional channels. We also sell direct to individual consumers. We have on-the-ground operations in about 70 countries.\nOur market environment is highly competitive with global, regional and local competitors. In many of the markets and industry segments in which we sell our products, we compete against other branded products as well as retailers' private-label brands. Additionally, many of the product segments in which we compete are differentiated by price tiers (referred to as super-premium, premium, mid-tier and value-tier products). We believe we are well positioned in the industry segments and markets in which we operate, often holding a leadership or significant market share position.\n\nmonths ended September 30, 2024\nBaby, Feminine & Family Care net sales increased 1% to $5.2 billion driven by favorable foreign exchange of 1%. Unit volume was unchanged. Excluding the impacts of foreign exchange and acquisitions and divestitures, organic sales were unchanged. Global market share of the Baby, Feminine & Family Care segment decreased 0.3 points.\nBaby Care net sales increased low single digits driven by the positive impacts of favorable foreign exchange, premium product mix and an increase in unit volume. The unit volume increase was driven by Greater China and Europe (both due to distribution gains), partially offset by a unit volume decrease in North America (due to competitive activity). Organic sales increased low single digits driven by a 20% increase in Greater China and a mid-single-digit increase in Latin America, partially offset by a low single-digit decline in North America. Global market share of the Baby Care category increased 0.1 points.\nFeminine Care net sales increased low single digits driven by positive impacts of premium product mix, favorable foreign exchange and innovation-driven pricing (primarily in North America), partially offset by a unit volume decline. The unit volume decrease was driven by declines in IMEA (due to distribution losses) and Greater China (due to market contraction). Organic sales were unchanged as the impact of a low single-digit growth in North America was offset by a high single-digit decline in IMEA and a low single-digit decline in Europe. Global market share of the Feminine Care category increased 0.1 points.\nNet sales in Family Care, which is predominantly a North America business, decreased low single digits driven by lower pricing (due to merchandising investments). Unit volume was unchanged. Organic sales also decreased low single digits. North America market share of the Family Care category decreased 0.8 points.\nNet earnings increased 4% to $1.1 billion due to an increase in net sales and a 50 basis-point increase in net earnings margin. Net earnings margin increased due to a decrease in SG&A as a percentage of net sales, partially offset by an increase in the effective tax rate and a decrease in gross margin. The gross margin decrease of 10 basis points was primarily due to unfavorable category mix and higher cost of tariffs, partially offset by productivity savings and lower commodity costs. SG&A as a percentage of net sales decreased primarily due to a decrease in marketing spending. The higher effective tax rate was driven by unfavorable geographic mix.\nCorporate includes certain operating and non-operating activities not allocated to specific business segments. These include but are not limited to incidental businesses managed at the corporate level, gains and losses related to certain divested brands or businesses, impacts from various financing and investing activities, certain impacts related to employee benefits, asset impairments and restructuring activities including manufacturing and workforce optimization. Corporate also includes reconciling items to adjust the accounting policies used within the reportable segments to U.S. GAAP. The most notable ongoing reconciling item is income taxes, which adjusts the blended statutory rates that are reflected in the reportable segments to the overall Company effective tax rate.\nFor the three months ended September 30, 2025, Corporate net sales increased $79 million to $242 million due to an increase in net sales of incidental businesses managed at the corporate level. Corporate net earnings increased $743 million to $36 million for the quarter due primarily to restructuring charges related to the substantial liquidation of operations in certain Enterprise Markets, including Argentina, in the prior year period.\nLIQUIDITY & CAPITAL RESOURCES\nOperating Activities\nOperating cash flow was $5.4 billion fiscal year to date, an increase of $1.1 billion versus the prior year period. Net earnings, adjusted for non-cash items (depreciation and amortization, share-based compensation expense, deferred income taxes and gain/loss on sale of assets), generated $5.7 billion of operating cash flow. Working capital and other impacts consumed $304 million of cash in the period. Accounts receivable increased, consuming $305 million of cash, driven primarily by sales growth. Days sales outstanding were flat. Total inventories increased, consuming $303"
}