{
  "source_file": "pgr-20250930.htm",
  "form_type": "10-Q",
  "item1_clean": null,
  "item7_clean": null,
  "item2_clean": "ITEM 2. MANAGEMENT’S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS.\nI. OVERVIEW\nThe Progressive Corporation’s insurance subsidiaries recognized strong year-over-year growth in both premiums and policies in force during the third quarter 2025, compared to the same period last year, while maintaining an underwriting profit better than our 4% companywide calendar-year underwriting profit goal.\nDuring the third quarter 2025, we wrote $21.4 billion of companywide net premiums written, which was $1.9 billion, or 10%, more than we generated during the same period last year, with a 14% increase in net premiums earned. Policies in force increased 12%, or by 4.2 million policies, compared to September 30, 2024; with policies in force increasing by 0.8 million in the third quarter 2025. While experiencing this strong growth during the third quarter 2025, we also maintained strong profitability, with an underwriting profit margin of 10.5%.\nOur Personal Lines segment experienced year-over-year growth for the third quarter 2025, with net premiums written increasing 12% and policies in force up 13%, over the significant growth of 28% in net premiums written and 15% in policies in force we experienced in the third quarter last year. This growth was primarily driven by our personal auto products and reflects renewal application growth, driven by new applications gained over the last year renewing during the quarter.\nIn Commercial Lines, we experienced a decrease in net premiums written of 6% for the third quarter 2025, compared to the same period last year, despite experiencing policies in force growth of 6%. The decline in net premiums written was primarily driven by a decrease in transportation network company (TNC) premiums, due to decreases in projected mileage, which is the basis for computing premiums, during the third quarter 2025, compared to increases in projected mileage during the third quarter 2024. To a lesser extent, the net premiums written decline was due to a shift to a greater mix of policies with 6-month terms in our contractor and business auto business market targets (BMT), which have about half the amount of net premiums written as 12-month policies, and to a mix shift to lower average written premium BMTs in our core commercial auto business (which excludes our TNC business, our Progressive Fleet & Specialty Programs (Fleet & Specialty) products, and our business owners’ policy (BOP) product). On a year-to-date basis for the period ended September 30, 2025, net premiums written in our TNC business were flat compared to the same period last year. Excluding TNC, Commercial Lines net premiums written would have decreased 2% for the third quarter 2025, compared to the same period last year.\nDuring the third quarter 2025, on a countrywide basis, we increased personal auto rates less than 1% and increased our personal property rates about 2%, in the aggregate. In our core commercial auto business, we increased rates about 2% in the aggregate during the third quarter 2025.\nWhile we currently continue to believe we are adequately priced in our personal auto products in most states, starting in the first quarter 2025, the U.S. government announced additional tariffs on goods imported into the U.S. from numerous countries, which have, in response, resulted in additional tariffs against the U.S. We regularly model the potential impact tariffs could have on vehicle loss costs, the supply chain, the availability of parts, and general inflation, among other factors, although the dynamic international trade environment currently prevents us from accurately predicting how tariffs will ultimately impact our business over time. While our focus has been on trying to maintain stable rates for customers, effective tariffs and other retaliatory actions will likely result in higher loss costs, which could result in a reduction in profitability and the possible need for higher than currently anticipated rate increases throughout 2025 and 2026. While we expect to continue increasing rates in our personal property and core commercial auto products through the remainder of 2025, we will continue to monitor the impact from tariffs and other potential changes in the regulatory environment as we evaluate the possible need for additional rate increases.\nFor the third quarter 2025, the $281 million year-over-year increase in net income primarily reflected an almost even increase in both underwriting income and total net investment income, while total comprehensive income decreased $996 million, primarily related to lower net unrealized gains on our fixed-maturity securities in the third quarter 2025. Included in underwriting income for the third quarter 2025 was a $950 million policyholder credit expense related to excess profits earned in Florida.\nSince Florida insurance reform was enacted in early 2023, we have seen lower loss costs on certain types of personal auto accident claims and favorable reserve development, and we have experienced strong profitability in our Florida personal auto business. Despite actions to lower rates in the last year, it is probable that our personal auto profit in Florida for the 2023 to 2025 period will exceed the statutory profit limit that a Florida statute imposes on the profit that any insurance group can earn on personal auto insurance over any three-calendar-year period. In such event, we would need to credit any profit above the limit to all Florida personal auto policyholders active at December 31, 2025. As a result, in September 2025, we recorded a $950 million policyholder credit expense, which represents our current estimate of the profit we will earn on the three-calendar-year period ending December 31, 2025, in excess\nof the permitted profit limit. This liability will continue to be refined through the fourth quarter 2025. See\nfor further information.\nAt September 30, 2025, total capital (debt plus shareholders’ equity) was $42.3 billion, which was an increase of $9.9 billion from year-end 2024, primarily driven by the $10.0 billion of comprehensive income earned in the first nine months of 2025.\nA. Insurance Operations\nOur companywide underwriting profit margin was 10.5% during the third quarter 2025, compared to 11.0% during the third quarter 2024. For the third quarter 2025, our loss and loss adjustment expense (LAE) ratio decreased 3.7 points, and our underwriting expense ratio increased 4.2 points, compared to the same period last year. The decrease in the loss and LAE ratio was primarily driven by a decrease in catastrophe losses and by favorable prior accident years reserve development in both Personal Lines and Commercial Lines. The increase in the underwriting expense ratio was primarily driven by the Florida personal auto excess profit policyholder credit, previously discussed, adding 4.6 points to the companywide ratio. Our Personal Lines and Commercial Lines operating segments both generated strong profitability for the third quarter 2025, with margins of 10.5% and 10.8%, respectively. Excluding the Florida personal auto excess profit policyholder credit, the Personal Lines underwriting margin would have been 15.8%.\nWe closely manage our expenses, monitoring both acquisition expenses and non-acquisition expenses, which we view as an important measure of operational efficiency as we seek to deliver our most competitive rates to consumers. We will continue to advertise to maximize growth as long as the advertising spend is efficient and we remain on track to achieve our calendar-year profitability goal. During the third quarter 2025, our advertising spend was $1.3 billion, which was 10% greater than the third quarter last year, although, due to the growth in net premiums earned, advertising spend contributed 0.2 less points to the underwriting expense ratio in the third quarter 2025, compared to the same period last year.\nOur Personal Lines segment is comprised of our personal vehicle and property products. Personal Lines vehicles include both personal auto and special lines products, with the latter typically having higher losses during the warmer weather months, due to the seasonal nature of these products (e.g., recreational vehicles, such as motorcycles, RVs, and watercraft). Our Personal Lines underwriting margin for the third quarter 2025 was 10.5%, with personal vehicle and property products reporting 9.3% and 36.5%, respectively, with Florida excess profit credits reducing the personal vehicles margin by 5.5%. Profitability in our special lines products had minimal impact to our personal vehicle combined ratio during the third quarter 2025. The substantially high underwriting profit margin in our personal property products was primarily driven by\nfavorable development on prior accident year losses and the low level of incurred catastrophe losses during the period.\nOur Commercial Lines segment includes our core commercial auto products, TNC business, Fleet & Specialty products, and BOP product. Our total Commercial Lines underwriting profitability for the third quarter 2025 was 10.8%.\nFor the third quarter 2025, Personal Lines generated strong net premiums written growth of 12%, with the agency and direct personal vehicle businesses and property business growing 9%, 15%, and 5%, respectively, compared to the same period last year. Commercial Lines net premiums written decreased 6% year over year.\nChanges in net premiums written are a function of new business applications (i.e., policies sold), business mix, premium per policy, and retention.\nRelative to the significant growth we experienced in our personal vehicle products during the third quarter 2024, we experienced a small decrease in total Personal Lines new business applications during the third quarter 2025. Total Personal Lines renewal business applications increased substantially, primarily driven by the significant new business application growth experienced in our personal vehicle produ"
}