{
  "source_file": "pgr-20241231.htm",
  "form_type": "10-K",
  "item1_clean": "ITEM 1. BUSINESS\nGeneral Development of Business\nThe Progressive Corporation, an insurance holding company, has insurance and non-insurance subsidiaries and affiliates (references in this Item to subsidiaries includes affiliates as well). Our insurance subsidiaries write personal and commercial auto insurance, personal residential property insurance, and insurance for motorcycles, watercraft, and other recreational vehicles. We also offer business-related general liability and commercial property insurance predominantly for small businesses, workers’ compensation insurance primarily for the transportation industry, and other specialty property-casualty insurance and provide related services. Our non-insurance subsidiaries generally support our insurance and investment operations. We operate throughout the United States. Unless noted, references to “state(s)” throughout this report include the District of Columbia. The Progressive Corporation, together with its insurance and non-insurance subsidiaries and affiliates, comprise what we refer to as Progressive.\nProgressive’s vision is to become consumers’, agents’, and business owners’ number one destination for insurance and other financial needs. Progressive’s four strategic pillars of people and culture, broad needs of our customers, leading brand, and competitive prices serve as the foundation of how we will achieve our vision.\nDescription of Business\nOur Chief Executive Officer (CEO) assesses performance and makes key operating decisions for our insurance, investment, and service operations and is supported by the following management team that oversees the business and corporate functions that support all areas of our organization.\nChief Executive Officer\nChief Financial Officer\nPersonal Lines President\nChief Investment Officer\nCommercial Lines President\nChief Human Resources Officer\nChief Information Officer\nCustomer Relationship Management President\nChief Marketing Officer\nChief Strategy Officer\nOur insurance and claims organizations are generally managed on a state-by-state basis due to the nature of insurance, legal and regulatory requirements, and other local factors, and are supplemented by national operations and supported by our corporate functions. State-specific organizations typically report to a regional general manager, who then reports to the applicable group president. In California, we operate a separate agency auto organization with its own management and customer relationship management organization.\nOur Personal Lines operating segment writes insurance for personal autos and special lines products (e.g., recreational vehicles, such as motorcycles, RVs, and watercraft), collectively referred to as our personal vehicle business, and, beginning in the fourth quarter 2024, personal residential property insurance for homeowners and renters. The Personal Lines segment accounted for 85% of our total net premiums written in 2024, 84% in 2023, and 82% in 2022.\nOur personal vehicle business generally offers more than one program in a single state, with each program targeted to a specific distribution channel, market, or customer group. As of December 31, 2024, our personal vehicle products represented 95% of our total Personal Lines net premiums written, and 94% at the end of both 2023 and 2022. We write our personal vehicle insurance in all states, however, our special lines products are not written in the District of Columbia.\nPersonal auto insurance represented 95% of our total personal vehicle net premiums written in 2024, and 94% in both 2023 and 2022. We ranked second in market share in the U.S. private passenger auto insurance market, based on 2023 premiums written, and we believe we continue to hold that position for 2024. There are approximately 240 competitors in this market. Progressive and the other leading 15 private passenger auto insurers, each of which writes over $2.5 billion of premiums annually, comprise about 85% of this market. All industry data, including ranking and market share, based on premiums written, has been obtained directly from data reported by either SNL Financial or A.M. Best Company, Inc. (A.M. Best), or was estimated using A.M. Best data as the primary source.\nSpecial lines products represented the remaining personal vehicle net premiums written for the years mentioned above. Due to the seasonal nature of these products, we typically experience higher losses during the warmer weather months. Our competitors are specialty companies and large multi-line insurance carriers. Although industry figures are not available, based on our analysis of this market, we believe that we are the market share leader for both the motorcycle and boat products and that we are one of the largest providers of RV insurance.\nIn addition to writing residential property insurance for homeowners and renters, in virtually all states, our personal property business offers insurance for manufactured homes, personal umbrella insurance, and primary and excess flood insurance. We also act as a participant in the “Write Your Own” program for the National Flood Insurance Program (NFIP) under which we write flood insurance in virtually all states; 100% of this business is reinsured with the NFIP.\nOur personal property business represented 5% of our total Personal Lines net premiums written in 2024, and 6% in both 2023 and 2022, with about 95% of the total personal property net premiums written attributable to the homeowners and renters products. We were the eleventh largest homeowners carrier in the U.S., based on 2023 premiums written, and we are currently unable to determine if we will hold that ranking for 2024. There are approximately 360 competitors in the homeowners insurance market nationwide and we compete with many of these companies. Progressive and the other leading 30 large companies/groups, each with over $800 million of premiums written annually, comprise about 80% of the market.\nWe tend to see more personal property business written during the second and third quarters of the year based on the cyclical nature of property sales. Losses also tend to be higher during the warmer weather months when storms are more prevalent. As a property insurer, we have exposure to losses from catastrophes, including hurricanes, and other severe weather events. See\nItem 1A, Risk Factors – II. Insurance Risks\nbelow for more information. To help mitigate these risks, we enter into reinsurance arrangements. See the “Reinsurance” section below for further discussion of our reinsurance programs.\nOur Personal Lines strategy is to be a competitively priced provider of a broad range of personal auto, special lines, and personal property insurance products with distinctive service, distributed through whichever channel the customer prefers, and bundled with other products when appropriate to match our customers’ needs. Volume potential is driven by our price competitiveness, the actions of our competitors, brand recognition, and quality service delivered through our dedicated employees who embody the Progressive culture, among other factors. See “Competitive Factors” below for further discussion.\nOur Personal Lines products are sold through both the agency and direct channels.\nAgency Distribution Channel\nThe agency personal vehicle business includes business written by our network of more tha\nindependent insurance agencies located throughout the U.S., including brokerages in New York and California. T\nhese independent insurance agents and brokers have the ability to place business with Progressive for specified insurance coverages within prescribed underwriting guidelines, subject to compliance with our mandated procedures. The agents and brokers do not have authority to establish underwriting guidelines, develop rates, settle or adjust claims, or enter into other transactions or commitments. The agency personal vehicle business also writes insurance through strategic alliance business relationships with other insurance companies, financial institutions, and national agencies. The total personal vehicle net premiums written through the agency channel represented 45% of our total personal vehicle volume in 2024, 46% in 2023, and 47% in 2022.\nOur personal property business is primarily written through the independent agency channel and through select agents under our Platinum program as part of our Destination Era strategy, discussed below. The total personal property net premiums written through the agency channel represented 74% of our total personal property volume in 2024, 77% in 2023, and 75% in 2022.\nDirect Distribution Channel\nThe direct vehicle business includes business written directly by us online and over the phone. The total net premiums written by the direct vehicle business represented 55% of our total personal vehicle volume in 2024, 54% in 2023, and 53% in 2022.\nOur direct personal property business is written by us over the phone and through HomeQuote Explorer\n(HQX), our multi-carrier, direct-to-consumers online personal property offering. The HQX online buy button is available in almost every state. In addition to being able to quote and purchase our personal property products on HQX, consumers are able to quickly and easily compare homeowners insurance online from Progressive and other carriers. The total net premiums written by the direct personal property business represented 26% of our total personal property volume in 2024, 23% in 2023, and 25% in 2022.\nWe continue to provide personal auto customers in both the agency and direct channels the opportunity to improve their auto insurance rates based on their personal driving behavior through Snapshot\n, our usage-based insurance (UBI) program. We offer Snapshot through our hardware-based and/or mobile-app versions in all states, other than California. We believe this mobile app improves the user experience. In addition to the personal benefits for our customers, the data collected via the mobile app affords us a unique perspective on vehicle operations, accidents, and mobile device usage. Our updated personal auto product models, discussed below, often also include Snapshot enhancements intended to improve its accuracy and competitiveness and broaden its applicability.\nWe seek to refine our product segmentation, underwriting models, and pricing over time, and we regularly elevate new product models. At any one time, we could have multiple product models in the marketplace, as new versions are rolled out on a state-by-state basis. Such new product models generally introduce new risk variables intended to improve the accuracy of matching rate to risk, increase our competitiveness, and/or make our products more attractive to specific market segments, among other enhancements.\nIn January 2024, we started rolling out our latest personal auto product offering, model 8.9, which contains new and expanded usage of external data and new coverage features. With the 8.9 model, we first introduced Progressive vehicle protection, a new car mechanical breakdown coverage that a customer can add to their Progressive personal auto insurance, for eligible vehicles, to help manage the cost of unforeseen vehicle repairs. As of December 31, 2024, 17 states, that represented about 40% of both companywide personal auto premiums and total personal auto policies in force, are on model 8.9 and, overall, we are seeing favorable conversion results with preferred business showing the most promising elasticities. Our 9.0 model is currently in execution planning, and we expect the first state to elevate in mid-2025. Design work on the 9.1 model is underway and being finalized.\nDuring the fourth quarter 2024, we elevated our newest special lines product model (R17) in its first state, which continues to expand segmentation and acceptability. We will continue to roll out this product model during 2025.\nWe continued to advance our personal property product segmentation, pricing, and risk ",
  "item7_clean": null,
  "item2_clean": null
}