{
  "source_file": "ph-20250630.htm",
  "form_type": "10-K",
  "item1_clean": "ITEM 1\nParker is a global leader in motion and control technologies. Leveraging a unique combination of interconnected technologies, we design, manufacture, and provide aftermarket support for highly engineered solutions that create value for customers primarily in aerospace & defense, in-plant & industrial equipment, transportation, off-highway, energy, and HVAC & refrigeration markets around the world.\nParker values having a decentralized operating structure that fosters deeper connections with our customers and greater engagement among our team members. To align our operations and achieve our goal of top quartile performance, we deploy our business system, The Win Strategy\nTM\n, which establishes goals and strategies for engaged people, customer experience, profitable growth and financial performance. Underpinning this business system is our culture of safety, collaboration, continuous improvement, and team-based problem solving. Together our goals, strategies, and culture help us to fulfill our purpose: Enabling Engineering Breakthroughs that Lead to a Better Tomorrow. We credit the Win Strategy with leading Parker through a period of sustained operational excellence and transformation and believe it is the foundation for achieving our future goals.\nOur investor relations website address is\ninvestors.parker.com\nOur Board of Directors has adopted a written charter for each of its committees. These charters, as well as our Global Code of Business Conduct, Corporate Governance Guidelines and Independence Standards for Directors, are posted and available on our investor relations website under the Governance page. Shareholders may request copies of these corporate governance documents, free of charge, by writing to our principal executive offices located at Parker-Hannifin Corporation, 6035 Parkland Boulevard, Cleveland, Ohio 44124-4141, Attention: Secretary, or by calling (216) 896-3000.\nOur interconnected technologies and solutions provide value for customers across our market verticals including aerospace & defense, in-plant & industrial equipment, transportation, off-highway, energy, and HVAC and refrigeration. We serve several hundred thousand OEM and distribution customer locations.\nWe have two reportable segments: Diversified Industrial and Aerospace Systems. Of the Company's $19.9 billion in net sales for fiscal year 2025, Diversified Industrial Segment products accounted for 69 percent and Aerospace Systems Segment products accounted for 31 percent.\nDiversified Industrial Segment\nOur Diversified Industrial Segment, which is an aggregation of several business units, sells highly engineered differentiated products to both original equipment manufacturers (\"OEMs\") and distributors who serve the aftermarket replacement markets. The major market verticals served by our Diversified Industrial Segment are listed below:\nIn-plant & Industrial Equipment\nHVAC & Refrigeration\nAerospace Systems Segment\nOur Aerospace Systems Segment sells highly engineered, differentiated airframe and engine components and systems to OEMs and aftermarket parts and maintenance directly to end users primarily in the commercial aerospace and defense market verticals. The major market platforms served by our Aerospace Systems Segment are listed below:\nCommercial Transport\nPrincipal Products and Methods of Distribution\nWe offer hundreds of thousands of individual part numbers, and no single product contributed more than one percent to our total net sales for the year ended June 30, 2025. Listed below are some of our principal products.\nDiversified Industrial Segment\nOur Diversified Industrial Segment products consist of a broad range of motion-control systems and components, which are described below:\nActive & Passive Vibration Control\nHigh Temperature Sealing\nCryogenic Valves & Fittings\nHVAC/R Controls & Monitoring\nElastomeric, Fabric Reinforced, Metal, & Precision Cut Seals\nHydrogen & Natural Gas Filters\nElectric & Hydraulic Pumps & Motors\nIndustrial Air & Gas Filtration\nElectric & Hydraulic Valves\nMiniature Pumps & Valves\nElectromagnetic Interface Shielding\nPneumatic Actuators, Regulators & Valves\nElectromechanical & Hydraulic Actuators\nElectronics, Drives & Controllers\nProcess Filtration Solutions\nEngine Filtration Solutions\nRubber to Substrate Adhesives\nFluid Condition Monitoring\nSensors & Diagnostics\nFluid Conveyance Hose & Tubing\nStructural Adhesives\nHigh Pressure Connectors, Fittings, Valves & Regulators\nHigh Purity Fittings, Valves & Regulators\nDiversified Industrial Segment products include standard products, as well as custom products which are engineered and produced to OEM specifications for application to particular end products. Standard and custom products are also used in the replacement of original products. We market our Diversified Industrial Segment products primarily through field sales employees and independent distributors located throughout the world.\nAerospace Systems Segment\nOur Aerospace Systems Segment products are used in commercial and defense airframe and engine programs and include:\nFuel Systems & Components\nElectric & Hydraulic Braking Systems\nFuel Tank Inerting Systems\nHydraulic Pumps & Motors\nElectromechanical Actuators\nHydraulic Valves & Actuators\nEngine Exhaust Systems & Components\nFire Detection & Suppression\nFlight Control Systems\nWe market our Aerospace Systems Segment products through our regional sales organizations, which sell directly to OEMs and end users throughout the world.\nParker operates in highly competitive markets and industries. We offer our products over numerous, varied markets through our divisions operating in 43 countries. Our global scope means that we have hundreds of competitors across our various markets and product offerings. Our competitors include U.S. and non-U.S. companies. These competitors and the degree of competition vary widely by product lines, end markets, geographic scope and/or geographic locations. Although each of our segments has numerous competitors, given our market and product breadth, no single competitor competes with the Company with respect to all the products we manufacture and sell.\nIn the Diversified Industrial Segment, Parker competes based on product quality and innovation, customer experience, manufacturing and distribution capability, aftermarket support, and price competitiveness. We believe that we are one of the market leaders in most of the major markets for our most significant Diversified Industrial Segment products. We have comprehensive motion and control technologies allowing us to provide the broadest systems capabilities. While our primary global competitors include Bosch Rexroth AG, Danaher Corporation, Danfoss A/S, Donaldson Company, Inc., Emerson Climate Technologies, Inc., Emerson/ASCO, Festo AG & Co., Freudenberg-NOK, Gates Corporation, IMI/Norgren, SMC Corporation, Swagelok Company, and Trelleborg AB, none of these businesses compete with every group or product in our Diversified Industrial Segment.\nIn the Aerospace Systems Segment, we have developed relationships with key customers based on our advanced technological and engineering capabilities, performance in quality, delivery, service, and price competitiveness. This has enabled us to obtain significant original equipment business on new aircraft programs for our systems and components, as well as the follow-on repair and replacement business for these programs. Further, the Aerospace Systems Segment utilizes design and manufacturing techniques as well as best cost region and supply chain management strategies to reduce cost. Although we believe that we are one of the market leaders in most of the major markets for our most significant Aerospace Systems Segment products, primary global competitors for these products include Crane Co., Eaton Corporation plc, Honeywell International, Inc., Moog Inc., RTX Corporation, Safran S.A., Senior plc, Triumph Group, Inc., and Woodward, Inc.\nAcross our two segments, we believe that our broad-based portfolio of core technologies, which consist of hydraulics, pneumatics, electromechanical, filtration, fluid & gas handling, process control, engineered materials, and climate control, is a positive factor in our ability to compete effectively with both large and small competitors. We believe that the following factors also contribute to our ability to compete effectively:\nOur business system, The Win Strategy\nTechnology powerhouse of interconnected solutions\nDeep partnerships with our customers to develop innovative products\nApplication engineering expertise\nGlobal distribution network\nDecentralized operating structure\nPatents, Trademarks, Trade Names, Copyrights, Trade Secrets, Licenses\nWe own a number of patents, trademarks, trade names, copyrights, trade secrets and licenses related to our products. We also have exclusive and non-exclusive rights to use patents, trademarks, trade names, copyrights and trade secrets owned by others. In addition, patent and trademark applications are pending, although there can be no assurance that further patents and trademarks will be issued. We do not depend on any single patent, trademark, copyright, trade secret or license or group of patents, trademarks, copyrights, trade secrets or licenses to any material extent.\nBacklog and Seasonal Nature of Business\nEnvironmental Regulation\nCertain of our operations require the use and handling of hazardous materials and, as a result, the Company is subject to United States federal, state, and local laws and regulations as well as non-U.S. laws and regulations designed to protect the\nenvironment and regulate the discharge of materials into the environment. These laws impose penalties, fines and other sanctions for non-compliance and liability for response costs, property damage and personal injury resulting from past and current spills, disposals or other releases of, or exposures to, hazardous materials. Among other environmental laws, we are subject to the United States federal \"Superfund\" law, under which we have been designated as a \"potentially responsible party\" and may be liable for cleanup costs associated with various waste sites, some of which are on the United States Environmental Protection Agency’s Superfund priority list.\nAs of June 30, 2025, Parker was involved in environmental remediation and litigation at various U.S. and non-U.S. manufacturing facilities presently or formerly operated by us and as a \"potentially responsible party,\" along with other companies, at off-site waste disposal facilities and regional sites.\nWe believe that our policies, practices and procedures are properly designed to prevent unreasonable risk of environmental damage and the consequent financial liability to the Company. Compliance with environmental laws and regulations requires continuing management efforts and expenditures by the Company. Compliance with environmental laws and regulations has not had in the past, and, we believe, will not have in the future, a material adverse effect on our capital expenditures, earnings, or competitive position.\nGovernment Regulation\nIn addition to the environmental regulations discussed above, we are subject to various federal, state, local, and foreign government regulations relating to the development, manufacture, marketing, sale and distribution of our products and services in the countries where we conduct business. Compliance with these laws and regulations often requires the dedication of time and effort of our team members, as well as financial resources. Additional information about the impact of government regulations on our business is included in “Item 1A. Risk Factors.”\nEnergy Matters and Sources and Availability of Raw Materials\nOur primary energy source for both of our business segments is electric power. While we cannot predict future costs of electric power, we manage this cost through aggregation in deregulated markets and leveraging contracts with established pricing on p",
  "item7_clean": "and Long-Lived Assets\n- We test goodwill for impairment at the reporting unit level on an annual basis and between annual tests whenever events or circumstances indicate the carrying value of a reporting unit may exceed its fair value. Our five reporting units are equivalent to our operating segments. As quoted market prices are not available for our reporting units, determining whether an impairment occurred requires the valuation of the respective reporting unit, which is estimated using both income-based and market-based valuation methods. The income-based valuation method utilizes a discounted cash flow model which requires several assumptions, including future sales growth and operating margin levels as well as assumptions regarding future industry-specific market conditions. Each reporting unit regularly prepares discrete operating forecasts and uses these forecasts as the basis for the assumptions in the discounted cash flow analysis. Within the discounted cash flow models, the Company uses a discount rate, commensurate with its cost of capital but adjusted for inherent business risks, and an appropriate terminal growth factor. The market-based valuation performed for each reporting unit includes an analysis consisting of market-adjusted multiples based on key data points for guideline public companies. We also reconcile the estimated aggregate fair value of our reporting units resulting from these procedures to our overall market capitalization.\nThe Company performed its fiscal 2025 annual goodwill impairment test as of January 1 for each of its five reporting units. The results of this test indicated the fair value substantially exceeded carrying value for all reporting units. We continually monitor our reporting units for impairment indicators and update assumptions used in the most recent calculation of a reporting unit's fair value as appropriate.\nLong-lived assets held for use, which primarily includes finite-lived intangible assets and property, plant and equipment, are evaluated for impairment whenever events or circumstances indicate that the undiscounted net cash flows to be generated by their use over their expected useful lives and eventual disposition are less than their carrying value. The long-term nature of these assets requires the estimation of their cash inflows and outflows several years into the future and only takes into consideration technological advances known at the time of the impairment test. During 2025, the Company did not record any material impairments related to long-lived assets.\n- The annual net periodic expense and benefit obligations related to the Company's defined benefit plans are determined on an actuarial basis. This determination requires critical assumptions regarding the discount rate, long-term rate of return on plan assets, increases in compensation levels and amortization periods for actuarial gains and losses. Assumptions are determined based on Company data and appropriate market indicators and are evaluated each year as of the plans' measurement\ndate. Changes in the assumptions or actual experience that differs from the assumptions could result in a material change in the annual net periodic expense and benefit obligations reported in the financial statements.\nFor the Company's domestic qualified defined benefit plan, our largest plan, a 50 basis point change in the assumed long-term rate of return on plan assets is estimated to have an $17 million effect on annual pension expense and a 50 basis point decrease in the discount rate is estimated to increase annual pension expense by $3 million.\nBusiness Combinations\n- From time to time, we may enter into business combinations. Business acquisitions are accounted for using the acquisition method of accounting, which allocates the fair value of the purchase consideration to the tangible and intangible assets acquired and liabilities assumed based on their estimated fair values. In the fair value evaluation of intangible assets acquired, there are significant estimates and assumptions, including forecasts of future cash flows, revenues; and earnings before interest, taxes, depreciation and amortization; as well as the selection of the royalty rates and discount rates. The excess of the purchase consideration over the fair values of these identifiable assets and liabilities is recorded as goodwill. The acquisition method of accounting also requires us to refine these estimates over a measurement period not to exceed one year to reflect new information obtained about facts and circumstances that existed as of the acquisition date that, if known, would have affected the measurement of the amounts recognized as of that date. If we are required to adjust provisional amounts that we have recorded for the fair values of assets and liabilities in connection with acquisitions, these adjustments could have a material impact on our financial condition and results of operations.\n- The Company has a number of loss exposures incurred in the ordinary course of business such as environmental claims, product liability and litigation reserves. Establishing loss accruals for these matters requires management's estimate and judgment with regards to risk exposure and ultimate liability or realization. We review these loss accruals periodically and make adjustments to reflect the most recent facts and circumstances.\nRECENTLY ISSUED ACCOUNTING PRONOUNCEMENTS\n\nITEM 7\nManagement’s Discussion and Analysis of Financial Condition and Results of Operations.\nForward-Looking Statements\nForward-looking statements contained in this and other written and oral reports are made based on known events and circumstances at the time of release, and as such, are subject in the future to unforeseen uncertainties and risks. Often but not always, these statements may be identified from the use of forward-looking terminology such as \"anticipates,\" \"believes,\" \"may,\" \"should,\" \"could,\" \"expects,\" \"targets,\" \"is likely,\" \"will,\" or the negative of these terms and similar expressions, and include all statements regarding future performance, orders, earnings projections, events or developments. Neither Parker nor any of its respective associates or directors, officers or advisers provides any representation, assurance or guarantee that the occurrence of the events expressed or implied in any forward-looking statements will actually occur. Parker cautions readers not to place undue reliance on these statements. It is possible that the future performance may differ materially from past performance or current expectations. A change in the economic conditions in individual markets may have a particularly volatile effect on segment performance.\nAmong other factors which may affect future performance are:\nchanges in business relationships with and orders by or from major customers, suppliers or distributors, including delays or cancellations in shipments;\ndisputes regarding contract terms, changes in contract costs and revenue estimates for new development programs;\nchanges in product mix;\nability to identify acceptable strategic acquisition targets;\nuncertainties surrounding timing, successful completion or integration of acquisitions and similar transactions, including the acquisition of Curtis Instruments, Inc.;\nability to successfully divest businesses planned for divestiture and realize the anticipated benefits of such divestitures;\nthe determination and ability to successfully undertake business realignment activities and the expected costs, including cost savings, thereof;\nability to implement successfully business and operating initiatives, including the timing, price and execution of share repurchases and other capital initiatives;\navailability, cost increases of or other limitations on our access to raw materials, component products and/or commodities if associated costs cannot be recovered in product pricing;\nability to manage costs related to insurance and employee retirement and health care benefits;\nlegal and regulatory developments and other government actions, including related to environmental protection, and associated compliance costs; supply chain and labor disruptions, including as a result of tariffs and labor shortages;\nthreats associated with international conflicts and cybersecurity risks and risks associated with protecting our intellectual property;\nuncertainties surrounding the ultimate resolution of outstanding legal proceedings, including the outcome of any appeals;\neffects on market conditions, including sales and pricing, resulting from global reactions to U.S. trade policies;\nmanufacturing activity, air travel trends, currency exchange rates, difficulties entering new markets and economic conditions such as inflation, deflation, interest rates and credit availability; inability to obtain, or meet conditions imposed for, required governmental and regulatory approvals;\nchanges in the tax laws in the United States and foreign jurisdictions and judicial or regulatory interpretations thereof; and\nlarge scale disasters, such as floods, earthquakes, hurricanes, industrial accidents and pandemics.\nThe Company is a global leader in motion and control technologies. Leveraging a unique combination of interconnected technologies, we design, manufacture, and provide aftermarket support for highly engineered solutions that create value for customers primarily in aerospace and defense, in-plant and industrial equipment, transportation, off-highway, energy, and HVAC and refrigeration markets around the world.\nBy aligning around our purpose, Enabling Engineering Breakthroughs that Lead to a Better Tomorrow, Parker is better positioned for the challenges and opportunities of tomorrow.\nThe Win Strategy 3.0 is Parker's business system which defines the goals and initiatives that create responsible, sustainable growth and enable Parker's long-term success. It works with our purpose, which is a foundational element of The Win Strategy, to engage team members and create responsible and sustainable growth. Our shared values shape our culture and our interactions with stakeholders and the communities in which we operate and live.\nWe believe many opportunities for profitable growth are available. The Company intends to focus primarily on business opportunities in the areas of aerospace & defense, in-plant & industrial equipment, transportation, off-highway, energy, and HVAC and refrigeration. We believe we can meet our strategic objectives by:\nserving the customer and continuously enhancing its experience with the Company;\nsuccessfully executing The Win Strategy initiatives relating to engaged people, premier customer experience, profitable growth and financial performance;\nmaintaining a decentralized division and sales company structure;\nfostering a safety-first and entrepreneurial culture;\nengineering innovative systems and products to provide superior customer value through improved service, efficiency and productivity;\ndelivering products, systems and services that have demonstrable savings to customers and are priced by the value they deliver;\nenabling a sustainable future by providing innovative clean technology solutions that offer a positive, global environmental impact and operating responsibly by reducing our energy use and emissions;\nacquiring strategic businesses;\norganizing around targeted regions, technologies and markets;\ndriving efficiency by implementing lean enterprise principles; and\ncreating a culture of empowerment through our values, inclusion and diversity, accountability and teamwork.\nWe manage our supply chain through our \"local for local\" manufacturing strategy, ongoing supplier management process, and broadened supply base. We actively monitor global trade policies and inflation, managing their impact through a variety of cost and pricing measures. In addition, continuous improvement and lean initiatives, along with disciplined workforce and discretionary spending management, further enhance our ability to mitigate these impacts. At the same time, we are appropriately addressing the ongoing needs of our business so that we continue to serve our customers.\nOver the long term, the extent to which our business and results of operations will be impacted by global economic and political uncertainty, geopolitical risks and public health crises depends on future developments that remain uncertain. We will continue to monitor the global environment and manage our business with the goal to minimize unfavorable impacts on operations and financial results.\nCONSOLIDATED STATEMENT OF INCOME\nThe Consolidated Statement of Income summarizes the Company's operating performance. The discussion below compares the operating performance in 2025 and 2024.\n(dollars in millions)\n\nin 2025 decreased from the 2024 amount due to lower sales in the Diversified Industrial Segment, partially offset by higher sales in the Aerospace Systems Segment resulting from strength across commercial and defense markets. Within the Diversified Industrial Segment, the impact of divestiture activity decreased sales by approximately $295 million in 2025. The effect of currency exchange rates decreased net sales in 2025 by approximately $41 million, which is primarily attributable to the Diversified Industrial Segment.\n(calculated as net sales less cost of sales, divided by net sales) increased in 2025 primarily due to higher margins in both segments resulting from price increases, favorable product mix, cost containment and continued execution of the Win Strategy.\nCost of sales also included business realignment and acquisition integration charges of $31 million and $34 million in 2025 and 2024, respectively.\nSelling, general and administrative expenses\ndecreased in 2025 compared to 2024 primarily due to benefits from prior-year restructuring and acquisition-integration activities, lower research and development expenses and cost containment initiatives.\nSelling, general and administrative expenses also included business realignment and acquisition integration charges of $45 million and $55 million in 2025 and 2024, respectively.\nin 2025 decreased compared to 2024 primarily due to lower average debt outstanding.\nOther (income) expense, net\nincluded the following:\n(dollars in millions)\nForeign currency transaction loss (gain)\n\nAerospace Systems Segment sales increased compared to prior-year due to higher volume across all market segments, especially the commercial and defense aftermarkets.\nAerospace Systems Segment operating margin increased in 2025 primarily due to higher sales volume and favorable aftermarket mix, as well as benefits from cost containment initiatives and prior-year acquisition integration activities.\nBusiness Realignment\nWithin the Aerospace Systems Segment, we incurred acquisition integration and business realignment charges of $19 million and $34 million in 2025 and 2024, respectively. We do not expect to incur significant business realignment and acquisition integration charges in 2026. However, continually changing business conditions could impact the ultimate costs we incur.\nAerospace Systems Segment backlog increased in 2025 primarily due to orders exceeding shipments in the commercial and defense OEM market segments.\nBacklog consists of written firm orders from a customer to deliver products and, in the case of blanket purchase orders, only includes the portion of the order for which a schedule or release date has been agreed to with the customer. The dollar value of backlog is equal to the amount that is expected to be billed to the customer and reported as a sale.\nCorporate general and administrative expenses\n(dollars in millions)\nCorporate general and administrative expense\n\nThe Diversified Industrial Segment operations experienced the following percentage changes in net sales:\nNorth America businesses – as reported\nNorth America businesses – without divestitures and currency\nInternational businesses – as reported\nInternational ",
  "item2_clean": null
}