{
  "source_file": "ph-20250930.htm",
  "form_type": "10-Q",
  "item1_clean": null,
  "item7_clean": null,
  "item2_clean": "A change in the economic conditions in individual markets may have a particularly volatile effect on segment performance.\nAmong other factors which may affect future performance are:\nchanges in business relationships with and orders by or from major customers, suppliers or distributors, including delays or cancellations in shipments;\ndisputes regarding contract terms, changes in contract costs and revenue estimates for new development programs;\nchanges in product mix;\nability to identify acceptable strategic acquisition targets;\nuncertainties surrounding timing, successful completion or integration of acquisitions and similar transactions; including the integration of Curtis Instruments, Inc.;\nability to successfully divest businesses planned for divestiture and realize the anticipated benefits of such divestitures;\nthe determination and ability to successfully undertake business realignment activities and the expected costs, including cost savings, thereof;\nability to implement successfully business and operating initiatives, including the timing, price and execution of share repurchases and other capital initiatives;\navailability, cost increases of or other limitations on our access to raw materials, component products and/or commodities if associated costs cannot be recovered in product pricing;\nability to manage costs related to insurance and employee retirement and health care benefits;\nlegal and regulatory developments and other government actions, including related to environmental protection, and associated compliance costs;\nsupply chain and labor disruptions, including as a result of tariffs and labor shortages;\nthreats associated with international conflicts and cybersecurity risks and risks associated with protecting our intellectual property;\nuncertainties surrounding the ultimate resolution of outstanding legal proceedings, including the outcome of any appeals;\neffects on market conditions, including sales and pricing, resulting from global reactions to U.S. trade policies;\nmanufacturing activity, air travel trends, currency exchange rates, difficulties entering new markets and economic conditions such as inflation, deflation, interest rates and credit availability;\ninability to obtain, or meet conditions imposed for, required governmental and regulatory approvals;\nchanges in the tax laws in the United States and foreign jurisdictions and judicial or regulatory interpretations thereof; and\nlarge scale disasters, such as floods, earthquakes, hurricanes, industrial accidents and pandemics.\n\nITEM 2. MANAGEMENT’S DISCUSSION AND ANALYSIS OF\nFINANCIAL CONDITION AND RESULTS OF OPERATIONS\nFOR THE THREE MONTHS ENDED SEPTEMBER 30, 2025\nAND COMPARABLE PERIOD ENDED SEPTEMBER 30, 2024\nOVERVIEW\nThe Company is a global leader in motion and control technologies. Leveraging a unique combination of interconnected technologies, we design, manufacture, and provide aftermarket support for highly engineered solutions that create value for customers primarily in aerospace and defense, in-plant and industrial equipment, transportation, off-highway, energy, and HVAC and refrigeration markets around the world.\nBy aligning around our purpose, Enabling Engineering Breakthroughs that Lead to a Better Tomorrow, Parker is better positioned for the challenges and opportunities of tomorrow.\nThe Win Strategy 3.0 is Parker's business system that defines the goals and initiatives that create responsible, sustainable growth and enable Parker's long-term success. It works with our purpose, which is a foundational element of The Win Strategy, to engage team members and create responsible and sustainable growth. Our shared values shape our culture and our interactions with stakeholders and the communities in which we operate and live.\nWe believe many opportunities for profitable growth are available. The Company intends to focus primarily on business opportunities in the areas of aerospace and defense, in-plant and industrial equipment, transportation, off-highway, energy and HVAC and refrigeration. We believe we can meet our strategic objectives by:\nserving the customer and continuously enhancing its experience with the Company;\nsuccessfully executing The Win Strategy initiatives relating to engaged people, premier customer experience, profitable growth and financial performance;\nmaintaining a decentralized division and sales company structure;\nfostering a safety-first and entrepreneurial culture;\nengineering innovative systems and products to provide superior customer value through improved service, efficiency and productivity;\ndelivering products, systems and services that have demonstrable savings to customers and are priced by the value they deliver;\nenabling a sustainable future by providing innovative technology solutions that offer a positive global environmental impact and operating responsibly by reducing our energy use and emissions;\nacquiring strategic businesses;\norganizing around targeted regions, technologies and markets;\ndriving efficiency by implementing lean enterprise principles; and\ncreating a culture of empowerment through our values, inclusion and diversity, accountability and teamwork.\nWe manage our supply chain through our \"local for local\" manufacturing strategy, ongoing supplier management process and broadened supply base. We actively monitor global trade policies and inflation, managing their impact through a variety of cost and pricing measures. In addition, continuous improvement and lean initiatives, along with disciplined workforce and discretionary spending management, further enhance our ability to mitigate these impacts. At the same time, we are appropriately addressing the ongoing needs of our business so that we continue to serve our customers.\nOver the long term, the extent to which our business and results of operations will be impacted by global economic and political uncertainty, geopolitical risks and public health crises depends on future developments that remain uncertain. We will continue to monitor the global environment and manage our business with the goal to minimize unfavorable impacts on operations and financial results.\nCONSOLIDATED STATEMENTS OF INCOME\n\nIn both periods, business realignment and acquisition integration charges primarily related to business realignment activities. The business realignment charges primarily consist of severance costs related to actions taken under the Company's simplification initiative aimed at reducing organizational and process complexity, as well as plant closures. Business realignment charges within the International businesses were primarily incurred in Europe.\nWe anticipate that cost savings realized from the workforce reduction measures taken in the first three months of fiscal 2026 will not materially impact operating income in fiscal 2026 and 2027. We expect to continue to take actions necessary to appropriately structure the operations of the Diversified Industrial Segment. We currently anticipate incurring approximately $55 million of additional business realignment charges in the remainder of fiscal 2026. However, continually changing business conditions could impact the ultimate costs we incur.\nDiversified Industrial Segment backlog, as of September 30, 2025, decreased from the comparable prior-year quarter primarily due to the prior year divestiture of composites and fuel containment business within the North America businesses. Excluding the impact of the prior year divestiture activity, backlog remained relatively flat compared to the prior-year quarter.\nDiversified Industrial Segment backlog decreased from the June 30, 2025 amount of $3.7 billion primarily due to shipments exceeding orders in the North America businesses.\nBacklog consists of written firm orders from a customer to deliver products and, in the case of blanket purchase orders, only includes the portion of the order for which a schedule or release date has been agreed to with the customer. The dollar value of backlog is equal to the amount that is expected to be billed to the customer and reported as a sale.\nAerospace Systems Segment\n\nNet cash provided by operating activities\nincreased $38 million for the first three months of fiscal 2026 compared to the first three months of fiscal 2025, primarily driven by higher net income adjusted for non-cash items, such as depreciation, amortization, stock-based compensation expense and deferred income taxes. This was partially offset by changes in working capital relating to accounts receivable and inventories. We continue to focus on managing inventory and other working capital requirements.\nDays sales outstanding relating to trade accounts receivable was 52 days at September 30, 2025, 51 days at June 30, 2025 and 52 days at September 30, 2024.\nDays supply of inventory on hand was 93 days at September 30, 2025, 82 days at June 30, 2025 and 91 days at September 30, 2024.\nNet cash used in investing activities\nincreased for the first three months of fiscal 2026 compared to the first three months of fiscal 2025, primarily driven by a $1.0 billion increase in cash paid for acquisitions, net of cash acquired related to the acquisition of Curtis.\nNet cash provided by (used in) financing activities\nfor the first three months of fiscal 2026 and 2025 were impacted by the following factors:\nNet commercial paper borrowings of $1.1 billion in the first three months of fiscal 2026 compared to net commercial paper repayments of $377 million in the first three months of fiscal 2025.\nPrincipal payments totaling $40 million related to borrowings under a term loan facility in the first three months of fiscal 2025.\nRepurchases under the Company's share repurchase program amounted to 0.6 million common shares for $475 million during the first three months of fiscal 2026, compared to 0.1 million common shares for $50 million during the first three months of fiscal 2025.\nWe are actively monitoring our liquidity position and remain focused on managing our"
}