{
  "source_file": "phm-20250930.htm",
  "form_type": "10-Q",
  "item1_clean": null,
  "item7_clean": null,
  "item2_clean": "Land sale and other revenues\nTotal Homebuilding revenues\nHome sale cost of revenues\nLand sale and other cost of revenues\nSelling, general, and administrative\nEquity income (loss) from unconsolidated\nIncome before income taxes\nGross margin from home sales\nSG&A as a percentage of home\nAverage selling price\nAverage active communities\nBacklog at September 30:\nIncludes the amortization of capitalized interest.\nSG&A includes insurance reserve reversals of $78.7 million for the nine months ended September 30, 2024 (see\nEquity income from unconsolidated entities includes a gain of $37.7 million for the nine months ended September 30, 2024 related to the sale of our minority interest in a joint venture.\nPercentage not meaningful.\nNet new order dollars represent a composite of new order dollars combined with other movements of the dollars in backlog related to cancellations and change orders.\nHome sale revenues in the three and nine months ended September 30, 2025 were lower than the prior year periods by $94.9 million and $345.4 million, respectively. In the three months ended September 30, 2025, the 2% decrease resulted primarily from a 5% decrease in closings from the prior year period, partially offset by a 3% increase in average selling price. In the nine months ended September 30, 2025 the 3% decrease resulted primarily from a 6% decrease in closings, partially offset by a 3% increase in average selling price. The decreases in closings were primarily attributable to lower net new orders in the first half of 2025 and a weaker order backlog entering the year, partially offset by a higher community count and improved production cycle times. Average selling price during the three and nine months ended September 30, 2025 increased primarily due to product and geographic mix, including a slightly higher mix of closings toward our move-up buyers and in our Northeast segment, both of which carry a higher average selling price.\nHome sale gross margins\nHome sale gross margins were 26.2% and 26.9% in the three and nine months ended September 30, 2025, respectively, compared with 28.8% and 29.4% in the three and nine months ended September 30, 2024, respectively. The decreases in home sale gross margins were primarily attributable to the aforementioned pricing actions, including elevated sales incentives, and increased land acquisition and development costs. We expect these factors to continue to impact our gross margins over the near term. Gross margins for the first nine months of 2025 were also unfavorably impacted by our efforts to reduce completed spec inventory to more appropriate levels, which we expect will continue to be an area of focus for the remainder of 2025. While we have made significant progress in reducing the level of spec inventory during 2025, the level of completed spec inventory remains elevated for the current demand environment.\nLand sale and other revenues\nWe periodically elect to sell parcels of land to third parties in the event such assets no longer fit into our strategic operating plans or are zoned for commercial or other development. Land sale and other revenues and their related gains or losses vary between periods, depending on the timing of land sales and our strategic operating decisions. Land sales and other revenues contributed income of $5.1 million and $10.8 million for the three and nine months ended September 30, 2025, respectively, compared with losses of $6.0 million and $4.9 million for the three and nine months ended September 30, 2024, respectively.\nSG&A\nSG&A as a percentage of home sale revenues was 9.4% and 9.7% and in the three and nine months ended September 30, 2025, respectively, compared with 9.4% and 8.9% for the three and nine months ended September 30, 2024, respectively. The gross dollar amount of our SG&A decreased $6.2 million, or 2%, for the three months ended September 30, 2025 compared with the prior year period, and increased $58.8 million, or 5%, for the nine months ended September 30, 2025 compared with the prior year period. The increase in gross dollars for the nine months ended September 30, 2025 resulted primarily from insurance reserve reversals of $78.7 million recorded in the nine months ended September 30, 2024, respectively. Additionally, SG&A for the first nine months of 2025 reflects modestly higher headcount and technology costs to support ongoing production volumes. We expect to continue managing and balancing our overhead costs consistent with expected changes in the demand environment.\nOther income, net includes the following ($000’s omitted):\nWrite-offs of deposits and pre-acquisition costs\nAmortization of intangible assets\nThe increase in write-offs of deposits and pre-acquisition costs for 2025 relative to 2024 resulted from strategic decisions to not move forward with certain projects based on the current environment. Interest income declined in 2025, primarily due to lower returns on invested cash balances.\nNet new orders in units decreased 6% while net new orders in dollars decreased 7% in the three months ended September 30, 2025, as compared with the prior year period. Net new orders in units decreased 7% while net new orders in dollars decreased 8% in the nine months ended September 30, 2025, as compared with the prior year period. The decreased net new order volume and dollars in the three and nine months ended September 30, 2025 over the comparable prior year periods was primarily attributable to lower order volumes in our Texas and West segments. Cancellation rates (canceled orders for the period divided by gross new orders for the period) were 16% and 15% for the three and nine months ended September 30, 2025, respectively, and 15% and 14% for the three and nine months ended September 30, 2024, respectively. Ending backlog dollars, which represent orders for homes that have not yet closed, decreased 19% at September 30, 2025 compared with September 30, 2024.\nWe operate our business to generate a cadence of house starts that aligns with the sales environment, and an appropriate inventory of quick move-in speculative (spec) homes as we focus on turning our assets and delivering high returns on investment, which has allowed us to achieve an effective balance of price and pace. Our production cycle times have improved significantly over the past two years and have now returned to near historical norms. The following is a summary of our homes in production:\nThe number of homes in production at September 30, 2025 was 10% lower than at September 30, 2024. This decrease was primarily due to a decreased number of sold homes due to lower backlog and improved production cycle times, which reduces the length of time a home sits in inventory.\nThe following is a summary of our lots under control at September 30, 2025 and December 31, 2024:\nWhile competition for well-positioned land is robust, we have continued to pursue land investments that we believe can achieve appropriate risk-adjusted returns on invested capital. We have also continued to seek to maintain a high percentage of our lots that are controlled via land option agreements as such contracts enable us to defer acquiring portions of properties owned by third parties or unconsolidated entities until we have determined whether and when to exercise our option, which reduces our financial risks associated with long-term land holdings. The remaining purchase price under our land option agreements totaled $9.9 billion at September 30, 2025.\nHomebuilding Segment Operations\nAs of September 30, 2025, we conducted our operations in 47 markets located throughout 26 states. For reporting purposes, our Homebuilding operations are aggregated into six reportable segments:\n\nFor the third quarter of 2025, West home sale revenues decreased 7% when compared with the prior year period due to a 11% decrease in closings partially offset by a 5% increase in average selling price. The decrease in closings and increase in average selling price occurred across the majority of markets. Income before income taxes decreased 35%, primarily due to lower revenues and gross margins across the majority of markets. Net new orders decreased across the majority of markets.\nFor the nine months ended September 30, 2025, West home sale revenues increased 8% when compared with the prior year period due to an 8% increase in average selling price partially offset by a slight decrease in closings. The increase in average selling price and decrease in closings occurred across the majority of markets. Income before income taxes decreased 13% primarily due to lower gross margin and increased overhead costs across the majority of markets. Net new orders decreased across the majority of markets\nFinancial Services Operations\nWe conduct our Financial Services operations, which include mortgage banking, title, and insurance agency operations, through Pulte Mortgage LLC (\"Pulte Mortgage\") and other subsidiaries. In originating mortgage loans, we initially use our own funds supplemented by funds available pursuant to a credit agreement with third parties. Substantially all of the loans we originate are sold in the secondary market within a short period of time after origination, generally within 30 days. We also sell the servicing rights for the loans we originate through fixed price servicing sales contracts to reduce the risks and costs inherent in servicing loans. This strategy results in owning loans and related servicing rights for only a short period of time. Operating as a captive business model primarily targeted to support our Homebuilding operations, the business levels of our Financial Services operations are highly correlated to Homebuilding, as Homebuilding customers continue to account for substantially all of its business. We believe that our mortgage capture rate, which represents loan originations from our Homebuilding operations as a percentage of total loan opportunities from our Homebuilding operations, excluding cash "
}