{
  "source_file": "pld-20250930.htm",
  "form_type": "10-Q",
  "item1_clean": null,
  "item7_clean": null,
  "item2_clean": "Rental operations comprise the largest component of our reportable segments and generally contributes 90% to 95% of our consolidated revenues, earnings and FFO. We collect rent from our customers through operating leases, including reimbursements for the majority of our property operating costs. Through our global footprint, we have a diversified lease portfolio and our revenues from in-place leases are contractual with fixed or inflation-linked escalations. For the trailing twelve months ended September 30, 2025, the weighted average lease term for leases commenced in our consolidated operating portfolio was 68 months. We expect to generate earnings growth by increasing rents, maintaining high occupancy rates and controlling expenses. The primary driver of our revenue growth will be the rolling of in-place leases to current market rents upon lease expiration. We believe our active portfolio management, combined with the skills of our property management, maintenance, energy, sustainability and risk management teams allow us to maximize NOI across our portfolio. Substantially all of our consolidated rental revenue, NOI and cash flows from rental operations are generated in the U.S.\n\nWe define our same store population for the three months ended September 30, 2025 as the properties in our O&M operating portfolio, including the property NOI for both consolidated properties and properties owned by the unconsolidated co-investment ventures, at January 1, 2024 and owned throughout the same three-month period in both 2024 and 2025. We believe the drivers of property NOI for the consolidated portfolio are generally the same for the properties owned by the ventures in which we invest and therefore we evaluate the same store metrics of the O&M portfolio based on Prologis’ ownership in the properties (“Prologis Share”). The same store population excludes properties held for sale to third parties, along with development properties that were not stabilized at the beginning of the period (January 1, 2024) and properties acquired or disposed of to third parties during the period. To derive an appropriate measure of period-to-period operating performance, we remove the effects of foreign currency exchange rate movements by using the reported period-end exchange rate to translate from local currency into the U.S. dollar, for both periods.\n\nGiven the global nature of our operations, we are exposed to foreign currency exchange risk related to investments in and earnings from our foreign investments. We primarily hedge our foreign currency risk related to our investments by borrowing in the currencies in which we invest thereby providing a natural hedge. We have issued debt in a currency that is not the same functional currency of the borrowing entity and have designated a portion of the debt as a nonderivative net investment hedge. We recognize the remeasurement and settlement of the translation adjustment on the unhedged portion of the debt and accrued interest in unrealized gains or losses. We may use derivative financial instruments to manage foreign currency exchange rate risk related to our earnings. We recognize the change in fair value of the undesignated derivative contracts in unrealized gains and losses. Upon settlement of these transactions, we recognize realized gains or losses.\n\nThis segment generates durable, long-term cash flows and generally contributes 5% to 10% of our consolidated revenues, earnings and FFO, excluding promotes. We generate strategic capital revenue from our unconsolidated co-investment ventures, principally through asset management and property management services. Revenue earned from asset management fees is primarily driven by the quarterly valuation of the real estate properties owned by the respective ventures. We earn additional revenues by providing leasing, acquisition, construction management, development and disposition services. The majority of the strategic capital revenues are generated outside the U.S. In certain ventures, we also have the ability to earn revenues through incentive fees (“promotes” or “promote revenues”) periodically during the life of a venture, upon liquidation of a venture or upon stabilization of individual venture\n\nWhile tariff policy introduced economic uncertainty in April, leasing activity in our consolidated portfolio remained healthy, with 31 million square feet (62 million square feet on an O&M basis) of new leases signed in the third quarter, demonstrating that many customers are continuing to move forward with decisions. This demand was also reflected in new development activity, with consolidated development starts totaling $2.0 billion during the nine months ended September 30, 2025, of which 68.3% were build-to-suit projects. While we believe we are well-positioned to grow revenue over the long-term given the upside opportunity in our in-place leases, the potential impact of ongoing economic uncertainty on our business, future financial condition and operating results remains difficult to predict.\n\nThe key driver of changes in\nAccumulated Other Comprehensive Income (Loss) (“AOCI/L”)\nin the Consolidated Financial Statements during the nine months ended September 30, 2025 and 2024, was the currency translation adjustment derived from changes in exchange rates during both periods principally on our net investments in real estate outside the U.S. and the borrowings we issue in the functional currencies of the countries where we invest. These borrowings serve as a natural hedge of our foreign investments. In addition, we use derivative financial instruments, such as foreign currency contracts to manage foreign currency exchange rate risk related to our foreign investments and interest rate contracts to manage interest rate risk, that when designated the change in fair value is included in\nAOCI/L.\n\nLogistics supply chains remain vital to both our customers and the global economy. Long-term trends, including the growth of e-commerce and modernization of supply chains, continue to drive demand for additional space to enhance resiliency and distribution capabilities. This demand has led to strong rent growth and historically low vacancy rates in recent years. We believe this demand is driven by three primary factors: (i) our customers repositioning their supply chains to meet rising e-commerce and service expectations; (ii) growth in consumption; and (iii) a growing focus on supply chain efficiency. We believe these factors will sustain demand and low vacancy rates over the long term. In the near term, despite economic uncertainty stemming from trade tensions and shifting policies,\n\nOur operating results and leasing activity remained resilient during the nine months ended September 30, 2025, despite economic disruption from tariff policy proposals. Due to increases in market rents over the past several years, our existing lease mark-to-market continued to drive rent change on rollover and same-store growth in our O&M portfolio. This lease mark-to-market has remained meaningfully positive despite recent quarters of lower or even negative market rental growth, due to accumulated rent growth in preceding years. The occupancy of our operating portfolio was 95.2% at September 30, 2025 and rent change on leases that commenced during the nine months ended September 30, 2025 was 52.0% on a net effective basis, both metrics based on our ownership share.\n\nAs a result of several years of market rent increases, our in-place leases have considerable upside potential to capture higher rents and drive future organic NOI growth. We estimate that our share of the lease mark-to-market is approximately 19% (on an NER basis), which represents the amount by which current market rents exceed our in-place rents based on our share of the O&M portfolio at September 30, 2025. This lease mark-to-market has remained meaningfully positive despite recent quarters of lower or even negative market rental growth, due to accumulated rent growth in preceding years. As a result, even without further market rent increases, we expect lease renewals to drive higher rental income over the coming years, based on our remaining lease terms.\n\nStrategic Capital Segment.\nWe also generate operating cash through the fee revenue from our Strategic Capital Segment by providing asset management and property management and other services to our unconsolidated co-investment ventures. See the Results of Operations section above for the key drivers of the net revenues from our Strategic Capital Segment. Included in\nStrategic Capital Revenues\nin the Consolidated Statements of Income are the promotes we earn from the third-party investors in our co-investment ventures, which are recognized in operating activities in the period the cash is received, generally the quarter after the revenue is recognized.\n\nCash provided by and used in financing activities is principally driven by proceeds from and payments on credit facilities, commercial paper and other debt, along with dividends paid on common and preferred stock and noncontrolling interest contributions and distributions. Our credit facilities and our commercial paper support our cash needs for general corporate purposes on a short-term basis. The maturities of the borrowings under the credit facilities and the notes under the commercial paper programs generally range from overnight to three months.\n\nThe Class A Units in the OP are entitled to a quarterly distribution equal to $0.64665 per unit so long as the common units receive a quarterly distribution of at least $0.40 per unit. We paid a quarterly cash distribution of $0.64665 per Class A Unit in each of the first three quarters of 2025 and 2024. During the three and nine months ended September 30, 2025, the majority of the Class A Units in the OP were converted to common limited partnership units in the OP.\n\nWe paid quarterly cash dividends of $1.01 and $0.96 per common share in each of the first three quar"
}