{
  "source_file": "pm-20250930.htm",
  "form_type": "10-Q",
  "item1_clean": null,
  "item7_clean": null,
  "item2_clean": "We continuously monitor the values of our long-lived assets, reporting units, intangible assets, as well as investments in equity securities, to determine whether events or changes in circumstances indicate that an impairment exists. Additionally, we test goodwill and non-amortizable intangible assets for impairment annually. The values of these assets may be affected by several factors, including general macroeconomic and geopolitical conditions; regulatory and legal developments; changes in product volume growth rates; changes in pricing strategies and cost bases; discount rates; success of planned new product expansions; competitive activity; and income and excise taxes. If an impairment is determined to exist, we will incur impairment losses, which could have a material adverse effect on our results of operations or financial position. See Item 7.\nDiscussion and Analysis of Financial Condition and Results of Operations—Critical Accounting Estimates\nOur management uses certain key business metrics to evaluate our business, measure our performance, identify trends affecting our business, formulate financial projections and make strategic decisions and such metrics may not accurately reflect all of the aspects of our business needed to make such evaluations and decisions, in particular as our business continues to evolve.\nIn addition to our consolidated financial results, our management regularly reviews a number of operating and financial metrics, including various revenue, user and sales metrics (such as market shares, in-market sales, adjusted in-market sales, and SFP users) to evaluate our business, measure our performance, identify trends affecting our business, formulate financial projections and make strategic decisions. We believe that these metrics are representative of our current business; however, these metrics may not accurately reflect all aspects of our business and we anticipate that these metrics may change or may be substituted for additional or different metrics as our business evolves. Furthermore, in some instances the metrics are based upon a number of assumptions and estimates that, while presented with numerical specificity, are inherently subject to significant uncertainties and contingencies. If our management fails to account for other relevant information or to substitute the key business metrics they review as our business changes or if the assumptions or estimates underlying the metrics are inaccurate, their ability to accurately formulate financial projections and make strategic decisions may be compromised and our business, financial results and future growth prospects may be adversely impacted.\nRisks Related to the Impact of the War in Ukraine on our Business\nOur business, results of operations, cash flows and financial position may be adversely impacted by the continuation and consequences of the war in Ukraine.\nIn 2024, Russia accounted for around 9% of our total cigarette and heated tobacco unit shipment volume, and around 6% of our total net revenues. Ukraine accounted for around 2% of our total cigarette and heated tobacco unit shipment volume, and around 1% of our total net revenues. Historically, we also produced finished goods in Ukraine for export and manufactured products in Russia. In 2022, as a result of Russia’s invasion of Ukraine, we suspended planned investments and scaled down our manufacturing operations in Russia.\nThe full implications of the Russian invasion of Ukraine for our operations in those countries are impossible to predict at this time. The likelihood of retaliatory action by the Russian government against companies, including PMI, as a result of actions and statements made in response to the Russian invasion or otherwise, including the possibility of legal action against us or our employees; the deprivation of rights in, or access to, our Russian or Russia-related assets; or nationalization of foreign businesses or assets (including cash reserves held in Russia and intangible assets such as trademarks), is impossible to predict. We are continuously assessing the evolving situation in Russia, including regulatory constraints in the market entailing very complex terms and conditions that must be met for any divestment transaction to be granted approval by the authorities, and restrictions resulting from international regulations. In the event of a divestment, our ability to fully realize the value of the business would likely be subject to material impairment. The deprivation of rights in, or access to, our Russian or Russia-related assets could also result in a material impairment and could cause the deconsolidation of our Russian business. In Ukraine, there is no way to know when and to what extent we will be able to fully normalize our operations or to what extent our workforce, facilities, inventory, and other assets will remain intact. These developments have and will continue to have a material adverse impact on our business, results of operations, cash flows and financial position, and may result in further impairment charges.\nThe conflict also continues to elevate the likelihood of supply chain disruptions, both in the region and globally, and may inhibit our ability to timely source materials and services needed to make and sell our products. For example, historically we sourced certain finished goods, production materials and components from both Russia and Ukraine, including printed materials and filters, and the invasion has, and may continue to, disrupt the availability of and impact our supply chain for these materials. These disruptions, to the extent we are unable to find alternative sources or otherwise address these supply constraints, may impact the availability and cost of our products in other markets, which would adversely impact our business, results of operations, cash flows and financial position, and may result in impairment charges. Furthermore, the imposition of various restrictions on transactions with parties from certain jurisdictions, the ban on exports of various products, and other economic and financial restrictions may adversely affect us or certain third parties with which we do business in Russia, such as customers, suppliers, intermediaries, service providers and banks.\nThe broader consequences of the invasion are also impossible to predict, but could include reputational consequences; further sanctions, financial or currency restrictions, punitive tax law changes, embargoes, regional instability, or geopolitical shifts; and adverse effects on macroeconomic conditions, security conditions, currency exchange rates, and financial markets. Given the nature of our business and global operations, such geo-political instability and uncertainty could increase the costs of our materials and operations; reduce demand for our products; have a negative impact on our supply chains, manufacturing\ncapabilities, or distribution capabilities; increase our exposure to currency fluctuations; constrain our liquidity or our ability to access capital markets; create staffing or operations difficulties; or subject us to increased cyber-attacks. While we will continue to monitor this fluid situation and develop contingency plans as necessary to address any disruptions to our business operations as they develop, the extent of the conflict’s effect on our business and results of operations as well as the global economy, cannot be predicted.\nThe conflict may also heighten many other risks disclosed in this report, any of which could adversely affect our business, results of operations, cash flows or financial position. Such risks could affect, without limitation, the achievement of our strategic priorities, including achievement of our smoke-free business growth targets; the availability of third-party manufacturing resources; the availability of attractive acquisition and strategic business opportunities and our ability to fully realize the benefits of these transactions; our ability to attract, motivate, and retain the best global talent; and our loss of revenue from counterfeiting and similar illicit activities.\nRisks Related to Sourcing and Distribution of Products, Services and Materials\nUse of third-parties may negatively impact the distribution, quality, and availability of our products and services, and we may be required to replace third-party contract distributors, manufacturers or service providers.\nWe increasingly rely on third-parties and their subcontractors/suppliers, sometimes concentrated in a specific geographic area, for product distribution and to manufacture some of our products and product parts (particularly, electronic devices and accessories), as well as to provide services, including to support our finance, commercialization and information technology processes. While many of these arrangements improve efficiency and decrease our operating costs, they also diminish our direct control. Such diminished control may lead to disruption in the distribution of our products and may have a material adverse effect on the quality and availability of products or services, our supply chain, and the speed and flexibility in our response to changing market conditions and adult consumer preferences, all of which may place us at a competitive disadvantage or negatively impact our reputation. In addition, we may be unable to renew these agreements on satisfactory terms for numerous reasons, including government regulations, and the distribution of our products may be disrupted in certain markets or our costs may increase significantly if we must replace such third parties with other partners or our own resources.\nThe effects of climate change, other environmental issues, and related legal or regulatory responses may have a negative impact on our business and results of operations.\nWhile we seek to mitigate our business risks associated with environmental issues, such as climate change, by enhancing our resilience to potential i"
}