{
  "source_file": "pnr-20241231.htm",
  "form_type": "10-K",
  "item1_clean": "ITEM 1. BUSINESS\nUnless the context otherwise indicates, references herein to “Pentair,” the “Company,” and such words as “we,” “us,” and “our” include Pentair plc and its consolidated subsidiaries.\nGENERAL\nAt Pentair, we help the world sustainably move, improve and enjoy water, life’s most essential resource. From our residential and commercial water solutions to industrial water managemen\nt and everything in between, Pentair is focused on smart, sustainable water solutions that help our planet and people thrive.\nOur vision is to be the world’s most valued sustainable water solutions company for our employees, customers and shareholders. As a company, we:\nFocus on growth in our core businesses and strategic initiatives;\nAccelerate digital innovation and technology as well as sustainability investments;\nExpedite growth and drive margin expansion through our Transformation Program; and\nBuild a high performance growth culture and deliver on our commitments while living our Win Right values.\nHISTORY AND DEVELOPMENT\nWe are an Irish public limited company that was formed in 2014. We are the successor to Pentair Ltd., a Swiss corporation formed in 2012, and Pentair, Inc., a Minnesota corporation formed in 1966 and our wholly-owned subsidiary, under the Securities Exchange Act of 1934, as amended (the “Exchange Act”). Although our jurisdiction of organization is Ireland, we manage our affairs so that we are centrally managed and controlled in the United Kingdom (the “U.K.”) and therefore have our tax residency in the U.K.\nOn December 2, 2024, as part of our Pool reportable segment, we completed the acquisition of G & F Manufacturing, LLC (“G & F Manufacturing”) for $116.0 million in cash, net of cash acquired and subject to customary adjustments. The net purchase price is comprised of an upfront cash payment of $108.0 million, subject to customary adjustments, and the estimated fair value at the acquisition date of a contingent earn-out liability based upon the achievement of certain defined operating results in the two years following the acquisition. G & F Manufacturing manufactures and services pool heat pumps.\nOur registered principal office is located at Regal House, 70 London Road, Twickenham, London, TW13QS United Kingdom. Our management office in the United States (“U.S.”) is located at 5500 Wayzata Boulevard, Suite 900, Golden Valley, Minnesota.\nBUSINESS AND PRODUCTS\nPentair is comprised of three reportable segments: Flow, Water Solutions and Pool. The following is a brief description of each of the Company’s reportable segments and business activities.\nThe Flow segment aims to deliver water where it is needed, when it is needed, more efficiently and to transform waste into value. This segment designs, manufactures and sells a variety of fluid treatment and pump products and systems, including pressure vessels, gas recovery solutions, membrane bioreactors, wastewater reuse systems and advanced membrane filtration, separation systems, water disposal pumps, water supply pumps, fluid transfer pumps, turbine pumps, solid handling pumps, and agricultural spray nozzles, while serving the global residential, commercial and industrial markets. These products and systems are used in a range of applications, including fluid delivery, ion exchange, desalination, food and beverage, separation technologies for the oil and gas industry, residential and municipal wells, water treatment, wastewater solids handling, pressure boosting, circulation and transfer, fire suppression, flood control, agricultural irrigation and crop spray.\nFor the fiscal year ended December 31, 2024, our residential and irrigation flow businesses, which sell pumps focused on residential and agriculture, comprised approximately 37% of Flow sales. Another approximately 29% of Flow sales were from the commercial & infrastructure flow businesses, which sell larger pumps focused on fire suppression, water supply, wastewater and flood control. The remaining approximately 34% of Flow sales were from the industrial solutions business, comprised of applications focused on industrial process and air filtration and sustainable gas.\nFlow brand names include Pentair Flow, Aurora, Berkeley, Codeline, Fairbanks-Nijhuis, Haffmans, Hydromatic, Hypro, Jung Pumpen, Myers, Sta-Rite, Shurflo, Südmo and X-Flow.\nFlow customers include businesses engaged with end users, and wholesale and retail distribution in the residential, agricultural, commercial, food and beverage, and industrial vertical markets.\nWe have historically experienced increased demand following warm weather trends for residential water supply and agricultural products. Such demand historically has been at seasonal highs from April to August. Seasonal effects may vary from year to year and are impacted by weather patterns, particularly by temperatures, heavy flooding and droughts.\nFlow faces numerous domestic and international competitors, some of which have substantially greater resources directed to the vertical markets in which we compete. Competition focuses on brand names, product performance (including energy-efficient offerings and required specifications), quality, service and price. We compete by offering a wide variety of innovative and high-quality products, which we believe are competitively priced.\nThe Water Solutions segment aims to provide great tasting, higher-quality water and ice while helping people use water more productively. This segment designs, manufactures and sells commercial and residential water treatment products and systems including pressure tanks, control valves, activated carbon products, commercial ice machines, conventional filtration products, and point-of-entry and point-of-use water treatment systems. These water treatment products and systems are for use in residential whole home water filtration, drinking water filtration and water softening solutions in addition to commercial water management and filtration in foodservice operations. In addition, our water solutions business also provides installation and preventative services for water management solutions for commercial operators.\nFor the fiscal year ended December 31, 2024, our commercial business, which offers products such as conventional filtration products, commercial point-of-entry and point-of-use water treatment systems, activated carbon products and commercial ice machines, comprised approximately 66% of Water Solutions sales. In addition, our commercial business also provides installation and preventative services for water management solutions for commercial operators. The other approximately 34% of Water Solutions sales were associated with our residential business, which primarily focuses on products associated with residential point of entry and point of use filtration and softening systems, pressure tanks and control valves.\nWater Solutions brand names include Pentair Water Solutions, Everpure, Fleck, KBI, Manitowoc Ice, Pentek and RainSoft.\nWater Solutions customers include businesses engaged in wholesale and retail distribution in the residential, commercial and food and beverage vertical markets. Customers also include end users, consumers, commercial operators and original equipment manufacturers.\nWe experience seasonal demand with several end customers and end users within Water Solutions. End-user demand for water solution products generally follows warm weather trends and is at seasonal highs from April to September.\nWater Solutions faces numerous domestic and international competitors, some of which have substantially greater resources directed to the vertical markets in which we compete. Competition focuses on brand names, product performance (including required specifications), quality and price. We compete by offering a wide variety of innovative and high-quality products, which we believe are competitively priced. We believe our distribution channels and reputation for quality also provide us a competitive advantage.\nThe Pool segment aims to provide innovative, energy-efficient pool solutions to help people more sustainably enjoy water. This segment designs, manufactures and sells a complete line of energy-efficient residential and commercial pool equipment and accessories including pumps, filters, heaters, lights, automatic controls, automatic cleaners, maintenance equipment and pool accessories. Applications for our pool products include residential and commercial pool maintenance, pool repair, renovation, service, construction and aquaculture solutions.\nThe primary brand names associated with the Pool segment are Pentair Pool, Kreepy Krauly, Pleatco and Sta-Rite.\nPool customers include businesses engaged in wholesale and retail distribution in the residential and commercial vertical markets. Customers in the residential and commercial verticals also include end users and consumers.\nOne customer in the Pool business represented approximately 15% of our consolidated net sales in both 2024 and 2023.\nWe have historically experienced seasonal demand with several end customers and end users. End-user demand for pool equipment follows warm weather trends and historically has been at seasonal highs from April to August. The magnitude of the sales spike has historically been partially mitigated by employing some advance sale “early buy” programs (generally including extended payment terms and/or additional discounts).\nPool faces numerous domestic and international competitors, some of which have substantially greater resources directed to the vertical markets in which we compete. Competition focuses on brand names, product performance (including energy-efficient offerings and required specifications), quality, service and price. We compete by offering a wide variety of innovative and high-quality products, which we believe are competitively priced. We believe our distribution channels and reputation for quality also provide us a competitive advantage.\nINFORMATION REGARDING ALL REPORTABLE SEGMENTS\nResearch and development\nWe conduct research and development activities primarily in our own facilities. These efforts consist mostly of the development of new products, product applications and manufacturing processes.\nThe principal materials we use in manufacturing our products are mild steel, stainless steel, electronic components (including drives and motors), plastics (resins, fiberglass, epoxies), metals and paint (powder and liquid). In addition to the purchase of raw materials, we purchase some finished goods for distribution for resale.\nWe purchase the materials we use in various manufacturing processes on the open market. We believe the majority of such materials are available through multiple sources and in adequate supply. We have certain long-term commitments, principally price commitments, for the purchase of various component parts and raw materials and continue to work with our suppliers to maintain delivery continuity. Alternate sources of supply are available for most materials and we believe that the termination of any of these commitments would not have a material adverse effect on our financial position, results of operations or cash flows.\nCertain commodities, such as metals and resins, are subject to commodity market and duty-driven price fluctuations. We manage these fluctuations through several mechanisms, including long-term agreements with price adjustment clauses for significant commodity market movements in certain circumstances. Prices for raw materials, such as metals, may trend higher in the near future due to the volatile market trends.\nIntellectual property\nPatents, non-compete agreements, proprietary technologies, customer relationships, trademarks, trade names and brand names are important to our business. However, we do not regard our business as being materially dependent upon any single patent, non-compete agreement, proprietary technology, customer relationship, trademark, trade name or brand name.\nPatents, patent applica",
  "item7_clean": "ITEM 7. MANAGEMENT’S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS\nForward-looking statements\nPentair plc and its consolidated subsidiaries (“we,” “us,” “our,” “Pentair” or the “Company”) is a pure play water industrial manufacturing company comprised of three reportable segments: Flow, Water Solutions and Pool. We classify our operations into business segments based primarily on types of products offered and markets served. For the year ended December 31, 2024, the Flow, Water Solutions and Pool reportable segments represented approximately 37%, 28% and 35% of total consolidated net sales, respectively.\nAlthough our jurisdiction of organization is Ireland, we manage our affairs so that we are centrally managed and controlled in the United Kingdom (the “U.K.”) and therefore have our tax residency in the U.K.\nOn December 2, 2024, as part of our Pool reportable segment, we completed the acquisition of G & F Manufacturing, LLC (“G & F Manufacturing”) for $116.0 million in cash, net of cash acquired and subject to customary adjustments. The net purchase price is comprised of an upfront cash payment of $108.0 million, subject to customary adjustments, and the estimated fair value at the acquisition date of a contingent earn-out liability based upon the achievement of certain defined operating results in the two years following the acquisition. G & F Manufacturing manufactures and services pool heat pumps.\nKey trends and uncertainties regarding our existing business\nThe following trends and uncertainties affected our financial performance in 2024, and are reasonably likely to impact our results in the future:\nWe have a Transformation Program designed to accelerate growth and drive margin expansion by driving operational excellence, reducing complexity and streamlining our processes. During 2024, we made strategic progress on our Transformation Program initiatives with a focus on our four key themes of pricing excellence, strategic sourcing, operations excellence and organizational effectiveness. We expect to continue to execute on our key Transformation Program initiatives to drive margin expansion and to continue to incur transformation costs in 2025 and beyond.\nIn 2024, we began using 80/20 guiding principles to enable our Transformation Program. This 80/20 analysis is expected to create value by focusing on key customers and products through quadrant-based strategies. We expect the analysis to result in actions to improve operating performance by driving growth with our highest value customers, reducing lower margin sales and removing complexity in the future.\nIn 2024, we executed certain business restructuring initiatives aimed at reducing our fixed cost structure and realigning our business. We expect these actions to continue into 2025 and to drive margin growth.\nDuring 2024, we experienced inflationary cost increases for certain raw materials as well as logistics and transportation costs. The ongoing volatile market for commodities has the potential to continue to drive price increases in our supply chain. In addition, the current U.S. administration has recently implemented tariffs and has announced the possibility of implementing additional, or increasing current, tariffs; these actions and any reactionary tariff adjustments by other countries may also contribute to inflationary cost increases. As a result, we have taken pricing actions, which may continue going forward, and implemented transformation initiatives that we expect to improve productivity and offset cost increases. We anticipate supply chain pressures and inflationary cost increases due to potential tariffs and pressure on global manufacturing to continue into 2025.\nThe Organization for Economic Co-operation and Development Pillar Two Model Rules (“Pillar Two”), for a global 15.0% minimum tax, have been adopted by a number of jurisdictions in which we operate. Pillar Two has negatively impacted our effective tax rate in 2024 and is likely to continue to impact our effective tax rate in the future. We continue to evaluate the enacted legislative changes and new guidance as it becomes available.\nWe have identified specific product and geographic market opportunities that we find attractive and continue to pursue, both within and outside the U.S. We expect to continue investing in our businesses to drive these opportunities through research and development and additional sales and marketing resources. Unless we successfully penetrate these markets, our core sales growth will likely be limited or may decline.\nIn 2025, our operating objectives focus on delivering our core and building our future. We expect to execute these objectives by:\nDelivering profitable revenue growth and productivity for customers and shareholders;\nContinuing to focus on capital allocation through:\nCommitting to maintain our investment grade rating;\nFocusing on reducing our long-term debt;\nReturning cash to shareholders through dividends and share repurchases; and\nAccelerating our performance with strategically-aligned mergers and acquisitions;\nFocusing growth initiatives that accelerate our investments in digital, innovation, technology and sustainability;\nContinuing to implement our Transformation Program initiatives that will drive operational excellence, reduce complexity and improve our organizational structure, which includes the focus on 80/20 actions to drive profitable growth; and\nBuilding a high performance growth culture and delivering on our commitments while living our Win Right values.\nCONSOLIDATED RESULTS OF OPERATIONS\nThe consolidated results of operations were as follows:\nYears ended December 31\nSelling, general and administrative\nResearch and development\nNet interest expense\nOther (income) expense\nN.M.\nN.M.\nIncome from continuing operations before income taxes\nProvision (benefit) for income taxes\nN.M.\nN.M.\nThe components of the consolidated net sales change were as follows:\nAcquisition/Divestiture\nThe 0.5 percent decrease in consolidated net sales in 2024 from 2023 was primarily the result of:\ndecreased sales volume in our residential flow and industrial solutions businesses within our Flow segment compared to the prior year;\ndecreased sales volume in our Water Solutions segment compared to the prior year, in addition to a business exit in our residential business in 2024 and the completion of a large project in 2023 within our commercial business that did not recur in 2024; and\na product line exit in our Pool segment that occurred in 2024.\nThis decrease was partially offset by:\nincreased selling prices across all of our segments to mitigate inflationary cost increases;\nincreased sales volume in our commercial flow business within our Flow segment compared to the prior year;\nincreased sales volume within our Pool segment due to higher demand compared to the prior year; and\nincreased sales due to the acquisition of G & F Manufacturing completed in the fourth quarter of 2024.\n\nIncludes liabilities due to non-guarantor subsidiaries of $151.5 million.\nThe Parent Company Guarantor and Subsidiary Issuer do not have material results of operations on a combined basis.\nMaterial Cash Requirements From Contractual Obligations and Commitments\nWe expect to continue to have sufficient cash and borrowing capacity to support working capital needs and capital expenditures, to pay interest and service debt and to pay dividends to shareholders quarterly. We believe we have the ability to meet our short-term and long-term cash requirements by using available cash and internally generated funds and to borrow under our committed and uncommitted credit facilities. The following summarizes our material cash requirements from significant contractual obligations and purchase commitments that impact our liquidity as of December 31, 2024:\nGreater Than Twelve Months\nDebt obligations (Note 8)\nInterest obligations on fixed-rate debt\nOperating lease obligations, net of sublease rentals (Note 15)\nPension and other post-retirement plan benefit payments (Note 11)\nOther purchase obligations\nTotal contractual obligations, net\nOther purchase obligations primarily include service and marketing contracts as well as commitments for raw materials to be utilized in the normal course of business. For purposes of the above table, arrangements are considered purchase obligations if a contract specifies all significant terms, including fixed or minimum quantities to be purchased, a pricing structure and approximate timing of the transaction.\nIn addition to the significant contractual obligations described above, we will incur annual interest expense on outstanding variable rate debt. As of December 31, 2024, variable interest rate debt was $843.8 million at a weighted average interest rate of 5.84%. Inclusive of our interest rate swaps and collars, our weighted average interest rate on our variable rate debt was 5.59% as of December 31, 2024. Refer to ITEM 8, Note 9 of the Notes to Consolidated Financial Statements for additional information regarding our interest rate swaps and collars.\nThe total gross liability for uncertain tax positions at December 31, 2024 was estimated to be $6.0 million. We record penalties and interest related to unrecognized tax benefits in\nProvision (benefit) for income taxes\nNet interest expense\n, respectively, which is consistent with our past practices. As of December 31, 2024, we had recorded $3.9 million related to the possible payment of interest and recorded no liabilities for the possible payment of penalties.\nCOMMITMENTS AND CONTINGENCIES\nWe have been, and in the future may be, made parties to a number of actions filed or have been, and in the future may be, given notice of potential claims relating to the conduct of our business, including those relating to commercial, regulatory or contractual disputes with suppliers, authorities, customers or parties to acquisitions and divestitures, intellectual property matters, environmental, asbestos, safety and health matters, product liability, the use or installation of our products, consumer matters, and employment and labor matters.\nWhile we believe that a material impact on our consolidated financial position, results of operations or cash flows from any such future claims or potential claims is unlikely, given the inherent uncertainty of litigation, a remote possibility exists that a future adverse ruling or unfavorable development could result in future charges that could have a material impact. We do and will continue to periodically reexamine our estimates of probable liabilities and any associated expenses and receivables and make appropriate adjustments to such estimates based on experience and developments in litigation and applicable accounting rules. As a result, the current estimates of the potential impact on our consolidated financial position, results of operations and cash flows for the proceedings and claims described in ITEM 8, Note 15 of the Notes to Consolidated Financial Statements could change in the future.\nProduct liability claims\nWe are subject to various product liability lawsuits and personal injury claims. A substantial number of these lawsuits and claims are insured and accrued for by Penwald, our captive insurance subsidiary. See discussion in ITEM 1 and ITEM 8, Note 1 of the Notes to Consolidated Financial Statements — Insurance subsidiary. Penwald records a liability for these claims based on actuarial projections of ultimate losses. For all other claims, accruals covering the claims are recorded, on an undiscounted basis, when it is probable that a liability has been incurred and the amount of the liability can be reasonably estimated based on existing information. The accruals are adjusted periodically as additional information becomes available. We have not experienced significant unfavorable trends in either the severity or frequency of product liability lawsuits or personal injury claims.\nStand-by letters of credit, bank guarantees and bonds\nIn certain situations, Tyco International Ltd., Pentair Ltd.’s former parent company (“Tyco”), guaranteed performance by the flow control business of Pentair Ltd. (“Flow Control”) to third parties or provided financial guarantees for financial commitments of Flow Control. In situations where Flow Control and Tyco were unable to obtain a release from these guarantees in connection with the spin-off of Flow Control from Tyco, we will indemnify Tyco for any losses it suffers as a result of such guarantees.\nIn the ordinary course of business, we are required to commit to bonds, letters of credit and bank guarantees that require payments to our customers for any non-performance. The outstanding face value of these instruments fluctuates with the value of our projects in process and in our backlog. In addition, we issue financial stand-by letters of credit primarily to secure our performance to third parties under self-insurance programs.\nAs of December 31, 2024 and 2023, the outstanding value of bonds, letters of credit and bank guarantees totaled $102.1 million and $124.3 million, respectively.\nNEW ACCOUNTING STANDARDS\nCRITICAL ACCOUNTING POLICIES\nWe have adopted various accounting policies to prepare the consolidated financial statements in accordance with U.S. GAAP. Our significant accounting policies are more fully described in ITEM 8, Note 1 of the Notes to Consolidated Financial Statements. Certain accounting policies require the application of significant judgment by management in selecting the appropriate assumptions for calculating financial estimates. By their nature, these judgments are subject to an inherent degree of uncertainty. These judgments are based on our historical experience, terms of existing contracts, our observance of trends in the industry and information available from other outside sources, as appropriate. We consider an accounting estimate to be critical if:\nit requires us to make assumptions about matters that were uncertain at the time we were making the estimate; and\nchanges in the estimate or different estimates that we could have selected which would have had a material impact on our financial condition or results of operations.\nOur critical accounting estimates include the following:\nImpairment of goodwill and indefinite-lived intangibles\nGoodwill represents the excess of the cost of acquired businesses over the net of the fair value of identifiable tangible net assets and identifiable intangible assets purchased and liabilities assumed.\nWe test our goodwill for impairment at least annually during the fourth quarter or more frequently if events or changes in circumstances indicate that the asset might be impaired. We perform our annual or interim goodwill impairment test by comparing the fair value of the relevant reporting unit with its carrying amount. We would recognize an impairment charge for the amount by which the carrying amount exceeds the reporting unit’s fair value; however, the loss recognized would not exceed the total amount of goodwill allocated to that reporting unit.\nWe have the option to perform a qualitative assessment to determine whether it is necessary to perform the quantitative goodwill impairment test. However, we may elect to perform the quantitative goodwill impairment test even if no indications of a potential impairment exist.\nDuring 2024, a qualitative assessment was performed. As a result, it was determined that it was more likely than not that the fair value of the reporting units exceeded their respective carrying values. Factors considered in the analysis included the 2023 discounted cash flow fair value assessment of the reporting units and the calculated excess fair value over carrying amount, financial performance, forecasts and trends, market capitalization, regulatory and environmental issues, macro-economic conditions, industry and market considerations, raw material costs and management stability. We also consider the extent to which e",
  "item2_clean": null
}