{
  "source_file": "pnw-20250930.htm",
  "form_type": "10-Q",
  "item1_clean": null,
  "item7_clean": null,
  "item2_clean": "Actual and Projected Customer and Sales Growth.\nRetail customers in APS’s service territory increased 2.4% for the period ended September 30, 2025 compared with the prior-year period. For the three years through 2024, APS’s customer growth averaged 2.1% per year. We currently project annual customer growth to be 2.0% to 2.5% for 2025 and the average annual growth to be in the range of 1.5% to 2.5% through 2030 based on anticipated steady population growth in Arizona during that period.\nRetail electricity sales in kWh, adjusted to exclude the effects of weather variations, increased 4.5% for the period ended September 30, 2025 compared with the prior-year period. While steady customer growth was somewhat offset by lower usage among residential customers, energy savings driven by customer conservation, energy efficiency, and distributed renewable generation initiatives, the main drivers of increased revenues for this period were continued strong sales to commercial and industrial customers and the continued ramp-up of new data center and large manufacturing customers. As large load customers, such as data centers and large manufacturers, have continued to grow as a proportion of our business, we have updated our procedures with respect to estimates of unbilled revenues for our customer classes. As a result, we made an adjustment in the first quarter of 2025 to recalibrate accrued unbilled revenues, offsetting year-to-date sales growth by 0.5%. Even with this offset to sales growth in the first quarter, we do not anticipate any change to our expected range of sales growth for the full year 2025.\nFor the three years through 2024, annual retail electricity sales growth averaged 3.2%, adjusted to exclude the effects of weather variations. Due to the expected growth of several data centers and large manufacturing facilities, we currently project that annual retail electricity sales in kWh will increase in the range of 4.0% to 6.0% for 2025 and that average annual growth will be in the range of 5.0% to 7.0% through 2030, including the effects of customer conservation, energy efficiency, and distributed renewable generation initiatives, but excluding the effects of weather variations. These projected sales growth ranges include the impacts of several data centers and large manufacturing facilities, which are expected to contribute to 2025 growth in the range of 3.0% to 5.0% and to average annual growth in the range of 4.0% to 6.0% through 2030.\nLonger term, APS has been preparing for and can serve significant load growth from residential and business customers. On top of these existing growth trends, APS is also now receiving unprecedented incremental requests for service from large load customers with very high energy demands that persist virtually around-the-clock. These incremental requests for service by large load customers far exceed available generation and transmission resource capacity in the Southwest region for the foreseeable future. Because of the high growth in demand for such projects, APS has developed a queue that identifies and prioritizes projects while maintaining system reliability and affordability for existing APS customers. APS is also exploring available options for securing sufficient electric generation and transmission to meet these projections of future customer needs, including a new subscription model for large load customers. The subscription model is part of the company’s “growth pays for growth” strategy where large load customers would enter into a long-term special contract to pay for the costs associated with the incremental infrastructure needed to provide service without compromising reliability and affordability for existing customers.\nActual sales growth, excluding weather-related variations, may differ from our projections as a result of numerous factors, such as economic conditions, customer growth, usage patterns and energy conservation, slower ramp-up of and/or fewer large data centers and manufacturing facilities, slower than expected commercial and industrial expansions, impacts of energy efficiency programs and growth in distributed generation, responses to retail price changes, changes in regulatory standards, and impacts of new and existing laws and regulations, including environmental laws and regulations. Based on past experience, a 1% variation in our annual residential and small commercial and industrial kWh sales projections under normal business conditions can result in increases or decreases in annual net income of approximately $24 million, and a 1% variation in our annual large commercial and industrial kWh sales projections under normal business conditions can result in increases or decreases in annual net income of approximately $6 million.\n\nHigher retail revenues due to changes in usage patterns, customer growth, and related pricing partially offset by the impacts of energy efficiency\nHigher transmission revenues (Note 6)\nChanges in net fuel and purchased power costs, including off-system sales margins and related deferrals\nLFCR revenue (Note 6)\nHigher renewable energy regulatory surcharges, partially offset by operations and maintenance costs\nOperations and maintenance\n. Operations and maintenance expenses decreased $8 million for the three months ended September 30, 2025 compared with the prior-year period primarily due to:\na decrease of $12 million related to employee benefit costs;\na decrease of $2 million related to transmission, distribution, and customer service costs;\nan increase of $2 million related to nuclear generation costs;\nan increase of $2 million related to corporate resource costs;\nan increase of $5 million related to information technology costs; and\na decrease of $3 million for other miscellaneous factors.\nDepreciation and amortization.\nDepreciation and amortization expenses were $4 million lower for the three months ended September 30, 2025 compared to the prior-year period, primarily due to lower depreciation expense due to operations ceasing at the Cholla plant, partially offset by increased plant in service and intangible assets.\nPension and other postretirement non-service credits, net.\nPension and other postretirement non-service credits, net were $9 million lower for the three months ended September 30, 2025 compared to the prior-year period, primarily due to prior-service credits becoming fully amortized as of January 31, 2025.\nOther income and expense, net.\nOther income and expense, net were $2 million higher for the three months ended September 30, 2025 compared to the prior-year period, primarily due to investment gains in El Dorado, partially offset by lower PSA interest income and higher other expenses. The difference between APS’s and Pinnacle West’s other income and expense, net is primarily related to Pinnacle West’s gain in investment in El Dorado.\nInterest charges, net of allowance for borrowed funds and equity funds used during construction.\nInterest charges, net of allowance for funds used during construction, were $5 million higher for the three months ended September 30, 2025 compared to the prior-year period, primarily due to higher debt balances, partially offset by higher allowance for equity funds.\nTaxes other than income taxes.\nTaxes other than income taxes were $5 million higher for the three months ended September 30, 2025, compared to the prior-year period, primarily due to a favorable true-up recognized during the third quarter of 2024.\nIncome taxes were $4 million higher for the three months ended September 30, 2025 compared with the prior-year period, primarily due to higher pre-tax income and lower tax credits, offset by higher favorable book-tax permanent benefits.\n\nOur vision is to create a sustainable energy future for Arizona. Our mission is to serve customers with safe, reliable, and affordable energy. We are committed to delivering operational excellence at the lowest cost possible while aspiring to lower carbon emissions over time.\nAs energy demand in Arizona continues to grow, we remain committed to delivering reliable service to our customers. We have a goal of achieving top quartile reliability as compared to peers. Key elements to delivering reliable service include resource and transmission planning to secure resource adequacy, planning and procuring resources to ensure sufficient reserve margins, distribution automation and resiliency investments, predictive and preventative maintenance programs, seasonal readiness programs, emergency preparedness, and securing a reliable supply chain. Securing a reliable grid requires ongoing infrastructure investments in addition to investments to support new customer growth.\n. APS strives to procure a balanced energy mix, and we believe this provides the greatest reliability at the lowest cost possible while increasing resiliency. We achieve reliability, in part, through a blend of dispatchable resources, such as natural gas and battery storage, that can provide energy when intermittent resources, such as wind and solar, are unavailable. In its all-source request for proposal (“ASRFP”) issued in 2023, APS contracted for 3,606 megawatts (“MW”) of battery storage, 517 MW of natural gas, 2,649 MW of solar, and 500 MW of wind resources. APS regularly\nevaluates the best mix of resources based on a changing operating environment, including changes in generation technology, economics, and policy impacts.\nThere is a need for additional natural gas to support reliability for customers and meet increasing energy needs and existing natural gas pipelines into Arizona are currently 100% committed. As a result, in July 2025, APS executed a gas transportation precedent agreement to secure a long-term supply of natural gas. The new pipeline is expected to be operational by late 2029 and will be owned and operated by a third-party. APS also plans to develop a site near Gila Bend, Arizona that is capable of adding up to 2,000 MW of generation to the state’s energy portfoli"
}