{
  "source_file": "podd-20241231.htm",
  "form_type": "10-K",
  "item1_clean": "We believe that training consumers on how to use Omnipod products is an important factor to promote successful outcomes and customer retention. We have streamlined and standardized our training by developing online resources and increased our field clinician team to directly train new users. We created an online training program for Omnipod customers transitioning to Omnipod 5 or Omnipod DASH. In addition, our virtual training allows us to onboard new Omnipod customers transitioning from MDI in a cost-effective manner. Our distributors have also implemented virtual training programs.\nWe seek to provide our customers with high quality customer support, from product ordering to insurance investigation, order fulfillment, and ongoing support. Our customer support systems are integrated with our sales, reimbursement, and billing processes, allowing us to provide customers with reliable support by telephone and through our website.\nThe diabetes medical device market is highly competitive, subject to rapid change, and significantly affected by new product introductions. Our Omnipod platform competes for consumers in the insulin delivery market. Because most new Omnipod users come from MDI therapy, which currently is the most prevalent method of insulin delivery, we believe that we primarily compete with companies that provide products and supplies for MDI therapy. We also compete with companies in the insulin pump market, which today consists of tubed pump companies, primarily Medtronic MiniMed, a division of Medtronic public limited company (“Medtronic”) and Tandem Diabetes Care Inc. (“Tandem”). The competitive landscape in our industry continues to undergo significant change. In addition to the established insulin pump competitors, several companies are\nworking to develop and market new insulin pumps and smart pens. These companies are at various stages of development and the number of such companies often changes as they enter or exit the market.\nResearch and Development\nOur innovation programs are designed to drive:\nsimplicity of user interaction with our systems to minimize the burden of diabetes;\nimproved outcomes, primarily through algorithm advancements;\ninsights and value from our growing datasets and analytics; and\nuser choice of sensor and smartphone integrations.\nMany of our research and development efforts are focused on making improvements to Omnipod 5, including adding features and functionality that will deliver increased economic value and convenience to users. Advances in innovation in 2024 include the following:\nreceived FDA clearance for an expanded indication of Omnipod 5 for type 2 diabetes for people aged 18 years and older in the United States;\nlaunched iOS app with Dexcom’s G6 CGM in the United States;\nlaunched Omnipod 5 integration with Dexcom’s G7 CGM in the United States;\nlaunched Omnipod 5 integration with Dexcom’s G6 CGM in France;\nreceived CE mark approval under the MDR for the added compatibility of both Dexcom’s G7 CGM and Libre 2 Plus with Omnipod 5 for individuals aged two years and older with type 1 diabetes; and\nlaunched Omnipod 5 integration with Libre 2 Plus in the United States, United Kingdom. and Netherlands.\nWe also continue to advance work to improve the Omnipod 5 algorithm and develop next-generation AID products. In 2024, we completed the first round of our EVOLUTION feasibility trial in New Zealand to test potential enhancements to the Omnipod 5 algorithm in order to further drive simplicity of use. The study included testing the system with both type 1 and type 2 users. We are in the process of analyzing the data and making modifications for the next round of study.\nManufacturing and Quality Assurance\nIn order to manufacture sufficient volumes of our Pods at high quality while still achieving a cost-effective per unit production price, we have designed our Pods to be manufactured through automation. We produce our products at our highly automated manufacturing facility in Acton, Massachusetts and, beginning in June 2024, also at our new highly automated manufacturing plant in Malaysia, which we constructed to support our international expansion strategy and further ensure product supply.\nWe also produce our devices on manufacturing lines at a facility in China operated by a contract manufacturer. This contract manufacturing agreement expires in October 2025 and is subject to automatic renewal, unless canceled by either party under the terms of the contract.\nWe also continue to invest in supply chain efficiencies, including automation improvements at our suppliers and contract manufacturer.\nWe use a broad range of raw materials in the assembly and manufacturing of our products. We purchase our raw materials and select components used in the manufacturing of our products from external suppliers. We purchase some supplies from a single or limited number of sources for reasons of proprietary know-how, quality assurance, cost-effectiveness, or constraints resulting from regulatory requirements. We rely on a limited number of suppliers for a certain number of the components and sub-assemblies used in the manufacture of our products, including application-specific integrated circuit chips, Bluetooth low-energy chips, and other specialized parts. The design of certain components and sub-assemblies (including, in some instances, the raw materials used to manufacture them) is proprietary and the intellectual property rights may be owned exclusively by one party. In such cases, we are sole-sourced, with the supplier controlling the intellectual property rights. These sole-sourced components are critical to the design and functionality of our products. In the case of sole-sourced parts, we manage risk through holding inventory in-house and at the supplier to ensure continuity of supply and lower risk of disruption. We purchase many of our components and sub-assemblies from manufacturers with whom we are at least dual-sourced. We work closely with all suppliers to ensure continuity of supply while maintaining high quality and reliability.\nWe utilize outside vendors for the supply of components, sub-assemblies, and various services used in the manufacture of our products. Our outside vendors produce the components to our specifications, and they are audited periodically by our Quality team to confirm conformity with the specifications, policies, and procedures for our products. Our Quality team also inspects and tests our products at various steps in the manufacturing cycle to facilitate compliance with our specifications. We have received our ISO, European Union MDR, and Medical Device Single Audit Program certifications for our Quality Management System from BSI Group, an accredited Notified Body for CE Marking. Processes utilized in the manufacture, test, and release of our products have been verified and validated as required by the FDA and other regulatory bodies. As a medical device manufacturer and distributor, our manufacturing facilities and the facilities of our suppliers are subject to periodic inspection by the FDA, certain corresponding state agencies, and other regulatory bodies.\nIntellectual Property\nTo maintain a competitive advantage, we believe we must develop and preserve the proprietary aspect of our technologies. We rely on a combination of copyright, patent, trademark, trade secret, and other intellectual property laws, non-disclosure agreements, and other measures to protect our proprietary rights. We require our employees, consultants, and advisers to execute non-disclosure agreements in connection with their employment, consulting, or advisory relationships with us, where appropriate. We also require employees, consultants, and advisers who work on our products to agree to disclose and assign to us all inventions conceived during their work with us that are developed using our property or relate to our business. Despite measures taken to protect our intellectual property, unauthorized parties may attempt to copy aspects of our products or obtain and use information that we regard as proprietary.\nAs of December 31, 2024, we had over 750 patents in the United States and certain other countries, with expiration dates ranging from 2025 through 2047 and had over 550 patent applications pending. The issued patents and pending patent applications cover, among other things:\nthe basic architecture of our Omnipod products, including the pump and the Controller/PDM;\nthe Omnipod drive system;\nthe Omnipod cannula insertion system;\nsoftware, such as algorithms and apps, for controlling our current and next generation Omnipod products; and\nvarious novel aspects of our current and potential future generations of Omnipod products, and other mechanisms for the delivery of pharmaceuticals.\n\nWe have registered various trademarks associated with our business with the United States Patent and Trademark Office on the Principal Register and in other appropriate jurisdictions. Our trademarks include INSULET\n, OMNIPOD\n, SIMPLIFY LIFE\nTM\nGovernment Regulation\nUnited States FDA Regulation\nOur products are medical devices that are subject to extensive and ongoing regulation by the FDA and other federal, state, and local regulatory bodies. FDA regulations govern, among other things, product design and development, preclinical and clinical testing, pre-market clearance or approval, manufacturing, labeling, product storage, advertising and promotion, sales and distribution, post-market adverse event reporting, post-market surveillance, complaint handling, repair or recall of products, and record keeping.\nUnless an exemption applies, each medical device we seek to commercially distribute in the United States will require either prior 510(k) clearance or pre-market approval (“PMA”) from the FDA. A 510(k) pre-market notification filing must contain information establishing that the device to be sold is substantially equivalent to a device commercially distributed prior to May 28, 1976 or to a device that has been determined by the FDA to be substantially equivalent. Both the 510(k) clearance and PMA processes can be expensive and lengthy and entail significant user fees. We have obtained 510(k) clearance for Classic Omnipod, Omnipod DASH, and Omnipod 5 and expect that regulatory clearances or approvals will be needed for some of our future products. In addition, we may be required to obtain a new 510(k) clearance or pre-market approval for significant post-market modifications to our products.\nClinical trials are almost always required to support a PMA application and may also be required to support 510(k) submissions. If the device presents a “significant risk” to human health as defined by the FDA, the FDA requires the device sponsor to submit an investigational device exemption (“IDE”) and obtain IDE approval prior to commencing human clinical trials. The IDE must be supported by appropriate data, such as animal and laboratory testing results, showing that it is safe to test the device in humans and that the testing protocol is scientifically sound. Clinical trials for a significant risk device may begin once an IDE is approved by the FDA and the appropriate Institutional Review Board (“IRB”) at each clinical trial site. If the product is deemed a “non-significant risk” device, IDE approval from the FDA would not be required, but the clinical trial would need to meet other requirements including IRB approval.\nOur clinical trials must be conducted in accordance with FDA regulations and federal and state regulations concerning human subject protection, including informed consent and privacy. A clinical trial may be suspended by the FDA or at a specific site by the relevant IRB at any time for various reasons, including a belief that the risks to the trial participants outweigh the benefits of participation in the clinical trial. Even if a clinical trial is completed, the results of our clinical testing may not demonstrate the safety and efficacy of th",
  "item7_clean": "Item 7. Management’s Discussion and Analysis of Financial Condition and Results of Operations\nThe following discussion and analysis of our financial condition and results of operations should be read in conjunction with our consolidated financial statements and the accompanying notes included in this annual report. The following discussion may contain forward-looking statements that reflect our plans, estimates, and beliefs, which are subject to risks, uncertainties, and assumptions. Our actual results could differ materially from those discussed in these forward-looking statements. Factors that could cause or contribute to these differences include those discussed under the headings “Risk Factors” and “Forward-Looking Statements.”\nOur mission is to improve the lives of people with diabetes. We are primarily engaged in the development, manufacture, and sale of our proprietary Omnipod product platform, a continuous insulin delivery system for people with insulin-dependent diabetes. The Omnipod platform includes: the most recent generation Omnipod 5, and its predecessors Omnipod DASH and Classic Omnipod, all of which eliminate the need for multiple daily injections using syringes or insulin pens or the use of pump and tubing. Omnipod 5, which builds on our Omnipod DASH mobile platform, is a tubeless automated insulin delivery system that integrates with a CGM to manage blood sugar and is fully controlled by a compatible personal smartphone or Omnipod 5 Controller. The CGM is sold separately by third parties. Omnipod DASH features a secure Bluetooth enabled Pod that is controlled by a smartphone-like PDM with color touch screen user interface. We have been phasing-out Classic Omnipod as we launch Omnipod 5.\nOur financial objective is to sustain profitable growth. To achieve this, we launched Omnipod 5 in the United States in 2022 and in the United Kingdom and Germany in June and August 2023, respectively. In June 2024, we launched our full market releases of Omnipod 5 in the Netherlands and France, and most recently, in January 2025, we announced that Omnipod 5 is now available in Italy, Denmark, Finland, Norway, and Sweden. Additionally, we are working on further building our international teams and advancing our regulatory, reimbursement, and market development efforts so we can bring Omnipod 5 to additional international markets.\nIn August 2024, we received FDA clearance for an expanded indication of Omnipod 5 for people with type 2 diabetes. Due to the positive results of our Omnipod 5 type 2 pivotal trial and the learnings from our Omnipod GO commercial pilot, we made a strategic decision to drive growth in the type 2 diabetes market with Omnipod 5 and, accordingly, decided not to move forward with the commercialization of Omnipod GO.\nDuring 2024, we completed participant enrollment in our RADIANT study in France, the United Kingdom, and Belgium, which is our Omnipod 5 with Libre 2 randomized controlled trial. Similar to the randomized control trial that we completed in the United States and France for Omnipod 5 with DexCom’s G6 CGM, the objective is to provide data to support our pricing and market access initiatives as we roll out Omnipod 5 with multiple sensors across our international markets. We also continue to expand market access and awareness of Omnipod products through our direct to consumer advertising programs and through growing our presence in the U.S. pharmacy channel, where access to Omnipod 5 and Omnipod DASH is simpler and affordable, as no up-front investment is required.\nWe also continue to focus on our product development efforts, including AID offerings, such as choice of smartphone integration and CGM, and enhancing the customer experience through digital product and data capabilities. Omnipod 5 integration with Dexcom’s G6 CGM is available in every country where Omnipod 5 is available. In June 2024, we began our full market release of Omnipod 5 with Dexcom’s G7 CGM in the United States. Similarly, in June 2024 we launched our full market release of Omnipod 5 with Libre 2 Plus for individuals aged two years and older with type 1 diabetes in both the United Kingdom and Netherlands, where we offer sensor of choice (integration with either Abbott’s Libre 2 Plus or Dexcom’s G6 CGM). We also now offer sensor of choice in the United States, Italy, Denmark, Finland, Norway, and Sweden. Additionally, in October 2024, our Omnipod 5 app for iPhone compatible with Dexcom’s G6 CGM became fully available in the United States.\nFinally, we continue to take steps to strengthen our global manufacturing capabilities. In 2024, we began producing product at our newly constructed manufacturing plant in Malaysia. This plant provides us with increased capacity to satisfy our growing demand, supports our international expansion strategy, and is expected to drive higher gross margins over time.\nResults of Operations\nFactors Affecting Operating Results\nOur Pods are intended to be used continuously for up to three days, after which it may be replaced with a new disposable Pod. We recently achieved a milestone of 500,000 estimated active global customers using Omnipod products, including 365,000 global customers using Omnipod 5. The unique patented design of the Omnipod allows us to provide Pod therapy at a relatively low or no up-front investment in regions where reimbursement allows for it and our pay-as-you-go pricing model reduces the risk to third-party payors. As we grow our customer base, we expect to generate an increasing portion of our revenues through recurring sales of our disposable Pods, which provide recurring revenue.\nFollowing our strategic decision to not move forward with the commercialization of Omnipod GO discussed above, we recorded a charge of $13.5 million related to certain inventory components that we no longer expect to utilize, which is included in our consolidated statement of income for 2024.\nIn 2022, we issued two voluntary Medical Device Correction (“MDC”) notices, one for our Omnipod DASH PDM related to its battery and the other for our Omnipod 5 Controller related to its charging port and cable. During 2022, we initially recorded a net charge of $57.9 million related to these MDCs and, in 2023, we recorded $11.5 million of income associated with a change in our estimated liability for the MDCs, primarily due to lower distribution costs.\nComparison of the Years Ended December 31, 2024 and December 31, 2023\nYears Ended December 31,\nU.S.\nTotal Omnipod Products\nConstant currency revenue growth is a non-GAAP financial measure which should be considered supplemental to, and not a substitute for, our reported financial results prepared in accordance with GAAP. See “Management’s Use of Non-GAAP Measures.”\nTotal revenue increased $374.5 million, or 22.1%, to $2,071.6 million in 2024, compared with $1,697.1 million in 2023. Constant currency revenue growth of 21.9% was primarily driven by higher volume largely attributable to our growing customer base and, to a lesser extent, higher price.\nU.S.\nRevenue from the sale of Omnipod products in the U.S. increased $258.3 million, or 20.6%, in 2024 to $1,509.3 million, compared with $1,251.0 million in 2023. This increase primarily\nhigher volume through the pharmacy channel driven by growing our customer base, partially offset by a decrease in estimated inventory days-on-hand at distributors and lower conversions to Omnipod 5. Inventory days-on-hand declined to more normal levels following an acceleration of orders by U.S. pharmacy wholesales in advance of the implementation of our new ERP system on January 1, 2024. We experienced a benefit from conversions to Omnipod 5 in the prior year following the launch of the product in the latter half of 2022 since users generally fill both their Omnipod 5 starter kit and their first month of refills simultaneously. Conversions to Omnipod 5 declined since the vast majority of U.S. conversions to Omnipod 5 occurred in 2023. To a lesser extent, the revenue increase was driven by a higher average selling price resulting from our annual wholesale acquisition cost increase implemented during the second quarter of 2024 and growth in the pharmacy channel.\nRevenue from the sale of Omnipod products in the U.S. includes $587.8 million of related party revenue in 2024, compared with $473.7 million in 2023. The $114.1 million increase primarily resulted from growth through the pharmacy channel. Additional information regarding our related party transactions is provided in Note 5 to our consolidated financial statements.\nIn 2025, we expect strong U.S. revenue growth primarily driven by the benefits of our recurring revenue model and continued volume growth of Omnipod 5. Our recent type 2 indication for Omnipod 5, the launch of Omnipod 5 integrations with both Dexcom’s G7 CGM and Libre 2 Plus, and the launch our Omnipod 5 app for iPhone, are expected to contribute to an increase in our customer base.\nRevenue from the sale of Omnipod products in our international markets increased $113.3 million, or 27.6%, in 2024 to $523.4 million, compared with $410.1 million in 2023. Excluding the 0.7% favorable impact of currency exchange, the remaining 26.9% increase in revenue\nprimarily due to higher volumes from the launches of Omnipod 5 in the United Kingdom and Germany in the prior year, driven by our growing customer base and the favorable impact of conversions to\nOmnipod 5. A higher average selling price for Omnipod 5 compared with Omnipod DASH and Classic Omnipod also contributed to the revenue increase, although to a lesser extent.\nIn 2025, we expect higher International Omnipod revenue due to continued volume growth driven by new customers and conversions to Omnipod 5 primarily due to the launch of Omnipod 5 in France and the Netherlands, growth from the earlier launches in Germany and the United Kingdom, and the continued roll out of Omnipod 5 in additional markets.\nSubstantially all of our Drug Delivery revenue consists of sales of pods to Amgen for use in the Neulasta\nkit, a delivery system for Amgen’s Neulasta to help reduce the risk of infection after intense chemotherapy. Drug Delivery revenue increased $2.9 million, or 8.1%, to $38.9 million in 2024, compared with $36.0 million in 2023. This increase\nprimarily resulted from an increase in orders from our partner, partially offset by a reimbursement from our partner to cover a portion of our increased production costs in the prior year, which did not repeat in the current year.\nYears Ended December 31,\nResearch and development expenses\nSelling, general and administrative expenses\nCost of revenue for 2024 increased $88.7 million, or 16.5%, to $625.9 million, compared with $537.2 million in 2023. Gross margin was 69.8% in 2024, compared with 68.3% in 2023. The 1.5 point increase in gross margin was primarily driven\nby pricing benefits in both the U.S. pharmacy channel and in our international markets, improved manufacturing efficiencies, and procurement savings. These increases were partially offset by a\ncharge related to certain components utilized in Omnipod GO, which we decided not to commercialize, an\naccrual reversal during the prior year associated with the voluntary MDC notices we issued in 2022, which did not recur in the current year, and higher costs due to inflation.\nWe expect gross margin to further increase to approximately 70.5% in 2025 primarily due to improved manufacturing efficiencies.\nResearch and Development\nResearch and development expenses increased $14.6 million, or 7.1%, to $219.6 million for 2024, compared with $205.0 million for 2023. Research and development expenses as a percent of revenue decreased to 10.6% in 2024, compared with 12.1% in 2023 primarily due to an increase in sustaining costs following the launch of Omnipod 5 in the United States, which are included in selling, general and administrative expenses. We expect research and development spending in 2025 to increase compared with 2024 as we continue to invest in advancing our innovation and clinical pipeline.\nSelling, General and Administrative\nSelling, general and administrative expenses increased $182.3 million, or 24.8%, to $917.2 million in 2024, compared with $734.9 million in 2023. This increase was primarily attributable to year-over-year headcount additions to support our growth, international expansion and sustain Omnipod 5, and as a result of our new organizational structure. To a lesser extent, the increase was due to higher legal fees to defend our intellectual property and support our business growth; an increase in advertising expense; higher costs associated with the continued commercial rollout of Omnipod 5 in international markets; and increases in travel and expenses resulting from headcount additions.\nWe expect selling, general and administrative expenses to increase in 2025 compared with 2024 due to investments in our operating structure, primarily headcount additions, particularly in the areas of customer support, sales and information technology support, to facilitate continued growth globally. We also plan to make additional investments to support the Omnipod platform and to continue support the phased launch of Omnipod 5 in our existing international markets and prepare for expansion into new countries.\nInterest Expense and Income\nInterest expense increased $6.5 million to $42.7 million in 2024, compared with $36.2 million in 2023 primarily due to fees paid to amend our Term Loan. Interest income increased $10.9 million to $39.5 million in 2024, compared with $28.6 million in 2023 primarily driven by increased average cash balances and higher interest rates.\nOther (Expense) Income, net\nOther expense, net of $5.5 million for 2024 consists primarily of $3.8 million of loss related to fair value adjustments associated with a strategic debt investment.\n\n$2.6 million of gains related to fair value adjustments associated with our strategic debt and equity investments.\nIncome tax benefit was $118.1 million on pre-tax income of $300.2 million for 2024, compared with income tax expense of $8.3 million on pre-tax income of $214.6 million for 2023. Our effective tax rate was a benefit of 39.3% for 2024, compared with a provision of 3.9% for 2023. The decrease in our effective tax rate was primarily due to a $182.5 million non-cash tax benefit from the release of the majority of our valuation allowance against deferred tax assets discussed in Note 22 to our consolidated financial statements and a $8.3 million tax benefit from a research and development tax credit recovery project for the years 2017 through 2022. These tax benefits were partially offset by a $8.2 million decrease in tax benefits from employee stock-based compensation.\nIn 2021, the Organization for Economic Co-operation and Development (“OECD”) and G20 international forum released the Model Global Anti-Base Erosion (GloBE) rules (“Model Rules”) under Pillar Two. These Model Rules set forth the common approach for a Global Minimum Tax at 15% for multinational enterprises with revenue greater than €750 million and is expected to be applicable to Insulet. Pillar Two has been adopted by the Council of the European Union for implementation by European Union member states by December 31, 2023, with effect for tax years beginning 2024. Similar directives under Pillar Two are already adopted or expected to be adopted by taxing authorities in other countries where Insulet has business operations, with widespread implementation of the Global Minimum Tax in 2024 and 2025. There was no impact on the consolidated financial statements for 2024. While we do not expect the Pillar Two Model Rules and related legislation to have a material impact on our consolidated financial statements for 2025, we continue to evaluate their potential impact on future years.\nThe table below presents reconciliations of Adjusted EBITDA, a non-GAAP financial measure, to net income, the most directly comparable financial mea",
  "item2_clean": null
}