{
  "source_file": "pool-20241231.htm",
  "form_type": "10-K",
  "item1_clean": "Pool Corporation (the\n, which may also be referred to as\n), a member of the S&P 500 Index, is the world’s largest wholesale distributor of swimming pool supplies, equipment and related leisure products and is one of the leading distributors of irrigation and landscape maintenance products in the United States.\nWe believe that our industry is fragmented, and as such, we add considerable value to the industry by purchasing products from a large number of manufacturers and then efficiently distributing the products with high levels of service to our customer base on conditions that are more favorable than our customers could obtain on their own.\nAs of December 31, 2024, we operated 448 sales centers in North America, Europe and Australia, from which we sell swimming pool supplies, equipment and related leisure products, irrigation and landscape maintenance products and hardscape, tile and stone products to our customer base, including pool builders, retail stores, service companies, landscape contractors and others, through our five distribution networks listed below:\nSCP Distributors (SCP);\nSuperior Pool Products (Superior);\nHorizon Distributors (Horizon);\nNational Pool Tile (NPT); and\nSun Wholesale Supply (Sun Wholesale).\nWe operate in the outdoor living industry, which services approximately 11.0 million bodies of water in the United States alone, including 5.4 million in-ground swimming pools. These pools require routine maintenance throughout their lifetime, and we believe significant growth opportunities reside with pool remodel and pool equipment replacement activities due to the aging of the installed base of swimming pools. We continue to add products to take advantage of technological advancements and the development of sustainable, energy-efficient and more aesthetically attractive products. We believe that the pool industry will continue to grow with the increased penetration of new pools into households with the discretionary income and physical capacity to install a swimming pool. Further, we believe the desire for consumers to enhance their outdoor living spaces with water-sensing and battery-powered alternatives, hardscapes, lighting and other outdoor living-related products provides us with additional future growth opportunities.\nOver the past several years, favorable demographic and socioeconomic trends have positively impacted our industry, and we believe these trends will continue over the long term. These favorable trends include the following:\nlong-term growth in housing units in warmer climate markets due to the population migration toward the southern United States, where outdoor home entertainment is more prevalent and extends longer throughout the year;\nincreased homeowner spending on outdoor living spaces for relaxation and entertainment as lower housing turnover encourages consumers to renovate their existing homes;\nconsumers bundling the purchase of a swimming pool and other products, with new irrigation systems, landscaping and improvements to outdoor living spaces often being key components to both pool installations and remodels;\nconsumers using more automation and control products, higher quality materials and other pool features that add to our sales opportunities over time; and\nconsumers increasing focus on sustainable, energy-efficient products.\nIn 2024, we estimate that close to 65% of our sales through the swimming pool industry are related to maintenance and minor repair of existing swimming pools. Maintaining a safe and consistent water chemistry as well as necessary upkeep and repair of swimming pool equipment, such as pumps, heaters, filters and safety equipment, creates non-discretionary demand for pool chemicals, equipment and other related parts and supplies. The recurring nature of the maintenance and repair market has helped maintain a relatively consistent rate of industry contribution to revenue over time. This characteristic has helped buffer our performance when unfavorable economic conditions, such as higher interest rates and softness in the housing market, adversely impact consumer discretionary spending, including pool construction and major replacement and renovation activities. As the installed base of in-ground swimming pools ages, we also believe cosmetic considerations such as a pool’s\nappearance and the overall look of backyard environments create ongoing demand for our other discretionary and non-discretionary products.\nThe following table reflects growth in the domestic installed base of in-ground swimming pools over the past 11 years (based on Company estimates for 2024 and information from 2023 P.K. Data, Inc. reports):\nWe estimate that just over 20% of our current year sales were derived from the swimming pool remodel, renovation and upgrade market. The activity in this market, which includes major swimming pool remodeling and upgrading, is driven by the aging of the installed base of pools and availability of enhanced feature products such as swimming pool automated controls, variable speed pumps, robotic cleaners and LED pool and hot tub lighting. Many new homeowners with existing pools transform older pools into a modern backyard oasis through upgraded features, finishes and equipment. Among other factors such as the southern population migration and housing shortage trends, the timing of these types of expenditures is more sensitive to economic factors including home values, existing single-family home sales and consumer confidence as compared to the non-discretionary demand of the maintenance and minor repair market.\nWe estimate that new swimming pool construction comprised almost 15% of 2024 sales. The demand for new pools is generally driven by the perceived benefits of pool ownership including increased use of outdoor space, enhanced property value, relaxation, entertainment, family activity, exercise and convenience. The industry competes for new pool sales against other discretionary consumer purchases such as kitchen and bathroom remodeling, boats, motorcycles, recreational vehicles and vacations.\nThe irrigation and landscape maintenance industry shares many characteristics with the pool industry, and we believe that it exhibits similar long-term growth potential. Irrigation system installations often occur in tandem with new single-family home construction making them more susceptible to economic variables that drive new home sales. However, the landscape industry offers similar maintenance-related growth opportunities as the swimming pool industry. Product offerings such as chemicals and fertilizers, power equipment and related repair and maintenance services offer recurring revenue streams in an industry otherwise closely tied to the new housing market. The irrigation and landscape maintenance distribution business serves both residential and commercial markets, with the majority of sales related to the residential market. Within the United States market, we believe that residential and commercial irrigation systems, landscape maintenance products, power equipment, hardscapes and specialty outdoor products and accessories offer a total addressable market value of approximately $19.0 billion.\nEconomic Environment\nCertain trends in the housing market, the cost and availability of consumer credit and general economic conditions (as commonly measured by Gross Domestic Product or GDP) affect our industry, particularly the installation of new pools and irrigation systems, as well as the timing and extent of pool remodels, equipment replacements, landscaping projects and outdoor living space renovations. Consumers typically spend more on new pools, new irrigation systems, renovations and replacement when general economic conditions are strong.\nExisting home turnover continued to decline in 2024 driven by high interest rates and homeowners taking advantage of their existing lower rate mortgages. Nonetheless, new home construction grew versus a decline in new pool construction, creating more available backyards for swimming pools when economic conditions stabilize. We believe that over the long term, higher rates of home appreciation and turnover have a positive impact on new pool installations. While most new swimming pools are installed in existing homes, there has also been a correlation of new pool construction activity to new home construction activities over time. We also believe that homeowners’ discretionary spending capacity, availability of consumer credit and favorable borrowing rates are critical factors enabling the purchase of new swimming pools and irrigation systems. Similar to other discretionary purchases, replacement and renovation activities are more heavily impacted by economic factors such as consumer confidence, GDP and employment levels. During periods of high demand, contractor labor availability can limit our customers’ ability to fully meet consumer construction and renovation demand.\nIn recent years, steady increases in home values, lack of affordable new homes and increased mortgage rates have prompted homeowners to stay in their homes longer. Although homeowners’ investment in their houses has moderated from the pandemic heightened levels of 2020 to 2022, home investment levels generally remain favorable. We estimate that new in-ground pool construction units decreased 15% from 72,000 units in 2023 to approximately 61,000 units in 2024 as demand has continued to normalize and was particularly pressured by the unfavorable macroeconomic environment. We expect that consumers will continue to invest in outdoor living spaces as they consider backyards an extension of their home space. We believe that we are well positioned to benefit from the inherent long-term growth opportunities in our industry fueled by favorable population migration trends, strong housing demand dynamics and product developments and technological advancements as consumers focus on more sustainable and energy-efficient products.\nWe generally pass industry price increases through our supply chain and from time to time may make strategic volume inventory purchases ahead of vendor price increases in order to obtain favorable pricing. During 2022, supply chain interruptions, production shutdowns and weather-related events resulted in an increased inflation benefit of 10% as higher costs to produce and transport finished products were passed through to consumers. Inflationary product cost increases moderated in 2023 to approximately 3% to 4%. In 2024, inflationary product cost increases returned to our historical average of approximately 1% to 2%, which we expect to continue into 2025.\nBusiness Strategy and Growth Strategy\nOur mission is to provide exceptional value to our customers and suppliers, creating exceptional return to our shareholders, while providing exceptional opportunities to our employees. Our core strategies are as follows:\nto promote the growth of our industry;\nto promote the growth of our customers’ businesses; and\nto continuously strive to operate more effectively.\nWe promote the growth of our industry through various advertising and promotional programs intended to raise consumer awareness of new and existing product offerings by our vendors, the benefits and affordability of pool ownership, the ease of pool maintenance and the many ways in which a pool and the surrounding spaces may be enjoyed beyond swimming. These programs include digital and media advertising, industry-oriented website development such as www.swimmingpool.com®, www.hottubs.com® and www.nptpool.com®, social media platforms and other digital marketing initiatives, including our new, all-inclusive Regal and E-Z Clor Pool Care mobile apps that enable at-home water testing, as well as our NPT® Backyard mobile app. We use these programs as tools to educate consumers and lead prospective pool owners to our customers. We also promote the growth of our industry by offering a growing selection of energy-efficient and environmentally",
  "item7_clean": "Item 7. Management’s Discussion and Analysis of Financial Condition and Results of Operations\nFor a discussion of our base business calculations, see the RESULTS OF OPERATIONS section below.\n2024 FINANCIAL OVERVIEW\nNet sales decreased 4% to $5.3 billion in 2024 compared to $5.5 billion in 2023. Base business results approximated consolidated results for the year. Maintenance activities remained stable throughout 2024, reflecting steady demand for non-discretionary products, while sales of discretionary products for new pool construction and remodeling were softer, impacted by macroeconomic conditions. Inflationary product cost increases moderated, benefiting net sales approximately 1% to 2% in 2024, compared to 3% to 4% in 2023.\nGross profit was $1.6 billion in 2024, a 5% decrease from gross profit of $1.7 billion in 2023. Gross margin declined 30 basis points to 29.7% in 2024 compared to 30.0% in 2023. Pricing optimization efforts, the reversal of previously recorded estimated import taxes in the first quarter of 2024 and higher volume-related purchase incentives compared to last year benefited our current year gross margin. These impacts were offset by a less favorable product and customer mix.\nSelling and administrative expenses (operating expenses) increased 5%, or $44.7 million, to $958.1 million in 2024. As a percentage of net sales, operating expenses increased 150 basis points to 18.0% in 2024 compared to 16.5% in 2023. Expense growth drivers included higher costs associated with the expansion of our network and our technology initiatives as well as inflationary rent, wage and insurance increases. These increases were partially mitigated by close management of variable costs.\nOperating income for the year decreased 17% to $617.2 million, down from $746.6 million in 2023. Operating margin decreased 190 basis points to 11.6% in 2024 compared to 13.5% in 2023.\nInterest and other non-operating expenses, net for the year was reduced by $8.2 million compared to 2023, primarily due to lower average debt between periods.\nWe recorded an $8.8 million, or $0.23 per diluted share, tax benefit from Accounting Standards Update (ASU) 2016-09,\nImprovements to Employee Share-Based Payment Accounting,\nfor the year ended December 31, 2024 compared to a tax benefit of $6.7 million, or $0.17 per diluted share, realized in 2023.\nNet income declined 17% to $434.3 million in 2024 compared to $523.2 million in 2023. Earnings per share decreased 15% to $11.30 per diluted share compared to $13.35 per diluted share in 2023. Without the impact from ASU 2016-09 in both periods, earnings per diluted share decreased 16% to $11.07 per diluted share compared to $13.18 per diluted share in 2023. See RESULTS OF OPERATIONS below for definitions of our non-GAAP measures and reconciliations of our non-GAAP measures to GAAP measures.\nFinancial Position and Liquidity\nNet cash provided by operations was $659.2 million in 2024. Our cash flows were impacted by our inventory reduction efforts in 2023 and lower net income in 2024. These impacts were partially offset by a benefit of $68.5 million from the deferral of our third and fourth quarter estimated tax payments, subsequently paid in February 2025, as allowed for companies impacted by Hurricane Francine. Our 2024 operating cash flows helped to fund the following initiatives:\nshare repurchases including related excise tax payments, totaling $306.3 million for the year;\nquarterly cash dividend payments to shareholders, totaling $179.6 million for the year;\na $103.0 million debt reduction; and\nnet capital expenditures and acquisitions of $64.2 million.\nTotal net receivables, including pledged receivables, decreased 8% compared to December 31, 2023, primarily due to lower sales in 2024. Our allowance for doubtful accounts was $8.6 million at December 31, 2024 and $11.7 million at December 31, 2023. Our days sales outstanding ratio, as calculated on a trailing four quarters basis, was 26.3 days at December 31, 2024 and 26.8 days at December 31, 2023.\nOur inventory management efforts reduced our inventory levels by 6% to $1.3 billion, compared to $1.4 billion at December 31, 2023, outpacing the 4% decline in net sales. Our reserve for inventory obsolescence was $26.7 million at December 31, 2024 compared to $23.5 million at December 31, 2023. Our inventory turns, as calculated on a trailing four quarters basis, were 2.8 times at December 31, 2024 and 2.7 times at December 31, 2023.\nTotal debt outstanding of $950.4 million at December 31, 2024 decreased $103.0 million compared to December 31, 2023 as we have used operating cash flows to reduce our debt.\nCurrent Trends and Outlook\nConsumers’ investments in their homes, including backyard renovations, continue to be favorable. In recent years, steady increases in home values, lack of affordable new homes and increased mortgage rates have positioned homeowners to stay in their homes longer and upgrade their home environments, including their backyards. During the COVID-19 pandemic (generally 2020 through 2022), we experienced unprecedented demand as families spent more time at home and sought opportunities to create or expand home-based outdoor living and entertainment spaces. This trend had a positive impact on our financial performance during 2020 through 2022. Beginning in the latter half of 2022 through 2024, these trends moderated resulting in lagging new pool construction and remodeling activities. As a result, in 2024, we estimate that new in-ground pool construction units decreased 15% from 72,000 units in 2023 to 61,000 units, impacted by lower discretionary activities and further pressured by the macroeconomic environment.\nMarket conditions in 2024 were challenged by generally higher than normal interest rates and product cost and labor inflation, which led to consumer hesitancy on discretionary spending and some cyclical suppression of demand. While these market conditions impacted new pool construction and remodeling projects, our non-discretionary maintenance product sales in 2024 were not significantly impacted. As lower housing turnover encourages consumers to renovate their existing homes, we expect that consumers will continue to invest in outdoor living spaces as they consider backyards an extension of their home space. We believe that we are well positioned to benefit from the inherent long-term growth opportunities in our industry fueled by favorable population migration trends, positive housing demand dynamics, and product developments and technological advancements as consumers focus on more sustainable and energy-efficient products.\nIn view of current trends, we established our outlook for 2025 based on reasonable expectations for industry demand, pricing and inflationary conditions, continued capacity creation to have a positive impact on variable expenses, continued investment in our digital transformation initiatives and ongoing leverage of existing investments in our business and continuous process improvements. We also plan to broaden our geographic presence by opening 8 to\nnew sales centers in 2025 and by making selective acquisitions when appropriate opportunities arise.\nWe base our assumptions on normal weather conditions and do not incorporate alternative weather predictions into our guidance. Favorable weather positively impacts industry activity by accelerating growth in any given year, expanding the number of available construction days, extending the pool season and pool usage and positively impacting demand for discretionary products. Conversely, unfavorable weather typically impedes growth.\nThe following summarizes our outlook for 2025:\nWe expect sales to be flat to a low single digit increase compared to 2024, impacted by the following factors and assumptions:\nnormal weather patterns for 2025;\nsustained demand for pool maintenance products;\nsimilar volumes of discretionary products used for pool construction and remodeling, renovation and upgrading of pools as 2024;\ninflationary product cost increases, which generally pass through to customers of approximately 1% to 2%; and\none less selling day in the first quarter and for the full year of 2025 compared to 2024.\nWe project gross margin for the full year of 2025 to be in the range of our 2024 gross margin at 29.7% and our long-term target of 30.0%, with our highest margin in the second quarter of the year. We expect that our long-term gross margin target will be more achievable as construction trends improve. Our actual gross margin will depend on changes in product and customer mix and on amounts and timing of sales and inflationary price increases.\nWe expect to leverage our existing infrastructure and strategically manage discretionary spending. We project that our operating expenses in 2025 will be impacted by the following factors:\nan increase of approximately $15.0 million in performance-based compensation to incentivize and reward our employees;\n$10.0 million of spend for new sales centers as we further expand our sales center network;\ncontinued investment in technological solutions to enhance our customer service; and\ninflationary increases in areas such as labor and occupancy costs with some offsets from our efficiency initiatives.\nIn 2025, we expect our effective tax rate will be around 25% without the impact of ASU 2016-09. Our effective tax rate is dependent upon our results of operations and may change if actual results are different from our current expectations. Due to ASU 2016-09 requirements, we expect our effective tax rate will fluctuate from quarter to quarter, particularly in periods when employees elect to exercise their vested stock options or when restrictions on share-based awards lapse. We estimate that we have approximately $3.2 million in unrealized excess tax benefits related to stock options that expire and restricted awards that vest in the first quarter of 2025. We may recognize additional tax benefits related to stock option exercises in 2025 from grants that expire in years after 2025, for which we have not included any expected benefits in our guidance. The estimated impact related to ASU 2016-09 is subject to several assumptions which can vary significantly, including our estimated share price and the period that our employees will exercise vested stock options. We recorded an $8.8 million benefit in our provision for income taxes for the year ended December 31, 2024 related to ASU 2016-09.\nWe project that 2025 earnings will be in the range of $11.08 to $11.58 per diluted share, including an estimated $0.08 benefit from ASU 2016-09 during the first quarter of 2025. We expect to continue to use cash for the payment of cash dividends as and when declared by our Board and to fund opportunistic share repurchases over the next year.\nCRITICAL ACCOUNTING ESTIMATES\nCritical accounting estimates are those estimates made in accordance with U.S. generally accepted accounting principles that involve a significant level of estimation uncertainty and have had, or are reasonably likely to have, a material impact on our financial condition or results of operations.\nManagement has discussed the development, selection and disclosure of our critical accounting estimates with the Audit Committee of our Board. Our critical accounting estimates are discussed below, including, to the extent material and reasonably available, the impact such estimates have had, or are reasonably likely to have, on our financial condition or results of operations.\nAllowance for Doubtful Accounts\nWe maintain an allowance for doubtful accounts based on an estimate of the losses we will incur if our customers do not make required payments. We perform periodic credit evaluations of our customers and typically do not require collateral. Consistent with industry practices, we generally require payment from our North American customers within 30 days, except for sales under early buy programs for which we provide extended payment terms to qualified customers. The extended terms usually require payments in equal installments in April, May and June or May and June, depending on geographic location. Credit losses have generally been within or better than our expectations.\nSimilar to our business, our customers’ businesses are seasonal. Sales are lowest in the winter months and our past due accounts receivable balance as a percentage of total receivables generally increases during this time. We provide reserves for uncollectible accounts based on our accounts receivable aging. These reserves range from 0.05% for amounts currently due to up to 100% for specific accounts more than 60 days past due.\nAt the end of each quarter, we perform a reserve analysis of all accounts with balances greater than $20,000 and more than 60 days past due. Additionally, we perform a separate reserve analysis on the balance of our accounts receivables with emphasis on past due accounts. We estimate future losses based upon historical bad debts, customer receivable balances, age of customer receivable balances, customers’ financial conditions and current and forecasted economic trends, including certain trends in the housing market, the availability of consumer credit and general economic conditions (as commonly measured by Gross Domestic Product or GDP). We monitor housing market trends through review of the House Price Index as published by the Federal Housing Finance Agency, which measures the movement of single-family home prices.\nDuring the year, we write off account balances when we have exhausted reasonable collection efforts and determined that the likelihood of collection is remote. These write-offs are charged against our allowance for doubtful accounts. In the past five years, write-offs have averaged approximately 0.10% of net sales annually. Write-offs as a percentage of net sales approximated 0.16% in 2024, 0.12% in 2023 and 0.08% in 2022. We expect that write-offs will range from 0.05% to 0.10% of net sales in 2025.\nAt the end of each fiscal year, we prepare a hindsight analysis by comparing the prior year-end allowance for doubtful accounts balance to (i) current year write-offs and (ii) any significantly aged outstanding receivable balances. Based on our most recent hindsight analysis, we concluded that the prior year allowance was within a range of acceptable estimates and that our estimation methodology is appropriate.\nIf the balance of the accounts receivable reserve increased or decreased by 20% at December 31, 2024, pretax income would change by approximately $1.7 million and earnings per share would change by approximately $0.03 per diluted share (based on the number of weighted average diluted shares outstanding for the year ended December 31, 2024).\nInventory Obsolescence\nProduct inventories represent the largest asset on our balance sheet. Our goal is to manage our inventory such that we minimize stock-outs to provide the highest level of service to our customers. To do this, we maintain at each sales center an adequate inventory of stock keeping units (SKUs) with the highest sales volumes. At the same time, we continuously strive to better manage our slower moving classes of inventory, which are not as critical to our customers and thus, inherently turn at slower rates.\nWe establish our reserve for inventory obsolescence based on inventory with lower sales velocity and inventory with no sales for the past 12 months, which we believe represent some exposure to inventory obsolescence. The reserve is intended to reflect the value of inventory at net realizable value. We have not changed our methodology from prior years.\nIn evaluating the adequacy of our reserve for inventory obsolescence, we consider a combination of factors, including:\nthe level of inventory in relation to historical sales by product, including inventory usage based on product sales at both the sales center level and on a company-wide basis;\nchanges in customer preferences or regulatory requireme",
  "item2_clean": null
}