{
  "source_file": "ppg-20250930.htm",
  "form_type": "10-Q",
  "item1_clean": null,
  "item7_clean": null,
  "item2_clean": "Item 2. Management’s Discussion and Analysis of Financial Condition and Results of Operations\nNet sales were approximately $4.1 billion for the three months ended September 30, 2025, an increase of 1% compared to the prior year primarily due to higher selling prices, higher sales volumes and the favorable impact of foreign currency translation, partially offset by the divestiture of the silicas products business and the architectural coatings business in Russia.\nIncome before income taxes was $556 million for the three months ended September 30, 2025, a decrease of $22 million compared to the prior year, primarily due to the unfavorable impact of wage and other cost inflation, divestitures and higher other charges/(income), partially offset by increased manufacturing productivity and cost-control measures.\nResults of Operations\n($ in millions, except percentages)\nCost of sales, exclusive of depreciation and amortization\nSelling, general and administrative\nResearch and development, net\nOther charges/(income), net\nN/A\n($ in millions, except percentages)\nUnited States and Canada\nEMEA\nThree Months Ended September 30, 2025\nNet sales increased $50 million due to the following:\n● Favorable foreign currency translation\n● Higher selling prices (+1%)\n● Higher sales volumes (+1%)\nPartially offset by:\n● Divestiture-related sales (-3%)\nCost of sales, exclusive of depreciation and amortization, increased $45 million primarily due to higher sales volumes and the unfavorable impact of foreign currency translation, partially offset by divestitures.\nSelling, general and administrative expense decreased $24 million primarily due to cost-control measures and the impact of divestitures, partially offset by overhead cost inflation, the unfavorable impact of foreign currency translation, and the cost of providing transition services related to the recently divested U.S. and Canada architectural coatings business, which are fully reimbursed by the buyer under transition services agreements.\nDepreciation expense increased $17 million primarily due to higher accelerated depreciation related to approved restructuring actions.\nOther charges/(income), net increased by $24 million primarily due to net impairment and other related charges related to a consolidated joint venture in the Performance Coatings segment and higher net foreign currency translation expense, partially offset by gains recognized on the sale of non-core assets, a sales and use tax refund received during the third quarter 2025, and income recognized in connection with transition services agreements with the buyer of PPG's recently divested U.S. and Canada architectural coatings business.\nNine Months Ended September 30, 2025\nNet sales decreased $155 million due to the following:\n● Divestiture-related sales (-3%)\nPartially offset by:\n● Higher selling prices (+1%)\n● Higher sales volumes (+1%)\nCost of sales, exclusive of depreciation and amortization, decreased by $36 million primarily due to divestitures and increased manufacturing productivity, partially offset by increases in sales volumes.\nSelling, general and administrative expense decreased by $22 million primarily due to cost-control measures and divestitures, partially offset by overhead cost inflation and the cost of providing transition services related to the recently divested U.S. and Canada architectural coatings business, which are fully reimbursed by the buyer under transition services agreements.\nDepreciation expense increased by $24 million primarily due to higher accelerated depreciation related to approved restructuring actions.\nOther charges/(income), net decreased by $5 million primarily due to income recognized in connection with transition services agreements with the buyer of PPG's recently divested U.S. and Canada architectural coatings business, gains recognized on the sale of non-core assets, the absence of a second quarter 2024 non-cash loss on the sale of the traffic solutions business in Argentina and a sales and use tax refund received in the third quarter 2025, partially offset by impairment and other related charges related to a consolidated joint venture in the Performance Coatings segment and higher net foreign currency translation expense.\nEffective Tax Rate and Earnings Per Diluted Share\n($ in millions, except percentages and amounts per share)\nAdjusted effective tax rate, continuing operations*\nEarnings per diluted share, continuing operations\nAdjusted earnings per diluted share*\n*See Regulation G Reconciliation below\nBoth Earnings per diluted share, continuing operations and Adjusted earnings per diluted share for the three months ended September 30, 2025 increased year over year due to higher selling prices, cost-control actions, increased manufacturing productivity and lower adjusted weighted average common shares outstanding due to share repurchases, partially offset by wage and other cost inflation and divestitures.\nBoth Earnings per diluted share, continuing operations and Adjusted earnings per diluted share for the nine months ended September 30, 2025 decreased year-over-year primarily due to raw material, wage and other cost inflation, divestitures and the unfavorable impact of foreign currency translation, partially offset by higher selling prices, cost-control actions, increased manufacturing productivity and lower adjusted weighted average common shares outstanding due to share repurchases.\nRegulation G Reconciliations - Results from Operations\nPPG believes investors’ understanding of the Company’s performance is enhanced by the disclosure of net income from continuing operations, earnings per diluted share from continuing operations, PPG’s effective tax rate and segment income adjusted for certain items. PPG’s management considers this information useful in providing insight into the Company’s ongoing performance because it excludes the impact of items that cannot reasonably be expected to recur on a quarterly basis or that are not attributable to our primary operations. Net income from continuing operations, earnings per diluted share from continuing operations, the effective tax rate and segment\nincome adjusted for these items are not recognized financial measures determined in accordance with U.S. generally accepted accounting principles (“U.S. GAAP”) and should not be considered a substitute for net income from continuing operations, earnings per diluted share from continuing operations, the effective tax rate, segment income or other financial measures as computed in accordance with U.S. GAAP. In addition, adjusted net income, adjusted earnings per diluted share and the adjusted effective tax rate may not be comparable to similarly titled measures as reported by other companies.\nIncome before income taxes from continuing operations is reconciled to adjusted income before income taxes from continuing operations, the effective tax rate from continuing operations is reconciled to the adjusted effective tax rate from continuing operations and net income from continuing operations (attributable to PPG) and earnings per share – assuming dilution (attributable to PPG) are reconciled to adjusted net income from continuing operations (attributable to PPG) and adjusted earnings per share – assuming dilution below.\nThree Months Ended September 30, 2025\n($ in millions, except percentages and per share amounts)\nIncome Before Income Taxes\nNet Income (attributable to PPG)\nEarnings Per Diluted Share\nAs reported, continuing operations\nAcquisition-related amortization expense\nBusiness restructuring-related costs, net\nPortfolio optimization\nImpairment and other related charges, net\nAdjusted, continuing operations, excluding certain items\nThree Months Ended September 30, 2024\n($ in millions, except percentages and per share amounts)\nIncome Before Income Taxes\nNet Income (attributable to PPG)\nEarnings Per Diluted Share\nAs reported, continuing operations\nAcquisition-related amortization expense\nPortfolio optimization\nAdjusted, continuing operations, excluding certain items\nNine Months Ended September 30, 2025\n($ in millions, except percentages and per share amounts)\nIncome Before Income Taxes\nNet Income (attributable to PPG)\nEarnings Per Diluted Share\nAs reported, continuing operations\nAcquisition-related amortization expense\nBusiness restructuring-related costs, net\nPortfolio optimization\nN/A\nImpairment and other related charges, net\nLegacy environmental remediation charges\nAdjusted, continuing operations, excluding certain items\nNine Months Ended September 30, 2024\n($ in millions, except percentages and per share amounts)\nIncome Before Income Taxes\nNet Income (attributable to PPG)\nEarnings Per Diluted Share\nAs reported, continuing operations\nAcquisition-related amortization expense\nBusiness restructuring-related costs, net\nPortfolio optimization\nLegacy environmental remediation charges\nAdjusted, continuing operations, excluding certain items\nEarnings per diluted share is calculated based on unrounded numbers. Figures in the table may not recalculate due to rounding.\nBusiness restructuring-related costs, net include business restructuring charges, offset by releases related to previously approved programs, which are included in Other charges/(income), net on the condensed consolidated statement of income, accelerated depreciation of certain assets, which is included in Depreciation on the condensed consolidated statement of income and other restructuring-related costs, which are included in Cost of sales, exclusive of depreciation and amortization and Selling, general and administrative on the condensed consolidated statement of income.\nPortfolio optimization includes gains and losses on the sale of non-core assets, including net gains in the first and third quarter 2025 and a loss recognized on the sale of the Company’s traffic solutions business in Argentina in the second quarter 2024, which are included in Other charges/(income), net in the condensed consolidated statement of income. Po"
}