{
  "source_file": "ppl-20241231.htm",
  "form_type": "10-K",
  "item1_clean": "Franchises and Licenses\nPPL Electric provides electricity delivery service in its service territory pursuant to certain franchises, licenses, statutory service areas, easements and other rights or permissions granted by the Pennsylvania state legislature, cities or municipalities or other entities.\nPursuant to authorizations from the Commonwealth of Pennsylvania and the PAPUC, PPL Electric operates a regulated distribution monopoly in its service area. Accordingly, PPL Electric does not face competition in its electricity distribution business. Pursuant to the Customer Choice Act, generation of electricity is a competitive business in Pennsylvania, and PPL Electric does not own or operate any generation facilities.\nThe PPL Electric transmission business, operating under a FERC-approved PJM Open Access Transmission Tariff, is subject to competition pursuant to FERC Order 1000 from entities that are not incumbent PJM transmission owners with respect to the construction and ownership of transmission facilities within PJM.\nRates and Regulation\nPPL Electric's transmission facilities are within PJM, which operates the electricity transmission network and electric energy market in the Mid-Atlantic and Midwest regions of the U.S.\nPJM serves as a FERC-approved Regional Transmission Operator (RTO) to promote greater participation and competition in the region it serves. In addition to operating the electricity transmission network, PJM also administers regional markets for energy, capacity and ancillary services. A primary objective of any RTO is to separate the operation of, and access to, the transmission grid from market participants that buy or sell electricity in the same markets. Electric utilities continue to own the transmission assets and to receive their share of transmission revenues, but the RTO directs the control and operation of the transmission facilities. Certain types of transmission investments are subject to competitive processes outlined in the PJM tariff.\nPPL Electric's transmission revenues are billed in accordance with a FERC-approved Open Access Transmission Tariff that utilizes a formula-based rate recovery mechanism. Under this formula, beginning in 2023, rates are put into effect on January 1st of each year based upon actual expenditures from the most recently filed FERC Form 1, forecasted capital additions, and other data based on PPL Electric’s books and records. 2023 was considered a transitional period as the calendar year rate approved by FERC became effective April 1, 2023. Rates are compared during the year to the estimated annual expenses and capital additions that will be filed in PPL Electric’s annual FERC Form 1, filed under the FERC's Uniform System of Accounts. Under the mechanism, any difference between the revenue requirement in effect and actual expenditures incurred for that year is recorded as a regulatory asset or regulatory liability, and the regulatory asset or regulatory liability is to be recovered from or returned to customers starting one year after the conclusion of the rate year.\nAs a PLR, PPL Electric also purchases transmission services from PJM. See \"PLR\" below.\nSee Note 7 to the Financial Statements for additional information on rate mechanisms and regulatory matters.\nPPL Electric's distribution base rates are calculated based on a return on rate base (net utility plant plus a cash working capital allowance less plant-related deferred taxes and other miscellaneous additions and deductions). All regulatory assets and liabilities, except accumulated deferred income taxes, are excluded from the return on rate base. Therefore, no return is earned on the related assets unless specifically provided for by the PAPUC. Currently, PPL Electric's Smart Meter rider and the DSIC are the only riders authorized to earn a return. Certain operating expenses are also included in PPL Electric's distribution base rates including wages and benefits, other operation and maintenance expenses, depreciation and taxes.\nPennsylvania's Alternative Energy Portfolio Standard (AEPS) requires electric distribution companies and electricity generation suppliers to obtain from alternative energy resources a portion of the electricity sold to retail customers in Pennsylvania. Under the default service procurement plans approved by the PAPUC, PPL Electric purchases all of the alternative energy generation supply it needs to comply with the AEPS.\n\nThere are currently no other electric or gas public utilities operating within the service area of RIE.\nAlternative energy sources such as electricity, oil, propane and other fuels indirectly impact RIE's natural gas revenues. Marketers may also compete to sell natural gas to certain large end-users. RIE's natural gas tariffs include gas price pass-through mechanisms relating to its sale of natural gas as a commodity. Therefore, customer natural gas purchases from alternative suppliers do not generally impact RIE's profitability. Some large industrial and commercial customers, however, may physically bypass RIE's facilities and seek delivery service directly from interstate pipelines or other natural gas distribution systems.\nRates and Regulation\nIn general, RIE operates subject to the jurisdiction of the FERC, the RIPUC and the Rhode Island Division of Public Utilities and Carriers.\nRIE owns and maintains electric and natural gas distribution networks in Rhode Island. Distribution revenues are primarily from the sale of electricity, natural gas, and related services to retail customers. Distribution sales are regulated by the RIPUC, which is responsible for approving the rates and other terms of services as part of the rate making process. Natural gas and electric distribution revenues are derived from the regulated sale and distribution of electricity and natural gas to residential, commercial, and industrial customers within RIE’s service territory under the tariff rates. The tariff rates approved by the RIPUC are designed to recover the costs incurred by RIE for products and services provided, along with a return on investment.\nRIE’s distribution base rates are calculated based on a return on rate base (net utility plant plus a cash working capital allowance less plant-related deferred taxes and other miscellaneous additions and deductions). All regulatory assets and liabilities, except accumulated deferred income taxes, are excluded from the return on rate base. Therefore, no return is earned on the related assets unless specifically provided for by the RIPUC. Currently, RIE's ISR and Renewable Energy Growth Program adjustment mechanisms are the only mechanisms authorized to earn a return. Certain operating expenses are also included in RIE’s distribution base rates including wages and benefits, other operation and maintenance expenses, depreciation, and taxes.\nRIE owns an electric transmission system in Rhode Island. RIE’s transmission services are regulated by the FERC and coordinated with ISO – New England.\nRIE records revenues in accordance with accounting principles for rate-regulated operations for arrangements between RIE and the applicable regulator. These include various deferral mechanisms such as capital trackers, energy efficiency programs, and other programs that qualify as Alternative Revenue Programs (ARPs). ARPs enable RIE to adjust rates in the future, in response to past activities or completed events. RIE’s electric and gas distribution rates both have a revenue decoupling mechanism, which allows for annual adjustments to the RIE’s delivery rates, as a result of the reconciliation between allowed revenue and billed revenue. RIE also has other ARPs related to the achievement of certain objectives, demand side management initiatives, and certain other rate making mechanisms. RIE recognizes ARPs with a corresponding offset to a regulatory asset or liability account when the regulatory specified events or conditions have been met, when the amounts are determinable, and are probable of recovery (or payment) through future rate adjustments.\n\nPPL Electric’s electricity generation costs are established based upon the results of a competitive solicitation process. In December 2020, the PAPUC approved PPL Electric’s default service plan for the period June 1, 2021 through May 31, 2025, which included a total of eight solicitations for electricity supply held semiannually in April and October. Through December 31, 2024, all auctions of the plan were completed. This plan also included eight solicitations for alternative energy credits held semiannually in January and July. Through January 2025, all alternative energy credit solicitations have been completed.\nOn November 7, 2024, the PAPUC approved PPL Electric's default service plan for the period of June 1, 2025 through May 31, 2029, which includes a total of eight solicitations for electricity supply held semiannually in February and July. The new plan also includes solicitations for alternative energy credits held annually in July with the first solicitation in July 2025 and the final solicitation in July 2029.\nPursuant to the plans, PPL Electric contracts for all electricity supply for residential, commercial and industrial customers who elect to take default service from PPL Electric. These solicitations contain a mix of products including 10-year block energy contracts for residential customers, 12- and 24-month fixed-price load-following contracts for residential and small commercial and industrial customers, 12-month real-time pricing contracts for large commercial and industrial customers, and alternative energy credit contracts for residential, commercial and industrial customers. These contracts fulfill PPL Electric's obligation to provide customer electricity supply as a PLR.\nNumerous alternative suppliers have offered to provide generation supply in PPL Electric's service area. As the cost of generation supply is a pass-through cost for PPL Electric, its financial results are not impacted if its customers purchase electricity supply from these alternative suppliers.\nRhode Island Regulated Segment\n(PPL)\nThe Rhode Island Regulated segment consists primarily of the regulated electricity transmission and distribution operations and regulated distribution and sale of natural gas conducted by RIE.\nRIE is engaged in the regulated transmission, distribution and sale of electricity and regulated distribution and sale of natural gas in Rhode Island. RIE provides electric service to approximately 515,000 customers and natural gas service to approximately 280,000 customers. RIE's service area covers substantially all of Rhode Island.\nFranchises and Licenses\nRIE provides electricity delivery service and natural gas distribution service in its service territory pursuant to certain franchises, licenses, statutory service areas, easements and other rights or permissions granted by the Rhode Island state legislature, cities or municipalities or other entities.\n\nThe charge for LRS is the sum of the applicable LRS charges in addition to all appropriate Retail Delivery charges as stated in the applicable tariff. The monthly charge for LRS also includes the costs incurred by RIE to comply with the Renewable Energy Standard, established in Rhode Island General Laws Section 39-26-1 and the costs to comply with the RIPUC’s Rules Governing Energy Source Disclosure. The charge for LRS includes the administrative costs associated with the procurement of LRS, including an adjustment for uncollectible accounts as approved by the RIPUC.\nNumerous alternative suppliers have offered to provide generation supply in RIE's service area. As the cost of generation supply is a pass-through cost for RIE, its financial results are not impacted if its customers purchase electricity supply from these alternative suppliers.\nSee Note 7 to the Financial Statements for additional information on rate mechanisms and regulatory matters.\nNatural Gas Distribution Supply\nTo meet the projected",
  "item7_clean": null,
  "item2_clean": null
}