{
  "source_file": "pru-20250930.htm",
  "form_type": "10-Q",
  "item1_clean": null,
  "item7_clean": null,
  "item2_clean": "We analyze the performance of our segments and Corporate and Other operations using a measure of segment profitability called adjusted operating income. See “—Segment Measures” below for a discussion of adjusted operating income and its use as a measure of segment operating performance.\nAnnual Reviews and Update of Assumptions and Other Refinements\nDuring the second quarter of each year, we perform an annual comprehensive review of the assumptions used for estimating future premiums, benefits, and other cash flows, including reviews related to mortality, morbidity, lapse, surrender, and other contractholder behavior assumptions, and economic assumptions, including expected future rates of returns on investments. The Company generally looks to relevant Company experience as the primary basis for these assumptions; however, if relevant Company experience is not available or does not have sufficient credibility, the Company may look to experience of similar blocks of business, either elsewhere within the Company or within the industry. As part of this review, we may update these assumptions and make refinements to our models based upon emerging experience, future expectations and other data, including any observable market data we feel is indicative of a long-term trend. These assumptions are generally reviewed annually unless a material change in our own experience or in industry experience made available to us is observed in an interim period that we feel is also indicative of a long-term trend. Generally, we do not expect trends to change significantly in the short-term and, to the extent these trends may change, we expect such changes to be gradual over the long-term. The impact on our results of operations of changes in these assumptions can be offsetting and we are unable to predict their movement or offsetting impact over time.\nShown below are the impacts on our adjusted operating income from updates of actuarial assumptions and other refinements as discussed above. The information below is presented by each segment and Corporate and Other operations and includes a reconciliation of these impacts to the impacts within income (loss) before income taxes and equity in earnings of joint ventures and other operating entities.\nFavorable (unfavorable) impact to adjusted operating income before income taxes by segment:\nRetirement Strategies\nTotal U.S. Businesses\nInternational Businesses\nTotal segment favorable (unfavorable) impact to adjusted operating income before income taxes\nRealized investment gains (losses), net, and related charges and adjustments\nChange in value of market risk benefits, net of related hedging gains (losses)\nDivested and Run-off Businesses:\nClosed Block division\nOther Divested and Run-off Businesses\nFavorable (unfavorable) impact to consolidated income (loss) before income taxes and equity in earnings of joint ventures and other operating entities\nShown below are the adjusted operating income contributions of each segment and Corporate and Other operations for the periods indicated and a reconciliation of this segment measure of performance to “Income (loss) before income taxes and equity in earnings of joint ventures and other operating entities” as presented in the Unaudited Interim Consolidated Statements of Operations.\nAdjusted operating income before income taxes by segment:\nPGIM\nRetirement Strategies(1)\nTotal U.S. Businesses(1)\nInternational Businesses\nTotal segment adjusted operating income before income taxes(1)\nRealized investment gains (losses), net, and related charges and adjustments(1)(2)\nChange in value of market risk benefits, net of related hedging gains (losses)\nMarket experience updates\nDivested and Run-off Businesses(3):\nClosed Block division\nOther Divested and Run-off Businesses\nEquity in earnings of joint ventures and other operating entities and earnings attributable to noncontrolling interests(4)\nOther adjustments(5)\nConsolidated income (loss) before income taxes and equity in earnings of joint ventures and other operating entities\nThe amounts for the three and nine months ended September 30, 2024 reflect the correction of an error related to indexed variable and fixed annuity products within the Retirement Strategies segment. See “—Retirement Strategies” for additional information. Prior period amounts have been updated to conform to current period presentation.\nGeneral Account Investments” and Note 19 to the Unaudited Interim Consolidated Financial Statements for additional information.\nRepresents the contribution to income (loss) of Divested and Run-off Businesses that have been or will be sold or exited, including businesses that have been placed in wind-down, but did not qualify for “discontinued operations” accounting treatment under U.S. GAAP. See “—Divested and Run-off Businesses” for additional information.\nEquity in earnings of joint ventures and other operating entities is included in adjusted operating income but excluded from “Income (loss) before income taxes and equity in earnings of joint ventures and other operating entities” as it is reflected on an after-tax U.S. GAAP basis as a separate line in the Unaudited Interim Consolidated Statements of Operations. Earnings attributable to noncontrolling interests are excluded from adjusted operating income but included in “Income (loss) before income taxes and equity in earnings of joint ventures and other operating entities” as they are reflected on a U.S. GAAP basis as a separate line in the Unaudited Interim Consolidated Statements of Operations. Earnings attributable to noncontrolling interests represents the portion of earnings from consolidated entities that relates to the equity interests of minority investors.\nIncludes certain components of consideration for business acquisitions, which are recognized as compensation expense over the requisite service periods.\nSegment results for the period presented above reflect the following:\nPGIM.\nResults for both the\nthird quarter and the first\nof 2025 increased in comparison to the prior year periods, primarily reflecting higher net asset management fees and higher net service, distribution and other revenues, driven by a gain on sale of our asset management business in Taiwan, partially offset by higher expenses, primarily reflecting charges resulting from a business reorganization. Results for\n\ndue to lower average separate account values driven by net outflows from the run-off of the traditional variable annuity block, partially offset by favorable equity markets and higher amortization costs.\nRevenues, Benefits and Expenses\nThree Month Comparison\n. Revenues from our Institutional Retirement Strategies business decreased $3,719 million, primarily reflecting lower pension risk transfer premiums due to lower sales in the current quarter, with corresponding offsets in policyholders’ benefits, as discussed below.\nBenefits and expenses of our Institutional Retirement Strategies business decreased $3,761 million, primarily driven by a decrease in policyholders’ benefits, including changes in reserves, related to the lower pension risk transfer premiums discussed above\nRevenues from our Individual Retirement Strategies business increased $111 million, primarily driven by higher net investment income due to growth in indexed variable and fixed annuities and higher income from non-coupon investments. This variance was partially offset by lower asset management and service fees, as well as lower policy charges and fee income due to lower average separate account values driven by net outflows from the run-off of the traditional variable annuity block, partially offset by favorable equity markets. Also contributing to the variance was lower other income driven by the impact of less favorable short-term interest rates on collateral posted to counterparties.\nBenefits and expenses of our Individual Retirement Strategies business increased $85 million, primarily driven by higher interest credited to policyholders’ account balances and higher amortizations costs reflecting business growth, partially offset by lower general and administrative expenses, net of capitalization.\nNine Month Comparison\n. Revenues from our Institutional Retirement Strategies business decreased $12,686 million. Excluding the impact of our annual reviews and update of assumptions and other refinements, as discussed above, revenues decreased $13,074 million primarily reflecting lower pension risk transfer premiums due to the absence of significant sales that occurred in the prior year period, with corresponding offsets in policyholders’ benefits, as discussed below.\nBenefits and expenses of our Institutional Retirement Strategies business decreased $12,545 million. Excluding the impact of our annual reviews and update of assumptions and other refinements, as discussed above, benefits and expenses decreased $13,097 million, primarily driven by a decrease in policyholders’ benefits, including changes in reserves, related to the lower pension risk transfer premiums discussed above\nRevenues from our Individual Retirement Strategies business increased $295 million. Excluding the impact of our annual reviews and update of assumptions and other refinements, as discussed above, revenues increased $287 million primarily driven by higher net investment income from growth in indexed variable and fixed annuities and higher income from non-coupon investments. This variance was partially offset by lower asset management and service fees, as well as lower policy charges and fee income due to lower average separate account values driven by net outflows from the run-off of the traditional variable annuity block, partially offset by favorable equity markets. Also contributing to the variance was lower other income driven by the impact of less favorable short-term interest rates on collateral posted to counterparties.\nBenefits and expenses of our Individual Retirement Strategies business increased $358 million. Excludin"
}