{
  "source_file": "pru-20241231.htm",
  "form_type": "10-K",
  "item1_clean": "On December 18, 2001, The Prudential Insurance Company of America (“PICA”) converted from a mutual life insurance company owned by its policyholders to a stock life insurance company and became a wholly-owned subsidiary of Prudential Financial. The demutualization was carried out under PICA’s Plan of Reorganization, which required us to establish and operate a regulatory mechanism known as the “Closed Block.” The Closed Block includes certain in-force participating insurance and annuity products and corresponding assets that are used for the payment of benefits and policyholders’ dividends on these products, as well as certain related assets and liabilities.\nOur principal operations consist of PGIM (our global investment management business), our U.S. Businesses (consisting of our Retirement Strategies, Group Insurance and Individual Life businesses), our International Businesses, the Closed Block division and our Corporate and Other operations. The Closed Block division is accounted for as a divested business that is reported separately from the Divested and Run-off Businesses that are included in Corporate and Other. Divested and Run-off Businesses are composed of businesses that have been, or will be, sold or exited, including businesses that have been placed in wind-down status that do not qualify for “discontinued operations” accounting treatment under generally accepted accounting principles in the United States of America (“U.S. GAAP”). Our Corporate and Other operations include corporate items and initiatives that are not allocated to business segments as well as the Divested and Run-off Businesses described above. See Note 23 to the Consolidated Financial Statements for revenues, income and loss, and total assets by segment.\nIn September 2023, we, together with Warburg Pincus and a group of institutional investors, announced the launch of Prismic Life Reinsurance, Ltd. (“Prismic Re”), a licensed Bermuda-based life and annuity reinsurance company. In conjunction with this announcement, we made an initial equity investment through our Corporate and Other operations of approximately $200 million, equivalent to a 20% interest, in Prismic Life Holding Company LP (“Prismic”), the Bermuda-exempted limited partnership that owns all of the outstanding capital stock of Prismic Re. We expect the increased reinsurance capacity that this partnership provides to support our vision of expanding access to investing, insurance, and retirement security for people around the world. As this investment is accounted for under the equity method, both Prismic and Prismic Re are considered related parties. For additional information regarding related party transactions, see Note 24 to the Consolidated Financial Statements.\nOur strategy centers on leveraging our mutually-reinforcing business system to become a higher growth, less market-sensitive and more nimble company. Our business system includes a mix of high-quality protection, retirement and investment management businesses which creates growth potential by capitalizing on long-term, durable trends to provide customers with integrated cross-business solutions, as well as generate capital benefits from a balanced risk profile. We believe that we are well-positioned to meet the needs of customers and tap into significant market opportunities through PGIM, our U.S. Businesses and our International Businesses. See “Management’s Discussion and Analysis of Financial Condition and Results of Operations” for additional information.\nPGIM\nProvides investment management services and solutions related to public fixed income, public equity, real estate debt and equity, private credit and other alternatives, and multi-asset class strategies, to institutional and retail clients globally, as well as our insurance and retirement businesses.\nOur products and services are offered through the following businesses:\n—provides global active asset management services across public fixed income markets, as well as alternatives.\n—provides active fundamental public equity and fixed income asset management services across an array of growth, value, global and specialty equity strategies, as well as fixed income strategies.\nPGIM Quantitative Solutions\n—provides a range of systematic, customized solutions across equity, multi-asset, and liquid alternative platforms.\nPGIM Private Capital\n—provides private credit solutions across the risk spectrum including investment grade, high yield, direct lending and mezzanine financing.\n—provides a broad range of public and private real estate debt and equity strategies as well as private equity investments with a focus on secondary transactions in the small and mid-cap market.\n—offers actively managed investment solutions, including mutual funds, listed and unlisted closed-end funds, exchange-traded funds (“ETFs”) and separately managed accounts to individual investors, defined contribution plans and financial intermediaries in the U.S., as well as Undertakings for the Collective Investment in Transferable Securities (“UCITS”) and other investment solutions to financial intermediaries in select countries across Europe, Asia and Latin America. Additionally, operates local asset management businesses in Taiwan and India and has interests in an operating joint venture in China.\nPGIM Multi-Asset Solutions\n—provides public and private multi-asset class liability-driven investment solutions to institutional clients.\nWe hold seed and co-investments in some of our investment products to either (i) seed new products or investment strategies in order to develop a track record prior to obtaining third-party investments, or (ii) co-invest alongside clients in PGIM-managed funds to demonstrate that our interests are aligned with theirs.\nMarketing and Distribution\nWe primarily distribute products through the following channels:\nProprietary sales force for each PGIM business with independent marketing and client service teams.\nPGIM’s Institutional Relationship Group, which develops relationships with, and introduces PGIM’s broad capabilities to, large institutions globally.\n\nRetirement Strategies\nServes the retirement needs of both our institutional and individual customers. Our Institutional Retirement Strategies business develops and distributes retirement investment and income products and services to retirement plan sponsors in the public, private and not-for-profit sectors, both domestically and internationally, primarily within the United Kingdom. Our Individual Retirement Strategies business develops and distributes individual variable and fixed annuity products in the U.S., primarily to mass affluent (households with investable assets or annual income in excess of $100,000) and affluent (households with investable assets in excess of $250,000) customers with a focus on innovative product design and risk management strategies.\nWe offer a variety of products and solutions to serve different retirement needs and goals:\nInstitutional Retirement Strategies\n: products that provide a predictable source of monthly income, generally for the life of the annuitant.\nPension risk transfer—non-participating group annuity insurance and reinsurance contracts issued to pension plan sponsors and intermediaries, under which we assume all investment and actuarial risk associated with a group of specified participants within a plan in return for a premium typically paid as a lump-sum at inception.\nPension risk transfer—longevity reinsurance contracts with counterparties from which we earn a fee for assuming the longevity risk of pension plans that have been insured by third-parties. Premiums for these products are typically paid over the duration of the contract as opposed to a lump-sum at inception.\n: products where our obligations are backed by our general account, and where we bear some or all of the investment and asset-liability management risk, depending on the product.\nInvestment-only products—for use in institutional capital markets and qualified plans primarily including fee-based wraps through which customers’ funds are held in a client-owned trust and investment results pass through to the customer. We earn fee revenue for providing a guaranteed minimum interest rate backed by the general account.\nGuaranteed Investment Contracts and Funding Agreements—contain an obligation to pay interest at a specified rate and to repay principal at maturity or following contract termination.\n: includes structured settlements and other group annuities.\nIndividual Retirement Strategies\nIndexed Variable Annuities\n\nDevelops and distributes life insurance, retirement products, investment products and certain accident and health products with fixed benefits to mass affluent and affluent customers through our Life Planner operations in Japan, Brazil and Mexico. Our Gibraltar Life and Other operations also provide similar products, as well as advisory and administration services, through multiple distribution channels (including Life Consultants, banks and independent agencies) to broad middle income and mass affluent customers across Japan, through our joint ventures in Chile, China, India and Indonesia, and through our strategic investments in Ghana, Kenya and South Africa\nOur products are classified into the following four categories:\nLife Insurance Protection Products\n—include various traditional whole life products that provide either level or increasing coverage, and that offer limited or lifetime premium payment options.\nWe also offer increasing, decreasing and level benefit term insurance products that provide coverage for a specified time period, as well as protection-oriented variable life products.\nSome of these protection products are denominated in U.S. dollars and some are sold as bundled products that, in addition to death protection, include health benefits or savings elements.\n—include retirement income products that combine insurance protection similar to term life with:\nA lifetime income stream that commences at a predefined age;\nA savings-oriented variable life product that provides a non-guaranteed return linked to an underlying investment portfolio of equity and fixed income funds selected by the customer; and\nEndowments that provide payment of the face amount on the earlier of death or policy maturity.\n—primarily represented by U.S. dollar- and yen-denominated investment contracts sold by our operations in Japan and include:\nSingle-pay products where credited interest rates are guaranteed for a specified period of time and impose a market value adjustment if the contract is not held to maturity.\nVariable and indexed annuities that provide a non-guaranteed return or a return based on a selected index with performance subject to certain contractual maximums and minimums providing downside protection.\nAccident and Health Products\n—that provide the following:\nBenefits to cover accidental death and dismemberment, hospitalization, surgeries, as well as costs of cancer and other dread diseases often sold as supplementary riders and not as stand-alone products; and\nWaiver of premium coverage where required premiums are waived in the event the customer suffers a qualifying disability.\nMarketing and Distribution\nOur marketing and distribution efforts are conducted through the following proprietary agent models and third-party channels:\nProprietary agent models:\nfocus on selling protection-oriented life insurance products on a needs basis to mass affluent and affluent customers, as well as retirement-oriented products to small businesses. We believe that our recruiting and selection process, training programs and compensation packages are key to the Life Planner model and have helped our Life Planner operations achieve higher levels of agent retention, agent productivity and policy persistency.\na proprietary distribution force for products offered by our Gibraltar Life operations. Their focus is to provide individual protection products to the broad",
  "item7_clean": "Our former insurance operations in Argentina, Prudential of Argentina (“POA”), historically utilized the Argentine peso as its functional currency given it is the currency of the primary economic environment in which the entity operated. During 2018, Argentina experienced a cumulative inflation rate that exceeded 100% over a 3-year period. As a result, Argentina’s economy was deemed to be highly inflationary, resulting in reporting changes effective July 1, 2018. Under U.S. GAAP, the financial statements of a foreign entity in a highly inflationary economy are to be remeasured as if its functional currency (formerly the Argentine peso) is the reporting currency of its parent reporting entity (the USD) on a prospective basis. While this changed how the results of POA were remeasured and/or translated into USD, the impact to our financial statements was not material given the relative size of those operations. As discussed further in “—International Businesses” below, in March 2024, the Company entered into a definitive agreement to sell POA and transferred these operations into the Divested and Run-off Businesses that are included within our Corporate and Other operations. The transaction was completed in May 2024.\nEnterprise Group, our strategic investment in Ghana, has historically utilized the Ghanaian cedi as its functional currency given it is the currency of the primary economic environment in which the entity operates. In the fourth quarter of 2023, Ghana experienced a cumulative inflation rate that exceeded 100% over a 3-year period. As a result, Ghana’s economy was deemed to be highly inflationary, which requires the results of our investment in Enterprise Group to be remeasured in USD, effective January 1, 2024, as per the U.S. GAAP requirements described above. The impact to our financial statements was not material nor is it expected to have a material impact to our financial statements in future periods given the relative size of the investment.\nAccounting Policies & Pronouncements\nApplication of Critical Accounting Estimates\nThe preparation of financial statements in conformity with U.S. GAAP requires the application of accounting policies that often involve a significant degree of judgment. Management, on an ongoing basis, reviews the estimates and assumptions used in the preparation of the Company’s financial statements. If management determines that modifications to assumptions and estimates are appropriate given current facts and circumstances, the Company’s results of operations and financial position as reported in the Consolidated Financial Statements could change significantly.\nThe following sections discuss the accounting policies applied in preparing our financial statements that management believes are most dependent on the application of estimates and assumptions and require management’s most difficult, subjective, or complex judgments.\nInsurance Liabilities\nFuture Policy Benefits\nFuture Policy Benefit Reserves, including Unpaid Claims and Claim Adjustment Expenses\nWe establish reserves for future policy benefits to, or on behalf of, policyholders using methodologies prescribed by U.S. GAAP. The reserving methodologies used include the following:\nFor most long-duration contracts, we utilize a net premium valuation methodology in measuring the liability for future policy benefits. Under this methodology, the Company accrues a liability for future policy benefits when premium revenue is recognized. The liability is based on the present value of expected future benefits to be paid to or on behalf of policyholders and related non-level claim settlement expenses less the present value of expected future net premiums (portion of the gross premium required to provide for all benefits and related non-level claim settlement expenses using current best estimate assumptions). A net-to-gross (“NTG”) ratio is calculated as the ratio of the present value of expected policy benefits and non-level claim settlement expenses divided by the present value of expected gross premiums. The NTG ratio is applied to gross premiums, as premium revenue is recognized, to determine net premiums that are subtracted from the present value of expected benefits and non-level claim settlement expenses to determine the liability for future policy benefits, which cannot be less than zero. The NTG ratio at the cohort measurement unit level cannot exceed 100%, and if it exceeds 100%, the excess benefit expenses are recorded as a charge to current period earnings. The result of the net premium valuation methodology is that the liability at any point in time represents an accumulation of the portion of premiums received to date expected to fund future benefits (i.e., net premiums received to date), less any benefits and expenses already paid. The liability does not necessarily reflect the full policyholder obligation the Company expects to pay at the conclusion of the contract since a portion of that obligation would be funded by net premiums received in the future and would be recognized in the liability at that time. The insurance cash\nflow assumptions are updated quarterly to reflect actual experience and are generally updated annually to reflect changes in best estimate future insurance cash flow assumptions using a retrospective unlocking method with the impact recorded through current period earnings. At the time of an experience or best estimate assumption unlocking, a revised NTG ratio is calculated using actual historical cash flow experience and updated, if any, best estimate future cash flow assumptions, discounted using the locked-in discount rate. The revised NTG ratio is then applied to prior period cash flows to derive a cumulative catch-up adjustment as of the beginning of the quarter. The revised NTG ratio is then used going forward to accrue the reserve, until the next unlocking. The liability is also remeasured each quarter using a current discount rate, based on an upper-medium grade fixed-income instrument yield, with the impact recorded through accumulated other comprehensive income. Expense assumptions included in the liability only include claim related expenses and exclude acquisition costs and non-claim related costs such as costs relating to investments, general administration, policy maintenance, product development, market research, and general overhead.\nFor limited-payment contracts, in addition to the liability calculated using the net premium valuation method described above, a deferred profit liability (“DPL”) is established for the amount of gross premiums received in excess of expected net premiums and is amortized into premium income in relation to the discounted amount of insurance in force for life insurance or expected benefit payments for annuity contracts. The DPL is subject to a retrospective unlocking adjustment consistent with the liability for future policy benefits.\nFor certain contract features, such as no-lapse guarantees, a liability is established when associated assessments (which include investment margin on policyholders’ account balances deposited to fixed and indexed funds and policy charges for administration, mortality, expense, surrender, and other charges) are recognized. This liability is established using current best estimate assumptions and is based on the ratio of the present value of total expected excess payments (e.g., payments in excess of account value) over the life of the contract divided by the present value of total expected assessments (i.e., benefit ratio). The liability equals the current benefit ratio multiplied by cumulative assessments recognized to date, plus interest, less cumulative excess payments to date. The liability does not necessarily reflect the full policyholder obligation the Company expects to pay at the conclusion of the contract since a portion of that excess payment would be funded by assessments received in the future and would be recognized in the liability at that time. The reserves are subject to adjustments based on annual reviews of assumptions and quarterly adjustments for experience as described below, including market performance. These adjustments reflect the impact on the benefit ratio of using actual historical experience from the issuance date to the balance sheet date plus updated estimates of future experience. The updated benefit ratio is then applied to all prior periods’ assessments to derive an adjustment to the reserve recognized through a benefit or charge to current period earnings.\nFor universal life type contracts and participating contracts, the Company performs premium deficiency tests using best estimate assumptions, at a minimum, on an annual basis, and on a quarterly basis for business whose profitability is closely tied to equity market performance. If the current net reserves are less than the best estimate liability, the existing net reserves are adjusted by first reducing the associated deferred sales inducements (“DSI”) or value of business acquired (“VOBA”) by the amount of the deficiency or to zero through a charge to current period earnings. If the deficiency is more than the DSI or VOBA for insurance contracts, the net reserves are increased by the excess through a charge to current period earnings. Since investment yields are used as the discount rate, the premium deficiency test is also performed using a discount rate based on the market yield (i.e., assuming what would be the impact if any unrealized gains (losses) were realized as of the testing date). In the event that by using the market yield a deficiency occurs, an adjustment is established for the deficiency and is included in AOCI.\nAnnual assumptions review and quarterly adjustments\nThe assumptions used in establishing reserves are generally based on the Company’s experience, industry experience and/or other factors, as applicable. We update our actuarial assumptions, such as mortality, morbidity, retirement and policyholder behavior assumptions, annually unless a material change in our own experience or in industry experience made available to us is observed in an interim period that we feel is indicative of a long-term trend. Generally, we do not expect trends to change significantly in the short-term and, to the extent these trends may change, we expect such changes to be gradual over the long term.\nWe perform an annual comprehensive review of the assumptions used for estimating future premiums, benefits, and other cash flows, including reviews related to mortality, morbidity, lapse, surrender, and other contractholder behavior assumptions, and economic assumptions, including expected future rates of returns on investments. The Company generally looks to relevant Company experience as the primary basis for these assumptions. If relevant Company experience is not available or does not have sufficient credibility, the Company may look to experience of similar blocks of business, either elsewhere within the Company or within the industry. As part of this review, we may update these assumptions and make refinements to our models\nbased upon emerging experience, future expectations and other data, including any observable market data we feel is indicative of a long-term trend. The impact on our results from operations of changes in these assumptions can be offsetting and we are unable to predict their movement or impact over time.\nThe quarterly adjustments for market performance referred to above reflect the impact of changes to our estimate of future rates of returns on investments to reflect actual fund performance and market conditions. A portion of returns on investments for our variable life contracts are dependent upon the total rate of return on assets held in separate account investment options. This rate of return influences the fees we earn and expected claims to be paid on variable life contracts, as well as other sources of profit. Returns that are higher than our expectations for a given period produce higher than expected account balances, which increase the future fees we expect to earn on variable life contracts and decrease expected claims to be paid on variable life contracts. The opposite occurs when returns are lower than our expectations.\nThe weighted average rate of return assumptions used in developing estimated market returns consider many factors specific to each product type, including asset durations, asset allocations and other factors. With regard to equity market assumptions, the near-term future rate of return assumption used in evaluating liabilities for future policy benefits for certain of our products, primarily our domestic and international variable life insurance products, is generally updated each quarter and is derived using a reversion to the mean approach, a common industry practice. Under this approach, we consider historical equity returns and adjust projected equity returns over an initial future period of five years (the “near-term”) so that equity returns converge to the long-term expected rate of return. If the near-term projected future rate of return is greater than our near-term maximum future rate of return of 15.0%, we use our maximum future rate of return. If the near-term projected future rate of return is lower than our near-term minimum future rate of return of 0%, we use our minimum future rate of return. As of December 31, 2024, our domestic variable life insurance businesses assume an 8.0% long-term equity expected rate of return and a 2.9% near-term mean reversion equity expected rate of return, and our international variable life insurance business assumes a 5.0% long-term equity expected rate of return and a 0.2% near-term mean reversion equity expected rate of return.\nWith regard to interest rate assumptions used in evaluating liabilities for future policy benefits for certain of our products, we update the long-term and near-term future rates used to project fixed income returns annually and quarterly, respectively. As a result of our 2024 annual reviews and update of assumptions and other refinements, we increased our long-term expectation of both the 10-year U.S. Treasury rate and 10-year Japanese Government Bond yield by 25 basis points, and now grade to rates of 3.50% and 1.25%, respectively, over ten years. As part of our quarterly market experience updates, we update our near-term projections of interest rates to reflect changes in current rates. For additional information regarding discount rates used to establish the liability for future policy benefits, see Note 2 to the Consolidated Financial Statements.\nThe following paragraphs provide additional details about the reserves we have established:\nInternational Businesses.\nThe reserves for future policy benefits of our International Businesses, which as of December 31, 2024, represented 37% of our total future policy benefit reserves, primarily relate to non-participating whole life and term life products and endowment contracts, and are generally calculated using the net premium valuation methodology, as described above. The primary assumptions used in determining expected future benefits and expenses include mortality, lapse, morbidity, and interest rate assumptions. Reserves also include claims reported but not yet paid, and claims incurred but not yet reported. In addition, future policy benefit reserves for certain contracts also include amounts related to our deferred profit liability, as described above.\nInstitutional Retirement Strategies.\nThe reserves for future policy benefits of our Institutional Retirement Strategies segment, which as of December 31, 2024, represented 32% of our total future policy benefit reserves, primarily relate to our non-participating life contingent group annuity and structured settlement products and are generally calculated using the net premium valuation methodology, as described above. The primary assumptions used in establishing these reserves include mortal",
  "item2_clean": null
}