{
  "source_file": "psa-20241231.htm",
  "form_type": "10-K",
  "item1_clean": "Cautionary Statement Regarding Forward-Looking Statements\nThese forward-looking statements speak only as of the date of this report or as of the dates indicated in the statements. All of our forward-looking statements, including those in this report, are qualified in their entirety by this cautionary statement. We expressly disclaim any obligation to update publicly or otherwise revise any forward-looking statements, whether as a result of new information, new estimates, or other factors, events, or circumstances after the date of these forward-looking statements, except when expressly required by law. Given these risks and uncertainties, you should not rely on any forward-looking statements in this report, or which management may make orally or in writing from time to time, neither as predictions of future events nor guarantees of future performance.\nGeneral Discussion of our Business\nPublic Storage is a Maryland real estate investment trust (“REIT”) engaged in the ownership, development, and operation of self-storage facilities and other related operations including tenant reinsurance, third-party self-storage management and bridge lending to third-party self-storage owners. We are the industry leading owner of self-storage properties, with the most recognized brand in the self-storage industry, including our ubiquitous orange color.\nOn August 14, 2023, we completed a reorganization that resulted in us holding the interests in our facilities through an operating partnership, Public Storage OP, L.P. and its subsidiaries including Public Storage Operating Company, formerly known as Public Storage, which was organized in 1980. This structure is commonly referred to as an umbrella partnership REIT, or UPREIT. After the reorganization, the primary assets of the parent entity, Public Storage, are general partner and limited partner interests in Public Storage OP, L.P.\nUnless stated otherwise or the context otherwise requires, references to “Public Storage” mean the parent entity, Public Storage, references to “PSA OP” mean Public Storage OP, L.P., and references to “PSOC” mean Public Storage Operating Company. References to “the Company,” “we,” “us,” and “our” mean collectively Public Storage, PSA OP, PSOC and those entities/subsidiaries owned or controlled by Public Storage, PSA OP, and PSOC.\nSelf-storage Operations\nWe acquire, develop, own, and operate self-storage facilities, which offer storage spaces for lease on a month-to-month basis, for personal and business use. We are the largest owner of self-storage facilities in the United States (“U.S.”), with physical presence in most major markets and 40 states. We believe our scale, brand name, and technology platform afford us competitive advantages. At December 31, 2024, we held interests in and consolidated 3,073 self-storage facilities (an aggregate of 221 million net rentable square feet of space) operating under the Public Storage® name.\nWe manage insurance programs whereby customers at our facilities, including those we manage for third parties, have the option of purchasing insurance from a non-affiliated insurance company to cover certain losses to their stored goods. A wholly-owned, consolidated subsidiary of Public Storage fully reinsures these policies and thereby assumes all risk of losses under the policies. This subsidiary receives from the non-affiliated insurance company reinsurance premiums substantially equal to the premiums collected from our tenants. These policies cover claims for losses related to specified events up to a maximum limit of $5,000 per storage unit. We reinsure all risks in this program but purchase insurance from an independent third-party insurer to cover this exposure for a limit of $15.0 million for losses in excess of $10.0 million per occurrence. At December 31, 2024, there were approximately 1.4 million certificates of insurance held by participating self-storage customers, representing aggregate coverage of approximately $6.8 billion.\nAt December 31, 2024, we managed 307 facilities for third parties (with approximately 23.3 million net rentable square feet), and were under contract to manage 95 additional facilities including 93 facilities that are currently under construction. In addition, we sell merchandise, primarily locks and cardboard boxes, at our self-storage facilities.\nWe implemented a bridge lending program in 2024, under which we provide financing to third-party self-storage owners for operating properties that we manage. We generally originate bridge loans that are collateralized by operating self-storage properties, have a term of three or four years with two one-year extensions, and have variable interest rates. At December 31, 2024, we had a bridge loan receivable balance of $10.0 million and an unfunded loan commitment of $12.5 million, the closing of which is subject to the satisfaction of certain conditions.\nWe hold a 35% interest in Shurgard Self Storage Limited (“Shurgard”). Shurgard is a public company traded on Euronext Brussels under the “SHUR” symbol. At December 31, 2024, Shurgard owned and operated 318 self-storage facilities (17 million net rentable square feet) located in seven countries in Western Europe under the Shurgard® name.\nFor all periods presented herein, we have elected to be treated as a REIT, as defined in the Internal Revenue Code of 1986, as amended (the “Code”). For each taxable year in which we qualify for taxation as a REIT, we will not be subject to U.S. federal corporate income tax on our “REIT taxable income” (generally, taxable income subject to specified adjustments, including a deduction for dividends paid and excluding our net capital gain) that is distributed to our shareholders. We believe we met these requirements in all periods presented herein and we expect to continue to qualify as a REIT.\nOwnership and operation of self-storage facilities is highly fragmented. As the largest owner of self-storage facilities, we believe that we own approximately 9% of the self-storage square footage in the U.S. and that collectively the four largest self-storage owners in the U.S. own approximately 20%, with the remaining 80% owned by regional and local operators. We believe our Public Storage® brand awareness, as well as the innovative improvements we have made to the customer experience described below, provide us with a competitive advantage in acquiring and retaining customers relative to other self-storage operators.\nThe high level of ownership fragmentation in the industry is partially attributable to the relative simplicity of managing a local self-storage facility, such that small-scale owners can operate self-storage facilities at a basic level of profitability without significant managerial or operational infrastructure. Our facilities compete with nearby self-storage facilities owned by other operators, who use marketing channels, including Internet advertising, signage, and banners, and offer services similar to ours. As a result, competition is significant and affects the occupancy levels, rental rates, rental income, and operating expenses of our facilities. However, we believe that the economies of scale inherent in this business allow us to operate self-storage facilities at a materially higher level of cash flow per square foot than other operators without our scale.\nWe believe technology enables revenue optimization and cost efficiencies. Over the past few years, we have invested in additional technologies that we believe have enabled us to operate and compete more effectively by providing customers with an enhanced digital experience.\nConvenient shopping experience:\nCustomers can conveniently shop for available storage space, reviewing attributes such as facility location, size, amenities (such as climate-control), and pricing through the following marketing channels:\nThe online marketing channel is a key source of customers. Approximately 83% of our move-ins in 2024 were sourced through our website, and we believe that many of our other customers who reserved directly through our customer care center or arrived at a facility and moved in without a reservation reviewed our pricing and availability online through our website. We seek to update the structure, layout, and content of our website regularly to enhance our placement in “unpaid” search in Google and related websites, to improve the efficiency of our bids in “paid” search campaigns, and to maximize users’ likelihood of reserving space on our website.\nOur Customer Care Center:\nOur customer care center is staffed by skilled sales specialists and customer service representatives. Customers can reach our customer care center and complete their rental over the phone by calling our advertised toll-free telephone numbers provided on search engines, from our website, the Public Storage App, or from our in-store kiosks. We believe giving customers the option to interact with a live agent, despite the higher marginal cost relative to a reservation made on our website, enhances our ability to close sales with potential customers and results in greater satisfaction. We also have live Internet chat augmented with ChatBot capability as another channel for our customers to engage our agents, cost effectively improving customer responsiveness.\nCustomers can also shop for available space at any one of our facilities. Property managers access the same information that is available on our website and to our customer care center agents and can inform the customer of available space at that site or at our other nearby storage facilities. Property managers are trained to maximize the conversion of such “walk in” shoppers into customers. We are expanding the use of in-store kiosks to give customers the options of a full self-service experience or a two-way video assisted service via our existing customer care center.\neRental® move-in process:\nTo further enhance the move-in experience, we offer our eRental® process whereby prospective tenants (including those who initially reserved a space) can execute their rental agreement from their smartphone or computer and then go directly to their space on the move-in date. Approximately 70% of customers utilized our eRental® and Rent by Phone process during 2024.\nWe maintain an industry leading customer smartphone application. The Public Storage App provides our customers with digital access to our properties, as well as payment and other account management functions.\nCentralized information network:\nOur centralized reporting and information network enables us to identify changing market conditions and operating trends and analyze customer data. Our network allows us to quickly change each of our individual property’s pricing and promotions, and drive marketing spending, such as the relative level of bidding for various paid search terms on paid search engines.\nGrowth and Investment Strategies\nOur ongoing growth strategies consist of: (i) improving the operating performance of our existing self-storage facilities, (ii) acquiring and developing facilities, and (iii) growing ancillary business activities including tenant reinsurance, third-party management services and a bridge lending program. While our long-term strategy includes each of these elements, in the short term the level of growth in our asset base in any period is dependent upon the cost and availability of capital, as well as the relative attractiveness of available investment alternatives.\nImprove the operating performance of existing facilities:\nWe regularly update and enhance our strategies to increase the net cash flow of our existing self-storage facilities through maximizing revenues and controlling operating costs. We maximize revenues through striking the appropriate balance between occupancy and rates for new and existing tenants by regularly adjusting (i) our promotional and other discounts, (ii) the rental rates we charge to new and existing customers, and (iii) our mark",
  "item7_clean": "ITEM 7.\nManagement’s Discussion and Analysis of Financial Condition and Results of Operations\nManagement’s Discussion and Analysis of Financial Condition and Results of Operations (“MD&A”) should be read in conjunction with our consolidated financial statements and notes thereto.\nCritical Accounting Estimates\nThe preparation of consolidated financial statements and related disclosures in conformity with U.S. generally accepted accounting principles (“GAAP”) requires us to make judgments, assumptions, and estimates that affect the amounts reported. On an ongoing basis, we evaluate our estimates and assumptions. These estimates and assumptions are based on current facts, historical experience, and various other factors that we believe are reasonable under the circumstances to determine reported amounts of assets, liabilities, revenues, and expenses that are not readily apparent from other sources.\nWe believe the following are our critical accounting estimates, because they are reasonably likely to have a material impact on the portrayal of our financial condition and results, and they require us to make judgments and estimates about matters that involve a significant level of uncertainty.\nImpairment of Long-Lived Assets:\nThe analysis of impairment of our long-lived assets, including our real estate facilities, involves identification of indicators of impairment, including unfavorable operational results and significant cost overruns on construction, projections of future operating cash flows, and estimates of fair values, all of which require significant judgment and subjectivity. In particular, these estimates are sensitive to significant assumptions, such as the projections of future rental rates, stabilized occupancy level, future profit margin, discount rates, and capitalization rates, all of which could be affected by our expectations about future market or economic conditions. Others could come to materially different conclusions.\nAllocating Purchase Price for Acquired Real Estate Facilities\n: We estimate the fair values of the assets and liabilities of acquired real estate facilities, which consist principally of land, buildings and acquired customers in place, for purposes of allocating the aggregate purchase price of acquired real estate facilities. We estimate the fair value of land based upon price per square foot derived from observable transactions involving comparable land in similar locations as adjusted for location quality, parcel size, and date of sale associated with the acquired facilities. The fair value estimate of land is sensitive to the adjustments made to the land market transactions used in the estimate, particularly when there is a lack of recent comparable land market data. We estimate the fair value of buildings primarily using the income approach by estimating the fair value of hypothetical vacant acquired facilities and adjusting for the estimated fair value of land. The fair value estimate of buildings is sensitive to assumptions, such as lease-up period, future stabilized operating cash flows, capitalization rate and discount rate. We estimate the fair value of acquired customers in place using the income approach by estimating the foregone rent over the presumed period of time to absorb the occupied spaces as if they were vacant at the time of acquisition. The fair value estimate of the acquired customers in place is sensitive to the assumptions used in the income approach, such as market rent, lease-up period and discount rate. Others could come to materially different conclusions as to the estimated fair values of land, buildings and acquired customers in place, which would result in different depreciation and amortization expense, gains and losses on sale of real estate assets, as well as the level of land and buildings on our consolidated balance sheet.\nOur self-storage operations generate most of our net income, and our earnings growth is impacted by the levels of organic growth within our Same Store Facilities (as defined below) as well as within our Acquired Facilities and Newly Developed and Expanded Facilities (both as defined below).\nDuring 2024, revenues generated by our Same Store Facilities decreased by 0.7% ($26.7 million), as compared to 2023, while Same Store cost of operations increased by 2.4% ($20.6 million). Softness in demand for our storage space has led to lower move-in rental rates for new tenants and lower average occupancy in 2024 as compared to 2023.\nWe have grown and plan to continue to grow through the acquisition and development of new facilities and expansion of our existing self-storage facilities. Since the beginning of 2022, we acquired a total of 260 facilities with 18.5 million net rentable square feet for $3.7 billion. Additionally, within our non-same store portfolio, our Newly Developed and Expanded Facilities (as defined below) include a total of 132 self-storage facilities with 15.8 million net rentable square feet. For development and expansions completed by December 31, 2024, we incurred a total cost of $1.6 billion. During 2024, combined net operating income generated by our Acquired Facilities and Newly Developed and Expanded Facilities increased 48.1% ($101.0 million), as compared to 2023.\nWe have experienced recent inflationary impacts on our cost of operations including labor, utilities, and repairs and maintenance, and costs of development and expansion activities, and we expect to experience such impacts in the future. We have implemented various initiatives to manage the adverse impacts, such as enhancements in operational processes and investments in technology to reduce payroll hours, achievement of economies of scale from recent acquisitions with supervisory payroll and centralized management costs allocated over a broader number of self-storage facilities, and investments in solar power and LED lights to lower utility usage.\nIn order to enhance the competitive position of certain of our facilities relative to local competitors (including newly developed facilities), we embarked on our multi-year Property of Tomorrow program to (i) rebrand our properties with more pronounced, attractive, and clearly identifiable color schemes and signage and (ii) upgrade the configuration and layout of the offices and other customer zones to improve the customer experience. We completed the program in 2024. We spent approximately $127 million on the program in 2024. We have also embarked on a solar program under which we plan to install solar panels on over 1,400 of our self-storage facilities. We have completed the installations on 772 facilities through December 31, 2024. We spent approximately $54 million on the program in 2024 and expect to spend approximately $50 million in 2025 on this effort.\nDuring 2024, PSOC completed a public offering of $1.0 billion aggregate principal amount of unsecured senior notes in various tranches and maturities and issued €150 million of senior notes to institutional investors. PSOC also repaid at maturity $700 million aggregate principal amount of floating rate senior notes and €100 million aggregate principal amount of senior notes.\nDuring 2024, we repurchased 726,865 of our common shares under our previously announced share repurchase program on the open market for a total cost of $200.0 million, driven by our expected improvement in operating fundamentals and growth.\nDuring 2024, we sold 184,390 of our common shares on the open market through our “at the market” offering program for aggregate net proceeds of approximately $60.3 million in cash.\nIn early 2025, multiple wildfires erupted in southern California and caused significant destruction of business and residential structures. We did not incur any direct property damage in the affected areas. In response to the devastation, a “State of Emergency” has been declared for Los Angeles County and Ventura County, under which a temporary governmental pricing limitation is in place for our self-storage facilities located in these counties. These self-storage facilities generated approximately 10% of revenues earned by our Same Store Facilities in 2024. We anticipate a potentially significant negative impact on the revenue growth from these self-storage facilities, the extent of which depends largely on the duration of the State of Emergency order and other future actions by government authorities, among other factors.\nResults of Operations\nOperating Results for 2024 and 2023\nIn 2024, net income allocable to our common shareholders was $1.873 billion or $10.64 per diluted common share, compared to $1.949 billion or $11.06 per diluted common share in 2023, representing a decrease of $76.1 million or $0.42 per diluted common share. The decrease is due primarily to (i) a $159.7 million increase in depreciation and amortization expense, (ii) an $86.3 million increase in interest expense, (iii) a $26.0 million increase in general and administrative expense, (iv) an $18.4 million decrease in interest and other income, partially offset by (v) a $153.4 million increase in foreign currency exchange gains primarily associated with our Euro denominated notes payable and (vi) a $61.6 million increase in self-storage net operating income.\nThe $61.6 million increase in self-storage net operating income in 2024 as compared to 2023 is a result of a $108.9 million increase attributable to our Non-Same Store Facilities (as defined below), partially offset by a $47.3 million decrease attributable to our Same Store Facilities. Revenues for the Same Store Facilities decreased 0.7% or $26.7 million in 2024 as compared to 2023, due primarily to a decline in occupancy and lower realized annual rent per occupied square foot. Cost of operations for the Same Store Facilities increased by 2.4% or $20.6 million in 2024 as compared to 2023, due primarily to increased property tax expense, marketing expense, and repairs and maintenance expense, partially offset by decreased centralized management costs and on-site property manager payroll expense. The increase in net operating income of $108.9 million for the Non-Same Store Facilities is due primarily to the impact of facilities acquired in 2023.\nOperating Results for 2023 and 2022\nIn 2023, net income allocable to our common shareholders was $1.949 billion or $11.06 per diluted common share, compared to $4.142 billion or $23.50 per diluted common share in 2022, representing a decrease of $2.2 billion or $12.44 per diluted common share. The decrease is due primarily to (i) a $2.1 billion gain on sale of our equity investment in PS Business Parks, Inc. (“PSB”) in July 2022, (ii) a $149.5 million increase in foreign currency exchange losses primarily associated with our Euro denominated notes payable, (iii) a $79.1 million decrease in equity in earnings of unconsolidated real estate entities due to our sale of PSB in July 2022, and (iv) a $64.8 million increase in interest expense, partially offset by (v) a $231.8 million increase in self-storage net operating income and (vi) a $45.0 million increase in interest and other income.\nThe $231.8 million increase in self-storage net operating income in 2023 as compared to 2022 is a result of a $131.8 million increase in our Same Store Facilities and a $100.0 million increase in our Non-Same Store Facilities. Revenues for the Same Store Facilities increased 4.8% or $170.2 million in 2023 as compared to 2022, due primarily to higher realized annual rent per available square foot, partially offset by a decline in occupancy. Cost of operations for the Same Store Facilities increased by 4.6% or $38.4 million in 2023 as compared to 2022, due primarily to increased property tax expense, marketing expense and other direct property costs. The increase in net operating income of $100.0 million for the Non-Same Store Facilities is due primarily to the impact of facilities acquired in 2022 and 2023.\nFunds from Operations and Core Funds from Operations\nFunds from Operations (“FFO”) and FFO per diluted common share (“FFO per share”) are non-GAAP measures defined by Nareit. We believe that FFO and FFO per share are useful to REIT investors and analysts in measuring our performance because Nareit’s definition of FFO excludes items included in net income that do not relate to or are not indicative of our operating and financial performance. FFO represents net income before real estate-related depreciation and amortization, which is excluded because it is based upon historical costs and assumes that building values diminish ratably over time, while we believe that real estate values fluctuate due to market conditions. FFO also excludes gains or losses on sale of real estate assets and real estate impairment charges, which are also based upon historical costs and are impacted by historical depreciation. FFO and FFO per share are not a substitute for net income or earnings per share. FFO is not a substitute for net cash flow in evaluating our liquidity or ability to pay dividends, because it excludes investing and financing activities presented on our consolidated statements of cash flows. In addition, other REITs may compute these measures differently, so comparisons among REITs may not be helpful.\nFor the year ended December 31, 2024, FFO was $17.19 per diluted common share as compared to $16.60 and $16.46 per diluted common share for the years ended December 31, 2023 and 2022, respectively, representing an increase in 2024 of 3.6%, or $0.59 per diluted common share, as compared to 2023.\nWe also present “Core FFO” and “Core FFO per share” non-GAAP measures that represent FFO and FFO per share excluding the impact of (i) foreign currency exchange gains and losses, (ii) charges related to the redemption of preferred securities, and (iii) certain other non-cash and/or nonrecurring income or expense items primarily representing, with respect to the periods presented below, the impact of loss contingencies and resolutions, casualties, due diligence costs incurred in pursuit of strategic transactions, unrealized gain on private equity investments, reorganization costs, acquisition integration costs, amortization of acquired non real estate-related intangibles, a cash and stock hiring bonus for a new senior executive, and our equity share of tax effect of a change in tax status, unrealized gain on derivatives, merger transaction costs and senior executive severance from our equity investees. We review Core FFO and Core FFO per share to evaluate our ongoing operating performance and we believe they are used by investors and REIT analysts in a similar manner. However, Core FFO and Core FFO per share are not substitutes for net income and net income per share. Because other REITs may not compute Core FFO or Core FFO per share in the same manner as we do, may not use the same terminology or may not present such measures, Core FFO and Core FFO per share may not be comparable among REITs.\nThe following table reconciles net income to FFO and Core FFO and reconciles diluted earnings per share to FFO per share and Core FFO per share:\n\n(Dollar amounts in thousands, except for per square foot data)\nLate charges and administrative fees\nDirect cost of operations (a):\nOn-site property manager payroll\nRepairs and maintenance\nOther direct property costs\nTotal direct cost of operations\nDirect net operating income (b)\nIndirect cost of operations (a):\nCentralized management costs\nShare-based compensation\nNet operating income\nDepreciation and amortization expense\nGross margin (before indirect costs, depreciation and amortization expense)\nGross margin (before depreciation and amortization expense)\nWeighted average for the period:\nSquare foot occupancy\nRealized annual rental income per (c):\nOccupied square foot\nAvailable square foot\nSquare foot occupancy\nAnnual contract rent per occupied square foot (d)\nRevenues and cost of operations do not include tenant reinsurance and merchandise sale revenues and expenses generated at ",
  "item2_clean": null
}