{
  "source_file": "psky-20250930.htm",
  "form_type": "10-Q",
  "item1_clean": null,
  "item7_clean": null,
  "item2_clean": "September 30, 2025 and 2024\nPeriod From August 7 - September 30,\nPeriod From January 1 - August 6,\nNine Months Ended September 30,\nConsolidated Results of Operations\nGAAP:\nOperating income (loss)\nNet loss from continuing operations\nattributable to Parent\nDiluted EPS from continuing operations\nAdjusted net earnings from continuing operations\nattributable to Parent\nAdjusted diluted EPS from continuing operations\nReconciliation of Non-GAAP Measures\n” for reconciliations of these non-GAAP measures to the most directly comparable financial measures in accordance with U.S. GAAP. These non-GAAP measures exclude certain items identified as affecting comparability that are not part of our normal operations.\nRevenues during the Predecessor period in 2024 benefited from advertising revenues associated with the broadcast of\non CBS and Paramount+ in the first quarter of 2024. We have the rights to broadcast the Super Bowl on a rotational basis with other networks, and therefore did not have a comparable broadcast in 2025.\nAs noted above, the Successor period operating income, net loss from continuing operations attributable to Parent, and diluted EPS reflect the pushdown of the Ultimate Parent’s basis, and include the results of Skydance.\nAdjusted OIBDA for the Successor period in 2025 excludes the impact of restructuring charges. The Predecessor periods in 2025 and 2024 exclude the impacts from transaction-related items and restructuring charges and 2024 also excludes impairment and programming charges. See\nReconciliation of Non-GAAP Measures\nAdjusted net earnings from continuing operations attributable to Parent and adjusted diluted EPS from continuing operations during the Successor and Predecessor periods in 2025 and 2024 exclude the items noted above, as well as discrete tax items and other items described under\nReconciliation of Non-GAAP Measures\nWe are exposed to political risks inherent in conducting a global business such as retaliatory actions by governments reacting to changes in the U.S. and other countries, including in connection with the imposition of tariffs and other changes in trade policies. Growing macroeconomic uncertainty relating to the imposition of tariffs\nManagement’s Discussion and Analysis of\nResults of Operations and Financial Condition (Continued)\n(Tabular dollars in millions, except per share amounts)\nand other changes in trade policies may negatively affect our results, in particular from potential impacts on the advertising market.\nReconciliation of Non-GAAP Measures\nAdjusted OIBDA, adjusted earnings from continuing operations before income taxes, adjusted provision for income taxes, adjusted net earnings from continuing operations attributable to Parent, adjusted diluted EPS from continuing operations, and adjusted effective income tax rate, which are measures of performance not calculated in accordance with U.S. GAAP (together, the “adjusted measures”), exclude certain items identified as affecting comparability that are not part of our normal operations, including impairment charges, restructuring charges, transaction-related items, programming charges, gain on dispositions, loss from investment, and discrete tax items, each where applicable. Programming charges consist only of charges related to major strategic changes, which are further described under\n, and do not include impairment charges that occur as part of our normal operations, which are recorded within “Operating expenses” on the Consolidated Statements of Operations, and are not excluded in our adjusted measures.\nWe use these measures to, among other things, evaluate our operating performance. These measures are among the primary measures used by management for planning and forecasting of future periods, and they are important indicators of our operational strength and business performance. In addition, we use Adjusted OIBDA to, among other things, value prospective acquisitions. We believe these measures are relevant and useful for investors because they allow investors to view performance in a manner similar to the method used by our management; and because they exclude items that are not representative of our normal, recurring operations, they provide a clearer perspective on our underlying performance; and make it easier for investors, analysts and peers to compare our operating performance to other companies in our industry and to compare our year-over-year results.\nBecause the adjusted measures are measures of performance not calculated in accordance with U.S. GAAP, they should not be considered in isolation of, or as a substitute for, operating income (loss), earnings (loss) from continuing operations before income taxes, (provision for) benefit from income taxes, net earnings (loss) from continuing operations attributable to Parent, diluted EPS from continuing operations, and effective income tax rate, as applicable, as indicators of operating performance. These measures, as we calculate them, may not be comparable to similarly titled measures employed by other companies.\nManagement’s Discussion and Analysis of\nResults of Operations and Financial Condition (Continued)\n(Tabular dollars in millions, except per share amounts)\nThe following tables reconcile the adjusted measures to their most directly comparable financial measures in accordance with U.S. GAAP. The tax impacts on the items identified as affecting comparability in the tables below have been calculated using the tax rate applicable to each item.\nThree Months Ended September 30, 2025 and 2024\nPeriod From August 7 - September 30,\nPeriod From July 1 - August 6,\nThree Months Ended September 30,\nOperating income (GAAP)\nDepreciation and amortization\nRestructuring charges\nTransaction-related items\nAdjusted OIBDA (Non-GAAP)\nNine Months Ended September 30, 2025 and 2024\nPeriod From August 7 - September 30,\nPeriod From January 1 - August 6,\nNine Months Ended September 30,\nOperating income (loss) (GAAP)\nDepreciation and amortization\nRestructuring charges\nTransaction-related items\nGain on dispositions\nAdjusted OIBDA (Non-GAAP)\n(a) See notes on the following tables for additional information on items affecting comparability.\nManagement’s Discussion and Analysis of\nResults of Operations and Financial Condition (Continued)\n(Tabular dollars in millions, except per share amounts)\nThree Months Ended September 30, 2025\nPeriod From August 7 - September 30, 2025\nEarnings from Continuing Operations Before Income Taxes\nBenefit from (Provision for) Income Taxes\nNet Earnings (Loss) from Continuing Operations Attributable to Parent\nDiluted EPS from Continuing Operations\nItems affecting comparability:\nRestructuring charges\nPeriod From July 1 - August 6, 2025\nEarnings (loss) from Continuing Operations Before Income Taxes\nBenefit from (Provision for) Income Taxes\nNet Loss from Continuing Operations Attributable to Parent\nDiluted EPS from Continuing Operations\nItems affecting comparability:\nRestructuring charges\nTransaction-related items\n(a) Reflects severance charges, as further described under\nRestructuring and Transaction-Related Items\n(b) Reflects banking, legal, advisory, and other professional fees relating to the Transactions, and transaction awards that became payable to eligible employees upon closing of the Transactions.\n(c) Reflects the reversal of the valuation allowance on our interest limitation carryforward deferred tax asset, partially offset by the establishment of a reserve for uncertain tax positions.\n(d) The reported effective income tax rate for the period from August 7 - September 30, 2025 was 69.7%, primarily reflecting the timing of foreign inclusions and foreign-derived intangible income deductions between the Successor and Predecessor periods. The adjusted effective income tax rate, which is calculated as the adjusted provision for income taxes of $119 million divided by adjusted earnings from continuing operations before income taxes of $307 million, was 38.8%. These adjusted measures exclude the items affecting comparability detailed above.\n(e) For the period from July 1 - August 6, 2025, we recorded a tax benefit of $229 million, primarily reflecting the reversal of valuation allowances on deferred tax assets related to interest deduction limitations as a result of recent U.S. tax legislation. The reported benefit, as well as the adjusted income tax benefit of $123 million, also reflect the tax impact of earnings attributable to noncontrolling interests, the timing of foreign inclusions between the Successor and Predecessor periods, and the tax benefit on the foreign-derived intangible income deduction. The adjusted benefit from income taxes excludes the tax impacts from the items affecting comparability detailed in the table above.\nManagement’s Discussion and Analysis of\nResults of Operations and Financial Condition (Continued)\n(Tabular dollars in millions, except per share amounts)\nThree Months Ended September 30, 2024\nThree Months Ended September 30, 2024\nEarnings from Continuing Operations Before Income Taxes\nBenefit from (Provision for) Income Taxes\nNet Earnings (Loss) from Continuing Operations Attributable to Parent\nDiluted EPS from Continuing Operations\nItems affecting comparability:\nRestructuring charges\nTransaction-related costs\n(a) Reflects a charge to reduce the carrying values of FCC licenses in certain markets to their estimated fair values.\n(b) Reflects severance charges, as further described under\nRestructuring and Transaction-Related Items\n(c) Reflects legal and advisory fees relating to the Transactions.\n(d) The reported effective income tax rate for the three months ended September 30, 2024 was 37.5% and the adjusted effective income tax rate, which is calculated as the adjusted provision for income taxes of $139 million divided by adjusted earnings from continuing operations before income taxes of $545 million, was 25.5%. These adjusted measures exclude the items affecting comparability detailed above.\nManagement’s Discussion and Analysis"
}