{
  "source_file": "psx-20250930.htm",
  "form_type": "10-Q",
  "item1_clean": null,
  "item7_clean": null,
  "item2_clean": "Business Environment\nOur Midstream segment includes our Transportation and natural gas liquids (NGL) businesses. Our Transportation business contains fee-based operations not directly exposed to commodity price risk. Our NGL business, including DCP Midstream Class A Segment, DCP Sand Hills Pipeline, LLC (DCP Sand Hills) and DCP Southern Hills Pipeline, LLC (DCP Southern Hills), contains both fee-based operations and operations directly impacted by NGL and natural gas prices. The weighted-average NGL price was $0.60 per gallon during the third quarter of 2025, compared with $0.64 per gallon during the third quarter of 2024. The Henry Hub natural gas price was $3.03 per million British thermal units (MMBtu) during the third quarter of 2025, compared with $2.09 per MMBtu during the third quarter of 2024. The decrease in NGL prices was primarily due to increased supply, while the improvement in natural gas prices was due to increased liquified natural gas exports as U.S. export infrastructure increases.\nOur Chemicals segment consists of our 50% equity investment in Chevron Phillips Chemical Company LLC (CPChem). The chemicals and plastics industry is mainly a commodity-based industry where the margins for key products are based on supply and demand, as well as cost factors. The benchmark high-density polyethylene chain margin was 7.6 cents per pound in the third quarter of 2025, compared with 23.7 cents per pound in the third quarter of 2024. The decrease was mainly due to higher ethane prices and industry oversupply driven by capacity additions.\nOur Refining segment results are driven by several factors, including market crack spreads, refinery throughput, feedstock costs, product yields, turnaround activity and other operating costs. Market crack spreads are used as indicators of refining margins and measure the difference between market prices for refined petroleum products and crude oil. The composite 3:2:1 market crack spread for our business increased to an average of $23.64 per barrel during the third quarter of 2025, from an average of $16.50 per barrel during the third quarter of 2024. The increase in the composite market crack spread was primarily driven by stronger year on year petroleum diesel demand, supported by low seasonal inventories. The price of U.S. benchmark crude oil, West Texas Intermediate (WTI) at Cushing, Oklahoma, decreased to an average of $65.03 per barrel during the third quarter of 2025, from an average of $75.19 per barrel during the third quarter of 2024, primarily due to increasing supply.\nResults for our M&S segment depend largely on marketing fuel and lubricant margins and sales volumes of our refined products. While marketing fuel and lubricant margins are primarily driven by market factors, largely determined by the relationship between supply and demand, marketing fuel margins, in particular, are influenced by trends in spot prices and, where applicable, retail prices for refined products in the regions and countries where we operate.\nOur Renewable Fuels segment consists of the operations and assets of the Rodeo Renewable Energy Complex (Rodeo Complex) as well as the global activities to procure renewable feedstocks, manage certain regulatory credits, and market renewable fuels. Results for our Renewable Fuels segment are impacted by several factors, including the market price of renewable fuels, feedstock costs, throughput, operating costs and the value of certain regulatory credits, as well as other market factors, largely determined by the relationship between supply and demand.\nRESULTS OF OPERATIONS\nUnless otherwise indicated, discussion of results for the three and nine months ended September 30, 2025, is based on a comparison with the corresponding period of 2024.\nConsolidated Results\nA summary of income (loss) before income taxes by business segment with a reconciliation to net income attributable to Phillips 66 follows:\n\nPercent of total debt to capital**\nPercent of floating-rate debt to total debt\n* Excludes $105 million of “Cash and cash equivalents” included in “Assets held for sale” on our consolidated statement of income as of September 30, 2025.\n** Capital includes total debt and total equity.\nTo meet our short- and long-term liquidity requirements, we use a variety of funding sources but rely primarily on cash generated from operating activities and debt financing. During the first nine months of 2025, we generated $2.2 billion of cash from operations. We received proceeds from asset dispositions of $2 billion and received $2 billion from net debt borrowings. We funded capital expenditures and investments of $1.6 billion and an acquisition of $2.2 billion, net of cash acquired. Additionally, we paid $933 million to repurchase shares of our common stock and paid $1.4 billion of dividends to our common stockholders. During the first nine months of 2025, cash and cash equivalents, including cash classified within assets held for sale, increased by $212 million. At this time, we believe that our cash on hand, as well as the sources of liquidity described herein, will be sufficient to fund our obligations over the short- and long-term.\nSignificant Sources of Capital\nOperating Activities\nDuring the first nine months of 2025, cash generated by operating activities was $2.2 billion, compared with $3 billion for the first nine months of 2024.\nThe decrease was primarily due to unfavorable working capital impacts.\nOur short- and long-term operating cash flows are highly dependent upon refining and marketing margins, NGL prices and chemicals margins. Prices and margins in our industry are typically volatile and are driven by market conditions over which we have little or no control. Absent other mitigating factors, as these prices and margins fluctuate, we would expect a corresponding change in our operating cash flows.\nThe level and quality of output from our refineries also impacts our cash flows. Factors such as operating efficiency, maintenance turnarounds, market conditions, feedstock availability and weather conditions can affect output. We actively manage the operations of our refineries, and any variability in their operations typically has not been as significant to cash flows as that caused by fluctuations in margins and prices.\nEquity Affiliate Operating Distributions\nOur operating cash flows are also impacted by distribution decisions made by our equity affiliates. During the first nine months of 2025, cash from operations included aggregate distributions of $783 million from our equity affiliates, while cash from operations during the first nine months of 2024 included aggregate distributions of $1,045 million from our equity affiliates. We cannot control the amount of future dividends from equity affiliates; therefore, future dividend payments by these equity affiliates are not assured.\nOn September 18, 2025, Phillips 66 Company, a wholly owned subsidiary of Phillips 66, issued $2 billion aggregate principal amount of junior subordinated notes that are fully and unconditionally guaranteed by Phillips 66. The junior subordinated notes issuance consisted of:\n$1 billion aggregate principal amount of 5.875% Series A Junior Subordinated Notes due 2056 (Series A 2056 Notes).\n$1 billion aggregate principal amount of 6.200% Series B Junior Subordinated Notes due 2056 (Series B 2056 Notes).\nInterest on the Series A 2056 Notes and Series B 2056 Notes is payable semi-annually in arrears on March 15 and September 15 of each year, commencing on March 15, 2026. The Series A 2056 Notes will bear interest at 5.875% per year until March 15, 2031. The interest rate will reset every five years beginning on March 15, 2031, to equal the then-current five-year U.S. Treasury rate plus a spread of 2.283%, provided that the interest rate will not reset below 5.875%. The Series B 2056 Notes will bear interest at 6.200% per year until March 15, 2036. The interest rate will reset every five years beginning on March 15, 2036, to equal the then-current five-year U.S. Treasury rate plus a spread of 2.166%, provided that the interest rate will not reset below 6.200%. We may defer interest payments on the Series A 2056 Notes and Series B 2056 Notes on one or more occasions for up to 10 consecutive years per deferral period. If interest payments on the Series A 2056 Notes or Series B 2056 Notes are deferred, we may not, subject to certain limited exceptions, declare or pay any dividends or distributions, or redeem, purchase, acquire, or make a liquidation payment on any of our capital stock during the deferral period. Also, during the deferral period, we may not (i) pay any principal of, or interest or premium, if any, on or repay, repurchase or redeem any debt securities of Phillips 66 or Phillips 66 Company that rank equally with, or junior to, the Series A 2056 Notes and Series B 2056 Notes, respectively, in right of payment or (ii) make any payments with respect to any guarantee by Phillips 66 or Phillips 66 Company of indebtedness if the guarantee ranks equally with or junior to the Series A 2056 Notes or Series B 2056 Notes, respectively, in right of payment.\nOn September 11, 2024, Phillips 66 Company, a wholly owned subsidiary of Phillips 66, issued $1.8 billion aggregate principal amount of senior unsecured notes that are fully and unconditionally guaranteed by Phillips 66. The senior unsecured notes issuance consisted of:\n$600 million aggregate principal amount of 5.250% Senior Notes due 2031 (Additional 2031 Notes).\n$600 million aggregate principal amount of 4.950% Senior Notes due 2035 (2035 Notes).\n$600 million aggregate principal amount of 5.500% Senior Notes due 2055 (2055 Notes).\nInterest on the Additional 2031 Notes is payable semi-annually on June 15 and December 15 of each year and commenced on December 15, 2024. Interest on the 2035 Notes and 2055 Notes is payable semi-annually on March 15 and September 15 of each year and commenced on March 15, 2025.\nOn February 28, 2024,"
}