{
  "source_file": "ptc-20250930.htm",
  "form_type": "10-K",
  "item1_clean": null,
  "item7_clean": "ARR should be viewed independently of recognized and unearned revenue and is not intended to be combined with, or to replace, either of those items. Investors should consider our ARR operating measure only in conjunction with our GAAP financial results.\nNon-GAAP Financial Measures\nThe non-GAAP financial measures presented in the discussion of our results of operations and the respective most directly comparable GAAP measures are:\nnon-GAAP gross margin—GAAP gross margin\nnon-GAAP operating income—GAAP operating income\nnon-GAAP operating margin—GAAP operating margin\nnon-GAAP net income—GAAP net income\nnon-GAAP diluted earnings per share—GAAP diluted earnings per share\nfree cash flow—cash flow from operations\nThe non-GAAP financial measures other than free cash flow exclude, as applicable: stock-based compensation expense; amortization of acquired intangible assets; acquisition and transaction-related charges included in General and administrative expenses; Impairment and other charges (credits), net; non-operating charges (credits), net; and income tax adjustments.\nStock-based compensation is a non-cash expense relating to stock-based awards issued to executive officers, employees and outside directors, consisting of restricted stock units. We exclude this expense as it is a non-cash expense and we assess our internal operations excluding this expense and believe it facilitates comparisons to the performance of other companies in our industry.\nAmortization of acquired intangible assets is a non-cash expense that is impacted by the timing and magnitude of our acquisitions. We believe the assessment of our operations excluding these costs is relevant to our assessment of internal operations and comparisons to the performance of other companies in our industry.\nAcquisition and transaction-related charges included in General and administrative expenses are direct costs of potential and completed acquisitions and expenses related to acquisition integration activities, including transaction fees, due diligence costs, severance and professional fees. Subsequent adjustments to our initial estimated amount of contingent consideration associated with specific acquisitions are also included within acquisition and transaction-related charges. Other transactional charges include third-party costs related to structuring merger and acquisition transactions outside of ordinary business operations. We do not include these costs when reviewing our operating results internally. The occurrence and amount of these costs varies depending on the timing and size of acquisitions and transactions.\n\nContractual Obligations\nAt September 30, 2025, our future contractual obligations were related to debt, leases, pension liabilities, unrecognized tax benefits, and purchase obligations. See\nNote 8. Debt, Note 16. Leases, Note 13. Pension Plans,\nNote 7. Income Taxes\nof Notes to Consolidated Financial Statements in this Annual Report for information about those obligations, which Notes are incorporated by reference into this section. Our purchase obligations were approximately $188.8 million, with $91.9 million expected to be paid in FY'26 and $96.9 million thereafter. Purchase obligations represent minimum commitments due to third parties, including royalty contracts, research and development contracts, telecommunication contracts, information technology maintenance contracts in support of internal-use software and hardware, financing leases, operating leases with original terms of less than 12 months, and other marketing and consulting contracts. Contracts for which our commitment is variable or based on volumes with no fixed minimum quantities and contracts that can be canceled without payment penalties are not included in the purchase obligation amounts above. The purchase obligations included above are in addition to amounts included in Current liabilities and Prepaid expenses recorded on our September 30, 2025 Consolidated Balance Sheet.\nAs of September 30, 2025, we had letters of credit and bank guarantees outstanding of approximately $15.6 million (of which $0.6 million was collateralized).\nOperating and Non-GAAP Financial Measures\nARR\nARR (Annual Run Rate) represents the annualized value of our portfolio of active subscription software, SaaS, hosting, and support contracts as of the end of the reporting period. We calculate ARR as follows:\nWe consider a contract to be active when the product or service contractual term commences (the “start date”) until the right to use the product or service ends (the “expiration date”). Even if the contract with the customer is executed before the start date, the contract will not count toward ARR until the customer right to receive the benefit of the products or services has commenced.\nFor contracts that include annual values that change over time, we include in ARR only the annualized value of components of the contract that are considered active as of the date of the ARR calculation. We do not include any future committed increases in the contract value as of the date of the ARR calculation\nAs ARR includes only contracts that are active at the end of the reporting period, ARR does not reflect assumptions or estimates regarding future contract renewals or non-renewals.\nActive contracts are annualized by dividing the total active contract value by the contract duration in days (expiration date minus start date), then multiplying that by 365 days (or 366 days for leap years).\nWe believe ARR is a valuable operating measure to assess the health of a subscription business because it is aligned with the amount that we invoice the customer on an annual basis. We generally invoice customers annually for the current year of the contract. A customer with a one-year contract will typically be invoiced for the total value of the contract at the beginning of the contractual term, while a customer with a multi-year contract will be invoiced for each annual period at the beginning of each year of the contract.\nARR increases by the annualized value of active contracts that commence in a reporting period and decreases by the annualized value of contracts that expire in the reporting period.\n\nNon-GAAP financial measures are reconciled to GAAP results under\nNon-GAAP Financial Measures\ngross margin grew at a higher rate than license revenue in FY'25 due mainly to license revenue growth. Total cost of license revenue in FY'25 remained consistent with FY'24, with lower intangible amortization expense offsetting growth in other areas.\nSupport and cloud services\ngross margin growth in FY'25 was in line with support and cloud services revenue growth. Cost of support and cloud services grew 6% in FY'25, primarily due to increasing compensation-related costs and cloud and software subscription-related costs as the business grows.\nProfessional services\ngross margin decreased in FY’25 compared to FY’24, primarily driven by a sharper decrease in professional services revenue than in professional services expense. The decreases in professional services revenue and costs are due to our continued execution on our strategy of leveraging partners to deliver services rather than contracting to deliver services ourselves.\n\nTotal headcount increased by 2% between September 30, 2024 and September 30, 2025.\nOperating expenses in FY'25 compared to FY'24 increased primarily due to the following:\na $19 million (2%) increase in total compensation expense (including stock-based compensation), driven by a $17 million increase in severance costs primarily related to our go-to-market realignment (which is mainly included in Sales and marketing) and headcount growth, offset by lower compensation charges in General and administrative due to our FY'24 chief executive officer succession;\n$16 million impairment charges recognized in Q2'25 and Q4'25 related to the lease assets associated with the subleased portion of our Boston office; and\na $6 million increase in acquisition and transaction-related costs.\n\nOn November 5, 2025, we entered into a definitive agreement with an affiliate of TPG, under which we agreed to sell our Kepware and ThingWorx businesses for total consideration of up to $725 million, if certain targets are achieved. We may receive up to $600 million upon closing of the transaction, which may be reduced by $35 million if certain growth targets are not achieved for a period between signing and closing, and further adjusted as set forth in the purchase agreement. We may receive up to $125 million of contingent consideration upon the sale of the business by TPG. The transaction is expected to close in the first half of calendar 2026. Our expected use of the net after-tax proceeds will follow our overall capital allocation strategy of returning excess cash to shareholders via share repurchases, while allowing for potential tuck-in acquisitions.\nResults of Operations\nThe following table shows the measures that we consider the most significant indicators of our business performance. In addition to providing operating income, operating margin, diluted earnings per share and cash from operations as calculated under GAAP, we provide our ARR operating measure and non-GAAP operating income, non-GAAP operating margin, non-GAAP diluted earnings per share, and free cash flow for the reported periods. We also provide a view of our actual results on a constant currency basis. Our non-GAAP financial measures exclude the items described in\nNon-GAAP Financial Measures\nbelow. Investors should use our non-GAAP financial measures only in conjunction with our GAAP results.\n\nApproximately 50% of our revenue and 35% of our expenses are transacted in currencies other than the U.S. Dollar. Because we report our results of operations in U.S. Dollars, currency translation, particularly changes in the Euro, Yen, Shekel, and Rupee relative to the U.S. Dollar, affects our reported results. Changes in foreign currency exchange rates were a slight tailwind to reported income statement results compared to constant currency results in FY’25. ARR was positively impacted by more favorable currency exchange rates, particularly the Euro to U.S. Dollar exchange rate, as of September 30, 2025 compared to September 30, 2024.\nThe results of operations in the table above, and the tables and discussions below about revenue by line of business and product group present both actual percentage changes year over year and percentage changes on a constant currency basis. Our constant currency disclosures are calculated by multiplying the results in local currency for FY'25 and FY'24 by the exchange rates in effect on September 30, 2024. If FY'25 reported results were converted into U.S. Dollars using the rates in effect as of September 30, 2024, ARR would have been lower by $33 million, revenue would have been higher by $21 million, and expenses would have been higher by $9 million. If FY'24 reported results were converted into U.S. Dollars using the rates in effect as of September 30, 2024, ARR would have been the same, revenue would have been higher by $34 million, and expenses would have been higher by $14 million.\n\nAn immaterial adjustment related to foreign currency option contracts entered into in Q4'25 resulted in a $2.3 million decrease to Provision for income taxes compared to amounts from our Q4’25 earnings release.\nOur effective tax rates for FY'25 and FY'24 were impacted by a number of offsetting items as outlined below, as well as by the year-over-year increase in Income before income taxes, which was primarily domestic; however, there was ultimately no net change in the effective tax rate year-over-year. In FY'25 and FY'24, our income tax rate included the effects of Internal Revenue Service (IRS) procedural guidance requiring consent for previously automatic changes of accounting method. The IRS procedural guidance change significantly increased our estimated taxable income in FY'24, with a lesser impact to taxable income in FY'25. In FY'25, we recorded tax expense of $11 million primarily related to accrued interest stemming from the effects of the procedural guidance. In FY'24, we recorded a benefit of $4 million primarily related to an increase to the estimated tax benefit for the deductions associated with Global Intangible Low-Taxed Income (\"GILTI\") and Foreign-Derived Intangible Income (\"FDII\").\n\nCash, Cash Equivalents and Restricted Cash\nWe invest our cash with highly rated financial institutions. Cash and cash equivalents include highly liquid investments with original maturities of three months or less.\nDue to the stability of our subscription model and consistency of annual, up-front billing, we aim to maintain a low cash balance. A significant portion of our cash is generated and held outside the U.S. As of September 30, 2025, we had cash and cash equivalents of $18 million in the U.S., $87 million in Europe, $63 million in Asia Pacific (including India), and $16 million in other countries. We have substantial cash requirements in the U.S. but believe that the combination of our existing U.S. cash and cash equivalents, cash available under our revolving credit facility, future U.S. operating cash inflows, and our ability to repatriate cash to the U.S. will be sufficient to meet our ongoing U.S. operating expenses and known capital requirements.\nCash Provided by Operating Activities\nCash provided by operating activities increased by $118 million in FY'25 compared to FY'24. This increase was driven by higher collections, lower interest payments, and lower vendor disbursements, partially offset by higher tax payments and higher severance payments. Interest payments were $59 million lower in FY'25 than in FY'24, driven by the Q1'24 payment of $30 million of imputed interest on a deferred acquisition payment associated with our FY'23 acquisition of ServiceMax, as well as lower interest payments in FY'25 due mainly to lower debt balances.\nCash Used in Investing Activities\nCash used in investing activities in FY'25 was driven by outflows from the settlement of net investment hedges. Cash used in investing activities in FY'24 was driven by the acquisition of pure-systems for $93 million.\n\nThe valuation allowance recorded against net deferred tax assets of certain foreign jurisdictions is established primarily for our capital loss carryforwards, the majority of which do not expire. However, there are limitations imposed on the utilization of such capital losses that could further restrict the recognition of any tax benefits. We will continue to reassess our valuation allowance requirements each financial reporting period.\nPrior to the passage of the U.S. Tax Act, we asserted that substantially all of the undistributed earnings of our foreign subsidiaries were considered indefinitely invested and accordingly, no deferred taxes were provided. Pursuant to the provisions of the U.S. Tax Act, these earnings were subjected to a one-time transition tax and there is therefore no longer a material cumulative basis difference associated with the undistributed earnings. We maintain our assertion to permanently reinvest these earnings outside the U.S. unless repatriation can be done substantially tax-free, with the exception of our Taiwan subsidiary. If we decide to repatriate any additional non-U.S. earnings in the future, we may be required to establish a deferred tax liability on such earnings. The amount of unrecognized deferred tax liability on the undistributed earnings would not be material.\nIn the normal course of business, PTC and its subsidiaries are examined by various taxing authorities, including the IRS in the U.S. We regularly assess the likelihood of additional assessments by tax authorities and provide for these matters as appropriate. We are currently under audit by tax authorities in several jurisdictions. Audits by tax authorities typically involve examination of the deductibility of certain permanent items, transfer pricing, limitations on n",
  "item2_clean": null
}