{
  "source_file": "ptc-20250630.htm",
  "form_type": "10-Q",
  "item1_clean": null,
  "item7_clean": null,
  "item2_clean": "ITEM 2. MANAGEMENT’S DISCUSSION AND ANALYSIS O\nF FINANCIAL CONDITION AND RESULTS OF OPERATIONS\nPTC is a global software company that enables manufacturers and product companies to digitally transform how they design, manufacture, and service the physical products that the world relies on. Headquartered in Boston, Massachusetts, PTC employs over 7,000 people and supports more than 30,000 customers globally.\nWe primarily serve customers in the following industry verticals:\nFederal, Aerospace and Defense\nElectronics and High Tech\nMedical Technology and Life Sciences\nOur customers are focused on improving their competitiveness in the face of global competition and increasing product complexity, and our suite of software offerings is a strategic enabler of this and their digital transformation initiatives. We enable our customers to establish a strong product data foundation and leverage that foundation to drive cross-functional collaboration, accelerate new product introduction timelines and deliver higher product quality.\nOur offerings include CAD (Computer-Aided Design) solutions for product data authoring and PLM (Product Lifecycle Management) solutions for product data management and process orchestration. Within the overall PLM category, our offerings also include ALM (Application Lifecycle Management) and SLM (Service Lifecycle Management).\nOur product portfolio enables end-to-end digital thread initiatives that leverage a connected flow of product data across design, manufacturing, service, and, ultimately, reuse. A digital thread enables product companies to break down silos, streamline workflows, and achieve interoperability across departments, functions and systems with a single version of truth. It also secures the quality, consistency and traceability of product-related data, ensuring that the data is up-to-date, accessible, reliable and actionable. With a digital thread, the right data is delivered to the right people at the right time and in the right context across the value chain.\nOur business is based on a subscription model, with 93% of our 2024 revenue recurring in nature. Compared to a perpetual license model, our subscription model naturally drives higher customer engagement and retention and provides better business predictability. This, in turn, enables us to make steady and sustained investments to support our customers and pursue mid-to-long-term growth opportunities.\nForward-Looking Statements\nStatements in this document that are not historic facts, including statements about our future operating, financial and growth expectations, and potential stock repurchases, are forward-looking statements that involve risks and uncertainties that could cause actual results to differ materially from those projected. These risks include: the macroeconomic and/or global manufacturing climates may not improve or may deteriorate due to, among other factors, the effects of recently imposed import tariffs, threats of additional and reciprocal import tariffs, global trade tensions and uncertainty, volatile foreign exchange rates, high interest rates or increases in interest rates, inflation, tightening of credit standards\n\nand availability, geopolitical uncertainty, including the effects of the conflicts between Russia and Ukraine and in the Middle East, and tensions between the U.S. and China, any of which could cause customers to delay or reduce purchases of new software, adopt competing software solutions, reduce the number of subscriptions they carry, or delay payments to us, which would adversely affect our ARR (Annual Run Rate) and/or financial results and cash flow and growth; our investments in our software solutions, including the integration of artificial intelligence (AI) capabilities into our software solutions, may not drive expansion of those solutions and/or generate the ARR and/or cash flow we expect if customers are slower to adopt those solutions than we expect or if they adopt competing solutions; customers may not build the product data foundations essential for the AI-driven transformation of their business when or as we expect, which could adversely affect our ARR and/or financial results and cash flow and growth; our go-to-market realignment and related initiatives may disrupt our business to a greater extent than we expect or may not generate the ARR and/or financial results or cash flow when or as we expect; other uses of cash or our credit facility limits could limit or preclude the return of excess cash to shareholders via share repurchases, or could change the amount and timing of any share repurchases; and foreign exchange rates may differ materially from those we expect. In addition, our assumptions concerning our future GAAP and non-GAAP effective income tax rates are based on estimates and other factors that could change, including changes to tax laws in the U.S. and other countries and the geographic mix of our revenue, expenses, and profits. Other risks and uncertainties that could cause actual results to differ materially from those projected are described below throughout or referenced in Part II, Item 1A.\nOur Operating and Non-GAAP Financial Measures\nOur discussion of results includes discussion of our ARR (Annual Run Rate) operating measure, non-GAAP financial measures, and disclosure of our results on a constant currency basis. ARR and our non-GAAP financial measures are described below in\nOperating and Non-GAAP Financial Measures\n. The methodology used to calculate constant currency disclosures is described in\nResults of Operations - Impact of Foreign Currency Exchange on Results of Operations\n. You should read those sections to understand our operating measure, non-GAAP financial measures, and constant currency disclosures.\nDespite the overall selling environment, which has been challenging for a couple of years now and reflects heightened macroeconomic uncertainly related to global trade tensions and tariffs, ARR grew 14% (9% constant currency) to $2.42 billion as of the end of Q3’25 compared to Q3’24.\nCash provided by operating activities grew 14% to $244 million in Q3'25 compared to Q3'24. Free cash flow grew 14% to $242 million in Q3'25 compared to Q3'24. Our cash flow growth is attributable to resilient top-line growth due to our subscription business model and operational discipline. In Q3'25, we repaid $157 million of debt and repurchased $75 million of our outstanding shares.\n\nImpact of Foreign Currency Exchange on Results of Operations\nApproximately 55% of our revenue and 35% of our expenses are transacted in currencies other than the U.S. Dollar. Because we report our results of operations in U.S. Dollars, currency translation, particularly changes in the Euro, Yen, Shekel, and Rupee relative to the U.S. Dollar, affects our reported results. Our constant currency disclosures are calculated by multiplying the results in local currency for the quarterly periods for FY'25 and FY'24 by the exchange rates in effect on September 30, 2024.\nIf reported results for the nine months ended June 30, 2025 were converted into U.S. Dollars using the rates in effect as of September 30, 2024, ARR would have been lower by $43 million, revenue would have been higher by $33 million, and expenses would have been higher by $11 million. If reported results for the nine months ended June 30, 2024 were converted into U.S. Dollars using the rates in effect as of September 30, 2024, ARR would have been higher by $44 million, revenue would have been higher by $26 million, and expenses would have been higher by $10 million.\nUnder ASC 606, the volume, mix, and duration of contract types (support, SaaS, on-premises subscription) starting or renewing in any given period can have a material impact on revenue in the period, and as a result can impact the comparability of reported revenue period over period. We recognize revenue for the license portion of on-premises subscription contracts when we deliver the licenses to the customer, typically on the start date, and we recognize revenue on the support portion of on-premises subscription contracts and stand-alone support contracts ratably over the term. We continue to convert existing support contracts to on-premises subscriptions, resulting in a shift to up-front recognition of on-premises subscription license revenue in the period converted compared to ratable recognition for a perpetual support contract. Revenue from our cloud services (primarily SaaS) contracts is recognized ratably. We expect that over time a higher portion of our revenue will be recognized ratably as we expand our SaaS offerings, release additional cloud functionality into our products, and migrate customers from on-premises subscriptions to SaaS. Given the different mix, duration and volume of new and renewing contracts in any period, year-over-year or sequential revenue can vary significantly.\nRevenue by Line of Business\n\nCash, Cash Equivalents and Restricted Cash\nWe invest our cash with highly rated financial institutions. Cash and cash equivalents include highly liquid investments with original maturities of three months or less.\nDue to the stability of our subscription model and consistency of annual, up-front billing, we aim to maintain a low cash balance. A significant portion of our cash is generated and held outside the U.S. As of June 30, 2025, we had cash and cash equivalents of $5.2 million in the U.S., $73.6 million in Europe, $103.0 million in Asia Pacific (including India) and $17.5 million in other countries. We have substantial cash requirements in the U.S. but believe that the combination of our existing U.S. cash and cash equivalents, cash available under our revolving credit facility, future U.S. operating cash flows, and our ability to repatriate cash to the U.S. will be sufficient to meet our ongoing U.S. operating expenses and known capital requirements.\nCash Provided by Operating Activities\nCash provided by operating activities increased $111.8 "
}