{
  "source_file": "pwr-20250930.htm",
  "form_type": "10-Q",
  "item1_clean": null,
  "item7_clean": null,
  "item2_clean": "Management’s Discussion and Analysis of Financial Condition and Results of Operations\nThe following discussion and analysis of the financial condition and results of operations of Quanta Services, Inc. (together with its subsidiaries, Quanta, we, us or our) should be read in conjunction with our condensed consolidated financial statements and related notes included elsewhere in this Quarterly Report and with our 2024 Annual Report, which was filed with the SEC on February 20, 2025 and is available on the SEC’s website at\nand on our website at\nwww.quantaservices.com\n. The discussion below contains forward-looking statements that are based upon our current expectations and are subject to uncertainty and changes in circumstances. Actual results may differ materially from these expectations due to inaccurate assumptions and known or unknown risks and uncertainties, including those identified in\nCautionary Statement About Forward-Looking Statements and Information\nof Part II of this Quarterly Report and in Item 1A.\nin Part I of our 2024 Annual Report.\nDuring the three months ended March 31, 2025, our Chief Executive Officer reevaluated how performance of the business is assessed and how resources are allocated, which resulted in a change in the reporting of management’s internal financial information. As a result, beginning with the three months ended March 31, 2025, we began reporting the results of our two operating segments, which are also our two reportable segments: (1) Electric Infrastructure Solutions (Electric) and (2) Underground Utility and Infrastructure Solutions (Underground and Infrastructure). The Electric segment consists of the historical Electric Power Infrastructure Solutions and the Renewable Energy Infrastructure Solutions segments. In conjunction with this change, certain prior period amounts have been recast to conform to this new segment reporting structure.\nOur 2025 results reflect increased demand for our services, as consolidated revenues and operating income increased as compared to 2024, with increased revenues and operating income in both our Electric and Underground and Infrastructure segments.\nWith respect to our Electric segment, utilities are continuing to invest significant capital in their electric power delivery systems through multi-year grid modernization and reliability programs, as well as system upgrades and hardening programs in response to recurring severe weather events. We have also experienced high demand for new and expanded transmission, substation and distribution infrastructure needed to reliably transport power. In particular, we continue to experience strong demand from our utility customers, which we believe is driven by increasing demand for electricity associated with, among other things, data centers and other technology-related dynamics, domestic manufacturing reshoring initiatives and overall electrification trends. Our acquisition of Cupertino Electric Inc. (CEI) during 2024 also resulted in increased demand for our critical path electrical design and installation solutions from the technology and data center industry, as well as our utility scale solar and battery storage solutions. The cost-effectiveness of solar, wind energy and battery storage, combined with a meaningful increase in current and forecasted electricity demand is continuing to drive demand for renewable generation and related infrastructure (e.g., high-voltage electric transmission and substation infrastructure and battery storage), as well as interconnection services necessary to connect and transmit renewable-generated electricity to existing electric power delivery systems. Despite these positive longer-term trends, in the past, supply chain challenges, policy and regulatory uncertainty and other factors have resulted in project delays and increased project costs and could negatively impact future periods.\nWith respect to our Underground and Infrastructure segment, we continue to believe the market for our industrial solutions and gas utility and pipeline integrity services remains solid given the recurring critical-path maintenance requirements and regulated spend dedicated to modernizing systems, reducing methane emissions, ensuring environmental compliance and improving safety and reliability. However, revenues associated with large pipeline projects have fluctuated in recent years, and we anticipate that revenues associated with these projects will continue to fluctuate. Additionally, our acquisition of Dynamic Systems (DSI), LLC (Dynamic Systems) during the three months ended September 30, 2025 expanded our capabilities and solutions related to turnkey mechanical, plumbing and process infrastructure solutions. We see strong demand for these services by data center, manufacturing, semiconductor and other large load facilities and believe there are also opportunities to provide these services to other core end markets.\nDuring the nine months ended September 30, 2025, increased revenues and operating income contributed to $1.10 billion of net cash provided by operating activities, which was a 19% decrease compared to the nine months ended September 30, 2024. This cash provided by operating activities, along with borrowings under our credit facility and commercial paper program and issuance of senior notes described below, allowed us to execute our business plan, including the strategic acquisitions of certain businesses and investments in unconsolidated affiliates, for which we utilized $1.93 billion of cash; repurchases of $134.6 million of common stock, and payments of $45.4 million in dividends associated with our common stock. Additionally, as of September 30, 2025, available commitments under our senior credit facility, combined with our cash and cash equivalents, totaled $3.34 billion.\n\nIn August 2025, we issued $1.50 billion aggregate principal amount of senior notes and received net proceeds of $1.48 billion, net of the original issue discount, underwriting discounts and deferred financing costs, and used the proceeds to repay certain outstanding borrowings. Our debt financing arrangements are more fully described in Note 8 of the Notes to Condensed Consolidated Financial Statements in Item 1.\nFinancial Statements\nof Part I of this Quarterly Report.\nWe expect the strong demand for our services will continue. Our remaining performance obligations and backlog were $20.97 billion and $39.17 billion as of September 30, 2025, representing increases of 25.1% and 13.4% relative to December 31, 2024. For a reconciliation of backlog to remaining performance obligations, the most comparable financial measure prepared in conformity with generally accepted accounting principles in the United States (GAAP), see\nNon-GAAP Financial Measures\nSignificant Factors Impacting Results\nOur revenues, profit, margins and other results of operations can be influenced by a variety of factors in any given period, including those described in Item 1.\nof Part I in our 2024 Annual Report, and those factors have caused fluctuations in our results in the past and are expected to cause fluctuations in our results in the future. Additional information with respect to certain of those factors is provided below.\nTypically, our revenues are lowest in the first quarter of the year because cold, snowy or wet conditions can create challenging working environments that are more costly for our customers or cause delays on projects. In addition, infrastructure projects often do not begin in a meaningful way until our customers finalize their capital budgets, which typically occurs during the first quarter. Second quarter revenues are typically higher than those in the first quarter, as some projects begin, but continued cold and wet weather can often impact productivity. Third and fourth quarter revenues are typically the highest of the year, as a greater number of projects are underway and operating conditions, including weather, are normally more accommodating. During the fourth quarter projects are often completed and customers often seek to spend their capital budgets before year end. However, the holiday season and inclement weather can sometimes cause delays during the fourth quarter, reducing revenues and increasing costs. These seasonal impacts are typical for our U.S. operations, but seasonality for our international operations may differ. For example, revenues for certain projects in Canada are typically higher in the first quarter because projects are often accelerated in order to complete work while the ground is frozen and prior to the break up, or seasonal thaw, as productivity is adversely affected by wet ground conditions during warmer months.\nWeather, natural disasters and emergencies.\nThe results of our business in a given period can be impacted by adverse weather conditions, severe weather events, natural disasters or other emergencies, which include, among other things, heavy or prolonged snowfall or rainfall, hurricanes, tropical storms, tornadoes, floods, blizzards, extreme temperatures, wildfires, post-wildfire floods and debris flows, pandemics and earthquakes. Climate change has the potential to increase the frequency and extremity of severe weather events. These conditions and events can negatively impact our financial results due to, among other things, the termination, deferral or delay of projects, reduced productivity and exposure to significant liabilities due to failure of electrical power or other infrastructure on which we have performed services. However, severe weather events can also increase our emergency restoration services, which typically yield higher margins due in part to higher equipment utilization and absorption of fixed costs.\n. We perform the majority of our services under existing contracts, including MSAs and similar agreements pursuant to which our customers are not committed to specific volumes of our services. Therefore our volume of business can be positively or n"
}