{
  "source_file": "pypl-20250930.htm",
  "form_type": "10-Q",
  "item1_clean": null,
  "item7_clean": null,
  "item2_clean": "reflects the total number of payment transactions within the previous 12-month period, divided by active accounts at the end of the period. The number of payment transactions per active account provides management with insight into the average number of times an account engages in payments activity on our payments platform in a given period. The number of times a consumer account or a merchant account transacts on our platform may vary significantly from the average number of payment transactions per active account.\nAs our transaction revenue growth is typically correlated with TPV growth and the number of payment transactions completed on our payments platform, management uses these metrics to gain insights into the scale and strength of our payments platform, the engagement level of our customers, and underlying activity and trends which may be indicators of current and future performance. We present these key metrics to enhance investors’ evaluation of the performance of our business and operating results.\nOur key metrics are calculated using internal company data based on the activity we measure on our payments platform and compiled from multiple systems, including systems that are internally developed or acquired through business combinations. While the measurement of our key metrics is based on what we believe to be reasonable methodologies and estimates, there are inherent challenges and limitations in measuring our key metrics globally at scale. The methodologies used to calculate our key metrics require significant judgment. We regularly review our processes for calculating these key metrics, and from time to time we may make adjustments to improve the accuracy or relevance of our metrics. For example, we continuously apply models, processes, and practices designed to detect and prevent fraudulent account creation on our platforms, and work to improve and enhance those capabilities. When we detect a significant volume of illegitimate activity, we generally remove the activity identified from our key metrics. Although such adjustments may impact key metrics reported in prior periods, we generally do not update previously reported key metrics to reflect these subsequent adjustments unless the retrospective impact of process improvements or enhancements is determined by management to be material.\nNET REVENUES\nOur revenues are classified into the following two categories:\nTransaction revenues\nNet transaction fees charged to merchants and consumers on a transaction basis based on the TPV completed on our payments platform. Growth in TPV is directly impacted by the number of payment transactions that we enable on our payments platform. We generate additional revenue from merchants and consumers: on transactions where we perform currency conversion, when we enable cross-border transactions (i.e., transactions where the merchant and consumer are in different countries), to facilitate the instant transfer of funds for our customers from their PayPal or Venmo account to their bank account or debit card, to facilitate the purchase and sale of cryptocurrencies, as contractual compensation from sellers that violate our contractual terms (for example, through fraud or counterfeiting), and other miscellaneous fees.\nRevenues from other value added services\nNet revenues derived primarily from revenue earned through partnerships, referral fees, subscription fees, gateway fees, and other services we provide to our consumers and merchants. We also earn revenues from interest and fees earned on our portfolio of loans receivable, and interest earned on certain assets underlying customer balances.\nNet revenue analysis\nThe components of our net revenues for the three and nine months ended September 30, 2025 and 2024 were as follows (in millions):\nTransaction revenues\nTransaction revenues increased $455 million, or 6%, and $725 million, or 3%, in the three and nine months ended September 30, 2025 compared to the same periods of the prior year. The increase in the three months ended September 30, 2025 was driven primarily by an increase of approximately $390 million in revenue from PayPal and Venmo products and services, which was largely driven by growth in TPV and number of payment transactions, and an increase in revenue from Braintree products and services of approximately $115 million predominantly attributable to growth in TPV despite a decline in the number of payment transactions over the same period. The increase in the nine months ended September 30, 2025 was primarily attributable to an increase of approximately $1.0 billion in revenue from PayPal and Venmo products and services, which was largely driven by growth in TPV and number of payment transactions, partially offset by a decline in revenue from Braintree products and services of approximately $140 million resulting from a reduction in number of payment transactions. The increase in TPV for Braintree products and services despite a decline in the number of payment transactions is due to our strategic shift as we focus on profitable growth. Transaction revenues in the three and nine months ended September 30, 2025 were also impacted by an unfavorable impact from hedging activities.\nAs a result of our stronger focus on profitable growth and ongoing negotiations with merchants, we experienced lower volume and transaction revenue from our Braintree offerings in the first half of 2025. As noted above, in the third quarter of 2025, revenue and TPV from Braintree offerings grew year-over-year. In the fourth quarter of 2025, we expect volume from our Braintree offerings to continue to grow.\nThe graphs below present the respective key metrics (in millions) for the three and nine months ended September 30, 2025 and 2024:\n*Reflects active accounts at the end of the applicable period.\nNumber of payment transactions\nTPV\nThe following table provides a summary of related metrics:\nThree Months Ended September 30,\nPercent Increase/(Decrease)\nNine Months Ended September 30,\nPercent Increase/(Decrease)\nNumber of payment transactions per active account\nPercent of cross-border TPV\nCross-border TPV occurs primarily between two PayPal accounts in different countries and includes transactions initiated through our Xoom product.\nWe had active accounts of 438 million and 432 million as of September 30, 2025 and 2024, respectively, an increase of 1%. Our total number of payment transactions was 6.3 billion and 6.6 billion for the three months ended September 30, 2025 and 2024, respectively, a decrease of 5%. Our total number of payment transactions was 18.6 billion for the nine months ended September 30, 2025, compared to 19.7 billion in the nine months ended September 30, 2024, a decrease of 6%. TPV was $458 billion and $423 billion for the three months ended September 30, 2025 and 2024, respectively, an increase of 8%. TPV was $1.3 trillion for the nine months ended September 30, 2025 compared to $1.2 trillion in the nine months ended September 30, 2024, an increase of 6%.\nTransaction revenues growth was lower than the growth in TPV in the three and nine months ended September 30, 2025 compared to the same periods in the prior year due primarily to changes in product mix and unfavorable impact from foreign exchange hedging activities.\nRevenues from other value added services\nRevenues from other value added services increased $115 million, or 15%, and $340 million, or 16%, in the three and nine months ended September 30, 2025 compared to the same periods in the prior year due primarily to an increase of approximately $65 million and $220 million, respectively, in interest and fee revenue earned from our loans receivable portfolios as well as an increase of approximately $50 million and $100 million, respectively, from revenue earned from an independent chartered financial institution (“partner institution”). Revenue from the partner institution is earned primarily through revenue share associated with our U.S. revolving consumer credit product and PayPal and Venmo branded credit cards.\nOPERATING EXPENSES\nThe following table summarizes our operating expenses and related metrics we use to assess the trends in each:\nThree Months Ended September 30,\nPercent Increase/(Decrease)\nNine Months Ended September 30,\nPercent Increase/(Decrease)\n(In millions, except percentages)\nTransaction and credit losses\nCustomer support and operations\nTechnology and development\nGeneral and administrative\nRestructuring and other\nTotal operating expenses\nTransaction expense rate\nTransaction and credit loss rate\nTransaction expense rate is calculated by dividing transaction expense by TPV.\nTransaction and credit loss rate is calculated by dividing transaction and credit losses by TPV.\nTransaction expense for the three and nine months ended September 30, 2025 and 2024 was as follows (in millions):\nTransaction expense increased $222 million, or 6%, and stayed relatively consistent, in the three and nine months ended September 30, 2025 compared to the same periods of the prior year. The increase in transaction expense for the three and nine months ended September 30, 2025 was primarily attributable to the increase in TPV of 8% and 6%, respectively, partially offset by favorable changes in merchant mix to lower cost merchants within our Braintree products and services. The decline in transaction expense rate for the three and nine months ended September 30, 2025 compared to the same periods of the prior year was primarily attributable to a lower proportion of TPV from Braintree products and services and changes in merchant mix.\nOur transaction expense rate is impacted by changes in product mix, merchant mix, regional mix, funding mix, and fees paid to payment processors and other financial institutions. The cost of funding a transaction with a credit or debit card is generally higher than the cost of funding a transaction from a bank or through internal sources such as a PayPal or Venmo account balance or our consume"
}