{
  "source_file": "pypl-20241231.htm",
  "form_type": "10-K",
  "item1_clean": "is an account registered directly with PayPal or a platform access partner that has completed a transaction on our platform, not including gateway-exclusive transactions, within the past 12 months. A platform access partner is a third party whose customers are provided access to PayPal’s platform or services through such third-party’s login credentials, including individuals and entities that utilize Hyperwallet’s payout capabilities. A user may register on our platform to access different products and may register more than one account to access a product. Accordingly, a user may have more than one active account. The number of active accounts provides management with additional perspective on the overall scale of our platform, but may not have a direct relationship to our operating results.\nOUR STRENGTHS\nOur business is built on a strong foundation designed to drive profitable growth and differentiate us from our competitors. We believe that our competitive strengths include the following:\nwe facilitate online and offline transactions for millions of consumers and merchants. Our relationship on both sides of a transaction enables us to offer unique product experiences designed to remove friction, drive sales, and enhance shopping experiences. We utilize the data about how our customers use our platform to continually innovate and improve it.\nwe have built and strengthened well-recognized and trusted brands, including PayPal, Venmo, and Braintree. Our communications and marketing efforts across multiple geographies and demographic groups play an important role in building brand visibility, usage, and overall preference among customers.\nwe are technology and platform agnostic. This approach allows our merchants to offer and use a variety of our branded and unbranded payment processing solutions and business financing products, alongside other tools. We give consumers flexibility to make and receive payments using a wide variety of funding options and digital wallet solutions, including their bank account, PayPal and Venmo account balance, buy now, pay later, debit and credit options.\nour global scale helps us to drive organic growth. As of December 31, 2024, we had 434 million active accounts in approximately 200 markets\nRisk and compliance management\nour enterprise risk and compliance management program is designed to help keep customer information secure and ensure we process legitimate transactions around the world, while identifying and minimizing illegal, high-risk, or fraudulent transactions.\nwe believe that our regulatory licenses, which enable us to operate in markets around the world, are a distinct advantage and help support business growth.\nA market is a geographic area or political jurisdiction, such as a country, territory, or protectorate, in which we offer some or all of our products and services. A country, territory, or protectorate is identified by a distinct set of laws and regulations.\nCONSUMER AND MERCHANT PAYMENT SOLUTIONS\nConsumer value proposition\nWe help consumers transact securely with merchants, manage their financial lives, and send to and receive money from friends and family around the globe. Our goal is to create the simplest checkout experience possible for consumers online or offline, including mobile. We drive increased consumer engagement by providing consumers with a wide range of services to manage their finances and enhance their ability to shop online and offline. Our PayPal and Venmo branded checkout experiences allow customers to complete purchases in just a few steps without having to enter payment and address information. We also focus on simplifying and personalizing shopping experiences for our consumers by offering tools for product discovery, price tracking, saving through deals and offers, convenient package tracking, and redemption of shopping rewards. Our PayPal- and Venmo-branded debit and credit cards give consumers the ability to transact in-person through our platform and earn incentives, including cash-back rewards.\nWe also offer consumers person-to-person (“P2P”) payment solutions for domestic and international transfers through our PayPal, Venmo, and Xoom products and services. Our Venmo digital wallet in the United States (“U.S.”) is a leading mobile application used to move money between our customers. Our Xoom international money transfer service enables our customers to send money to people around the world in a secure, fast, and cost-effective way. P2P is an important source of customer engagement and also serves as a customer acquisition channel that facilitates organic growth by enabling potential users to establish active accounts with PayPal or Venmo at the time they make or receive a P2P payment.\nWe offer credit products to eligible consumers in certain markets as a funding source at checkout. Our consumer credit offerings include our buy now, pay later products in the U.S., United Kingdom (“U.K.”), France, and Germany, among other markets, and in Japan through our Paidy brand. A key attribute of our buy now, pay later products is the absence of interest or consumer late fees for missed payments in most of the geographies where we offer them. Further, we offer interest-bearing installment products for consumers in the U.S. (issued by an independent chartered financial institution) and in Germany. In the U.S., consumers may apply for our PayPal- and Venmo-branded consumer credit cards and our PayPal Credit revolving consumer credit product, which are offered through a partnership with an independent chartered financial institution. We offer a PayPal-issued PayPal Credit product in the U.K. We believe that our consumer credit products help us to increase engagement with consumers and merchants on our two-sided network.\nWe generate revenue from consumers from: foreign currency conversions, instant transfers from their PayPal or Venmo account to their bank account or debit card, and facilitating the purchase and sale of cryptocurrencies; interest, fees, or other revenue from our credit products; and other miscellaneous fees. We also earn revenue from interest earned on certain assets underlying customer balances.\nMerchant value proposition\nMerchants use our solutions to increase conversion rates and grow and manage their business. We employ a technology and platform agnostic approach intended to enable merchants of all sizes to utilize our various products. Our diversified suite of products and services is tailored to meet the needs of merchants regardless of their size or business complexity. We offer a seamless omnichannel solution that helps merchants manage and grow their business.\nOur PayPal and Venmo branded checkout experiences allow customers to complete purchases in just a few steps without having to enter payment and address information. These seamless experiences reduce cart abandonment and drive higher conversion rates for merchants. Our buy now, pay later solutions are embedded into our branded checkout experiences, which can help increase consumer spend and enable merchants to grow sales.\nOur unbranded payments processing solutions, which includes Braintree and PayPal Complete Payments, allow merchants to quickly and easily provide digital checkout online with a variety of popular ways to pay, including debit and credit cards, digital wallets, PayPal Pay Later, and local payment methods.\nWe offer a suite of value added services, including payouts, payments orchestration, and fraud prevention and risk management solutions that help reduce merchant losses through proprietary protection programs. We also offer omnichannel solutions that allow merchants to make sales in person using our Zettle by PayPal app, card reader, or point of sale systems.\nWe offer access to merchant financing products for eligible small and medium-sized businesses through the PPWC and PPBL products, which we collectively refer to as our merchant financing solutions. The PPWC product allows businesses to access a loan or cash advance for a fixed fee, based on their annual payment volume processed by PayPal. The PPBL product provides businesses with access to short-term financing for a fixed fee or interest based on an evaluation of the applying business as well as the business owner. In the U.S., these products are provided under a program agreement with an independent chartered financial institution. We believe that our merchant financing solutions enable us to deepen our engagement with our existing small and medium-sized merchants and expand services to new merchants by providing access to capital that may not be available from traditional banks or other lenders.\nWe generate revenues from merchants primarily by charging fees for completing their payment transactions and other payment-related services. We also earn revenues from interest and fees earned on our merchant loans and advances and interest earned on certain assets underlying customer balances.\nPROTECTING CONSUMERS AND MERCHANTS\nProtecting consumers and merchants on our payments platform from financial and fraud loss is important to successfully compete and sustainably grow our business. Fraudulent activities, such as account takeover, identity theft (including stolen financial information), and malicious activities by counterparties, represent a significant risk to consumers and merchants, as well as their payment partners. In addition to the protections afforded by applicable law, we provide consumers and merchants with protection programs for certain purchase transactions completed on our payments platform. Our protection programs help protect both consumers and merchants from financial loss resulting from, among other things, counterparty non-performance. These programs are designed to promote confidence on the part of both consumers, who will be reimbursed in certain circumstances, such as not receiving their purchased item in the condition significantly as described, as well as merchants, who will receive payment in certain circumstances, such as establishing proof of shipment or delivery of an item to the customer. We believe that these programs are generally consistent with or broader than protections provided by other participants in the payments industry.\nOur ability to help protect both consumers and merchants is based largely on our proprietary, end-to-end payments platform and our ability to utilize the data from both sides of transactions on our two-sided network, specifically from buyers and sellers and from senders and receivers of payments. Our ongoing investment in systems and processes is designed to enhance the safety and security of our products and reflects our goal of having PayPal recognized as one of the world’s most trusted payments brands.\nCOMPETITION\nThe global payments industry is highly competitive, dynamic, and innovative, and subject to regulatory scrutiny and oversight. Many of the areas in which we compete evolve rapidly with innovative and disruptive technologies, shifting user preferences and needs, price sensitivity of consumers and merchants, and frequent introductions of new products and services. Competition also may intensify as new competitors emerge, businesses combine or enter into new partnerships, and established companies in other segments expand to become competitive with various aspects of our business.\nOur business faces competition from a wide range of businesses and from all forms of physical and electronic payments. We face competition from banks and financial institutions, which provide traditional payment methods (particularly credit cards and debit cards (collectively, “payment cards”), electronic bank transfers, credit, and installment methods), payment networks that facilitate payments for payment cards or proprietary retail networks, payment card processors, and “card on file” services. We also face competition from providers offering a variety of payment products and services ranging from broader platfor",
  "item7_clean": "(In millions, except percentages and per share amounts)\nOther income (expense), net\nNet income (loss) per diluted share\nNet cash provided by operating activities\nAll amounts in tables are rounded to the nearest million, except as otherwise noted. As a result, certain amounts may not recalculate using the rounded amounts provided.\nNet revenues increased $2.0 billion, or 7%, in 2024 compared to 2023 driven primarily by growth in total payment volume (“TPV”, as defined below under “Key Metrics”) of 10%.\nTotal operating expenses increased $1.7 billion, or 7%, in 2024 compared to 2023 due primarily to an increase in transaction expense, and to a lesser extent, restructuring and other, partially offset by a reduction in transaction and credit losses.\nOperating income increased $297 million, or 6%, in 2024 compared to 2023 due to net revenues increasing more than operating expenses. Our operating margin remained consistent at 17% for both 2024 and 2023.\nNet income decreased $99 million, or 2%, in 2024 compared to 2023 due to the previously discussed increase in operating income of $297 million and a decrease of $379 million in other income (expense), net, driven primarily by net losses on strategic investments in the current period as compared to net gains on strategic investments in the prior period.\nIMPACT OF FOREIGN EXCHANGE RATES\nWe have significant international operations that are denominated in foreign currencies, primarily the British pound, Euro, Australian dollar, and Canadian dollar, subjecting us to foreign exchange risk which may adversely impact our financial results. The strengthening or weakening of the United States (“U.S.”) dollar versus foreign currencies in which we conduct our international operations impacts the translation of our net revenues and expenses generated in these foreign currencies into the U.S. dollar. In 2024, 2023, and 2022, we generated approximately 43%, 42%, and 43% of our net revenues from customers domiciled outside of the U.S., respectively. Because we generate substantial net revenues internationally, we are subject to the risks of doing business outside of the U.S., including those discussed under “Item 1A. Risk Factors.”\nWe calculate the year-over-year impact of foreign exchange rate movements on our business using prior period foreign exchange rates applied to current period transactional currency amounts. While changes in foreign currency exchange rates affect our reported results, we have a foreign currency exposure management program in which we use foreign exchange contracts, designated as cash flow hedges, intended to reduce the impact on earnings from foreign exchange rate movements. Gains and losses from these foreign exchange contracts are recognized as a component of transaction revenues or operating expenses (as applicable) in the same period the forecasted transactions impact earnings.\nIn the years ended December 31, 2024 and 2023, the year-over-year foreign exchange rate movements relative to the U.S. dollar had the following impact on our reported results:\nYear Ended December 31,\n(Unfavorable) favorable impact to net revenues (exclusive of hedging impact)\nFavorable impact to net revenues\nFavorable (Unfavorable) impact to operating expense\nNet favorable impact to operating income\nWhile we enter into foreign exchange contracts to help reduce the impact on earnings from foreign exchange rate movements, it is impossible to eliminate the total effects of this exposure.\nWe also use foreign exchange contracts, designated as net investment hedges, to reduce the foreign exchange risk related to our investment in certain foreign subsidiaries. Gains and losses associated with these instruments will remain in accumulated other comprehensive income (loss) until the underlying foreign subsidiaries are sold or substantially liquidated.\nGiven that we also have foreign exchange risk on our assets and liabilities denominated in currencies other than the functional currency of our subsidiaries, we have an additional balance sheet foreign currency exposure management program in which we use foreign exchange contracts to help offset the impact of foreign exchange rate movements on our assets and liabilities. The foreign exchange gains and losses on our assets and liabilities are recorded in other income (expense), net, and are offset by the gains and losses on the foreign exchange contracts. These foreign exchange contracts reduce, but do not entirely eliminate, the impact of foreign exchange rate movements on our assets and liabilities.\nAdditionally, in connection with transactions occurring in multiple currencies on our payments platform, we generally set our foreign exchange rates daily and may face financial exposure if we incorrectly set our foreign exchange rates or as a result of fluctuations in foreign exchange rates between the times that we set our foreign exchange rates and when transactions occur. While we have processes in place to mitigate these risks, it is impossible to eliminate the total effects of any possible exposure associated with setting foreign exchange rates on our payments platform.\nKEY METRICS AND FINANCIAL RESULTS\nKEY METRICS\nTPV, number of payment transactions, active accounts, and number of payment transactions per active account are key non-financial performance metrics (“key metrics”) that management uses to measure the scale of our platform and the relevance of our products and services to our customers, and are defined as follows:\nTPV\nis the value of payments, net of payment reversals, successfully completed on our payments platform or enabled by PayPal via a partner payment solution, not including gateway-exclusive transactions.\nNumber of payment transactions\nis the total number of payments, net of payment reversals, successfully completed on our payments platform or enabled by PayPal via a partner payment solution, not including gateway-exclusive transactions.\n\n(In millions, except percentages)\nTransaction and credit losses\nCustomer support and operations\nTechnology and development\nGeneral and administrative\nRestructuring and other\nTotal operating expenses\nTransaction expense rate\nTransaction and credit loss rate\nTransaction expense rate is calculated by dividing transaction expense by TPV.\nTransaction and credit loss rate is calculated by dividing transaction and credit losses by TPV.\nTransaction expense is primarily composed of the costs we incur to accept a customer’s funding source of payment. These costs include fees paid to payment processors and other financial institutions when we draw funds from a customer’s credit or debit card, bank account, or other funding source they have stored in their digital wallet. We refer to the allocation of funding sources used by our consumers as our “funding mix.” The cost of funding a transaction with a credit or debit card is generally higher than the cost of funding a transaction from a bank or through internal sources such as a PayPal or Venmo account balance or our consumer credit products. As we expand the availability and presentation of alternative funding sources to our customers, our funding mix may change, which could increase or decrease our transaction expense rate. The cost of funding a transaction is also impacted by the geographic region or country in which a transaction occurs, as we generally pay lower rates for transactions funded with credit or debit cards outside the U.S. Our transaction expense rate is impacted by changes in product mix, merchant mix, regional mix, funding mix, and fees paid to payment processors and other financial institutions. Macroeconomic environment changes may also result in behavioral shifts in consumer spending patterns affecting the type of funding source they use, which could also impact the funding mix.\nTransaction expense increased $1.3 billion, or 9%, in 2024 compared to 2023 due to Braintree, which has a higher expense rate than our other products and services, representing a larger portion of TPV. The decrease in transaction expense rate in 2024 compared to 2023 was attributable to favorable changes in regional mix, product mix, and certain third-party pricing incentives within our core PayPal products and services. For the years ended December 31, 2024, 2023, and 2022, approximately 37%, 36%, and 35% of TPV, respectively, was generated outside of the U.S.\nTransaction and credit losses\nTransaction losses include the expense associated with our customer protection programs, fraud, and chargebacks. Credit losses include the current expected credit losses associated with our consumer and merchant loans receivable portfolio. Our transaction and credit losses fluctuate depending on many factors, including TPV, product mix, current and projected macroeconomic conditions such as unemployment rates, retail e-commerce sales and household disposable income, merchant insolvency events, changes to and usage of our customer protection programs, the impact of regulatory changes, and the credit quality of loans receivable arising from transactions funded with our credit products for consumers and loans and advances to merchants. Estimating our current expected credit loss allowances for our loans receivable portfolios is an inherently uncertain process and the ultimate losses we incur may vary from the current estimates. We regularly update our allowance estimates as new facts become known and events occur that may impact the ultimate losses incurred. A deterioration in macroeconomic conditions or other factors beyond those considered in our estimates could result in credit losses that exceed our current estimated credit losses and adversely impact our future operating results.\nThe components of our transaction and credit losses for the years ended December 31, 2024, 2023, and 2022 were as follows (in millions):\nTransaction and credit losses decreased $240 million, or 14%, in 2024 compared to 2023.\nTransaction losses were approximately $1.1 billion and $1.2 billion for 2024 and 2023, respectively, reflecting a decrease of $78 million, or 7%. Transaction loss rate (transaction losses divided by TPV) was 0.07%, 0.08%, and 0.09% for the years ended December 31, 2024, 2023, and 2022, respectively. The decrease in transaction losses and the associated transaction loss rate in 2024 was primarily due to lower losses from our Venmo products and services resulting from enhanced risk mitigation strategies.\nCredit losses decreased $162 million in 2024 compared to 2023. The components of credit losses for the years ended December 31, 2024, 2023, and 2022 were as follows (in millions):\nYear Ended December 31,\nReserve (release) build\nNet charge-offs includes principal charge-offs partially offset by recoveries for consumer and merchant receivables.\nReserve (release) build represents change in allowance for principal receivables excluding foreign currency remeasurement.\nIncludes changes in the allowance due to the reclassification of loans and interest receivable to or from held for sale.\nCredit losses in the year ended December 31, 2024 were primarily attributable to loan originations during the period partially offset by improvement in the credit quality of loans outstanding. Credit losses in the year ended December 31, 2023 were primarily attributable to loan originations during the period and a deterioration in the credit quality of loans outstanding.\nConsumer loan portfolio\nThe consumer loans and interest receivable balance as of December 31, 2024 and 2023 was $5.4 billion and $4.8 billion, respectively, net of participation interest sold, reflecting an increase of 13%. The increase was driven primarily by growth of approximately $390 million and $250 million in our installment credit products driven by growth in Japan and the U.S., respectively, as well as growth of approximately $170 million in our revolving credit product in the U.K., partially offset by a decline of approximately $180 million in our installment credit products in Germany due to the forward-flow arrangement with the global investment firm.\nThe following table provides information regarding the credit quality of our consumer loans and interest receivable balance:\nPercent of consumer loans and interest receivable current\nPercent of consumer loans and interest receivable > 90 days outstanding\nRepresents percentage of balances which are 90 days past the billing date or contractual repayment date, as applicable.\nNet charge-off rate is the annualized ratio of net credit losses during the three months ended December 31, 2024, excluding fraud losses, on consumer loans as a percentage of the average daily amount of consumer loans and interest receivable balance during the same period.\nThe decline in net charge-off rate for consumer receivables at December 31, 2024 as compared to December 31, 2023 was due primarily to the improvement in credit quality of the U.S. interest-bearing installment products.\nIn response to changing portfolio performance and macroeconomic environment, we continue to monitor risk and evaluate and modify our acceptable risk parameters. Changes to such parameters in 2024 resulted in an increase of U.S. interest-bearing installment loan originations in 2024.\nMerchant loan portfolio\nWe offer access to merchant finance products for certain small and medium-sized businesses, which we refer to as our merchant finance offerings. Total merchant loans, advances, and interest and fees receivable outstanding, net of participation interest sold, as of December 31, 2024 and 2023 was $1.5 billion and $1.2 billion, respectively, reflecting an increase of 23%. The increase was due primarily to growth of approximately $170 million in our PayPal Working Capital (“PPWC”) product portfolio, primarily from the U.S., Germany and the U.K., as well as growth of approximately $110 million in our PPBL product in the U.S.\nThe following table provides information regarding the credit quality of our merchant loans, advances, and interest and fees receivable balance:\nPercent of merchant loans, advances, and interest and fees receivable current\nPercent of merchant loans, advances, and interest and fees receivable > 90 days outstanding\nRepresents percentage of balances which are 90 days past the original expected or contractual repayment period, as applicable.\nNet charge-off rate is the annualized ratio of net credit losses during the three months ended December 31, 2024, excluding fraud losses, on merchant loans and advances as a percentage of the average daily amount of merchant loans, advances, and interest and fees receivable balance during the same period.\nThe increase in the percent of current merchant receivables and decrease in percent of merchant receivables greater than 90 days outstanding and the net charge-off rate for merchant receivables at December 31, 2024 as compared to December 31, 2023 was due primarily to the improvement in underwriting and credit quality of the PPBL portfolio.\nIn response to changing portfolio performance and macroeconomic environment, we continue to monitor risk and evaluate and modify our acceptable risk parameters. Changes to such parameters resulted in an increase in PPBL originations in 2024.\nFor additional information, see “Note 11—Loans and Interest Receivable” in the notes to the consolidated financial statements, and “Item 1A. Risk Factors—\nOur credit products expose us to additional risks\nCustomer support and operations\nCustomer support and operations includes costs incurred in our global customer operations centers, including costs to provide call support to our customers, costs to support our trust and security programs protecting our consumers and merchants, and other costs incurred related to the delivery of our products, including payment devices, card production, and customer onboarding and compliance costs.\nCustomer support and operations expenses decreased $151 million, or 8%, in 2024 compared to 2023 due primarily to a decline in employee-relate",
  "item2_clean": null
}