{
  "source_file": "q-20250930.htm",
  "form_type": "10-Q",
  "item1_clean": null,
  "item7_clean": null,
  "item2_clean": "ITEM 2. MANAGEMENT'S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS\nOVERVIEW\nWe are a global leader in materials and solutions for semiconductor and electronics industries. We empower our customers’ technology roadmaps to enable advancements in megatrends such as artificial intelligence (\"AI\"), advanced computing and advanced connectivity. We partner with leading semiconductor and advanced device manufacturers to address complex challenges and develop solutions that facilitate next-generation technological innovations. With over 50 years of experience in systems engineering and material science, a global manufacturing footprint, and major application labs across the world, we are well-positioned to capitalize on emerging opportunities across various sectors including transportation, data centers, consumer and personal electronics and aerospace and defense.\nWe are organized into two operating segments:\nSemiconductor Technologies:\nOur Semiconductor Technologies segment provides a portfolio of innovative materials and solutions utilized across multiple stages of the semiconductor manufacturing process. These advanced materials are qualified into customers’ roadmaps, designed to improve chip performance, enhance yield, and enable leading-edge node technology.\nInterconnect Solutions:\nOur Interconnect Solutions segment offers a comprehensive range of best-in-class material solutions that address the evolving complexities of signal integrity, thermal and power management and advanced packaging. These solutions are integral for advanced electronics hardware, including complex printed circuit boards and advanced semiconductor packaging.\nOur broad portfolio of solutions and materials across both Semiconductor Technologies and Interconnect Solutions segments positions us as a comprehensive solutions provider for our customers. We are often the partner of choice due to our strong innovation capabilities and extensive materials and engineering expertise. In a fast-paced electronics industry, our customers’ needs are highly performance-driven and our long-standing relationships and strong renewal rates demonstrate our commitment to delivering excellence in a demanding market.\nMacroeconomic Environment\nRecent and continuing developments in U.S. and foreign policy related to trade, such as the imposition of new or increased tariffs on product imports from certain countries have heightened global trade tensions and sparked significant uncertainty in macroeconomic and geopolitical environments, particularly with respect to China. The nature of our global business exposes us to risks associated with trade conflicts between the U.S. and its trading partners, including about the ultimate extent and duration of the tariffs, responsive actions from other countries and the resulting impacts, including on general economic conditions and on our financial condition, liquidity, or results of operations. As a result, we may face a reduction in the demand for, and in the competitiveness of, our products, particularly from local or domestically sourced competition, harm to our relationships with our customers, and decreased profitability, which have the potential to adversely affect our business, financial condition and results of operations.\nTransition to Stand-Alone Company\n\nRESULTS OF OPERATIONS\nSummary of Sales Results\nThe following table summarizes sales variances by segment and geographic region from the prior year:\nSales Variances by Segment and Geographic Region\nPercentage change from prior year\nThree Months Ended September 30, 2025\nNine Months Ended September 30, 2025\nSemiconductor Technologies\nInterconnect Solutions\nEMEA\nEurope, Middle East and Africa.\nWe reported net sales for the three months ended September 30, 2025 of $1.3 billion, up 11% from $1.1 billion for the three months ended September 30, 2024, due to an 11% increase in volume and a 1% favorable currency impact partially offset by a 1% decrease in local price and product mix. The volume increase was attributable to both Interconnect Solutions (up 15%) and Semiconductor Technologies (up 9%). Contributing to the volume increase was an approximate $40 million benefit from order timing related to system cut-over activities in advance of the Separation. The favorable currency impact was attributable to Interconnect Solutions (up 1%) while the currency impact of Semiconductor Technologies remained flat. Local price and product mix declined in both Interconnect Solutions (down 1%) and Semiconductor Technologies (down 1%).\nNet sales for the nine months ended September 30, 2025 were $3.6 billion, up 10% from $3.2 billion for the nine months ended September 30, 2024, due to a 12% increase in volume partially offset by a 2% decrease in local price and product mix. The increase in volume was attributable to both Interconnect Solutions (up 15%) and Semiconductor Technologies (up 9%). Contributing to the volume increase was an approximate $40 million benefit from order timing related to system cut-over activities in advance of the Separation. Local price and product mix declined in both Interconnect Solutions (down 2%) and Semiconductor Technologies (down 1%).\nCost of sales were $701 million for the three months ended September 30, 2025, up 15% from $609 million for the three months ended September 30, 2024 primarily due to increased volume of 10% as well as increases in input costs of 4% and unfavorable currency impacts of 1%.\nCost of sales as a percentage of net sales for the three months ended September 30, 2025 was 55% as compared to 53% for the three months ended September 30, 2024.\nCost of sales were $1.9 billion for the nine months ended September 30, 2025, up 9% from $1.8 billion for the nine months ended September 30, 2024 due to increased volume of 9%.\nCost of sales as a percentage of net sales remained flat at 54% for the nine months ended September 30, 2025 and 2024.\nResearch and Development (\"R&D\") Expenses\nR&D expense was $92 million for the three months ended September 30, 2025, up from $81 million for the three months ended September 30, 2024. R&D expense as a percentage of net sales was consistent period over period at 7% for each of the three months ended September 30, 2025 and 2024.\nR&D expense was $264 million for the nine months ended September 30, 2025, up from $230 million for the nine months ended September 30, 2024. R&D expense as a percentage of net sales was consistent period over period at 7% for each of the nine months ended September 30, 2025 and 2024.\nSelling, General and Administrative (\"SG&A\") Expenses\nSG&A expenses were $159 million in the third quarter of 2025, up slightly from $156 million in the third quarter of 2024. SG&A expenses as a percentage of net sales decreased period over period at 12% and 14% for the three months ended September 30, 2025 and 2024, respectively.\nFor the first nine months of 2025, SG&A expenses were $453 million, down from $461 million in the first nine months of 2024. SG&A expenses as a percentage of net sales remained relatively consistent at 13% and 14% for the nine months ended September 30, 2025 and 2024, respectively. The decrease for the nine months ended September 30, 2025 as compared with the same period of the prior year was primarily due to decrease in legal expenses partially offset by higher employee related costs.\nAmortization of Intangibles\nAmortization of intangibles was $51 million in the third quarter of 2025, down from $57 million in the third quarter of 2024. In the first nine months of 2025, amortization of intangibles was $156 million, down from $177 million in the same period of the prior year. The decrease for the three and nine months ended September 30, 2025 as compared with the same periods of the prior year was primarily due to the absence of amortization from fully amortized assets.\nRestructuring and Asset Related Charges - Net\nRestructuring and asset related charges - net were $1 million in the third quarter of 2025, down from $4 million of charges in the third quarter of 2024. In the first nine months of 2025, restructuring and asset related charges - net were $20 million, up from $7 million of charges in the same period last year. The activity for the three and nine months ended September 30, 2025 and 2024 related to nonrecurring charges in connection with DuPont-approved restructuring programs. See Note 4 to the unaudited interim Combined Financial Statements for additional information.\nEquity in Earnings of Nonconsolidated Affiliates\nOur share of the earnings of nonconsolidated affiliates was $15 million in the third quarter of 2025, up from $10 million in the third quarter of 2024. In the first nine months of 2025, our share of earnings of nonconsolidated affiliates was $37 million, up from $33 million in the first nine months of 2024. The increase for each of the three and nine month periods is due to higher earnings in the underlying nonconsolidated affiliates. See Note 10 to the unaudited interim Combined Financial Statements for additional information.\nOther Income (Expense) - Net\nOther income (expense) - net includes a variety of income and expense items such as gain or loss on sale of assets and foreign exchange gains or losses. Other income (expense) - net remained flat at $1 million of expense in the three months ended September 30, 2025, and 2024.\nIn the first nine months of 2025, Other income (expense) - net was an expense of $3 million, as compared to $9 million of income in the first nine months of 2024. The nine months ended September 30, 2025 included $4 million net foreign exchange loss, as compared to $3 million net foreign exchange gain for the nine months ended September 30, 2024. See Note 6 to the unaudited interim Combined Financial Statements for additional information.\nInterest expense was $14 million for the three and nine months ended September 30, 2025. There was no interest expense for the three and nine months ended September 30, 202"
}