{
  "source_file": "qcom-20250629.htm",
  "form_type": "10-Q",
  "item1_clean": null,
  "item7_clean": null,
  "item2_clean": "This Quarterly Report (including but not limited to this section titled Management’s Discussion and Analysis of Financial Condition and Results of Operations) contains forward-looking statements. Words such as “expects,” “anticipates,” “intends,” “plans,” “believes,” “seeks,” “estimates,” “may,” “will,” “would” and similar expressions or variations of such words are intended to identify forward-looking statements, but are not the exclusive means of identifying forward-looking statements in this Quarterly Report. Additionally, statements concerning future matters such as our future business, prospects, results of operations or financial condition; research and development or technology investments; new or enhanced products, services or technologies; emerging industries or business models; design wins or product launches; industry, market or technology trends, dynamics or transitions; our expectations regarding future demand or supply conditions; strategic investments or acquisitions, and the anticipated timing or benefits thereof; legal or regulatory matters, including the expected impacts of recently enacted or pending tax or other regulatory changes; U.S./China trade or national security tensions; vertical integration by our customers; competition; annual effective tax rates; and other statements regarding matters that are not historical are also forward-looking statements.\nAlthough forward-looking statements in this Quarterly Report reflect our good faith judgment, such statements can only be based on facts and factors currently known by us. Consequently, forward-looking statements are inherently subject to risks and uncertainties and actual results and outcomes may differ materially from the results and outcomes discussed in or anticipated by the forward-looking statements. Factors that could cause or contribute to such differences in results and outcomes include without limitation those discussed under the heading “Risk Factors” below, as well as those discussed elsewhere in this Quarterly Report\nged not to place undue reliance on these forward-looking statements, which speak only as of the date of this Quarterly Report. We undertake no obligation to revise or update any forward-looking statements in order to reflect any event or circumstance that may arise after the date of this Quarterly Report. Readers are urged to carefully review and consider the various disclosures made in this Quarterly Report, which attempt to advise interested parties of the risks and factors that may affect our business, financial condition, results of operations and prospects.\nThird Quarter Fiscal 2025 Overview\nRevenues for the third quarter of fiscal 2025 were $10.4 billion, an increase of 10% compared to the year ago quarter, with net income of $2.7 billion, an increase of 25% compared to the year ago quarter. Key items from the third quarter of fiscal 2025 included:\nQCT revenues increased by 11% in the third quarter of fiscal 2025 compared to the year ago quarter due to higher handsets, IoT and automotive revenues.\nQTL revenues increased by 4% in the third quarter of fiscal 2025 compared to the year ago quarter, primarily due to an increase in estimated sales of 3G/4G/5G-based multimode products.\nOur Business and Operating Segments\nWe develop and commercialize foundational technologies and products used in mobile devices and other wireless products. We derive revenues principally from sales of integrated circuit products and licensing our intellectual property, including patents and other rights.\nWe are organized on the basis of products and services and have three reportable segments. We conduct business primarily through our QCT (Qualcomm CDMA Technologies) semiconductor business and our QTL (Qualcomm Technology Licensing) licensing business. Our QSI (Qualcomm Strategic Initiatives) reportable segment makes strategic investments. We also have nonreportable segments, including QGOV (Qualcomm Government Technologies) and our Data Center business (formerly referred to as our cloud computing processing initiative).\nOur reportable segments are operated by QUALCOMM Incorporated and its direct and indirect subsidiaries. Substantially all of our products and services businesses, including QCT, and substantially all of our engineering and research and development functions are operated by Qualcomm Technologies, Inc. (QTI), a wholly-owned subsidiary of QUALCOMM Incorporated, and QTI’s subsidiaries. QTL is operated by QUALCOMM Incorporated, which owns the vast majority of our patent portfolio. Neither QTI nor any of its subsidiaries has any right, power or authority to grant any licenses or other rights under or to any patents owned by QUALCOMM Incorporated.\nMany of our products and much of our intellectual property are incorporated into consumer wireless devices, which are subject to seasonality and other fluctuations in demand. Our revenues have historically fluctuated based on consumer demand for devices, as well as on the timing of customer/licensee device launches and/or innovation cycles (such as the transition to the next generation of wireless technologies). This has resulted in fluctuations in QCT revenues in advance of and during device launches incorporating our products (for example, certain major handset OEMs accelerated their premium-tier device launches into the first quarter of fiscal 2025) and in QTL revenues when licensees’ sales occur. These trends may or may not continue in the future. Further, the trends for QTL have been, and may in the future be, impacted by disputes and/or resolutions with licensees and/or governmental investigations or proceedings.\nResults of Operations\nRevenues (in millions)\nEquipment and services\n\nGross margin percentage decreased in the first nine months of fiscal 2025 primarily due to a decrease in the proportion of total revenues related to QTL licensing revenues (which have a higher margin contribution).\nResearch and development\nThird quarter 2025 vs. 2024\nThe decrease in research and development expenses in the third quarter of fiscal 2025 was primarily due to:\n$83 million decrease driven by lower costs related to the development of wireless and integrated circuit technologies (including investments in key growth and diversification opportunities), primarily driven by $189 million in higher non-recurring engineering cost reimbursements for product-related development work, partially offset by higher employee-related costs\n$35 million increase in expenses driven by the revaluation of our deferred compensation obligation (which resulted in a corresponding increase in net gains on deferred compensation plan assets within investment and other income, net due to the revaluation of the related assets)\nFirst nine months 2025 vs. 2024\nThe increase in research and development expenses in the first nine months of fiscal 2025 was primarily due to a $132 million increase in share-based compensation expense. Our costs related to the development of wireless and integrated circuit technologies (including investments in key growth and diversification opportunities) remained approximately flat, primarily driven by $288 million in higher non-recurring engineering cost reimbursements for product-related development work, partially offset by an increase in employee-related costs.\nSelling, general and administrative\nThird quarter and first nine months 2025 vs. 2024\nThe increase in selling, general and administrative expenses in the third quarter and first nine months of fiscal 2025 was primarily due to an increase in sales and marketing expenses.\nInterest Expense and Investment and Other Income, Net (in millions)\nInvestment and other income, net\nInterest and dividend income\nNet gains on marketable securities\nNet gains on other investments\nNet gains on deferred compensation plan assets\nImpairment losses on other investments\nNet gains on marketable securities in the third quarter and first nine months of fiscal 2025 was primarily driven by the initial public offerings of certain QSI equity investments.\nNet gains on other investments in the first nine months of fiscal 2024 was primarily driven by certain of our QSI non-marketable equity investments.\nIncome Tax Expense (in millions, except percentages)\nThe following table summarizes the primary factors that caused our income tax provision to differ from the expected income tax provision at the U.S. federal statutory rate:\nExpected income tax provision at federal statutory tax rate\nBenefit from foreign-derived intangible income (FDII) deduction, excluding the impact of capitalizing research and development expenditures\nBenefit from FDII deduction related to capitalizing research and development expenditures\nBenefit related to the federal research and development tax credit\nExcess tax benefit associated with share-based awards\nForeign currency (gain) loss related to foreign withholding tax receivable\nFor the third quarter of fiscal 2025, we estimate our annual effective income tax rate to be 11% for fiscal 2025, which is lower than the U.S. federal statutory rate. Additional information regarding our annual effective income tax rate and income tax expense is provided in this Quarterly Report in “Notes to Condensed Consolidated Statements, Note 3. Income Taxes.”\nOn July 4, 2025, tax reform legislation included in the One Big Beautiful Bill Act (OBBB) was enacted in the United States. The impact of the OBBB is excluded from our estimated annual effective tax rate and provision for income taxes for the third quarter of fiscal 2025 as it is a nonrecognized subsequent event. The OBBB includes significant corporate tax reforms, including the permanent reinstatement of deducting domestic research and development expenditures as incurred beginning in fiscal 2026 (under prior law such expenditures were capitalized and amortized over five years). We expect this change will have a favorable effect on our cash flows from operations due to significantly lower cash tax paymen"
}