{
  "source_file": "reg-20241231.htm",
  "form_type": "10-K",
  "item1_clean": null,
  "item7_clean": "We use certain non-GAAP measures, in addition to certain performance metrics determined under GAAP, as we believe these measures improve the understanding of the operating results. We believe these non-GAAP measures provide useful information to our Board of Directors, management and investors regarding certain trends relating to our financial condition and results of operations. Our management uses these non-GAAP measures to compare our performance to that of prior periods for trend analyses, purposes of determining management incentive compensation and budgeting, forecasting and planning purposes. We provide Pro-rata financial information because we believe it assists investors and analysts in estimating our economic interest in our consolidated and unconsolidated real estate partnerships, when read in conjunction with our reported results under GAAP. We believe presenting our Pro-rata share of operating results, along with other non-GAAP measures, may assist in comparing our operating results to other REITs. We continually evaluate the usefulness, relevance, limitations, and calculation of our reported non-GAAP measures to determine how best to provide relevant information to the public, and thus such reported non-GAAP measures could change. See \"Non-GAAP Measures\" in \"Item 1.\n\" for additional information regarding the definition of and other information regarding the non-GAAP measures we present in this Report.\n\nWe currently have development and redevelopment projects in various stages of planning, design and construction, along with a pipeline of potential projects for future development or redevelopment. After funding our common and preferred stock dividend payments in January 2025, we estimate that we will require capital during the next 12 months of approximately $544.9 million related to leasing commissions, tenant improvements, in-process developments and redevelopments, capital contributions to our real estate partnerships, and repaying maturing debt. These capital requirements are being impacted by inflation resulting in increased costs of construction materials, labor, and services from third party contractors and suppliers. In response, we have implemented mitigation strategies such as entering into fixed cost construction contracts, pre-ordering materials, and other planning efforts. Further, continued challenges from permitting delays and labor and material shortages may extend the time to completion of these projects.\n\nWe do not consider non-GAAP measures as an alternative to financial measures determined in accordance with GAAP, rather they supplement GAAP measures by providing additional information we believe to be useful to our shareholders. The principal limitation of these non-GAAP measures is they may exclude significant expense and income items that are required by GAAP to be recognized in our Consolidated Financial Statements. In addition, they reflect the exercise of management's judgment about which expense and income items are excluded or included in determining these non-GAAP measures. In order to compensate for these limitations, reconciliations of the non-GAAP measures we use to their most directly comparable GAAP measures are provided, including as set forth below. Non-GAAP measures should not be relied upon in evaluating the financial condition, results of operations, or future prospects.\n\nIn accordance with GAAP, we evaluate our real estate for impairment whenever there are events or changes in circumstances, including property operating performance, general market conditions or changes in expected hold periods, that indicate that the carrying value of our real estate properties (including any related amortizable intangible assets or liabilities) may not be recoverable. If such events or changes occur, we compare the current carrying value of the asset to the estimated undiscounted cash flows that are directly associated with the use and ultimate disposition of the asset. Our estimated cash flows are based on several key assumptions, including rental rates, expected leasing activity, costs of tenant improvements, leasing commissions, expected hold period, comparable sales information, and assumptions regarding the residual value upon disposition, including the exit capitalization rate. These key assumptions are subjective in nature and the resulting impairment, if any, could differ from the actual gain or loss recognized upon ultimate sale in an arm's length transaction. If the carrying value of the asset exceeds the estimated undiscounted cash flows, an impairment loss is recognized equal to the excess of carrying value over the estimated fair value.\n\nKnowledge about our significant accounting policies is necessary for a complete understanding of our Consolidated Financial Statements. The preparation of our Consolidated Financial Statements requires that we make certain estimates, judgments, and assumptions that impact the balance of assets and liabilities as of the financial statement date and the reported amount of income and expenses during the financial reporting period. These accounting estimates, judgments and assumptions are based upon, but not limited to historical experience, current trends, expected future results, current market conditions, and interpretation of industry accounting standards. While the following is not intended to be a comprehensive list of our accounting estimates, the estimates discussed below are believed to be critical because of their significance to the Consolidated Financial Statements and the possibility that future events may differ from those judgments, or that the use of different assumptions could result in materially different estimates. We review these estimates on a periodic basis to ensure reasonableness; however, the amounts we may ultimately realize could differ from such estimates.\n\nWe are subject to numerous environmental laws and regulations, which primarily pertain to chemicals historically used by certain current and former dry cleaning and gas station tenants and the existence of asbestos in older shopping centers. We believe that the relatively few tenants who currently operate dry cleaning plants or gas stations do so in accordance with current laws and regulations. Generally, we endeavor to require tenants to remove dry cleaning plants from our shopping centers or convert them to more environmentally friendly systems, in accordance with the terms of our leases. We carry an environmental insurance policy for certain third-party liabilities and, in certain circumstances, remediation costs on shopping centers for currently unknown contamination. We have also secured environmental insurance policies, where appropriate, on a relatively small number of specific properties with known contamination, in order to mitigate our environmental risk. We monitor the shopping centers containing environmental issues and in certain cases voluntarily remediate the sites. We also have legal obligations to remediate certain sites and we are in the process of doing so.\n\nThe Company had accrued liabilities of $17.3 million for environmental remediation, which are included in Accounts payable, and other liabilities on the Company’s Consolidated Balance Sheets as of December 31, 2024. We believe that the ultimate remediation of currently known environmental matters will not have a material effect on our financial position, cash flows, or results of operations. We can give no assurance that existing environmental studies on our shopping centers have revealed all potential environmental contamination; that our estimate of liabilities will not change as more information becomes available; that any previous owner, occupant or tenant did not create any material environmental condition not known to us; that the current environmental condition of the shopping centers will not be affected by tenants and occupants, by the condition of nearby properties, or by unrelated third parties; or that changes in applicable environmental laws and regulations or their interpretation will not result in additional environmental liability to us.\n\nThe estimated fair value of real estate assets is subjective and is estimated through comparable sales information and other market data if available, as well as the use of an income approach such as the direct capitalization method or the discounted cash flow approach. The discounted cash flow method uses similar assumptions to the undiscounted cash flow method above, as well as a discount rate. Such cash flow projections and rates are subject to management judgment and changes in those assumptions could impact the estimation of fair value. In estimating the fair value of undeveloped land, we generally use market data and comparable sales information. Changes in events or changes in circumstances may alter the expected hold period of an asset or asset group, which may result in an impairment loss and such loss could be material to the Company's financial condition or operating performance.\n\nOur management team devotes significant time to researching and monitoring consumer preferences and trends, customer shopping behaviors, changes in delivery methods, shifts to e-commerce, and changing demographics in order to anticipate the challenges and opportunities impacting our industry. We seek to mitigate potentially adverse impacts through maintaining a high quality portfolio, diversifying our geographic and tenant mix, replacing less successful tenants with stronger operators, anchoring our centers with market leading grocery stores that drive customer traffic, and investing in suburban trade areas with compelling demographic populations benefiting from high levels of disposal income. The potential for a recession and the severity and duration of any economic downturn could negatively impact our existing tenants and their ability to continue to meet their lease obligations.\n\n$33.4 million increase in contractual Recoveries from tenants which represents their proportionate share of the operating, maintenance, insurance, and real estate tax expenses that we incur to operate our shopping centers. Recoveries from tenants increased, mainly from the following:\n\nIf we start new developments or redevelopments, commit to property acquisitions, repay debt prior to maturity, declare future dividends, or repurchase shares of our common stock, our cash requirements will increase. If we refinance maturing debt, our cash requirements will decrease.\n\nFor a discussion and analysis of the year ended December 31, 2023, compared to the same period in 2022, see \"Part II, Item 7.\nManagement's Discussion and Analysis of Financial Condition and Results of Operations\n\n$8.6 million increase from same properties primarily due to higher operating costs in the current year coupled with higher expense recovery rates;\n\n$1.3 million increase from same properties primarily attributable to higher recoverable common area maintenance and other tenant-related costs.\n\nRecoveries from tenants increased by $9.0 million due to increases in recoverable expenses, expense recovery rates and increased occupancy.\n\nOperating and maintenance increased by $1.7 million primary due to increases in common area maintenance and other tenant-recoverable costs.\n\nDuring November and December 2024, we entered into forward sale agreements with respect to 1,339,377 shares that were purchased in several tranches at a weighted average offering price of $74.66 per share before any underwriting discount and offering expenses. These shares are pledged under forward sale agreements and must be settled within one year of their trade dates, which vary by agreement and are expected to result in net proceeds of approximately $100 million. After giving effect to this forward equity offering as of December 31, 2024, $400 million of common stock remains available for issuance under the ATM program authorized by the Company's Board of Directors, which is subject to change in the discretion of the Board.\n\n$6.9 million increase in compensation costs primarily driven by salary increases and performance-based incentive compensation;\n\nPro-rata same property NOI, excluding termination fees/expenses, increased $27.8 million from the following major components:\n\n$1.6 million increase primarily attributable to higher costs in technology related spending and professional fees;\n\nDuring November and December 2024, we entered into forward sale agreements with respect to 1,339,377 shares that were purchased in several tranches at a weighted average offering price of $74.66 per share before any underwriting discount and offering expenses. These shares are pledged under forward sale agreements and must be settled within one year of their trade dates, which vary by agreement and are expected to result in net proceeds of approximately $100 million. Proceeds from the issuance of shares are expected to be used to fund acquisitions of operating properties, to fund developments and redevelopments, and for general corporate purposes. No shares have been settled through December 31, 2024.\n\nItem 7. Management’s Discussion and Analysis of\nFinancial Condition and Results of Operations\n\nTotal real estate operating expenses increased by $6.4 million, on a net basis, as follows:\n\nOther operating expenses increased by $1.4 million, mainly due to the acquisition of UBP.\n\nGeneral and administrative costs increased by $3.7 million, mainly due to the following:\n\nRedevelopment costs are $41.1 million higher than prior year. We intend to continuously improve our portfolio of shopping centers through redevelopment which can include adjacent land acquisition, existing building expansion, facade renovation, new out-parcel building construction, and redevelopment related tenant improvement costs. The size and magnitude of each redevelopment project varies with each redevelopment plan. The timing and duration of these projects could also result in volatility in NOI. See the tables below for more details about our redevelopment projects.\n\nInterest is capitalized on our development and redevelopment projects and is based on cumulative actual costs expended. We cease interest capitalization when the property is no longer being developed or is available for occupancy upon substantial completion of tenant improvements, but in no event would we capitalize interest on the project beyond 12 months after the anchor tenant opens for business. If we reduce our development and redevelopment activity, the amount of interest that we capitalize may be lower than historical averages.\n\nAlthough base rent is derived from long-term lease contracts, tenants that file for bankruptcy generally have the legal right to reject any or all of their leases and close related stores. Any unsecured claim we hold against a bankrupt tenant for unpaid rent might be paid only to the extent that funds are available and only in the same percentage as is paid to all other holders of unsecured claims. As a result, in a tenant bankruptcy situation it is likely that we would recover substantially less than the full value of any unsecured claims we hold. Additionally, we may incur significant expense to adjudicate our claim and significant downtime to re-lease the vacated space. In the event that a tenant with a significant number of leases in our shopping centers files for bankruptcy and rejects its leases, we could experience a significant reduction in our revenues. As of December 31, 2024, the tenants who are currently in bankruptcy and which continue to occupy space in our shopping centers represent an aggregate of 0.7% of our Pro-rata annual base rent with no single tenant exceeding 0.5% of Pro-rata annual base rent.\n\nWe continually assess our available liquidity and our expected cash requirements, including monitoring our tenant rent collections. We have access to and draw on multiple financing sources to fund our operations and our long-term capital needs, incl",
  "item2_clean": null
}