{
  "source_file": "reg-20250930.htm",
  "form_type": "10-Q",
  "item1_clean": null,
  "item7_clean": null,
  "item2_clean": "We continued our development and redevelopment of high quality shopping centers:\nEstimated Pro-rata project costs of our current in process development and redevelopment projects totaled $668.1 million at September 30, 2025, compared to $497.3 million at December 31, 2024.\nDevelopment and redevelopment projects completed during the nine months ended September 30, 2025 represented $48.4 million of estimated net project costs, with an average stabilized yield of 14.3%. A stabilized yield for development and redevelopment projects represents the incremental NOI (estimated stabilized NOI less NOI prior to project commencement) divided by the total project costs.\nWe maintained liquidity and the financial flexibility to cost effectively fund investment opportunities and debt maturities:\nIn February 2025, we received a credit rating upgrade to A- with a stable outlook from S&P Global Ratings.\nOn May 13, 2025, the Company issued $400 million of senior unsecured notes due 2032, at a par value of 99.279% and a coupon of 5.0% (the \"2025 Notes\").\nIn July 2025, in connection with the acquisition of five operating properties, the Operating Partnership issued 2,773,087 Common Units and assumed $150 million of secured mortgage debt with a weighted average interest rate of 4.2% and an average remaining term of approximately 12 years.\nThe Company settled forward sales agreements entered into during 2024 under its ATM program as follows:\nIn August 2025, the Company issued 673,172 shares of common stock and received $49.2 million of net proceeds.\nSubsequent to quarter end, in October 2025, the Company issued an additional 666,205 shares of common stock and received $49.1 million of net proceeds. Upon completion of these settlements, the Company had fully settled all forward sales agreements entered into during 2024.\nSubsequent to quarter end, on October 1, 2025, the Company received a property distribution from its Regency-GRI real estate partnership. The distribution involved 11 of the 66 properties within the partnership and the Company received five of these properties, which had an aggregate fair value of approximately $113 million, and assumed an existing fixed rate mortgage loan on one property of $10 million maturing January 2026 with an interest rate of 3.95%. The remaining six properties were distributed to the other partner.\nWe have $646.3 million of loans maturing during the next 12 months, of which, $250 million was repaid upon maturity on November 3, 2025, and Regency's pro-rata share of maturities within our unconsolidated real estate partnerships which we intend to refinance or pay-off as they mature.\nAt September 30, 2025, we had $1.46 billion available on the Line, which expires on March 23, 2028 unless we exercise the available options to extend the expiration for either or both of two additional consecutive six-month periods, in which case the term will be extended in accordance with any such option exercise.\nRefer to the Estimated Risks and Uncertainties section in Note 1 — Organization and Significant Accounting Policies, as these risks and uncertainties could have a material impact on future results of operations and trends.\n\nManagement's Discussion and Analysis of Financial Condition and Results of Operations\nForward-Looking Statements\nCertain statements in this document regarding anticipated financial, business, legal or other outcomes including business and market conditions, outlook and other similar statements relating to Regency's future events, developments, or financial or operational performance or results, are \"forward-looking statements\" made pursuant to the safe harbor provisions of the Private Securities Litigation Reform Act of 1995 and other federal securities laws. These forward-looking statements are identified by the use of words such as \"may,\" \"will,\" \"could,\" \"should,\" \"would,\" \"expect,\" \"estimate,\" \"believe,\" \"intend,\" \"forecast,\" \"project,\" \"plan,\" \"anticipate,\" \"guidance,\" and other similar language. However, the absence of these or similar words or expressions does not mean a statement is not forward-looking. While we believe these forward-looking statements are reasonable when made, forward-looking statements are not guarantees of future performance or events and undue reliance should not be placed on these statements. Although we believe the expectations reflected in any forward-looking statements are based on reasonable assumptions, we can give no assurance these expectations will be attained, and it is possible actual results may differ materially from those indicated by these forward-looking statements due to a variety of risk factors, including, without limitation, risk factors relating to:\nthe current economic and geopolitical environments\npandemics or other health crises\noperating retail-based shopping centers\nreal estate investments\nthe environment affecting our properties\nour partnerships and joint ventures\nfunding strategies and capital structure\ninformation management and technology\ntaxes and the Parent Company’s qualification as a REIT\nthe Company’s stock price.\n\nNon-GAAP Financial Measures\nIn addition to the required Generally Accepted Accounting Principles (\"GAAP\") presentations, we use and report certain non-GAAP financial measures as we believe these measures improve the understanding of our operational results. We believe these non-GAAP financial measures provide useful information to our Board of Directors, management and investors regarding certain trends relating to our financial condition and results of operations. Our management uses these non-GAAP financial measures to compare our performance to that of prior periods for trend analyses, purposes of determining management incentive compensation and budgeting, forecasting and planning purposes. We continually evaluate the usefulness, relevance, limitations, and calculation of our reported non-GAAP financial measures to determine how best to provide relevant information to the public, and thus such reported measures could change.\nWe do not consider non-GAAP financial measures an alternative to financial measures determined in accordance with GAAP, rather they supplement GAAP measures by providing additional information we believe to be useful to our shareholders. The principal limitation of these non-GAAP financial measures is that they may exclude significant expense and income items that are required by GAAP to be recognized in our Consolidated Financial Statements. In addition, they reflect the exercise of management's judgment about which expense and income items are excluded or included in determining these non-GAAP financial measures. In order to compensate for these limitations, reconciliations of the non-GAAP financial measures we use to their most directly comparable GAAP measures are provided. Non-GAAP financial measures should not be relied upon in evaluating the financial condition, results of operations, or future prospects of the Company.\n\nAdjusted Funds From Operations (\"AFFO\")\nis an additional performance measure we use that reflects cash available to fund the Company’s business needs and distribution to shareholders. AFFO is calculated by adjusting Core Operating Earnings (\"COE\") for (i) capital expenditures necessary to maintain and lease our portfolio of properties, (ii) debt cost and derivative adjustments and (iii) stock-based compensation.\nCore Operating Earnings\nis an additional performance measure we use because the computation of Nareit Funds from Operations (\"\n\") includes certain non-comparable items that affect our period-over-period performance. Core Operating Earnings excludes from Nareit FFO: (i) transaction related income or expenses, (ii) gains or losses from the early extinguishment of debt, (iii) certain non-cash components of earnings derived from straight-line rents, above and below market rent amortization, and debt and derivative mark-to-market amortization, and (iv) other amounts as they occur.\nNareit Funds from Operations (\"Nareit FFO\")\nis a commonly used measure of REIT performance, which Nareit defines as net income, computed in accordance with GAAP, excluding gains on sales and impairments of real estate, net of tax, plus depreciation and amortization, and after adjustments for unconsolidated real estate investment partnerships and joint ventures. We compute Nareit FFO for all periods presented in accordance with Nareit's definition.\nCompanies use different depreciable lives and methods, and real estate values historically fluctuate with market conditions. Since Nareit FFO excludes depreciation and amortization and gains on sale and impairments of real estate, it provides a performance measure that, when compared year over year, reflects the impact on operations from trends in percent leased, rental rates, operating costs, acquisition and development activities, and financing costs. This provides a perspective of our financial performance not immediately apparent from net income determined in accordance with GAAP. Thus, Nareit FFO is a supplemental non-GAAP financial measure of our operating performance, which does not represent cash generated from operating activities in accordance with GAAP; and, therefore, should not be considered a substitute measure of cash flows from operations.\nNet Operating Income (\"NOI\")\nis the sum of base rent, percentage rent, termination fee income, tenant recoveries, other lease income, and other property income, less operating and maintenance expenses, real estate taxes, ground rent, termination expense, and uncollectible lease income. NOI excludes straight-line rental income and expense, above and below market rent and ground rent amortization, tenant lease inducement amortization, and other fees. We also provide disclosure of NOI excluding termination fees, which excludes both termination fee income and expenses.\nManagement believes that NOI is a useful measure for investors because it provides insight into the core operations and perform"
}