{
  "source_file": "regn-20241231.htm",
  "form_type": "10-K",
  "item1_clean": "Regeneron Genetics Center LLC (RGC\n), a wholly owned subsidiary of Regeneron Pharmaceuticals, Inc., leverages de-identified clinical, genomic, and other types of molecular data from properly consented human volunteers from around the world to identify medically relevant associations in a blinded fashion designed to preserve a patient's privacy while uncovering the unique characteristics of their health and wellness. The objective of RGC is to expand the use of human genetics for discovering and validating genetic factors that cause or influence a range of diseases where there are major unmet medical needs, with the prospect of improving the drug discovery and development process and to advance innovation in clinical care design. RGC is undertaking multiple collaborative approaches to study design and implementation, including large population-based efforts that engage study participants to more discrete disease specific and founder populations with data on strategic phenotypes of interest. RGC utilizes laboratory automation and innovative approaches to cloud computing to achieve high-quality throughput, attaining nearly 3 million samples sequenced to date.\nIn January 2025, it was announced that RGC was selected by UK Biobank consortium members to complete proteomic assay data generation for the recently announced UK Biobank Pharma Proteomics Project.\nIn January 2025, RGC entered into an agreement with Truveta Inc. pursuant to which RGC will sequence exomes and conduct genotyping and imputation of up to ten million de-identified consented volunteers using biospecimens provided by Truveta health system members across the United States.\nIn addition, central to the ongoing work of RGC is the portfolio of collaborations with over 150 academic and clinical collaborators around the world, including the University of Colorado, Geisinger Health System, Mayo Clinic, University of Pennsylvania, UCLA Medical Center, UK Biobank, University of Oxford, and the University of Cambridge. These collaborations provide access to biological samples and associated phenotype data from properly consented patient volunteers for purposes of genomic research. RGC undertakes genetic sequencing of these samples to create a unique resource of de-identified genetic data and associated phenotype data for research. Furthermore, RGC has deployed bulk RNA sequencing, whole genome sequencing, and an O-LINK proteomic assay to complement whole exome sequencing and genotyping. In addition, RGC leverages organoid models, siRNA, and CRISPR knockout models to validate genetic associations that lead to new therapeutic targets. RGC continues to publish results from its research efforts in journals and publications in partnership with its collaborators to advance the field of genomics.\nThese efforts at RGC have led to the identification of more than 30 novel genetic targets. Through our Regeneron Genetics Medicines initiative, we are currently advancing these targets using either our\ntechnologies or other technologies, such as siRNA gene silencing, genome editing, and targeted viral-based gene delivery and expression. See the \"Collaboration, License, and Other Agreements\" section below for descriptions of our collaborations with Alnylam Pharmaceuticals, Inc. and Intellia Therapeutics, Inc.\nCollaboration, License, and Other Agreements\nWe are collaborating with Sanofi on the global development and commercialization of Dupixent, Kevzara, and itepekimab (the \"Antibody Collaboration\"). Under the terms of the Antibody Collaboration, Sanofi is generally responsible for funding 80% to 100% of agreed-upon development costs. We are obligated to reimburse Sanofi for 30% to 50% of worldwide development expenses that were funded by Sanofi based on our share of collaboration profits; however, we are only required to apply 20% of our share of profits from the collaboration each calendar quarter to reimburse Sanofi for these development expenses. As of December 31, 2024, the total amount of our contingent reimbursement obligation (i.e., \"development balance\") to Sanofi in connection with such development expenses was approximately $1.635 billion.\nUnder our collaboration agreement, Sanofi records product sales for commercialized products, and Regeneron has the right to co-commercialize such products on a country-by-country basis. We co-commercialize Dupixent in the United States and in certain countries outside the United States. We supply certain commercial bulk product to Sanofi. We and Sanofi equally share profits from sales within the United States, and share profits outside the United States on a sliding scale based on sales starting at 65% (Sanofi)/35% (us) and ending at 55% (Sanofi)/45% (us).\nWe and Bayer are parties to a license and collaboration agreement for the global development and commercialization of EYLEA 8 mg and EYLEA outside the United States. Agreed-upon development expenses incurred by the Company and Bayer are generally shared equally. Bayer is responsible for commercialization activities outside the United States, and the companies share equally in profits from such sales.\nWe are obligated to reimburse Bayer for 50% of the development costs that it has incurred under the agreement from our share of the collaboration profits. The reimbursement payment in any quarter will equal 5% of the then outstanding repayment obligation, but never more than our share of the collaboration profits in the quarter unless we elect to reimburse Bayer at a faster rate.\nWithin the United States, we retain exclusive commercialization rights and are entitled to all profits from such sales.\nIn 2019, we and Alnylam entered into a collaboration to discover, develop, and commercialize RNAi therapeutics for a broad range of diseases by addressing therapeutic disease targets expressed in the eye and central nervous system (\"CNS\"), in addition to a select number of targets expressed in the liver. For each program, we provide Alnylam with a specified amount of funding at program initiation and at lead candidate designation. During 2023, we paid a $100.0 million development milestone to Alnylam (in connection with a CNS program) and Alnylam is eligible to receive an additional $100.0 million clinical proof-of-principle milestone in connection with an eye program.\nUnder the terms of the collaboration, the parties perform discovery research until designation of lead candidates. Following designation of a lead candidate, the parties may further advance such lead candidate under either a co-development/co-commercialization collaboration agreement (\"Co-Co Collaboration Agreement\") or a license agreement structure. The initial target nomination and discovery period of five years has been automatically extended until the earlier of seven years from the effective date of the collaboration or the achievement of certain milestones (the \"Research Term\"). In addition, we have an option to extend the Research Term for an additional five-year period for a research extension fee of $300.0 million.\nFor CNS programs and liver programs, under a Co-Co Collaboration Agreement, the party designated as the lead party will lead development and commercialization of the program and the parties will split profits and share costs equally, subject to certain co-funding opt-outs at specified clinical trial phases or under other conditions.\nUnder a license agreement, the lead party is designated as the licensee and has the right to develop and commercialize the collaboration product under such program. The licensee will be responsible for its own costs and expenses incurred. The licensee will pay to the licensor certain development and/or commercialization milestone payments, as well as certain tiered royalty payments to the licensor based on the aggregate annual net sales of the collaboration product.\nWe have entered into various license agreements with Alnylam, with us as the licensee, including for cemdisiran as a monotherapy and for a combination consisting of cemdisiran and pozelimab.\nDuring the second quarter of 2024, we elected to no longer co-develop ALN-APP pursuant to a Co-Co Collaboration Agreement; as a result, Alnylam retains the right to develop and commercialize such product and we will receive a royalty on sales (if any).\nWe and Intellia Therapeutics, Inc. are parties to a license and collaboration agreement to advance CRISPR/Cas9 gene-editing technology for\ntherapeutic development. Nex-z, which is in clinical development, is subject to a co-development and co-commercialization arrangement pursuant to which Intellia will lead development and commercialization activities and the parties share an agreed-upon percentage of development expenses and profits (if commercialized). In addition, we also have non-exclusive rights to independently develop and commercialize\ngene edited products.\nIn September 2023, we expanded the license and collaboration agreement to develop additional\nCRISPR-based gene editing therapies focused on neurological and muscular diseases. Intellia will lead the design of the editing methodology, we will lead the design of the targeted viral vector delivery approach, and the parties share costs equally. Each company will have the opportunity to lead potential development and commercialization of product candidates for one target, and the company that is not leading development and commercialization will have the option to enter into a co-development and co-commercialization agreement for the target.\nIn addition, in October 2023, we elected to extend the period for selecting targets under the license and collaboration agreement for an additional two years until April 2026; as a result, we made a $30.0 million extension payment to Intellia.\nIn March 2024, Intellia elected to opt-out of further development activities pursuant to the Factor IX co-development and co-commercialization agreement; as a result, we retain the right to develop and commercialize products directed to Factor IX (which is currently in Phase 1 clinical development), and Intellia will be entitled to receive milestone payments and royalties on sales (if any).\nIn 2017, we entered into an agreement with Decibel Therapeutics, Inc. to discover and develop new potential therapeutics to protect, repair and restore hearing (including DB-OTO, which is currently in clinical development, and preclinical programs for GJB2-related and stereocilin-related hearing loss).\nIn 2023, we acquired Decibel by paying $101.3 million in cash (or $4.00 per share of Decibel common stock). In addition, Decibel shareholders received one non-tradeable contingent value right (\"CVR\") per share of Decibel common stock, entitling them to receive up to an additional $3.50 per share in cash upon achievement of certain development milestones for DB-OTO within specified time periods. During 2024, the first and second (final) development milestones contemplated by the CVRs were achieved. As a result, we have paid an aggregate amount of $97.1 million, which was the maximum amount that holders of the CVRs were entitled to receive (including the payment in respect of the second development milestone made in 2025).\nIn 2018, we entered into a collaboration agreement with bluebird bio, Inc. (which subsequently spun out 2seventy bio, Inc. in 2021) to research, develop, and commercialize novel cell therapy approaches to address cancer.\nIn April 2024, we acquired full development and commercialization rights to 2seventy bio's oncology and autoimmune preclinical and clinical stage cell therapy pipeline. Under the terms of the agreement, we made a $5.0 million up-front payment, and have assumed ongoing program, infrastructure, and personnel costs related to the product candidates acquired. We are obligated to pay 2seventy bio a regulatory milestone upon the first major market approval of the first approved product; and, with respect to any approved product, a low single-digit percent royalty on sales. In addition, we sepa",
  "item7_clean": "Research and development expenses included stock-based compensation expense of $543.8 million and $488.7 million in 2024 and 2023, respectively.\nThere are numerous uncertainties associated with drug development, including uncertainties related to safety and efficacy data from each phase of drug development, uncertainties related to the enrollment and performance of clinical trials, changes in regulatory requirements, changes in the competitive landscape affecting a product candidate, and other risks and uncertainties described in Part I, Item 1A. \"Risk Factors.\" There is also variability in the duration and costs necessary to develop a product candidate, potential opportunities and/or uncertainties related to future indications to be studied, and the estimated cost and scope of the projects. The lengthy process of seeking FDA and other applicable approvals, and subsequent compliance with applicable statutes and regulations, require the expenditure of substantial resources. Any failure by us to obtain, or delay in obtaining, regulatory approvals could materially adversely affect our business. We are unable to reasonably estimate if our product candidates in clinical development will generate material product revenues and net cash inflows.\nAcquired In-process Research and Development (\"IPR&D\") Expenses\nAcquired IPR&D expense in 2024 included a $45.0 million development milestone in connection with our collaboration agreement with Sonoma Biotherapeutics, Inc.\nAcquired IPR&D expense in 2023 included a $100.0 million development milestone in connection with our collaboration agreement with Alnylam Pharmaceuticals, Inc., a $45.0 million up-front payment in connection with our collaboration agreement with Sonoma, and a $30.0 million charge to extend the period for selecting targets under our collaboration agreement with Intellia Therapeutics, Inc.\nSelling, General, and Administrative Expenses\nSelling, general, and administrative expenses increased in 2024, compared to 2023, due to higher commercialization-related expenses to support our launch of EYLEA HD and higher headcount and headcount-related costs partly related to our international commercial expansion. Selling, general, and administrative expenses also included stock-based compensation expense of $355.0 million and $307.1 million in 2024 and 2023, respectively.\nCost of goods sold increased in 2024, compared to 2023, primarily due to higher start-up costs for our Rensselaer, New York fill/finish facility.\nOther Operating Expense (Income)\nOther operating expense (income), net, in 2024 reflected a charge of $53.4 million related to the increase in the estimated fair value of the contingent consideration liability recognized in connection with our 2023 acquisition of Decibel Therapeutics, Inc.\nOther Income (Expense)\nOther income (expense) consists of the following:\nYear Ended December 31,\nUnrealized gains (losses) on equity securities, net\nForeign currency (losses) gains, net\nOther income (expense), net\nTotal other income (expense)\nYear Ended December 31,\n(In millions, except effective tax rate)\nOur effective tax rate for 2024 and 2023 was positively impacted, compared to the U.S. federal statutory rate, primarily by stock-based compensation, income earned in foreign jurisdictions with tax rates lower than the U.S. federal statutory rate, and federal tax credits for research activities.\nCertain countries in which we have operations, including Ireland, have adopted legislation influenced by the Organization for Economic Co-operation and Development (\"OECD\") Global Anti-Base Erosion Model Rules (\"Pillar Two\") framework, including a minimum tax rate of 15%. The adoption of the Pillar Two framework did not have a material impact on our effective tax rate for the year ended December 31, 2024. It is uncertain whether the United States will enact legislation to adopt the Pillar Two framework. We continue to evaluate additional guidance released by the OECD, along with the pending legislative adoption by additional countries.\nLiquidity and Capital Resources\nOur financial condition is summarized as follows:\nCash and cash equivalents\nMarketable securities - current\nMarketable securities - noncurrent\nBorrowings and finance lease liabilities:\nFinance lease liabilities\nAs of December 31, 2024, we also had borrowing availability of $750.0 million under a revolving credit facility (see further description under \"\nSources and Uses of Cash for the Years Ended December 31, 2024, 2023, and 2022\nYear Ended December 31,\nCash flows provided by operating activities\nCash flows used in investing activities\nCash flows used in financing activities\nCash Flows from Investing Activities\nCapital expenditures in 2024 included costs incurred in connection with the expansion of our research, preclinical manufacturing, and support facilities at our Tarrytown, New York corporate headquarters, as well as costs associated with the expansion of our manufacturing facilities in Rensselaer, New York (including the fill/finish facility). In addition, in September 2024, we acquired an approximate 1,000,000 square foot facility in Saratoga Springs, New York. We expect to incur capital expenditures of $850 million to $975 million in 2025, including in connection with the continued expansion of our facilities in Tarrytown, New York. We expect continued significant capital expenditures over the next several years related to this expansion.\nPayments for the Libtayo intangible asset of $125.7 million, $207.8 million, and $1.027 billion in 2024, 2023, and 2022, respectively, related to our acquisition (including contingent consideration paid) of the exclusive right to develop, commercialize, and manufacture Libtayo worldwide.\nAcquisitions, net of cash acquired, of $54.9 million and $230.3 million in 2023 and 2022 was related to our acquisitions of Decibel Therapeutics, Inc. and Checkmate Pharmaceuticals, Inc., respectively.\nCash Flows from Financing Activities\nProceeds from issuances of Common Stock, in connection with exercises of employee stock options, were $1.465 billion during 2024, compared to $1.146 billion during 2023 and $1.520 billion during 2022. In addition, payments in connection with Common Stock tendered for employee tax obligations were $1.029 billion during 2024, compared to $700.6 million during 2023 and $445.7 million during 2022. For information related to repurchases of Common Stock, see \"\nShare Repurchase Programs\nThe Company is party to an agreement with a syndicate of lenders (the \"Credit Agreement\") which provides for a $750.0 million senior unsecured five-year revolving credit facility (the \"Credit Facility\"). The Credit Agreement includes an option for the Company to elect to increase the commitments under the Credit Facility and/or to enter into one or more tranches of term loans in the aggregate principal amount of up to $500.0 million, subject to the consent of the lenders providing the additional commitments or term loans, as applicable, and certain other conditions. The Credit Agreement also provides a $50.0 million sublimit for letters of credit.\nAs set forth in the Credit Agreement, we have the option to amend the Credit Agreement to establish environmental, social, and governance targets which will be used to adjust pricing under the Credit Facility, subject to parameters to be provided in the Credit Agreement.\nProceeds of the loans under the Credit Facility may be used to finance working capital needs, and for general corporate or other lawful purposes, of Regeneron and its subsidiaries. Regeneron Pharmaceuticals, Inc. has guaranteed all obligations under the Credit Facility. The Credit Agreement includes an option for us to elect to extend the maturity date of the Credit Facility beyond December 2027, subject to the consent of the extending lenders and certain other conditions. Amounts borrowed under the Credit Facility may be prepaid, and the commitments under the Credit Facility may be terminated, at any time without premium or penalty.\nWe had no borrowings outstanding under the Credit Facility as of December 31, 2024.\nThe Credit Agreement contains operating covenants and a maximum total leverage ratio financial covenant. We were in compliance with all covenants of the Credit Agreement as of December 31, 2024.\nShare Repurchase Programs\nIn November 2021, our board of directors authorized a share repurchase program to repurchase up to $3.0 billion of our Common Stock. As of June 30, 2023, the Company had repurchased the entire $3.0 billion of its Common Stock it was authorized to repurchase under the program.\nIn January 2023, our board of directors authorized a share repurchase program to repurchase up to an additional $3.0 billion of our Common Stock. As of September 30, 2024, the Company had repurchased the entire $3.0 billion of its Common Stock it was authorized to repurchase under the program.\nIn April 2024, our board of directors authorized a share repurchase program to repurchase up to an additional $3.0 billion of our Common Stock. The share repurchase program permits the Company to make repurchases through a variety of methods, including open-market transactions (including pursuant to a trading plan adopted in accordance with Rule 10b5-1 of the Exchange Act), privately negotiated transactions, accelerated share repurchases, block trades, and other transactions in compliance with Rule 10b-18 of the Exchange Act. Repurchases may be made from time to time at management's discretion, and the timing and amount of any such repurchases will be determined based on share price, market conditions, legal requirements, and other relevant factors. The program has no time limit and can be discontinued at any time. There can be no assurance as to the timing or number of shares of any repurchases in the future.\nThe table below summarizes the shares of our Common Stock that we repurchased and the cost of such shares, which were recorded as Treasury Stock.\nYear Ended December 31,\nTotal cost of shares\nAs of December 31, 2024, $1.917 billion remained available for share repurchases under the April 2024 program.\nIn February 2025, our board of directors authorized a share repurchase program to repurchase up to an additional $3.0 billion of our Common Stock. The share repurchase program was approved under terms substantially similar to the repurchase programs described above.\nIn February 2025, our board of directors declared our first quarterly cash dividend, in the amount of $0.88 per share on our Common Stock and Class A Stock. The cash dividend will be payable on March 20, 2025 to shareholders of record as of February 20, 2025.\nWe currently intend to continue to pay a quarterly cash dividend on our outstanding Common Stock and Class A Stock. Amounts and timing of any future cash dividends are subject to authorization by our board of directors in its sole discretion, after taking into consideration our financial condition and other relevant factors described under \"\nThere can be no assurance that we will continue to repurchase shares of our Common Stock or continue to declare cash dividends\n\" in Part I, Item 1A. \"Risk Factors.\"\nTarrytown, New York Corporate Headquarters Lease\nWe lease laboratory and office facilities for our corporate headquarters in Tarrytown, New York (the \"Facility\") under the Third Amended and Restated Lease and Remedies Agreement (the \"Lease\") with BA Leasing BSC, LLC, an affiliate of Banc of America Leasing & Capital, LLC (\"BAL\"), as lessor, and the Third Amended and Restated Participation Agreement (the \"Participation Agreement\") with Bank of America, N.A., as administrative agent, and a syndicate of lenders (collectively with BAL, the \"Participants\"), as rent assignees. The Lease, Participation Agreement, and certain related agreements provide for $720.0 million of lease financing (previously advanced by the Participants in March 2017 in connection with the acquisition by BAL of the Facility and our lease of the Facility from BAL), which matures when the term of the Lease expires in March 2027, at which time all amounts outstanding thereunder will become payable in full. We have the option to further extend the maturity date of the Participation Agreement and the term of the Lease for an additional five-year period, subject to the consent of the Participants and certain other conditions. We also have the option to (a) purchase the Facility by paying an amount equal to the outstanding principal amount of the Participants' advances under the Participation Agreement, all accrued and unpaid yield thereon, and all other outstanding amounts under the Participation Agreement, Lease, and certain related documents or (b) sell the Facility to a third party on behalf of BAL.\nPursuant to the Lease, we pay all maintenance, insurance, taxes, and other costs arising out of the use of the Facility. We are also required to make monthly payments of basic rent to satisfy the yield payable to the Participants on their outstanding advances under the Participation Agreement. Such advances accrue yield at a variable rate per annum based on the one-month forward-looking Secured Overnight Financing Rate (\"SOFR\") term rate, plus a spread adjustment, plus an applicable margin that varies with our debt rating and total leverage ratio.\nThe Lease is classified as a finance lease as we have the option to purchase the Facility under terms that make it reasonably certain to be exercised. The agreements governing the Lease financing contain financial and operating covenants. Such financial covenants and certain of the operating covenants are substantially similar to the covenants set forth in our Credit Agreement. We were in compliance with all such covenants as of December 31, 2024.\nAdditional Funding Requirements\nThe amount required to fund operations will depend on various factors, including the potential regulatory approval and commercialization of our product candidates and the timing thereof and the extent and cost of our research and development programs. We believe that our existing capital resources, borrowing availability under the Credit Facility, funds generated by anticipated product sales, and funding for reimbursement of research and development costs that we are entitled to receive under our collaboration agreements, will enable us to meet our anticipated operating needs for the foreseeable future.\nWe expect to continue to incur significant costs in connection with our research and development activities (including preclinical and clinical programs). The amount of funding that will be required for our clinical programs depends upon the results of our research and preclinical programs and early-stage clinical trials, regulatory requirements, the duration and results of clinical trials underway and of additional clinical trials that we decide to initiate, and the various factors that affect the cost of each trial, including the size of trials, fees charged for services provided by clinical trial investigators and other third parties, the costs for manufacturing the product candidate for use in the trials, and other expenses.\nWe also anticipate continuing to incur substantial commercialization costs for our marketed products. Commercialization costs over the next few years will depend on, among other things, the market potential for product candidates, whether commercialization costs are shared with a collaborator, and regulatory approval of additional product candidates.\nWe expect that expenses related to the filing, prosecution, defense, and enforcement of patents and other intellectual property will be substantial.\nLiabilities for unrecognized tax benefits totaled $1.314 billion as of December 31, 2024. Due to their nature, there is a high degree of uncertainty regarding the period and amounts of potential future cash settlement with tax authorities. We expect the IRS to\nconclude its examination of our 2017 and 2018 federal income tax returns within the next twel",
  "item2_clean": null
}