{
  "source_file": "rf-20250930.htm",
  "form_type": "10-Q",
  "item1_clean": null,
  "item7_clean": null,
  "item2_clean": "Qualitative adjustments\nWhile it is the intent of Regions' quantitative allowance methodologies to reflect all risk factors, including incremental risk in portfolios identified as under stress, any estimate involves assumptions and uncertainties resulting in some level of imprecision. Regions' qualitative framework has a general imprecision component which is meant to acknowledge that model and forecast errors are inherent in any modeling estimate. In the third quarter of 2025, the general imprecision component increased due to uncertainty related to the government shutdown and continued elevated economic uncertainty partially offset by general model imprecision improvements.\nThe qualitative framework also has specific adjustment components which are reserves meant to capture specific issues or events that management believes are not adequately captured in the model outcomes. Qualitative adjustments for the third quarter of 2025 were reduced slightly from the second quarter of 2025 levels due to improvements in previously identified portfolios of interest.\nThe combined results from general imprecision and specific qualitative adjustments slightly increased the allowance during the third quarter.\nBased upon the factors discussed above, the September 30, 2025 allowance decreased $30 million compared to the second quarter of 2025 due primarily to improvement in commercial and investor real estate criticized loans, a decline in non-performing loans, and continued resolutions of loans within previously identified portfolios of interest, partially offset by a decline in the economic forecast.\n\nrevised loss estimates related to the failures, which compares to a release in the special assessment of $3 million in nine months ended 2025. Contributing to the overall decrease was a reduction of the base assessment primarily due to higher unsecured debt, lower concentration risk, and improved credit metrics.\nVisa Class B shares Expense\nVisa class B shares expense is associated with previously sold shares. The Visa class B shares have restrictions tied to finalization of certain covered litigation. Visa class B shares expense decreased in the third quarter and nine months ended September 30, 2025 compared to the same periods in 2024 due to a lower escrow funding expense for the Company's proportionate share related to the ongoing covered litigation which totaled $5 million in the third quarter of 2025 compared to $14 million in the third quarter of 2024.\nOperational losses include losses related to fraud, execution, delivery and process management, and damage to physical assets. Operational losses decreased in the nine months ended September 30, 2025 compared to the same period in 2024 primarily due to improvements in check fraud during the first nine months of 2025 as a result of effective countermeasures.\nBranch consolidation, property and equipment charges\nBranch consolidation, property and equipment charges include valuation adjustments related to owned branches when the decision to close them is made. Accelerated depreciation and lease write-off charges are recorded for leased branches through and at the actual branch close date. Branch consolidation, property and equipment charges also include costs related to occupancy optimization initiatives. Branch consolidation, property and equipment charges in the third quarter and nine months ended September 30, 2025 include a gain recognized on the disposition of a property in the third quarter of 2025.\nOther Miscellaneous Expenses\nOther miscellaneous expenses include expenses related to communications, postage, supplies, certain credit-related costs, foreclosed property expenses, mortgage repurchase costs, and other costs (benefits) related to employee benefit plans. Other miscellaneous expenses increased the nine months ended September 30, 2025 compared to the same period in 2024 primarily due to a contingent reserve release in the second quarter of 2024 related to a prior acquisition, which did not repeat.\nINCOME TAXES\nThe Company’s income tax expense for the three months ended September 30, 2025 was $139 million compared to $118 million for the three months ended September 30, 2024, resulting in effective tax rates of 19.7 percent and 19.4 percent, respectively. The Company’s income tax expense for the nine months ended September 30, 2025 was $413 million compared to $338 million for the nine months ended September 30, 2024, resulting in effective tax rates of 20.3 percent and 19.9 percent, respectively.\nThe effective tax rate is affected by many factors including, but not limited to, the level of pre-tax income, the mix of income between various tax jurisdictions with differing tax rates, enacted tax legislation, net tax benefits related to affordable housing investments, bank-owned life insurance income, tax-exempt interest and nondeductible expenses. In addition, the effective tax rate is affected by items that may occur in any given period but are not consistent from period-to-period, such as the termination of certain leveraged leases, share-based payments, valuation allowance changes and changes to UTBs. Accordingly, the comparability of the effective tax rate between periods may be impacted.\nAt September 30, 2025, the Company reported a net deferred tax asset of $254 million compared to $775 million at December 31, 2024. The decrease in the net deferred tax position primarily reflects the deferred tax effects associated with decreases in unrealized losses on securities available for sale and derivative instruments recognized during the period.\nOn July 4, 2025, the One Big Beautiful Bill Act passed into law. The Company has assessed the impacts of the statute to the consolidated financial statements and expects that such impacts will be immaterial.\n\nU.S. Treasury securities\nFederal agency securities\nObligations of states and political subdivisions\nMortgage-backed securities:\nCommercial non-agency\nCorporate and other debt securities\nDebt securities, which comprise approximately 23 percent of earning assets, are an important tool used to manage interest rate sensitivity and provide a primary source of liquidity for the Company, as much of the portfolio is highly liquid. Additionally, some of the debt securities portfolio is eligible to be used as collateral for funding of various types of borrowings. See the \"Liquidity\" section for more information on these arrangements. Also see the \"Market Risk-Interest Rate Risk\" section for more information. See also Note 3 \"Debt Securities\" for additional information.\nDebt securities held to maturity constituted approximately 18 percent of the debt securities portfolio at September 30, 2025. In the first half of 2025, the Company reclassified debt securities with an amortized cost, excluding items recognized in OCI, of $2.0 billion from available for sale into held to maturity to reduce the volatility in AOCI in preparation for expected, upcoming changes to regulatory guidance as discussed in the \"Regulatory Requirements\" section.\nDebt securities available for sale constituted approximately 82 percent of the debt securities portfolio at September 30, 2025. Regions maintains a highly-rated debt securities portfolio consisting primarily of agency MBS. Regions’ investment policy emphasizes credit quality and liquidity.\nDebt securities increased $2.0 billion from December 31, 2024 to September 30, 2025 due to the purchase of approximately $1.0 billion of residential agency MBS debt securities in the second quarter of 2025, lower market interest rates and tighter spreads resulting in lower unrealized holding losses, and AOCI amortization. Of note, the Company executed debt securities repositionings in the first and third quarters of 2025 involving the sale of shorter-duration commercial and residential agency MBS and replacement with residential agency MBS with favorable prepayment profiles. In total, the Company sold approximately $1.0 billion of debt securities available for sale and realized approximately $50 million in pre-tax losses. The intent was to maintain the debt securities portfolio duration that would otherwise shorten naturally while efficiently deploying capital. Proceeds from the sales were reinvested at higher market yields.\nThe average life of the debt securities portfolio at September 30, 2025 was estimated to be 5.9 years, with a duration of approximately 4.0 years, inclusive of fair value hedges (see Table 19). These metrics compare with an estimated average life of 6.1 years and a duration of approximately 4.5 years for the portfolio at December 31, 2024.\nLOANS HELD FOR SALE\nThe following table presents Regions’ loans held for sale by type:\nTable 2—Loans Held for Sale\nResidential first mortgage\nConsumer and other performing\nCommercial loans held for sale include commercial mortgage loans originated for sale to third parties and commercial loans originally recorded as held for investment when management has the intent to sell. Levels of commercial loans held for sale fluctuate based on timing of sale to third parties. The levels of residential first mortgage loans held for sale that are part of the Company's mortgage originations fluctuate depending on the timing of origination and sale to third parties.\n\nBeginning in December 2016, new home equity lines of credit have a 10-year draw period and a 20-year repayment term. During the 10-year draw period customers do not have an interest-only payment option, except on a very limited basis. From May 2009 to December 2016, home equity lines of credit had a 10-year draw period and a 10-year repayment term. Prior to May 2009, the predominant structure was a 20-year draw period with a balloon payment upon maturity. The term “balloon payment” means there are no principal payments required until the balloon payment is due for interest-only lines of credit.\nThe following table presents information regarding the future principal payment reset dates for the Company's home equi"
}