{
  "source_file": "rjf-20250630.htm",
  "form_type": "10-Q",
  "item1_clean": null,
  "item7_clean": null,
  "item2_clean": "Other borrowings and collateralized financings\nWe had $750 million in FHLB borrowings outstanding at June 30, 2025, comprised of floating-rate and fixed-rate advances. The interest rates on our floating-rate advances are based on SOFR. We use interest rate swaps to manage the risk of increases in interest rates associated with our floating-rate FHLB advances by converting the balances subject to variable interest rates to a fixed interest rate.\nRAYMOND JAMES FINANCIAL, INC. AND SUBSIDIARIES\nManagement’s Discussion and Analysis\nA portion of our fixed income transactions are cleared through a third-party clearing organization, which provides financing for the purchase of trading instruments to support such transactions. The amount of financing is based on the amount of trading inventory financed, as well as any deposits held at the clearing organization. Amounts outstanding under this financing arrangement are collateralized by a portion of our trading inventory and accrue interest based on market rates. While we had borrowings outstanding as of June 30, 2025, the clearing organization is under no contractual obligation to lend to us under this arrangement.\nSenior notes payable\nRAYMOND JAMES FINANCIAL, INC. AND SUBSIDIARIES\nManagement’s Discussion and Analysis\nOur issuer, senior long-term debt, and preferred stock credit ratings as of the most current report are detailed in the following table.\nStandard & Poor’s Ratings Services\nIssuer and senior long-term debt:\nA-\nA3\nA-\nDate of last rating action\nBB+\nN/A\nDate of last rating action\nN/A\nOur current credit ratings depend upon a number of factors, including industry dynamics, operating and economic environment, operating results, operating margins, earnings trends and volatility, balance sheet composition, liquidity and liquidity management, capital structure, overall risk management, business diversification and market share, and competitive position in the markets in which we operate. Deterioration in any of these factors could impact our credit ratings. Any rating downgrades could increase our costs in the event we were to obtain additional financing.\nShould our credit rating be downgraded prior to a public debt offering, it is probable that we would have to offer a higher rate of interest to bond investors. A downgrade to below investment grade may make a public debt offering difficult to execute on terms we would consider to be favorable. A downgrade below investment grade could result in the termination of certain derivative contracts and the counterparties to the derivative instruments could request immediate payment or demand immediate and ongoing overnight collateralization on our derivative instruments in liability positions. A credit downgrade could damage our reputation and result in certain counterparties limiting their business with us, result in negative comments by analysts, potentially negatively impact investors’ and/or clients’ perception of us, cause clients to withdraw bank deposits that exceed FDIC insurance limits from our bank subsidiaries, and cause a decline in our stock price. None of our borrowing arrangements contains a condition or event of default related to our credit ratings. However, a credit downgrade would result in the firm incurring a higher facility fee on the Credit Facility, in addition to triggering a higher interest rate applicable to any borrowings outstanding on that line as of and subsequent to such downgrade. Conversely, an improvement in RJF’s current credit rating could have a favorable impact on the facility fee, as well as the interest rate applicable to any borrowings on such line.\nOther sources and uses of liquidity\nWe have corporate-owned life insurance policies which are utilized to fund certain non-qualified deferred compensation plans and other employee benefit plans. Certain of our non-qualified deferred compensation plans and other employee benefit plans are employee-directed (i.e., the participant chooses investment portfolio benchmarks) while others are company-directed. Of the corporate-owned life insurance policies which fund these plans, certain policies could be used as a source of liquidity for the firm. Those policies against which we could readily borrow had a cash surrender value of $1.28 billion as of June 30, 2025, comprised of $888 million related to employee-directed plans and $392 million related to company-directed plans, and we were able to borrow up to 90%, or $1.15 billion, of the June 30, 2025 total without restriction. To effect any such borrowing, the underlying investments would be converted to money market investments, therefore requiring us to take market risk related to the employee-directed plans. There were no borrowings outstanding against any of these policies as of June 30, 2025.\nOn May 8, 2024, we filed a “universal” shelf registration statement with the SEC pursuant to which we can issue debt, equity and other capital instruments if and when necessary or perceived by us to be opportune. Subject to certain conditions, this registration statement will be effective through May 8, 2027.\nRAYMOND JAMES FINANCIAL, INC. AND SUBSIDIARIES\nManagement’s Discussion and Analysis\nREGULATORY\nRJF and certain of its subsidiaries are subject to regular reviews and inspections by regulatory authorities and SROs. In addition, regulatory agencies and SROs institute investigations from time to time into industry practices, among other things. For example, beginning in August 2024, the SEC’s Division of Enforcement requested information regarding our practices related to cash sweep programs for investment advisory clients and is reportedly conducting similar reviews at other financial institutions. The firm has been cooperating with this inquiry. In addition, in August and December 2024, a total of three putative class action lawsuits were filed in federal district court alleging, among other things, that the firm breached its fiduciary duties or agreements with regard to rates paid to clients in our cash sweep programs. All three cases were subsequently consolidated, but on July 24, 2025, the plaintiff in one of the three lawsuits voluntarily dismissed all of their claims without prejudice. We intend to vigorously defend against the claims asserted by the remaining named plaintiffs.\nThe SEC adopted final rules mandating central clearing of cash, repurchase, and reverse repurchase transactions in U.S. Treasuries. In February 2025, the SEC extended the compliance dates for these rules by one year to December 2026 for cash market transactions and to June 2027 for repurchase and reverse repurchase transactions. We are actively working to update our business practices to align with the new requirements and do not expect the rule to have a material impact on our financial position.\nIn December 2024, the SEC adopted a final rule amending SEC Rules 15c3-3, the Customer Protection rule, and 15c3-1, the Net Capital rule. These amendments will require large clearing/carrying broker-dealers, including RJ&A, to compute customer and Proprietary Account of Broker-dealer reserve requirements and make any required reserve account deposits daily rather than the current weekly requirement. In June 2025, the SEC extended the compliance date for this rule by six months to June 30, 2026. We are prepared to comply with the rule as of its effective date and do not expect it to have a material impact on our statement of financial position.\nOn July 4, 2025, the One Big Beautiful Bill Act was signed into law, enacting significant changes to the U.S. tax code. Among its many provisions, those most likely to have an impact on our firm include the restoration of accelerated depreciation provisions (i.e., bonus depreciation), immediate expensing for domestic research and development costs (reversing prior amortization requirements), modifications to certain U.S. international tax provisions enacted under the 2017 Tax Cuts and Jobs Act, a new limitation on charitable contributions whereby deductions will only be permitted for amounts exceeding 1% of taxable income, and the eventual phaseout of certain renewable energy tax credit programs. The changes to renewable energy programs do not impact tax credits applicable to our existing renewable energy equity investments. The effective dates of these provisions vary, and we are currently evaluating the impact these changes will have on our consolidated financial statements, including the potential effects on our effective tax rate, deferred tax assets and liabilities, and related disclosures.\nRAYMOND JAMES FINANCIAL, INC. AND SUBSIDIARIES\nManagement’s Discussion and Analysis\nCRITICAL ACCOUNTING ESTIMATES\nDue to their nature, estimates involve judgment based upon available information. Actual results or amounts could differ from estimates and the difference could have a material impact on the condensed consolidated financial statements. Therefore, understanding these critical accounting estimates is important in understanding our reported results of operations and financial position. We believe that of our accounting estimates and assumptions, those described in the following sections involve a high degree of judgment and complexity.\nAllowance for credit losses\nWe evaluate certain of our financial assets, including bank loans, to estimate an allowance for credit losses based on expected credit losses over a financial asset’s lifetime. The remaining life of our financial assets is determined by considering contractual terms and expected prepayments, among other factors. We use multiple methodologies in estimating an allowance for credit losses and our approaches differ by type of financial asset and the risk characteristics within each financial asset type. Our estimates are based on ongoing evaluations of our financial assets, the related credit risk characteristics, and the overall economic and environmental conditions affecting the financial assets. Our process for determining the "
}