{
  "source_file": "rl-20250329.htm",
  "form_type": "10-K",
  "item1_clean": "Our concession-based shop-within-shops were located at approximately 300 retail locations.\nThe size of our concession-based shop-within-shops ranges from approximately 100 to 5,500 square feet. We may share in the cost of building out certain of these shop-within-shops with our department store partners.\nDirectly-Operated Digital Commerce Websites\nIn addition to our stores, our retail business sells products online in North America, Europe, and Asia through our various directly-operated digital commerce sites, which include www.RalphLauren.com, among others. We continue to expand accessibility to our digital flagships globally while localizing language, currencies, payment methods, product assortments, and content. We also sell our products online through various third-party digital partner commerce sites, primarily in Asia, as well as through our Ralph Lauren app in the U.S.\nOur Ralph Lauren digital commerce sites offer our customers access to a broad array of Ralph Lauren, Double RL, Polo, and Lauren apparel, footwear & accessories, watch and jewelry, fragrance, and home product assortments, and reinforce the luxury image of our brands. While investing in digital commerce operations remains a primary focus, it is an extension of our investment in the integrated omni-channel strategy used to operate our overall retail business, in which our digital commerce operations are interdependent with our physical stores.\nOur Wholesale Business\nOur wholesale business sells our products globally primarily to major department stores, specialty stores, and golf and pro shops, as well as to various third-party digital partners. We have continued to focus on elevating our brand by improving in-store product assortment and presentation, as well as full-price sell-throughs to consumers. As of the end of Fiscal 2025, our wholesale products were sold through over 9,400 doors worldwide, with the majority in specialty stores. Our products are also increasingly being sold through the digital commerce sites of many of our traditional wholesale customers and our third-party digital partners.\nThe primary product offerings sold through our wholesale channels of distribution include apparel, footwear & accessories, and home product assortments. Our luxury brands, including Ralph Lauren Collection and Ralph Lauren Purple Label, are distributed worldwide through a limited number of premier fashion retailers. In North America, our wholesale business is comprised primarily of sales to department stores, and to a lesser extent, specialty stores. In Europe, our wholesale business is comprised primarily of a varying mix of sales to both department stores and specialty stores, depending on the country, as well as to various third-party digital partners. In Asia, our wholesale business is comprised primarily of sales to department stores and various third-party digital partners. We also distribute our wholesale products to certain licensed stores operated by our partners in Asia, Europe, Latin America, and emerging markets.\nWe sell most of our excess and out-of-season products through secondary distribution channels worldwide, including our retail outlet stores.\nWorldwide Wholesale Distribution Channels\nThe following table presents by segment the approximate number of our primary full-price wholesale doors of distribution as of March 29, 2025:\nIn addition to our conventional wholesale doors, our products are increasingly being sold through the websites of many of our traditional wholesale customers, as well as those of our third-party digital partners. As of March 29, 2025, our wholesale business served approximately 120 third-party digital partners, primarily in Europe.\nWe have three key wholesale customers that generate significant sales volume. During Fiscal 2025, sales to our three largest wholesale customers accounted for approximately 12% of our total net revenues. Approximately 70% of sales to our three largest wholesale customers related to our North America segment and approximately 30% related to our Europe segment.\nOur products are sold primarily by our own sales forces. Our wholesale business maintains its primary showrooms in New York City, as well as regional showrooms in London, Madrid, Milan, Munich, Paris, and Stockholm. In addition, we utilize virtual showrooms, allowing our customers to experience and discover our product assortments in a retail setting remotely.\nAs a critical element of our distribution to department stores, we and our licensing partners utilize shop-within-shops to enhance brand recognition, to permit more complete merchandising of our lines by the department stores, and to differentiate the presentation of our products.\nThe following table presents by segment the approximate number of shop-within-shops in our primary full-price distribution network as of March 29, 2025:\nThe size of our shop-within-shops ranges from approximately 80 to 9,200 square feet. Shop-within-shop fixed assets primarily include items such as customized freestanding fixtures, wall cases and components, decorative items, and flooring. We normally share in the cost of building out these shop-within-shops with our wholesale customers.\nReplenishment Program.\nCore products such as knit shirts, chino pants, oxford cloth shirts, select footwear & accessories, and home products can be ordered by our wholesale customers at any time through our replenishment program. We generally ship these products within two to five days of order receipt.\nWe generally receive wholesale orders approximately three to five months prior to the time the products are delivered to customers, except for orders received through our replenishment program which ship within two to five days of order receipt. Our wholesale orders are generally subject to broad cancellation rights. Further, the size of our order backlog depends on several factors, including the timing of the market weeks for our particular lines during which a significant percentage of our orders are received and the timing of shipments, which varies from year-to-year with consideration for holidays, consumer trends, concept plans, and the replenishment program's usage. Consequently, the dollar amount of our backlog as of any date may not be indicative of actual future shipments and therefore is not meaningful in understanding our business as a whole.\nOur Licensing Business\nThrough licensing alliances, we combine our consumer insight, design, and marketing skills with the specific product or geographic competencies of our licensing partners to create and build new businesses. We generally seek out licensing partners who are leaders in their respective markets, contribute the majority of product development costs, provide the operational infrastructure required to support the business, and own the inventory. Our licensing business has been aggregated with other non-reportable segments.\nWe grant our product licensees the right to access our various trademarks in connection with the licensees' manufacture and sale of designated products, such as certain apparel categories, eyewear, fragrances, and home furnishings. Each product licensing partner pays us royalties based upon its sales of our products, generally subject to a minimum royalty requirement for the right to use our trademarks and design services. In addition, our licensing partners may be required to allocate a portion of their revenues to advertising our products and sharing in the creative costs associated with these products. Larger allocations typically are required in connection with launches of new products or in new territories. Our license agreements generally have three to five-year terms and may grant the licensees conditional renewal options.\nWe work closely with all of our licensing partners to ensure that their products are developed, marketed, and distributed to reach the intended consumer and are presented consistently across product categories to convey the distinctive identity and lifestyle associated with our brands. Virtually all aspects of the design, production quality, packaging, merchandising, distribution, advertising, and promotion of Ralph Lauren products are subject to our prior approval and continuing oversight. We perform a broader range of services for most of our Ralph Lauren Home licensing partners than we do for our other licensing partners, including design, operating showrooms, marketing, and advertising.\nThe following table lists our largest licensing agreements as of March 29, 2025 for the product categories presented. Except as noted in the table, these product licenses cover North America only.\nUnderwear and Sleepwear\nHanesbrands, Inc. (includes Japan)\n5 Star Apparel LLC (includes South America and South Korea)\nS. Rothschild & Co., Inc.\nCharles Komar and Sons, Inc. (includes Europe and the Middle East)\nIntimates and Sleepwear\nDelta Galil (global)\n5 Star Apparel LLC (includes South America)\nL'Oreal S.A. (global)\nMen's and Women's Slippers and Children's Footwear\nBBC International LLC (global, excluding Japan and South Korea)\nLuxottica Group S.p.A. (global)\nNaigai Co., Ltd. (Japan only)\nUtility and Blankets\nDown-lite International, Inc.\nVisual Comfort of America LLC (global)\nInternational Licensed Distribution\nOur international licensing partners acquire the right to sell, promote, market, and/or distribute various categories of our products in a given geographic area and source products from us, our product licensing partners, and/or independent sources. International licensees' rights may include the right to own and operate retail stores. As of March 29, 2025, our international licensing partners operated 116 stores.\nInvesting in our digital ecosystem remains a primary focus and is a key component of our integrated global omni-channel strategy that spans across owned and partnered channels, both physical and digital. Our digital ecosystem is comprised of directly-operated platforms, wholesale partner websites, third-party digital pure players, social commerce, and third-party gaming platforms.\nOur directly-operated digital commerce sites and mobile application represent our digital flagships, featuring the most elevated expression of our brands. The strategy for our digital flagships is to deliver distinct and immersive brand experiences, continuously enhance consumer experience, and develop digital content that drives deeper consumer engagement and conversion. We continue to optimize our customer experience globally with the introduction of numerous features including new payment methods and improved search capabilities, as well as greater personalization and enhanced content. In conjunction with introducing new features, we have focused on foundational needs ranging from platform enhancements to technology solutions to operational efficiencies. Driving our long-term growth strategy, we also continue to scale and expand our Connected Retail capabilities to enhance the consumer experience and leverage inventory across direct-to-consumer channels, which include Online Appointment Bookings, Digital Clienteling, Endless Aisle, Buy Online-Ship from Store, Buy Online-Pick up In Store, Same-Day Delivery, and Mobile Point of Sale and contactless payments, among other capabilities.\nOur products are also sold through the digital commerce sites of many of our wholesale customers across the globe. With all partners in our ecosystem, we seek to showcase the brand consistently with our values. We collaborate with our key wholesale customers to deliver the right content to the right audience, and leverage consumer insights to develop a holistic, channel-agnostic view of our consumer.\nWe also sell our products online through various third-party digital pure-play sites to reach a broader audience of consumers, including younger consumers, and amplify our brand messages. On many of these sites, we have created digital shop-in-shop environments with a consistent brand experience, tailore",
  "item7_clean": "Interest payments on debt\nOther lease commitments\nInventory purchase commitments\nMandatory transition tax payments\nReal estate purchase commitment\nThe following is a description of our material, firmly committed obligations as of March 29, 2025:\nrepresent the principal amount of our outstanding 3.750% Senior Notes and 2.950% Senior Notes. Amounts do not include any call premiums, unamortized debt issuance costs, or interest payments (see below);\nInterest payments on debt\nrepresent the semi-annual contractual interest payments due on our 3.750% Senior Notes and 2.950% Senior Notes. Amounts do not include the impact of potential cash flows underlying our related swap contracts (see Note 13 to the accompanying consolidated financial statements for discussion of our swap contracts);\nrepresent fixed payments due over the lease term of our noncancelable leases of real estate and operating equipment, including rent, real estate taxes, insurance, common area maintenance fees, and/or certain other costs. For lease terms that have commenced, information has been presented separately for operating and finance leases. Other lease commitments relate to executed lease agreements for which the related lease terms have not yet commenced as of March 29, 2025;\nInventory purchase commitments\nrepresent our legally-binding agreements to purchase fixed or minimum quantities of goods at determinable prices;\nMandatory transition tax payments\nrepresent our remaining tax obligation incurred in connection with the deemed repatriation of previously deferred foreign earnings pursuant to the TCJA (see Note 10 to the accompanying consolidated financial statements for discussion of the TCJA);\nReal estate purchase commitment\nrelates to our legally-binding agreement to purchase real estate located in New York City; and\nprimarily represent our legally-binding obligations related to sponsorship, licensing, and other marketing and advertising agreements; information technology-related service agreements; and pension-related obligations.\nExcluded from the above contractual obligations table is the non-current liability for unrecognized tax benefits of $193.3 million as of March 29, 2025, as we cannot make a reliable estimate of the period in which the liability will be settled, if ever. The above table also excludes the following: (i) amounts recorded in current liabilities in our consolidated balance sheet as of March 29, 2025, which will be paid within one year, other than lease obligations, mandatory transition tax payments, and accrued interest payments on debt; and (ii) non-current liabilities that have no cash outflows associated with them (e.g., deferred income), or the cash outflows associated with them are uncertain or do not represent a \"purchase obligation\" as such term is used herein (e.g., deferred taxes, derivative financial instruments, asset retirement obligations, and other miscellaneous items).\nWe also have certain contractual arrangements that would require us to make payments if certain events or circumstances occur. See Note 15 to the accompanying consolidated financial statements for a description of our contingent commitments not included in the above table.\nOff-Balance Sheet Arrangements\nIn addition to the commitments included in the above table, our other off-balance sheet firm commitments relating to our outstanding letters of credit amounted to $10.6 million as of March 29, 2025. We do not maintain any other off-balance sheet arrangements, transactions, obligations, or other relationships with unconsolidated entities that would be expected to have a material current or future effect on our consolidated financial statements.\nMARKET RISK MANAGEMENT\nAs discussed in Note 13 to the accompanying consolidated financial statements, we are exposed to a variety of levels and types of risks, including the impact of changes in currency exchange rates on foreign currency-denominated balances, certain anticipated cash flows of our international operations, and the value of reported net assets of our foreign operations, as well as changes in the fair value of our fixed-rate debt obligations relating to fluctuations in benchmark interest rates. Accordingly, in the normal course of business we assess such risks and, in accordance with our established policies and procedures, may use derivative financial instruments to manage and mitigate them. We do not use derivatives for speculative or trading purposes.\nGiven our use of derivative instruments, we are exposed to the risk that the counterparties to such contracts will fail to meet their contractual obligations. To mitigate such counterparty credit risk, it is our policy to only enter into contracts with carefully selected financial institutions based upon an evaluation of their credit ratings and certain other factors, adhering to established limits for credit exposure. Our established policies and procedures for mitigating credit risk include ongoing review and assessment of the creditworthiness of our counterparties. We also enter into master netting arrangements with counterparties, when possible, to further mitigate credit risk. As a result of the above considerations, we do not believe that we are exposed to undue concentration of counterparty risk with respect to our derivative contracts as of March 29, 2025. However, we do have in aggregate $25.9 million of derivative instruments in net asset positions held across three creditworthy financial institutions.\nForeign Currency Risk Management\nWe manage our exposure to changes in foreign currency exchange rates using forward foreign currency exchange and cross-currency swap contracts. Refer to Note 13 to the accompanying consolidated financial statements for a summary of the notional amounts and fair values of our outstanding forward foreign currency exchange and cross-currency swap contracts, as well as the impact on earnings and other comprehensive income of such instruments for the fiscal years presented.\nForward Foreign Currency Exchange Contracts\nWe use forward foreign currency exchange contracts to mitigate risk related to exchange rate fluctuations on inventory transactions made in an entity's non-functional currency, the settlement of foreign currency-denominated balances, and the translation of certain foreign operations' net assets into U.S. Dollars. As part of our overall strategy for managing the level of exposure to such exchange rate risk, relating primarily to the Euro, the Japanese Yen, the South Korean Won, the Australian Dollar, the Canadian Dollar, the British Pound Sterling, the Swiss Franc, and the Chinese Renminbi, we generally hedge a portion of our related exposures anticipated over the next twelve months using forward foreign currency exchange contracts with maturities of two months to one year to provide continuing coverage over the period of the respective exposure.\nOur foreign exchange risk management activities are governed by established policies and procedures. These policies and procedures provide a framework that allows for the management of currency exposures while ensuring the activities are conducted within our established guidelines. Our policies include guidelines for the organizational structure of our risk management function and for internal controls over foreign exchange risk management activities, including, but not limited to,\nauthorization levels, transaction limits, and credit quality controls, as well as various measurements for monitoring compliance. We monitor foreign exchange risk using different techniques, including periodic review of market values and performance of sensitivity analyses.\nCross-Currency Swap Contracts\nWe periodically designate pay-fixed rate, receive-fixed rate cross-currency swap contracts as hedges of our net investment in certain European subsidiaries. These contracts swap U.S. Dollar-denominated fixed interest rate payments based on the contract's notional amount and the fixed rate of interest payable on certain of our senior notes for Euro-denominated fixed interest rate payments, thereby economically converting a portion of our fixed-rate U.S. Dollar-denominated senior note obligations to fixed rate Euro-denominated obligations.\nSee Note 3 to the accompanying consolidated financial statements for further discussion of our foreign currency exposures and the types of derivative instruments used to hedge those exposures.\nWe perform a sensitivity analysis to determine the effects that market risk exposures may have on the fair values of our forward foreign currency exchange and cross-currency swap contracts. In doing so, we assess the risk of loss in the fair values of these contracts that would result from hypothetical changes in foreign currency exchange rates. This analysis assumes a like movement by the foreign currencies in our hedge portfolio against the U.S. Dollar. As of March 29, 2025, a 10% appreciation or depreciation of the U.S. Dollar against the foreign currencies under contract would result in a net increase or decrease, respectively, in the fair value of our derivative portfolio of approximately $121 million. This hypothetical net change in fair value should ultimately be largely offset by the net change in the related underlying hedged items.\nInterest Rate Risk Management\nAs of March 29, 2025, we had no variable-rate debt outstanding. As such, our exposure to changes in interest rates primarily relates to changes in the fair values of our fixed-rate Senior Notes. As of March 29, 2025, the aggregate fair values of our Senior Notes were $1.089 billion. A 25-basis point increase or decrease in interest rates would decrease or increase, respectively, the aggregate fair values of our Senior Notes by approximately $9 million based on certain simplifying assumptions, including an immediate across-the-board increase or decrease in the level of interest rates with no other subsequent changes for the remainder of the period. Such potential increases or decreases in the fair value of our debt would only be realized if we were to retire all or a portion of the debt prior to its maturity.\nInvestment Risk Management\nAs of March 29, 2025, we had cash and cash equivalents on-hand of $1.922 billion, consisting of deposits in interest bearing accounts, investments in money market deposit accounts, and investments in time deposits with original maturities of 90 days or less. Our other significant investments included $160.5 million of short-term investments, consisting of time deposits with original maturities greater than 90 days.\nWe actively monitor our exposure to changes in the fair value of our global investment portfolio in accordance with our established policies and procedures, which include monitoring both general and issuer-specific economic conditions, as discussed in Note 3 to the accompanying consolidated financial statements. Our investment objectives include capital preservation, maintaining adequate liquidity, diversification to minimize liquidity and credit risk, and achievement of maximum returns within the guidelines set forth in our investment policy. See Note 13 to the accompanying consolidated financial statements for further detail of the composition of our investment portfolio as of March 29, 2025.\nCRITICAL ACCOUNTING POLICIES\nAn accounting policy is considered to be critical if it is important to our results of operations, financial condition, and cash flows, and requires significant judgment and estimates on the part of management in its application. Our estimates are often based on complex judgments, assessments of probability, and assumptions that management believes to be reasonable, but that are inherently uncertain and unpredictable. It is also possible that other professionals, applying reasonable judgment to the same set of facts and circumstances, could develop and support a range of alternative estimated amounts. We believe that the\nfollowing list represents our critical accounting policies. For a discussion of all of our significant accounting policies, including our critical accounting policies, see Note 3 to the accompanying consolidated financial statements.\nSales Reserves and Uncollectible Accounts\nA significant area of judgment affecting reported revenue involves estimating sales reserves, which represent the portion of gross revenues not expected to be realized. In particular, gross revenue related to our wholesale business is reduced by estimates of returns, discounts, end-of-season markdowns, operational chargebacks, and certain cooperative advertising allowances. Gross revenue related to our retail business, including digital commerce sales, is also reduced by an estimate of returns.\nIn developing estimates of returns, discounts, end-of-season markdowns, operational chargebacks, and cooperative advertising allowances, we analyze historical trends, actual and forecasted seasonal results, current economic and market conditions, retailer performance, and, in certain cases, contractual terms. Estimates for operational chargebacks are based on actual customer notifications of order fulfillment discrepancies and historical trends. We review and refine these estimates on a quarterly basis. Our historical estimates of these amounts have not differed materially from actual results. However, unforeseen adverse future economic and market conditions, such as those resulting from widespread pandemic diseases and/or other catastrophic events, could result in our actual results differing materially from our estimates. A hypothetical 1% increase in our reserves for returns, discounts, end-of-season markdowns, operational chargebacks, and certain cooperative advertising allowances as of March 29, 2025 would have reduced our Fiscal 2025 net revenues by approximately $1 million.\nSimilarly, we evaluate our accounts receivable balances to develop expectations regarding the extent to which they will ultimately be collected. Significant judgment and estimation are involved in this evaluation, including a receivables aging analysis which shows, by aged category, the percentage of receivables that has historically gone uncollected, an analysis of specific risks on a customer-by-customer basis for larger accounts (including consideration of their financial condition and ability to withstand potential prolonged periods of adverse economic conditions), and an evaluation of current and forecasted economic and market conditions over the respective asset's contractual life. Based on this information, we record an allowance for estimated amounts that we ultimately expect not to collect due to credit. Although we believe that we have adequately provided for these risks as part of our allowance for doubtful accounts, a severe and prolonged adverse impact on our major customers' business and operations beyond those forecasted could have a corresponding material adverse effect on our net revenues, cash flows, and/or financial condition. A hypothetical 1% increase in the level of our allowance for doubtful accounts as of March 29, 2025 would have increased our Fiscal 2025 SG&A expenses by less than $1 million.\nSee \"Accounts Receivable\" in Note 3 to the accompanying consolidated financial statements for an analysis of the activity in our sales reserves and allowance for doubtful accounts for each of the three fiscal years presented.\nWe hold retail inventory that is sold in our own stores and digital commerce sites directly to consumers. We also hold inventory that is sold through wholesale distribution channels to major department stores and specialty retail stores. Substantially all of our inventories are comprised of finished goods, which are stated at the lower of cost or estimated realizable value, with cost determined on a weighted-average cost basis.\nThe estimated net realizable value of inventory is determined based on an analysis of historical sales trends of our individual product lines, the impact of market trends and economic condi",
  "item2_clean": null
}