{
  "source_file": "rmd-20250630.htm",
  "form_type": "10-K",
  "item1_clean": "HEALTHCAREfirst offers electronic health record, or EHR, software, billing and coding services, and advanced analytics that enable home health and hospice agencies to optimize their clinical, financial and administrative processes.\nMatrixCare solutions\nMatrixCare’s EHR software as a service solutions are used by skilled nursing and senior living providers, life plan communities (CCRCs), and home health and hospice organizations to improve efficiencies and promote a better quality of life for the people they serve.\nMEDIFOX DAN solutions\nMEDIFOX DAN’s software solutions are used by residential care providers in Germany, especially home health and nursing home providers, and enable providers to achieve operating efficiencies and deliver better patient care and outcomes.\nProduct Development and Clinical Trials\nWe have a strong track record of innovation in the sleep and breathing health markets. In 1989, we introduced our first CPAP device. Since then, we have been committed to an ongoing program of product advancement and development. Currently, our product development and clinical trial efforts are focused on not only improving our current product offerings and usability, but also expanding into new digital product applications.\nPART I\nRESMED INC. AND SUBSIDIARIES\nWe continually seek to identify new applications of our technology for significant unmet medical needs. Sleep apnea is associated with a number of symptoms beyond excessive daytime sleepiness, fatigue and irritability. Studies have established a clinical association between untreated sleep apnea and systemic hypertension, diabetes, coronary artery disease, stroke, atrial fibrillation, chronic heart failure, and mortality.\nAcross the sleep and breathing health platforms, we support clinical trials in many countries including the U.S., Canada, Germany, France, the United Kingdom, Switzerland, Netherlands, Spain, Portugal, Sweden, Denmark, Iceland, Argentina, Chile, China, Republic of Korea, Japan, Malaysia, Singapore, and Australia to develop new clinical applications for our technology. We also continue to support some of the largest sleep apnea studies in history by performing advanced statistical analyses on millions of real-world, de-identified, clinical data points collected through our cloud-connected devices and patient engagement tools. These studies provide clinical insights around patient management, device settings, and predictors of patient adherence that inform our product development efforts. Some of the more recent real-world studies point to a link between PAP adherence and reduced mortality among patients with OSA.\nWe consult with physicians at major medical centers throughout the world to identify clinical and technological trends in the treatment of sleep apnea, COPD, and the other conditions associated with these diseases. New product ideas are also identified by our marketing staff, direct sales force, and clinicians.\nWe currently market our products in more than 140 countries through a network of distributors and direct sales staff. We attempt to tailor our marketing approach to each major geography, often based on regional awareness of sleep apnea as a health problem, physician referral patterns, consumer preferences, and local reimbursement policies. See Note 13 – Segment Information of the Notes to Consolidated Financial Statements (Part II, Item 8) for financial information about our geographic areas.\nUnited States, Canada, and Latin America.\nOur products are typically purchased by a HME provider who then sells the products to the patient. The decision to purchase our products, as opposed to those of our competitors, is made or influenced by one or more of the following individuals or organizations: prescribing practitioners; HME providers; insurers (both private and public); and patients. In the U.S., Canada, and Latin America, our sales and marketing activities are conducted through a field sales organization made up of regional territory representatives, program development specialists and regional sales directors. Our field sales organization markets and sells products to HME provider branch locations throughout the U.S., Canada, and Latin America.\nWe also directly educate physicians and sleep clinics about our products. Patients who are diagnosed with OSA or another respiratory condition and prescribed our products are typically referred by the diagnosing physician or sleep clinic to a HME provider to fill the prescription. The HME provider, in consultation with the referring practitioner, will assist the patient in selecting the equipment, fit the patient with the appropriate mask and set the device pressure to the prescribed level.\nOur Residential Care Software solutions are sold to providers of healthcare in various residential care settings. We market and sell our Brightree business management software and service solutions to providers in the U.S. Our primary markets are HME, pharmacy, home infusion, orthotics and prosthetics. Our sales activities for Brightree products are conducted through an employee sales organization made up of strategic account managers, sales engineers and sales directors. We develop, market, and sell our MatrixCare care management and related ancillary solutions to providers in the U.S. and our primary customers are senior living; skilled nursing; life plan communities; home health, home care, and hospice agencies as well as related accountable care organizations. Our MatrixCare management solutions are primarily sold through direct sales and ancillary solutions are sold both through direct sales and channel sellers.\nCombined Europe, Asia, and other markets.\nWe market our products in most major countries in combined Europe, Asia and other geographies. We have wholly owned subsidiaries in Australia, Austria, China, Czech Republic, Denmark, Finland, France, Germany, India, Ireland, Japan, Korea, Netherlands, New Zealand, Norway, Poland, Sweden, Switzerland, Taiwan, Thailand, and the United Kingdom. We use a combination of our direct sales force and independent distributors to sell our products in combined Europe, Asia, and other regions. We select independent distributors in each country based on their knowledge of respiratory medicine and a commitment to treatment of sleep apnea with our therapy. In countries where we sell our products directly, a local senior manager is responsible for direct national sales. In many countries, we sell our products to HME providers or hospitals who then sell the products to the patients. In Germany, Australia, New\nPART I\nRESMED INC. AND SUBSIDIARIES\nZealand, and South Korea, we also operate home healthcare businesses, providing products and services directly to patients through a vertically integrated network.\nWe only sell our Residential Care Software products in the U.S. and Germany.\nWe operate a globally distributed manufacturing network designed to optimize quality, control costs, reduce time to market for new product introduction, and generate supply chain resilience. Our manufacturing operations consist of specialist component production as well as technical assembly and comprehensive testing and quality control of our devices, masks, and accessories. Of the numerous raw materials, parts and components purchased for our therapeutic and diagnostic sleep disorder products, many are available from multiple vendors. We also purchase uniquely configured components from various suppliers, including some who are single-source suppliers for us. Any reduction or halt in supply from one of these suppliers could limit our ability to manufacture our products or devices until a replacement supplier is found and qualified. We generally manufacture to our internal sales forecasts and fill orders as received. We strive for continuous improvement in manufacturing processes to deliver year-on-year improvement in quality, availability and value. Each manufacturing site and team are responsible for the quality of their product group and decisions are based on performance and quality measures, including customer feedback.\nResmed's supply chain may be impacted by periodic transport disruptions and supply constraints on certain raw materials and electronic components, including semiconductor chips and magnets. Such disruptions or constraints impact our ability to manufacture products in quantities and in the time necessary to satisfy global customer demand, which could negatively impact our results of operations.\nFurther, we source many components and materials for our products from and manufacture our products in various countries. Changes to trade policy, including tariff measures introduced in February 2025, may drive new inflation risks in our supply chain for these components and materials. On April 5, 2025, U.S. Customs and Border Protection issued a Notice of Implementation confirming that current tariff relief for products like ours continues. The current impact of global tariffs is dynamic, however. If reciprocal tariffs go into widespread effect, they could have a material impact on our business and financial statements through interruption of supply chains, increases in our costs as our suppliers deal with an uncertain global trade environment or an increase or disruption of global shipping.\nOur quality management system is based upon the requirements of ISO 13485, Food and Drug Administration, or FDA, Quality System Regulation, or QSR, being replaced by the new FDA Quality Management System Regulation, or QMSR, effective February 2, 2026, European Medical Device Regulation, or MDR, the Medical Device Directive (93/42/EEC) and other applicable regulations for the markets in which we sell. Our main manufacturing sites are certified to ISO 13485 and are audited at regular intervals by a Notified Body. Additionally, our Sydney, Tuas, San Diego, Atlanta, and Moreno Valley sites are certified under the Medical Device Single Audit Program or MDSAP, an audit of medical device manufacturers’ quality management system to satisfy multiple regulatory requirements. MDSAP audits are conducted by a MDSAP recognized auditing organization and can fulfill the needs of multiple regulatory jurisdictions (e.g., Australia, Brazil, Canada, Japan, and the U.S.). Our Sydney and Singapore manufacturing operations operate an Environmental Management System (EMS) certified to ISO 14001:2015. We are progressively extending the EMS across our manufacturing network.\nOur main manufacturing facilities for Resmed-branded products are located in Tuas, Singapore; Sydney, Australia; Chatsworth, California; Calabasas, California; Johor Bahru, Malaysia; and Atlanta, Georgia. The principal factory for our Curative-branded products is in Suzhou, China. Our Narval-branded products are manufactured in Lyon, France. Refer to Item 2 for additional details on these properties. We will continue to expand and balance volume across our network to meet scale, cost, resilience, and environmental performance objectives, and to meet the needs of customers and patients.\nThird-Party Coverage and Reimbursement\nThe cost of medical care in many of the countries in which we operate is funded in substantial part by government and private insurance programs. In Germany and Korea, we receive payments directly from these payors. While we do not generally receive direct payments for our products from payors in other countries, our success largely depends on the ability of patients to obtain coverage and our customers to obtain adequate reimbursement from those payors.\nPART I\nRESMED INC. AND SUBSIDIARIES\nIn the U.S., our products are purchased primarily by HME providers, health systems, or sleep clinics, who invoice third-party payors directly for reimbursement. Domestic third-party payors include government payors such as Medicare and Medicaid and commercial health insurance plans. These payors may deny coverage and reimbursement if they determine that specific defined coverage criteria ar",
  "item7_clean": "ITEM 7 MANAGEMENT’S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS\nManagement’s discussion and analysis of financial condition and results of operations, or the MD&A, is intended to help the reader understand our results of operations and financial condition. It is provided as a supplement to, and should be read in conjunction with, the selected financial data and consolidated financial statements and notes included in this report.\nWe are a global leader in the development, manufacturing, distribution and marketing of medical devices and cloud-based software applications that diagnose, treat and manage respiratory disorders, including sleep disordered breathing, or SDB, chronic obstructive pulmonary disease, neuromuscular disease and other chronic diseases. SDB includes obstructive sleep apnea and other respiratory disorders that occur during sleep. Our products and solutions are designed to improve patient quality of life, reduce the impact of chronic disease and lower healthcare costs as global healthcare systems continue to drive a shift in care from hospitals to the home and lower cost settings. Our digital cloud-based health software applications, along with our devices, are designed to provide connected care to improve patient outcomes and efficiencies for our customers.\nSince the development of continuous positive airway pressure therapy, we have expanded our business by developing or acquiring a number of products and solutions for a broader range of respiratory disorders including technologies to be applied in medical and consumer products, ventilation devices, diagnostic products, mask systems for use in the hospital and home, headgear and other accessories, dental devices, and cloud-based software informatics solutions to manage patient outcomes and customer and provider business processes. Our growth has been fueled by geographic expansion, our research and product development efforts, acquisitions and an increasing awareness of SDB and respiratory conditions like chronic obstructive pulmonary disease as significant health concerns.\nWe are committed to ongoing investment in research and development and product enhancements. During fiscal year 2025, we invested $331.3 million on research and development activities, which represents 6.4% of net revenues with a continued focus on the development and commercialization of new, innovative products and solutions that improve patient outcomes, create efficiencies for our customers and help physicians and providers better manage chronic disease and lower healthcare costs. For example, our newest device, AirSense 11, introduced new features such as a touch screen, algorithms for patients new to therapy, digital enhancements and over-the-air update capabilities. Our operations include residential care software platforms designed to support the professionals and caregivers who help people stay healthy in the home or care setting of their choice. These platforms comprise our Residential Care Software business and, along with our cloud-based remote monitoring and therapy management system, and a robust product pipeline, these products should continue to provide us with a strong platform for future growth.\nWe have determined that we have two operating segments, which are the sleep and respiratory disorders sector of the medical device industry, or Sleep and Breathing Health, and the supply of business management software as a service to residential healthcare providers, or Residential Care Software. During fiscal year 2025, we renamed our operating segments from Sleep and Respiratory Care to Sleep and Breathing Health and from Software as a Service to Residential Care Software in alignment with our 2030 strategy. There have been no changes in the preparation and disclosure of financial information by operating segment.\nNet revenue in fiscal year 2025 increased to $5,146.3 million, an increase of 10% compared to fiscal year 2024. Gross profit increased for the year ended June 30, 2025 to $3,055.0 million, from $2,655.3 million for the year ended June 30, 2024, an increase of $399.7 million or 15%. Our net income for the year ended June 30, 2025 was $1,400.7 million or $9.51 per diluted share compared to net income of $1,021.0 million or $6.92 per diluted share for the year ended June 30, 2024.\nTotal operating cash flow for fiscal year 2025 was $1,751.6 million and at June 30, 2025, our cash and cash equivalents totaled $1,209.5 million. At June 30, 2025, our total assets were $8.2 billion and our stockholders’ equity was $6.0 billion. We paid a quarterly dividend of $0.53 per share during fiscal 2025 with a total amount of $310.9 million paid to stockholders.\nPART II\nRESMED INC. AND SUBSIDIARIES\nManagement’s Discussion and Analysis of Financial Condition and Results of Operations\nIn order to provide a framework for assessing how our underlying businesses performed, excluding the effect of foreign currency fluctuations, we provide certain financial information on a “constant currency basis”, which is in addition to the actual financial information presented. To calculate our constant currency information, we translate the current period financial information using the foreign currency exchange rates that were in effect during the previous comparable period. However, constant currency measures should not be considered in isolation or as an alternative to United States, or U.S., dollar measures that reflect current period exchange rates, or to other financial measures calculated and presented in accordance with accounting principles generally accepted in the United States, or GAAP.\nFiscal Year Ended June 30, 2025 Compared to Fiscal Year Ended June 30, 2024\nNet revenue for the year ended June 30, 2025 increased to $5,146.3 million from $4,685.3 million for the year ended June 30, 2024, an increase of $461.0 million or 10% (a 10% increase on a constant currency basis). The following table summarizes our net revenue disaggregated by segment, product and region for the year ended June 30, 2025 compared to the year ended June 30, 2024 (in thousands):\nU.S., Canada and Latin America\nTotal U.S., Canada and Latin America\nCombined Europe, Asia and other markets\nTotal Combined Europe, Asia and other markets\nTotal Sleep and Breathing Health\nResidential Care Software\nConstant currency numbers exclude the impact of movements in international\nSleep and Breathing Health\nNet revenue from our Sleep and Breathing Health business for the year ended June 30, 2025 increased to $4,504.9 million from $4,101.2 million for the year ended June 30, 2024, an increase of $403.7 million or 10%. Movements in international currencies against the U.S. dollar positively impacted net revenues by approximately $4.0 million for the year ended June 30, 2025. Excluding the impact of currency movements, total net revenue from our Sleep and Breathing Health business for the year ended June 30, 2025 increased by 10% compared to the year ended June 30, 2024. The increase in net revenue associated with our devices and masks was primarily attributable to\nincreased demand and unit sales.\nNet revenue from our Sleep and Breathing Health business in the U.S., Canada and Latin America for the year ended June 30, 2025 increased to $2,997.5 million from $2,722.6 million for the year ended June 30, 2024, an increase of $275.0\nPART II\nRESMED INC. AND SUBSIDIARIES\nManagement’s Discussion and Analysis of Financial Condition and Results of Operations\nmillion or 10%. The increase in net revenue associated with our devices and masks was primarily attributable to\nincreased demand and unit sales\nNet revenue from our Sleep and Breathing Health business in combined Europe, Asia and other markets increased for the year ended June 30, 2025 to $1,507.4 million from $1,378.6 million for the year ended June 30, 2024, an increase of $128.8 million or 9% (a 9% increase on a constant currency basis).\nThe constant currency increase in device and mask sales in combined Europe, Asia and other\nwas primarily attributable to\nincreased demand and unit sales.\nNet revenue from devices for the year ended June 30, 2025 increased to $2,665.2 million from $2,444.0 million for the year ended June 30, 2024, an increase of $221.2 million or 9%, including an increase of 9% in the U.S., Canada and Latin America and an increase of 10% in combined Europe, Asia and other markets (a 9% increase on a constant currency basis). Excluding the impact of foreign currency movements, device sales for the year ended June 30, 2025 increased by 9%.\nNet revenue from masks and other for the year ended June 30, 2025 increased to $1,839.7 million from $1,657.2 million for the year ended June 30, 2024, an increase of 11%, including an increase of 12% in the U.S., Canada and Latin America and an increase of 9% in combined Europe, Asia and other markets (an 8% increase on a constant currency basis). Excluding the impact of foreign currency movements, masks and other sales increased by 11%, compared to the year ended June 30, 2024.\nResidential Care Software\nNet revenue from our Residential Care Software business for the year ended June 30, 2025 was $641.4 million, compared to $584.1 million for the year ended June 30, 2024, an increase of $57.3 million or 10%. The increase was driven by continued growth in the Home Medical Equipment, or HME, and MEDIFOX DAN verticals within our Residential Care Software business.\nGross Profit and Gross Margin.\nGross profit increased for the year ended June 30, 2025 to $3,055.0 million from $2,655.3 million for the year ended June 30, 2024, an increase of $399.7 million or 15%. Gross margin, which is gross profit as a percentage of net revenue, was 59.4% for the year ended June 30, 2025, compared with the 56.7% for the year ended June 30, 2024. The increase in gross margin was due primarily to procurement, manufacturing and logistics efficiencies, $14.3 million of combined expenses associated with the field safety notifications for masks with magnets and Astral devices recognized during the year ended June 30, 2024, as well as a reduction in the amortization of acquired intangibles during the year ended June 30, 2025. The masks with magnets field safety notification expenses relate to estimated\ncosts to provide alternative masks to patients in response to updated contraindications for use of masks that incorporate magnets.\nThe Astral field safety notification expenses relate to estimated costs associated with the replacement of a certain component in some of our Astral ventilation devices that were manufactured between 2013 to 2019.\nThe following table summarizes our operating expenses (in thousands):\nSelling, general, and administrative\nas a % of net revenue\nResearch and development\nas a % of net revenue\nAmortization of acquired intangible assets\nSelling, General and Administrative Expenses\nSelling, general and administrative expenses increased for the year ended June 30, 2025 to $991.0 million from $917.1 million for the year ended June 30, 2024, an increase of $73.9 million or 8%. Selling, general and administrative expenses, as reported in U.S. dollars, were favorably impacted by the movement of international currencies against the U.S. dollar, which decreased our expenses by approximately $0.2 million. Excluding the impact of foreign currency movements, selling, general and administrative expenses for the year ended June 30, 2025 increased by 8% compared to the year ended\nPART II\nRESMED INC. AND SUBSIDIARIES\nManagement’s Discussion and Analysis of Financial Condition and Results of Operations\nJune 30, 2024. As a percentage of net revenue, selling, general and administrative expenses for the year ended June 30, 2025 improved to 19.3% compared to 19.6% for the year ended June 30, 2024.\nThe constant currency increase in selling, general and administrative expenses for the year ended June 30, 2025 compared to the year ended June 30, 2024 was primarily due to increases in employee-related costs and marketing expenses.\nResearch and Development Expenses\nResearch and development expenses increased for the year ended June 30, 2025 to $331.3 million from $307.5 million for the year ended June 30, 2024, an increase of $23.8 million or 8%. Research and development expenses were favorably impacted by the movement of international currencies against the U.S. dollar, which decreased our expenses by approximately $1.3 million, as reported in U.S. dollars. Excluding the impact of foreign currency movements, research and development expenses for the year ended June 30, 2025 increased by 8% compared to the year ended June 30, 2024. As a percentage of net revenue, research and development expenses were 6.4% for the year ended June 30, 2025 compared to 6.6% for the year ended June 30, 2024.\nThe constant currency increase in research and development expenses was primarily due to increases in employee-related costs.\nAmortization of Acquired Intangible Assets\nAmortization of acquired intangible assets for the year ended June 30, 2025 was $45.3 million compared to $46.5 million for the year ended the year ended June 30, 2024. The decrease in amortization of acquired intangibles is due to certain acquired intangible assets reaching the end of their useful lives and becoming fully amortized, partially offset by increases from amortization of acquired intangibles associated with new acquisitions.\nRestructuring Expenses\nWe did not incur material restructuring expenses during the year ended June 30, 2025. During the year ended June 30, 2024, we incurred restructuring expenses of $64.2 million associated with an evaluation of our existing operations to increase operational efficiency, decrease costs and increase profitability. Restructuring charges for the year ended June 30, 2024 were comprised of $28.6 million of employee severance and other one-time termination benefits, $33.2 million of intangible asset impairments associated with the wind down of certain business activities, and $2.4 million of other miscellaneous asset impairments.\nTotal Other Income (Loss), Net\nThe following table summarizes our other income (loss) (in thousands):\nInterest income (expense), net\nGain (loss) attributable to equity method investments\nGain (loss) on equity investments\nTotal other income (loss), net\nTotal other income (loss), net for the year ended June 30, 2025 was a loss of $7.8 million, compared to a loss of $55.1 million for the year ended June 30, 2024. We recorded interest income, net, of $4.1 million for the year ended June 30, 2025 compared to interest expense, net of $45.7 million for the year ended June 30, 2024 due to lower debt levels following the repayment of our revolving credit facility and interest earned on cash balances. Losses associated with our investments in marketable and non-marketable equity securities were $10.3 million for the year ended June 30, 2025 compared to a loss of $4.0 million or the year ended June 30, 2024. Losses associated with our investments in marketable and non-marketable equity securities were partially offset by a gain attributable to equity method investments for the year ended June 30, 2025 of $3.6 million, compared to a loss of $1.8 million for the year ended June 30, 2024.\nPART II\nRESMED INC. AND SUBSIDIARIES\nManagement’s Discussion and Analysis of Financial Condition and Results of Operations\nOur effective income tax rate decreased to 16.5% for the year ended June 30, 2025 from 19.3% for the year ended June 30, 2024. Our effective rate of 16.5% for the year ended June 30, 2025 differs from the statutory rate of 21.0% primarily due to interest and penalties refunded by the IRS in relation to certain amended returns, tax benefits realized from the cessation of certain business activities, along with research credits and foreign operations. The decrease in our effective tax rate for the year ended June 30, 2025 was primarily due to the IRS refund of interest and penalties and tax benefits real",
  "item2_clean": null
}