{
  "source_file": "rok-20250630.htm",
  "form_type": "10-Q",
  "item1_clean": null,
  "item7_clean": null,
  "item2_clean": "investments in manufacturing, including new facilities or production lines, upgrades, modifications and expansions of existing facilities or production lines;\ninvestments in basic materials production capacity, which may be related to commodity pricing levels;\nour customers’ needs for faster time to market, agility to address evolving consumer preferences, operational productivity, asset management and reliability, and business resilience, including security and enterprise risk management;\nour customers’ needs to continuously improve quality, safety, and sustainability;\nindustry factors that include our customers’ new product introductions, demand for our customers’ products or services, and the regulatory and competitive environments in which our customers operate;\nlevels of global industrial production and capacity utilization;\nregional factors that include local political, social, regulatory, and economic circumstances; and\nthe spending patterns of our customers due to their annual budgeting processes and their working schedules.\nAs the world’s largest company dedicated to industrial automation and digital transformation, our strategy is to bring the Connected Enterprise\nto life. We understand and simplify our customers’ complex production challenges and deliver the most valued solutions that combine technology and industry expertise. As a result, we make our customers more resilient, agile, and sustainable, creating more ways to win. We deliver value by helping our customers optimize production, build resilience, empower people, become more sustainable, and accelerate transformation.\nRockwell Automation stands at the intersection of the technological and societal trends that are shaping the future of industrial operations. We see converging megatrends including digitization and artificial intelligence, energy transition and sustainability, shifting demographics, and an increased need for resiliency.\nOur long-term profitable growth framework outlines how we will deliver accelerated growth while we continue to transform our company to meet stakeholder expectations over the longer term:\nachieve faster secular growth in traditional markets due to customer needs for resiliency (including cybersecurity), agility, sustainability, and mitigating impacts of labor shortages;\ngrow share and create new ways to win through technology differentiation, industry focus, go to market acceleration, expanded offerings and new markets;\ncontinue double-digit growth in annual recurring revenue;\nadd 1% average annual growth from acquisitions; and\ndeliver profitable growth within a disciplined financial framework.\nU.S. Economic Trends\nIn the third quarter of 2025, sales in the U.S. accounted for over half of our total sales. The various indicators we use to gauge the direction and momentum of our served U.S. markets include:\nThe Industrial Production (IP) Index, published by the Federal Reserve, which measures the real output of manufacturing, mining, and electric and gas utilities. The Manufacturing IP Index shown in the chart below is expressed as a percentage of real output in a base year, currently 2017.\nThe Manufacturing Purchasing Managers’ Index (PMI), published by the Institute for Supply Management (ISM), which indicates the current and near-term state of manufacturing activity in the U.S. According to the ISM, a PMI measure above 50 indicates that the U.S. manufacturing economy is generally expanding while a measure below 50 indicates that it is generally contracting.\nThe table below depicts trends in these indicators since the quarter ended September 2023. These figures are as of August 6, 2025, and are subject to revision by the issuing organizations. The IP index did not significantly change from the second quarter of fiscal 2025. Manufacturing PMI results remained below 50 for each of the months in the third quarter of fiscal 2025.\nManufacturing IP Index\nPMI\nFiscal 2025 quarter ended:\nFiscal 2024 quarter ended:\nFiscal 2023 quarter ended:\nInflation in the U.S. has also had an impact on our input costs and pricing. The Producer Price Index (PPI), published by the Bureau of Labor Statistics, measures the average change over time in the selling prices received by domestic producers for their output. PPI growth has remained in the low single digits during the third quarter, which is consistent with the prior six quarters. Producer prices continue to remain elevated, however, year over year increases remain decelerated from the surges in 2023 and 2022.\nNon-U.S. Economic Trends\nIn the third quarter of 2025, sales to customers outside the U.S. accounted for less than half of our total sales. These customers include both indigenous companies and multinational companies with a global presence. In addition to the global factors previously mentioned in the\nsection, international demand, particularly in emerging markets, has historically been driven by the strength of the industrial economy in each region, investments in infrastructure, and expanding consumer markets. We use changes in key countries' gross domestic product (GDP), IP, and PMI as indicators of the growth opportunities in each region where we do business. Industrial production outside the U.S. was mostly positive in the third quarter of fiscal 2025. Manufacturing PMI readings outside the U.S were mixed with readings in Asia Pacific generally better than readings in Europe, Canada, Mexico, and Brazil.\nWe expect over $250 million of year-over-year benefits from cost reduction and margin expansion actions in 2025 including continuing benefits from restructuring actions we initiated last year and benefits from reduced costs of direct and indirect purchases, increased manufacturing efficiency, and price actions.\nWe continue to manage the impact of tariffs through actions including pricing and the use of alternative sources of materials and redundant manufacturing locations. Resiliency actions we took in recent years enable us to build certain high value product lines in more than one geographic location. In consideration of these mitigating actions, tariff costs are expected to be neutral to EPS in the current year.\nSummary of Results of Operations\nThe following table reflects our sales and operating results (in millions, except per share amounts and percentages):\n\nCash provided by operating activities\nCapital expenditures\nOur definition of free cash flow takes into consideration capital investments required to maintain the operations of our businesses and execute our strategy. Cash provided by operating activities adds back non-cash depreciation expense to earnings but does not reflect a charge for necessary capital expenditures. Our definition of free cash flow excludes the operating cash flows and capital expenditures related to our discontinued operations, if any. Operating, investing, and financing cash flows of our discontinued operations, if any, are presented separately in our Consolidated Statement of Cash Flows. In our opinion, free cash flow provides useful information to investors regarding our ability to generate cash from business operations that is available for acquisitions and other investments, service of debt principal, dividends, and share repurchases. We use free cash flow, as defined, as one measure to monitor and evaluate our performance, including as a financial measure for our annual incentive compensation. Our definition of free cash flow may be different from definitions used by other companies.\nCash provided by operating activities was $1,090 million for the nine months ended June 30, 2025, compared to $432 million for the nine months ended June 30, 2024. Free cash flow was $953 million for the nine months ended June 30, 2025, compared to $272 million for the nine months ended June 30, 2024. The year over year increases in cash provided by operating activities and free cash flow were primarily due to higher pre-tax income, no payout of incentive compensation in the first quarter of fiscal 2025 related to fiscal 2024 performance, and lower tax payments.\nOur Short-term debt as of June 30, 2025, included commercial paper borrowings of $260 million, with a weighted average interest rate of 4.51 percent, and a weighted average maturity period of 11 days. Our Short-term debt as of September 30, 2024, included commercial paper borrowings of $657 million, with a weighted average interest rate of 5.14 percent, and a weighted average maturity period of 24 days. In December 2022, Sensia entered into an unsecured $75 million line of credit. As of June 30, 2025, and September 30, 2024, included in Short-term debt was $70 million borrowed against the line of credit with an interest rate of 5.32 percent and 6.17 percent, respectively. Also included in Short-term debt as of June 30, 2025, and September 30, 2024, was $14 million and $42 million, respectively, of interest-bearing loans from Schlumberger (SLB) to Sensia. In April 2025, $14 million of new interest-bearing loans from SLB to Sensia were entered into and are due October 15, 2025. The loans outstanding as of September 30, 2024, were extended to October 15, 2026, and are included in Long-term debt as of June 30, 2025.\nIn May 2025, we entered into a $500 million senior unsecured 364-day term loan credit agreement and were advanced the full loan amount. This agreement is in addition to our existing $1.5 billion unsecured revolving credit facility expiring in June 2027, which remains outstanding and undrawn. Borrowings under this term loan bear interest based on Secured Overnight Financing Rates (SOFR) in effect during the period the borrowings are outstanding, and the interest rate as of June 30, 2025, was 5.45 percent. The term loan agreement contains covenants similar to those under our $1.5 billion unsecured revolving credit facility, under which we agree to maintain an EBITDA-to-interest ratio of at least 3.0 to 1.0. The EBITDA-to-interest ratio is defined in the term loan agreement as the ratio of"
}