{
  "source_file": "rol-20241231.htm",
  "form_type": "10-K",
  "item1_clean": "Our quarterly profitability correlates with our revenue due to seasonality, as profit is lower in the first and fourth quarters and higher in the second and third quarters.\nMaterials and Supplies\nOur Company has relationships with a vast network of national pest control product distributors, manufacturers and other suppliers for pest and termite treatment products. We maintain a sufficient level of products, materials, and other supplies to fulfill our immediate servicing needs and to mitigate any potential short-term shortage in availability from our national network of suppliers. We also have qualified comparable products and materials for key categories to have alternatives ready as needed. However, at any time supply chain disruptions that are more than short-term in nature could impact our levels of products, materials and other supplies. We proactively work with our supplier base and in 2024, we hosted a Partner Summit, with over 30 of our top suppliers in attendance at our corporate headquarters, to enhance collaboration and strategic relationships.\nWe operate in a highly competitive environment with fragmented markets and low barriers to entry. The principal factors of competition in our pest and termite control markets are quality and speed of service, customer proximity, customer satisfaction, brand awareness and reputation, terms of guarantees, safety, technical proficiency and price. Due to our strong direct partnerships with product manufacturers, distributors, and visibility into the inventories, ordering and distribution of materials and supplies, we are able to foresee potential supply disruptions and to quickly adapt. The use of an innovative and industry changing distribution model and technology enables us to maintain adequate supplies for our field operations without a significant investment in warehousing and inventory\nWe believe that, through our wholly-owned subsidiaries, we compete effectively and favorably with our competitors as one of the world’s largest pest and termite control companies. Our major competitors include Rentokil, Ecolab, Anticimex, and numerous other regional and local companies.\nResearch and Development\nOur expenditures on research activities relating to the development of new products or services are not significant. We utilize the relationships with our manufacturers and materials suppliers to provide new and innovative products and services, coupled with in-depth reviews by our tenured Entomology Department to confirm they meet our strict requirements. We also conduct evaluations of new products with the specific manufacturers of such products and we rely on research performed by leading universities.\nWe maintain close relationships with several universities for research and validation of treatment procedures and material selection. Some of the new and improved service methods and products are also researched, developed and produced by unaffiliated universities and companies with a portion of these methods and products being produced to the specifications provided by us.\nWe believe one of the largest contributors to our Company’s success is the quality of our people. Attracting, developing and retaining high-quality talent is the primary objective of our human capital management strategy. The development and retention of high-quality talent enables a better customer experience and improved customer retention. We develop and engage our people through our training at all levels of our organization.\nAs of December 31, 2024, the Company had 20,265 employees. Approximately 18,270 of our employees were located in the United States, with approximately 16,250 employees at U.S. branch offices. Of the U.S. employees, less than 2% are represented by a labor union or covered by a collective bargaining agreement.\nLeadership Development\nEach Rollins brand cultivates its own leadership development programs that support its own values and culture while considering the best practices of all Rollins brands. Our leaders are trained on the fundamentals of people leadership, business acumen, sales excellence, and technical expertise. Having the right leaders at all levels of our organization is critical to our current and future success. This includes establishing effective succession planning to support our business growth plans. While each of our brands is focused on developing operational leadership capabilities that are brand-specific, Rollins is focused on developing overall leadership capabilities through our Region Manager Development Program (RMDP). The RMDP is a comprehensive leadership development program for mid-level leaders across the organization who lead multiple business units or departments and those preparing to lead at that level. The 12-month program offers a blended learning approach that includes facilitator-led training, executive and peer mentoring, immersive field learning experiences, 360-degree assessments, a 6-month executive coaching engagement, and supported individualized development plans. Since the program was established in 2018, we have graduated a total of 112 senior leaders in six different RMDP classes with continued successes.\nWe make it a priority to promote and create an inclusive workplace that results in higher levels of satisfaction and engagement, stronger staff retention, higher productivity, and a heightened sense of belonging. Our mission is to foster a culture of inclusion, where all individuals feel respected, are treated fairly, with an opportunity to excel.\nOur Workplace Inclusion (WPI) mission to build an inclusive workplace has continued under the guidance of our Executive Sponsor and Inclusion Advisory Council which is made up of teammates from Rollins brands across the United States. In January 2022, we hired a Director of WPI. The Director’s primary role is to implement the WPI Strategic Plan (the “Plan”) which was approved by the Executive Leadership team in April of 2022. In April of 2024, we integrated responsibility for Workplace Inclusion to our Talent Management department, and in June of 2024, we hired a Senior Manager of Workplace Inclusion.\nThe Plan includes 5 Strategic Focus Areas to be implemented across all brands. The 5 Strategic Focus areas are Training & Education, Talent Acquisition & Career Development, Policies & Programs, Communication, and Employee Resource Groups (ERGs).\nOur ERGs, led by Rollins teammates, are inclusive to all and represent our employee population. Each ERG provides a platform for teammates to connect, collaborate, and advocate for their shared interests and experiences. These groups promote inclusivity, provide networking opportunities, and contribute to a sense of belonging among teammates. We have established five ERGs:\nR-Collective: Strives to improve company culture and teammate engagement and retention through multigenerational networking.\nWomen+ Resource Community: Provides a resource for women+ at any career level to achieve their goals and celebrate their accomplishments resulting in an enhanced work experience at Rollins.\nWomen's Impact Network (WIN): Increases communication between the women of Orkin by providing opportunities for professional development, mentoring, and networking.\nPRIDE: Provides a network that supports the professional development of LGBTQ+ teammates and allies, promotes recruitment and retention, and builds community.\nP.E.A.C.E.: Promoting Equality, Acceptance and Cultural Empowerment through networking, team building, and allyship to foster an inclusive and respectful environment that celebrates the diverse cultures represented within the workforce.\nWe are excited about the accomplishments on our journey to create a workplace of inclusion and will continue to execute on the strategic plan.\nWe are committed to the health and safety of our teammates, customers and communities where we work, live and play. Rollins undertakes a variety of efforts to support the health and well-being of our teammates, including their physical and mental health. This includes investing in competitive compensation and benefits while also providing the culture, tools, training and development opportunities to make working at Rollins an enjoyable and rewarding experience. Adapting to feedback provided by our teammates about the needs of themselves and their families, in 2023, we increased our investment in mental health and wellness services that are offered at no cost. Other benefits include our Employee Stock Purchase Program (ESPP), personal finance education and advisory services, assistance programs to help with managing personal and work-life challenges, family support programs, and educational assistance.\nIn 2022, we formed a partnership with Marathon Health (formerly Everside Health) to build an on-site medical clinic at our Rollins Support Center in Atlanta. That clinic provides no-cost primary care to Rollins teammates who participate in one of our medical plans in the state of Georgia. Marathon Health provides these services either virtually or through the existing nationwide network of Marathon Health clinics for all our teammates participating in one of our insurance plans in the U.S. This is an enhanced medical benefit, provided at no cost to teammates.\nWe motivate our teammates to be leaders in safety by continuously evaluating and improving our safety performance, implementing best practices, monitoring regulations and encouraging safety excellence in everything we do. We set measurable safety goals and have made improvements so that our tracking is timely and user friendly for our field leaders. In 2024, we continued our focus on improving driver safety scores. These scores are calculated using an application that monitors driving behaviors once a vehicle is in motion, detecting positive and negative driving maneuvers related to acceleration, braking, distractions, and speed. This resulted in improvement in our average driver safety score for 2024. In addition, we launched several training programs for our new teammates focused on driver safety as well as general safety onboarding.\nWe have an established safety governance structure that helps our company prioritize measures to progressively reduce motor vehicle collision and injury-related risk. We have established an ongoing process that requires commitment, communication, and collaboration at all levels of the organization. Our structure is designed to support effectiveness and alignment with our organization’s goals and objectives.\nWe review and refine our health and safety policies and procedures on an ongoing basis so that they remain efficient and relevant for our business.\nCommunity Involvement\nWe are a family of brands that has always upheld service – to our teammates, customers, and communities – as a cornerstone. While each of our diverse brands has their own culture of service, we are firmly united in our commitment to engaging with our local communities.\nWe offer teammates the opportunity to participate in various community outreach programs. Our brands work closely with their local communities to create an impact through outreach, volunteerism, and donations. Our overarching goal is to create a significant impact in local communities over an extended period of time. We believe everyone deserves a safe place to live, work, and play.\nSince 1985, we have partnered with the United Way of Greater Atlanta through employee and company-matching funds, helping make Rollins a community leader for many years. Rollins ranked #8 in the top 25 corporate contributors in both 2024 and 2023 compared to ranking #7 and #9 in 2022 and 2021, respectively. Rollins is proud to be #6 in corporate contributors to United Way’s Child Well-Being Mission Fund for 2024.\nAlong with personal contributions from teammates, the Company hosts rallies, golf tournaments, contests, and silent auctions to raise funds for the United Way of Greater Atlanta, as well as other local organizations it supports.",
  "item7_clean": "Other cost of services provided includes facilities costs, professional services, maintenance and repairs, software license costs, and other expenses directly related to providing services.\nOther sales, general and administrative includes facilities costs, professional services, maintenance and repairs, software license costs, bad debt expense, and other administrative expenses.\nThe following presents a summary of revenues by service offering:\nRevenues for the year ended December 31, 2024 were $3.4 billion, an increase of $315.4 million, or 10.3%, from 2023 revenues of $3.1 billion. The increase in revenues was driven by demand from our customers that remained strong throughout the year across all major service offerings. Comparing 2024 to 2023, organic revenue* growth was 7.9% with acquisitions adding 3.1% during the year, offset by divestitures of 0.7%. Residential pest control revenue increased approximately 9%, commercial pest control revenue increased approximately 10% and termite and ancillary services grew approximately 14% including both organic and acquisition-related growth in each area. Organic revenue* growth was strong across our service offerings, growing over 5% in residential, over 8% in commercial, and over 12% in termite and ancillary activity. The Company’s foreign operations accounted for approximately 7% of total revenues for the years ended December 31, 2024 and 2023.\n*Amounts are non-GAAP financial measures. See the schedules below for definitions and a discussion of non-GAAP financial metrics, including a reconciliation to the most directly comparable GAAP measure.\nGross Profit (exclusive of Depreciation and Amortization)\nGross profit for the twelve months ended December 31, 2024 was $1.8 billion, an increase of $182.1 million, or 11.4%, compared to $1.6 billion for the year ended December 31, 2023. Gross margin improved 50 basis points to 52.7% in 2024 compared to 52.2% in 2023, as pricing more than offset inflationary pressures. We saw 20 basis points of leverage in fleet and 10 basis points of leverage in materials and supplies, while employee expenses and insurance and claims were flat as a percentage of revenue.\nSales, General and Administrative\nFor the twelve months ended December 31, 2024, sales, general and administrative (SG&A) expenses increased $99.8 million, or 10.9%, compared to the twelve months ended December 31, 2023. The increase is driven by expenses associated with growth initiatives aimed at capitalizing on the health of our underlying markets.\nAs a percentage of revenue, SG&A increased 20 basis points to 30.0% in 2024 versus 29.8% in 2023. Selling and marketing costs have increased 40 basis points as we continue to invest in growth initiatives. This was partially offset by 20 basis points of leverage associated with lower administrative costs.\nFor the twelve months ended December 31, 2024, restructuring costs decreased by $5.2 million. During the twelve months ended December 31, 2023, we executed a restructuring program to modernize our workforce. No such costs were incurred during the twelve months ended December 31, 2024.\nDepreciation and Amortization\nFor the twelve months ended December 31, 2024, depreciation and amortization increased $13.5 million, or 13.5%, compared to the twelve months ended December 31, 2023. The increase was primarily due to higher amortization of intangible assets from acquisitions, most notably from a full year of acquisition costs of FPC Holdings, LLC (\"Fox Pest Control\", or \"Fox\").\nFor the twelve months ended December 31, 2024, operating income increased $74.0 million or 12.7% compared to the prior year. As a percentage of revenue, operating income increased to 19.4% from 19.0% in the prior year. The improvement in operating income as a percentage of revenue is primarily driven by the improvement in gross profit discussed previously.\nInterest Expense, Net\nDuring the twelve months ended December 31, 2024, interest expense, net increased $8.6 million compared to the prior year, due to the increase in the average debt balance associated primarily with the share repurchase completed in the third quarter of 2023 and the acquisition of Fox in the second quarter of 2023. This was partially offset by a lower average effective interest rate in 2024 compared to 2023.\nDuring the twelve months ended December 31, 2024, other income, net decreased $21.4 million primarily due to the Company recognizing a $15.5 million gain on the sale of certain businesses during 2023, with no such gain on sale during 2024, and lower gains on sales of non-operational assets.\nThe Company’s effective tax rate was 26.0% in 2024 compared to 25.8% in 2023. The 2024 rate was negatively impacted by higher state income taxes and foreign income taxes compared to 2023.\nOur team delivered a strong finish to the 2024 fiscal year, exceeding our own revenue expectations and delivering healthy earnings growth for the full year. As we look to 2025, demand for our services is solid and our pipeline for acquisitions is robust. We invested meaningfully in our business throughout 2024, which helped accelerate the organic revenue growth* rate in the third and fourth quarter of the year. We are capitalizing on this momentum as we start 2025, while remaining focused on continuous improvement initiatives to enhance profitability across our business.\nWe saw strong full year growth in revenue, cash flow and earnings in 2024. We delivered double-digit revenue and operating cash flow growth, as well as a 40 basis point improvement in operating margins. Growth investments and pressure from developments on legacy auto claims that materialized in December of 2024 impacted our incremental adjusted EBITDA margin* for the year. Additionally, we continued to execute a balanced capital allocation program enabled by compounding operating cash flow and a strong balance sheet.\n*Amounts are non-GAAP financial measures. See the schedules below for definitions and a discussion of non-GAAP financial metrics, including a reconciliation to the most directly comparable GAAP measure.\nFor 2025, the Company anticipates:\nThe underlying health of core pest control markets, as well as Rollins’ ongoing commitment to operational execution, should support another year of strong organic revenue growth*, further complemented by a strategic and disciplined approach to acquisitions. We continue to target 7-8 percent organic revenue growth* and a contribution of 2-3 percent from acquisitions.\nA focus on pricing, ongoing modernization efforts, and a culture of continuous improvement should support healthy incremental adjusted EBITDA margins*. While we expect incremental margins to be healthy, we do expect a more challenging first half of 2025 relative to the first half of 2024.\nCompounding operating cash flow and strong balance sheet should continue to enable a balanced capital allocation strategy.\n*Amounts are non-GAAP financial measures. See the schedules below for definitions and a discussion of non-GAAP financial metrics, including a reconciliation to the most directly comparable GAAP measure.\nNon-GAAP Financial Measures\nReconciliation of GAAP and non-GAAP Financial Measures\nA non-GAAP financial measure is a numerical measure of financial performance, financial position, or cash flows that either 1) excludes amounts, or is subject to adjustments that have the effect of excluding amounts, that are included in the most directly comparable measure calculated and presented in accordance with GAAP in the statement of operations, balance sheet or statement of cash flows, or 2) includes amounts, or is subject to adjustments that have the effect of including amounts, that are excluded from the most directly comparable measure so calculated and presented.\nThese measures should not be considered in isolation or as a substitute for revenues, net income, earnings per share or other performance measures prepared in accordance with GAAP. Management believes all of these non-GAAP financial measures are useful to provide investors with information about current trends in, and period-over-period comparisons of, the Company's results of operations. An analysis of any non-GAAP financial measure should be used in conjunction with results presented in accordance with GAAP.\nOrganic revenues are calculated as revenues less the revenues from acquisitions completed within the prior 12 months and excluding the revenues from divested businesses. Acquisition revenues are based on the trailing 12-month revenue of our acquired entities. Management uses organic revenues, and organic revenues by type to compare revenues over various periods excluding the impact of acquisitions and divestitures.\nAdjusted operating income and adjusted operating margin\nAdjusted operating income and adjusted operating margin are calculated by adding back to net income those expenses resulting from the amortization of certain intangible assets, adjustments to the fair value of contingent consideration resulting from the acquisition of Fox, and restructuring costs related to restructuring and workforce reduction plans. Adjusted operating margin is calculated as adjusted operating income divided by revenues. Management uses adjusted operating income and adjusted operating margin as measures of operating performance because these measures allow the Company to compare performance consistently over various periods.\nAdjusted net income and adjusted EPS\nAdjusted net income and adjusted EPS are calculated by adding back to the GAAP measures amortization of certain intangible assets, adjustments to the fair value of contingent consideration resulting from the acquisition of Fox Pest Control, and restructuring costs related to restructuring and workforce reduction plans, and excluding gains and losses on the sale of non-operational assets and gains on the sale of businesses, and by further subtracting the tax impact of those expenses, gains, or losses. Management uses adjusted net income and adjusted EPS as measures of operating performance because these measures allow the Company to compare performance consistently over various periods.\nEBITDA, EBITDA margin, adjusted EBITDA, adjusted EBITDA margin, incremental EBITDA margin and adjusted incremental EBITDA margin\nEBITDA is calculated by adding back to net income depreciation and amortization, interest expense, net, and provision for income taxes. EBITDA margin is calculated as EBITDA divided by revenues. Adjusted EBITDA and adjusted EBITDA margin are calculated by further adding back those expenses resulting from the adjustments to the fair value of contingent consideration resulting from the acquisition of Fox, restructuring costs related to restructuring and workforce reduction plans, and excluding gains and losses on the sale of non-operational assets and gains on the sale of businesses. Management uses EBITDA, EBITDA margin, adjusted EBITDA and adjusted EBITDA margin as measures of operating performance because these measures allow the Company to compare performance consistently over various periods. Incremental EBITDA margin is calculated as the change in EBITDA divided by the change in revenue. Management uses incremental EBITDA margin as a measure of operating performance because this measure allows the Company to compare performance consistently over various periods. Adjusted incremental EBITDA margin is calculated as the change in adjusted EBITDA divided by the change in revenue. Management uses adjusted incremental EBITDA margin as a measure of operating performance because this measure allows the Company to compare performance consistently over various periods.\nFree cash flow and free cash flow conversion\nFree cash flow is calculated by subtracting capital expenditures from cash provided by operating activities. Management uses free cash flow to demonstrate the Company’s ability to maintain its asset base and generate future cash flows from operations. Free cash flow conversion is calculated as free cash flow divided by net income. Management uses free cash flow conversion to demonstrate how much net income is converted into cash. Management believes that free cash flow is an important financial measure for use in evaluating the Company’s liquidity. Free cash flow should be considered in addition to, rather than as a substitute for, net cash provided by operating activities as a measure of our liquidity. Additionally, the Company’s definition of free cash flow is limited, in that it does not represent residual cash flows available for discretionary expenditures, due to the fact that the measure does not deduct the payments required for debt service and other contractual obligations or payments made for business acquisitions. Therefore, management believes it is important to view free cash flow as a measure that provides supplemental information to our consolidated statements of cash flows.\nAdjusted sales, general and administrative (\"SG&A\")\nAdjusted SG&A is calculated by removing the adjustments to the fair value of contingent consideration resulting from the acquisition of Fox. Management uses adjusted SG&A to compare SG&A expenses consistently over various periods.\nLeverage ratio, a financial valuation measure, is calculated by dividing adjusted net debt by adjusted EBITDAR. Adjusted net debt is calculated by adding operating lease liabilities to total long-term debt less a cash adjustment of 90% of total consolidated cash. Adjusted EBITDAR is calculated by adding back to net income depreciation and amortization, interest expense, net, provision for income taxes, operating lease cost, and stock-based compensation expense. Management uses leverage ratio as an assessment of overall liquidity, financial flexibility, and leverage.\nTwelve Months Ended December 31,\nReconciliation of Revenues to Organic Revenues\n\nNet cash used in investing activities\nNet cash used in financing activities\nEffect of exchange rate on cash\nN/M\nNet (decrease) increase in cash and cash equivalents\nN/M\nN/M - calculation not meaningful\nCash Provided by Operating Activities\nCash from operating activities is the principal source of cash generation for our businesses. The most significant source of cash in our cash flow from operations is customer-related activities, the largest of which is collecting cash resulting from services sold. The most significant operating use of cash is to pay our suppliers, employees, and tax authorities. The Company’s operating activities generated net cash of $607.7 million and $528.4 million for the twelve months ended December 31, 2024 and 2023, respectively. The $79.3 million increase was driven primarily by strong operating results and the timing of cash receipts and cash payments to vendors, employees, and tax and regulatory authorities.\nThe US Internal Revenue Service provided disaster relief to all State of Georgia taxpayers due to the impact of Hurricane Helene. Therefore, we did not make an estimated payment for US federal income tax purposes in the fourth quarter of 2024. That estimated tax payment of approximately $32.0 million is now due in the second quarter of 2025.\nCash Used in Investing Activities\nThe Company’s investing activities used $176.2 million and $372.9 million for the twelve months ended December 31, 2024 and 2023, respectively. Cash paid for acquisitions totaled $157.5 million for the twelve months ended December 31, 2024, as compared to $366.9 million for the twelve months ended December 31, 2023, driven primarily by the acquisition of Fox in 2023. During 2024, the Company invested $27.6 million in capital expenditures, offset by $4.1 million in cash proceeds from the sale of assets, compared with $32.5 million of capital expenditures, $12.5 million in cash proceeds from asset sales, and $15.9 million in cash proceeds from the sale of businesses during 2023. The Company’s investing activities were funded through existing cash balances, operating cash flows, and borrowings under th",
  "item2_clean": null
}