{
  "source_file": "rol-20250930.htm",
  "form_type": "10-Q",
  "item1_clean": null,
  "item7_clean": null,
  "item2_clean": "ITEM 2. MANAGEMENT’S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS\nGENERAL OPERATING COMMENTS\nBelow is a summary of the key operating results for the three months ended September 30, 2025:\nThird quarter revenues were $1.0 billion, an increase of 12.0% over the third quarter of 2024 with organic revenues* increasing 7.2%.\nQuarterly operating income was $225.0 million, an increase of 17.3% over the third quarter of 2024. Quarterly operating margin was 21.9%, an increase of 100 basis points versus the third quarter of 2024. Adjusted operating income* was $232.1 million, an increase of 18.4% over the prior year. Adjusted operating margin* was 22.6%, an increase of 120 basis points compared to the prior year.\nAdjusted EBITDA* was $258.3 million, an increase of 17.7% over the prior year. Adjusted EBITDA margin* was 25.2%, an increase of 120 basis points versus the third quarter of 2024.\nQuarterly net income was $163.5 million, an increase of 19.4% over the prior year. Adjusted net income* was $168.5 million, an increase of 20.7% over the prior year.\nQuarterly EPS was $0.34 per diluted share, a 21.4% increase over the prior year EPS of $0.28. Adjusted EPS* was $0.35 per diluted share, an increase of 20.7% over the prior year.\nOperating cash flow was $191.3 million for the quarter, an increase of 30.2% compared to the prior year. The Company invested $34.7 million in acquisitions, $8.5 million in capital expenditures, and paid dividends totaling $80.1 million.\nDemand remains favorable to start the fourth quarter and the pipeline of acquisition activity remains healthy. Although we continue to navigate a highly uncertain macroeconomic environment, we believe we are well positioned to continue to deliver strong results in 2025.\nWe remain focused on driving 7% to 8% organic revenue growth while adding 3% to 4% of inorganic revenue growth for 2025. We continue to focus on improving the efficiency of our business model while investing in programs aimed at growing our business across our service offerings.\n*Amounts are non-GAAP financial measures. See the schedules below for a discussion of non-GAAP financial metrics including a reconciliation to the most directly comparable GAAP measure.\nRECENT DEVELOPMENTS AND ECONOMIC CONDITIONS\nThe continued disruption in economic markets due to inflation, changing interest rates, business interruptions due to natural disasters and changes in weather patterns, employee shortages, and supply chain issues all pose challenges which may adversely affect our future performance. The Company continues to execute various strategies previously implemented to help mitigate the impact of these economic disruptors. However, the Company cannot reasonably estimate whether these strategies will help mitigate the impact of these economic disruptors in the future.\nAdditionally, the Company continues to monitor ongoing changes to global trade policies, including the imposition of tariffs. The broader economic impact of these policies is uncertain, and while we may experience changes in fleet-related expenses and materials and supplies, we do not expect to be materially affected.\nThe Company’s condensed consolidated financial statements reflect estimates and assumptions made by management that affect the reported amounts of assets and liabilities and related disclosures as of the date of the condensed consolidated financial statements. The Company considered the impact of economic trends on the assumptions and estimates used in preparing the condensed consolidated financial statements. In the opinion of management, all material adjustments necessary for a fair presentation of the Company’s financial results for the quarter have been made. These adjustments are of a normal recurring nature but are complicated by the continued uncertainty surrounding these economic trends. The\nROLLINS, INC. AND SUBSIDIARIES\nseverity, magnitude and duration of certain economic trends continue to be uncertain and are difficult to predict. Therefore, our accounting estimates and assumptions may change over time in response to economic trends and may change materially in future periods.\nThe extent to which these economic trends will continue to impact the Company’s business, financial condition and results of operations is uncertain. Therefore, we cannot reasonably estimate the full future impacts of these matters at this time.\nRESULTS OF OPERATIONS\nQuarter ended September 30, 2025 compared to quarter ended September 30, 2024\nThree Months Ended September 30,\n(in thousands, except per share data)\n\nN/M\nN/M - calculation not meaningful\nCash Provided by Operating Activities\nCash from operating activities is the principal source of cash generation for our businesses. The most significant source of cash in our cash flow from operations is customer-related activities, the largest of which is collecting cash resulting from services sold. The most significant operating use of cash is to pay our suppliers, employees, and tax authorities. The Company’s operating activities generated net cash of $513.4 million and $419.5 million for the nine months ended September 30, 2025 and 2024, respectively. The $93.9 million increase was driven primarily by strong operating results and the timing of cash receipts and cash payments to and from customers, vendors, employees, and tax and regulatory authorities.\nThe U.S. Internal Revenue Service provided disaster relief to all State of Georgia taxpayers due to the impact of Hurricane Helene. Therefore, we did not make an estimated payment for U.S. federal income tax purposes in the fourth quarter of 2024. That tax payment was made during the second quarter of 2025. We have implemented tax planning strategies that have deferred certain additional tax payments.\nCash Used in Investing Activities\nThe Company’s investing activities used $302.8 million and $123.6 million for the nine months ended September 30, 2025 and 2024, respectively. Cash paid for acquisitions totaled $288.3 million for the nine months ended September 30, 2025, compared to $105.5 million for the nine months ended September 30, 2024, driven primarily by the Saela acquisition. The Company invested $22.4 million in capital expenditures during the year, offset by $5.9 million in cash proceeds from the sale of assets, compared with $23.4 million of capital expenditures and $3.0 million in cash proceeds from asset sales in 2024. The Company’s investing activities were funded primarily through existing cash balances, operating cash flows, and proceeds from borrowings, including our commercial paper program.\nCash Used in Financing Activities\nCash of $175.1 million was used in financing activities during the nine months ended September 30, 2025, compared with $305.5 million during the nine months ended September 30, 2024. A total of $239.5 million was paid in cash dividends ($0.495 per share) during the nine months ended September 30, 2025, compared to $218.0 million in cash dividends paid ($0.450 per share) during the nine months ended September 30, 2024.\nDuring the nine months ended September 30, 2025, the Company received proceeds of $492.2 million and paid $6.1 million of debt issuance costs related to the issuance of the 2035 Senior Notes. Those proceeds were used primarily to repay borrowings under the credit agreement. Net proceeds from borrowings during the nine months ended September 30, 2025 were $95.2 million, compared to net repayments of $46.0 million during 2024.\nDuring the nine months ended September 30, 2025, the Company paid $7.8 million of contingent consideration, compared to $33.4 million during the nine months ended September 30, 2024. The Company withheld $18.6 million and $11.5 million of common stock for the nine months ended September 30, 2025 and 2024, respectively, in connection with tax withholding obligations of its employees upon vesting of such employees’ equity awards.\nROLLINS, INC. AND SUBSIDIARIES\nShare Repurchase Program\nIn 2012, the Company’s Board of Directors authorized the purchase of up to 5 million shares of the Company’s common stock. After adjustments for stock splits, the total authorized shares under the share repurchase plan is 16.9 million shares. As of September 30, 2025, 11.4 million additional shares may be purchased under the share repurchase program.\nActive Shelf Registration\nCONTINGENCIES\nIn the normal course of business, the Company and its subsidiaries are involved in, and will continue to be involved in, various claims, arbitrations, contractual disputes, investigations, litigation, and tax and other regulatory matters relating to, and arising out of, our businesses and our operations. These matters may involve, but are not limited to, allegations that our services or vehicles caused damage or injury, claims that our services did not achieve the desired results, claims related to acquisitions and allegations by federal, state or local authorities, including taxing authorities, of violations of regulations or statutes. In addition, we are parties to employment-related investigations, cases, and claims from time to time, which may include claims on a representative or class action basis alleging wage and hour law violations, claims filed under California's Private Attorneys General Act, and claims and investigations related to our enforcement of post-employment restrictive covenants. We are also involved from time to time in certain environmental matters primarily arising in the normal course of business. We evaluate pending and threatened claims and establish loss contingency reserves based upon outcomes we currently believe to be probable and reasonably estimable in accordance with ASC 450.\nThe Company retains, up to specified limits, certain risks related to general liability, workers’ compensation and auto liability. The estimated costs of existing and future claims under the retained loss program are accrued based upon historical trends as incidents occur, wheth"
}