{
  "source_file": "rost-20250802.htm",
  "form_type": "10-Q",
  "item1_clean": null,
  "item7_clean": null,
  "item2_clean": "in the Notes to Condensed Consolidated Financial Statements\nfor additional information.\nAs of August 2, 2025, we had approximately $1.5 billion of outstanding unsecured Senior Notes, of which $499 million was classified in Current Liabilities on our Condensed Consolidated Balance Sheet for the period ended August 2, 2025. Refer to Note E: Debt in the Notes to Condensed Consolidated Financial Statements for additional information.\nOther financing activities.\nIn March 2024, our Board of Directors approved a two-year program to repurchase up to $2.1 billion of our common stock through\n. During the six month period ended August 2, 2025, we repurchased 3.9 million shares of common stock for $525 million (excluding excise tax) under this program. As of August 2, 2025, there was $525 million available for repurchase under this program.\nDuring the six month periods ended August 2, 2025 and August 3, 2024, we also acquired 0.5 million shares of treasury stock in each period to cover employee tax withholding obligations under our employee equity compensation programs, for aggregate purchase prices of approximately $64 million and $72 million, respectively.\nOn August 20, 2025, our Board of Directors declared a quarterly cash dividend of $0.4050 per common share, payable on September 30, 2025. The Board of Directors declared a quarterly cash dividend of $0.4050 per common share in March and May 2025, and $0.3675 per common share in March, May, August, and November 2024.\nFor the six month periods ended August 2, 2025 and August 3, 2024, we paid cash dividends of $265.6 million and $245.8 million, respectively.\nShort-term trade credit represents a significant source of financing for merchandise inventory. Trade credit arises from customary payment terms and trade practices with our vendors. We regularly review the adequacy of credit available to us from all sources, and expect to be able to maintain adequate trade credit, bank credit, and other credit sources to meet our capital and liquidity requirements.\nWe ended the second quarter of fiscal 2025 with $3.8 billion of unrestricted cash balances, which were held primarily in overnight money market funds invested in U.S. treasury and government instruments across a highly diversified set of banks and other financial institutions. We also have $1.3 billion available under our new 2025 Credit Facility. We estimate that existing cash and cash equivalent balances, cash flows from operations, our bank credit facility, and trade credit are adequate to meet our operating cash needs and to fund our common stock repurchases, planned capital investments, quarterly dividend payments, debt repayments, and interest payments, for at least the next 12 months.\nContractual Obligations and Off-Balance Sheet Arrangements\nStandby letters of credit and collateral trust.\nWe use standby letters of credit outside of our revolving credit facility and a funded trust to collateralize some of our insurance obligations. As of August 2, 2025, February 1, 2025, and August 3, 2024, we had $1.0 million, $1.8 million, and $2.2 million, respectively, in standby letters of credit outstanding. As of August 2, 2025, February 1, 2025, and August 3, 2024, we had $65.3 million, $63.9 million, and $62.4 million, respectively, held in a collateral trust. The standby letters of credit are collateralized by restricted cash and the collateral trust consists of restricted cash and cash equivalents.\nCritical Accounting Estimates\nForward-Looking Statements\nThis report contains a number of forward-looking statements regarding, without limitation, projected sales, costs and earnings, planned new store growth, capital expenditures, liquidity, and other matters. These forward-looking statements reflect our then-current beliefs, plans, and estimates with respect to future events and our projected financial performance, operations, and competitive position. The words “plan,” “expect,” “target,” “anticipate,” “estimate,” “believe,” “forecast,” “projected,” “guidance,” “outlook,” “looking ahead,” and similar expressions identify forward-looking statements.\nFuture impact from tariffs, inflation, interest rate changes, ongoing military conflicts and economic sanctions, climate change, extreme weather, pandemics, natural disasters, and other economic, regulatory, consumer spending, and industry trends that could potentially adversely affect our revenue, profitability, operating conditions, and growth are difficult to predict. Our forward-looking statements are subject to risks and uncertainties which could cause our actual results to differ materially from those forward-looking statements and our previous expectations, plans, and projections. Such risks and uncertainties are not limited to but may include:\nChanges in U.S. tax, tariff, or trade policy regarding apparel, shoes, and home-related merchandise produced in China and other countries could significantly and adversely affect our business. While we directly import only a small portion of our merchandise, more than half of the goods we sell originate from China. Elevated tariff levels on goods imported into the United States from China and other countries may disrupt our merchandise purchasing patterns, increase our costs, and put pressure on our margins and profitability.\nUncertainties arising from the macroeconomic environment, including inflation and the price of necessities, high interest rates, housing costs, energy and fuel costs, financial and credit market conditions, recession concerns, geopolitical conditions, government policies and enforcement practices with respect to immigration, and public health and public safety issues may affect consumer confidence, consumer disposable income, and shopping behavior, as well as our costs.\nUnexpected changes in the level of consumer spending on, or preferences for, apparel and home-related merchandise could adversely affect us.\nCompetitive pressures in the apparel and home-related merchandise retailing industry.\nOur need to effectively manage our inventories, markdowns, and inventory shortage in order to achieve our planned gross margins.\nRisks associated with importing and selling merchandise produced in China and other countries, including risks from supply chain disruption, shipping delays, and higher than expected ocean freight costs.\nUnseasonable weather or extreme temperatures that may affect shopping patterns and consumer demand for seasonal apparel and other merchandise.\nOur dependence on the market availability, quantity, and quality of attractive brand name merchandise at desirable discounts, and on the ability of our buyers to anticipate consumer preferences and to purchase merchandise to enable us to offer customers a wide assortment of merchandise at competitive prices.\nInformation or data security breaches, including cyber-attacks on our transaction processing and computer information systems, which could disrupt our operations, and result in theft or unauthorized disclosure of confidential and valuable business information, such as customer, credit card, employee, or other private and valuable information that we handle in the ordinary course of our business.\nDisruptions in our supply chain or in our information systems, including from ransomware or other cyber-attacks could impact our ability to process sales and to deliver product to our stores in a timely and cost-effective manner.\nOur need to obtain acceptable new store sites with favorable consumer demographics to achieve our planned store openings.\nOur need to expand in existing markets and enter new geographic markets in order to achieve planned growth and market penetration.\nConsumer problems or legal issues involving the quality, safety, or authenticity of products we sell could harm our reputation, result in lost sales, and/or increase our costs.\nAn adverse outcome in various legal, regulatory, or tax matters, or the adoption of new federal or state tax legislation that increases tax rates or adds new taxes could increase our costs.\nDamage to our corporate reputation or brands could adversely affect our sales and operating results.\nOur need to continually attract, train, and retain associates with the retail talent necessary to execute our off-price retail strategies.\nOur need to effectively advertise and market our business.\nPossible volatility in our revenues and earnings.\nA public health or public safety crisis, or a natural or man-made disaster in California or another region where we have a concentration of stores, offices, or a distribution center could harm our business.\nOur need to maintain sufficient liquidity to support our continuing operations and our new store openings.\nThe factors underlying our forecasts are dynamic and subject to change. As a result, any forecasts or forward-looking statements speak only as of the date they are given and do not necessarily reflect our outlook at any other point in time. We disclaim any obligation to update or revise these forward-looking statements.\n\nITEM 2. MANAGEMENT’S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF\nOPERATIONS\nRoss Stores, Inc. operates two brands of off-price retail apparel and home fashion stores—Ross Dress for Less\n(“Ross”) and dd’s DISCOUNTS\n. Ross is the largest off-price apparel and home fashion chain in the United States, with 1,873 locations in 44 states, the District of Columbia, Guam, and Puerto Rico as of August 2, 2025. Ross offers first-quality, in-season, name brand and designer apparel, accessories, footwear, and home fashions for the entire family at savings of 20% to 60% off department and specialty store regular prices every day. We also operate 360 dd’s DISCOUNTS stores in 22 states as of August 2, 2025 that feature a more moderately-priced assortment of first-quality, in-season, name brand apparel, accessories, footwear, and home fashions for the entire family at savings of 20% to 70% off moderate department and discount store regular prices every day.\n"
}