{
  "source_file": "rtx-20250930.htm",
  "form_type": "10-Q",
  "item1_clean": null,
  "item7_clean": null,
  "item2_clean": "Item 2. Management’s Discussion and Analysis of Financial Condition and Results of Operations\nBUSINESS OVERVIEW\nWe are a global premier systems provider of high technology products and services to the aerospace and defense industries.\nUnless the context otherwise requires, the terms “we,” “our,” “us,” “the Company,” and “RTX” mean RTX Corporation and its subsidiaries. References to “Raytheon Company” mean Raytheon Company, which became a wholly owned subsidiary of RTX on April 3, 2020 during an all-stock merger transaction between United Technologies Corporation and Raytheon Company (the surviving company of which is RTX Corporation).\nIndustry Considerations\nOur worldwide operations can be affected by industrial, economic, and political factors on both a regional and global level. Our operations include original equipment manufacturer (OEM) and extensive related aftermarket parts and services related to our aerospace operations. Our defense business serves both domestic and international customers primarily as a prime contractor or subcontractor on a broad portfolio of defense and related programs for government customers. Our business mix also reflects the combination of shorter cycles in our commercial aerospace spares contracts and certain service contracts in our defense business, and longer cycles in our aerospace OEM and aftermarket maintenance contracts and on our defense contracts to design, develop, manufacture, or modify complex equipment. Our customers are in the public and private sectors, and our businesses reflect an extensive geographic diversification that has evolved with continued globalization.\nGovernment legislation, policies, and regulations can impact our business and operations. Changes in environmental and climate change-related laws or regulations, including regulations on greenhouse gas emissions, carbon pricing, and energy taxes, could lead to new or additional investment in product designs and facility upgrades and could increase our operational and environmental compliance expenditures, including increased energy and raw materials costs and costs associated with manufacturing changes. In addition, government and industry-driven safety and performance regulations, restrictions on aircraft engine noise and emissions, government imposed travel restrictions, and government procurement practices can impact our businesses.\nCollins and Pratt & Whitney serve both commercial and government aerospace customers. Revenue passenger miles (RPMs), available seat miles, and the general economic health of airline carriers and airframers, as well as the financial strength and performance of airframers, are key barometers for our commercial aerospace operations. Performance in the general aviation sector is closely tied to the overall health of the economy and is positively correlated to corporate profits. Many of our aerospace customers are covered under long-term aftermarket service agreements at both Collins and Pratt & Whitney, which are inclusive of both spare parts and services.\nOur defense operations are affected by U.S. Department of Defense (DoD) budget and spending levels, changes in demand, changes in policy positions or priorities, the domestic and global political and economic environment, and the evolving nature of the global and national security threat environment. In addition, our defense businesses engage in both direct commercial sales, which generally require U.S. government licenses and approvals, as well as foreign military sales, which are government-to-government transactions initiated by, and carried out at the direction of, the U.S. government. Changes in these budget and spending levels, policies, or priorities, which are subject to U.S. domestic and foreign geopolitical risks and threats, may impact our defense businesses, including the timing of and delays in U.S. government licenses and approvals for sales, the risk of sanctions, or other restrictions.\nGlobal, economic, and political conditions, changes in raw material and commodity prices and supply, labor availability and costs, inflation, interest rates, potential changes in U.S. government policy positions, including changes in DoD policies or priorities, geopolitical conflicts and strained intercountry relations, U.S. and non-U.S. tax law changes, foreign currency exchange rates, sanctions, tariffs, energy costs and supply, levels of air travel, the financial condition of commercial airlines, and the impact from natural disasters and weather conditions create uncertainties that could impact our businesses.\nAs previously announced, in 2024 the Company resolved several outstanding legal matters, herein referred to as “Resolution of Certain Legal Matters.” The Company entered into a deferred prosecution agreement (DPA) (DPA-1) with\n\nBased on current conditions, we do not believe that the tariffs announced by the U.S. or counter tariffs or other actions taken by other countries will have a material adverse effect upon our results of operations, financial condition, or cash flows. However, the actual financial impacts of tariffs are dependent upon various factors, most notably, the scope of goods covered by tariffs, the value of our imports subject to tariffs, the rate of tariffs applied, the timing and duration of tariffs, the enforceability of tariffs and counter-tariffs, the implementation of tariff and non-tariff countermeasures by countries subject to U.S. tariffs, and our and our suppliers’ ability to mitigate the impacts of tariffs. Changes in any of these factors and actual tariff costs incurred could significantly affect the estimates inherent in our financial statements, including those used in our estimates-at-completion (EACs), and estimates supporting the recoverability of our inventories, contract fulfillment costs, deferred tax assets, intangible assets and goodwill, and could have a material effect on our results of operations and cash flows in the periods recognized and paid.\nU.S. Government’s Budget & Tax Legislation.\nOn September 30, 2025, the continuing resolution (CR) allowing U.S. government Departments and Agencies to operate through the end of the government fiscal year expired and the U.S. government shut down. As a result of the U.S. government shutdown, our business, program performance and results of operations may be impacted by the disruptions to federal government offices, workers, and operations, including risks relating to the funding of certain programs, stop work orders, delay in contract awards, new program starts, payments for work performed, and other actions. We may also experience similar impacts in the event of a series of short-term continuing resolutions rather than full-year fiscal year 2026 appropriations. Generally, the significance of these impacts will primarily be based on the length of the shutdown and timing of passage of a new CR or a full budget.\nOn July 4, 2025, “An Act to Provide for Reconciliation Pursuant to Title II of the H. Con. Res. 14” (the Act) was enacted. The Act provides for several corporate tax changes including, but not limited to, restoring full expensing of domestic research and development costs, restoring immediate deductibility of certain capital expenditures, and changes in the computations of U.S. taxation on international earnings.\nThe Act also provides a supplementary $156.2 billion to the DoD for obligations through 2029, which includes $24.4 billion for the Iron Dome for America project. The project, outlined in a January 27, 2025 Executive Order, calls for the development and deployment of a next-generation missile defense shield. On May 20, 2025, the DoD announced a draft architecture and implementation plan for the system. With next generation technologies across land, sea and space that build upon existing, proven defense capabilities, RTX’s portfolio is well-positioned to play a role to deliver reliable solutions for the Iron Dome for America initiative. Whether this Executive Order or corresponding funding will have a material impact on our business or results of operations will depend on a variety of factors, including award timelines, mission priorities, and future budget determinations. The Act also includes $25.4 billion in funding to enhance DoD resources for munitions and supply chain resiliency. As a leading munitions manufacturer, RTX is strategically situated to play a key role in supporting this initiative.\nExecutive Order Regarding Modernizing Defense Acquisitions.\nOn April 9, 2025, the U.S. government issued an executive order requiring, among other things, a DoD review of its Major Defense Acquisition Programs to identify those that are 15% behind schedule, 15% over budget, unable to meet key performance parameters, or unaligned with the Secretary of Defense’s mission priorities for potential cancellation. Although RTX does not, at this time, believe the Executive Order will have a material impact on our business or results of operations, the longer-term ramifications, if any, to RTX will depend on a variety of factors including the formulation and implementation of the review criteria in the order, the review timeline, the Secretary of Defense’s mission priorities, and future budget determinations based on the results of such review.\nGeopolitical Matters.\nIn response to Russia’s invasion of Ukraine, the U.S. government and the governments of various jurisdictions in which we operate, have imposed broad economic sanctions and export controls targeting specific industries, entities, and individuals in Russia. The Russian government has implemented similar counter-sanctions and export controls targeting specific industries, entities, and individuals in the U.S. and other jurisdictions in which we operate, including certain members of the Company’s management team and Board of Directors. These government measures, among other limitations, restrict transactions involving various Russian banks and financial institutions and imp"
}