{
  "source_file": "revv-20250928.htm",
  "form_type": "10-Q",
  "item1_clean": null,
  "item7_clean": null,
  "item2_clean": "Management’s Discussion and Analysis of Financial Condition and Results of Operations\nWe are a leading provider of health science solutions, technologies, expertise and services that deliver complete workflows from discovery to development, and diagnosis to cure. Revvity is revolutionizing what’s possible in healthcare, with specialized focus areas in translational multi-omics technologies, biomarker identification, imaging, prediction, screening, detection and diagnosis, informatics and more.\nThe principal products and services of our two reportable segments are:\n. Provides products and services targeted towards life sciences customers.\n. Develops diagnostics, tools and applications focused on clinically-oriented customers, especially within the areas of reproductive health and emerging market diagnostics.\nEffective at the beginning of fiscal year 2025, we implemented changes to our operating model. The majority of our Applied Genomics business, previously reported as part of the Diagnostics segment, has been integrated into a newly formed Life Sciences Solutions business, encompassing all Life Sciences reagents and consumables, instruments and services, as well as technology and licensing, which is reported as part of the Life Sciences segment. Beginning in fiscal year 2025, the Life Sciences segment consists of Life Sciences Solutions and Software, while the Diagnostics segment consists of Immunodiagnostics and Reproductive Health.\nOverview of the Third Quarter of Fiscal Year 2025\nOur overall revenue in the third quarter of fiscal year 2025 was $698.9 million which increased by $14.9 million, or 2%, as compared to the third quarter of fiscal year 2024, reflecting an increase of $10.9 million, or 3%, in our Diagnostics segment revenue, and an increase of $4.0 million, or 1%, in our Life Sciences segment revenue. The increase in our Diagnostics segment revenue for the third quarter of fiscal year 2025 was driven primarily by our Reproductive Health business. The increase in our Life Sciences segment revenue for the third quarter of fiscal year 2025 was driven by increased revenue in our Software business.\nOur consolidated gross margins decreased 266 basis points in the third quarter of fiscal year 2025, as compared to the third quarter of fiscal year 2024, primarily due to increased tariffs, unfavorable changes in foreign exchange rates, and product mix shift. Our consolidated operating margins decreased 263 basis points in the third quarter of fiscal year 2025, as compared to the third quarter of fiscal year 2024\n, due to gross margin headwinds as discussed above.\nCritical Accounting Policies and Estimates\nThe preparation of condensed consolidated financial statements requires us to make estimates and judgments that affect the reported amounts of assets, liabilities, revenue and expenses and related disclosure of contingent assets and liabilities. On an ongoing basis, we evaluate our estimates, including those related to accounting for business combinations, divestitures, long-lived assets, including goodwill and other intangible assets, and employee compensation and benefits. We base our estimates on historical experience and on various other assumptions that we believe to be reasonable under the circumstances, the results of which form the basis for making judgments about the carrying values of assets and liabilities that are not readily apparent from other sources. Actual results may differ from these estimates under different assumptions or conditions.\nCritical accounting policies are those policies that affect our more significant judgments and estimates used in the preparation of our condensed consolidated financial statements. We believe our critical accounting policies include policies\nregarding business combinations, divestitures, valuation of long-lived assets, including goodwill and other intangibles and employee compensation and benefits.\nFor a more detailed discussion of our critical accounting policies and estimates, refer to the Notes to our audited consolidated financial statements and Item 7.\n“Management’s Discussion and Analysis of Financial Condition and Results of Operations,”\nConsolidated Results of Continuing Operations\nRevenue for the three months ended September 28, 2025 was $698.9 million, as compared to $684.0 million for the three months ended September 29, 2024, an increase of $14.9 million, or approximately\nwhich includes an approximate 1% increase in revenue attributable to favorable changes in foreign exchange rates.\nThe analysis in the remainder of this paragraph comp\nares segment revenue and includes the effect of foreign exchange rate fluctuations. Life Sciences segment revenue was $342.8 million for the three months ended September 28, 2025, as compared to $338.8 million for the three months ended September 29, 2024, an increase of $4.0 million, or 1%, driven by an increase of $8.9 million in Software revenue and a decrease of $4.9 million in Life Sciences Solutions revenue. Diagnostics segment revenue was $356.1 million for the three months ended September 28, 2025, as compared to $345.2 million for the three months ended September 29, 2024, an increase of $10.9 million, or 3%, due to an increase of $9.7 million\nin Reproductive Health revenu\ne and an increase of $1.2 million\nin Immunodiagnostics revenue\nRevenue for the nine months ended September 28, 2025 was $2,084.0 million, as compared to $2,025.7 million for the nine months ended September 29, 2024, an increase of $58.3 million, or approximately\nThe analysis in the remainder of this paragraph comp\nares segment revenue and includes the effect of foreign exchange rate fluctuations. Life Sciences segment revenue was $1,049.1 million for the nine months ended September 28, 2025, as compared to $1,023.8 million for the nine months ended September 29, 2024, an increase of $25.3 million, or 2%, driven by an increase of $35.1 million in Software revenue, partially offset by a decrease of $9.8 million in Life Sciences Solutions revenue. Diagnostics segment revenue was $1,034.9 million for the nine months ended September 28, 2025, as compared to $1,001.8 million for the nine months ended September 29, 2024, an increase of $33.1 million, or 3%, due to an increase of $15.6 million\nin Immunodiagnostics revenue and\nan increase of $17.4 million\nin Reproductive Health revenu\nCost of revenue for the three months ended September 28, 2025 was $324.3 million, as compared to $299.2 million for the three months ended September 29, 2024, an increase of $25.1 million, or\n. As a percentage of revenue, cost of revenue increased to 46.4% for the three months ended September 28, 2025, from 43.7% for the three months ended September 29, 2024, resulting in a decrease in gross margin of 266 basis points to 53.6% for the three months ended September 28, 2025, from 56.3% for the three months ended September 29, 2024, primarily due to increased tariffs, unfavorable changes in foreign exchange rates, and product mix shift. Stock compensation expense related to awards given to BioLegend employees post-acquisition added an incremental expense of $0.2 million for the three months ended September 29, 2024. Rebranding costs were $0.1 million for the three months ended September 29, 2024. Amortization of intangible assets was $35.3 million for the three months ended September 28, 2025, as compared to $36.4 million for the three months ended September 29, 2024.\nCost of revenue for the nine months ended September 28, 2025 was $941.3 million, as compared to $900.3 million for the nine months ended September 29, 2024, an increase of $41.0 million, or\n. As a percentage of revenue, cost of revenue increased to 45.2% for the nine months ended September 28, 2025, from 44.4% for the nine months ended September 29, 2024, resulting in a decrease in gross margin of 72 basis points to 54.8% for the nine months ended September 28, 2025, from 55.6% for the nine months ended September 29, 2024, primarily due to increased tariffs, unfavorable changes in foreign exchange rates and product mix shift partially offset by the completion of product rebranding efforts in 2024. Stock compensation expense related to awards given to BioLegend employees post-acquisition added an incremental expense of $0.6 million for the nine months ended September 29, 2024. Rebranding costs were $6.2 million for the nine months ended September 29, 2024. Amortization of intangible assets was $106.2 million for the nine months ended September 28, 2025, as compared to $109.1 million for the nine months ended September 29, 2024.\nWe now estimate that pursuant to the tariffs recently enacted and currently in effect, our cost of revenue for the current fiscal year could increase by approximately $25 million. However, we anticipate that as the result of the mitigating actions that we have taken and plan to take, the tariffs would result in a decrease to our gross margin for the current fiscal year of approximately $20 million. The majority of this impact affects products manufactured in Europe for the U.S. market. We are\nimplementing a comprehensive mitigation strategy that includes manufacturing optimization, supplier collaboration, selective pricing actions, and targeted temporary cost measures to minimize financial exposure.\nSelling, General and Administrative Expenses\nSelling, general and administrative expenses for the three months ended September 28, 2025 were $241.9 million, as compared to $237.5 million for the three months ended September 29, 2024, an increase of $4.4 million, or 2%. As a percentage of revenue, selling, general and administrative expen\nses decreased and were 34.6% for the three months ended September 28, 2025, as compared to 34.7% for the three months ended September 29, 2024. Restructuring and other costs, net, increased, and was $9.9 million for the three months ended September 28, 2025, as compared to decreasing expenses by $0.1 million for the three months ended September 29, 20"
}