{
  "source_file": "revv-20241229.htm",
  "form_type": "10-K",
  "item1_clean": "We are a leading provider of health science solutions, technologies, expertise and services that deliver complete workflows from discovery to development, and diagnosis to cure. Revvity is revolutionizing what’s possible in healthcare, with specialized focus areas in translational multi-omics technologies, biomarker identification, imaging, prediction, screening, detection and diagnosis, informatics and more.\nOur headquarters are in Waltham, Massachusetts, and we market our products and services in more than 160 countries. As of December 29, 2024, we employed approximately 11,000 employees. Our common stock is listed on the New York Stock Exchange under the symbol “RVTY” and we are a component of the S&P 500 Index.\nWe maintain a website with the address\nhttp://www.revvity.com\nOur strategy is to develop and deliver innovative products, services and solutions in high-growth markets that utilize our knowledge and expertise to address customers’ critical needs and drive scientific breakthroughs. To execute on our strategy and accelerate revenue growth, we focus on broadening our offerings through both the investment in research and development and the acquisition of innovative technology. Our strategy includes:\nStrengthening our position within key markets by expanding our global product and service offerings, maintaining superior product quality and driving an enhanced customer experience;\nAttracting, retaining and developing talented and engaged employees;\nAccelerating transformational innovation through both internal research and development and third-party collaborations and alliances;\nAugmenting growth in both of our core business segments, Life Sciences and Diagnostics, through strategic acquisitions and licensing;\nEngraining focused operational excellence to improve organizational efficiency and agility; and\nOpportunistically utilizing our share repurchase programs to help drive shareholder value.\nBusiness Segments and Products\nWe report our business in two segments: Life Sciences and Diagnostics.\nLife Sciences Segment\nOur comprehensive portfolio of technologies helps life sciences researchers better understand diseases and develop treatments. We provide a broad suite of products, solutions and services that facilitate optimized workflows, increase productivity, and accelerate every stage of the drug discovery and development pipeline. Our offerings span the areas of cell, gene, and protein research, enabling scientists to work smarter, make research breakthroughs, and transform those breakthroughs into real-world outcomes. We partner with global pharmaceutical, biotech and contract research organizations, as well as academic and government institutions, to enable them to discover and develop better treatments and therapeutics to fight disease faster and more efficiently.\nOur principal products and services for Life Sciences applications include the following:\nRadiometric detection solutions, including over 750 radiochemicals and instrumentation such as the Tri-Carb\nGCT families of liquid scintillation analyzers, Wizard\n2TM\nGamma counters and MicroBeta\n2TM\nplate based LSA are used for beta, gamma and luminescence counting in microplate and vial formats utilized in research, environmental and drug discovery applications.\nReagents and solutions for microscopy and imaging applications. These include PhenoVue\ncellular imaging reagents and cell painting kits, PhenoPlate (formerly CellCarrier Ultra™) cellular imaging microplates and GrowDex\nTM\nhydrogels, fluorophore-conjugated and enzyme-conjugated antibodies, as well as buffers and solutions, such as our Ce3D™ collection of buffers for 3D tissue imaging.\nA wide range of homogeneous biochemical and cell-based reagents using HTRF®, LANCE® Ultra™, DELFIA®, AlphaLISA®, AlphaLISA® SureFire® Ultra™, AlphaScreen®, AlphaPlex® and luminescence assay technologies that can be paired with our microplates, which cover a variety of applications.\nNew assay kits for Adeno-associated Virus Vectors (AAVs) and gene therapy applications in our range of HTRF\nreagents, for detecting and quantifying CHO HCP impurities in biotherapeutics development, as well as kits across oncology, neuroscience, and targeted protein degradation applications.\nA broad portfolio of recombinant GPCR and ion channel cell lines, including over 300 products and 120 ready-to-use frozen cell lines for a wide range of disease areas.\nreagents and gene modulation technologies such as RNAi that support drug discovery and development for greater understanding of gene function, identifying genetic drivers behind human disease, developing and validating diagnostic workflows, and helping deliver biotherapeutics, cellular and gene therapies for precision medicine with a portfolio of cell engineering tools.\nELISA MAX™ Standard Sets, ELISA MAX™ Deluxe Sets, LEGEND MAX™ ELISA Kits, and RAPID MAX™ ELISA Kits as well as complementary solutions and buffers for immunoassays to cover more than 200 targets for human, mouse, and rat samples, many of which are designed to assess the immune environment and its inflammatory state for vaccine, infectious disease and autoimmune disease research.\nLEGENDplex™ bead-based reagents, which, in contrast to single analyte assays such as enzyme-linked immunosorbent assays (“ELISAs”), can quantitate up to 14 targets from one small sample volume and read on common flow cytometers, and include both desktop and cloud-based analysis software.\nbest-in-class antibodies, recombinant proteins, and related reagents are used across multiple applications and research areas, including proteogenomics, tissue, cell and protein analysis, cancer research, immunology, cell and gene therapy, stem cell therapy and neuroscience.\nFluorophore-conjugated antibodies are used in flow cytometers to characterize protein expression on the surface and in internal compartments of cells. The large collection of dyes and antibodies allows for an increasing number of conjugate options, facilitating the use of bigger and better flow cytometry panels using conventional and spectral flow cytometers. Notable products are Brilliant Violet™ and the Spark and Fire\nTM\ndye series, among others.\nTotalSeq™ reagents are oligonucleotide-barcoded antibodies that enable protein detection to be combined with traditional RNA or DNA sequencing experiments with high-parameter protein detection. Data can be analyzed with their complimentary and comprehensive cloud-based Multiomics Analysis Software.\nCell culture and biofunctional assay reagents, including bioactive recombinant proteins, as well as other specialized reagents such as Cell-Vive™ T-NK Xeno-Free Serum Substitute (compliant with Good Manufacturing Practice requirements (“GMP”)), and other GMP-produced recombinant proteins and reagents. These products serve several markets, notably cell and gene therapy applications.\n’s MojoSort™ for cell separation that complements our fluorophore-antibody conjugates, used for FACS (Fluorescence-activated Cell Sorting), thus covering most cell separation and cell sorting technologies and applications.\nBioLegend’s catalog of more than 33,000 SKUs, incorporating antibodies and a large collection of antibody conjugates and modifications as well as recombinant proteins, immunoassays, and other supportive reagents and solutions for cell and molecular analysis.\nFlex-T™ reagents that utilize peptide-loaded major histocompatibility molecules assembled into tetramers for the identification of antigen-specific T cells. Our Flex-T products can be used to screen the efficacy of antigen peptides for vaccine and drug trials, as well as characterize the dominance of cancer-specific self-peptides, and more recently, SARS-CoV-2 peptides for COVID-19 research.\nAntibodies and solutions for Western blotting, as well as supporting buffers and substrates, provide a convenient set of tools to characterize protein size and relative expression levels in cell or tissue lysates.\nTM\nreference standards are cell line-derived to mimic patient samples and suitable for next generation sequencing, droplet-digital and real-time PCR as well as Sanger sequencing. The platform is agnostic for seamless integration into quality control workflows.\nOptiScint™ NPE-free scintillation cocktails and quench standards, providing a more environmentally friendly alternative without compromising performance.\nExpansion of our Western blotting reagents with the addition of the Western Lightning™ One range, which has a pre-mixed one component chemiluminescent HRP substrate for more consistent results.\nAdditional Spark and Fire\nTM\ndye-conjugated antibodies, enabling higher-parameter flow cytometry. Notable products are the Spark PLUS UV395™ and Spark PLUS B550™ conjugates.\nreagent portfolio, more large panels of pre-titrated oligo-conjugated antibodies released in universal panels for the analysis of human and mouse samples. New options were created for intracellular target staining and protein-only analysis.\nNew fluorescent stains, reagents and secondary antibodies in our PhenoVue\nTM\ncellular imaging reagents portfolio for the detection and analysis of cellular components.\nGoInVivo™ as well as Ultra-LEAF™ and LEAF™ functional antibodies provide an affordable solution for researchers performing in vivo and ex vivo studies.\nPlus high-content screening system for sensitive and high-speed phenotypic drug screening of complex cellular models.\nCLS™ high-content analysis system enables scientists to reveal fine sub-cellular details from everyday assays as well as more complex studies, for example using live cells, 3D and stem cells.\nTM\nmultimode plate reader benchtop system designed for assay development and academic labs, including those using HTRF® and AlphaLISA® assay technologies.\nTM\nmultimode plate reader designed for high-throughput screening laboratories, including those using HTRF®, AlphaScreen® and AlphaLISA® assay technologies.\nTM\nmultimode plate reader, our next generation system for high-throughput screening with advanced detection technologies for Alpha, TRF, and Luminescence.\nIn vivo optical imaging platforms and reagents for preclinical research, comprised of the IVIS\nSpectrum™ series for 2D and 3D optical imaging and optionally integrated low-dose CT imaging and the IVIS\nLumina™ series for benchtop 2D imaging, along with IVISbrite\nbioluminescent and IVISense\nfluorescent imaging agents and imaging reagents.\nTM\nGX3 system, which enables low-dose in vivo CT imaging of multiple species and areas of anatomical interest across multiple disease areas by way of high-resolution, tomographic imaging.\nThe Vega™ ultrasound system, a hands-free automated ultrasound platform delivers high-resolution 2D and 3D imaging in just a few minutes. This innovative in vivo ultrasound system removes the challenges associated with conventional hand-held systems through the use of automated transducers located under the imaging stage and is easy to use, requires minimal training and produces more consistent results. It is complemented by GoInVivo™ as well as Ultra-LEAF™ and LEAF™ functional antibodies providing an affordable solution for researchers performing in vivo and ex vivo studies.\nThe high-throughput, microwell Celigo\nimage cytometry system, the Cellaca\nMX high-throughput cell counter, the Cellaca\nPLX image cytometry system, and the Cellometer\nautomated cell counters, complemented by consumables and reagents, including reagents and kits for cell counting assays and cell viability, microplates, slides, and counting beads.\nPLX™ image cytometry system combines best-in-class image cytometer hardware, software, validated consumables and optimized reagent kits with validated antibodies from our BioLegend business, and trackable data reporting to enable the simultaneous detection of multiple markers and to streamline cell and gene therapy workflows.\nThe Signals Image Artist™ next-generation image analysis and management platform for drug discovery research, to help scientists pro",
  "item7_clean": "Fiscal Year 2024 Compared to Fiscal Year 2023\nRevenue for fiscal year 2024 was $1,500.9 million, as compared to $1,458.2 million for fiscal year 2023, an increase of $42.7 million, or 3%, which includes an approximate 1% decrease in revenue attributable to unfavorable changes in foreign exchange rates. T\nin our Diagnostics segment revenue during fiscal year 2024 was due to\nan increase of $43.7 million in immunodiagnostics revenue and an increase of $22.6 million in reproductive health revenue, partially offset by a decrease of $23.7 million in applied genomics revenue.\nSegment operating income for fiscal year 2024 was $372.4 million, as compared to $320.1 million for fiscal year 2023, an increase of $52.3 million, or 16%. Segment operating margin increased 286 basis points in fiscal year 2024, as compared to fiscal year 2023, primarily due\nolume, productivity initiatives, and cost containment.\nFiscal Year 2023 Compared to Fiscal Year 2022\nFor a discussion of our results of operations for fiscal year 2023 as compared to fiscal year 2022, see Item 7, Management\nDiscontinued Operations\nOn March 13, 2023, we completed the sale (the “Closing”) of certain assets and the equity interests of certain entities constituting our Applied, Food and Enterprise Services businesses (the “Business”) to PerkinElmer Topco, L.P. (formerly known as Polaris Purchaser, L.P.) (the “Purchaser”), a Delaware limited partnership owned by funds managed by affiliates of New Mountain Capital L.L.C. (the “Sponsor”), for an aggregate purchase price of up to\n. We received approximately\nin cash proceeds before transaction costs. At the Closing, we were entitled to an additional\nin proceeds payable in installments to commence upon our ceasing the use of the PerkinElmer brand and related trademarks and transferring them to the Purchaser (the “Brand Fee”).\nThe discounted value of the $75.0 million\nwas measured as $65.2 million and was included in the proceeds at Closing. During the fiscal year 2024, we received $18.8 million of the Brand Fee. We expect to receive the remaining balance of the Brand Fee i\n2025. In addition, we are entitled to additional consideration of up to\n\nOverview of Fiscal Year 2024\nDuring fiscal year 2024, we again delivered differentiated financial performance despite market headwinds, demonstrating the strength of our product portfolio and innovation. Our overall revenue in fiscal year 2024 increased by $4.5 million, or less than 1%, as compared to fiscal year 2023, reflecting an increase of $42.7 million, or 3%, in Diagnostics segment revenue and a decrease of $38.2 million, or 3%, in Life Sciences segment revenue. The increase in Diagnostics segment revenue was primarily driven by increased demand in our immunodiagnostics and reproductive health businesses, partially offset by a decrease in revenue from our applied genomics business. The decrease in Life Sciences segment revenue was driven by a decrease in instruments and reagents revenue due to pharmaceutical and biotechnology market headwinds, partially offset by an increase in software revenue from the timing of contract renewals and new orders.\nOur consolidated gross margin decreased 16 basis points in fiscal year 2024, as compared to fiscal year 2023, primarily due to an unfavorable shift in product mix and higher product costs, partially offset by pricing actions and productivity initiatives. Our consolidated operating margin increased 166 basis points in fiscal year 2024, as compared to fiscal year 2023, due to productivity initiatives and cost containment.\nOverall, we believe that our range of product offerings, leading market positions, global scale and financial strength provides us with a foundation for continued long-term growth, margin expansion and robust cash flow generation.\nConsolidated Results of Operations\n\nFiscal Year 2024 Compared to Fiscal Year 2023\nRevenue for fiscal year 2024 was $2,755.0 million, as compared to $2,750.6 million for fiscal year 2023, an increase of $4.5 million, or less than 1%.\nanalysis in the remainder of this paragraph compares segment revenue for fiscal year 2024 as compared to fiscal year 2023 and includes the effect of foreign exchange rate fluctuations. Life Sciences segment revenue was $1,254.1 million for fiscal year 2024, as compared to $1,292.3 million for fiscal year 2023, a decrease of $38.2 million, or 3%, driven by a decrease of $47.2 million in instruments revenue and a decrease of $13.5 million in reagents revenue, partially offset by an increase of $22.5 million in software revenue. Diagnostics segment revenue for fiscal year 2024 was $1,500.9 million, as compared to $1,458.2 million for fiscal year 2023, an increase of $42.7 million, or 3%, due to an increase of $43.7 million in immunodiagnostics revenue and an increase of $22.6 million in reproductive health revenue, partially offset by a decrease of $23.7 million in applied genomics revenue.\nAs a result of adjustments to deferred revenue related to certain acquisitions required by business combination accounting rules, we did not recognize $0.8 million of revenue for each of the\nfiscal years 2024 and 2023\nthat otherwise would have been recorded by the acquired businesses during each of the respective periods.\nCost of revenue for fiscal year 2024 was $1,217.4 million, as compared to $1,210.9 million for fiscal year 2023, an increase of approximately $6.5 million, or 1%. As a percentage of revenue, cost of revenue increased to 44.2% in fiscal year 2024 from 44.0% in fiscal year 2023, resulting in a decrease in gross margin of approximately 16 basis points to 55.8% in fiscal year 2024 from 56.0% in fiscal year 2023 due to an unfavorable shift in product mix and higher product costs, partially offset by pricing actions and productivity initiatives. Rebranding costs were $6.2 million for fiscal year 2024. Stock compensation expense related to awards given to BioLegend employees post-acquisition added an incremental expense of $0.6 million for fiscal year 2024, as compared to $2.8 million for fiscal year 2023. Amortization of intangible assets was $144.4 million for fiscal year 2024, as compared to $147.6 million for fiscal year 2023.\nSelling, General and Administrative Expenses\nSelling, general and administrative expenses for fiscal year 2024 were $994.1 million, as compared to $1,022.6 million for fiscal year 2023, a decrease of $28.5 million, or 3%. As a percentage of revenue, selling, general and administrative expenses decreased to 36.1% in fiscal year 2024 from 37.2% in fiscal year 2023. Amortization of intangible assets decreased and was $215.0 million for fiscal year 2024, as compared to $217.5 million for fiscal year 2023. Restructuring and other costs, net, decreased and were $17.5 million for fiscal year 2024, as compared to $26.6 million for fiscal year 2023. Acquisition and divestiture-related expenses, which primarily consisted of legal and integration costs, and stock compensation expense related to the awards given to BioLegend employees post-acquisition, added an incremental expense of $16.3 million for fiscal year 2024, as compared to $62.0 million for fiscal year 2023. Purchase accounting adjustments decreased expenses by $1.7 million for fiscal year 2024, which primarily consisted of a change in fair value of contingent consideration, as compared to increasing expenses by $4.3 million for fiscal year 2023. Costs for significant environmental matters also added an incremental expense of $2.5 million for fiscal year 2023. The above decreases were partially offset by an increase in asset impairments, which added an incremental expense of $22.8 million for fiscal year 2024. Significant litigation matters and settlements added an incremental expense of $7.8 million for fiscal year 2024 and were minimal for fiscal year 2023. Excluding the factors above, the net decrease in selling, general and administrative expenses was the result of productivity initiatives and cost containment.\nResearch and Development Expenses\nResearch and development expenses for fiscal year 2024 were $196.8 million, as compared to $216.6 million for fiscal year 2023, a decrease of $19.7 million, or 9%. As a percentage of revenue, research and development expenses decreased to 7.1% in fiscal year 2024 from 7.9% in fiscal year 2023. The decrease in research and development expenses was primarily driven by productivity initiatives and cost containment, as well as a decrease in stock compensation expense related to awards given to BioLegend employees post-acquisition, which added an incremental expense of $2.2 million in fiscal year 2024, as compared to $4.3 million for fiscal year 2023.\nInterest and Other Expense, Net\nInterest and other expense, net, consisted of the following for the fiscal years ended:\n\nOther Potential Liquidity Considerations\nAt December 29, 2024, we had cash and cash equivalents of $1,163.4 million, of which $562.6 million was held by our non-U.S. subsidiaries, and we had $1.5 billion of borrowing capacity available under our senior unsecured revolving credit facility.\nWe use a variety of cash redeployment and financing strategies to ensure that our worldwide cash is available in the locations in which it is neede\nd. We recorded the applicable taxes associated with the future remittance of undistributed foreign earnings previously taxed at the U.S. federal level and/or that would be claimed for a dividend received deduction if repatriated.\nIn connection with the sale of the Business, we expect to receive the remaining balance related to the Brand Fee of $56.3 million as of December 29, 2024, in installments through fiscal year 2025.\nOn April 27, 2023, our Board authorized us to repurchase shares of common stock for an aggregate amount up to $600.0 million under a stock repurchase program (the “Repurchase Program”). On October 24, 2024, the Repurchase Program was terminated by our Board and our Board authorized us to repurchase shares of common stock for an aggregate amount up to $1.0 billion under a new stock repurchase program (the “New Repurchase Program”). No shares remain available for repurchase under the Repurchase Program due to its termination. The New Repurchase Program will expire on October 23, 2026, unless terminated earlier by our Board and may be suspended or discontinued at any time. During fiscal year 2024, we repurchased 1,820,296 shares of common stock under the Repurchase Program for an aggregate cost of $213.6 million. During fiscal year 2024, we repurchased 1,238,755 shares of common stock under the New Repurchase Program for an aggregate cost of $142.8 million. As of December 29, 2024, $857.2 million remained available for aggregate repurchases of shares under the New Repurchase Program.\nIf we continue to repurchase shares, the New Repurchase Program will be funded using our existing financial resources, including cash and cash\nequivalents, and our existing senior unsecured revolving credit facility.\nAs of December 29, 2024, we may have to pay contingent consideration, related to acquisitions with open contingency periods, of up to $75.9 million. As of December 29, 2024, we have recorded contingent consideration obligations of $21.8 million, of which $4.3 million was recorded in accrued expenses and other current liabilities, and $17.4 million was recorded in long-term liabilities. The maximum earnout period for acquisitions with open contingency periods is 6.9 years from December 29, 2024, and the remaining weighted average expected earnout period at December 29, 2024 was 4.3 years.\nWe and our subsidiaries may from time to time, in our sole discretion, purchase, repay, redeem or retire any of our outstanding debt securities (including any publicly issued debt securities), in privately negotiated or open market transactions, by tender offer or otherwise, or extend or refinance any of our outstanding indebtedness.\nPrincipal factors that could affect the availability of our internally generated funds include:\nchanges in sales due to weakness in markets in which we sell our products and services, and\nchanges in our working capital requirements and capital expenditures.\nPrincipal factors that could affect our ability to obtain cash from external sources include:\nfinancial covenants contained in the financial instruments controlling our borrowings that limit our total borrowing capacity,\nincreases in interest rates applicable to our outstanding variable rate debt,\na ratings downgrade that could limit the amount we can borrow under our senior unsecured revolving credit facility and our overall access to the corporate debt market,\nincreases in interest rates or credit spreads, as well as limitations on the availability of credit, that affect our ability to borrow under future potential facilities on a secured or unsecured basis,\na decrease in the market price for our common stock, and\nvolatility in the public debt and equity markets.\nEffects of Recently Issued and Adopted Accounting Pronouncements\nNature of Operations and Accounting Policies,\nin the Notes to Consolidated Financial Statements for a summary of recently issued accounting pronouncements. We adopted\nAccounting Standards Update 2023-07,\nSegment Reporting (Topic 280): Improvements to Reportable Segment Disclosures\n(“ASU 2023-07”)\nduring fiscal year 2024 and\nhave included the additional disclosures related to the reportable segments in Note 21,\nIndustry Segment and Geographic Area Information,\nin the Notes to Consolidated Financial Statements\nWe are in the process of determining the impact of the recently issued accounting pronouncements that have not yet been adopted in our consolidated financial statements.\nCritical Accounting Policies and Estimates\nThe preparation of consolidated financial statements requires us to make estimates and judgments that affect the reported amounts of assets, liabilities, revenue and expenses, and related disclosure of contingent assets and liabilities. We base our estimates on historical experience and on various other assumptions that we believe to be reasonable under the circumstances, the results of which form the basis for making judgments about the carrying values of assets and liabilities that are not readily apparent from other sources. Actual results may differ from these estimates under different assumptions or conditions.\nWe believe the following critical accounting policies affect our more significant judgments and estimates used in preparation of our consolidated financial statements.\nAs part of our continuing efforts to focus on higher growth opportunities, we have disposed of or sold certain businesses. In accounting for such transactions, we apply the applicable accounting guidance under U.S. GAAP pertaining to discontinued operations and disposals of components of an entity. When the discontinued operations represented a strategic shift that will have a major effect on our operations and financial statements, we accounted for these businesses as discontinued operations. We recognize divestiture-related costs that are not part of divestiture consideration as general and administrative expense as they are incurred. These costs typically include transaction and disposal costs, such as legal, accounting, and other professional fees.\nThe accounting for divestiture requires estimates and judgment as to the determination of the gain or loss on sale and the fair value of the different elements of consideration received. We received cash proceeds of\nand we are entitled to two elements of additional consideration that become payable upon the resolution of certain events. First, we are entitled to proceeds of $75.0 million as consideration for our ceasing the use of the PerkinElmer brand and related trademarks and transferring them to the Purchaser (“Brand Sale”). During the fiscal year 2024, we received $18.8 million of the Brand Fee. The remaining consideration is expected to be received in installments through fiscal year 2025. We a",
  "item2_clean": null
}