{
  "source_file": "sbac-20250930x10q.htm",
  "form_type": "10-Q",
  "item1_clean": null,
  "item7_clean": null,
  "item2_clean": "ITEM 2.\nMANAGEMENT’S\nDISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS\nWe are a leading independent owner and operator of wireless communications infrastructure, including tower structures, rooftops, and other structures that support antennas used for wireless communications, which we collectively refer to as “towers” or “sites.” Our principal operations are in the United States and its territories. In addition, we own and operate towers in South America, Central America, and Africa. Our primary business line is our site leasing business, which contributed 97.7% of our total segment operating profit for the nine months ended September 30, 2025. During the first quarter of 2025, we sold all of our towers and ended our operations in both the Philippines and Colombia and on October 15, 2025, we sold 365 of our towers held in Canada. In our site leasing business, we (1) lease space to wireless service providers and other customers on assets that we own or operate and (2) manage rooftop and tower sites for property owners under various contractual arrangements. As of September 30, 2025, we owned 44,581 towers, a substantial portion of which have been built by us or built by other tower owners or operators who, like us, have built such towers to lease space to multiple wireless service providers. Our other business line is our site development business, through which we assist wireless service providers in developing and maintaining their own wireless service networks.\nOur primary focus is the leasing of antenna space on our multi-tenant towers to a variety of wireless service providers under long-term lease contracts in the United States, South America, Central America, and Africa. As of September 30, 2025, no U.S. state or territory accounted for more than 10% of our total tower portfolio by tower count, and no U.S. state or territory accounted for more than 10% of our total revenues for the nine months ended September 30, 2025. In addition, as of September 30, 2025, approximately 30% and 10% of our total towers are located in Brazil and Guatemala, respectively. No other international market (each country is considered a market) represented more than 5% of our total towers.\nWe derive site leasing revenues primarily from wireless service provider tenants. Wireless service providers enter into (1) individual tenant site leases with us, each of which relates to the lease or use of space at an individual site or (2) master lease agreements (“MLA”) with us,\nwhich provide for the material terms and conditions that will apply to multiple sites; although, in most cases, each individual site under a MLA is also governed by its own site leasing agreement which sets forth pricing and other site specific terms. Our tenant leases are generally for an initial term of five years to fifteen years with multiple renewal periods at the option of the tenant. Our tenant leases typically either (1) contain specific annual rent escalators, (2) escalate annually in accordance with an inflationary index, or (3) escalate using a combination of fixed and inflation adjusted escalators. In addition, our international site leases may include pass-through charges, such as rent related to ground leases and other property interests, utilities, property taxes, and fuel.\nCost of site leasing revenue primarily consists of:\nCash and non-cash rental expense on ground leases, right-of-use, and other underlying property interests;\nSite maintenance and monitoring costs (exclusive of employee related costs);\nFuel (in those international markets that do not have an available electric grid at our tower sites); and\n\nGround leases and other property interests are generally for an initial term of five years or more with multiple renewal periods, which are at our option. Our ground leases either (1) contain specific annual rent escalators or (2) escalate annually in accordance with an inflationary index. As of September 30, 2025, approximately 71% of our tower structures were located on parcels of land that we own, land subject to perpetual easements, or parcels of land in which we have a leasehold interest that extends beyond 20 years. For any given tower, costs are relatively fixed over a monthly or an annual time period. As such, operating costs for owned towers do not generally increase as a result of adding additional customers to the tower. The amount of property taxes varies from site to site depending on the taxing jurisdiction and the height and age of the tower. The ongoing maintenance requirements are typically minimal and include replacing lighting systems, painting a tower, or upgrading or repairing an access road or fencing.\nI\nn Ecuador, El Salvador, Guatemala, Nicaragua, and Panama, significantly all of our revenue, expenses, and capital expenditures arising from our activities are denominated in U.S. dollars. Specifically, most of our ground leases and other property interests, tenant leases, and tower-related expenses are paid in U.S. dollars. In most of our Central American markets, our local currency obligations are principally limited to (1) permitting and other local fees, (2) utilities, and (3) taxes. In Brazil, Chile, and South Africa, significantly all of our revenue, expenses, and capital expenditures, including tenant leases, ground leases and other property interests, and other tower-related expenses are denominated in local currency. In Costa Rica, Peru, and Tanzania, our revenue, expenses, and capital expenditures, including tenant leases, ground leases and other property interests, and other tower-related expenses are denominated in a mix of local currency and U.S. dollars\nAs indicated in the table below, our site leasing business generates substantially all of our total segment operating profit. For information regarding our operating segments, see Note 14 to our Consolidated Financial Statements included in this quarterly report.\n\nFor information regarding our operating segments, see Note 14 to our Consolidated Financial Statements in this quarterly report.\nCapital Allocation Strategy\nOur capital allocation strategy is aimed at increasing shareholder value through investment in quality assets that meet our return criteria, stock repurchases when we believe our stock price is below its intrinsic value, and by returning cash generated by our operations in the form of cash dividends. In addition, in a high interest rate environment and when we believe interest rates may stay higher for longer, we believe that debt repayments, especially of our variable rate debt, may be an accretive use of our excess capital. While the addition of cash dividends and debt repayments have provided us with additional tools to return value to our shareholders, we continue to believe that our priority is to make investments focused on increasing Adjusted Funds From Operations per share. Key elements of our capital allocation strategy include:\nWe intend to continue to grow our asset portfolio, domestically and internationally, primarily through tower acquisitions and the construction of new towers that meet our internal return on invested capital criteria.\nStock Repurchase Program.\nWe currently utilize stock repurchases as part of our capital allocation policy when we believe our share price is below its intrinsic value. We believe that share repurchases, when purchased at the right price, will facilitate our goal of increasing our Adjusted Funds From Operations per share.\nCash dividends are an additional component of our strategy of returning value to shareholders. We do not expect our dividend to require any changes in our leverage and believe that, due to our low dividend payout ratio, we can continue to focus on building and buying quality assets and opportunistically buying back our stock. While the timing and amount of future dividends will be subject to approval by our Board of Directors, we believe that our future cash flow generation will permit us to grow our cash dividend in the future.\nCritical Accounting Policies and Estimates\nVerizon Master Lease Agreement\nOn October 30, 2025, we entered into a new 10-year agreement with Verizon (the “Verizon agreement”). The Verizon agreement provides greater operational efficiencies for both companies helping support Verizon’s continued network modernization plans. Additionally, the agreement provides commitments for growth through new deployments across our tower portfolio over the term of the agreement.\nRESULTS OF OPERATIONS\nThis report presents our financial results and other financial metrics on a GAAP basis and, with respect to our international and consolidated results, after eliminating the impact of changes in foreign currency exchange rates. We believe that providing these financial results and metrics on a constant currency basis, which are non-GAAP measures, gives management and investors the ability to evaluate the performance of our business without the impact of foreign currency exchange rate fluctuations. We eliminate the impact of changes in foreign currency exchange rates by dividing the current period’s financial results by the average monthly exchange rates of the prior year period, as well as by eliminating the impact of realized and unrealized gains and losses on our intercompany loans.\n\nDomestic site leasing revenues increased $5.4 million for the three months ended September 30, 2025, as compared to the prior year, primarily due to (1) organic site leasing growth from new leases, amendments, and contractual escalators and (2) revenues from 45 towers acquired and 34 towers built since July 1, 2024, partially offset by Sprint and other lease non-renewals and a decrease in non-cash straight line revenue.\nInternational site leasing revenues increased $25.3 million for the three months ended September 30, 2025, as compared to the prior year. On a constant currency basis, international site leasing revenues increased $22.3 million. This change was primarily due to ("
}