{
  "source_file": "sbux-20250629.htm",
  "form_type": "10-Q",
  "item1_clean": null,
  "item7_clean": null,
  "item2_clean": "Management’s Discussion and Analysis of Financial Condition and Results of Operations\nCAUTIONARY STATEMENT PURSUANT TO THE PRIVATE SECURITIES LITIGATION REFORM ACT OF 1995\nCertain statements contained herein are “forward-looking” statements within the meaning of applicable securities laws and regulations. Generally, these statements can be identified by the use of words such as “aim,” “anticipate,” “believe,” “continue,” “could,” “estimate,” “expect,” “feel,” “forecast,” “intend,” “may,” “outlook,” “plan,” “potential,” “predict,” “project,” “seek,” “should,” “will,” “would,” and similar expressions intended to identify forward-looking statements, although not all forward-looking statements contain these identifying words. By their nature, forward-looking statements involve risks, uncertainties, and other factors (many beyond our control) that could cause our actual results to differ materially from our historical experience or from our current expectations or projections. Our forward-looking statements, and the risks and uncertainties related thereto, include, but are not limited to, those described under the “Risk Factors” and “Management\ns Discussion and Analysis of Financial Condition and Results of Operations” sections of our most recently filed 10-K and 10-Q and in other reports we file with the SEC, as well as, among others:\n• our ability to preserve, grow, and leverage our brands, including the risk of negative responses by consumers (such as boycotts or negative publicity campaigns), governmental actors (such as retaliatory or threatened legislative treatment or other actions), or other third parties who object to certain actions taken or not taken by the Company, whose responses could adversely affect our brand value;\n• the impact of our marketing strategies, promotional and advertising plans, pricing strategies, platforms, reformulations, innovations, or customer experience initiatives or investments;\n• the costs and risks associated with, and the successful and timely execution and effects of, our existing and any future business opportunities, expansions, initiatives, strategies, investments, and plans, including our\n• the costs and risks associated with, and the successful execution and effects of, strategic changes to our ownership and operating structure, including as a result of acquisitions, divestitures, or entry into joint ventures;\n• our ability to align our investment efforts with our strategic goals;\n• changes in consumer preferences, demand, consumption, or spending behavior, including due to shifts in demographic or health and wellness trends, reduction in discretionary spending and price increases, and our ability to anticipate or react to these changes;\n• the ability of our business partners, suppliers, and third-party providers to fulfill their responsibilities and commitments;\n• the potential negative effects of reported incidents involving food- or beverage-borne illnesses, tampering, adulteration, contamination, or mislabeling;\n• our ability to open new stores and efficiently maintain the attractiveness of our existing stores;\n• our dependence on the financial performance of our North America operating segment, and our increasing dependence on certain international markets;\n• our anticipated cash requirements and operating expenses, including our anticipated total capital expenditures;\n• inherent risks of operating a global business, including changing conditions in our markets, local factors affecting store openings, protectionist trade or foreign investment policies, such as imposed or threatened to be imposed tariffs and other trade controls, economic or trade sanctions, compliance with local laws and other regulations, and local labor policies and conditions, including labor strikes and work stoppages;\n• higher costs, lower quality, or unavailability of coffee, dairy, cocoa, energy, water, raw materials, or product ingredients;\n• the potential impact on our supply chain and operations of adverse weather conditions, natural disasters, or significant increases in logistics costs;\n• the ability of our supply chain to meet current or future business needs and our ability to scale and improve our forecasting, planning, production, and logistics management;\n• a worsening in the terms and conditions upon which we engage with our manufacturers and source suppliers, whether resulting from broader local or global conditions or dynamics specific to our relationships with such parties;\n• the impact of unfavorable global or regional economic conditions and related economic slowdowns or recessions, low consumer confidence, high unemployment, weak credit or capital markets, budget deficits, burdensome government debt, austerity measures, higher interest rates, higher taxes, international trade disputes, government restrictions, geopolitical instability, higher inflation, or deflation;\n• failure to meet our announced guidance or market expectations and the impact thereof;\n• failure to attract or retain key executive or partner talent or successfully onboard or transition executives;\n• the impacts of partner investments, business transformation initiatives, including those related to our workforce, and changes in the availability and cost of labor, including any union organizing efforts and our responses to such efforts;\n• the impact of foreign currency translation, particularly a stronger U.S. dollar;\n• the impact of, and our ability to respond to, substantial competition from new entrants, consolidations by competitors, and other competitive activities, such as pricing actions (including price reductions, promotions, discounting, couponing, or free goods), marketing, category expansion, product introductions, or entry or expansion in our geographic markets;\n• potential impacts of climate change;\n• evolving corporate governance and public disclosure regulations and expectations;\n• the potential impact of activist shareholder actions or tactics;\n• failure to comply with applicable laws and changing legal and regulatory requirements;\n• the impact or likelihood of significant legal disputes and proceedings or government investigations;\n• potential negative effects of, and our ability to respond to, a material failure, inadequacy, or interruption of our information technology systems or those of our third-party business partners or service providers, or failure to comply with data protection laws; and\n• our ability to adequately protect our intellectual property or adequately ensure that we are not infringing the intellectual property of others.\nIn addition, many of the foregoing risks and uncertainties are, or could be, exacerbated by any worsening of the global business and economic environment. A forward-looking statement is neither a prediction nor a guarantee of future events or circumstances, and those future events or circumstances may not occur. You should not place undue reliance on the forward-looking statements, which speak only as of the date of this report. We are under no obligation to update or alter any forward-looking statements, whether as a result of new information, future events, or otherwise.\nThis information should be read in conjunction with the unaudited consolidated financial statements and the notes included in Item 1 of Part I of this 10-Q and the audited consolidated financial statements and notes, and Management’s Discussion and Analysis of Financial Condition and Results of Operations (“MD&A”), contained in the 10-K.\nIntroduction and Overview\nStarbucks is the premier roaster, marketer, and retailer of specialty coffee globally, with a presence in 88 markets worldwide. As of June 29, 2025, Starbucks had more than 41,000 company-operated and licensed stores, an increase of 4% from the prior year. Additionally, we sell a variety of consumer-packaged goods, primarily through the Global Coffee Alliance established with Nestlé and other partnerships and joint ventures.\nWe have three reportable operating segments: 1) North America, which is inclusive of the U.S. and Canada; 2) International, which is inclusive of China, Japan, Asia Pacific, Europe, Middle East, Africa, Latin America, and the Caribbean; and 3) Channel Development. Unallocated corporate expenses are reported within Corporate and Other.\nWe believe our financial results and long-term growth model will continue to be driven by new store openings, comparable store sales, and operating margin management, underpinned by disciplined capital allocation. We believe these key operating metrics are useful to investors because management uses these metrics to assess the growth of our business and the effectiveness of our marketing and operational strategies. Throughout this MD&A, we commonly discuss the following key operating metrics:\nNew store openings and store count\nComparable store sales\nComparable store sales represents the percentage change in sales in one period from the same prior year period for company-operated stores open for 13 months or longer and excludes the impact of foreign currency translation. We analyze comparable store sales on a constant currency basis as this helps identify underlying business trends, without distortion from the effects of currency movements. Stores that are temporarily closed or operating at reduced hours remain in comparable store sales while stores identified for permanent closure have been removed.\nOur fiscal year ends on the Sunday closest to September 30. Fiscal 2025 and 2024 include 52 weeks. All references to store counts, including data for new store openings, are reported net of store closures, unless otherwise noted.\nStarbucks results for the third quarter of fiscal 2025 showed continued progress on key “Back to Starbucks” initiatives, specifically investments in coffeehouse partners, including the Leadership Experience 2025, a conference designed to empower and motivate our retail leaders to accelerate our “Back to Starbucks” strategy, as we work to rebuild a stronge"
}