{
  "source_file": "schw-20241231.htm",
  "form_type": "10-K",
  "item1_clean": "General Corporate Overview\nThe Charles Schwab Corporation (CSC) is a savings and loan holding company. CSC engages, through its subsidiaries (collectively referred to as Schwab or the Company), in wealth management, securities brokerage, banking, asset management, custody, and financial advisory services. At December 31, 2024, Schwab had $10.10 trillion in client assets, 36.5 million active brokerage accounts, 5.4 million workplace plan participant accounts, and 2.0 million banking accounts.\nPrincipal business subsidiaries of CSC include the following:\nCharles Schwab & Co., Inc. (CS&Co), incorporated in 1971, a securities broker-dealer;\nCharles Schwab Bank, SSB (CSB), our principal banking entity; and\nCharles Schwab Investment Management, Inc. (CSIM), the investment advisor for Schwab’s proprietary mutual funds (Schwab Funds\n) and for Schwab’s exchange-traded funds (Schwab ETFs).\nIn May 2024, the Company completed the final client account conversions to CS&Co from the Ameritrade broker-dealers, TD Ameritrade, Inc. and TD Ameritrade Clearing, Inc. (TDAC). Accordingly, these entities are no longer principal business subsidiaries. See Business Acquisition below for additional information regarding the integration.\nUnless otherwise indicated, the terms “Schwab,” “the Company,” “we,” “us,” or “our” mean CSC together with its consolidated subsidiaries.\nSchwab provides financial services to individuals and institutional clients through two segments – Investor Services and Advisor Services. The Investor Services segment provides retail brokerage, investment advisory, and banking and trust services to individual investors, and retirement plan and business services, as well as other corporate brokerage services, to businesses and their employees. The Advisor Services segment provides custodial, trading, banking and trust, and support services to independent registered investment advisors (RIAs), independent retirement advisors, and recordkeepers. These services are further described in the segment discussion below.\nBusiness Strategy and Competitive Environment\nSchwab was founded on the belief that all Americans deserve access to a better investing experience. Although much has changed in the intervening years, our purpose remains clear – to champion every client’s goals with passion and integrity. Guided by this purpose and our vision of creating the most trusted leader in investment services, management has adopted a strategy described as “Through Clients’ Eyes.”\nThis strategy emphasizes placing clients’ perspectives, needs, and desires at the forefront. Because investing plays a fundamental role in building financial security, we strive to deliver a better investing experience for our clients – individual investors and the people and institutions who serve them – by disrupting longstanding industry practices on their behalf and providing superior service. We also aim to offer a broad range of products and solutions to meet client needs with a focus on transparency, value, and trust. In addition, management works to couple Schwab’s scale and resources with ongoing expense discipline to keep costs low and ensure that products and solutions are affordable as well as responsive to client needs. In combination, these are the key elements of our “no trade-offs” approach to serving investors. We believe that following this strategy is the best way to maximize our market valuation and stockholder returns over time.\nManagement estimates that investable wealth in the United States (U.S.) (consisting of assets in defined contribution, retail wealth management and brokerage, and registered investment advisor channels, along with bank deposits) currently exceeds $75 trillion, which means the Company’s $10.10 trillion in client assets leaves substantial opportunity for growth. Our strategy is based on the principle that developing trusted relationships will translate into more assets from both new and existing clients, ultimately driving more revenue, and along with expense discipline and thoughtful capital management, will generate earnings growth and build long-term stockholder value.\nWithin Investor Services, our competition in serving individual investors spans brokerage, wealth management, and asset management firms, as well as banks, trust companies, financial technology companies, and retirement service providers. In the Advisor Services arena, we compete with institutional custodians, wirehouses, regional and independent broker-dealers, banks, and trust companies.\nTHE CHARLES SCHWAB CORPORATION\nAcross both segments, our key competitive advantages are:\nScale and Size of the Business – As one of the largest investment services firms in the U.S., we are able to spread operating costs and amortize new investments over a large base of clients, and harness the resources to evolve capabilities to meet client needs.\nOperating Efficiency – Coupled with scale, our operating efficiency and sharing of infrastructure across different businesses creates a cost advantage that enables us to competitively price products and services while profitably serving clients of various sizes across multiple channels.\nOperating Structure – Providing bank, wealth, and asset management services to broker-dealer clients helps serve a wider array of needs, thereby deepening relationships, enhancing the stability of client assets, and enabling diversified revenue streams.\nBrand and Corporate Reputation – In an industry dependent on trust, Schwab’s reputation and brand across multiple constituents enable us to attract clients and employees while credibly introducing new products to the market.\nService Culture – Delivering a great client experience earns the trust and loyalty of clients and increases the likelihood that those clients will refer others.\nWillingness to Disrupt – Management’s willingness to challenge the status quo, including our own business practices, to benefit clients fosters innovation and continuous improvement, which helps to attract more clients and assets.\nBusiness Acquisition\nAcquisition of Ameritrade\nThe Company acquired TD Ameritrade Holding Corporation, now Ameritrade Holding LLC (Ameritrade Holding) and its consolidated subsidiaries (collectively referred to as Ameritrade), effective October 6, 2020. The Company’s integration of Ameritrade is now complete. Through the integration, the Company generally adopted Schwab platforms and systems, though we’ve leveraged certain material advantages in Ameritrade’s platforms, including our comprehensive integration of Ameritrade’s thinkorswim\ntrading platforms, education, and tools into our offerings for retail and RIA clients. In 2023, we launched Schwab Trading Powered by Ameritrade™, an enhanced trading experience made possible by the combination of the thinkorswim trading platform with Schwab’s trading capabilities on Schwab.com and Schwab Mobile. We have also incorporated Ameritrade Institutional’s customizable portfolio rebalancing solution, iRebal\n, as part of our offering for independent advisor clients.\nOver the course of five client transition groups in 2023 and 2024, we converted approximately $1.9 trillion in client assets across more than 17 million client accounts, including 7,000 RIAs, from Ameritrade to Schwab. In May 2024, the Company completed the conversion of the final Ameritrade client transition group to the Schwab platform. Following the completion of the final client account conversions to CS&Co, TD Ameritrade, Inc., and TDAC submitted Uniform Requests for Broker-Dealer Withdrawal (BDW) to terminate their registration as broker-dealers with the SEC, the Financial Industry Regulatory Authority, Inc. (FINRA), and other applicable regulatory organizations, and as of December 31, 2024, TD Ameritrade, Inc. and TDAC are no longer registered as broker-dealers with the SEC and FINRA.\nFor additional information on our integration of Ameritrade, see Part II – Item 7 – Management’s Discussion and Analysis of Financial Condition and Results of Operations (Item 7) – Overview and Part II – Item 8 – Financial Statements and Supplementary Data (Item 8) – Note 16.\nConcurrently with the execution of the Agreement and Plan of Merger, dated as of November 24, 2019, as amended (the Merger Agreement) to acquire Ameritrade, CSC entered into an amended and restated insured deposit account agreement with TD Bank USA, National Association and TD Bank, National Association (together, the TD Depository Institutions) (the 2019 IDA agreement), which became effective October 6, 2020. On May 4, 2023, the Company executed the Second Amended and Restated Insured Deposit Account Agreement (2023 IDA agreement) with the TD Depository Institutions that replaced and superseded the 2019 IDA agreement. Consistent with the 2019 IDA agreement, in accordance with the 2023 IDA agreement, cash held in eligible brokerage client accounts is swept off-balance sheet to deposit accounts at the TD Depository Institutions. Schwab provides recordkeeping and support services to the TD Depository Institutions with respect to the deposit accounts for which Schwab receives an aggregate monthly fee. Under the 2023 IDA agreement, the service fee on client cash deposits held at the TD Depository Institutions remains at 15 basis points, as it was in the 2019 IDA agreement.\nFor additional information on the 2023 IDA agreement, see Part II – Item 7 – Capital Management and Item 8 – Note 15.\nTHE CHARLES SCHWAB CORPORATION\nProducts and Services\nSchwab offers a broad range of products and services through intuitive end-to-end solutions, including robust digital capabilities, to address our clients’ varying investment and financial needs. Examples of these offerings include the following:\nBrokerage – an array of full-feature brokerage accounts with equity and fixed income trading, margin lending, options trading, futures and forex trading, and cash management capabilities including certificates of deposit;\nMutual funds – third-party mutual funds through the Mutual Fund Marketplace\n, including no-transaction-fee (NTF) mutual funds through the Mutual Fund OneSource\nservice, which also includes proprietary mutual funds, plus mutual fund trading and clearing services to broker-dealers;\nExchange-traded funds (ETFs) – an extensive offering of ETFs, including both proprietary and third-party ETFs;\nManaged investing solutions – managed portfolios of both proprietary and third-party mutual funds and ETFs, separately managed accounts, customized personal advice for tailored portfolios, specialized planning, and full-time portfolio management;\nAlternative investments – access to a variety of third-party alternative investments, such as private equity and real estate on Schwab’s alternative investment platforms – Schwab Alternative Investment OneSource\nand Schwab Alternative Investment Marketplace;\nBanking – checking and savings accounts, first lien residential real estate mortgage loans (First Mortgages), home equity lines of credit (HELOCs), and pledged asset lines (PALs); and\nTrust – trust custody services, personal trust reporting services, and administrative trustee services.\nThese investing products and services are made available through two business segments – Investor Services and Advisor Services. Schwab’s major sources of revenues are generated by both of the reportable segments, based on their respective levels of client assets and activity. Revenue is attributable to a reportable segment based on which segment has the primary responsibility for serving the client. The accounting policies of the reportable segments are the same as those described in Part II – Item 8 – Note 2.\nCharles Schwab initially founded the Company 50 years ago to provide individual investors with access to the financial markets at a highly competitive cost. The Company has expanded offerings over time in response to client needs, aiming to provide a compelling and often disruptive solution in the marketplace. The Investo",
  "item7_clean": "Calculated as the principal amount of a loan divided by the value of the collateral securing the loan.\nMoney borrowed against the value of certain stocks, bonds, and mutual funds in a client portfolio. The borrowed money can be used to purchase additional securities or to meet short-term financial needs.\nMaster netting arrangement:\nAn agreement between two counterparties that have multiple contracts with each other that provides for net settlement of all contracts through a single cash payment in the event of default or termination of any one contract.\nMortgage-backed securities:\nA type of asset-backed security that is secured by a mortgage or group of mortgages.\nTHE CHARLES SCHWAB CORPORATION\nManagement’s Discussion and Analysis of Financial Condition and Results of Operations\n(Tabular Amounts in Millions, Except Ratios, or as Noted)\nNet interest margin:\nNet interest revenue (annualized for interim periods) divided by average interest-earning assets.\nNet new client assets:\nTotal inflows of client cash and securities to Schwab less client outflows. Inflows include dividends and interest; outflows include commissions and fees. Capital gains distributions are excluded.\nNet Stable Funding Ratio (NSFR):\nThe ratio of the amount of available stable funding relative to the amount of required stable funding.\nNew brokerage accounts:\nAll brokerage accounts opened during the period, as well as any accounts added via acquisition.\nNonperforming assets:\nThe total of nonaccrual loans and other real estate owned.\nPayments received from trade execution venues to which our broker-dealer subsidiary sends equity and option orders.\n(PAL):\nA non-purpose revolving line of credit from a banking subsidiary secured by eligible assets held in a separate pledged brokerage account maintained at CS&Co.\nReturn on average common stockholders’ equity:\nCalculated as net income available to common stockholders (annualized for interim periods) divided by average common stockholders’ equity.\nRisk-weighted assets:\nComputed by assigning specific risk-weightings to assets and off-balance sheet instruments for capital adequacy calculations.\nThe sum of CET1 Capital and additional Tier 1 Capital instruments and related surplus, less applicable adjustments and deductions.\nTier 1 Leverage Ratio:\nEnd-of-period Tier 1 Capital divided by adjusted average total consolidated assets for the period.\nDays in which the markets/exchanges are open for the buying and selling of securities. Early market closures are counted as half-days.\nU.S. federal banking agencies:\nRefers to the Federal Reserve, the Office of the Comptroller of the Currency, the FDIC, and the CFPB.\nUniform Net Capital Rule:\nRefers to Rule 15c3-1 under the Securities Exchange Act of 1934, which specifies minimum capital requirements that are intended to ensure the general financial soundness and liquidity of broker-dealers at all times.\nTHE CHARLES SCHWAB CORPORATION\nManagement’s Discussion and Analysis of Financial Condition and Results of Operations\n(Tabular Amounts in Millions, Except Ratios, or as Noted)\nOVERVIEW\nManagement focuses on several client activity and financial metrics in evaluating Schwab’s financial position and operating performance. We believe that metrics relating to net new and total client assets, as well as client cash levels and utilization of advisory services, offer perspective on our business momentum and client engagement. Data on new and total client brokerage accounts provides additional perspective on our ability to attract and retain new business. Total net revenue growth, pre-tax profit margin, EPS, return on average common stockholders’ equity, and the consolidated Tier 1 Leverage Ratio provide broad indicators of Schwab’s overall financial health, operating efficiency, and ability to generate acceptable returns. Total expenses excluding interest as a percentage of average client assets is a measure of operating efficiency.\nResults for the years ended December 31, 2024, 2023, and 2022 are as follows:\nPercent Change 2024-2023\nNet new client assets (in billions)\nCore net new client assets (in billions)\nClient assets (in billions, at year end)\nAverage client assets (in billions)\nNew brokerage accounts (in thousands)\nActive brokerage accounts (in thousands, at year end)\nAssets receiving ongoing advisory services (in billions, at year end)\nClient cash as a percentage of client assets (at year end)\nCompany Financial Information and Metrics\nTotal expenses excluding interest\nIncome before taxes on income\nPreferred stock dividends and other\nNet income available to common stockholders\nEarnings per common share — diluted\nNet revenue growth from prior year\nPre-tax profit margin\nReturn on average common stockholders’ equity\nExpenses excluding interest as a percentage of average client assets\nConsolidated Tier 1 Leverage Ratio (at year end)\nNon-GAAP Financial Measures\nAdjusted total expenses\nAdjusted diluted EPS\nReturn on tangible common equity\n2024 includes net outflows of $14.6 billion from off-platform brokered CDs issued by CSB and an inflow of $10.3 billion from a mutual fund clearing services client and an outflow of $1.0 billion from an international relationship. 2023 includes net inflows of $32.5 billion from off-platform brokered CDs issued by CSB and $12.0 billion from a mutual fund clearing services client and outflows of $13.0 billion from an international relationship. 2022 includes outflows of $20.8 billion from certain mutual fund clearing services clients.\nBeginning in 2023, adjustments made to GAAP financial measures also include restructuring costs. See Non-GAAP Financial Measures for further details and a reconciliation of such measures to GAAP reported results.\nAdjusted total expenses is a non-GAAP financial measure adjusting total expenses excluding interest. See Non-GAAP Financial Measures.\nTHE CHARLES SCHWAB CORPORATION\nManagement’s Discussion and Analysis of Financial Condition and Results of Operations\n(Tabular Amounts in Millions, Except Ratios, or as Noted)\n2024 Compared to 2023\nThrough an evolving macroeconomic landscape in 2024, Schwab continued its “Through Clients’ Eyes” strategy, striving to meet the needs of our diverse client base, while driving growth across multiple fronts and successfully completing the integration of Ameritrade. Amid easing inflation, the Federal Reserve began in September to cut interest rates for the first time in over four years, reducing the federal funds overnight rate by a total of 100 basis points in the third and fourth quarters. Equity markets were positive for the year in 2024, with the S&P 500\nand the NASDAQ Composite\nfinishing the year higher by 23% and 29%, respectively.\nReflecting the strength of equity markets and organic asset gathering, total client assets rose to $10.10 trillion as of year-end 2024, up 19% from year-end 2023. Core net new assets totaled $366.9 billion in 2024, up 20% from 2023, and representing an annualized growth rate of 4.3%. Following the successful completion of our final Ameritrade client conversion in May, our organic growth trends strengthened, and core net new assets for the fourth quarter of 2024 were $114.8 billion, up 51% from the fourth quarter of 2023. We saw strong client engagement in the markets throughout 2024, with acceleration in the fourth quarter; clients’ DATs were 5.9 million in full-year 2024 and 6.3 million in the fourth quarter, increasing 9% and 22%, respectively, from the same periods in 2023. Clients opened 4.2 million new brokerage accounts in 2024, a year-over-year increase of 10%, and active brokerage accounts ended 2024 at 36.5 million, up 5% on the year.\nThe Company’s financial results in 2024 reflected the impact of positive equity markets, solid asset gathering, sustained client engagement, and improvement in client cash trends. Net income totaled $5.9 billion in 2024, up 17% year-over-year, and diluted EPS was $2.99, an increase of 18% over the prior year. Adjusted diluted EPS\nwas $3.25 in 2024, up 4% from $3.13 in 2023.\nTotal net revenues rose 4% year-over-year to $19.6 billion in 2024. Net interest revenue was $9.1 billion in 2024, down 3% from 2023, which reflected lower average interest-earning assets and higher rates on funding sources, partially offset by growth in margin and bank lending and lower bank supplemental funding. Client cash realignment activity continued to decelerate in 2024, and principal and interest payments on the AFS and HTM investment securities portfolios supported reductions in bank supplemental funding balances. Asset management and administration fees were $5.7 billion in 2024, increasing 20% from the prior year primarily as a result of growth in money market funds, equity market gains, and growth in managed investing solutions. Trading revenue was $3.3 billion in 2024, up 1% from the prior year, reflecting higher volume and changes in mix of client trading activity. Bank deposit account fee revenue totaled $729 million in 2024, up 3% year-over-year, due primarily to $97 million in breakage fees recognized in 2023, partially offset by lower average BDA balances. BDA balances totaled $87.6 billion at December 31, 2024, down 10% from year-end 2023 primarily resulting from lower client cash allocations.\nTotal expenses excluding interest were $11.9 billion in 2024, down 4% from 2023. This decrease reflected lower restructuring costs, lower acquisition and integration-related costs, and lower regulatory fees and assessments due primarily to a $172 million FDIC special assessment recognized in the fourth quarter of 2023 (see Current Regulatory and Other Developments). These lower expenses were partially offset by higher incentive compensation, higher depreciation and amortization due to continued investment to support growth of the business, and higher other expense. Other expense reflected higher industry fees resulting from the SEC’s May 2024 fee rate increase. Adjusted total expenses\nwere $11.3 billion in 2024, up 2% from 2023. Acquisition and integration-related costs, amortization of acquired intangible assets, and restructuring costs totaled $645 million in 2024, down 55% from 2023, as substantially all of the Company’s costs related to its restructuring were incurred in 2023, and spending for the Ameritrade integration decreased in 2024 as we completed the final integration activities.\nReturn on average common stockholders’ equity was 15% in 2024, down from 16% in 2023, and return on tangible common equity\n(ROTCE) was 35% in 2024, down from 54% in 2023. These changes reflect the benefit of higher net income in 2024 offset by higher average common stockholders’ equity. Average common stockholders’ equity was higher year-over-year due to higher retained earnings as well as higher average AOCI. The increase in average AOCI was driven by lower unrealized losses on our AFS investment securities portfolio and securities transferred in 2022 from AFS to HTM (see Item 8 – Note 21).\nEmploying our diligent approach to managing the balance sheet, Schwab supported client-driven growth in margin and bank lending, while reducing our bank supplemental funding in 2024. Total balance sheet assets decreased 3% during the year, though margin lending grew to $83.8 billion at year-end 2024, up 34%, and bank loans increased to $45.2 billion, rising 12% during the year. Principal and interest from our AFS and HTM securities portfolios, along with deceleration of client cash realignment from sweep products to higher-yielding investment solutions, supported a reduction in bank supplemental funding, which includes brokered CDs, FHLB borrowings, and borrowings under repurchase agreements at our banks. Total bank supplemental funding ended 2024 at $49.9 billion, down $29.7 billion, or 37%, from year-end 2023, and down 49% from peak\nTHE CHARLES SCHWAB CORPORATION\nManagement’s Discussion and Analysis of Financial Condition and Results of Operations\n(Tabular Amounts in Millions, Except Ratios, or as Noted)\nlevels in May 2023. Supported by strength of net income, our consolidated Tier 1 Leverage Ratio increased to 9.9% as of December 31, 2024, and our consolidated adjusted Tier 1 Leverage Ratio\n, which includes AOCI in the ratio, rose to 6.8%, ending the year within our long-term operating objective of 6.75% - 7.00%.\nAdjusted diluted EPS, adjusted total expenses, return on tangible common equity, and adjusted Tier 1 Leverage Ratio are non-GAAP financial measures. See Non-GAAP Financial Measures for further details and a reconciliation of such measures to GAAP reported results.\n2023 Compared to 2022\nThrough an uneven environment in 2023, with shifting views on the trajectory of the U.S. economy, persistent geopolitical unrest, and turmoil beginning early in the year within the banking sector, our “no trade-offs” value proposition continued to resonate with investors. The Federal Reserve raised the Federal Funds rate four times in the first three quarters of 2023 for a total of 100 basis points before holding rates unchanged from July through the end of 2023. Although equity markets were volatile during 2023, ultimate returns were strong with the S&P 500\nrising 24% and the NASDAQ Composite\nincreasing 43%. Investor sentiment was also volatile throughout 2023; strongly bearish in the first quarter before recovering in the second, then declining again in the third quarter. Investor sentiment recovered significantly in the fourth quarter to end 2023 with a solid bullish viewpoint.\nDespite this mixed sentiment, our clients remained engaged with the markets and with Schwab. Clients entrusted us with $305.7 billion in core net new assets in 2023. Total client assets reached $8.52 trillion as of December 31, 2023, rising 21% from year-end 2022 as a result of asset gathering and market gains, partially offset by some expected deal-related attrition from clients originating at Ameritrade. Trading volume declined somewhat from the prior year, as DATs were 5.4 million in 2023, down 9% from 2022. Clients opened 3.8 million new brokerage accounts in 2023, bringing active brokerage accounts to 34.8 million at year-end, up 3% year-over-year. Clients sought to take advantage of higher market interest rates in 2023, and we saw significant client cash reallocation from our sweep products into higher-yielding alternatives offered by Schwab. While bank sweep deposits and payables to brokerage clients decreased by a total of $126.1 billion during 2023, client assets invested in Schwab’s proprietary money market funds and fixed income securities increased by a total of $383.8 billion.\nSchwab’s financial performance during 2023 reflected the challenges of navigating a market environment shaped by the Federal Reserve’s interest rate tightening policy and the follow-on effects stemming from the regional banking crisis beginning in March 2023. Schwab’s net income totaled $5.1 billion in 2023 and diluted EPS was $2.54, down 29% and 27%, respectively, from the prior year. Adjusted diluted EPS\nwas $3.13 in 2023, down 20% from $3.90 in 2022.\nTotal net revenues were $18.8 billion in 2023, down 9% from the prior year as client cash realignment activity impacted our net interest revenue. Net interest revenue was $9.4 billion in 2023, down 12% from the prior year, as the benefits of rising rates were more than offset by increased utilization of higher-cost supplemental funding and lower interest-earning assets. Asset management and administration fees totaled $4.8 billion in 2023, rising 13% from 2022, primarily as a result of growth in money market funds, as well as improvement in equity markets and growth in our other proprietary fund products, partially offset by lower balances of certain third-party funds. Trading revenue was $3.2 billion in 2023, down 12% from 2022, due primarily to mix of client trading activity and overall lower trading volume. Bank deposit account fee revenue was $705 million in 2023, down 50% from the prior year due to lower average BDA balances ",
  "item2_clean": null
}