{
  "source_file": "schw-20250930.htm",
  "form_type": "10-Q",
  "item1_clean": null,
  "item7_clean": null,
  "item2_clean": "Principal transactions\nBank deposit account fees\nNine Months Ended September 30,\nNet interest revenue\nNet interest revenue\nAsset management and administration fees\nMutual funds, ETFs, and CTFs\nManaged investing solutions\nAsset management and administration fees\nPrincipal transactions\nBank deposit account fees\nTHE CHARLES SCHWAB CORPORATION\nManagement’s Discussion and Analysis of Financial Condition and Results of Operations\n(Tabular Amounts in Millions, Except Ratios, or as Noted)\nNet Interest Revenue\nRevenue on interest-earning assets is affected by various factors, such as the composition of assets, prevailing interest rates and spreads at the time of origination or purchase, changes in interest rates on cash and cash equivalents, floating-rate securities and loans, and changes in prepayment levels for mortgage-backed and other asset-backed securities and loans. Schwab establishes the rates paid on client-related liabilities, and management expects that it will generally adjust the rates paid on these liabilities at some fraction of any movement in short-term rates. Interest expense on long-term debt, FHLB borrowings, other short-term borrowings, and other funding sources is impacted by market interest rates at the time of borrowing and changes in interest rates on floating-rate liabilities. Net interest revenue reflects the impacts of derivatives used to manage interest rate risk. See also Risk Management – Market Risk and Item 1 – Note 11 for additional information.\nThe Federal Reserve maintained the upper bound of the target overnight rate at 5.50% through most of 2024 before reducing the rate by 50 basis points during the third quarter of 2024 and another 50 basis points across two cuts during the fourth quarter of 2024. The Federal Reserve maintained the upper bound of the target overnight rate at 4.50% for most of the first nine months of 2025 before reducing the rate by 25 basis points in mid-September to 4.25%.\nSchwab’s average interest-earning assets for the third quarter and first nine months of 2025 were relatively consistent in aggregate with the same periods in 2024, while the mix of interest-earning assets shifted year-over-year to reflect higher margin and bank lending, higher cash and investments segregated, and lower balances of AFS and HTM securities. Client demand for margin and bank lending continued to be strong in the first nine months of 2025, reflecting positive equity market performance and client engagement, as margin loan balances rebounded following market volatility in late March and early April and rose further in the third quarter. Margin loan balances ended the third quarter at $97.2 billion, increasing 16% from both the second quarter of 2025 and year-end 2024, and up 33% from September 30, 2024. Total bank loans increased 6% and 18% in the third quarter and first nine months of 2025, respectively, finishing the third quarter at $53.6 billion, higher by 24% from September 30, 2024, due primarily to growth in PALs and First Mortgages.\nClient cash activity during the first nine months of 2025 reflected normal cash behavior, inclusive of organic growth, engagement in equity markets, and seasonality. Bank sweep deposits and payables to brokerage clients increased by a total of $15.0 billion, or 5%, during the third quarter of 2025, $12.5 billion, or 4%, during the first nine months of 2025, and $42.6 billion, or 15%, from September 30, 2024 to September 30, 2025. Principal and interest payments on AFS and HTM securities, as well as September transfers of $3.0 billion of BDA balances to our balance sheet (see Results of Operations – Bank Deposit Account Fees and Item 1 – Note 10) supported paydowns in bank supplemental funding of $12.9 billion, or 47%, during the third quarter of 2025, and $35.1 billion, or 70%, during the first nine months of 2025. Since September 30, 2024, the Company has reduced bank supplemental funding by $50.0 billion, or 77%.\nTHE CHARLES SCHWAB CORPORATION\nManagement’s Discussion and Analysis of Financial Condition and Results of Operations\n(Tabular Amounts in Millions, Except Ratios, or as Noted)\nThe following table presents net interest revenue information corresponding to interest-earning assets and funding sources on the condensed consolidated balance sheets:\nThree Months Ended September 30,\nInterest Revenue/ Expense\nInterest Revenue/ Expense\nInterest-earning assets\nCash and cash equivalents\nCash and investments segregated\nReceivables from brokerage clients\nAvailable for sale securities\nHeld to maturity securities\nTotal interest-earning assets\nSecurities lending revenue\nOther interest revenue\nTotal interest-earning assets\nPayables to brokers, dealers, and clearing organizations\nPayables to brokerage clients\nOther short-term borrowings\nFederal Home Loan Bank borrowings\nTotal interest-bearing liabilities\nNon-interest-bearing funding sources\nOther interest expense\nTotal funding sources\nNet interest revenue\nNine Months Ended September 30,\nInterest Revenue/ Expense\nInterest Revenue/ Expense\nInterest-earning assets\nCash and cash equivalents\nCash and investments segregated\nReceivables from brokerage clients\nAvailable for sale securities\nHeld to maturity securities\nTotal interest-earning assets\nSecurities lending revenue\nOther interest revenue\nTotal interest-earning assets\nPayables to brokers, dealers, and clearing organizations\nPayables to brokerage clients\nOther short-term borrowings\nFederal home loan bank borrowings\nTotal interest-bearing liabilities\nNon-interest-bearing funding sources\nOther interest expense\nTotal funding sources\nNet interest revenue\nAmounts have been calculated based on amortized cost. Interest revenue on investment securities is presented net of related premium amortization.\nBeginning in the fourth quarter of 2024, payables to brokers, dealers, and clearing organizations is presented separately from non-interest-bearing funding sources and included in total interest-bearing liabilities. This line item includes securities loaned and related interest expense. Prior period amounts have been reclassified to reflect this change.\nTHE CHARLES SCHWAB CORPORATION\nManagement’s Discussion and Analysis of Financial Condition and Results of Operations\n(Tabular Amounts in Millions, Except Ratios, or as Noted)\nNet interest revenue increased $828 million, or 37%, and $2.0 billion, or 30%, in the third quarter and first nine months of 2025, respectively, compared to the same periods in 2024. These increases were primarily due to lower balances of bank supplemental funding, lower average rates paid on funding sources, growth in margin and bank lending, and increases in securities lending, partially offset by lower yields on floating-rate assets due to lower market rates. Average interest-earning assets remained relatively flat, increasing slightly in the third quarter of 2025, and decreasing slightly in the first nine months of 2025, compared to the same periods in 2024. Both the third quarter and first nine months of 2025 saw higher balances of cash and investments segregated, growth in margin lending supported by higher payables to brokerage clients, and an increase in bank loans compared to the same periods in 2024. The decrease in average interest-earning assets during the first nine months of 2025 was due primarily to lower average balances in AFS and HTM securities, as cash inflows from investment securities were used to pay down bank supplemental funding.\nNet interest margin increased to 2.86% and 2.68% in the third quarter and first nine months of 2025, respectively, compared to 2.08% and 2.04% during the same periods in 2024, as reduced balances of bank supplemental funding and lower rates paid on funding sources more than offset lower yields on floating-rate assets due to lower market interest rates.\nTHE CHARLES SCHWAB CORPORATION\nManagement’s Discussion and Analysis of Financial Condition and Results of Operations\n(Tabular Amounts in Millions, Except Ratios, or as Noted)\nAsset Management and Administration Fees\nThe following table presents asset management and administration fees, average client assets, and average fee yields:\nThree Months Ended September 30,\nSchwab money market funds\nSchwab equity and bond funds, ETFs, and CTFs\nMutual Fund OneSource\nand other no-transaction-fee (NTF) funds\n\nSchwab’s business activities expose it to a variety of risks, including operational, compliance, credit, market, and liquidity risks. The Company has a comprehensive risk management program to identify and manage these risks and their associated potential for financial and reputational impact.\nMarket risk is the potential for changes in earnings or the value of financial instruments held by Schwab as a result of fluctuations in interest rates, equity prices, or market conditions. Schwab is exposed to market risk primarily from changes in interest rates within our interest-earning assets relative to changes in the costs of funding sources that finance these assets.\nTo manage interest rate risk, we have established policies and procedures, which include setting limits on net interest revenue risk and EVE risk. To remain within these limits, we manage the maturity, repricing, and cash flow characteristics of the investment portfolios. Management monitors established guidelines to stay within the Company’s risk appetite. The Company utilizes interest rate swap derivative instruments to assist with managing interest rate risk, the effects of which are incorporated into the Company’s net interest revenue and EVE analyses. For further information on our interest rate risk management strategies utilizing interest rate swaps, see Item 1 – Note 11.\nOur measurement of interest rate risk involves assumptions that are inherently uncertain and, as a result, cannot precisely estimate the impact of changes in interest rates on net interest revenue, bank deposit account fees, or EVE. Actual results may differ from simulated results due to balance growth or decline and the t"
}