{
  "source_file": "shw-20250930.htm",
  "form_type": "10-Q",
  "item1_clean": null,
  "item7_clean": null,
  "item2_clean": "Item 2. MANAGEMENT’S DISCUSSION AND ANALYSIS OF\nRESULTS OF OPERATIONS AND FINANCIAL CONDITION\n(dollars in millions, except as noted and per share data)\nBACKGROUND\nThe Sherwin-Williams Company, founded in 1866, and its consolidated subsidiaries (collectively, the Company) are engaged in the development, manufacture, distribution and sale of paint, coatings and related products to professional, industrial, commercial and retail customers primarily in North and South America with additional operations in the Caribbean region and throughout Europe, Asia and Australia.\nThe Company is structured into three reportable segments - Paint Stores Group, Consumer Brands Group and Performance Coatings Group (collectively, the Reportable Segments) - and an Administrative function, which is representative of the way it is internally organized for assessing performance and making decisions regarding the allocation of resources. See Note 18 in Item 1 for further details on the Company’s Reportable Segments.\nSUMMARY\nConsolidated Net sales increased 3.2% to $6.358 billion in the quarter and increased 1.0% to $17.978 billion in the year to date period\nNet sales from stores in the Paint Stores Group open more than twelve calendar months increased 3.6% and 1.9% in the quarter and year to date period, respectively\nDiluted net income per share increased 5.3% to $3.35 per share in the quarter compared to $3.18 per share in the third quarter of 2024 and decreased 3.6% to $8.34 per share in the year to date period compared to $8.65 in the year to date period of 2024\nNet operating cash generated in the year to date period increased 6.3% to $2.359 billion, or 13.1% of Net sales\nOUTLOOK\nIn a demand environment which has remained softer for longer, we have continued to serve our customers, invest for success, control costs, take advantage of a unique competitive environment and execute on enterprise priorities. Although we face a challenging macro-environment, we will continue to execute on our differentiated strategy, Success by Design, by focusing on providing customers with differentiated solutions that make them more productive and profitable. We remain well-positioned in each of our targeted markets and continue to execute on deliberate, disciplined and targeted initiatives such as new stores and digital technologies that we believe will allow us to generate sustained and profitable above-market growth in an increasingly uncertain and competitive landscape.\nWe employ a disciplined capital deployment strategy, while maintaining a balanced approach toward driving value for our customers and returns to our shareholders. We continue to pursue business acquisitions, transactions and investments that fit our long-term growth strategy and will return value to our shareholders through the payment of dividends and the reinvestment of excess cash for share repurchases of Company stock. We have a strong liquidity position, with $241.5 million in cash and $3.131 billion of unused capacity under our credit facilities at September 30, 2025. We are, and expect to remain, in compliance with bank covenants.\nRESULTS OF OPERATIONS\nThe Company has historically experienced, and expects to continue to experience, variability in quarterly results. The results of operations for the three and nine months ended September 30, 2025 are not indicative of the results to be expected for the full year as our business is seasonal in nature, with the majority of Net sales for the Reportable Segments traditionally occurring during the second and third quarters. However, periods of economic uncertainty can alter the Company’s seasonal patterns.\nThe following discussion and analysis addresses comparisons of material changes in the condensed consolidated financial statements for the three and nine months ended September 30, 2025 and 2024.\nThree Months Ended September 30, 2025\nThree Months Ended September 30,\n\nThree Months Ended September 30, 2025\nConsolidated Cost of goods sold increased $97.7 million, or 3.1%, in the third quarter of 2025 compared to the same period in 2024 primarily due to a low-single digit increase in sales volume and unfavorable foreign currency translation.\nConsolidated Gross profit increased $98.0 million in the third quarter of 2025 compared to the same period in 2024 primarily due to higher sales volumes in the Paint Stores and Performance Coatings Groups and higher selling prices in the Paint Stores Group, partially offset by lower sales volumes in the Consumer Brands Group. Consolidated Gross profit as a percent of consolidated Net sales increased in the third quarter of 2025 to 49.2% compared to 49.1% during the same period in 2024 for these same reasons.\nThe Paint Stores Group’s gross profit in the third quarter of 2025 was higher than the same period last year by $103.0 million due primarily to higher Net sales as a result of increased selling prices and sales volume growth. The Paint Stores Group’s gross profit as a percent of Net sales was essentially flat in the third quarter of 2025 compared to the same period in 2024. The Consumer Brands Group’s gross profit decreased by $4.0 million in the third quarter of 2025 compared to the same period last year due primarily to lower Net sales, supply chain inefficiencies from decreased production volumes and restructuring expenses. The Consumer Brands Group’s gross profit as a percent of Net sales increased in the third quarter of 2025 compared to the same period in 2024 primarily due to favorable product mix. The Performance Coatings Group’s gross profit decreased $13.1 million in the third quarter of 2025 compared to the same period last year primarily due to unfavorable region and business sales mix, partially offset by higher Net sales. The Performance Coatings Group’s gross profit as a percent of Net sales decreased in the third quarter of 2025 compared to the same period last year for these same reasons.\nConsolidated Selling, general and administrative expenses (SG&A) increased $59.1 million in the third quarter of 2025 versus the same period last year primarily due to increased investments in long-term growth opportunities in Paint Stores Group, and costs related to the new global headquarters and R&D buildings. As a percent of Net sales, consolidated SG&A remained flat in the third quarter of 2025 compared to the same period last year.\nThe Paint Stores Group’s SG&A increased $48.5 million in the third quarter of 2025 compared to the same period last year primarily due to increased investments in long-term growth opportunities such as expenses for new store openings. As a percent of Net sales, SG&A decreased year-over-year. The Consumer Brands Group’s SG&A decreased $0.4 million in the third quarter of 2025 compared to the same period last year primarily due to effective cost control in the core business operations. The Performance Coatings Group’s SG&A increased $7.5 million in the third quarter of 2025 compared to the same period last year primarily due to higher employee-related costs. The Administrative function’s SG&A increased $3.5 million in the third quarter of 2025 compared to the same period last year due primarily to costs related to the new global headquarters and R&D buildings.\nOther general (income) expense - net was income of $4.7 million in the third quarter of 2025 compared to expense of $0.7 million in the same period last year primarily due to insurance recoveries related to previous asset losses at a current manufacturing site. See Note 15 in Item 1 for further details.\nInterest expense increased $13.8 million in the third quarter of 2025 compared to the same period last year. See Note 6 in Item 1 for additional information on the Company’s outstanding debt.\nOther expense (income) - net decreased $7.2 million in the third quarter of 2025 compared to the same period last year primarily due to miscellaneous expenses which occurred during the third quarter of 2024 which did not recur in the current period, partially offset by a decrease in Other income. See Note 15 in Item 1 for further details.\nNine Months Ended September 30, 2025\nConsolidated Cost of goods sold was effectively flat in the first nine months of 2025 compared to the same period in 2024 primarily due to a low-single digit decrease in sales volume and favorable foreign currency translation, offset by unfavorable business sales mix.\nConsolidated gross profit increased $181.0 million in the first nine months of 2025 compared to the same period in 2024 primarily due to higher selling prices in the Paint Stores Group, partially offset by lower sales volumes in the Paint Stores and Consumer Brands Groups and lower selling prices in the Performance Coatings Group, primarily attributable to business sales mix. Consolidated gross profit as a percent of consolidated Net sales increased in the first nine months of 2025 to 49.0% compared to 48.4% during the same period in 2024 for these same reasons.\nThe Paint Stores Group’s gross profit in the first nine months of 2025 was higher than the same period last year by $276.3 million due primarily to higher Net sales driven by higher selling prices, partially offset by a decrease in sales volume. The Paint Stores Group’s gross profit as a percent of Net sales increased in the first nine months of 2025 compared to the same period in 2024 for these same reasons. The Consumer Brands Group’s gross profit decreased by $73.8 million in the first nine months of 2025 compared to the same period last year due primarily to lower Net sales, supply chain inefficiencies from decreased production volumes and an unfavorable foreign currency related impact. The Consumer Brands Group’s gross profit as a percent of Net sales decreased in the first nine months of 2025 compared to the same period last year for these same reasons. The Performance Coatings Group’s gross profit decreased $56.5 million in the first nine months of 2025 compared to the same period last year primarily due to lower Net s"
}