{
  "source_file": "sjm-20250430.htm",
  "form_type": "10-K",
  "item1_clean": "We own many patents worldwide in addition to utilizing proprietary trade secrets, technology, know-how processes, and other intellectual property rights that are not registered.\nWe consider all of our owned and licensed intellectual property, taken as a whole, to be essential to our business.\nThe U.S. retail market segments do not experience significant seasonality, as demand for our products is generally consistent throughout the year. However, the Sweet Baked Snacks segment does experience moderate seasonality, with declines during the early winter period due to the holiday season.\nSales to Walmart Inc. and subsidiaries amounted to 33 percent of net sales in both 2025 and 2024 and 34 percent of net sales in 2023. These sales are primarily included in our U.S. retail market segments. No other customer exceeded 10 percent of net sales for any year.\nDuring 2025, our top 10 customers, collectively, accounted for approximately 60 percent of consolidated net sales. Supermarkets, warehouse clubs, and food distributors continue to consolidate, and we expect that a significant portion of our revenues will continue to be derived from a limited number of customers. Although the loss of any large customer for an extended length of time could negatively impact our sales and profits, we do not anticipate that this will occur to a significant extent due to strong consumer demand for our brands.\nGovernment Business:\nNo material portion of our business is subject to renegotiation of profits or termination of contracts at the election of the government.\nOur business is highly competitive as all of our brands compete with other branded products as well as private label products. In order to remain competitive, companies in the food industry need to consider emerging consumer preferences, technological advances, product and packaging innovations, and the growth of certain retail channels, such as the\ne-commerce market. The primary ways in which products and brands are distinguished include brand recognition, product quality, price, packaging, new product introductions, nutritional value, convenience, advertising, promotion, and the ability to identify and satisfy consumer preferences. Positive factors pertaining to our competitive position include well-recognized brands, high-quality products, consumer trust, experienced brand and category management, varied product offerings, product innovation, responsive customer service, and an integrated distribution network.\nThe packaged foods industry has been challenged by a general long-term decline in sales volume in the center of the store. Certain evolving consumer trends have contributed to the longer-term decline, such as a heightened focus on health and wellness, an increased desire for fresh foods, and the growing impact of social media and e-commerce on consumer behavior. To address these dynamics, we continue to focus on innovation with an increased emphasis on products that satisfy evolving consumer trends. However, in recent years, there has been an increase in sales primarily driven by changes in consumer behaviors, including the increased frequency of employees working from home.\nIn addition, private label continues to be a competitor in the categories in which we compete, partially due to improvements in private label quality, the increased emphasis of store brands by retailers in an effort to cultivate customer loyalty, and a movement toward lower-priced offerings during economic downturns or instances of increased inflationary pressures. For the U.S. retail market segments, private label held a 15.2 dollar average market share during the 52 weeks ended April 20, 2025, for the categories in which we compete, as compared to a 13.7 dollar average market share during the same period in the prior year. We believe that both private label and leading brands play an important role in the categories in which we compete, appealing to different consumer segments. We closely monitor the price gap, or price premium, between our brands and private label brands, with the view that value is about more than price and the expectation that number one brands will continue to be an integral part of consumers’ shopping baskets.\nOur primary brands and major competitors as of April 30, 2025, are listed below.\nOur Primary Products\nMainstream roast and ground coffee\n(A)\n\nThe J. M. Smucker Company (“Company,” “registrant,” “we,” “us,” or “our”), often referred to as Smucker’s (a registered trademark), was established in 1897 and incorporated in Ohio in 1921. We operate principally in one industry, the manufacturing and marketing of branded food and beverage products on a worldwide basis, although the majority of our sales are in the United States (“U.S.”). Operations outside the U.S. are principally in Canada, although our products are exported to other countries as well. Net sales outside the U.S., subject to foreign currency translation, represented 4 percent of consolidated net sales for 2025. Our branded food and beverage products include a strong portfolio of trusted, iconic, market-leading brands that are sold to consumers primarily through retail outlets in North America.\nWe have four reportable segments: U.S. Retail Coffee, U.S. Retail Frozen Handheld and Spreads, and U.S. Retail Pet Foods (the “U.S. retail market segments”), and Sweet Baked Snacks. These segments in total comprised 86 percent of consolidated net sales in 2025 and represent a major portion of our strategic focus – the sale of branded food and beverage products with leadership positions to consumers through retail outlets in North America. Additionally, we sell products both domestically and in foreign countries through retail channels and foodservice distributors and operators through the Sweet Baked Snacks segment and the combined International and Away From Home operating segments. For additional information on our reportable segments, see Note 5: Reportable Segments.\nOn March 3, 2025, we sold certain Sweet Baked Snacks value brands to JTM Foods, LLC (“JTM”). The transaction included certain trademarks and licenses, a manufacturing facility in Chicago, Illinois, and approximately 400 employees who support the business. Under our ownership, these Sweet Baked Snacks value brands generated net sales of approximately $48.4 and $30.0 in 2025 and 2024, respectively, which were included in the Sweet Baked Snacks segment.\nOn December 2, 2024, we sold the\nbusiness to Second Nature Brands (“Second Nature”). The transaction included products sold under the\nbrand, inclusive of certain trademarks, a leased manufacturing facility in Burlington, Ontario, and approximately 300 employees who supported the business. Under our ownership, the\nbusiness generated net sales of approximately $86.3 and $65.0 in 2025 and 2024, respectively, which were included in the Sweet Baked Snacks segment.\nOn January 2, 2024, we sold the Canada condiment business to TreeHouse Foods, Inc. (“TreeHouse Foods”). The transaction included\npickled onions brands, inclusive of certain trademarks. Under our ownership, these brands generated net sales of $43.8 and $61.6 in 2024 and 2023, respectively, which were included in the International operating segment.\nOn November 7, 2023, we completed a cash and stock transaction to acquire Hostess Brands, Inc. (“Hostess Brands”), a manufacturer and marketer of sweet baked goods brands and included\ncookie brand at the acquisition date.\nOn November 1, 2023, we sold the\nbusiness to Second Nature. The transaction included products sold under the\nbrand, inclusive of certain trademarks and licensing agreements, a leased manufacturing facility in Seattle, Washington, and approximately 100 employees who supported the brand. Under our ownership, the\nbrand generated net sales of $24.1 and $48.4 in 2024 and 2023, respectively, primarily included in the U.S. Retail Frozen Handheld and Spreads segment.\nOn April 28, 2023, we sold certain pet food brands to Post Holdings, Inc. (“Post”). The transaction included the\nbrands, as well as the private label pet food business, inclusive of certain trademarks and licensing agreements, manufacturing and distribution facilities in Bloomsburg, Pennsylvania, manufacturing facilities in Meadville, Pennsylvania and Lawrence, Kansas, and approximately 1,100 employees who supported these pet food brands. Under our ownership, these brands generated net sales of $1.5 billion in 2023, primarily included in the U.S. Retail Pet Foods segment.\nFor additional information on the acquisition and divestitures, see Note 2: Acquisition and Note 3: Divestitures.\nIn 2025, our principal products were coffee, sweet baked goods, pet snacks, frozen handheld products, peanut butter, cat food, fruit spreads, portion control products, toppings and syrups, and baking mixes and ingredients. Product sales information for the years 2025, 2024, and 2023 is included within Note 5: Reportable Segments.\nProducts within our U.S. retail market segments are primarily sold through a combination of direct sales and brokers to food retailers, club stores, discount and dollar stores, online retailers, pet specialty stores, drug stores, military commissaries, mass merchandisers, and distributors. The Sweet Baked Snacks segment includes products distributed across all channels, both domestically and in foreign countries, such as supermarket chains, convenience stores, national mass retailers, discount and dollar stores, club stores, the vending channel, drug stores, and military commissaries. International and Away From Home includes the sale of all products that are distributed in foreign countries through retail channels, as well as domestically and in foreign countries through foodservice distributors and operators (e.g., healthcare operators, restaurants, educational institutions, offices, lodging and gaming establishments, and convenience stores).\nSources and Availability of Raw Materials:\nThe raw materials used in each of our segments are primarily commodities, agricultural-based products, and packaging materials. Green coffee, peanuts, flour, sugar, oils and fats, fruit, and other ingredients are obtained from various suppliers. The availability, quality, and cost of many of these commodities have fluctuated, and may continue to fluctuate over time, partially driven by the elevated commodity and supply chain costs we have continued to experience in 2025. We actively monitor changes in commodity and supply chain costs, and to mitigate the fluctuation of costs, we may be required to implement material price increases or decreases across our business. Futures, basis, options, and fixed-price contracts are used to manage price volatility for a significant portion of our commodity costs. Green coffee, along with certain other raw materials, is sourced solely from foreign countries, and its supply and price is subject to high volatility due to factors such as weather, global supply and demand, product scarcity, plant disease, investor speculation, geopolitical conflicts, changes in governmental agricultural and energy policies and regulations, and political and economic conditions in the source countries. We source peanuts, flour, sugar, oils and fats, and fruit mainly from North America. The principal packaging materials we use are plastic, glass, metal cans, caps, carton board, and corrugate.\n\nPrivate label brands\n(A) Identifies the current market leader within the product category. In certain categories, the market leader is not identified as two or more brands compete for the largest share.\nGovernment Regulations:\nOur operations are subject to various regulations and laws administered by federal, state, and local government agencies in the U.S., including the U.S. Food and Drug Administration (the “FDA”), U.S. Federal Trade Commission, U.S. Departments of Agriculture, Commerce, and Labor, and U.S. Environmental Protection Agency. Additionally, we are subject to regulations and laws administered by",
  "item7_clean": "in 2021. Net cash provided by operating activities decreased at a compound annual growth rate of approximately 1 percent over the past five years. Our cash deployment strategy is to balance reinvesting in our business through acquisitions and capital expenditures with returning cash to our shareholders through the payment of dividends and share repurchases. Our deployment strategy also includes a significant focus on debt repayment.\nOn November 7, 2023, we completed a cash and stock transaction to acquire Hostess Brands. The total purchase consideration in connection with the acquisition was $5.4 billion, which reflects an exchange offer of all outstanding shares of Hostess Brands common stock at a price of $34.25 per share, consisting of $30.00 in cash and 0.03002 shares of our common shares, based on the closing stock price on September 8, 2023, that were exchanged for each share of Hostess Brands common stock as of the transaction date. The purchase price included the issuance of approximately 4.0 million of our common shares to Hostess Brands’ shareholders, valued at $450.2. In addition, we paid $3.9 billion in cash, net of cash acquired, and assumed $991.0 of debt from Hostess Brands and $67.8 of an other debt-like item, reflecting consideration transferred for the cash payment of Hostess Brands’ employee equity awards. New debt of $5.0 billion was borrowed, consisting of $3.5 billion in Senior Notes, an $800.0 senior unsecured delayed-draw Term Loan Credit Agreement (“Term Loan”), and $700.0 of short-term borrowings under our commercial paper program to partially fund the transaction and pay off the debt assumed as part of the acquisition. Hostess Brands is a manufacturer and marketer of sweet baked goods brands including\ncookie brand at the acquisition date. In addition to its headquarters in Lenexa, Kansas, the transaction included six manufacturing facilities located in Emporia, Kansas; Burlington, Ontario; Chicago, Illinois; Columbus, Georgia; Indianapolis, Indiana; and Arkadelphia, Arkansas, a distribution facility in Edgerton, Kansas, and a commercial center of excellence in Chicago, Illinois at the acquisition date. During 2025, the acquired business contributed net sales of $1,178.8. We anticipate cost synergies of approximately $100.0, which are expected to be achieved by the end of 2026. To date, we have achieved cost synergies of approximately $86.0, of which approximately $75.0 was achieved during 2025. For additional information, refer to Note 2: Acquisition.\nOn March 3, 2025, we sold certain Sweet Baked Snacks value brands to JTM. The transaction included certain trademarks and licenses, a manufacturing facility in Chicago, Illinois, and approximately 400 employees who supported the business. Under our ownership, these Sweet Baked Snacks value brands generated net sales of approximately $48.4 and $30.0 in 2025 and 2024, respectively, which were included in the Sweet Baked Snacks segment. Net proceeds from the divestiture were $34.6, inclusive of the final working capital adjustment and cash transaction costs. We recognized a pre-tax loss of $44.2 during 2025, within loss (gain) on divestitures – net in the Statement of Consolidated Income (Loss) and Statement of Consolidated Cash Flows.\nOn December 2, 2024, we sold the\nbusiness to Second Nature. The transaction included products sold under the\nbrand, inclusive of certain trademarks, a leased manufacturing facility in Burlington, Ontario, and approximately 300 employees who supported the business. Under our ownership, the\nbusiness generated net sales of approximately $86.3 and $65.0 in 2025 and 2024, respectively, which were included in the Sweet Baked Snacks segment. Net proceeds from the divestiture were $291.4, inclusive of the final working capital adjustment and cash transaction costs. We recognized a pre-tax loss of $265.9 during 2025, within loss (gain) on divestitures – net in the Statement of Consolidated Income (Loss) and Statement of Consolidated Cash Flows.\nOn January 2, 2024, we sold the Canada condiment business to TreeHouse Foods. The transaction included\npickled onions brands, inclusive of certain trademarks. Under\nour ownership, these brands generated net sales of $43.8 and $61.6 in 2024 and 2023, respectively, which were included in the International operating segment. Final net proceeds from the divestiture were $25.3, inclusive of a working capital adjustment and cash transaction costs. Upon completion of this transaction during 2024, we recognized a pre-tax loss of $5.7, within loss (gain) on divestitures – net in the Statement of Consolidated Income (Loss) and Statement of Consolidated Cash Flows.\nOn November 1, 2023, we sold the\nbusiness to Second Nature. The transaction included products sold under the\nbrand, inclusive of certain trademarks and licensing agreements, a leased manufacturing facility in Seattle, Washington, and approximately 100 employees who supported the brand. Under our ownership, the\nbrand generated net sales of $24.1 and $48.4 in 2024 and 2023, respectively, primarily included in the U.S. Retail Frozen Handheld and Spreads segment. Final net proceeds from the divestiture were $31.6, inclusive of a working capital adjustment and cash transaction costs. Upon completion of this transaction during 2024, we recognized a pre-tax loss of $6.7, within loss (gain) on divestitures – net in the Statement of Consolidated Income (Loss) and Statement of Consolidated Cash Flows.\nOn April 28, 2023, we sold certain pet food brands to Post. The transaction included the\nbrands, as well as the private label pet food business, inclusive of certain trademarks and licensing agreements, manufacturing and distribution facilities in Bloomsburg, Pennsylvania, manufacturing facilities in Meadville, Pennsylvania and Lawrence, Kansas, and approximately 1,100 employees who supported these pet food brands. Under our ownership, these brands generated net sales of $1.5 billion in 2023, primarily included in the U.S. Retail Pet Foods segment. Final net proceeds from the divestiture were $1.2 billion, consisting of $683.9 in cash, net of a working capital adjustment and cash transaction costs, and approximately 5.4 million shares of Post common stock, valued at $491.6 at the close of the transaction. We recognized a pre-tax loss of $1.0 billion upon completion of this transaction during 2023, within loss (gain) on divestitures – net in the Statement of Consolidated Income (Loss) and Statement of Consolidated Cash Flows. During 2024, we finalized the working capital adjustment and transaction costs, which resulted in an immaterial adjustment to the pre-tax loss. Furthermore, during 2024, we entered into equity forward derivative transactions under an agreement with an unrelated third-party to facilitate the forward sale of the Post common stock. All 5.4 million shares of Post common stock were settled for $466.3 under the equity forward contract on November 15, 2023. For additional information, see Note 10: Derivative Financial Instruments.\nFor additional information, refer to Note 3: Divestitures.\nTrends Affecting our Business\nDuring 2025, we continued to experience input cost inflation and a dynamic and evolving macroeconomic environment, inclusive of tariffs, regulatory and policy changes, and changes in consumer behaviors, which we anticipate will persist into 2026. Further, the higher costs have required price increases across our business, and we anticipate the price elasticity of demand could remain elevated into 2026 as consumers continue to experience broader inflationary pressures and are selective in their spending. In response to the inflationary pressures, we continue to focus on the delivery of our company-wide transformation initiative to deliberately translate our continuous improvement mindset into sustainable productivity initiatives in order to grow our profit margins and reinvest in the Company to enable future growth and cost savings.\nIn addition, it is possible significant disruptions in our supply chain could occur if certain geopolitical events continue to impact markets around the world, including the impact of potential shipping delays due to supply and demand imbalances, as well as labor shortages and tariffs. We also continue to work closely with our customers and external business partners, taking additional actions to ensure safety, business continuity, and maximize product availability. We have maintained production at all our facilities and availability of appointments at distribution centers. Furthermore, we have implemented measures to manage order volumes to ensure a consistent supply across our retail partners during periods of high demand. However, to the extent that high demand levels or supply chain disruptions delay order fulfillment, we may experience volume loss and elevated penalties. Although we do not have any operations in Russia, Ukraine, Israel, Palestine, China or Taiwan, we continue to monitor the environment for any significant escalation or expansion of economic or supply chain disruptions, including broader inflationary costs and the impact of tariffs, as well as regional or global economic recessions.\nOverall, broad-based supply chain disruptions and the impact of inflation remain uncertain. We will continue to evaluate the nature and extent to which supply chain disruptions and inflation will impact our business, supply chain, including labor availability and attrition, results of operations, financial condition, and liquidity.\nResults of Operations\n\nNet cash provided by (used for) operating activities\nNet cash provided by (used for) investing activities\nNet cash provided by (used for) financing activities\nNet cash provided by (used for) operating activities\nAdditions to property, plant, and equipment\n(A)\n(A)\nFree cash flow is a non-GAAP financial measure used by management to evaluate the amount of cash available for debt repayment, dividend distribution, acquisition opportunities, share repurchases, and other corporate purposes.\nThe $19.0 decrease in cash provided by operating activities in 2025 was primarily driven by higher working capital requirements in 2025 and lapping the $42.5 proceeds received from settlement of the interest rate contracts assumed as part of the acquisition of Hostess Brands in the prior year, partially offset by higher net income (loss) adjusted for noncash items in the current year. The cash required to fund working capital increased compared to the prior year primarily driven by an increase in cash used for accrued liabilities reflecting timing of interest payments and a decrease in the payable for transition s\nervices agreements entered into in connection with the divestitures and inventories reflecting higher inventory levels and input cost inflation in the current year. These uses of cash were partially offset by an increase in cash from trade receivables due to timing of sales and cash collections and accounts payable due to timing of spend and cash payments.\nCash used for investing activities in 2025 consisted primarily of $393.8 in capital expenditures, reflecting our investments in the new\nsandwiches manufacturing and distribution facilities in McCalla, Alabama, as well as plant maintenance across our facilities, and also included an increase of $39.4 in our derivative cash margin account balances. These uses of cash for 2025 were partially offset by net proceeds received of $326.0 from the divestiture of certain Sweet Baked Snacks value brands and the\nbusiness. Cash used for investing activities in 2024 consisted primarily of $3.9 billion related to the acquisition of Hostess Brands, including $67.8 of consideration transferred for the cash payment of Hostess Brands\nemployee equity awards, and $586.5 in capital expenditures, primarily driven by investments in\nsandwiches to support the new manufacturing and distribution facilities in McCalla, Alabama, as well as plant maintenance across our facilities. These uses of cash for 2024 were partially offset by proceeds of $466.3 received from the settlement of our equity investment in Post common stock and net proceeds received of $56.3, primarily from the divested\nand Canada condiment businesses, and a decrease of $18.9 in our derivative cash margin account balances.\nCash used for financing activities in 2025 consisted primarily of long-term debt repayments of $1,300.0 and dividend payments of $455.4, partially offset by $650.0 of proceeds from long-term debt and a net increase in short-term borrowings of $19.2. Cash provided by financing activities in 2024 consisted primarily of proceeds from long-term debt of $4.3 billion to partially finance the acquisition of Hostess Brands and a net increase in short-term borrowings of $578.2. These proceeds were partially offset by the $991.0 repayment of Hostess Brands’ debt assumed, the $800.0 Term Loan prepayment, dividend payments of $437.5, purchase of treasury shares of $372.8, and an $86.4 payment to terminate the tax receivable agreement assumed with the acquisition of Hostess Brands.\nSupplier Financing Program\nAs part of ongoing efforts to maximize working capital, we work with our suppliers to optimize our terms and conditions, which includes the extension of payment terms. Payment terms with our suppliers, which we deem to be commercially reasonable, range from 0 to 180 days. We have an agreement with a third-party administrator to provide an accounts payable tracking system and facilitate a supplier financing program, which allows participating suppliers the ability to monitor and voluntarily elect to sell our payment obligations to a designated third-party financial institution. Participating suppliers can sell one or more of our payment obligations at their sole discretion, and our rights and obligations to our suppliers are not impacted. We have no economic interest in a supplier’s decision to enter into these agreements. Our rights and obligations to our suppliers, including amounts due and scheduled payment terms, are not impacted by our suppliers’ decisions to sell amounts under these arrangements. As of April 30, 2025 and 2024, $340.4 and $384.9 of our outstanding payment obligations, respectively, were elected and sold to a financial institution by participating suppliers. During 2025 and 2024, we paid $1,562.3 and $1,685.5, respectively, to a financial institution for payment obligations that were settled through the supplier financing program.\nWe, like other food manufacturers, are from time to time subject to various administrative, regulatory, and other legal proceedings arising in the ordinary course of business. We are currently a defendant in a variety of such legal proceedings, and while we cannot predict with certainty the ultimate results of these proceedings or potential settlements associated with these or other matters, we have accrued losses for certain contingent liabilities that we have determined are probable and reasonably estimable at April 30, 2025. Based on the information known to date, with the exception of the matters discussed below, we do not believe the final outcome of these proceedings will have a material adverse effect on our financial position, results of operations, or cash flows.\nClass Action Lawsuits:\nWe are defendants in a series of putative class action lawsuits that were transferred to the United States District Court for the Western District of Missouri for coordinated pre-trial proceedings. The plaintiffs assert claims arising under various state laws for false advertising, consumer protection, deceptive and unfair trade practices, and similar statutes. Their claims are premised on allegations that we have misrepresented the number of servings that can be made from various canisters of\ncoffee on the packaging for those products. The outcome and the financial impact of these cases, if any, cannot be predicted at this time. Accordingly, no loss contingency has been recorded for these m",
  "item2_clean": null
}