{
  "source_file": "slb-20250930.htm",
  "form_type": "10-Q",
  "item1_clean": null,
  "item7_clean": null,
  "item2_clean": "Capital investments (consisting of capital expenditures, APS investments and exploration data capitalized) were $1.7 billion during the first nine months of 2025 compared to $1.9 billion during the first nine months of 2024. Capital investments for the full year 2025 are expected to be approximately $2.4 billion.\nIn January 2025, SLB announced a 3.6% increase to its quarterly cash dividend from $0.275 per share of outstanding common stock to $0.285 per share, beginning with the dividend payable in April 2025. Dividends paid during the first nine months of 2025 and 2024 were $1.2 billion and $1.1 billion, respectively.\nDuring the third quarter of 2025, SLB repaid its $0.5 billion 1.40% Senior Notes due 2025.\nDuring the third quarter of 2025, SLB fully repaid all the $0.6 billion of debt assumed in connection with the acquisition of ChampionX.\nDuring the third quarter and concurrent with the close of the ChampionX acquisition, the ChampionX Drilling Technologies business was disposed of and SLB received $286 million of proceeds.\nAs of September 30, 2025, SLB had cumulatively repurchased approximately $5.9 billion of SLB common stock under its $10 billion share repurchase program.\n\nDuring the second quarter of 2025, SLB completed the sale of its interest in the Palliser APS project in Canada in exchange for net cash proceeds of $338 million, of which $22 million were received in the third quarter of 2025. SLB recorded revenue of approximately $0.2 billion relating to this project during the six months ended June 30, 2025 and approximately $0.5 billion during 2024.\nDuring the second quarter of 2024, SLB issued $500 million of 5.00% Senior Notes due 2027, $500 million of 5.00% Senior Notes due 2029, and $500 million of 5.00% Senior Notes due 2034.\n\nThird-quarter 2025 revenue of $8.9 billion increased $382 million, or 4%, compared to the second quarter of 2025. The third-quarter revenue reflected two months of activity from the acquired ChampionX businesses (see Note 4 to the\nConsolidated Financial Statements\n), which contributed $579 million of revenue. This increase was largely offset by the loss of approximately $100 million of APS revenue due to production interruption arising from a pipeline disruption in Ecuador and the absence of $97 million of revenue following the divestiture of SLB’s interest in the Palliser APS project in Canada at the end of the second quarter. After adjusting for the revenue contribution from ChampionX and the absence of revenue from the two APS projects, revenue was essentially flat on a sequential basis.\n\nSLB previously reported its results on the basis of four Divisions: Digital & Integration, Reservoir Performance, Well Construction, and Production Systems. Commencing the third quarter of 2025, SLB's Digital business is reported as a separate Division. Additionally, SLB's Asset Performance Solutions (\"APS\"), Data Center Solutions and SLB Capturi, businesses are now reported in the All Other category. The acquired ChampionX's businesses are predominantly reported in SLB's Production Systems Division, with the exception of its digital business which is reported in SLB's Digital Division. Prior periods have been recast to conform to the current presentation.\n\nComprised principally of certain corporate expenses not allocated to the segments, stock-based compensation costs, amortization expense associated with certain intangible assets, certain centrally managed initiatives and other nonoperating items.\nInterest income excludes amounts that are included in the segments’ income ($- million in both the third quarter of 2025; $- in the second quarter of 2025).\nInterest expense excludes amounts that are included in the segments’ income ($- million in the third quarter of 2025; $3 million in the second quarter of 2025).\nCharges and credits are described in detail in Note 2 to the\nConsolidated Financial Statements.\n\nProduction Systems pretax operating margin of 16% was essentially flat year on year.\nRevenue of $1.5 billion was flat year on year due to\nlower APS revenue following the divestiture of SLB’s interest in the Palliser asset in Canada and the full month of production interruption arising from the pipeline disruption in Ecuador offset by a 140% increase in Data Center Solutions revenue and the effect of the acquisition of SLB Capturi in the second quarter of 2024.\n\nWell Construction pretax operating margin of 19% was essentially flat sequentially.\nProduction Systems revenue of $3.5 billion increased 18% sequentially, reflecting two months of activity from the acquired ChampionX production chemicals and artificial lift businesses, which contributed $575 million of revenue. Excluding the impact of this acquisition, Production Systems third-quarter 2025 revenue decreased 1% sequentially.\n\nThe effective tax rate was 23% for the third quarter of 2025 as compared to 18% for the second quarter of 2025, and 21% for the first nine months of 2025 as compared to 19% for the same period of 2024. These increases in the effective tax rate were primarily due to the charges and credits described in Note 2.\n\nIn this context, SLB foresees revenue growth in the fourth quarter driven by the international markets, Digital and a full quarter of activity from the acquired ChampionX businesses.\n\n“Free cash flow” represents cash flow from operations less capital expenditures, APS investments and exploration data costs capitalized. Management believes that free cash flow is an important liquidity measure for the company and that it is useful to investors and management as a measure of our ability to generate cash. Once business needs and obligations are met, this cash can be used to reinvest in the company for future growth or to return to shareholders through dividend payments or share repurchases. Free cash flow does not represent the residual cash flow available for discretionary expenditures. Free cash flow is a non-GAAP financial measure that should be considered in addition to, not as a substitute for or superior to, cash flow from operations.\n\nThis performance was\nachieved against the backdrop of a fully supplied oil market, an uncertain geopolitical environment and subdued commodity prices. In this context, international markets — aside from a few key countries — are proving resilient, with several countries across the Middle East and Asia continuing to exhibit growth. Looking ahead, SLB expects OPEC+ production releases to support investment across many countries in these regions where it is well established\nIt is more likely that the international markets will lead an activity rebound when supply and demand rebalance, supported by sustained investment for oil capacity, gas expansion projects, and a constructive outlook for deepwater. SLB is well positioned to benefit from such a recovery.\n\nSLB has a global footprint in more than 100 countries. As of September 30, 2025, only two of those countries (the United States and Mexico) individually accounted for greater than 10% of SLB’s net receivable balance. As of September 30, 2025, the United States and Mexico each represented 11% of SLB's net accounts receivable balance. While SLB has recently experienced delays in payment from its primary customer in Mexico, these receivables are not in dispute and SLB has not historically had any material write-offs due to uncollectible accounts receivable relating to this customer.\nFORWARD-LOOKING STATEMENTS\n\nComprised principally of certain corporate expenses not allocated to the segments, stock-based compensation costs, amortization expense associated with certain intangible assets, certain centrally managed initiatives and other nonoperating items.\nInterest income excludes amounts that are included in the segments’ income ($1 million in 2025; $31 million in 2024).\nInterest expense excludes amounts that are included in the segments’ income ($7 million in 2025; $13 million in 2024).\nCharges and credits are described in detail in Note 2 to the\nConsolidated Financial Statements\n\nProduction Systems pretax operating margin of 16% contracted 66 bps sequentially driven by an unfavorable geographical mix in completions and lower subsea margins partially offset by accretive margin contribution from ChampionX which generated $106 million of pretax operating income.\nRevenue of $397 million declined 32% sequentially primarily due to lower APS revenue following the divestiture of SLB's interest in the Palliser asset in Canada and the full month of production interruption arising from the pipeline disruption in Ecuador.\n\n“Net debt” represents gross debt less cash and short-term investments. Management believes that Net debt provides useful information to investors and management regarding the level of SLB’s indebtedness by reflecting cash and investments that could be used to repay debt. Net debt is a non-GAAP financial measure that should be considered in addition to, not as a substitute for or superior to, total debt.\nIncludes depreciation of fixed assets and amortization of intangible assets, exploration data costs, and APS investments.\n\nWell Construction pretax operating margin of 19% declined 219 bps year on year driven by the widespread activity reductions.\nProduction Systems revenue of $9.2 billion increased 5% year on year\nreflecting two months of activity from the acquired ChampionX production chemicals and artificial lift businesses, which contributed $575 million of revenue. Excluding the impact of this acquisition, Production Systems revenue decreased 2% year on year primarily due to decreased sales of subsea production systems.\n\nReservoir Performance pretax operating margin of 18% contracted 226 bps year on year due to the lower evaluation and stimulation activity.\nWell Construction revenue of $8.9 billion decreased 12% year on year driven by a broad reduction in drilling activity both internationally, mainly in Mexico, Saudi Arabia, and offshore Africa, and in North America.\n\nAs of September 30, 2025, SLB had $3.6 "
}