{
  "source_file": "slb-20241231.htm",
  "form_type": "10-K",
  "item1_clean": null,
  "item7_clean": "“Free cash flow” represents cash flow from operations less capital expenditures, APS investments and exploration data costs capitalized. Management believes that free cash flow is an important liquidity measure for the company and that it is useful to investors and management as a measure of our ability to generate cash. Once business needs and obligations are met, this cash can be used to reinvest in the company for future growth or to return to shareholders through dividend payments or share repurchases. Free cash flow does not represent the residual cash flow available for discretionary expenditures. Free cash flow is a non-GAAP financial measure that should be considered in addition to, not as a substitute for or superior to, cash flow from operations.\n\n2024 was a strong year for SLB as we successfully navigated evolving market conditions to deliver revenue growth, margin expansion, and solid free cash flow. Year on year, revenue increased by 10% and pretax segment operating income grew by 12%, while we generated $6.6 billion in cash flow from operations and $4.0 billion in free cash flow, enabling us to return $3.3 billion to shareholders and reduce net debt by $571 million. These results demonstrate SLB’s ability to deliver consistent financial performance despite moderating upstream investment growth, driven by our global scale, unmatched digital offerings and ongoing focus on cost optimization.\n\nLong-lived assets, including fixed assets, intangible assets, and investments in APS projects, are reviewed for impairment whenever events or changes in circumstances indicate that the carrying value may not be recoverable. In reviewing for impairment, the carrying value of such assets is compared to the estimated undiscounted future cash flows expected from the use of the assets and their eventual disposition. If such cash flows are not sufficient to support the asset’s recorded value, an impairment charge is recognized to reduce the carrying value of the long-lived asset to its estimated fair value. The determination of future cash flows as well as the estimated fair value of long-lived assets involves significant estimates on the part of management. If there is a material change in economic conditions or other circumstances influencing the estimate of future cash flows or fair value, SLB could be required to recognize impairment charges in the future.\n\nInternational revenue grew by 12% year on year. Excluding the contribution of the acquired Aker subsea business, international revenue increased 7% primarily driven by higher activity in the Middle East & Asia. North America revenue decreased 1% due to lower drilling in US land.\n\nComprised principally of certain corporate expenses not allocated to the segments, stock-based compensation costs, amortization expense associated with certain intangible assets, certain centrally managed initiatives, and other nonoperating items.\n\nComprised principally of certain corporate expenses not allocated to the segments, stock-based compensation costs, amortization expense associated with certain intangible assets, certain centrally managed initiatives, and other nonoperating items.\n\nWell Construction revenue of $13.4 billion decreased 1% year on year. North America revenue declined 13% due to lower drilling activity in US land largely offset by a 2% increase in international revenue, primarily in the Middle East & Asia.\n\nReservoir Performance pretax operating margin of 20% expanded 99 bps year on year due to improved profitability in the international markets driven by higher activity and improved pricing from increased technology intensity.\n\nDigital & Integration pretax operating margin of 33% increased 67 bps year on year primarily due to the growth in digital revenue partially offset by effects of higher APS amortization expense and lower gas prices.\n\nProduction Systems pretax operating margin of 16% decreased 93 bps sequentially primarily due to lower profitability in subsea production systems.\n\nWell Construction pretax operating margin of 21% decreased 59 bps year on year driven by the reduced activity in North America.\n\nItem 7. Management’s Discussion and Analysis of\nFinancial Condition and Results of Operations.\n\nInternational revenue of $7.5 billion increased 1% sequentially driven by the Middle East & Asia and Europe & Africa. The Middle East & Asia grew 2% sequentially driven by strong activity in the United Arab Emirates, higher drilling in Egypt, and increased stimulation, intervention, and evaluation activity in Qatar. These gains were offset by weaker performance in Saudi Arabia and Australia. Europe & Africa also grew 2% sequentially largely driven by increased activity in Europe and North Africa. Revenue in Latin America declined 3% sequentially primarily due to reduced drilling activity in Mexico.\n\nThe expected rate of return for SLB’s retirement benefit plans represents the long-term average rate of return expected to be earned on plan assets based on expectations regarding future rates of return for the portfolio considering the asset allocation and related historical rate of return. The average expected rate of return on plan assets for the United States pension plans was 6.00% in both 2024 and 2023. The weighted average expected rate of return on plan assets for the international pension plans was 5.91% in 2024 and 6.00% in 2023. A higher expected rate of return decreases pension expense.\n\nThe estimate of total project costs has a significant impact on both the amount of revenue recognized as well as the related profit on a project. Revenue and profits on contracts can also be significantly affected by change orders and claims. Profits are recognized based on the estimated project profit multiplied by the percentage complete. Due to the nature of these projects, adjustments to estimates of contract revenue and total contract costs are often required as work progresses. Any expected losses on a project are recorded in full in the period in which they become probable.\n\nSLB recognizes revenue for certain long-term construction-type contracts over time. These contracts involve significant design and engineering efforts in order to satisfy custom designs for customer-specific applications. Under this method, revenue is recognized as work progresses on each contract. Progress is measured by the ratio of actual costs incurred to date on the project in relation to total estimated project costs. Approximately 9% of SLB’s revenue in 2024, 6% in 2023, and 5% in 2022, was recognized under this method.\n\nSLB conducts business in more than 100 tax jurisdictions, a number of which have tax laws that are not fully defined and are evolving. SLB’s tax filings are subject to regular audits by the tax authorities. These audits may result in assessments for additional taxes that are resolved with the authorities or, potentially, through the courts. SLB recognizes the impact of a tax position in its financial statements if that position is more likely than not of being sustained on audit, based on the technical merits of the position. Tax liabilities are recorded based on estimates of additional taxes that will be due upon the conclusion of these audits. Estimates of these tax liabilities are judgmental and are made based upon prior experience and are updated in light of changes in facts and circumstances. However, due to the uncertain and complex application of tax regulations, the ultimate resolution of audits may result in liabilities that could be materially different from these estimates. In such an event, SLB will record additional tax expense or tax benefit in the period in which such resolution occurs.\n\nOur full-year results were highlighted by 12% international revenue growth. This performance was led by the Middle East & Asia and Europe & Africa, which grew 18% and 13%, respectively. The Middle East & Asia achieved record revenues, while growth in Europe & Africa was bolstered by the Aker subsea business, which was acquired in the fourth quarter of 2023. Excluding this acquired business, international revenue increased 7% year over year, outperforming the rig count over the same period.\n\nSLB’s pension and postretirement benefit obligations are described in detail in Note 17 to the\nConsolidated Financial Statements\n. The obligations and related costs are calculated using actuarial concepts, which include critical assumptions related to the discount rate and the expected rate of return on plan assets. These assumptions are important elements of expense and/or liability measurement and are updated on an annual basis, or upon the occurrence of significant events.\n\nGiven our confidence in the business outlook and our ability to continue generating strong cash flows, in January 2025 our Board of Directors approved a 3.6% increase to our quarterly dividend. Additionally, we entered into accelerated share repurchase transactions to repurchase $2.3 billion of SLB common stock. This positions us to increase total return to shareholders, in the form of dividends and share repurchases, from $3.3 billion in 2024 to at least $4 billion in 2025.\n\nOur Core divisions — Reservoir Performance, Well Construction and Production Systems — delivered 9% revenue growth compared to the prior year, led by 24% growth in Production Systems, largely due to the subsea acquisition. Production Systems grew 9% organically due to double-digit increases in surface systems, completions and artificial lift. Reservoir Performance also delivered 9% growth, underpinned by strong stimulation and intervention activity in the production space.\n\nIn January 2024, SLB announced a 10% increase to its quarterly cash dividend from $0.25 per share of outstanding common stock to $0.275 per share, beginning with the dividend paid in April 2024. In January 2023, SLB announced a 43% increase to its quarterly cash dividend from $0.175 per share of outstanding common stock to $0.25 per share, beginning with the dividend paid in April 2023. Dividends paid during 2024 and 2023 were $1.5 billion and $1.3 billion, respectively.\n\nDigital & Integration revenue increased 10% year on year, driven by 20% growth in digital, which reached $2.44 billion for the year. Accelerated adoption of our digital technologies marked a milestone year, highlighted by strategic collaborations with cross-industry leaders, the launch of the Lumi™ data and AI platform, new Performance Live™ centers to enable remote operations, and the achievement of fully autonomous drilling operations.\n\nFourth-quarter revenue of $9.3 billion increased 1% sequentially, driven by digital sales in North America and higher activity in the Middle East, Europe and North Africa. On a divisional basis, Digital & Integration led the growth, driven by increased demand for digital products and solutions, while Production Systems benefited from strong backlog conversion as customers continued to invest in maximizing recovery from existing assets.\n\n“Net debt” represents gross debt less cash and short-term investments. Management believes that Net debt provides useful information to investors and management regarding the level of SLB’s indebtedness by reflecting cash and investments that could be used to repay debt. Net debt is a non-GAAP financial measure that should be considered in addition to, not as a substitute for or superior to, total debt.\n\nThe preparation of financial statements and related disclosures in conformity with accounting principles generally accepted in the United States requires SLB to make estimates and assumptions that affect the reported amounts of assets and liabilities, the disclosure of contingent liabilities and the reported amounts of revenue and expenses. The following accounting policies involve “critical accounting\n\nReservoir Performance revenue of $1.8 billion declined 1% sequentially driven by reduced intervention and stimulation activity, partially offset by stronger evaluation activity. Revenue was impacted by lower stimulation and intervention work in Saudi Arabia, which was offset by increased activity in the rest of the Middle East & Asia and North America.\n\nDigital & Integration revenue of $1.2 billion increased 6% sequentially driven by 10% growth in digital revenue, supported by greater adoption of digital technologies and higher sales of exploration data, particularly in the U.S. Gulf of Mexico. Asset Performance Solutions (“APS”) revenue was flat sequentially.\n\nUnder generally accepted accounting principles, SLB has the option to first assess qualitative factors to determine whether the existence of events or circumstances leads to a determination that it is more likely than not that the fair value of one or more of its reporting units is greater than its carrying amount. If, after assessing the totality of events or circumstances, SLB determines it is more likely than not that the fair value of a reporting unit is greater than its carrying amount, there is no need to perform any further testing. However, if SLB concludes otherwise, then it is required to perform a quantitative impairment test by calculating the fair value of the reporting unit and comparing the fair value with the carrying amount of the reporting unit. If the fair value of the reporting unit is less than its carrying value, an impairment loss is recorded based on that difference.\n\nFull-year 2024 revenue of $36.3 billion increased 10% year on year. Approximately 46% of the year-on-year revenue increase came from the acquisition of the Aker Solutions subsea business (\"Aker\") in the fourth quarter of 2023 (see Note 6 to the\nConsolidated Financial Statements\n\nAs a large multinational company with a long history of operating in a cyclical industry, SLB has extensive experience in working with its customers during difficult times to manage its accounts receivable. During weak economic environments or when there is an extended period of weakness in oil and gas prices, SLB typically experiences delays in the payment of its receivables. However, except for a $469 million write-off during 2017 as a result of the political and economic conditions in Venezuela, SLB has not historically had material write-offs due to uncollectible accounts receivable. SLB has a global footprint in more than 100 countries. As of December 31, 2024, three of those countries individually accounted for greater than 5% of SLB’s net accounts receivable balance, of which only one (the United States) accounted for greater than 10% of such receivables.\n\nProduction Systems revenue of $12.1 billion increased 24% year on year mainly due to the acquisition of the Aker subsea business. Excluding the effects of the Aker subsea acquisition, revenue grew by 9% year on year driven by strong international sales across the portfolio.\n\nProduction Systems revenue of $3.2 billion increased 3% sequentially with growth led by higher international sales of artificial lift, midstream production systems and completions, partially offset by reduced sales of subsea production systems.\n\nSLB has entered into accelerated share repurchase (“ASR”) transactions to repurchase $2.3 billion of its common stock. Under the terms of the ASR agreements, on January 13, 2025, SLB received an initial share delivery of approximately 80% of the shares to be repurchased, based on the closing price per share of its common stock on the preceding day. SLB expects the remainder of the shares to be delivered no later than the end of May 2025. Under certain circumstances, SLB may be required to deliver shares or pay cash, at its option, upon settlement of the ASR agreements. The total number of shares ultimately purchased under the ASR agreements will depend upon the final settlement and will be based on volume-weighted average prices of SLB’s common stock during the terms of the ASR transactions, less a discount.\n\nReservoir Performance revenue of $7.2 billion increased 9% year on year due to increased stimulation and intervention act",
  "item2_clean": null
}