{
  "source_file": "smci-20250630.htm",
  "form_type": "10-K",
  "item1_clean": ", FlexTwin™, GrandTwin\nblade and multi-node system families that are designed for density, performance, and efficiency that share common computing resources, thereby saving space and power over standard rackmount servers and offering superior serviceability and manageability;\nsystems that provide high-density storage while leveraging an efficient use of power to achieve performance-per-watt savings. Our storage systems are also designed for maximum performance for AI training environments;\nHyper, CloudDC, and WIO\nan extensive rackmount system family that provides optimization for a broad range of workloads and environments that deliver entire clusters of racks, with both liquid-cooled and air-cooled options, per customer requirements;\nEmbedded (5G/IoT/Edge)\nsystems optimized for evolving networks and intelligent management of connected devices; and\nserver systems that deliver node density in environments with space and power constraints.\nIn addition to our server and storage platforms business, we offer a large array of modular server subsystems and accessories, including server boards, chassis, power supplies and other accessories. These subsystems serve as the foundation for platform solutions, covering a range of product offerings from entry-level single and dual-processor servers to high-end multiprocessor markets. The majority of the subsystems and accessories we sell individually are designed to work together to optimize performance and are ultimately integrated into complete server and storage systems.\nServer Software Management Solutions\nOur open industry-standard remote system management solutions, such as our Server Management suite, including Supermicro Server Manager, Supermicro Power Management software, Supermicro Update Manager, SuperCloud Composer and SuperDoctor 5, are designed to efficiently manage large-scale heterogeneous data center environments, including liquid cooling.\nSupermicro Global Services\nWe are rapidly expanding our global service capabilities in support of large-scale AI Cluster deployments and the need to support Enterprise AI adoption in on-premise data centers. We provide global service and support offerings for our direct and OEM customers and our indirect sales channel partners, either directly or through approved distributors and third-party partners. We also identify service requirements, create and execute project plans, conduct verification testing, offer training, and provide technical documentation.\nRack Level Services:\nOur rack level services provide complete service from design to deployment for full rack and cluster level deployments of AI and HPC datacenters. We leverage Supermicro experts and resources to work with leading CSP and Enterprise data centers to completely design and deliver turn-key solutions handling all phases of the data center design and rack integration and installation process. We provide a single point of contact for the entire solution accelerating time to online and optimizing performance and efficiency.\nOur strategic direct and OEM customers may purchase a variety of on-site support service plans. Our service plans vary in terms of specific services, response times, coverage hours and duration, repair priority levels, spare parts requirements, logistics, data privacy and security needs. Our Global Services team provides help desk services and on-site product support for our server and storage systems.\nOur customer support services offer competitive warranties, typically ranging from one-to-three years, and warranty extension options for products sold by our direct sales team and approved indirect sales channel partners. Our customer support team provides ongoing maintenance and technical support for our products through our website and 24/7 direct phone-based support.\nResearch and Development\nWe perform most of our research and development activities in-house in the United States at our facilities in San Jose, California, and in Taiwan. This approach enhances communication and collaboration between our design teams, streamlining the development process and reducing time-to-market. We believe that the combination of our focus on internal research and development activities, our close working relationships with local customers and vendors and our modular design approach allows us to decrease time-to-market, improve quality and deliver superior product designs. Additionally, we continue to invest in reducing our design and manufacturing costs while improving the performance, cost-effectiveness and power- and space-efficiency of our Total IT Solutions.\nOur research and development teams focus on the development of new and enhanced products that can support emerging technological and engineering innovations while achieving high overall system performance. Much of our research and development activity relates to the new product cycles of leading processor vendors. We work closely with NVIDIA, Intel and AMD, among others, to develop products that are compatible with the latest generation of industry-standard technologies under development. Our collaborative approach with these vendors allows us to align the design of our new products with their product release schedules, thereby enhancing our ability to rapidly introduce new products incorporating the latest technology. We work closely with their respective development teams to enhance system performance and reduce system-level issues. Similarly, we work very closely with our customers to understand their needs and develop our new product plans accordingly.\nDuring each of the fiscal years ended June 30, 2025, 2024, and 2023, we sold to over 1,000 customers in over 100 countries. In addition, over the three years ended June 30, 2025, we have sold to thousands of end users through our indirect sales channel. These customers represent a diverse set of market verticals including enterprise data centers, cloud computing, AI, 5G and edge computing markets. Four customers each accounted for 10% or more of our net sales in fiscal year 2025 and one single customer accounted for 10% or more of net sales in fiscal year 2024. No customer accounted for 10% or more of our net sales in fiscal year 2023.\nOur sales and marketing activities are conducted through a combination of our direct sales force and our indirect sales channel partners. Our direct sales force is primarily focused on selling Total IT Solutions, including management software and global services, to large scale cloud, enterprise and OEM customers. In addition, we operate a centralized command center, designed to assist customers with quick and accurate configurations.\nWe work with distributors, value-added resellers, system integrators, and OEMs to market and sell our optimized solutions to their end customers. We provide sales and marketing assistance and training to our indirect sales channel partners and OEMs. We leverage our relationships in our indirect sales channel and with OEMs to penetrate select industry vertical market segments where our products can provide better alternatives to existing solutions.\nWe maintain close contact with our indirect sales channel partners and end customers. We often collaborate during the sales process with our indirect sales channel partners and the end customer’s technical staff to determine the optimal system configuration for the customer’s needs. Our interaction with our indirect sales channel partners and end customers allows us to monitor customer requirements and develop new products to meet their needs.\nOur global sales efforts are supported both by our international offices in the Netherlands, Taiwan, South Korea, United Kingdom, China, and Japan, as well as by our United States based sales team. Product fulfillment and first level support for our international customers are provided by Supermicro Global Services, as well as through our indirect sales channel and OEMs. Sales to customers located outside of the United States represented 40.6%, 32.0%, and 32.1% of net sales in fiscal years 2025, 2024, and 2023, respectively.\nOur marketing programs are designed to create global awareness and brand-recognition for our company and products, as well as an understanding of the significant value we bring to customers. These programs also inform existing and potential customers, the trade press, market analysts, indirect sales channel partners, and OEMs about the strong capabilities and benefits of using our products and solutions. Our marketing efforts support the sale and distribution of our products through both direct sales and indirect channels. We utilize a variety of marketing vehicles, including advertising, public relations, web, social media, collateral, and participation in industry events and tradeshows, to build market awareness and generate new customer demand. We provide cooperative marketing funds to our indirect sales channel partners to extend the reach of our marketing efforts. We also leverage our suppliers’ cooperative marketing programs to jointly benefit from their marketing development funds.\nIntellectual Property\nWe seek to protect our intellectual property rights with a combination of patents, trademarks, copyrights, trade secret laws, and disclosure restrictions. We rely primarily on trade secrets, technical know-how, and other unpatented proprietary information relating to our design and product development activities. We also enter into confidentiality and proprietary rights agreements with our employees, consultants, and other third parties and control access to our designs, documentation, and other proprietary information.\nManufacturing and Quality Control\nWe manufacture the majority of our systems at our San Jose, California headquarters. We believe we are the only major server, storage, and accelerated compute platform vendor that designs, develops, and manufactures a significant portion of their systems in the United States. Global assembly, test and quality control of our servers are performed at our manufacturing facilities in San Jose, California, Taiwan, the Netherlands, and Malaysia. In each of our existing facilities, a Quality and Environmental Management System has been certified according to ISO 9001, ISO 14001 and/or ISO 13485 standards. Our suppliers and contract manufacturers are required to adhere to the same standards to maintain consistent product and service quality and continuous improvement of quality and environmental performance.\nWe use several third-party suppliers and contract manufacturers for materials and sub-assemblies. We believe that selectively using outsourced manufacturing services allows us to focus on our core competencies in product design and development, and increases our operational flexibility. We believe our manufacturing strategy allows us to adjust manufacturing capacity in response to changes in customer demand and to rapidly introduce new products to the market. We use Ablecom Technology, Inc. (“Ablecom”) and its affiliate Compuware Technology, Inc. (“Compuware”), both of which are related parties, for contract design and manufacturing coordination support. We work with Ablecom to optimize modular designs for our chassis and several other components. Ablecom also coordinates the manufacturing of chassis for us. In addition to providing a large volume of contract manufacturing services to us, Ablecom warehouses multiple components and subassemblies manufactured by various suppliers before shipping them to our facilities in the United States, Europe, and Asia. We also have a series of agreements with Compuware, including multiple product development, production and service agreements, as well as product manufacturing agreements and lease agreements for office space. See Note 10, “Related Party Transactions” in the notes to the consolidated financial statements and Part III, Item 13, “Certain Relationships and Related Transactions and Director Independence.”\nWe continuously monitor our invento",
  "item7_clean": "Item 7. Management’s Discussion and Analysis of Financial Condition and Results of Operations\nThe following discussion should be read in conjunction with the consolidated financial statements and related notes which appear elsewhere in this Annual Report. This discussion contains forward-looking statements that involve risks and uncertainties. Our actual results could differ materially from those anticipated in these forward-looking statements as a result of various factors, including those discussed below and elsewhere in this Annual Report, particularly under the heading “Risk Factors.”\nWe are a global leader in Application-Optimized Total IT Solutions. Founded and operating in San Jose, California, we are committed to delivering first-to-market innovation for Enterprise, Cloud, AI, and 5G Telco/Edge IT Infrastructure. As a Total IT Solutions manufacturer, our offerings include server, AI systems, storage, IoT devices, switches, software, and support services. Supermicro's expertise in motherboard, power, and chassis design expertise drives our ability to develop and produce next-generation innovations, from cloud to edge, for our global customers. Our products are designed and manufactured in-house across facilities in the United States, Taiwan, and the Netherlands. Leveraging our global operations for scale and efficiency, we optimize solutions to improve TCO while reducing environmental impact through Green Computing initiatives. Our award-winning portfolio of Server Building Block Solutions empowers customers to tailor systems precisely to their exact workloads and applications. By selecting from a broad family of flexible and reusable building blocks, customers can configure a comprehensive range of form factors, processors, memory, GPUs, storage, networking, power, and cooling solutions, including air-conditioned, free air, and liquid cooling solutions.\nWe commenced operations in 1993 and have been profitable every year since inception. For fiscal years 2025, 2024, and 2023, our net income was $1,048.9 million, $1,152.7 million, and $640.0 million, respectively.\nIn order to increase our sales and profits, we believe that we must continue to develop flexible application optimized server and storage solutions while being among the first to market with new features and products. Our focus is on delivering Total IT Solutions that integrate, validate, and deliver server, storage, networking and software at the rack and cluster (multi-rack) level. Additionally, we will continue to expand our software offerings and enhance customer service and support, particularly as we increase our focus on large enterprise and data center customers. A key component of our strategy is our DCBBS, which significantly reduces data center build time and enables full integration of AI computing, server, storage, networking, rack, cabling, liquid cooling, end-to-end management software, onsite deployment services, and ongoing maintenance. To further expand our market share, we also recognize the need to strengthen our network of sales partners and distribution channels.\nWe measure our financial success based on various key indicators, including growth in net sales, gross profit margin, operating margin, and net income per common share. In additional to these financial metrics, a critical non-financial indicator of our success is our ability to rapidly introduce new products and deliver the latest application-optimized server and storage solutions. To support this, we work closely with the developers and manufacturers of key components, allowing us to integrate emerging technologies as they become available. Our ability to quickly bring new products to market, which we believe is enabled by our Building Block Solution architecture and has historically enabled us to capitalize on major technology transitions such as the launch of new GPUs, microprocessors and storage technologies. Accordingly, we closely monitor the product introduction cycles of industry leaders, including NVIDIA Corporation, Intel Corporation, Advanced Micro Devices, Inc., Broadcom Inc., Samsung Electronics Company Limited, Micron Technology, Inc. and others. This strategic focus directly informs our research and development investments, as we continue to allocate resources toward both our current initiatives and future product innovation.\nThe growing use of AI, which requires enhanced datacenter capabilities, has substantially increased demand for our products. We expect this trend to continue, with further demand for datacenter expansion driven by the AI market. As a result, we will continue to enhance our product capabilities and expand our service offerings, including DCBBS to address the growing demand in the AI market and datacenter markets. We believe that our ability to tailor certain products to the unique needs of these sectors sets us apart from many competitors and positions us to capture an even greater market share going forward.\nMacroeconomic Factors\nMacroeconomic factors, including inflation, interest rate changes, capital market volatility, global supply chain constraints, tariffs, and global economic and geopolitical developments, have had and may continue to have direct and indirect impacts on our business and results of operations, particularly demand for our products and net sales. While difficult to isolate and quantify, these macroeconomic factors have also impacted and may continue to impact our supply chain and manufacturing costs, employee wages, costs for capital equipment and value of our investments. Further, while many of these macroeconomic factors could have a long term impact, others may have a short term impact which could lead to our financial results not being comparable on a period to period basis.\nFinancial Highlights\nThe following is a summary of our financial highlights for fiscal years 2025 and 2024:\nYears Ended June 30,\nTotal operating expenses\nIncome from operations\nNet income per diluted share\nNet sales increased by 46.6% in fiscal year 2025 as compared to fiscal year 2024. driven by an increase in demand from customers for GPU servers, HPC and rack-scale solutions which have higher average selling prices, primarily due to large enterprise and data center customers from the United States, Asia, and Europe where we experienced significant growth.\nGross margin decreased to 11.1% in fiscal year 2025 from 13.8% in fiscal year 2024, primarily due to our strategy to offer competitive pricing to gain market share, change in product and customer mix, and higher manufacturing related expenses.\nOperating expenses increased by 38.4% in fiscal year 2025 as compared to fiscal year 2024, primarily due to higher headcount and increases in salary and stock-based compensation.\nNet income decreased to $1,048.9 million in fiscal year 2025 as compared to $1,152.7 million in fiscal year 2024, which was primarily due to decrease in gross profit and increase in operating and other expenses partially, offset by the increase in net sales in fiscal year 2025 as compared to fiscal year 2024.\nCritical Accounting Estimates\nOur consolidated financial statements are prepared in accordance with generally accepted accounting principles in the United States (“U.S. GAAP”). The preparation of these consolidated financial statements requires us to make estimates and assumptions that affect the reported amounts of assets, liabilities, revenue, costs and expenses, and related disclosures. On an ongoing basis, we regularly evaluate our accounting estimates based on historical experience and on various other assumptions that we believe are reasonable under the circumstances. The actual impact on our financial performance could differ from these estimates under different assumptions or conditions.\nAn accounting estimate is considered critical if both (i) the nature of the estimates or assumptions is material due to the levels of subjectivity and judgment involved, and (ii) the impact within a reasonable range of outcomes of the estimates and assumptions is material to our consolidated financial statements. We have critical accounting estimates in the areas of inventories, revenue recognition, income taxes, when applicable, have the greatest potential impact on our consolidated financial statements. Therefore, we consider these to be our critical accounting estimates.\nFor further information on all of our significant accounting policies, see Note 1. “Organization and Summary of Significant Accounting Policies” in the notes to the consolidated financial statements in this Annual Report.\nWe generate revenue from the sale of server and storage systems, including systems and related services, subsystems and accessories.\nWe apply judgment in determining the transaction price as we may be required to estimate variable consideration when determining the amount of revenue to recognize. As part of determining the transaction price in contracts with customers, we estimate reserves for future sales returns based on our history of actual returns for each major product line. Based upon historical experience, a refund liability is recorded at the time of sale for estimated product returns and an asset is recognized for the amount expected to be recorded in inventory upon product return, less the expected recovery costs.\nWe allocate the transaction price of each customer contract to each performance obligation based on the relative Standalone Selling Price (“SSP”) for each performance obligation within each contract. We recognize the amount of transaction price allocated to each performance obligation within a customer contract as revenue at the time the respective performance obligation is satisfied by transferring control of the promised good or service to a customer. Determining the relative SSP for contracts that contain multiple performance obligations requires significant judgment. We determine SSP based on the price at which the performance obligation is sold separately. If the SSP is not observable through past transactions, we apply judgment to estimate the SSP. For substantially all of the performance obligations, we are able to establish the SSP based on the observable prices of products or services sold separately in comparable circumstances to similar customers. We typically establish an SSP range for our products and services, which is reassessed on a periodic basis or when facts and circumstances change. SSP for our products and services can evolve over time due to changes in our pricing practices, internally approved pricing guidelines with respect to geographies, customer type, internal costs, and gross margin objectives for the related performance obligations which can also be influenced by intense competition, changes in demand for our products and services, economic and other factors.\nRevenue is recognized either over time or at a point in time, depending on when control of the underlying products or services are transferred to the customer, which may require judgment. Revenue is recognized at a point in time for products. Revenue is recognized over time for extended warranty and on-site services provided and at a point in time for other services such as rack installation and integration services.\nInventories are stated at lower of cost, using weighted average cost method, or net realizable value. Net realizable value is the estimated selling price of our products in the ordinary course of business, less reasonably predictable costs of completion, disposal, and transportation. Inventories consist of raw materials (principally electronic components), work in process (principally products being assembled) and finished goods (principally finished products and products ready for sale). We evaluate inventory on a quarterly basis for lower of cost or net realizable value and excess and obsolescence and, as necessary, write down the valuation of inventories.\nWe charge cost of sales for inventory provisions to write-down our inventory to the lower of cost or net realizable value or for obsolete or excess inventory, and for excess product purchase commitments. Most of our inventory provisions relate to excess quantities of products or components, based on our inventory levels and future product purchase commitments compared to assumptions about future demand and market conditions, which requires management judgment. Situations that may result in excess or obsolete inventory or excess product purchase commitments include changes in business and economic conditions, changes in market conditions, sudden and significant decreases in demand for our products, including potential cancellation or deferral of customer purchase orders, inventory obsolescence because of changing technology and customer requirements, new product introductions resulting in less demand for existing products or inconsistent spikes in demand, failure to estimate customer demand properly, ordering in advance of historical lead-times, government regulations and the impact of changes in future demand, or increase in demand for competitive products, including competitive actions. Net realizable value is the estimated selling price of our products in the ordinary course of business, less reasonably predictable costs of completion, disposal, and transportation.\nOur inventory and capacity purchase commitments are based on forecasts of future customer demand and consider our third-party manufacturers’ lead times and constraints. Our manufacturing lead times can be and have been long, and in some cases, extended beyond twelve months for some products. We may place non-cancellable inventory orders for certain product components in advance of our historical lead times, pay premiums and provide deposits to secure future supply and capacity. We also adjust to other market factors, such as product offerings and pricing actions by our competitors, new product transitions, and macroeconomic conditions - all of which may impact demand for our products.\nWe receive various rebate incentives from certain suppliers based on our contractual arrangements, including volume-based rebates. The rebates earned are recognized as a reduction of cost of inventories and reduce the cost of sales in the period when the related inventory is sold.\nWe are subject to income taxes in the United States and numerous foreign jurisdictions. Significant judgment is required in determining our provision for income taxes and income tax assets and liabilities, including evaluating uncertainties in the application of accounting principles and complex tax laws.\nOur calculation of deferred tax assets and liabilities is based on certain estimates and judgments and involves dealing with uncertainties in the application of complex tax laws. Our estimates of deferred tax assets and liabilities may change based, in part, on added certainty or finality to an anticipated outcome, changes in accounting standards or tax laws in the U.S. or foreign jurisdictions where we operate, or changes in other facts or circumstances. In addition, we recognize liabilities for potential U.S. and foreign income tax contingencies based on our estimate of whether, and the extent to which, additional taxes may be due. If we determine that payment of these amounts is unnecessary or if the recorded tax liability is less than our current assessment, we may be required to recognize an income tax benefit or additional income tax expense in our financial statements accordingly.\nWe record a valuation allowance to reduce deferred tax assets to the amount that is believed more likely than not to be realized based on all available evidence. To the extent realization of the deferred tax assets becomes more-likely-than-not, we would recognize such deferred tax assets as income tax benefits during the period.\nWe recognize the benefit from a tax position only if it is more-likely-than-not that the position would be sustained upon audit based solely on the technical mer",
  "item2_clean": null
}