{
  "source_file": "sna-20241228.htm",
  "form_type": "10-K",
  "item1_clean": "Snap-on is a leading global innovator, manufacturer and marketer of tools, equipment, diagnostics, repair information and systems solutions for professional users performing critical tasks including those working in vehicle repair, aerospace, the military, natural resources, and manufacturing. From its founding in 1920, Snap-on has been recognized as the mark of the serious and the outward sign of the pride and dignity working men and women take in their professions. Products and services are sold through the company’s network of widely recognized franchisee vans as well as through direct and distributor channels, under a variety of notable brands. The company also provides financing programs to facilitate the sales of its products and to support its franchise business.\nSnap-on markets its products and brands worldwide in more than 130 countries. Snap-on’s largest geographic market is the United States. In addition, Snap-on has a meaningful presence across continental Europe and in the Asia Pacific region, as well as in Canada and the United Kingdom.\nThe company began with the development of the original Snap-on interchangeable socket set and subsequently pioneered mobile tool distribution in the automotive repair market, where well-stocked vans sell to professional vehicle technicians at their place of business. Today, Snap-on defines its value proposition more broadly, extending its reach “beyond the garage” to deliver a broad array of unique solutions that make work easier for serious professionals. The company’s “coherent growth” strategy focuses on developing and expanding its professional customer base in its legacy automotive market, as well as in adjacent markets, additional geographies and other areas, including in critical industries, where the cost and penalties for failure can be high. In addition to its coherent growth strategy, Snap-on is committed to its “Value Creation Processes” – a set of strategic principles and processes designed to create value and employed in the areas of (i) safety; (ii) quality; (iii) customer connection; (iv) innovation; and (v) rapid continuous improvement (“RCI”). Snap-on’s RCI initiatives employ a structured set of tools and processes across multiple businesses and geographies intended to eliminate waste and improve operations. Savings from Snap-on’s RCI initiatives reflect benefits from a wide variety of ongoing efficiency, productivity and process improvements, including savings generated from product design cost reductions, improved manufacturing line set-up and change-over practices, lower-cost sourcing initiatives and facility consolidations.\nSnap-on’s primary customer segments include: (i) commercial and industrial customers, including professionals in critical industries and in emerging markets; (ii) professional vehicle repair technicians who purchase products through the company’s multinational mobile tool distribution network; and (iii) other professional customers related to vehicle repair, including owners and managers of independent service and repair shops, as well as original equipment manufacturer (“OEM”) dealership service and repair shops (“OEM dealerships”). Snap-on’s Financial Services customer segment includes: (i) franchisees’ customers, principally serving vehicle repair technicians, and Snap-on customers who require financing for the purchase or lease of tools, diagnostics, and equipment products on an extended-term payment plan; and (ii) franchisees who require financing options for vehicle and business needs.\nSNAP-ON INCORPORATED\nSnap-on’s operating segments, which represent Snap-on’s reportable segments, are based on the organizational structure used by the Chief Executive Officer, its chief operating decision maker (“CODM”), to make operating and investment determinations and to assess performance. Snap-on’s reportable operating segments are: (i) the Commercial & Industrial Group; (ii) the Snap-on Tools Group; (iii) the Repair Systems & Information Group; and (iv) Financial Services. The Commercial & Industrial Group consists of business operations serving a broad range of industrial and commercial customers worldwide, including customers in the aerospace, natural resources, government and military, power generation, transportation and technical education market segments (collectively, “critical industries”), primarily through direct and distributor channels. The Snap-on Tools Group consists of business operations primarily serving vehicle service and repair technicians through the company’s multinational mobile tool distribution channel. The Repair Systems & Information Group consists of business operations serving other professional vehicle repair customers worldwide, primarily owners and managers of independent repair shops and OEM dealerships, through direct and distributor channels. Financial Services consists of the business operations of Snap-on Credit LLC (“SOC”), the company’s financial services business in the United States, and Snap-on’s other financial services subsidiaries in those international markets where Snap-on has franchise operations. See Note 19 to the Consolidated Financial Statements for information on operating segments and foreign operations.\nSnap-on evaluates the performance of the Commercial & Industrial Group, the Snap-on Tools Group and the Repair Systems & Information Group operating segments based on segment net sales and segment operating earnings while the Financial Services operating segment is evaluated based on segment revenue and segment operating earnings. The Snap-on Tools Group segment net sales reflect external net sales, while the Commercial & Industrial Group and the Repair Systems & Information Group segment net sales include both external and intersegment net sales. Snap-on accounts for intersegment net sales and transfers based primarily on standard costs with reasonable mark-ups established between the segments. Identifiable assets by segment are those assets used in the respective reportable segment’s operations. Corporate assets consist of cash and cash equivalents (excluding cash held at Financial Services), deferred income taxes and certain other assets. Corporate expenses primarily reflect stock-based compensation and other costs not attributable to an operating segment. Intersegment amounts are eliminated to arrive at Snap-on’s consolidated financial results.\nSnap-on has continued to broaden its business through a series of coherent acquisitions, which have expanded and enhanced Snap-on’s capabilities in a variety of critical industries and in its business operations serving primarily owners and managers of independent repair shops and OEM dealerships. For information regarding recent acquisitions, see Item 7, “Management’s Discussion and Analysis of Financial Condition and Results of Operations” and Note 3 to the Consolidated Financial Statements.\nInformation Available on the Company’s Website\nAdditional information about Snap-on, including its products and its environmental, health and safety, social responsibility, governance and sustainability (collectively, “ESG”) commitment, is available on the company’s website at\n. In addition, Snap-on’s (i) charters for the Audit, Corporate Governance and Nominating, and Organization and Executive Compensation Committees of the company’s Board of Directors; (ii) Corporate Governance Guidelines; and (iii) Code of Business Conduct and Ethics are available on the company’s website. Snap-on will also post any amendments to these documents, or information about any waivers granted to directors or executive officers with respect to the Code of Business Conduct and Ethics, on the company’s website at\n2024 ANNUAL REPORT\nProducts and Services\nTools; Diagnostics, Information and Management Systems; and Equipment\nSnap-on offers a broad line of products and complementary services that are grouped into three product categories: (i) tools; (ii) diagnostics, information and management systems; and (iii) equipment. Further product line information is not presented as it is not practicable to do so. The following table shows the consolidated net sales of these product categories for the last three years:\n\nHand tools, tool storage, certain equipment and related accessories\n2024 ANNUAL REPORT\nSnap-on also generates revenue from various financing programs that include: (i) installment sales and lease contracts arising from franchisees’ customers and Snap-on customers who require financing for the purchase or lease of tools, diagnostics, and equipment products on an extended-term payment plan; and (ii) business and vehicle loans and leases to franchisees. The decision to finance through Snap-on or another financing source is solely by election of the customer. When assessing customers for potential financing, Snap-on considers various factors regarding ability to pay, including the customers’ financial condition, debt-servicing ability, past payment experience, and credit bureau and proprietary Snap-on credit model information, as well as the value of the underlying collateral.\nSnap-on offers financing through SOC and the company’s international finance subsidiaries in most markets where Snap-on has franchise operations. Financing revenue is recognized over the life of the underlying contracts, with interest or finance charges computed primarily on the average daily balances of the underlying contracts.\nSales and Distribution\nSnap-on markets and distributes its products and related services principally to professional tool and equipment users around the world. The two largest market sectors are the vehicle service and repair sector and the industrial sector.\nVehicle Service and Repair Sector\nThe vehicle service and repair sector has three main customer groups: (i) professional technicians who purchase tools, diagnostics, and equipment products for use in their work; (ii) other professional customers related to vehicle repair, including owners and managers of independent repair shops and OEM dealerships who purchase tools, diagnostics, and equipment products for use by multiple technicians within a service or repair facility; and (iii) OEMs.\nSnap-on provides innovative tool, equipment and business solutions, as well as technical sales support and training, designed to meet technicians’ evolving needs. Snap-on’s mobile tool distribution system offers technicians the convenience of purchasing quality tools at their place of business with minimal disruption of their work routine. Snap-on also provides owners and managers of repair shops, where technicians work, with tools, diagnostics, equipment, and repair and service information, including electronic parts catalogs and shop management products. Snap-on’s OEM facilitation business provides OEMs and OEM dealerships with products and services including special and essential tools as well as consulting and facilitation services, which are comprised of product procurement, distribution and administrative support for dealership equipment programs.\nThe market for vehicle service and repair is driven by an accelerating rate of technological change, car and truck population growth and increasing unit age, and the resulting effects of these changes on both our suppliers and customers. Snap-on has historically benefited from the increasing complexity of car and truck fleets and the changing tools, technologies and data needed to monitor, calibrate, service and repair evolving vehicle platforms. While new technologies, including those associated with alternative energy drivetrains and greater vehicle autonomy, may alter the nature of certain service and repair for particular vehicle types, we believe many of these new technologies provide opportunities to fulfill requirements for enhanced solutions or greater precision. Snap-on believes it is well-positioned to innovate new products to address these changing needs and to extend its leadership position in the expanding vehicle service and",
  "item7_clean": "consists of business operations serving other professional vehicle repair customers worldwide, primarily owners and managers of independent repair shops and OEM dealership service and repair shops (“OEM dealerships”) through direct and distributor channels. Segment net sales of $1,797.9 million in 2024 represented an increase of $16.7 million, or 0.9%, from 2023 levels, reflecting an $18.1 million, or 1.0%, organic sales gain, partially offset by $1.4 million of unfavorable foreign currency translation.\nThe organic improvement primarily reflects a mid single-digit increase in activity with OEM dealerships, partially offset by a low single-digit decline in sales of undercar equipment. Segment o\nperating earnings of $455.2 million in 2024 compared to $433.2 million in 2023, an increase of $22.0 million or 5.1%.\nThe Repair Systems & Information Group intends to focus on the following strategic priorities in 2025:\nExpanding the product offering with new products and services, thereby providing more to sell to repair shop owners and managers;\nContinuing software and hardware upgrades to further improve functionality, performance and efficiency;\nFurther building our proprietary databases to enhance software solutions;\nAdvancing productivity through RCI initiatives and the optimization of resources; and\nIncreasing geographic penetration, including in emerging markets.\nSNAP-ON INCORPORATED\ngenerates revenue from various financing programs and is a strategic partner of the company’s mobile franchise van channel. Financial services revenue of\nin 2023. Originations of $1,182.9 million in 2024 represented a decrease of $52.6 million, or 4.3%, from 2023 levels. Operating earnings from financial services of $276.9 million in 2024 compared to $270.5 million last year.\nFinancial Services intends to focus on the following strategic priorities in\nDelivering financial products and services that attract and sustain profitable franchisees and support Snap‑on’s strategies for expanding market coverage and penetration;\nImproving productivity levels and ensuring high quality in all financial products and processes through the use of RCI initiatives; and\nMaintaining healthy portfolio performance levels.\nNet cash provided by operating activities of $1,217.5 million in 2024 compared to $1,154.2 million in 2023. The $63.3 million increase is primarily due to a $34.3 million increase in net earnings and a $18.0 million change in net operating assets and liabilities.\nNet cash used by investing activities of $204.1 million in 2024 included additions to finance receivables of $966.0 million, which were partially offset by collections of $837.8 million. Net cash used by investing activities of $331.8 million in 2023 included additions to finance receivables of $1,029.0 million, partially offset by collections of $833.5 million, as well as $42.6 million of cash used for acquisitions. Capital expenditures in 2024 and 2023 totaled $83.5 million and $95.0 million, respectively. Capital expenditures in both years included continued investments related to the company’s execution of its strategic growth initiatives and Value Creation Processes around safety, quality, customer connection, innovation and RCI.\nNet cash used by financing activities of $649.8 million in 2024 included $406.4 million for dividend payments to shareholders, $290.0 million for the repurchase of 952,000 shares of Snap-on’s common stock, and net repayments of other short-term borrowings of $1.3 million. These amounts were partially offset by $92.3 million of proceeds from stock purchase plans and stock option exercises. Net cash used by financing activities of $572.9 million in 2023 included $355.6 million for dividend payments to shareholders, $294.7 million for the repurchase of 1,126,000 shares of Snap-on’s common stock, and net repayments of other short-term borrowings of $1.7 million. These amounts were partially offset by $113.6 million of proceeds from stock purchase plans and stock option exercises.\n2024 ANNUAL REPORT\nManagement’s Discussion and Analysis of Financial Condition and Results of Operations (continued)\nResults of Operations\nResults of operations for 2024 and 2023 are as follows:\n(Amounts in millions)\nOperating earnings before financial services\nFinancial services revenue\nFinancial services expenses\nOperating earnings from financial services\nOther income (expense) – net\nEarnings before income taxes\nNet earnings attributable to noncontrolling interests\nNet earnings attributable to Snap-on Inc.\nPercentage Disclosure: All income statement line item percentages below “Operating earnings from financial services” are calculated as a percentage of the sum of Net sales and Financial services revenue.\nNet sales of $4,707.4 million in 2024 represented a decrease of $22.8 million, or 0.5%, from\nlevels, reflecting a $40.6 million, or 0.9%, organic decline and $5.5 million of unfavorable foreign currency translation, partially offset by $23.3 million of acquisition-related sales.\nGross profit of $2,377.9 million in 2024 compared to $2,349.1 million last year, an increase of $28.8 million or 1.2%. Gross margin (gross profit as a percentage of net sales) improved 80 basis points (100 basis points (“bps”) equals 1.0 percent) from\nprimarily due to benefits from the company’s RCI initiatives, increased sales in higher-gross-margin businesses, and lower material and other costs.\nOperating expenses of $1,309.1 million in 2024, including a $22.5 million benefit from the legal payments, compared to $1,309.2 million last year\nOperating expenses as a percentage of net sales rose 10 bps from last year primarily reflecting the effects of lower sales volumes, partially offset by benefits from the legal payments.\nOperating earnings before financial services of $1,068.8 million in 2024, including a $22.5 million benefit from the legal payments, compared to $1,039.9 million in\nAs a percentage of net sales, operating earnings before financial services were 22.7% compared to 22.0% last year.\nFinancial services revenue of $401.0 million in 2024 compared to $378.1 million last year. Financial services operating earnings of $276.9 million in 2024 compared to $270.5 million in\nOperating earnings of $1,345.7 million in 2024, including a $22.5 million benefit from the legal payments, compared to $1,310.4 million in\nAs a percentage of revenues, operating earnings were 26.3% compared to 25.7% last year.\nInterest expense in 2024 decreased $0.3 million compared to last year. See Note 9 to the Consolidated Financial Statements for additional information on debt and credit facilities.\nSNAP-ON INCORPORATED\nOther income (expense) – net primarily includes interest income, non-service components of net periodic benefit costs, and net gains and losses associated with hedging and currency exchange rate transactions. See Note 17 to the Consolidated Financial Statements for additional information on Other income (expense) – net.\nThe effective income tax rate on earnings attributable to Snap-on was 22.6% in 2024 and 22.5% in 2023. See Note 8 to the Consolidated Financial Statements for additional information on income taxes.\nNet earnings attributable to Snap-on of $1,043.9 million, or $19.51 per diluted share, in 2024, including a $17.5 million, or $0.32 per diluted share, after-tax benefit from the legal payments, compared to $1,011.1 million, or $18.76 per diluted share, in 2023, an\nincrease of $32.8 million or $0.75 per diluted share.\nSnap-on’s operating segments are based on the organization structure used by management for making operating and investment decisions and for assessing performance. Snap-on’s reportable operating segments are: (i) the Commercial & Industrial Group; (ii) the Snap-on Tools Group; (iii) the Repair Systems & Information Group; and (iv) Financial Services. The Commercial & Industrial Group consists of business operations serving a broad range of industrial and commercial customers worldwide, including customers in the aerospace, natural resources, government and military, power generation, transportation and technical education market segments, primarily through direct and distributor channels. The Snap-on Tools Group consists of business operations primarily serving vehicle service and repair technicians through the company’s multinational mobile tool distribution channel. The Repair Systems & Information Group consists of business operations serving other professional vehicle repair customers worldwide, primarily owners and managers of independent repair shops and OEM dealerships, through direct and distributor channels. Financial Services consists of the business operations of Snap-on’s finance subsidiaries.\nSnap-on evaluates the performance of the Commercial & Industrial Group, the Snap-on Tools Group and the Repair Systems & Information Group operating segments based on segment net sales and segment operating earnings. The Snap-on Tools Group segment net sales reflect external net sales, while the Commercial & Industrial Group and the Repair Systems & Information Group segment net sales include both external and intersegment net sales. Snap-on accounts for intersegment net sales and transfers based primarily on standard costs with reasonable mark-ups established between the segments. The Financial Services operating segment is evaluated based on financial services revenue and segment operating earnings. Corporate expenses primarily reflect stock-based compensation and other costs not attributable to an operating segment. Intersegment amounts are eliminated to arrive at Snap-on’s consolidated financial results.\nCommercial & Industrial Group\n(Amounts in millions)\nIntersegment net sales\nSegment cost of goods sold\nSegment gross profit\nSegment operating expenses\nSegment operating earnings\nSegment net sales of $1,476.8 million in 2024 represented an increase of $18.5 million, or 1.3%, from 2023 levels, reflecting a $1.5 million, or 0.1%, organic gain and $23.3 million of acquisition-related sales, partially offset by $6.3 million of unfavorable foreign currency translation.\nThe organic increase is primarily due to a mid single-digit gain in sales to customers in critical industries, partially offset by a double-digit reduction in the power tools operation and a low single-digit decline in the European-based hand tools business.\nSegment gross margin in 2024 improved 210 bps from last year, primarily reflecting increased sales volumes in higher-gross-margin critical industry sectors, savings from the segment’s RCI initiatives, lower material and other costs, and 40 bps of benefits from acquisitions.\nSegment operating expenses as a percentage of net sales in 2024 rose 120 bps as compared to\n2023 primarily due to increased personnel and other costs, and a 50 bps impact from acquisitions.\n2024 ANNUAL REPORT\nManagement’s Discussion and Analysis of Financial Condition and Results of Operations (continued)\nAs a result of these factors, segment operating earnings of $242.1 million in 2024 compared to $226.1 million in 2023, an increase of $16.0 million or 7.1%. Segment operating margin (segment operating earnings as a percentage of segment net sales) for the Commercial & Industrial Group of 16.4% in 2024 compared to 15.5% last year.\n(Amounts in millions)\nSegment cost of goods sold\nSegment gross profit\nSegment operating expenses\nSegment operating earnings\nSegment net sales of $1,989.2 million in 2024 represented a decrease of $99.6 million, or 4.8%, from\nlevels, reflecting a $100.9 million, or 4.8%, organic sales decline, partially offset by $1.3 million of favorable foreign currency translation. The organic decrease is due to a mid single-digit decline in the U.S., partially offset by a low single-digit gain in the segment’s international operations.\nSegment gross margin in 2024 improved 20 bps from last year primarily reflecting decreased sales of lower-gross-margin products.\nSegment operating expenses as a percentage of net sales in 2024 rose 130 bps from last year primarily due to the lower sales volumes.\nAs a result of these factors, segment operating earnings of $447.3 million in 2024 compared to $493.8 million in 2023, a decrease of $46.5 million or 9.4%. Operating margin for the\nTools Group of 22.5% in 2024 compared to 23.6% last year.\nRepair Systems & Information Group\n(Amounts in millions)\nIntersegment net sales\nSegment cost of goods sold\nSegment gross profit\nSegment operating expenses\nSegment operating earnings\nSegment net sales of $1,797.9 million in 2024 represented an increase of $16.7 million, or 0.9%, from 2023 levels, reflecting an $18.1 million, or 1.0%, organic sales gain, partially offset by $1.4 million of unfavorable foreign currency translation. The organic improvement primarily reflects a mid single-digit increase in activity with OEM dealerships, partially offset by a low single-digit decline in sales of undercar equipment.\nSegment gross margin in 2024 improved 140 bps from last year primarily due to increased sales of higher-gross-margin products and savings from the segment’s RCI initiatives.\nSegment operating expenses as a percentage of net sales in 2024 rose 40 bps from\nprimarily reflecting increased personnel and other costs.\nAs a result of these factors, segment operating earnings of $455.2 million in 2024 compared to $433.2 million in 2023, an increase of $22.0 million or 5.1%. Operating margin for the Repair Systems & Information Group of 25.3% in 2024 compared to 24.3% last year.\nSNAP-ON INCORPORATED\n(Amounts in millions)\nFinancial services revenue\nFinancial services expenses\nSegment operating earnings\nFinancial services revenue is generally dependent on the size of the average financial services portfolio during the period, as well as on the average yield on receivables. Financial services revenue of $401.0 million in 2024 represented an increase of $22.9 million, or 6.1%, from\nIn both 2024 and 2023, the average yield on finance receivables was 17.7%. In 2024 and\n, the average yields on contract receivables were 9.0% and\n, respectively. Originations of $1,182.9 million in 2024 represented a decrease of $52.6 million, or 4.3%, from 2023 levels.\nFinancial services expenses primarily include personnel-related and other general and administrative costs, as well as provisions for credit losses. These expenses are generally more dependent on changes in the size of the financial services portfolio than they are on the revenue of the segment. Financial services expenses in 2024 increased primarily due to higher provisions for credit losses as compared to those recorded in 2023. As a percentage of the average financial services portfolio, financial services expenses were 5.0% in 2024 and 4.5% in 2023.\nAs a result of these factors, segment operating earnings of\n, an increase of $6.4 million, or 2.4%.\nSee Note 1 and Note 4 to the Consolidated Financial Statements for additional information on financial services.\nS\nnap-on’s general corporate expenses in 2024 of $75.8 million compared to $113.2 million recorded in\n. The year-over-year decrease primarily reflects benefits from the legal payments received in the first six months of 2024 and lower stock-based compensation costs.\n2024 ANNUAL REPORT\nManagement’s Discussion and Analysis of Financial Condition and Results of Operations (continued)\n(Amounts in millions, except per share data)\nFinancial services revenue\nFinancial services expenses\nNet earnings attributable to Snap-on Incorporated\nEarnings per share – basic*\nEarnings per share – diluted*\nCash dividends paid per share\nFinancial services revenue\nFinancial services expenses\nNet earnings attributable to Snap-on Incorporated\nEarnings per share – basic*\nEarnings per share – diluted*\nCash dividends paid per share\nAmounts may not total to annual earnings per share because each quarter and year are calculated separately based on basic and diluted weighted-average common shares outstanding during each respective period.\nSNAP-ON INCORPORATED\nResults of oper",
  "item2_clean": null
}