{
  "source_file": "sna-20250927.htm",
  "form_type": "10-Q",
  "item1_clean": null,
  "item7_clean": null,
  "item2_clean": "Item 2: Management’s Discussion and Analysis of Financial Condition and Results of Operations\nCaution Regarding Forward-Looking Statements:\nyear end”), particularly those in Part I, Item 1A: Risk Factors, and those discussed in this document, could affect the company’s actual results and could cause its actual consolidated results to differ materially from those expressed in any forward-looking statement made by, or on behalf of, Snap-on.\nRisks and uncertainties include, without limitation:\nUncertainties related to estimates, assumptions and projections generally;\nThe timing and progress with which Snap-on can attain value through its Snap-on Value Creation Processes, including its ability to (i) realize efficiencies and savings from its rapid continuous improvement and other cost reduction initiatives, (ii) improve workforce productivity, (iii) achieve improvements in the company’s manufacturing footprint and greater efficiencies in its supply chain, and (iv) enhance machine maintenance, plant productivity and manufacturing line set-up and change-over practices, any or all of which could result in production inefficiencies, higher costs and/or lost revenues;\nSnap-on’s capability to successfully implement future strategies with respect to its existing businesses, including increasing or optimizing selling, designing, or manufacturing capacity;\nSnap-on’s ability to refine its brand and franchise strategies, retain and attract franchisees, and further enhance service and value to franchisees in order to help improve the sales and profitability of franchisees;\nThe company’s ability to introduce successful new products;\nInflation, interest rate changes and other monetary and market fluctuations;\nPrice and supply fluctuations related to raw materials, components and certain purchased finished goods, such as steel, plastics, and electronics;\nThe effects of external economic factors, including adverse developments in world financial markets, disruptions related to tariffs and other trade or sanction issues, and global supply chain inefficiencies, including as a result of the ongoing war in Ukraine, as well as conflicts in the Middle East and other regions;\nSignificant changes in the current competitive environment;\nRisks related to pursuing, completing and integrating acquisitions;\nSnap-on’s ability to successfully manage changes in prices and the availability of energy;\nThe company’s ability to withstand disruption arising from natural disasters, including climate-related events or other unusual occurrences;\nRisks associated with data security and technological systems and protections, including the effects of cyber incidents and from new legislation, regulations or government-related developments;\nSnap-on’s ability to effectively manage human capital resources;\nThe impact of production and sourcing challenges, including labor interruptions and supply chain disruptions, to both Snap-on and relevant third parties;\nWeakness in certain geographic areas, including as a result of localized recessions;\nChanges in tax rates, laws and regulations as well as uncertainty surrounding potential changes;\nThe amount, rate and growth of health care and postretirement costs, including continuing and potentially increasing required contributions to pension and postretirement plans;\nSNAP-ON INCORPORATED\nMANAGEMENT’S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS\nOF OPERATIONS\nThe effects of new or changing requirements, legislation, regulations or government-related developments or issues, as well as third party actions, including those addressing climate change;\nPotential reputational damages and costs related to litigation;\nThe impact of outbreaks of infectious diseases as well as the effects of governmental actions related thereto on Snap-on’s business, which could have the potential to amplify the impact of the other risks facing the company; and\nOther world or local events outside Snap-on’s control, including terrorist disruptions, armed conflicts and civil unrest.\nSnap-on disclaims any responsibility to update any forward-looking statement provided in this document, except as required by la\ndition, investors should be aware that generally accepted accounting principles in the United States of America (“GAAP”) prescribe when a company should reserve for particular risks, including litigation exposures. Accordingly, results for a given reporting period could be significantly affected if and when a reserve is established for a major contingency. Reported results, therefore, may appear to be volatile in certain accounting periods.\nReferences in Management’s Discussion and Analysis of Financial Condition and Results of Operations to “organic sales” refer to sales from continuing operations calculated in accordance with GAAP, adjusted to exclude acquisition-related sales and the impact of foreign currency translation. Management evaluates the company’s sales performance based on organic sales growth, which primarily reflects growth from the company’s existing businesses as a result of increased output, expanded customer base, geographic expansion, new product development and pricing changes, and excludes sales contributions from acquired operations the company did not own as of the comparable prior-year reporting period. Organic sales also exclude the effects of foreign currency translation as foreign currency translation is subject to volatility that can obscure underlying business trends. Management believes that the non-GAAP financial measure of organic sales is meaningful to investors as it provides them with useful information to aid in identifying underlying growth trends in the company’s businesses and facilitates comparisons of its sales performance with prior periods.\nSNAP-ON INCORPORATED\nMANAGEMENT’S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS\nOF OPERATIONS\nRESULTS OF OPERATIONS\nResults of operations for the three months ended September 27, 2025, and September 28, 2024, are as follows:\n\n(Amounts in millions)\nFinancial services revenue\nFinancial services expenses\nSegment operating earnings\nFinancial services revenue of\nof 2025 represented an increase of\n, from last year. In the first\nof 2025 and 2024, the respective average yields on finance receivables were\nof 2025 and 2024, the average yields on contract receivables were\n, respectively. Originations of\nof 2025 represented a decrease of\nFinancial services expenses i\nof 2025 increased $7.2 million from last year primarily due to $4.4 million of higher provisions for credit losses, as well as increased personnel and other costs. As a percentage of the average financial services portfolio, expenses were\n3.9% and 3.6% in the respective first nine months of\nAs a result of these factors, segment operating earnings of\nof 2025 compared to $210.2 million in\nSnap-on’s third quarter 2025 general corporate expenses of $30.1 million compared to $24.2 million last year. The year-over-year increase in general corporate expenses primarily reflects higher stock-based compensation and brand-building costs.\nSNAP-ON INCORPORATED\nMANAGEMENT’S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS\nOF OPERATIONS\nof 2025, general corporate exp\nenses of $79.0 million compared to $49.2 million in 2024. The year-over-year increase primarily reflects benefits from the 2024 legal p\nayments received in the first\n2024, as well as higher brand-building costs in 2025.\nNon-GAAP Supplemental Data\nThe following non-GAAP supplemental data is presented for informational purposes to provide readers with insight into the information used by management for assessing the operating performance of Snap-on’s non-financial services (“Operations”) and Financial Services businesses.\nThe supplemental Operations data reflects the results of operations and financial position of Snap-on’s tools, diagnostics, equipment products, software, and other non-financial services operations with Financial Services presented on the equity method. The supplemental Financial Services data reflects the results of operations and financial position of Snap-on’s U.S. and international financial services operations. The financing needs of Financial Services are met through intersegment borrowings and cash generated from Operations; Financial Services is charged interest expense on intersegment borrowings at market rates. Income taxes are charged to Financial Services on the basis of the specific tax attributes generated by the U.S. and international financial services businesses. Transactions between the Operations and Financial Services businesses are eliminated to arrive at the Condensed Consolidated Financial Statements.\nNon-GAAP Supplemental Consolidating Data – Supplemental Condensed Statements of Earnings information for the three months ended September 27, 2025, and September 28, 2024, is as follows:\n\n(Amounts in millions)\nLIABILITIES AND EQUITY\nCurrent liabilities:\nIntersegment payables\nAccrued compensation\nOther accrued liabilities\nTotal current liabilities\nLong-term debt and intersegment long-term debt\nDeferred income tax liabilities\nRetiree health care benefits\nOperating lease liabilities\nOther long-term liabilities\nTotal shareholders’ equity attributable to Snap-on\nNoncontrolling interests\nTotal liabilities and equity\n* Snap-on with Financial Services presented on the equity method.\nSNAP-ON INCORPORATED\nMANAGEMENT’S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS\nOF OPERATIONS\nLiquidity and Capital Resources\nSnap-on’s growth has historically been funded by a combination of cash provided by operating activities and debt financing. Snap-on believes that its cash from operations and collections of finance receivables, coupled with its sources of borrowings and available cash on hand, are sufficient to fund its currently anticipated requirements for scheduled debt repayments, payments of interest and dividends, new receivables originated by our financial services businesses, capital expenditu"
}