{
  "source_file": "so-20241231.htm",
  "form_type": "10-K",
  "item1_clean": "Index to Financial Statements\ninvestors receive substantially all of the tax benefits from the facilities, including ITCs and PTCs. In addition, Southern Power holds controlling interests in non-tax equity partnerships with its ownership interests primarily ranging from 51% to 66%.\nSee PROPERTIES in Item 2 herein for additional detail regarding Southern Power's partnership arrangements and Note 15 to the financial statements under \"Southern Power\" in Item 8 herein for additional information regarding Southern Power's acquisitions, dispositions, construction, and development projects.\nSouthern Power calculates an investment coverage ratio for its generating assets, including those owned with various partners, based on the ratio of investment under contract to total investment using the respective facilities' net book value (or expected in-service value for facilities under construction) as the investment amount. With the inclusion of investments associated with facilities under construction, as well as other capacity and energy contracts, Southern Power's average investment coverage ratio at December 31, 2024 was 96% through 2029 and 87% through 2034, with an average remaining contract duration of approximately 12 years. For the year ended December 31, 2024, approximately 46% of contracted MWs were with AAA to A- or equivalent rated counterparties, 46% were with BBB+ to BBB- or equivalent rated counterparties, and 6% were with unrated entities that either have ratemaking authority or have posted collateral to cover potential credit exposure.\nSouthern Power's electricity sales from natural gas generating facilities are primarily through long-term PPAs that consist of two types of agreements. The first type, referred to as a unit or block sale, is a customer purchase from a dedicated plant unit where all or a portion of the generation from that unit is reserved for that customer. Southern Power typically has the ability to serve the unit or block sale customer from an alternate resource. The second type, referred to as requirements service, provides that Southern Power serves the customer's capacity and energy requirements from a combination of the customer's own generating units and from Southern Power resources not dedicated to serve unit or block sales. Southern Power has rights to purchase power provided by the requirements customers' resources when economically viable. Capacity charges that form part of the PPA payments are designed to recover fixed and variable operations and maintenance costs based on dollars-per-kilowatt year and to provide a return on investment.\nSouthern Power's electricity sales from solar and wind generating facilities are also primarily through long-term PPAs; however, these solar and wind PPAs do not have a capacity charge and customers either purchase the energy output of a dedicated renewable facility through an energy charge or provide Southern Power a certain fixed price for the electricity sold to the grid. As a result, Southern Power's ability to recover fixed and variable operations and maintenance expenses is dependent upon the level of energy generated from these facilities, which can be impacted by weather conditions, equipment performance, transmission constraints, and other factors. Generally, under the renewable generation PPAs, the purchasing party retains the right to keep or resell the renewable energy credits.\nSouthern Power actively pursues replacement PPAs prior to the expiration of its current PPAs and anticipates that the revenues attributable to one customer may be replaced by revenues from a new customer; however, the expiration of any of Southern Power's current PPAs without the successful remarketing of a replacement PPA could have a material negative impact on Southern Power's earnings but is not expected to have a material impact on Southern Company's earnings.\nSouthern Company Gas\nSouthern Company Gas is an energy services holding company whose primary business is the distribution of natural gas through the natural gas distribution utilities. Southern Company Gas is also involved in several other businesses that are complementary to the distribution of natural gas, including gas pipeline investments and gas marketing services. Southern Company Gas also has an \"all other\" non-reportable segment that includes segments below the quantitative threshold for separate disclosure. See Note 15 to the financial statements under \"Southern Company Gas\" in Item 8 herein for information regarding Southern Company Gas' recent dispositions.\nGas distribution operations, the largest segment of Southern Company Gas' business, operates, constructs, and maintains approximately 78,500 miles of natural gas pipelines and 14 storage facilities, with total capacity of 157 Bcf, to provide natural gas to residential, commercial, and industrial customers. Gas distribution operations serves approximately 4.4 million customers across four states.\nGas pipeline investments primarily consists of joint ventures in natural gas pipeline investments including a 50% interest in SNG and a 50% joint ownership interest in the Dalton Pipeline. These natural gas pipelines enable the provision of diverse sources of natural gas supplies to the customers of Southern Company Gas. SNG, the largest natural gas pipeline investment, is the owner of a 7,000-mile pipeline connecting natural gas supply basins in Texas, Louisiana, Mississippi, and Alabama to markets in Louisiana, Mississippi, Alabama, Florida, Georgia, South Carolina, and Tennessee. SNG is developing a proposed pipeline project, designed to meet customer demand by increasing SNG's existing pipeline capacity by approximately 1.3 billion cubic feet per day, which the operator of the joint venture anticipates will be completed by 2029. The ultimate outcome of this matter cannot be determined at this time. See MANAGEMENT'S DISCUSSION AND ANALYSIS – FUTURE EARNINGS POTENTIAL – \"Construction Programs\" in Item 7 herein for additional information.\nI-3\n\nIndex to Financial Statements\nGenerally, the traditional electric operating companies have experienced, and expect to continue to experience, competition in their respective retail service territories in varying degrees from the development and deployment of alternative energy sources such as self-generation (as described below) and distributed generation technologies, as well as other factors. Further technological advancements or the implementation of policies in support of alternative energy sources may result in further competition.\nSouthern Power competes with investor-owned utilities, IPPs, and others for wholesale energy sales across various U.S. utility markets. The needs of these markets are driven by the demands of end users and the generation available. Southern Power's success in wholesale energy sales is influenced by various factors including reliability and availability of Southern Power's plants, availability of transmission to serve the demand, price, and Southern Power's ability to contain costs.\nAs of December 31, 2024, Alabama Power had cogeneration contracts in effect with seven industrial customers. Under the terms of these contracts, Alabama Power purchases excess energy generated by such companies. During 2024, Alabama Power purchased approximately 120 million KWHs from such companies. The related costs were immaterial.\nAs of December 31, 2024, Georgia Power had contracts in effect to purchase alternative energy generation from 40 IPPs within the state of Georgia. During 2024, Georgia Power purchased 6.9 billion KWHs from such companies at a cost of $320 million. Georgia Power also has PPAs for electricity at cogeneration facilities with six industrial customers. Payments are subject to reductions for failure to meet minimum capacity output. During 2024, Georgia Power purchased 767 million KWHs at a cost of $72 million from these facilities.\nAs of December 31, 2024, Mississippi Power had a cogeneration agreement in effect with one of its industrial customers. Under the terms of this contract, Mississippi Power purchases any excess generation. During 2024, Mississippi Power did not make any such purchases.\nSouthern Company Gas' natural gas distribution utilities do not compete with other distributors of natural gas in their exclusive franchise territories but face competition from other energy products. Their principal competitors are electric utilities and fuel oil and propane providers serving the residential, commercial, and industrial markets in their service areas for customers who are considering switching to or from a natural gas appliance.\nCompetition for heating as well as general household and small commercial energy needs generally occurs at the initial installation phase when the customer or builder makes decisions as to which types of equipment to install. Customers generally use the chosen energy source for the life of the equipment.\nCustomer demand for natural gas could be affected by numerous factors, including:\nchanges in the availability or price of natural gas and other forms of energy;\ngeneral economic conditions;\nenergy conservation, including state-supported energy efficiency programs;\nlegislation and regulations, including certain bans on the use of natural gas in new or existing construction and electrification initiatives;\nthe cost and capability to convert from natural gas to alternative energy products; and\ntechnological or regulatory changes resulting in displacement or replacement of natural gas appliances.\nSouthern Company Gas has natural gas-related programs that generally emphasize natural gas as the fuel of choice for customers and seek to expand the use of natural gas through a variety of promotional activities. In addition, Southern Company Gas partners with third-party entities to market the benefits of natural gas appliances.\nSeasonality and Demand\nThe demand for electric power and natural gas supply is affected by seasonal differences in the weather. While the electric power sales of some electric utilities peak in the summer, others peak in the winter. In the aggregate, during normal weather conditions, the Southern Company system's electric power sales peak during both the summer and winter. In most of the areas Southern Company Gas serves, natural gas demand peaks during the winter. As a result, the overall operating results of the Registrants in the future may fluctuate substantially on a seasonal basis. In addition, the Subsidiary Registrants have historically sold less power and natural gas when weather conditions are milder.\nSee MANAGEMENT'S DISCUSSION AND ANALYSIS – FUTURE EARNINGS POTENTIAL – \"General\" and – RESULTS OF OPERATIONS – \"Southern Company Gas\" in Item 7 herein for information regarding trends in market demand for electricity and natural gas and the impact of seasonality on Southern Company Gas' business, respectively.\nI-9\n\nBUSINESS\nSouthern Company is a holding company that owns all of the outstanding common stock of three traditional electric operating companies, Southern Power Company, and Southern Company Gas.\nThe traditional electric operating companies – Alabama Power, Georgia Power, and Mississippi Power – are each operating public utility companies providing electric service to retail customers in three Southeastern states in addition to wholesale customers in the Southeast.\nSouthern Power Company is also an operating public utility company. The term \"Southern Power\" when used herein refers to Southern Power Company and its subsidiaries, while the term \"Southern Power Company\" when used herein refers only to the Southern Power parent company. Southern Power develops, constructs, acquires, owns, operates, and manages power generation assets, including renewable energy projects, and sells electricity at market-based rates in the wholesale market.\nSouthern Company Gas is an energy services holding company whose primary business is the distribution of natural gas in four states – ",
  "item7_clean": "MANAGEMENT'S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS\nCombined Management's Discussion and Analysis of Financial Condition and Results of Operations\nII-\nResults of Operations\nII-\nII-\nII-\nII-\nII-\nII-\nSouthern Company Gas\nII-\nFuture Earnings Potential\nII-\nII-\nFinancial Condition and Liquidity\nII-",
  "item2_clean": null
}