{
  "source_file": "so-20250930.htm",
  "form_type": "10-Q",
  "item1_clean": null,
  "item7_clean": null,
  "item2_clean": "Index to Financial Statements\nMANAGEMENT'S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION\nAND RESULTS OF OPERATIONS (Continued)\nIn the third quarter 2025, net loss increased $5 million when compared to the corresponding period in 2024. The change was primarily due to higher interest expense as a result of higher average outstanding borrowings.\nFor year-to-date 2025, net loss was $7 million compared to net income of $3 million for the corresponding period in 2024. The change was primarily due to lower revenue at the renewable natural gas business.\nFUTURE EARNINGS POTENTIAL\nEach Registrant's results of operations are not necessarily indicative of its future earnings potential. The level of the Registrants' future earnings depends on numerous factors that affect the opportunities, challenges, and risks of the Registrants' primary businesses of selling electricity and/or distributing natural gas, as described further herein. The Registrants are unable to predict changes in law, regulations, regulatory guidance, legal interpretations, policy positions, and implementation actions that may result from the presidential administration.\nFor the traditional electric operating companies, these factors include the ability to maintain constructive regulatory environments that allow for the timely recovery of prudently-incurred costs during a time of increasing costs, including those related to projected long-term demand growth, stringent environmental standards, including CCR rules, safety, system reliability and resiliency, fuel, restoration following major storms, and capital expenditures, including constructing new electric generating plants, extending the retirement dates of certain fossil fuel plants, and expanding and improving the transmission and distribution systems; continued customer growth; and the trends of an uncertain inflationary environment and reduced electricity usage per customer, especially in residential and commercial markets.\nEarnings in the electricity business will also depend upon maintaining and growing sales and pricing of large customers such that incremental costs are met with adequate incremental revenues, considering, among other things, recent trends driving projected growth in electricity consumption including the increasing digitization of the economy and growth in data centers, an increase in industrial activity in the Southern Company system's electric service territory, and continued electrification of transportation. Historically, the traditional electric operating companies have entered into large contracts that support economic development and benefit existing customers; since 2023, the traditional electric operating companies have contracts with new customers covering approximately eight gigawatts of such electric load, with each contract individually representing a maximum annual electric load greater than 100 MWs, that have been signed and/or reviewed by the state regulatory commissions. These new contracts fully ramp up over several years after commencement of service. Some of these contracts are already in effect. Service under the contracts is expected to begin through 2028. The contracts contain various terms and conditions, such as minimum duration, minimum bill provisions, contribution by the customer to local construction costs, termination payment requirements, and financial security, to help ensure adequate incremental revenues associated with incremental cost to serve these customers. These growth opportunities may be affected by a variety of factors, such as energy efficiency, reliability and operational factors, customer demand, and government policies, which could increase or decrease the pace of growth associated with these opportunities. See Note (B) to the Condensed Financial Statements under \"Georgia Power – Integrated Resource Plans\" for additional information regarding Georgia Power's related regulatory proceedings.\nEconomic uncertainty and policy uncertainty have increased the volatility of future economic outlooks above historical norms. Significant changes in fiscal, monetary, or trade policies could disrupt anticipated economic outlooks. This uncertainty in economic growth, interest rates, tariffs, and inflation could impact customer demand for energy, access to capital markets, and the cost of doing business. The shifting economic policy variables and weakening of historic relationships among economic activity, prices, and employment have increased the uncertainty of future levels of economic activity, which will directly impact future energy demand and operating\n\nIndex to Financial Statements\nMANAGEMENT'S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION\nAND RESULTS OF OPERATIONS (Continued)\nOperating expenses increased $56 million primarily due to a $21 million increase in cost of natural gas as a result of higher gas prices and higher volumes sold compared to 2024, a $15 million increase in depreciation primarily due to additional plant in service related to continued investments at the natural gas distribution utilities, a $7 million increase related to employee compensation and benefit expenses, a $6 million increase related to expenses passed through to customers, and a $5 million increase in legal expenses, partially offset by a decrease of $8 million related to certain deferred expenses.\nInterest expense, net of amounts capitalized increased $14 million primarily due to higher average outstanding borrowings.\nIncome taxes decreased $11 million primarily as a result of lower pre-tax earnings and the flowback of excess state deferred income taxes.\nFor year-to-date 2025, net income increased $14 million, or 3.5%, when compared to the corresponding period in 2024, as described further below:\nOperating revenues increased $294 million primarily due to higher gas cost recovery and base rate increases. Gas costs recovered through natural gas revenues generally equal the amount expensed in cost of natural gas.\nOperating expenses increased $275 million primarily due to a $166 million increase in cost of natural gas as a result of higher gas prices and higher volumes sold compared to 2024, a $49 million increase related to expenses passed through to customers, a $43 million increase in depreciation primarily due to additional plant in service related to continued investments at the natural gas distribution utilities, and a $22 million increase related to employee compensation and benefit expenses, partially offset by a decrease of $20 million related to certain deferred expenses.\nInterest expense, net of amounts capitalized increased $23 million primarily due to higher average outstanding borrowings.\nIncome taxes decreased $16 million primarily as a result of the flowback of excess state deferred income taxes and lower pre-tax earnings.\nGas Pipeline Investments\nThe gas pipeline investments segment consists primarily of joint ventures in natural gas pipeline investments including SNG and Dalton Pipeline. See Note (E) to the Condensed Financial Statements under \"Southern Company Gas\" herein for additional information.\nIn the third quarter and year-to-date 2025, net income decreased $4 million and $15 million, respectively, when compared to the corresponding periods in 2024. The decreases were primarily due to lower rates at SNG.\nGas Marketing Services\nThe gas marketing services segment provides energy-related products and services to natural gas markets and participants in customer choice programs that were approved in various states to increase competition. These programs allow customers to choose their natural gas supplier while the local distribution utility continues to provide distribution and transportation services. Gas marketing services is weather sensitive and uses a variety of hedging strategies, such as weather derivative instruments and other risk management tools, to partially mitigate potential weather impacts.\nIn the third quarter 2025, net income was $3 million compared to a net loss of $2 million for the corresponding period in 2024. The change was primarily due to higher retail margins, partially offset by higher income taxes.\nFor year-to-date 2025, net income increased $5 million, or 6.9%, when compared to the corresponding period in 2024 primarily due to higher retail margins, partially offset by an increase in employee compensation and benefits and proceeds from a legal settlement received in 2024.\n\nIndex to Financial Statements\nMANAGEMENT'S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION\nAND RESULTS OF OPERATIONS (Continued)\nUpgrades to Plant McIntosh Units 10 and 11 (1,319 MWs) for a projected 194 MWs of incremental capacity by 2028 and Plant McIntosh Units 1 through 8 (640 MWs) for a projected 74 MWs of incremental capacity by 2033.\nUpgrades to Plant Vogtle Units 1 and 2 (1,060 MWs based on 45.7% ownership) for a projected 54 MWs of incremental capacity, some of which could be available as early as 2028.\nInvestments related to the continued reliable hydro operations of four facilities, as well as the authority to spend up to $25 million to undertake engineering studies related to two additional hydro facilities.\nRFP for at least 1,100 MWs of utility scale and distributed generation renewable resources.\nSee Note (B) to the Condensed Financial Statements under \"Georgia Power – Integrated Resource Plans\" herein for additional information.\nOn April 3, 2025, the FERC approved a settlement agreement filed by Mississippi Power and Cooperative Energy in December 2024, as part of the MRA tariff.\nOn June 17, 2025, the Mississippi PSC approved Mississippi Power's annual retail PEP filing for 2025, resulting in an annual increase in revenues of approximately 4.0%, or $41 million. In accordance with the PEP rate schedule, an increase of 2.0% of total retail revenues, or approximately $22 million, became effective with the first billing cycle of April 2025, and the remaining approximately $19 million became effective with the first billing cycle of July "
}