{
  "source_file": "solv-20250930.htm",
  "form_type": "10-Q",
  "item1_clean": null,
  "item7_clean": null,
  "item2_clean": "Net Sales by Geographic Area\nWhile the Company manages its businesses globally and believes its business segment results are the most relevant measure of performance, the Company also utilizes geographic area data as a secondary performance measure. Sales are generally reported within the geographic area based on the location of the customer taking possession of the products or in which services are rendered.\nPercent change information compares the three and nine months ended September 30, 2025 with the same period for the prior year, unless otherwise indicated.\nThree months ended September 30, 2025\n% of worldwide sales\nNine months ended September 30, 2025\nNet sales (millions)\n% of worldwide sales\nAdditional information beyond what is included in the preceding table is as follows:\nThird quarter 2025 results:\nIn the United States geographic area, both total sales and organic sales increased. Organic growth occurred across all segments, led by MedSurg and Health Information Systems.\nIn the International geographic area, total sales decreased while organic sales increased. Organic growth was led by Dental Solutions.\nFirst nine months 2025 results:\nIn the United States geographic area, both total sales and organic sales increased. Organic growth occurred across all segments, led by MedSurg and Health Information Systems.\nIn the International geographic area, both total sales and organic sales increased. Organic growth was led by MedSurg, partially offset by a decline in Purification and Filtration.\nManaging currency risks\nPrior to April 1, 2024, Solventum indirectly participated in 3M’s centrally managed hedging program. Starting in the second quarter of 2024, Solventum established its own hedging program. Refer to Note 11 to the condensed consolidated financial statements for additional details.\nForeign currency had a positive worldwide impact on sales for the third quarter 2025 compared to the same period last year. The worldwide impact on sales for the nine months ended 2025 was positive compared to the same period last year. Solventum estimates that year-on-year foreign currency transaction effects, including hedging impacts, decreased pre-tax income by\n\nOperating Segments and Sales Change Information\nSolventum manages its operations in three business segments: MedSurg, Dental Solutions, and Health Information Systems. On February 25, 2025, the Company entered into a Transaction Agreement to sell its Purification and Filtration business to Buyer. On June 25, 2025, the Company and Buyer entered into an additional Agreement to exclude the Company’s Water Business from the scope of the Business to be acquired by Buyer. On September 1, 2025, Solventum completed the sale of the Business to the Buyer in accordance with the terms of the Agreement. The cash consideration paid to Solventum at closing was approximately $4 billion. Refer to Note 3, “Acquisitions and Divestitures” for additional information.\nReferences are made to organic sales change, which is defined as the change in net sales, absent the separate impacts on sales from foreign currency translation and acquisitions, net of divestitures. Constant currency, as reflected in the tables below, is defined as the change in net sales absent the impact on sales from foreign currency translation. Other, as comprised in the tables below, includes acquisition and divestiture-related activities. Acquisitions include non-health care related supply agreements that conveyed from 3M to the Company at Spin-Off and sales from new supply agreements with 3M that commenced at Spin-Off. Divestiture impacts include lost sales from both the Company’s Purification and Filtration business that was sold in September 2025 and the dental anesthetics business that was sold in August 2023, as well as lost sales from certain health care businesses retained by 3M India in connection with the Spin-Off. Solventum believes this information is useful to investors and management in understanding ongoing operations and in analysis of ongoing operating trends.\nSales and operating income by business segment:\nThe following tables contain sales and operating results by business segment for all periods presented. The Company’s use of the term “NM” reflects results considered not material due to either not having material activity in comparable prior years or is not meaningful. Refer to the section entitled\n—Performance by Business Segment\nbelow for discussion of sales change and operating performance. Refer to Note 17 to the condensed consolidated financial statements for additional information on business segments.\nSegment and Total Company Net Sales\nThree months ended September 30,\nInfection Prevention and Surgical Solutions\nHealth Information Systems\nPurification and Filtration\nNine months ended September 30,\n(Dollars in millions)\nInfection Prevention and Surgical Solutions\nHealth Information Systems\nPurification and Filtration\n\napproximately $4 million and increased pre-tax income by approximately $6 million for the three and nine months ended September 30, 2025, respectively.\nRefer to the section entitled\n—Financial Condition and Liquidity\nbelow for a discussion of items impacting cash flows.\nResults of Operations\nRefer to the preceding\n—Performance by Business Segment\nsection later in MD&A for discussion of sales change.\nThree months ended September 30,\nNine months ended September 30,\n(Percent of corresponding net sales)\nCost of software and rentals\nCost of product includes manufacturing, engineering and freight costs.\nCost of product, measured as a percent of sales of product, increased in the third quarter of 2025 when compared to the third quarter of 2024. The increase was driven by increased costs due to the impact of higher sourcing costs from tariffs and inventory sourced under the master supply and transition manufacturing agreements with 3M, partially offset by benefits from cost savings programs.\nCost of product, measured as a percent of sales of product, increased in the first nine months of 2025 when compared to the first nine months of 2024. The increase was driven by increased costs due to the impact of higher sourcing costs from tariffs and inventory sourced under the master supply and transition manufacturing agreements with 3M partially offset by benefits from cost savings programs.\nCost of Software and Rentals\nCost of software and rentals includes compensation-related costs associated with installation, training and maintenance for our software products, and depreciation, maintenance and refurbishment cost and freight costs related to our hardware rental units.\nCost of software and rentals, measured as a percent of sales of software and rentals, decreased during the third quarter of 2025 as compared to the same period last year due to the impact, primarily driven by benefits from lower external license fees and product mix benefit from higher sales of our revenue cycle management solutions.\nCost of software and rentals, measured as a percent of sales of software and rentals, decreased during the first nine months of 2025 as compared to the same period last year due to the impact of lower external license fees, price and sales mix, primarily driven by higher sales of our revenue cycle management solution.\nThree months ended September 30,\nNine months ended September 30,\n(Percent of total net sales)\nSelling, general and administrative (SG&A)\nResearch and development (R&D)\nGain on sale of business\n\nSelling, General and Administrative\nSG&A, measured as a percent of total net sales, increased in the third quarter of 2025 when compared to the same period last year. The increase was driven by higher costs associated with activities to separate operations from 3M, costs incurred to separate the Purification and Filtration business, and higher compensation expense, including equity-based awards, partially offset by benefits from the Solventum Way restructuring program.\nSG&A, measured as a percent of total net sales, increased in the first nine months of 2025 when compared to the same period last year. The increase was driven by costs incurred to separate the Purification and Filtration business, higher compensation, including equity-based awards, and higher costs associated with both initial stand-up and ongoing operations to support a standalone company.\nResearch and Development\nR&D, measured as a percent of total net sales, decreased in the third quarter of 2025 when compared to the same period last year due to lower cost from the sale of the Purification and Filtration business in relation to higher net sales.\nR&D, measured as a percent of total net sales, decreased in the first nine months of 2025 when compared to the same period last year due to lower cost from the sale of the Purification and Filtration business in relation to higher net sales.\nGain on Sale of Business\nThe Company completed the sale of the Purification and Filtration business in the third quarter of 2025. This resulted in a net gain of $1.5 billion for both the third quarter and first nine months of 2025.\nInterest Expense, Net, Loss on Debt Extinguishment, Net, and Other Expense (Income), Net\nThree months ended September 30,\nNine months ended September 30,\nInterest expense, net\nLoss on debt extinguishment, net\nOther expense (income), net\nInterest expense, net includes interest accrued on debt obligations, offset by interest income from cash and marketable securities. Interest expense, net decreased in the third quarter as compared to the same period last year due to lower interest expense as a result of lower debt outstanding. Interest expense, net increased in the first nine months of 2025 as compared to the same period last year due to a full quarter of interest incurred in the first quarter of 2025 related to the February 2024 issuance of senior notes and March 2024 draw on the senior term loan credit facilities. Refer to Note 9 to the condensed consolidated financial statements for more information.\nLoss on "
}