{
  "source_file": "spg-20250930x10q.htm",
  "form_type": "10-Q",
  "item1_clean": null,
  "item7_clean": null,
  "item2_clean": "Such factors include, but are not limited to: the intensely competitive market environment in the retail real estate industry, the retail industry, including e-commerce; the inability to renew leases and relet vacant space at existing properties on favorable terms; the inability to collect rent due to the bankruptcy or insolvency of tenants or otherwise; the potential loss of anchor stores or major tenants; an increase in vacant space at our properties; the loss of key management personnel; changes in economic and market conditions that may adversely affect the general retail environment, including but not limited to those caused by inflation, the impact of tariffs and global trade disruptions on us to the extent impacting our tenants, recessionary pressures, wars, escalating geopolitical tensions as a result of the war in Ukraine and the conflicts in the Middle East, and supply chain disruptions; the potential for violence, civil unrest, criminal activity or terrorist activities at our properties; the availability of comprehensive insurance coverage; security breaches that could compromise our information technology or infrastructure; changes in market rates of interest; our international activities subjecting us to risks that are different from or greater than those associated with our domestic operations, including changes in foreign exchange rates; the impact of our substantial indebtedness on our future operations, including covenants in the governing agreements that impose restrictions on us that may affect our ability to operate freely; any disruption in the financial markets that may adversely affect our ability to access capital for growth and satisfy our ongoing debt service requirements; any change in our credit rating; our continued ability to maintain our status as a REIT; changes in tax laws or regulations that result in adverse tax consequences; risks associated with the acquisition, development, redevelopment, expansion, leasing and management of properties; the inability to lease newly developed properties on favorable terms; risks relating to our joint venture properties, including guarantees of certain joint venture indebtedness; reducing emissions of greenhouse gases; environmental liabilities; natural disasters; uncertainties regarding the impact of pandemics, epidemics or public health crises, and the associated governmental restrictions on our business, financial condition, results of operations, cash flow and liquidity; and general risks related to real estate investments, including the illiquidity of real estate investments. The Company discusses these and other risks and uncertainties under the heading \"Risk Factors\" in its annual and quarterly periodic reports filed with the SEC. The Company may update that discussion in subsequent other periodic reports, but except as required by law, the Company undertakes no duty or obligation to update or revise these forward-looking statements, whether as a result of new information, future developments, or otherwise.\nNon-GAAP Financial Measures\nIndustry practice is to evaluate real estate properties in part based on performance measures such as FFO, real estate FFO, diluted FFO per share, real estate FFO per share, NOI, beneficial interest of combined NOI and portfolio NOI. We believe that these non-GAAP measures are helpful to investors because they are widely recognized measures of the performance of REITs and provide a relevant basis for comparison among REITs. We also use these measures internally to measure the operating performance of our portfolio. We are providing different components of NOI, such as Portfolio NOI (a component of beneficial interest of combined NOI that relates to the operational performance of our global real estate portfolio), to provide investors with disaggregated information to further differentiate our global real estate portfolio performance from corporate and other platform investments.\nWe determine FFO based upon the definition set forth by the National Association of Real Estate Investment Trusts (“NAREIT”) Funds From Operations White Paper – 2018 Restatement. Our main business includes acquiring, owning, operating, developing, and redeveloping real estate in conjunction with the rental of real estate. Gain and losses of assets incidental to our\n\ngenerating interest income on cash deposits and investments in loans, including those made to related entities.\nWe focus on high quality real estate across the retail real estate spectrum. We expand or redevelop properties to enhance profitability and market share of existing assets when we believe the investment of our capital meets our risk-reward criteria. We selectively develop new properties in markets we believe are not adequately served by existing retail outlet properties.\nWe routinely review and evaluate acquisition opportunities based on their ability to enhance our portfolio. Our international strategy includes partnering with established real estate companies and financing international investments with local currency to minimize foreign exchange risk.\nTo support our growth, we employ a three-fold capital strategy:\ngenerate the capital necessary to fund growth,\nmaintain sufficient flexibility to access capital in many forms, both public and private, including but not limited to, having in place the Operating Partnership’s $5.0 billion unsecured revolving credit facility, or the Credit Facility, its $3.5 billion supplemental unsecured revolving credit facility, or the Supplemental Facility, and together, the Credit Facilities, and its global unsecured commercial paper note program, or the Commercial Paper program, of $2.0 billion, or the non-U.S. dollar equivalent thereof, and\nmanage our overall financial structure in a fashion that preserves our investment grade credit ratings.\nWe consider FFO, Real Estate FFO, net operating income, or NOI, and portfolio NOI to be key measures of operating performance that are not specifically defined by accounting principles generally accepted in the United States, or GAAP. We use these measures internally to evaluate the operating performance of our portfolio and provide a basis for comparison with other real estate companies. Reconciliations of these measures to the most comparable GAAP measure are included below in this discussion.\nDiluted earnings per share and diluted earnings per unit decreased $0.39 during the first nine months of 2025 to $4.83 from $5.22 for the same period last year. The decrease in diluted earnings per share and diluted earnings per unit was primarily attributable to:\na pre-tax gain during the first quarter of 2024 on the sale of all our remaining interests in Authentic Brands Group, or ABG, of $414.8 million, or $1.11 per diluted share/unit,\nincreased depreciation and amortization in 2025 of $68.0 million, or $0.18 per diluted share/unit, primarily due to our acquisition and development activity,\ndecreased other income of $62.6 million, or $0.17 per diluted share/unit, primarily due to decreased interest income of $46.7 million, or $0.12 per diluted share/unit, and lower distributions and other activity of $15.9 million, or $0.05 per diluted share/unit,\nan unrealized, unfavorable change in fair value of publicly traded equity instruments and bifurcated derivative, net, of $30.8 million, or $0.08 per diluted share/unit, which primarily relates to movements in the fair value of the exchange option within our exchangeable bonds,\nincreased real estate tax expenses of $28.3 million, or $0.08 per diluted share/unit, primarily due to the consolidation of three properties and successful property tax appeals in 2024,\nincreased property operating expenses in 2025 of $27.9 million, or $0.07 per diluted share/unit,\nincreased interest expense of $24.1 million, or $0.06 per diluted share/unit, primarily due to new draws on the Credit Facilities and a Euro term loan issuance subsequent to the third quarter of 2024, and\nincreased home and regional office expenses of $22.4 million, or $0.06 per diluted share/unit, primarily due to increased personnel and compensation costs, partially offset by,\nimproved operating performance and solid core business fundamentals in 2025, as discussed below,\nincreased lease income of $241.6 million, or $0.64 per diluted share/unit,\nincreased income from unconsolidated entities of $230.8 million, or $0.61 per diluted share/unit, the majority of which is due to improved year-over-year operations from other platform investments and improved operations and core fundamentals in our other unconsolidated entities, and\n\nOn April 1, 2025, we acquired the remaining interest in Briarwood Mall from a joint venture partner, resulting in the consolidation of this property.\nOn January 30, 2025, we acquired 100% interest in two luxury outlet destinations in Italy, The Mall Luxury Outlets Firenze, a 264,750 square foot center located in Leccio, nearby Florence, and The Mall Luxury Outlets Sanremo, a 122,300 square foot center located in Sanremo.\nDuring the fourth quarter of 2024, we acquired the remaining interest in Smith Haven Mall from a joint venture partner, resulting in the consolidation of this property.\nDuring the fourth quarter of 2024, we disposed of our interests in two consolidated retail properties.\nAugust 15, 2024, we opened Tulsa Premium Outlets, a 338,472 square foot center in Tulsa, Oklahoma. We own 100% of this center.\nOn February 6, 2024, we acquired an additional interest in Miami International Mall from a joint venture partner, resulting in the consolidation of this property.\nThe following acquisitions, dispositions and openings of equity method investments and properties affected our income from unconsolidated entities in the comparative periods:\nOn March 6, 2025, we opened Jakarta Premium Outlets, a 302,000 square foot center in Indonesia. We own a 50% interest in this center.\nOn December 19, 2024, J.C. Penney acquired the retail operations of SPARC Group and was renamed C"
}