{
  "source_file": "spg-20241231x10k.htm",
  "form_type": "10-K",
  "item1_clean": "subsidiaries and Simon’s Board of Directors and the Company, as well as written charters for each of the standing Committees of Simon’s Board of Directors. In addition, Simon’s Board of Directors has a Code of Business Conduct and Ethics, which applies to all of its officers, directors, and employees and those of its subsidiaries. At least a majority of the members of Simon’s Board of Directors must qualify, and do qualify, as independent under the listing standards of the New York Stock Exchange, or NYSE, and cannot be affiliated with the Simon family, who are significant stockholders in Simon and/or unitholders in the Operating Partnership. In addition, the Audit and Compensation and Human Capital Committees of Simon’s Board of Directors are comprised entirely of independent members who meet the additional independence and financial expert requirements of the NYSE as required.\nThe sale by the Operating Partnership of any property that it owns may have an adverse tax impact on the Simon family or other limited partners of the Operating Partnership. Any transaction between us and the Simon family, including property acquisitions, service and property management agreements and retail space leases, must be approved by the Company’s Audit Committee.\nIn order to avoid any conflict of interest, the Simon charter requires that at least three-fourths of Simon’s independent directors must authorize and require the Operating Partnership to sell any property it owns. Any such sale is subject to applicable agreements with third parties. A noncompetition agreement executed by Herbert Simon, Simon’s Chairman Emeritus, and a noncompetition agreement executed by David Simon, Simon’s Chairman, Chief Executive Officer and President, which remains in effect notwithstanding the expiration of David Simon’s employment agreement in 2019, contain covenants limiting their ability to participate in certain shopping center activities.\nPolicies With Respect To Certain Other Activities\nWe intend to make investments which are consistent with Simon’s qualification as a REIT, unless Simon’s Board of Directors determines that it is no longer in Simon’s best interests to so qualify as a REIT. Simon’s Board of Directors may make such a determination because of changing circumstances or changes in the REIT requirements. Simon has authority to issue shares of its capital stock or other securities in exchange for property. We also have authority to repurchase or otherwise reacquire Simon’s shares, the Operating Partnership’s units, or any other securities. On May 9, 2022, Simon’s Board of Directors authorized a common stock repurchase plan commencing on May 16, 2022. Under the program, the Company could purchase up to $2.0 billion of its common stock during the two-year period ending May 16, 2024 in open market or privately negotiated transactions, at prices that the Company deemed appropriate and subject to market conditions, applicable law, and other factors deemed relevant in the Company’s sole discretion. On February 8, 2024, Simon’s Board of Directors authorized a new common stock repurchase program which replaced the prior repurchase program immediately, where the Company may purchase up to $2.0 billion of its common stock over the next 24 months. As Simon repurchases shares under these programs, the Operating Partnership repurchases an equal number of units from Simon. Simon may also issue shares of its common stock, or pay cash at its option, to holders of units in future periods upon exercise of such holders’ rights under the partnership agreement of the Operating Partnership. Our policy prohibits us from making any loans to the directors or executive officers of Simon for any purpose. We may make loans to the joint ventures in which we participate. Additionally, we may make or buy interests in loans secured by real estate properties owned by others or make investments in companies that own real estate assets.\nThe retail real estate industry is dynamic and competitive. We compete with numerous merchandise distribution channels, including malls, outlet centers, community/lifestyle centers, and other shopping centers in the United States and abroad. We also compete with internet retailing sites and catalogs, including our tenants, which provide retailers with distribution options beyond existing brick and mortar retail properties. The existence of competitive alternatives could have a material adverse effect on our ability to lease space and on the level of rents we can obtain. This results in competition for both the tenants to occupy the properties that we develop and manage as well as for the acquisition of prime sites (including land for development and operating properties). We believe that there are numerous factors that make our properties highly desirable to retailers, including:\nthe quality, location and variety of tenants of our properties;\nour management and operational expertise;\nour extensive experience and relationships with tenants, lenders and suppliers;\nour marketing initiatives and consumer focused strategic corporate alliances; and\nthe efficiency and immediacy of physical retail.\n\nBorrowings under the Supplemental Facility bear interest, at the Company’s election, at either (i) (x) for Term Benchmark Loans, the Adjusted Term SOFR Rate, the applicable Local Rate, the Adjusted EURIBOR Rate, the Adjusted Term CORRA Rate, or the Adjusted TIBOR Rate, (y) for RFR Loans, if denominated in Sterling, SONIA plus a benchmark adjustment, if denominated in Dollars, Daily Simple SOFR plus a benchmark adjustment, and if denominated in Canadian Dollars, Daily Simple CORRA plus a benchmark adjustment or (z) for Daily SOFR Loans, the Adjusted Floating Overnight Daily SOFR Rate, in each case of clauses (x) through (z) above, plus a margin determined by the Company’s corporate credit rating of between 0.650% and 1.400% or (ii) for loans denominated in U.S. Dollars only, the base rate (which rate is equal to the greatest of the prime rate, the NYFRB Rate plus 0.500% or Adjusted Term SOFR Rate for one month plus 1.000%) (the “Base Rate”), plus a margin determined by the Company’s corporate credit rating of between 0.000% and 0.400%. The Supplemental Facility includes a facility fee determined by the Company’s corporate credit rating of between 0.100% and 0.300% on the aggregate revolving commitments under the Supplemental Facility. Based upon our current credit ratings, the interest rate on the Supplemental Facility is SOFR plus 72.5 basis points, plus a spread adjustment to account for the transition from LIBOR to SOFR.\nThe Operating Partnership also has available a global unsecured commercial paper note program, or Commercial Paper program, of $2.0 billion, or the non-U.S. dollar equivalent thereof. The Operating Partnership may issue unsecured commercial paper notes, denominated in U.S. dollars, Euro and other currencies. Notes issued in non-U.S. currencies may be issued by one or more subsidiaries of the Operating Partnership and are guaranteed by the Operating Partnership. Notes are sold under customary terms in the U.S. and Euro commercial paper note markets and rank (either by themselves or as a result of the guarantee described above)\nwith the Operating Partnership’s other unsecured senior indebtedness. The Commercial Paper program is supported by the Credit Facilities and, if necessary or appropriate, we may make one or more draws under the Credit Facilities to pay amounts outstanding from time to time on the Commercial Paper program.\nWe may also finance our business through the following:\nissuance of shares of common stock or preferred stock or warrants to purchase the same;\nissuance of additional units;\nissuance of preferred units;\nissuance of other securities, including unsecured notes and mortgage debt;\ndraws on our Credit Facilities;\nborrowings under the Commercial Paper program; or\nsale or exchange of ownership interests in properties.\nThe Operating Partnership may also issue units to contributors of properties or other partnership interests which may permit the contributor to defer tax gain recognition under the Internal Revenue Code.\nWe do not have a policy limiting the number or amount of mortgages that may be placed on any particular property.\nMortgage financing instruments, however, typically limit additional indebtedness on such properties. Additionally, the Credit Facilities, our unsecured note indentures and other contracts may limit our ability to borrow and contain limits on mortgage indebtedness we may incur as well as certain financial covenants we must maintain.\nTypically, we invest in or form special purpose entities to assist us in obtaining secured permanent financing at attractive terms. Permanent financing may be structured as a mortgage loan on a single property, or on a group of properties, and generally requires us to provide a mortgage lien on the property or properties in favor of an institutional third party, as a joint venture with a third party, or as a securitized financing. For securitized financings, we create special purpose entities to own the properties. These special purpose entities, which are common in the real estate industry, are structured so that they would not be consolidated in a bankruptcy proceeding involving a parent company. We decide upon the structure of the financing based upon the best terms then available to us and whether the proposed financing is consistent with our other business objectives. For accounting purposes, we include the outstanding securitized debt of special purpose entities owning consolidated properties as part of our consolidated indebtedness.\nConflict of Interest\nWe maintain policies and have entered into agreements designed to reduce or eliminate potential conflicts of interest. Simon has adopted governance principles governing the function, conduct, selection, orientation and duties of its\n\nBecause Simon’s REIT qualification requires Simon to distribute at least 90% of its REIT taxable income, we regularly access the debt markets to raise the funds necessary to finance acquisitions, develop and redevelop properties, and refinance maturing debt. We must comply with the covenants contained in our financing agreements that limit our ratio of debt to total assets or market value, as defined. The Operating Partnership has a $5.0 billion unsecured revolving credit facility, or the Credit Facility, and a $3.5 billion supplemental unsecured revolving credit facility, or Supplemental Facility, or together, the Credit Facilities. The Credit Facilities and the indentures for the Operating Partnership’s debt securities contain covenants that restrict the total amount of debt of the Operating Partnership to 65%, or 60% in relation to certain debt, of total assets, as defined under the related agreements, and secured debt to 50% of total assets. In addition, these agreements contain other covenants requiring compliance with financial ratios. Furthermore, the amount of debt that we may incur is limited as a practical matter by our desire to maintain acceptable ratings for the debt securities of the Operating Partnership. We strive to maintain investment grade ratings at all times for various business reasons, including their effect on our ability to access attractive capital, but we cannot assure you that we will be able to do so in the future.\nIf Simon’s Board of Directors determines to seek additional capital, we may raise such capital by offering equity or incurring debt, creating joint ventures with existing ownership interests in properties, entering into joint venture arrangements for new development projects, retaining cash flows or a combination of these methods. If Simon’s Board of Directors determines to raise equity capital, it may, without stockholder approval, issue additional shares of common stock or other capital stock. Simon’s Board of Directors may issue a number of shares up to the amount of our authorized capital",
  "item7_clean": "During the third quarter of 2023, we acquired an additional 4% ownership in TRG for approximately $199.6 million by issuing 1,725,000 units in the Operating Partnership, bringing our noncontrolling ownership interest in TRG to 84%.\nDuring the third quarter of 2023, SPARC Group issued equity to a third party resulting in the dilution of our ownership to 33.3% and a deemed disposal of a proportional interest of our investment. As a result, we recognized a non-cash pre-tax gain on the deemed disposal of $145.8 million.\nDuring the fourth quarter of 2022, we disposed of one retail property.\nDuring the fourth quarter of 2022, we sold to ABG all of our interests in the licensing venture of Eddie Bauer for additional interests in ABG. Our noncontrolling interest in ABG was approximately 12.3% after this transaction.\nOn December 19, 2022, we completed the acquisition of a 50% noncontrolling legal ownership interest in Jamestown, a global real estate investment and asset management company, as well as separate interests in certain real estate and working capital, for total cash consideration of $173.4 million.\nOn November 3, 2022, we opened Fukaya-Hanazono Premium Outlets, a 296,300 square foot center in Fukaya City, Japan. We own a 40% interest in this center.\nDuring the third quarter of 2022, we disposed of one retail property.\nFor the purposes of the following comparisons between the years ended December 31, 2024 and 2023 and the years ended December 31, 2023 and 2022, the above transactions are referred to as the property transactions. In the following discussions of our results of operations, “comparable” refers to properties we owned and operated in both years in the year to year comparisons.\nYear Ended December 31, 2024 vs. Year Ended December 31, 2023\nLease income increased $225.4 million, primarily due to an increase in fixed minimum lease consideration, higher occupancy, and the consolidation of two properties during 2024.\nOther income increased $72.3 million, primarily due to a $76.4 million increase in interest income and a $13.6 million increase in land sale activity, partially offset by a decrease in franchise operations of $27.9 million.\nProperty operating expense increased $40.4 million as a result of inflationary cost increases and the consolidation of two properties.\nReal estate taxes decreased $33.1 million primarily due to successful property tax appeals, the majority of which relates to prior years.\nAdvertising and promotion expense increased $17.2 million primarily due to increased programming expenses.\nHome and regional office costs increased $15.7 million due to increased personnel and compensation costs.\nOther expenses decreased $38.2 million primarily due to a decrease in franchise operations.\nInterest expense increased $51.1 million primarily related to an increase of $81.8 million due to new USD unsecured bond issuances, an increase of $35.0 million due to the Euro exchangeable bond issuance in 2023, an increase of $6.1 million on secured debt and the effect of the balance increase of the Credit Facility during 2023 of $1.4 million, partially offset by a decrease of $46.1 million due to USD unsecured bond payoffs during 2024 and 2023, and a decrease of $27.1 million due to the Supplemental Facility repayment during 2023.\nGain due to disposal, exchange or revaluation of equity interests, net, increased $89.1 million primarily due to an increase of $414.8 million as a result of selling our remaining interest in ABG during 2024, a non-cash pre-tax $100.5 million gain due to the acquisition by J.C. Penney of the retail operations of SPARC Group, offset by the non-cash pre-tax gains on the deemed disposal of a portion of our investment in ABG of $59.1 million and SPARC Group of $145.8 million and our share of the gain on the sale of a portion of our ABG interest of $157.1 million during 2023, the other-than-temporary impairment charge of $57.0 million in 2024 representing pre-development costs associated with an unconsolidated joint venture development project, and a reduction in the carrying value of certain equity investments of $7.0 million in 2024.\nIncome and other tax expense decreased $58.6 million primarily due to results of operations from our other platform investments and transactions within our TRS, partially offset by the aforementioned ABG, J.C. Penney, and SPARC Group transactions which increased tax expense of $37.8 million year-over-year.\n\nIncome from unconsolidated entities decreased $168.3 million primarily due to lower results of operations from our other platform investments, partially offset by strong results and improved performance by our joint venture properties.\nWe recorded net non-cash unrealized losses of $17.4 million in 2024 compared to net non-cash unrealized gains of $11.9 million in 2023, as a result of mark-to-market activity on publicly traded equity instruments and the change in fair value of a derivative instrument.\nDuring 2024, we recorded a net loss of $75.8 million, which is primarily related to the disposition of two retail properties for a net loss of $69.8 million, an impairment on a joint venture investment of $19.3 million and a $4.1 million loss on the disposition of certain assets by Klépierre, partially offset by a gain from the disposition of a property held in our TRG portfolio, our share of which was $10.6 million and a $4.6 million gain on excess insurance proceeds. During 2023, we recorded an $11.2 million loss on the disposition of certain assets by Klépierre and an impairment on a joint venture property, our share of which was $8.6 million, partially offset by an $8.7 million gain on the disposition of certain assets by a joint venture investment and an $8.1 million gain on excess insurance proceeds.\nSimon’s net income attributable to noncontrolling interests increased $24.2 million due to an increase in the net income of the Operating Partnership.\nYear Ended December 31, 2023 vs. Year Ended December 31, 2022\nLease income increased $259.2 million, due to an increase in fixed lease income of $286.7 million primarily due to an increase in fixed minimum lease consideration and higher occupancy, partially offset by a decrease in variable lease income based on tenant reported sales of $27.5 million.\nTotal other income increased $99.1 million, primarily due to a $56.6 million increase in interest income, a $52.0 million increase in mixed use and franchise operations income, a $13.1 million increase in dividend and distribution income and a $3.7 million increase in Simon Brand Ventures, fee and other income, partially offset by a $17.0 million decrease in lease settlement income and a $9.3 million decrease in land sale activity.\nHome and regional office costs increased $23.0 million primarily due to increased personnel and compensation costs.\nOther expense increased $35.6 million primarily due to increased mixed use and franchise operations expenses of $50.8 million, partially offset by the 2022 write-off of $13.4 million in development costs related to an international development project in Germany we no longer intended to pursue.\nInterest expense increased $93.4 million primarily related to new USD bond issuances during 2023 of $69.5 million, activity with regards to the Credit Facilities of $24.5 million and $8.8 million from increased variable rates, partially offset by a USD bond payoff during 2023 of $14.7 million and a Euro bond payoff during 2022 of $9.8 million.\nDuring 2023, SPARC Group issued equity to a third party resulting in the dilution of our ownership to 33.3% and a deemed disposal of a proportional interest of our investment. As a result, we recognized a non-cash pre-tax gain on the deemed disposal of $145.8 million. During 2023, ABG completed multiple capital transactions which resulted in the dilution of our ownership and multiple deemed disposals of a proportional interest of our investment. As a result, we recognized non-cash pre-tax gains on the deemed disposals of $59.1 million. During 2023, we also recorded our share of the gain on the sale of a portion of our ABG interests of $157.1 million. During 2022, we recorded a $159.0 million non-cash gain as a result of the sale to ABG of all of our interests in the Eddie Bauer licensing venture for additional interests in ABG, partially offset by a loss of $37.8 million on the revaluation or disposal of other investments.\nIncome and other tax expense decreased $1.6 million primarily related to the 2022 Eddie Bauer licensing transaction noted above of $39.7 million and an overall lower tax expense on our share of operating results from our other platform investments of approximately $27.2 million, partially offset by the tax impact of the SPARC and ABG transactions in 2023 noted above of $69.3 million.\nIncome from unconsolidated entities decreased $272.3 million primarily due to lower results of operations from our other platform investments.\nDuring 2023, we recorded an $11.2 million loss on the disposition of certain assets by Klépierre and an impairment on a joint venture property, our share of which was $8.6 million, partially offset by an $8.7 million gain on the disposition of certain assets by a joint venture investment and an $8.1 million gain on excess insurance proceeds. During 2022, we recorded a $19.9 million gain on the disposition of one unconsolidated property, a $2.1 million gain related to excess insurance proceeds and a $1.3 million gain on the disposition of certain assets by Klépierre, partially offset by a $17.7 million loss primarily related to the disposition of one consolidated property.\n\nWe also grow by generating supplemental revenues from the following activities:\nestablishing our properties as leading market resource providers for retailers and other businesses and consumer-focused corporate alliances, including national marketing alliances, static and digital media initiatives, business development, sponsorship, and events,\noffering property operating services to our tenants and others, including waste handling and facility services, and the provision of energy services,\nselling or leasing land adjacent to our properties, commonly referred to as “outlots” or “outparcels,” and\ngenerating interest income on cash deposits and investments in loans, including those made to related entities\nWe focus on high quality real estate across the retail real estate spectrum. We expand or redevelop properties to enhance profitability and market share of existing assets when we believe the investment of our capital meets our risk-reward criteria. We selectively develop new properties in markets we believe are not adequately served by existing retail properties.\nWe routinely review and evaluate acquisition opportunities based on their ability to enhance our portfolio. Our international strategy includes partnering with established real estate companies and financing international investments with local currency to minimize foreign exchange risk.\nTo support our growth, we employ a three-fold capital strategy:\ngenerate the capital necessary to fund growth,\nmaintain sufficient flexibility to access capital in many forms, both public and private, including but not limited to, having in place, the Operating Partnership’s $5.0 billion unsecured revolving credit facility, or the Credit Facility, its $3.5 billion supplemental unsecured revolving credit facility, or its Supplemental Facility, together, the Credit Facilities and its global unsecured commercial paper note program, or the Commercial Paper program, of $2.0 billion, or the non-U.S. dollar equivalent thereof, and\nmanage our overall financial structure in a fashion that preserves our investment grade credit ratings.\nWe consider FFO, Real Estate FFO, net operating income, or NOI, and portfolio NOI to be key measures of operating performance that are not specifically defined by accounting principles generally accepted in the United States, or GAAP. We use these measures internally to evaluate the operating performance of our portfolio and provide a basis for comparison with other real estate companies. Reconciliations of these measures to the most comparable GAAP measures are included below in this discussion.\nDiluted earnings per share and diluted earnings per unit increased $0.28 during 2024 to $7.26 as compared to $6.98 in 2023. The increase in diluted earnings per share and diluted earnings per unit was primarily attributable to:\nimproved operating performance and solid core business fundamentals in 2024, as discussed below,\nincreased lease income in 2024 of $225.4 million, or $0.60 per diluted share/unit,\na pre-tax gain during the first quarter of 2024 on the sale of all our remaining interests in Authentic Brands Group, or ABG, of $414.8 million, or $1.10 per diluted share/unit, and a non-cash pre-tax gain of $100.5 million, or $0.27 per diluted share/unit, during the fourth quarter of 2024 related to the acquisition by J.C. Penney of the retail operations of SPARC Group, partially offset by an other-than-temporary impairment charge of $57.0 million, or $0.15 per diluted share/unit, in the fourth quarter of 2024, representing our pre-development costs associated with an unconsolidated joint venture development project,\nincreased other income of $72.3 million, or $0.19 per diluted share/unit, primarily due to increased interest income of $76.4 million, or $0.20 per diluted share/unit, and an increase in land sales of $13.6 million, or $0.03 per diluted share/unit, partially offset by a decrease in distributions and other income of $17.7 million, or $0.05 per diluted share/unit,\ndecreased income and other tax expense of $58.6 million, or $0.16 per diluted share/unit, primarily due to transactional activity and unfavorable year-over-year results of operations from other platform investments,\n\ndecreased other expenses in 2024 of $38.2 million, or $0.10 per diluted share/unit, partially offset by\npre-tax gains in 2023 due to the disposal, exchange, or revaluation of equity interests of $362.0 million, or $0.96 per diluted share/unit, of which, $204.9 million, or $0.55 per diluted share/unit, was non-cash,\ndecreased income from unconsolidated entities of $168.3 million, or $0.45 per diluted share/unit, the majority of which is due to lower results of operations from other platform investments, partially offset by improved operations and core fundamentals in our other unconsolidated entities,\nincreased interest expense of $51.1 million, or $0.14 per diluted share/unit, primarily due to new USD and EUR bond issuances as well as increases to rates on variable rate mortgages,\nincreased property operating expenses in 2024 of $40.4 million, or $0.11 per diluted share/unit, and\nan unrealized unfavorable change in fair value of publicly traded equity instruments and derivative instrument, net of $29.3 million, or $0.08 per diluted share/unit\nPortfolio NOI increased 4.6% in 2024 as compared to 2023. Average base minimum rent for U.S. Malls and Premium Outlets increased 2.5% to $58.26 psf as of December 31, 2024, from $56.82 psf as of December 31, 2023. Ending occupancy for our U.S. Malls and Premium Outlets increased 0.7% to 96.5% as of December 31, 2024, from 95.8% as of December 31, 2023, primarily due to strong leasing demand.\nOur effective overall borrowing rate at December 31, 2024 on our consolidated indebtedness increased 13 basis points to 3.62% as compared to 3.49% at December 31, 2023. This increase was primarily due to an increase in the effective overall borrowing rate on the fixed rate debt of 14 basis points, due to increasing benchmark rates on new USD and EUR bond issuances. The weighted average years to maturity of our consolidated indebtedness was 8.1 years at December 31, 2024 and 2023.\nOur financing activity for the year ended December 31, 2024 included:\ncompleting, on October 1, 2024, the redemption at par of the Operating Partnerships $900 million 3.38% senior unsecure notes at maturity,\nthe O",
  "item2_clean": null
}