{
  "source_file": "spgi-20241231.htm",
  "form_type": "10-K",
  "item1_clean": "S&P Global Inc. (together with its consolidated subsidiaries, “S&P Global,” the “Company,” the “Registrant,” “we,” “us” or “our”) is a provider of credit ratings, benchmarks, analytics and workflow solutions in the global capital, commodity and automotive markets. The capital markets include asset managers, investment banks, commercial banks, insurance companies, exchanges, trading firms and issuers; the commodity markets include producers, consumers, traders and intermediaries within energy, chemicals, shipping, metals, carbon and agriculture; and the automotive markets include manufacturers, suppliers, dealerships, service shops and customers. We serve our global customers through a broad range of products and services available through both third-party and proprietary distribution channels. We were incorporated in December of 1925 under the laws of the state of New York.\nOur operations consist of five businesses: S&P Global Market Intelligence (“Market Intelligence”), S&P Global Ratings (“Ratings”), S&P Global Commodity Insights (“Commodity Insights”), S&P Global Mobility (“Mobility”) and S&P Dow Jones Indices (“Indices”). As of May 2, 2023, we completed the sale of S&P Global Engineering Solutions (“Engineering Solutions”), a provider of engineering standards and related technical knowledge, and the results are included through that date. For a discussion on the competitive conditions and regulatory environment associated with our businesses, see “MD&A – Segment Review” contained in Item 7,\nManagement’s Discussion and Analysis of Financial Condition and Results of Operations\nMarket Intelligence is a global provider of multi-asset-class data and analytics integrated with purpose-built workflow solutions. Market Intelligence’s portfolio of capabilities are designed to help trading and investment professionals, government agencies, corporations and universities track performance, generate alpha, identify investment ideas, understand competitive and industry dynamics, perform valuations and manage credit risk. Key customers served by Market Intelligence include investment managers, investment banks, private equity firms, insurance companies, commercial banks, corporations, professional services firms, government agencies and regulators.\nMarket Intelligence includes the following business lines:\na product suite that provides data, analytics and third-party research for global finance and corporate professionals, which includes the Capital IQ platforms (which are inclusive of S&P Capital IQ Pro, Capital IQ, Office and Mobile products);\nData & Advisory Solutions\na broad range of research, reference data, market data, derived analytics and valuation services covering both the public and private capital markets, delivered through flexible feed-based or API delivery mechanisms. This also includes issuer solutions for public companies, a range of products for the maritime & trade market, data and insight into Financial Institutions, the telecoms, technology and media space as well as energy transition and sustainability and supply chain data analytics;\nEnterprise Solutions\nsoftware and workflow solutions that help our customers manage and analyze data; identify risk; reduce costs; and meet global regulatory requirements. The portfolio includes industry leading financial technology solutions like Wall Street Office, Enterprise Data Manager, Information Mosaic, and iLevel. Our Global Markets Group offering delivers bookbuilding platforms across multiple assets including municipal bonds, equities and fixed income; and\nCredit & Risk Solutions\ncommercial arm that sells Ratings’ credit ratings and related data and research, advanced analytics, and financial risk solutions which includes subscription-based offerings, RatingsXpress®, RatingsDirect® and Credit Analytics.\nSubscription revenue at Market Intelligence is primarily derived from distribution of data, valuation services, analytics, third party research, and credit ratings-related information through both feed and web-based channels. Subscription revenue also includes software and hosted product offerings which provide maintenance and continuous access to our platforms over the contract term. Recurring variable revenue at Market Intelligence represents revenue from contracts for services that specify a\n\nfee based on, among other factors, the number of trades processed, assets under management, or the number of positions valued. Non-subscription revenue at Market Intelligence is primarily related to certain advisory, pricing conferences and events, and analytical services.\nRatings is an independent provider of credit ratings, research, and analytics, offering investors and other market participants information, ratings and benchmarks. Credit ratings are one of several tools investors can use when making decisions about purchasing bonds and other fixed income investments. They are opinions about credit risk and our ratings express our opinion about the ability and willingness of an issuer, such as a corporation or state or city government, to meet its financial obligations in full and on time. Our credit ratings can also relate to the credit quality of an individual debt issue, such as a corporate or municipal bond, and the relative likelihood that the issue may default.\nWith offices in over 25 countries around the world, Ratings is an important part of the world’s financial infrastructure and has played a leading role for over 150 years in providing investors with information and independent benchmarks for their investment and financial decisions as well as access to the capital markets. The key constituents Ratings serves are investors, corporations, governments, municipalities, commercial and investment banks, insurance companies, asset managers, and other debt issuers.\nAs the capital markets continue to evolve, Ratings is well-positioned to capitalize on opportunities, driven by continuing regulatory changes, through its global network, well-established position in corporate markets and strong investor reputation.\nRatings disaggregates its revenue between transaction and non-transaction. Transaction revenue primarily includes fees associated with:\nratings related to new issuance of corporate and government debt instruments, as well as structured finance debt instruments; and\nNon-transaction revenue primarily includes fees for surveillance of a credit rating, annual fees for customer relationship-based pricing programs, fees for entity credit ratings and global research and analytics at Crisil.\nCommodity Insights is a leading independent provider of information and benchmark prices for the commodity and energy markets. Commodity Insights provides essential price data, analytics, industry insights and software & services, enabling the commodity and energy markets to perform with greater transparency and efficiency. The commodity markets include producers, consumers, traders and intermediaries within energy, chemicals, shipping, metals, carbon and agriculture.\nCommodity Insights includes the following business lines:\nEnergy & Resources Data & Insights\nincludes data, news, insights, and analytics for petroleum, gas, power & renewables, petrochemicals, metals & steel, agriculture, and other commodities;\nincludes price assessments and benchmarks, and forward curves;\nUpstream Data & Insights\nincludes exploration & production data and insights, software and analytics; and\nAdvisory & Transactional Services\nincludes consulting services, conferences, events and global trading services.\nCommodity Insights’ revenue is generated primarily through the following sources:\nSubscription revenue\nprimarily from subscriptions to our market data and market insights (price assessments, market reports and commentary and analytics) along with other information products and software term licenses;\nSales usage-based royalties\nprimarily from licensing our proprietary market price data and price assessments to commodity exchanges; and\nNon-subscription revenue\nconference sponsorship, consulting engagements, events, and perpetual software licenses.\n\nMobility is a leading provider of solutions serving the full automotive value chain including vehicle manufacturers (Original Equipment Manufacturers or OEMs), automotive suppliers, mobility service providers, retailers, consumers, and finance and insurance companies.\nMobility includes the following business lines:\nincludes analytics to predict future buyers, targeted marketing, and vehicle history data to allow people to shop, buy, service and sell used cars;\nincludes insights, forecasts and advisory services spanning the entire automotive value chain, from product planning to marketing, sales and the aftermarket; and\nincludes reports and data feeds to support lenders and insurance companies\nMobility’s revenue is generated primarily through the following sources:\nSubscription revenue\nMobility’s core information products provide critical information and insights to all global OEMs, most of the world’s leading suppliers, and the majority of North American dealerships. Mobility operates across both the new and used car markets. Mobility provides data and insight on future vehicles sales and production, including detailed forecasts on technology and vehicle components; supplies car makers and dealers with market reporting products, predictive analytics and marketing automation software; and supports dealers with vehicle history reports, used car listings and service retention solutions. Mobility also sells a range of services to financial institutions, to support their marketing, insurance underwriting and claims management activities; and\nNon-subscription revenue\nOne-time transactional sales of data that are non-cyclical in nature – and that are usually tied to underlying business metrics such as OEM marketing spend or safety recall activity – as well as consulting and advisory services.\nIndices is a global index provider maintaining a wide variety of valuation and index benchmarks for investment advisors, wealth managers and institutional investors. Indices’ mission is to provide transparent benchmarks to help with decision making, collaborate with the financial community to create innovative products, and provide investors with tools to monitor world markets.\nIndices derives revenue from asset-linked fees when investors direct funds into its proprietary designed or owned indexes, sales-usage based royalties of its indices, as well as data subscription arrangements. Specifically, Indices generates revenue from the following sources:\nasset-linked fees such as ETFs and mutual funds, that are based on the S&P Dow Jones Indices’ benchmarks that generate revenue through fees based on assets and underlying funds;\nExchange traded derivatives\ngenerate sales usage-based royalties based on trading volumes of derivatives contracts listed on various exchanges;\nIndex-related licensing fees\nfixed or variable annual and per-issue asset-linked fees for over-the-counter derivatives and retail-structured products; and\nData and customized index subscription fees\nfees from supporting index fund management, portfolio analytics and research.\n\nEngineering Solutions\nAs of May 2, 2023, we completed the sale of Engineering Solutions, a provider of engineering standards and related technical knowledge, and the results are included through that date.\nSegment and Geographic Data\nThe relative contribution of our reportable segments to operating revenue, expenses, operating profit, long-lived assets and geographic area for the three years ended December 31, 2024 are included in Note 12 –\nSegment and Geographic Information\nto the consolidated financial statements under Item 8,\nConsolidated Financial Statements and Supplementary Data\nAs of December 31, 2024, we had approximately 42,350 permanent employees located worldwide, including around 24,450 in Asia, 11,200 in the U.S. and Canada, 5,700 in Europe, Middle East, and Africa, and 1,000 in Lat",
  "item7_clean": "Revenue increased 12% primarily due to the impact of the merger with IHS Markit; subscription revenue growth for Desktop products, RatingsXpress®, RatingsDirect®, and data feed products within Data & Advisory Solutions at Market Intelligence; growth in corporate bond ratings revenue and bank loan ratings revenue due to higher refinancing activity and higher non-transaction revenue due to an increase in surveillance revenue and an increase in revenue at our Crisil subsidiary at Ratings; continued demand for market data and market insights products, higher conference revenue and an increase in sales usage-based royalties from the licensing of our proprietary market data and price assessments to commodity exchanges at Commodity Insights; price increases and new business growth within the Dealer business as well as the favorable impact of the acquisition of Market Scan in February of 2023 at Mobility; and higher exchange-traded derivative revenue and higher data subscription revenue at Indices. These increases were partially offset by a decrease at Engineering Solutions due to its sale on May 2, 2023, a decrease in new entity credit ratings revenue at Ratings and lower over-the-counter derivatives revenue at Indices. Foreign exchange rates had an unfavorable impact of less than 1 percentage point.\nOperating profit decreased 19%. Excluding the unfavorable impact of a higher gain on dispositions in 2022 of 39 percentage points, higher acquisition-related costs in 2023 of 2 percentage points and higher amortization of intangibles in 2023 of 3 percentage points, partially offset by the impact of higher IHS Markit merger costs in 2022 of 8 percentage points, the impact of a S&P Foundation grant in 2022 of 4 percentage points and higher employee severance charges in 2022 of 2 percentage points, operating profit increased 11%. The increase was primarily due to revenue growth, partially offset by expenses associated with the merger with IHS Markit, higher compensation costs and increased incentives. Foreign exchange rates had a favorable impact of 1 percentage point.\nWe are a provider of credit ratings, benchmarks, analytics and workflow solutions in the global capital, commodity and automotive markets. Our purpose is to accelerate progress. We seek to deliver on this purpose in line with our core values of integrity, discovery and partnership.\nPowering Global Markets is the framework for our forward-looking business strategy. Through this framework, we seek to deliver an exceptional, differentiated customer experience by enhancing our foundational capabilities, evolving and growing our core businesses, and pursuing growth via adjacencies. In 2025, we are striving to deliver on our strategic priorities in the following key areas:\nMeeting or exceeding our 2025 enterprise financial and sustainability goals; and\nDelivering targeted capital return to shareholders.\nCustomer at the Core\nEnhancing customer support and seamless user experience with an enterprise mindset and focus on ease of discoverability, distribution, and delivery of our product and services and integrated cross-divisional capabilities;\nGenerating value from technology consolidation projects; and\nExpanding value for targeted strategic accounts.\nProtecting and growing revenue by integrating generative artificial intelligence (“AI”) into product and creating new products; and\nAccelerating growth in transformational adjacencies.\n\nThe following tables provide an analysis by segment of our operating-related expenses and selling and general expenses for the years ended December 31, 2024 and 2023:\nEngineering Solutions\nN/M\nN/M\nIntersegment eliminations\nN/M\nCorporate Unallocated expense\nN/M - Represents a change equal to or in excess of 100% or not meaningful\nIn 2024, selling and general expenses include employee severance charges of $77 million, IHS Markit merger costs of $36 million, a net acquisition-related benefit of $12 million and Executive Leadership Team transition costs of $3 million. In 2023, selling and general expenses include employee severance charges of $90 million, acquisition-related costs of $69 million, IHS Markit merger costs of $49 million, an asset impairment of $5 million and an asset write-off of $1 million.\nIn 2024, selling and general expenses include legal settlement costs of $20 million, a statutorily required bonus accrual adjustment of $6 million and employee severance charges of $5 million. In 2023, selling and general expenses include employee severance charges of $10 million and an asset impairment of $1 million.\nIn 2024, selling and general expenses include IHS Markit merger costs of $14 million, employee severance charges of $13 million, asset write-offs of $1 million and disposition-related costs of $1 million. In 2023, selling and general expenses include IHS Markit merger costs of $35 million, employee severance charges of $26 million and acquisition-related costs of $2 million.\nIn 2024, selling and general expenses include employee severance charges of $7 million, IHS Markit merger costs of $4 million, acquisition-related costs of $2 million and a liability write-off of $1 million. In 2023, selling and general expenses include employee severance charges of $9 million, IHS Markit merger costs of $3 million and acquisition-related costs of $2 million.\nIn 2024, selling and general expenses include IHS Markit merger costs of $4 million and employee severance charges of $1 million. In 2023, selling and general expenses include employee severance charges of $5 million and IHS Markit merger costs of $4 million.\nIntersegment eliminations primarily relate to a royalty charged to Market Intelligence for the rights to use and distribute content and data developed by Ratings.\nIn 2024, selling and general expenses include IHS Markit merger costs of $75 million, employee severance charges of $24 million, acquisition-related costs of $8 million, disposition-related costs of $8 million, Executive Leadership Team transition costs of $5 million, lease impairments of $1 million and an asset write-off of $1 million. In 2023, selling and general expenses include IHS Markit merger costs of $147 million, employee severance charges of $43 million, disposition-related costs of $24 million, lease impairments of $14 million and acquisition-related costs of $4 million.\nOperating-Related Expenses\nOperating-related expenses increased 6% as compared to 2023, primarily driven by higher compensation costs, increased incentives and higher technology costs, partially offset by a decrease at Engineering Solutions due to its sale on May 2, 2023.\nIntersegment eliminations primarily relate to a royalty charged to Market Intelligence for the rights to use and distribute content and data developed by Ratings.\n\nSelling and General Expenses\nSelling and general expenses remained relatively flat, increasing less than 1%. Excluding the impact of higher IHS Markit merger costs in 2023 of 4 percentage points, higher acquisition-related costs in 2023 of 3 percentage points, higher employee severance charges in 2023 of 2 percentage points and higher disposition-related costs in 2023 of 1 percentage point, partially offset by legal settlement costs in 2024 of 1 percentage point, selling and general expenses increased 9%. The increase was primarily driven by increased incentives and higher compensation costs, partially offset by a decrease at Engineering Solutions due to its sale on May 2, 2023.\nDepreciation and Amortization\nDepreciation and amortization was $1,173 million in 2024 compared to $1,143 million in 2023, primarily due to higher intangible asset amortization driven by the acquisition of Visible Alpha in May of 2024.\nThe following tables provide an analysis by segment of our operating-related expenses and selling and general expenses for the years ended December 31, 2023 and 2022:\nEngineering Solutions\nIntersegment eliminations\nN/M\nCorporate Unallocated expense\nN/M - Represents a change equal to or in excess of 100% or not meaningful\nIn 2023, selling and general expenses include employee severance charges of $90 million, acquisition-related costs of $69 million, IHS Markit merger costs of $49 million, an asset impairment of $5 million and an asset write-off of $1 million. In 2022, selling and general expenses include employee severance charges of $90 million, IHS Markit merger costs of $35 million and acquisition-related costs of $2 million.\nIn 2023, selling and general expenses include employee severance charges of $10 million and an asset impairment of $1 million. In 2022, selling and general expenses include employee severance charges of $24 million, legal costs of $5 million and an asset write-off of $1 million.\nIn 2023, selling and general expenses include IHS Markit merger costs of $35 million, employee severance charges of $26 million and acquisition-related costs of $2 million. In 2022, selling and general expenses include employee severance charges of $45 million and IHS Markit merger costs of $26 million.\nIn 2023, selling and general expenses include employee severance charges of $9 million, IHS Markit merger costs of $3 million and acquisition-related costs of $2 million. In 2022, selling and general expenses include acquisition-related benefit of $14 million, employee severance charges of $4 million and IHS Markit merger costs of $3 million.\nIn 2023, selling and general expenses include employee severance charges of $5 million and IHS Markit merger costs of $4 million. In 2022, selling and general expenses include employee severance charges of $14 million and IHS Markit merger costs of $2 million.\nIn 2022, selling and general expenses include employee severance charges of $4 million.\nIntersegment eliminations primarily relate to a royalty charged to Market Intelligence for the rights to use and distribute content and data developed by Ratings.\nIn 2023, selling and general expenses include IHS Markit merger costs of $147 million, employee severance charges of $43 million, disposition-related costs of $24 million, lease impairments of $14 million and acquisition-related costs of $4 million. In 2022, selling and general expenses include IHS Markit merger costs of $553 million, a S&P Foundation grant of $200 million, employee severance charges of $107 million, disposition-related costs of $24 million, a gain on acquisition of $10 million, an asset impairment of $9 million, acquisition-related costs of $8 million, lease impairments of $5 million and an asset write-off of $3 million.\n\nOperating-Related Expenses\nOperating-related expenses increased by 10% as compared to 2022, primarily driven by the impact of the merger with IHS Markit, higher compensation costs and increased incentives.\nIntersegment eliminations primarily relate to a royalty charged to Market Intelligence for the rights to use and distribute content and data developed by Ratings.\nSelling and General Expenses\nSelling and general expenses decreased 7%. Excluding the favorable impact of higher IHS Markit merger costs in 2022 of 14 percentage points, a S&P Foundation grant in 2022 of 8 percentage points and higher employee severance charges in 2022 of 4 percentage points, partially offset by higher acquisition-related costs in 2023 of 3 percentage points, selling and general expenses increased 16%. The increase was primarily driven by the impact of the merger with IHS Markit, higher compensation costs and increased incentives.\nD\nepreciation and Amortization\nDepreciation and amortization was $1,143 million in 2023 compared to $1,013 million in 2022, primarily due to higher intangible asset amortization driven by the impact of the merger with IHS Markit, partially offset by lower intangible asset amortization driven by the sale of Engineering Solutions on May 2, 2023.\n(Gain) Loss on Dispositions, net\nDuring the year ended December 31, 2024, we completed the following dispositions that resulted in a pre-tax gain of $59 million, which was included in (Gain) loss on dispositions, net in the consolidated statement of income:\nIn November of 2024, we recorded a pre-tax gain of $38 million ($27 million after-tax) in (Gain) loss on dispositions, net in the consolidated statements of income related to the sale of the PrimeOne business in our Market Intelligence segment.\nIn August of 2024, we recorded a pre-tax gain of $21 million ($12 million after-tax) in (Gain) loss on dispositions, net in the consolidated statements of income related to the sale of Fincentric in our Market Intelligence segment.\nDuring the year ended December 31, 2023, we completed the following disposition and received the following contingent payment that resulted in a pre-tax loss of $70 million, which was included in (Gain) loss on dispositions, net in the consolidated statement of income:\nDuring the year ended December 31, 2023, we recorded a pre-tax loss of $120 million in (Gain) loss on disposition, net and disposition-related costs of $16 million in selling and general expenses in the consolidated statements of income ($182 million after-tax, net of a release of a deferred tax liability of $157 million) related to the sale of Engineering Solutions.\nIn the first quarter of 2023, we received a contingent payment following the sale of Leveraged Commentary and Data (“LCD”) along with a related family of leveraged loan indices in June of 2022. The contingent payment was payable six months following the closing upon the achievement of certain conditions related to the transition of LCD customer relationships. During the year ended December 31, 2023, the contingent payment resulted in a pre-tax gain of $46 million ($34 million after-tax) related to the sale of LCD in our Market Intelligence segment and $4 million ($3 million after-tax) related to the sale of a family of leveraged loan indices in our Indices segment.\nDuring the year ended December 31, 2022, we completed the following dispositions that resulted in a pre-tax gain of $1.9 billion, which was included in (Gain) loss on dispositions, net in the consolidated statements of income:\nIn June of 2022, we comple\nted the previously announced sale of LCD along with a related family of leveraged loan indices, within our Market Intelligence and Indices segments, respectively, to Morningstar for a purchase price of $600 million\nin cash, subject to customary adjustments, and a contingent payment of up to $50 million which was payable six months following the closing upon the achievement of certain conditions related to the transition of LCD customer relationships. During the year ended December 31, 2022, we recorded a pre-tax gain of $505 million ($378 million after-tax) for the sale of LCD. During the year ended December 31, 2022, we recorded a pre-tax gain of $52 million ($43 million after-tax) for the sale of a family of leveraged loan indices in (Gain) loss on dispositions, net in the consolidated statements of income.\n\nCorporate Unallocated expense includes costs for corporate functions, select initiatives, unoccupied office space and Kensho, included in selling and general expenses. Corporate Unallocated expense decreased 39% compared to 2023. Excluding the impact of a loss on disposition in 2023 of 8 percentage points, higher IHS Markit merger costs in 2023 of 5 percentage points, higher employee severance costs in 2023 of 1 percentage points, higher lease impairments in 2023 of 1 percentage point and higher disposition-related costs in 2023 of 1 percentage point, Corporate Unallocated expense increased 23% primarily due to higher incentives and compensation costs.\nEquity in Income on Unconsolidated Subsidiaries\n— The Company holds an investment in a 50/50 joint venture arrangement with shared control with CME Group that combined each of the company’s post-trade services into a new joint venture, OSTTRA. The joint venture provides trade processing and risk mitigation operations and incorporates CME Group’s optimization businesses (Traiana, TriOptima, and Reset) and the ",
  "item2_clean": null
}