{
  "source_file": "sre-20241231.htm",
  "form_type": "10-K",
  "item1_clean": "Oncor operates in certificated areas designated by the PUCT. The majority of Oncor’s service territory is single certificated, with Oncor as the only certificated electric transmission and distribution provider. However, in multi-certificated areas of Texas, Oncor competes with certain other utilities and rural electric cooperatives for the right to serve end-use customers. In addition, the electric industry is undergoing rapid technological change, and third-party DER and other technologies may increasingly compete with Oncor’s traditional transmission and distribution infrastructure in delivering electricity to consumers.\nSharyland Utilities is a regulated electric transmission utility that owns and operates, at December 31, 2024, approximately 64 miles of electric transmission lines in south Texas, including a direct current line connecting Mexico and assets in McAllen, Texas. Sharyland Utilities is responsible for providing safe, reliable and efficient transmission and substation services and investing to support infrastructure needs in its service territory, which we discuss below in “Regulation – Utility Regulation – ERCOT Market.” Transmission revenues are provided under tariffs approved by the PUCT.\nSempra Infrastructure\nOur Sempra Infrastructure segment includes the operating companies of our subsidiary, SI Partners, as well as a holding company and certain services companies. SI Partners is included within our Sempra Infrastructure reportable segment but is not the same in its entirety as the reportable segment. Sempra Infrastructure develops, builds, operates and invests in energy infrastructure to help provide safe, sustainable and reliable access to cleaner energy in markets in the U.S., Mexico and globally.\nAt December 31, 2024, Sempra, KKR Pinnacle and ADIA each hold a 70%, 20%, and 10% interest, respectively, in SI Partners. SI Partners owns a 100% interest in Sempra LNG Holding, LP and a 99.9% interest in IEnova at December 31, 2024.\nThe minority partners in SI Partners and Sempra are parties to the second amended and restated agreement of limited partnership of SI Partners (the LP Agreement). Under the LP Agreement, matters are decided generally by majority vote and the managers designated by the partners of SI Partners each vote on an equity-weighted basis based on the ownership percentage of their respective designating limited partner. SI Partners and its controlled subsidiaries are prohibited from taking certain limited actions without the prior written approval of the minority partners. The LP Agreement contains certain default remedies if any limited partner fails to fund any amounts required to be funded under the LP Agreement and requires that SI Partners distribute to the limited partners at least 85% of distributable cash of SI Partners and its subsidiaries on a quarterly basis, subject to certain exceptions and reserves. Generally, distributions from SI Partners are made on a pro rata basis. However, KKR Pinnacle is entitled to certain priority distributions in the event of material deviations between certain specified projected cash flows and actual cash flows. Additionally, the minority partners are entitled to certain priority distributions in the event a specified project that reaches a positive final investment decision does not have projected internal rates of return greater than a specified threshold or in the event Sempra has not made a positive final investment decision by a certain date on specified LNG projects that are under development. Under the LP Agreement, if the minority partners approve Sempra’s request that a project not be pursued jointly, or if the minority partners decide not to participate in any proposed project for which Sempra nevertheless desires to make a positive final investment decision, then Sempra may proceed with such project either independently through a different investment vehicle or as a “Sole Risk Project” within SI Partners and receive Sole Risk Interests in respect thereof. Sole Risk Projects are separated from other SI Partners projects and are conducted at Sempra’s sole cost, expense and liability, and Sempra receives, through the acquisition of Sole Risk Interests, the economic and other benefits, if any, from such projects.\nSempra Infrastructure consolidates Sempra’s ownership and management of its non-U.S. utility, energy infrastructure assets in North America under a single platform. These assets include LNG and natural gas infrastructure in the U.S. and Mexico and renewable energy, LPG and refined products infrastructure in Mexico, which are managed through three business lines: LNG, Energy Networks and Low Carbon Solutions.\n\nLow Carbon Solutions\nSempra Infrastructure’s Low Carbon Solutions business line is focused on commercializing and deploying low carbon solutions in support of meeting the demand for lower carbon and reliable energy supply. The portfolio of resources includes renewable energy infrastructure, a natural gas-fired power plant, as well as potential hydrogen fuel production and advanced carbon capture, usage and storage technologies that are under development.\nRenewable Power Generation.\nSempra Infrastructure develops, builds and operates renewable energy generation facilities that have long-term PPAs to sell the electricity they generate to their customers, which are generally load-serving entities, as well as industrial and other customers. Load serving entities sell electric service to their end-users and wholesale customers upon receipt of power delivery from these energy generation facilities, while industrial and other customers consume the electricity to run their facilities. At December 31, 2024, Sempra Infrastructure had total nameplate capacity of 1,044 MW related to its operating wind and solar power generation facilities. Generation from Sempra Infrastructure’s renewable energy assets is susceptible to fluctuations in naturally occurring conditions such as wind, inclement weather and hours of sunlight. Additionally, some of these facilities are impacted by regulatory actions by the Mexican government and related litigation, which we discuss in Note 15 of the Notes to Consolidated Financial Statements, “Part I – Item 1A. Risk Factors” and “Part II – Item 7. MD&A – Capital Resources and Liquidity – Sempra Infrastructure.”\nRENEWABLE POWER GENERATION\nContract expiration date\nNameplate capacity (MW)\nWind power generation facilities:\nTecate, Baja California\nTecate, Baja California\nSolar power generation facilities:\nCiudad Juarez, Chihuahua\nBenjamin Hill, Sonora\nTecate, Baja California\nNatural Gas-Fired Generation.\nSempra Infrastructure owns and operates the TdM power plant in the vicinity of Mexicali, Baja California, adjacent to the Mexico-U.S. border. TdM is a 625 MW natural gas-fired, combined-cycle power plant that is connected to our Gasoducto Rosarito pipeline system, which enables it to receive regasified LNG from the ECA Regas Facility as well as continental gas supplied from the U.S. on the North Baja pipeline. TdM generates revenue from selling electricity and resource adequacy to the California ISO for delivery to governmental, public utility and wholesale power marketing entities.\nLow Carbon Solutions Projects.\nSempra Infrastructure is constructing the Cimarrón Wind project, an approximately 320 MW wind generation facility in Baja California, Mexico. Sempra Infrastructure has a 20-year PPA with Silicon Valley Power for the long-term supply of renewable energy to the City of Santa Clara, California. Cimarrón Wind will utilize Sempra Infrastructure’s existing cross-border high voltage transmission line to interconnect and deliver clean energy to the East County substation in San Diego County. We expect the Cimarrón Wind project to begin generating energy in late 2025 and commence commercial operations in the first half of 2026.\nSempra Infrastructure is also evaluating the Hackberry Carbon Sequestration development opportunity, which is a carbon capture and sequestration project that is intended to reduce emissions at the Cameron LNG Phase 1 facility and proposed Cameron LNG Phase 2 project.\nDemand and Competition.\nSempra Infrastructure competes with Mexican and foreign companies for new energy infrastructure projects in Mexico. Some of its competitors (including public or state-operated companies and their affiliates) may have better access to capital or greater financial and other resources or advantages, which could give them a competitive advantage for such projects.\n\nOncor and Sharyland Utilities are subject to reliability standards adopted and enforced by the Texas Reliability Entity, Inc., an independent organization that develops reliability standards for the ERCOT region and monitors and enforces compliance with the standards of the North American Electric Reliability Corporation, including critical infrastructure protection, and ERCOT protocols.\nOther U.S. State and Local Territories Regulation\nSDG&E has electric franchise agreements with the two counties and the 27 cities in its electric service territory, and natural gas franchise agreements with the one county and the 18 cities in its natural gas service territory. These franchise agreements allow SDG&E to locate, operate and maintain facilities for the transmission and distribution of electricity or natural gas. Most of the franchise agreements have no expiration dates, while some have expiration dates that range from 2028 to 2041. SDG&E has electric and natural gas franchises for the City of San Diego. These franchise agreements, which went into effect in July 2021, provide SDG&E the opportunity to serve the City of San Diego for the next 20 years, consisting of 10-year agreements that will automatically renew for an additional 10 years unless the City Council voids the automatic renewal. These franchise agreements have been challenged in two lawsuits that we discuss in Note 15 of the Notes to Consolidated Financial Statements.\nSoCalGas has natural gas franchise agreements with the 12 counties and the 232 cities in its service territory. These franchise agreements allow SoCalGas to locate, operate and maintain facilities for the transmission and distribution of natural gas. Most of the franchise agreements have no expiration dates, while some have expiration dates that range from 2026 to 2069. In December 2024, the Los Angeles County Board of Supervisors granted SoCalGas a new, 20-year gas pipeline franchise. The franchise consists of an initial 10-year term beginning on January 9, 2025, followed by a 10-year term that Los Angeles County has the option to terminate. Prior to the granting of the new franchise, SoCalGas continued to serve customers in the unincorporated territory of Los Angeles County in accordance with its prior franchise.\nOther U.S. Regulation\nThe FERC regulates certain Sempra Infrastructure assets pursuant to the U.S. Federal Power Act and Natural Gas Act, which provide for FERC jurisdiction over, among other things, sales of wholesale power in interstate commerce, transportation of natural gas in interstate commerce, and siting and permitting of LNG facilities.\nThe FERC may regulate rates and terms of service based on a cost-of-service approach or, in geographic and product markets determined by the FERC to be sufficiently competitive, rates may be market-based. FERC-regulated rates at Sempra Infrastructure are market-based for wholesale electricity sales, cost-based for the transportation of natural gas, and market-based for the purchase and sale of LNG and natural gas.\nSempra Infrastructure’s investment in Cameron LNG JV is subject to regulations of the DOE regarding the export of LNG. Under these regulations, the DOE acts on LNG export applications to non-FTA countries after completing a public interest review that includes several criteria, including economic and environmental review of the proposed export. Sempra Infrastructure’s other potential natural gas liquefaction pro",
  "item7_clean": "We discuss herein SDG&E’s results of operations and significant changes in earnings, revenues and costs for the year ended December 31, 2024 compared to the year ended December 31, 2023. For a discussion of SDG&E’s results of operations and significant changes in earnings, revenues and costs for the year ended December 31, 2023 compared to the year ended December 31, 2022, refer to “\nPart II – Item 7. MD&A – Results of Operations\n” in our 2023 annual report on\nfiled with the SEC on February 27, 2024.\nRESULTS OF OPERATIONS\nRESULTS OF OPERATIONS\n(Dollars in millions)\nIn 2024 compared to 2023, the decrease in SDG&E’s earnings of $45 million (5%) to $891 million was primarily due to:\n$89 million charge in 2024 for amounts relating to the FERC order finding that the TO5 adder refund provision has been triggered, requiring SDG&E to refund customers the California ISO adder retroactively from June 1, 2019\n$32 million higher net interest expense\n$6 million lower AFUDC equity\n$33 million higher income tax benefits primarily from flow through items, including higher gas repairs tax benefits\n$27 million higher CPUC base operating margin authorized for 2024, net of operating expenses, including higher authorized cost of capital\n$12 million higher electric transmission margin\n$10 million lower Wildfire Fund amortization\n\nWe discuss herein SoCalGas’ results of operations and significant changes in earnings, revenues and costs for the year ended December 31, 2024 compared to the year ended December 31, 2023. For a discussion of SoCalGas’ results of operations and significant changes in earnings, revenues and costs for the year ended December 31, 2023 compared to the year ended December 31, 2022, refer to “\nPart II – Item 7. MD&A – Results of Operations\n” in our 2023 annual report on\nfiled with the SEC on February 27, 2024.\nRESULTS OF OPERATIONS\nRESULTS OF OPERATIONS\n(Dollars in millions)\nIn 2024 compared to 2023, the increase in SoCalGas’ earnings of $144 million (18%) to $955 million was primarily due to:\n$184 million higher income tax benefits primarily from flow-through items, including higher gas repairs tax benefits, offset by $25 million related to income tax benefits in 2023 from previously unrecognized income tax benefits pertaining to gas repairs expenditures\n$18 million higher AFUDC equity\n$11 million higher net regulatory interest income\n$28 million higher net interest expense\n$18 million lower CPUC base operating margin authorized for 2024, net of operating expenses, offset by higher authorized cost of capital\n$15 million impairment from disallowed capital costs in the 2024 GRC FD\n$5 million lower regulatory awards approved by the CPUC\n\nTo the extent that circumstances associated with regulatory balances change, the regulatory balances are evaluated and adjusted if appropriate.\nSignificant management judgment is required to evaluate the anticipated recovery of regulatory assets and revenues subject to refund, as well as the existence and amount of regulatory liabilities. Adverse regulatory or legislative actions could materially impact the amounts of our regulatory assets and liabilities and could materially adversely impact our results of operations and financial condition. Specifically, if future recovery of costs ceases to be probable, all or part of the associated regulatory assets would need to be written off against current period earnings, or adverse regulatory or legislative actions could give rise to material new or higher regulatory liabilities. We discuss details of SDG&E’s and SoCalGas’ regulatory assets and liabilities and additional factors that management considers when assessing probabilities associated with regulatory balances in Notes 1, 4, 14 and 15 of the Notes to Consolidated Financial Statements.\nINCOME TAXES\nSempra, SDG&E, SoCalGas\nOur income tax expense and related balance sheet amounts involve significant management judgments and estimates. Amounts of deferred income tax assets and liabilities, as well as current and noncurrent accruals, involve judgments and estimates of the timing and probability of recognition of income and deductions by taxing authorities. When we evaluate the anticipated resolution of income tax issues, we consider:\n▪ past resolutions of the same issue or similar issues\n▪ the status of any income tax examination in progress\n▪ positions taken by taxing authorities with other taxpayers with similar issues\nThe likelihood of deferred income tax recovery is based on analyses of the deferred income tax assets and our expectation of future taxable income, based on our strategic planning. Should a change in facts or circumstances lead to a change in judgment about the ultimate realizability of a deferred tax asset, we would record or adjust the related valuation allowance in the period that the change in facts and circumstances occurs, along with a corresponding increase or decrease in the provision for income taxes.\nActual income taxes could vary from estimated amounts because of:\n▪ future impacts of various items, including changes in tax laws, regulations, interpretations and rulings\n▪ our financial condition in future periods\n▪ the resolution of various income tax issues between us and taxing and regulatory authorities\nUnrecognized income tax benefits involve management’s judgment regarding the likelihood of the benefit being sustained. The final resolution of uncertain tax positions could result in adjustments to recorded amounts and may affect our results of operations, financial condition and cash flows.\nWe discuss these matters and additional information related to accounting for income taxes, including uncertainty in income taxes, in Note 7 of the Notes to Consolidated Financial Statements.\nPENSION AND PBOP PLANS\nSempra, SDG&E, SoCalGas\nTo measure our pension and PBOP obligations, costs and liabilities, we rely on several assumptions. We consider current market conditions, including interest rates, in making these assumptions. We review these assumptions annually and update when appropriate.\nThe critical assumptions used to develop the required estimates include the following key factors:\nexpected return on plan assets\nhealth care cost trend rates\ninterest crediting rate on cash balance accounts\nrate of compensation increases\ntermination and retirement rates\n\nutilization of postretirement welfare benefits\npayout elections (lump sum or annuity)\nlump sum interest rates\nThe actuarial assumptions we use may differ materially from actual results due to:\nreturn on plan assets\nchanging market and economic conditions\nhigher or lower withdrawal rates\nlonger or shorter participant life spans\nmore or fewer lump sum versus annuity payout elections made by plan participants\nhigher or lower retirement rates\nChanges in the estimated costs or timing of pension and PBOP, or the assumptions and judgments used by management underlying these estimates (primarily the discount rate and expected return on plan assets), as well as changes in the circumstances associated with rate recovery, could have a material effect on the recorded expenses and liabilities. The following tables summarize the impact to our projected benefit obligation for pension and accumulated benefit obligation for PBOP at December 31, 2024, and 2024 net periodic benefit costs, in each case if the discount rate or expected return on plan assets were changed by 1%.\nIMPACT DUE TO INCREASE/DECREASE IN DISCOUNT RATE\n(Dollars in millions)\nSDG&E\n(Decrease) increase to projected benefit obligation,\n(Decrease) increase to net periodic benefit cost\nPBOP:\n(Decrease) increase to accumulated benefit\n(Decrease) increase to net periodic benefit cost\nIMPACT DUE TO INCREASE/DECREASE IN RETURN ON PLAN ASSETS\n(Dollars in millions)\nSDG&E\n(Decrease) increase to net periodic benefit cost\nPBOP:\n(Decrease) increase to net periodic benefit cost\nFor SDG&E and SoCalGas plans, the effects of the assumptions on earnings are expected to be recovered in rates and therefore are offset in regulatory accounts. We provide details of our pension and PBOP plans in Note 8 of the Notes to Consolidated Financial Statements.\nSONGS ASSET RETIREMENT OBLIGATIONS\nSDG&E’s legal AROs related to the decommissioning of SONGS are estimated based on a site-specific study performed no less than every three years. The estimate of the obligations includes:\n▪ estimated decommissioning costs, including labor, equipment, material and other disposal costs\n▪ inflation adjustment applied to estimated cash flows\n▪ discount rate based on a credit-adjusted risk-free rate\n▪ actual decommissioning costs, progress to date and expected duration of decommissioning activities\n\nSDG&E’s nuclear decommissioning expenses are subject to rate recovery and, therefore, rate-making accounting treatment is applied to SDG&E’s nuclear decommissioning activities. SDG&E recognizes a regulatory asset, or liability, to the extent that its SONGS ARO exceeds, or is less than, the amount collected from customers and the amount earned in SDG&E’s NDT.\nSDG&E’s ARO related to the decommissioning of SONGS was $471 million as of December 31, 2024, based on the decommissioning cost study prepared in 2024. Changes in the estimated costs, execution strategy or timing of decommissioning, or in the assumptions and judgments by management underlying these estimates, could cause material revisions to the estimated total cost to decommission this facility, which could have a material effect on the recorded liability.\nThe following table illustrates the increase to SDG&E’s and Sempra’s ARO liability if the cost escalation rate was adjusted while leaving all other assumptions constant:\nINCREASE TO ARO AND REGULATORY ASSET\n(Dollars in millions)\nUniform increase in escalation percentage of 1%\nThe increase in the ARO liability driven by an increase in the cost escalation rate would result in a decrease in the regulatory liability for recoveries in excess of ARO liabilities. We provide additional detail in Note 14 of the Notes to Consolidated Financial Statements.\nIMPAIRMENT TESTING OF LONG-LIVED ASSETS\nWhenever events or changes in circumstances indicate that an asset’s carrying amount may not be recoverable, we consider if the estimated future undiscounted cash flows are less than the carrying amount of the asset. If so, we estimate the fair value of the asset to determine the extent to which carrying value exceeds fair value. For such an estimate, we may consider data from multiple valuation methods, including data from market participants. We exercise judgment to estimate the future cash flows and the useful life of a long-lived asset and to determine our intent to use the asset. Our intent to use or dispose of a long-lived asset is subject to re-evaluation and can change over time. If such an impairment test is required, the fair value of a long-lived asset can vary if differing estimates and assumptions are used in the valuation techniques applied as indicated by changing market or other conditions. Critical assumptions that affect our estimates of fair value may include:\nconsideration of market transactions\nthe appropriate risk-adjusted discount rate, including the impacts of country risk and entity risk\nWe discuss impairment of long-lived assets in Note 1 of the Notes to Consolidated Financial Statements.\nIMPAIRMENT TESTING OF GOODWILL\nWhen determining if goodwill is impaired, the fair value of the reporting unit can vary if differing estimates and assumptions are used in the valuation techniques applied as indicated by changing market or other conditions. As a result, recognizing a goodwill impairment may or may not be required. When we perform a quantitative goodwill impairment test, we exercise judgment to develop estimates of the fair value of the reporting unit and compare that to its carrying value. Our fair value estimates are developed from the perspective of a knowledgeable market participant. We consider observable transactions in the marketplace for similar investments, if available, as well as an income-based approach such as a discounted cash flow analysis. A discounted cash flow analysis may be based directly on anticipated future revenues and expenses and may be performed based on free cash flows generated within the reporting unit. Critical assumptions that affect our estimates of fair value may include:\nconsideration of market transactions\nprojected revenue and expense growth rates\nthe appropriate risk-adjusted discount rate, including the impacts of country risk, customer creditworthiness and entity risk\n\nSempra California’s earnings are comprised of SDG&E and SoCalGas. Because changes in SDG&E’s and SoCalGas’ cost of natural gas and/or electricity are recovered in rates, changes in these costs are offset in the changes in revenues and therefore do not impact earnings, other than potential impacts related to the GCIM for SoCalGas that we describe below. In addition to the changes in cost or market prices, natural gas or electric revenues recorded during a period are impacted by the difference between customer billings and recorded or CPUC-authorized amounts. These differences are required to be balanced over time, resulting in over- and undercollected regulatory balancing accounts. We discuss balancing accounts and their effects further in Note 4 of the Notes to Consolidated Financial Statements.\nIn 2024 compared to 2023, the increase in earnings of $99 million (6%) to $1.8 billion was primarily due to:\n$217 million higher income tax benefits primarily from flow-through items, including higher gas repairs tax benefits, offset by $25 million related to income tax benefits in 2023 from previously unrecognized income tax benefits pertaining to gas repairs expenditures\n$12 million higher electric transmission margin\n$12 million higher AFUDC equity\n$11 million higher net regulatory interest income\n$9 million higher CPUC base operating margin authorized for 2024, net of operating expenses, including higher authorized cost of capital\n$89 million charge in 2024 for amounts relating to the FERC order finding that the TO5 adder refund provision has been triggered, requiring SDG&E to refund customers the California ISO adder retroactively from June 1, 2019, which we discuss in Note 4 of the Notes to Consolidated Financial Statements\n$60 million higher net interest expense\n$15 million impairment from disallowed capital costs in the 2024 GRC FD\nSempra Texas Utilities\nIn 2024 compared to 2023, the increase in earnings of $87 million (13%) to $781 million was primarily due to higher equity earnings from Oncor Holdings driven by:\noverall higher revenues primarily attributable to:\nrate updates to reflect increases in invested capital\nupdates to transmission billing units\nbase rates implemented in May 2023\nlower customer consumption primarily attributable to weather\nwrite-off of rate base disallowances in 2023 resulting from the PUCT’s final order in Oncor’s comprehensive base rate review\nhigher interest expense and depreciation expense attributable to increases in invested capital\n\nIn 2024 compared to 2023, Sempra’s O&M decreased by $122 million (2%) to $5.3 billion primarily due to:\n$193 million decrease at Sempra California due to:\n$255 million lower expenses associated with refundable programs, which costs are recovered in revenue\n$45 million higher non-refundable operating costs\n$20 million impairment from disallowed capital costs in the 2024 GRC FD\n$65 million increase at Sempra Infrastructure due to:\n$33 million higher development costs and certain non-capitalized expenses from projects under construction\n$18 million higher purchased services\n$6 million from a provision for expected credit losses on a customer’s past due receivable balance\nIn 2024 compared to 2023, Sempra’s other income, net, increased by $5 million (4%) to $136 million primarily due to:\n$17 million higher AFUDC equity, including $12 million at Sempra California\n$15 million higher net interest income on regulatory balancing",
  "item2_clean": null
}