{
  "source_file": "ste-20250930.htm",
  "form_type": "10-Q",
  "item1_clean": null,
  "item7_clean": null,
  "item2_clean": "Previously, we had four reportable business segments; however, as a result of the divestiture of our Dental segment, Dental is presented as discontinued operations. Historical information has been retrospectively adjusted to exclude discontinued operations for comparability, as required. For more information, refer to Note 4 to our consolidated financial statements titled, \"Discontinued Operations.\" Non-allocated operating costs that support the entire Company and items not indicative of operating trends are excluded from segment operating income. We describe our business segments in Note 11 to our consolidated financial statements titled, \"Business Segment Information.\"\nbulk of our revenues are derived from healthcare, medical device and pharmaceutical Customers. Much of the growth in these industries is driven by the aging of the population throughout the world, as an increasing number of individuals are entering their prime healthcare consumption years, and is dependent upon advancement in healthcare delivery, acceptance of new technologies, government policies, and general economic conditions.\naddition, there is increased demand for medical procedures, including preventive screenings such as endoscopies and colonoscopies; and a desire by our Customers to operate more efficiently, all of which are driving increased demand for many of our products and services.\nAcquisitions and Divestitures\nsix months of fiscal 2026, we completed a tuck-in acquisition which continued to expand our product and service offerings in the Healthcare segment. Total aggregate consideration was approximately $15.0 million.\nsix months of fiscal 2025, we completed several tuck-in acquisitions, which continued to expand our product and service offerings in the Healthcare and AST segments. Total aggregate consideration was approximately\nAcquisition and integration expenses totaled\nfor the three and six months ended September 30, 2025, respectively. Acquisition and integration expenses totaled\nfor the three and six months ended September 30, 2024, respectively. Acquisition and integration expenses are reported in the Selling, general and administrative expenses line of our Consolidated Statements of Income and include, but are not limited to, investment banker, advisory, legal and other professional fees, and certain employee-related expenses.\nOn April 1, 2024, we completed the sale of the Controlled Environment Certification Services (\"CECS\") business. We recorded net proceeds of\nand recognized a pre-tax gain on the sale of\nin the first three months of fiscal 2025.\nFor more information regarding our recent acquisitions, see Note 3 to our consolidated financial statements titled, \"\nBusiness Acquisitions and Divestitures\nDiscontinued Operations\n. On April 11, 2024, the Company announced its plan to sell substantially all of the net assets of its Dental segment for total cash consideration of\n, subject to customary adjustments, and up to an additional\nin contingent payment had the Dental business achieved certain revenue targets in fiscal 2025. No amounts have been recorded with respect to this contingent consideration. The transaction was structured as an equity sale and closed on May 31, 2024.\nA component of an entity is reported in discontinued operations after meeting the criteria for held for sale classification if the disposition represents a strategic shift that has (or will have) a major effect on the entity's operations and financial results. We analyzed the quantitative and qualitative factors relevant to the divestiture of our Dental segment and determined that those conditions for discontinued operations presentation had been met prior to\nMarch 31, 2024. The Dental segment results of operations have been reclassified as income (loss) from discontinued operations in the Consolidated Statements of Income for all periods presented. Our Consolidated Statements of Cash Flows include the financial results of the Dental segment through the date of sale on May 31, 2024. A majority of the proceeds received from the sale were utilized to pay off existing debt.\nFor more information, see\nto our consolidated financial statements titled, \"\nDiscontinued Operations\n. On July 4, 2025, the U.S. enacted the One Big Beautiful Bill Act (\"OBBBA\") which contains substantial changes to its tax policies. Business provisions in the OBBBA, some of which were extensions of those established in the Tax Cuts and Jobs Act, include favorable cost recovery allowances, changes to U.S. international tax rules, and changes to energy and environmental related incentives. The law has multiple effective dates, with certain provisions applicable to years beginning after fiscal 2026. The law did not have a material impact on our consolidated financial statements for the three and six month periods ending September 30, 2025, and we do not expect it to have a material impact on our effective tax rate.\nRevenues increased 9.9% to $1,460.3 million for the three months ended September 30, 2025, as compared to $1,328.9 million for the same period in the prior year. Revenues increased 9.3% to $2,851.4 million for the six months ended September 30, 2025, as compared to $2,608.4 million for the same period in the prior year. The increase during the three and six month periods reflects the benefits of higher volume and pricing, with all three segments contributing to growth.\nGross profit percentage for the second quarter of fiscal 2026 was 44.2% compared to the gross profit percentage for the second quarter of fiscal 2025 of 43.6%. Gross profit percentage for the first six months of fiscal 2026 was 44.7% compared to the gross profit percentage for the first six months of fiscal 2025 of 44.1%. The increase in gross profit percentage for the three and six month periods reflects favorable impacts from pricing, productivity, mix, and other cost reductions that were partially offset by unfavorable impacts from inflation, and tariff costs.\nIncome from operations for the second quarter of fiscal 2026 was $265.8 million, compared to income from operations of $219.7 million for the second quarter of fiscal 2025. Income from operations for the first six months of fiscal 2026 was $511.8 million, compared to income from operations of $405.2 million for the first six months of fiscal 2025. The increase in income from operations for the three and six month periods is primarily due to increased volume and pricing, which was partially offset by inflation and tariff costs. Additionally, income from operations during the first six months of fiscal 2026 reflected the benefit of lower restructuring expenses.\nCash flows from operations were $707.8 million and free cash flow was $527.7 million for the first six months of fiscal 2026 compared to cash flows from operations of $554.5 million and free cash flow of $344.5 million for the first six months of fiscal 2025 (see the subsection below titled \"Non-GAAP Financial Measures\" for additional information and related reconciliation of cash flows from operations to free cash flow). The fiscal 2026 increase in cash flows from operations and free cash flow resulted from an increase in earnings and from the increase in cash provided by working capital improvements. Free cash flow was also impacted by a decrease in capital expenditures when compared to the same prior year period.\nOur debt-to-total capital ratio was 21.3% at September 30, 2025 and 23.6% at March 31, 2025. During the first six months of fiscal 2026, we declared and paid cash dividends totaling $1.20 per ordinary share.\nAdditional information regarding our financial performance during the second quarter of fiscal 2026 is included in the subsection below titled “Results of Operations.”\nNON-GAAP FINANCIAL MEASURES\nThese non-GAAP financial measures are not intended to be, and should not be, considered separately from or as an alternative to the most directly comparable U.S. GAAP financial measures.\nThese non-GAAP financial measures are presented with the intent of providing greater transparency to supplemental financial information used by management and the Board of Directors in their financial analysis and operational decision-making. These amounts are disclosed so that the reader has the same financial data that management uses with the belief that it\nwill assist investors and other readers in making comparisons to our historical operating results and analyzing the underlying performance of our operations for the periods presented.\nWe believe that the presentation of these non-GAAP financial measures, when considered along with our U.S. GAAP financial measures and the reconciliation to the corresponding U.S. GAAP financial measures, provides the reader with a more complete understanding of the factors and trends affecting our business than could be obtained absent this disclosure. It is important for the reader to note that the non-GAAP financial measures used may be calculated differently from, and therefore may not be comparable to, similarly titled measures used by other companies.\nOrganic revenue growth and constant currency organic revenue growth are non-GAAP financial measures of revenue performance. Organic revenue growth is calculated by removing the impact of acquisitions and divestitures for one year following the respective transaction from the GAAP revenue growth. Constant currency organic revenue growth is subject to a further adjustment to eliminate the impact of foreign currency movements. See the section below \"Business Segment Results of Operations\" for a reconciliation of organic revenue growth and constant currency organic revenue growth to U.S. GAAP revenue.\nWe define free cash flow as net cash provided by operating activities as presented in the Consolidated Statements of Cash Flows less purchases of property, plant, equipment, and intangibles (capital expenditures) plus proceeds from the sale of property, plant, equipment, and intangibles, which are also presented within "
}