{
  "source_file": "ste-20250331.htm",
  "form_type": "10-K",
  "item1_clean": "We compete with a number of large companies that have significant product portfolios and global reach, as well as a number of small companies with very limited product offerings and operations in one or a limited number of countries. On a product basis, competitors include 3M, Baxter, Boston Scientific, Belimed, Ecolab, Fortive, Getinge, Karl Storz, Olympus, Ruhof, SteelCo, Stryker, Skytron and Wassenburg. On a service line basis, competitors include BBraun, Crothall, Olympus and Pentax.\nAST SEGMENT\nDescription of Business.\nOur AST segment supports medical device and pharmaceutical manufacturers through a global network of contract sterilization and laboratory testing facilities, and integrated sterilization equipment and control systems. Our technology-neutral offering supports Customers every step of the way, from testing through sterilization.\nWe offer a wide range of sterilization modalities and an array of testing services that complement the manufacturing of single-use, sterile products. Our facilities are located in regions with a concentration of medical device and pharmaceutical manufacturing throughout the Americas, Europe, and Asia. Our technical professionals support Customers in all phases of product development, materials testing, and process validation. In addition, we manufacture and supply integrated sterilization equipment and control systems to medical device manufacturers and research institutions.\nWe support Customers with process controls and monitoring systems, and integrated sterilization equipment, including accelerators, product handling, and automation.\nCustomer Concentration.\nOur AST segment’s services are offered to Customers throughout the world. For the year ended March 31, 2025, no Customer represented more than 10% of the segment’s revenues.\nAST operates in a highly regulated industry and competes with Sterigenics International, Inc., other smaller contract sterilization companies, other manufacturers of sterilization equipment and control systems, and manufacturers that sterilize products in-house.\nLIFE SCIENCES SEGMENT\nDescription of Business.\nOur Life Sciences segment provides a comprehensive offering of products and services designed to support biopharmaceutical and medical device manufacturing facilities, in particular those focused on aseptic manufacturing. Our portfolio includes a full suite of consumable products, equipment maintenance, specialty services, and capital equipment.\nOur products include pharmaceutical detergen\nts, cleanroom disinfectants and sterilants, pharmaceutical grade and research sterilizers and washers, sterility assurance and maintenance products, vaporized hydrogen peroxide room decontamination systems and sterilizers, and high purity water and pure steam generators.\nOur Life Sciences segment service employees install, maintain, upgrade, repair, and troubleshoot equipment throughout the world. We offer various preventive maintenance programs and repair services to support the effective operation of capital equipment over its lifetime.\nCustomer Concentration.\nOur Life Sciences segment sells consumables, services and capital equipment to Customers globally. For the year ended March 31, 2025, no Customer represented more than 10% of the Life Sciences segment’s total revenues.\nOur Life Sciences segment operates in highly regulated environments where the most intense competition results from technological innovations, product performance, convenience and ease of use, and overall cost-effectiveness. We compete for pharmaceutical Customers with a number of large companies that have significant product portfolios and global reach, as well as a number of small companies with very limited product offerings and operations in one or a limited number of countries. Competitors include Belimed, Contec, Ecolab, Fedegari, Getinge, and Stilmas.\nINFORMATION WITH RESPECT TO OUR BUSINESS IN GENERAL\nSources and Availability of Raw Materials.\nWe purchase raw materials, sub-assemblies, components, and other supplies needed in our operations from numerous suppliers in the United States and internationally. The principal raw materials and supplies used in our operations include stainless and carbon steel, organic and inorganic chemicals, fuel, and plastic components. These raw materials and supplies are generally available from several suppliers and in sufficient quantities. We have long-term supply contracts for certain materials for which there are few suppliers, or those that are single-sourced in certain regions of the world, such as ethylene oxide (\"EO\") and radioisotope cobalt-60 (\"cobalt-60\"), which are necessary to our AST operations. In addition, we continue to expand our irradiation processing capacity with accelerator-based technologies, in order to help mitigate the potential cobalt-60 supply risk.\nHistorically, our business has not been significantly impacted by the overall effects of inflation.\nHowever, during fiscal 2023 and 2024, we experienced a rise in supply chain and labor costs, which moderated in fiscal 2025.\nChanges to trade policy, including tariff measures introduced in early calendar year 2025, may drive new inflation risks in our supply chain for materials as well as the costs of other goods and services important to our operations. The U.S. measures and the response from other countries continue to evolve, creating uncertainty in trade and economic dynamics. We\nmonitor the prices we charge for our products and services on an ongoing basis and plan to adjust those prices to take into account future changes in the rate of inflation.\nIntellectual Property.\nWe protect our technology and products by, among other means, obtaining United States and foreign patents. There can be no assurance, however, that any patent will provide adequate protection for the technology, system, product, service, or process it covers. In addition, the process of obtaining and protecting patents can be long and expensive. We also rely upon trade secrets, technical know-how, and continuing technological innovation to develop and maintain our co\nAs of March 31, 2025, we held\n607 United States patents and 2,315 patents in other jurisdictions and had 90 United States patent applications and 289 patent applications pending in other jurisdictions.\nPatents for individual products extend for varying periods according to the date of filing or grant and legal term of patents in various countries where a patent is obtained. The actual protection a patent provides varies from country to country and depends in part upon the type of patent, the scope of its coverage, and the availability of legal remedies in each country.\nOur products are sold around the world under various brand names and trademarks. We consider our brand names and trademarks to be valuable in the marketing of our products. As of March 31, 2025, we had a total of approximately 2,145\ntrademark registrations worldwide.\nWe manufacture, assemble, and package products in several countries. Each of our production facilities are dedicated to particular processes and products. Our success depends upon Customer confidence in the quality of our production process and the integrity of the data that supports our product safety and effectiveness. We have implemented quality assurance procedures to support the quality and integrity of scientific information and production processes.\nContinuous Improvement.\nContinuous improvement is fundamental to how we operate at STERIS. We apply Lean principles across manufacturing, service operations, back office, and support functions through our Minimum Standard of Lean (MSoL) framework. MSoL establishes a consistent foundation for problem solving, standard work, and performance management while enabling local ownership and innovation. It assesses maturity across core dimensions—including continuous improvement training and development, routine management and strategic alignment, 5S, value stream mapping, kaizen management, lean tools and systems, and integration with new product development (NPD).\nOur efforts are designed to deliver better outcomes for Customers, Shareholders, and employees. By targeting key areas, we strengthen performance, agility, and value. In manufacturing and service operations, we apply flow and cellular production concepts and cross-train employees to increase flexibility and throughput. We also assess opportunities to in-source, outsource, or adopt technology to drive value.\nWe extend these principles to back office and support functions where Lean tools streamline workflows, reduce waste, and improve service delivery.\nA dedicated Continuous Improvement team partners with the business to coach, build capability, and accelerate results. Through kaizen events, tiered daily management, and employee-led initiatives, we foster a culture where employees are empowered to drive change. This mindset is supported at all levels of the organization, reinforcing alignment, engagement, and long-term performance.\nGovernment Regulation.\nOur business is subject to various degrees of governmental regulation in the countries in which we operate. In the United States, the Food and Drug Administration (“FDA”), the Environmental Protection Agency (“EPA”), the Occupational Safety and Health Administration (\"OSHA\"), the Nuclear Regulatory Commission, and other governmental authorities regulate the development, manufacture, sale, and distribution of our products and services. Our international operations also are subject to a significant amount of government regulation, including country-specific rules and regulations and U.S. regulations applicable to our international operations. Government regulations require detailed inspection of, and controls over, research and development, clinical investigations, product approvals and manufacturing, marketing and promotion, sampling, distribution, record-keeping, storage, and disposal practices.\nCompliance with applicable regulations is a significant expense for us. Past, current or future regulations, their interpretation, or their application could have a material adverse impact on our operations. Also, additional governmental regulation may be passed that could prevent, delay, revoke, or result in the rejection of regulatory clearance of our products. We cannot predict the effect on our operations resulting from current or future governmental regulation or the interpretation or application of these regulations.\nIf we fail to comply with any applicable regulatory requirements, penalties could be imposed on us. For more information about the risks we face regarding regulatory requirements, see Part I, Item 1A of this Annual Report titled, \"Risk Factors.\" We are subject to extensive regulatory requirements and must receive and maintain regulatory clearance or approval for many products and operations. Failure to receive or maintain, or delays in receiving, clearance or approvals may hurt our revenues, profitability, financial condition, or value.\nIn the past, we have received warning letters, paid civil penalties, conducted product recalls and field corrections, and been subject to other regulatory penalties. We believe that we are currently compliant in all material respects with applicable regulatory requirements. However, there can be no assurance that future or current regulatory, governmental, or private action will not have a material adverse effect on us or on our performance, results, or financial condition.\nEnvironmental Matters.\nWe are subject to various laws and governmental regulations concerning environmental matters and employee safety and health in Ireland, the United States and other countries. We have made, and continue to make, significant investments to comply with these laws and regulations. We cannot predict the future capital expenditures or operating costs required to comply with environmental laws and regulations. We believe that we are currently compliant with applicable environmental, ",
  "item7_clean": "Management's Discussion and Analysis of Financial Condition and Results of Operation\n\nSupplemental Guarantor Financial Information\nCritical Accounting Estimates and Assumptions",
  "item2_clean": null
}