{
  "source_file": "stld-20241231x10k.htm",
  "form_type": "10-K",
  "item1_clean": "We shipped the following long products volumes at each of these facilities (net tons):\nStructural and Rail Division\nRail shipments (included above)\nEngineered Bar Products Division\nRoanoke Bar Division\nSteel of West Virginia\nThe principal customers for our structural steel products are steel service centers, steel fabricators and various manufacturers. Service centers provide key distribution channels for the mills and value-add services to the end-user. The steel rail marketplace in the United States, Canada, and Mexico is specialized and defined, with seven Class I railroads and a large distribution network.\nSBQ products are principally consumed by cold finishers, forgers, intermediate processors, OEM manufacturers, steel service centers, and distributors, as well as pull-through volume to Vulcan. Our MBQ products are sold primarily to steel service centers, as well as reinforcing steel bar distributors, joist producers (such as our New Millennium Building Systems), and OEMs. Some of the excess steel billet production at the Roanoke Bar Division is sold to mills without sufficient melting capacities, including our Steel of West Virginia facility. Our steel fabrication operations also purchase angles from Roanoke Bar Division. Steel of West Virginia’s customers are primarily OEMs producing solar panel structures, truck trailers, industrial lift trucks, merchant products, guardrail posts, manufactured housing, mining, and off-highway construction equipment. Steel of West Virginia’s flexible manufacturing capabilities enable us to meet demand for a variety of custom-ordered and designed products. Many of these products are produced in small quantities for low volume end-uses resulting in a wide variety of customers, the largest of which are in the truck trailer and industrial lift truck industries.\nSteel Operations Segment Competition\n\nmelting steel, busheling, bundled scrap, shredded scrap, and other scrap metal products, such as steel turnings and cast iron. These products vary in properties or attributes related to cleanness, size of individual pieces, and residual alloys. The necessary characteristics of the ferrous products are determined by the specific needs and requirements of the consumer and affect the individual product’s relative value. We process numerous grades of nonferrous products, including aluminum, brass, copper, stainless steel, and other nonferrous metals. Additionally, we provide transportation logistics (truck, rail, and river barge), marketing, brokerage, and scrap management services, providing competitive price and cost advantages to our suppliers and customers. We design, install, and manage customized scrap management programs for industrial manufacturing companies.\nWe sell various grades of processed ferrous scrap to end-users, such as EAF steel mills, integrated steelmakers, foundries, secondary smelters, and metal brokers, who aggregate materials for other large users. Ferrous scrap metal is the primary raw material for EAFs, including our steel mills. Most of our ferrous scrap customers purchase processed scrap through negotiated spot sales contracts which establish a quantity purchase for the month. The price we charge for ferrous scrap depends upon market demand, composition, size, weight, and transportation costs, as well as the quality and grade of the scrap. We sell various grades of processed nonferrous scrap to end-users such as aluminum sheet and ingot manufacturers, brass and bronze ingot makers, copper refineries, mills, including our new recycled aluminum flat rolled products mill, smelters, specialty steelmakers, alloy manufacturers, wire and cable producers, and utilities. The price we charge for nonferrous scrap also depends upon market demand and pricing, transportation costs, as well as the quality and grade of the scrap.\nScrap is a global commodity influenced by conditions in a number of industrialized and emerging markets throughout Asia, Europe, and North America. The markets for scrap metals are highly competitive, both in the purchase of raw or unprocessed scrap, and the sale of processed scrap. With regard to the purchase of unprocessed scrap, we compete with numerous independent recyclers, as well as smaller scrap companies engaged only in collecting obsolete scrap. In many cases, we also purchase unprocessed scrap metal from smaller scrap dealers and other processors. Successful procurement of materials is determined primarily by the price offered by the purchaser for the raw scrap and the proximity of our processing facility to the source of the raw scrap. Both ferrous and nonferrous scrap sell as a commodity in both domestic and international markets, which are affected, sometimes significantly, by relative economic conditions, currency fluctuations, and the availability and cost of transportation. Competition for sales of processed scrap is based primarily on the price, quality, and location of the scrap metals, as well as the level of service provided in terms of reliability and timing of delivery.\nWe also face potential competition for sales of processed scrap from other producers of steel products, such as EAFs and integrated steel mills, some of which, like us, are also vertically connected in the scrap metals recycling business. In addition, other steel mills may compete with us in attempting to secure scrap supply through direct purchasing from our scrap suppliers. Scrap metal processors also face competition from substitutes for prepared ferrous scrap, such as pig iron, pelletized iron, hot briquetted iron (HBI), direct reduced iron (DRI), and other forms of processed iron.\nThe industry is highly fragmented with many small, regional, national, and global companies, which have multiple locations in areas in which our metals recycling operations operate. No single scrap metals recycler has a significant market share in the domestic market.\n\nSteel Dynamics, Inc. is one of the largest domestic steel producers and metal recyclers in the United States, based on estimated steelmaking and steel coating capacity of approximately 16 million tons and actual metals recycling volumes as of December 31, 2024, with one of the most diversified product and end market portfolios in the domestic steel industry, combined with meaningful downstream steel fabrication operations. The company is currently investing in its aluminum operations to further diversify its end markets with plans to supply aluminum flat rolled products with high recycled content to the countercyclical sustainable beverage can industry, in addition to the automotive and industrial sectors. Primary sources of revenue are currently from the manufacture and sale of steel products, the processing and sale of recycled ferrous and nonferrous metals, and the fabrication and sale of steel joists and deck products.\nWe refer to our founding principles as our six core strategic pillars. They bring us together with a common focus, and they provide the foundation upon which we operate and grow. Our unique entrepreneurial culture and business model benefit us operationally, financially, and through the responsible use of our resources in diverse economic environments. Innovation in all forms is essential to our success, and our teams focus on how to do things “smarter” within our current operations, as well as how we continue to grow. This means creating solutions for our teammates, customers, suppliers, and other stakeholders. It also includes finding ways to “do business” with fewer resources and less environmental impact. Our six strategic pillars and the team’s execution of them each day has driven our success and sustainability.\nSafety is our primary focus and core value. Nothing surpasses the importance of creating and maintaining a safe work environment. Our goal is zero injuries—no accidents.\nEntrepreneurial Culture –\nFosters a team of energetic, positive, driven, innovative and diverse individuals by utilizing open communication and meaningful performance-based compensation aligned to our strategic focus.\nCustomer Commitment –\nWe focus on being a preferred partner of our customers by providing quality products and unique supply chain solutions to meet their current and future needs.\nStrategic Sustainable Growth –\nWe focus on strategic growth with intentional margin expansion and consistency through-the-cycle.\nThrough individual creativity and ingenuity, our teams drive innovation to improve safety, quality, productivity, and resource sustainability. We strive to provide unique, superior products, customer supply chain solutions, and next-generation technologies and processes.\nFinancial Strength –\nThrough our adaptable value-added product diversification, vertically connected businesses model, coupled with our highly variable operating cost structure and performance-based incentive compensation, along with our continued operating innovations and efficiency, we achieve higher utilization and lower costs, which provide strong cash flow generation through both strong and weak market cycles.\nDifferentiated Model - Uniquely Steel Dynamics\nCompetitively advantaged differentiation in everything we do is core to our long-term value creation strategy. We distinguish ourselves in every aspect of our business through an overarching spirit of excellence.\n\nUnique Entrepreneurial Culture\nOur entrepreneurial culture is the foundation of our success and is driven by our extensive, performance-based incentive compensation philosophy for those on the plant floor to our senior leadership team. Over 60% of a production team member’s total potential compensation is “at risk” to both quality production and cost-effectiveness metrics. Over 85% of our senior leadership team’s total potential compensation is “at risk” to companywide financial performance metrics that encourage long-term value creation, including return on equity, growth, cash generation, and return on invested capital measures. We believe diversity within our teams enhances broad-based thinking, innovation, and value creation. Our common goal of consistently achieving excellence in all we do is reflected in the esprit de corps that permeates our team.\nDiversified, Value-Added Product Offerings and Supply-Chain Solutions\nWe have one of the most diversified, high-margin product offerings within the domestic steel industry. We have a track record of profitable growth, driving diversification in both end markets and value-added product offerings to sustain higher volume and profitability through varying market environments. Over 70% of our steel and steel fabrication sales are considered value-added. Throughout our history and today, we seek to provide unique supply-chain alternatives for our customers to increase efficiency, reduce time and costs, and promote decarbonization opportunities. Growing with our customers in this manner has proven to be invaluable in creating long-lasting relationships and product development.\nThe majority of our steelmaking operations are in locations near sustainable sources of scrap metals and near our customer base, allowing us to realize freight savings for inbound scrap as well as for outbound steel products destined for our customers. This also allows us to provide consistent on-time delivery to our customer base with relatively short lead times, further solidifying our customer relationships.\nThis diversified portfolio of products enables us to access a broad range of markets, serve a large customer base, and helps mitigate our market exposure to any one product or sector, resulting in increased through-cycle steel mill utilization. In addition, our value-added product offerings help to balance our exposure to commodity grade products supplied by other manufacturers. We will continue to seek additional opportunities, such as entering the recycled aluminum flat rolled products market, and collaborating with our customers to anticipate their future needs by further expanding our range of",
  "item7_clean": "Selling, General and Administrative Expenses\n. Selling, general and administrative expenses consist of all costs associated with our sales, finance and accounting, and administrative departments, including, among other items, labor and related benefits, and professional services.\nCompanywide profit sharing and amortization of intangible assets are each separately presented in the statements of income.\nInterest Expense, net of Capitalized Interest\n. Interest expense consists of interest associated with our senior credit facilities and other debt, net of interest costs that are required to be capitalized during the construction period of certain capital investment projects.\nOther (Income) Expense, net\n. Other income consists of interest income earned on our temporary cash deposits, short-term and other investments, and any other non-operating income activity, including income from investments in unconsolidated affiliates accounted for under the equity method. Other expense consists of any non-operating costs, such as certain acquisition and financing expenses.\nDuring 2024 we achieved steel shipments of 12.7 million tons, our second highest annual volume behind 2023’s 12.8 million tons. Underlying domestic steel demand was stable during 2024, but imports of certain steel products, most notably coated flat rolled steels, caused pricing pressure for flat rolled steel products. While facing a challenging pricing environment throughout much of the year, our metals recycling teams maintained consistent volumes during 2024 compared to 2023. A solid non-residential construction market during 2024 benefited our steel fabrication operations, as the segment achieved historically strong volumes and average selling prices, compared to pre-Covid levels. Consolidated net sales were $17.5 billion during 2024, with cash flow from operations of $1.8 billion. Metal spread compression in our steel and, particularly, steel fabrication segments resulted in significantly lower operating income in 2024 compared to 2023.\nConsolidated operating income for 2024 decreased $1.2 billion, or 38%, to $1.9 billion, compared to $3.2 billion in 2023. Net income attributable to Steel Dynamics, Inc. for 2024 decreased $913.7 million, or 37%, to $1.5 billion, compared to 2023. Diluted earnings per share attributable to Steel Dynamics, Inc. was $9.84 for 2024, compared to $14.64 for 2023.\nManagement’s Discussion and Analysis of Financial Condition and Results of Operations\n\nITEM 7. MANAGEMENT’S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS\nForward-Looking Statements\nThis report contains some predictive statements about future events, including statements related to conditions in domestic or global economies, conditions in steel, aluminum, and recycled metals market places, Steel Dynamics' revenues, costs of purchased materials, future profitability and earnings, and the operation of new, existing or planned facilities. These statements, which we generally precede or accompany by such typical conditional words as \"anticipate\", \"intend\", \"believe\", \"estimate\", \"plan\", \"seek\", \"project\", or \"expect\", or by the words \"may\", \"will\", or \"should\", are intended to be made as \"forward-looking\", subject to many risks and uncertainties, within the safe harbor protections of the Private Securities Litigation Reform Act of 1995. These statements speak only as of this date and are based upon information and assumptions, which we consider reasonable as of this date, concerning our businesses and the environments in which they operate. Such predictive statements are not guarantees of future performance, and we undertake no duty to update or revise any such statements. Some factors that could cause such forward-looking statements to turn out differently than anticipated include: (1) domestic and global economic factors; (2) global steelmaking overcapacity and imports of steel, together with increased scrap prices; (3) pandemics, epidemics, widespread illness or other health issues; (4) the cyclical nature of the steel industry and the industries we serve; (5) volatility and major fluctuations in prices and availability of scrap metal, scrap substitutes and supplies, and our potential inability to pass higher costs on to our customers; (6) cost and availability of electricity, natural gas, oil, and other energy resources are subject to volatile market conditions; (7) increased environmental, greenhouse gas emissions and sustainability considerations from our customers and investors or related regulations; (8) compliance with and changes in environmental and remediation requirements; (9) significant price and other forms of competition from other steel and aluminum producers, scrap processors and alternative materials; (10) availability of an adequate source of supply of scrap for our metals recycling operations; (11) cybersecurity threats and risks to the security of our sensitive data and information technology; (12) the implementation of our growth strategy; (13) our ability to retain, develop and attract key personnel; (14) litigation and legal compliance; (15) unexpected equipment downtime or shutdowns; (16) governmental agencies may refuse to grant or renew some of our licenses and permits; (17) our senior unsecured credit facility contains, and any future financing agreements may contain, restrictive covenants that may limit our flexibility; and (18) the impacts of impairment charges.\nMore specifically, we refer you to our more detailed explanation of these and other factors and risks that may cause such predictive statements to turn out differently, as set forth in the sections titled\nSpecial Note Regarding Forward-Looking Statements\nat the beginning of Part I of this Report and Item 1A.\n, and on our website,\nwww.steeldynamics.com\nunder “Investors – SEC Filings.”\nOperating Statement Classifications\n. Net sales from our operations are a factor of volumes shipped, product mix, and related pricing. We charge premium prices for certain grades of steel, product dimensions, certain smaller volumes, and for value-added processing or coating of our steel products. Except for the steel fabrication operations, we recognize revenues from sales and the allowance for estimated returns and claims from these sales at the point in time control of the product transfers to the customer, upon shipment or delivery. Our steel fabrication operations recognize revenues over time based on completed fabricated tons to date as a percentage of total tons required for each contract.\n. Our costs of goods sold represent all direct and indirect costs associated with the manufacture of our products. The principal elements of these costs are scrap and scrap substitutes (which represent the most significant single component of our consolidated costs of goods sold), steel substrate, direct and indirect labor and related benefits, alloys, zinc, transportation and freight, repairs and maintenance, utilities such as electricity and natural gas, and depreciation.\n\nMetallic raw materials used in our electric arc furnaces represent our single most significant steel manufacturing cost, generally comprising approximately 55% to 65% of our steel mill operations’ manufacturing costs. Our metallic raw material cost consumed in our steel mills decreased $28 per net ton, or 7%, in 2024 compared to 2023, consistent with overall decreased domestic scrap pricing noted below in the metals recycling operations segment discussion.\nAs a result of average selling prices decreasing more than scrap costs, specifically for long products, metal spread (which we define as the difference between average steel mill selling prices and the cost of ferrous scrap consumed in our steel mills) decreased 3% in 2024 compared to 2023. Due to metal spread compression, operating income for the steel operations decreased 16% to $1.6 billion in 2024 compared to 2023.\nMetals Recycling Operations Segment\nMetals recycling operations include our OmniSource ferrous and nonferrous processing, transportation, marketing, brokerage, and scrap management services primarily throughout the United States and Mexico. Our steel mills utilize a large portion of the ferrous scrap sold by our metals recycling operations as raw material in our steelmaking operations, and the remainder is sold to other consumers, such as other steel manufacturers and foundries. In 2024 and 2023, 62% of metals recycling operations ferrous scrap was sold to our own steel mills, while our steel mill utilization remained consistent at 81% and 82% in 2024 and 2023, respectively. Metals recycling operations accounted for 11% of our consolidated net sales during 2024 and 2023.\nMetals Recycling Operations Shipments:\nYears Ended December 31,\nFerrous metal (gross tons)\nNonferrous metal (thousands of pounds)\nSegment Results 2024 vs. 2023\nDuring 2024, our metals recycling operations continued to benefit from solid domestic steel industry demand, resulting in consistent ferrous and nonferrous scrap shipments compared to 2023. Net sales for our metals recycling operations in 2024 were comparable to 2023 based on consistent shipments. Due to a challenging pricing environment throughout much of 2024, ferrous average selling prices decreased 7% while nonferrous average selling prices increased 10% during 2024 compared to 2023.\nFerrous metal spread (which we define as the difference between average selling prices and the cost of purchased scrap) was flat and nonferrous metal spread increased 13% during 2024 compared to 2023. As a result of the overall increased metals spreads, metals recycling operations operating income increased 61% to $76.8 million in 2024 compared to 2023.\n\nConsolidated Results 2024 vs. 2023\nSelling, General and Administrative Expenses.\nSelling, general and administrative expenses of $664.1 million during 2024 increased 13% from $588.6 million during 2023 primarily due to an increase in payroll and benefits expense related to the growth of the aluminum operations segment during 2024. Selling, general and administrative expenses represented 3.8% and 3.1% of net sales during 2024 and 2023, respectively.\nProfit sharing expense during 2024 of $164.9 million decreased 39% from $272.0 million during 2023, consistent with decreased pretax earnings. This decrease in profit sharing expense was the primary driver of decreased operating loss for other operations of 20% in 2024 compared to 2023. Profit sharing expense for eligible employees is 8% of consolidated pretax income excluding noncontrolling interests and other items. Refer to Note 10.\nto the consolidated financial statements elsewhere in this report for further information.\nInterest Expense, net of Capitalized Interest.\nDuring 2024, interest expense of $56.3 million decreased 26% from $76.5 million during 2023. The lower interest expense in 2024 compared to 2023 is due to higher capitalized interest in 2024 ($66.8 million, compared to $33.0 million in 2023) related to our ongoing expansion projects, most notably within Aluminum Operations.\nOther (Income) Expense, net.\nNet other income was $96.2 million in 2024, compared to $144.2 million in 2023, due primarily to the impact of foreign currency exchange rate losses of $18.7 million in 2024 compared to gains of $10.5 million in 2023, as well as a $21.8 million reduction in interest income on investments in 2024 compared to 2023 due to a decrease in the balance of invested cash during 2024.\nDuring 2024, income tax expense of $432.9 million, at an effective income tax rate of 21.8%, decreased 42% compared to the $751.6 million, at an effective income tax rate of 23.3%, during 2023, consistent with decreased pretax earnings. Our effective tax rate decrease was due primarily to certain discrete tax adjustments during the third quarter and fourth quarters of 2024. Refer to Note 4.\nto the consolidated financial statements elsewhere in this report for additional information.\nIncluded in the balance of unrecognized tax benefits at December 31, 2024, are potential benefits of $26.4 million that, if recognized, would affect the effective tax rate. We recognize interest and penalties related to our tax contingencies on a net-of-tax basis in income tax expense. During the year ended December 31, 2024, we recognized expense from the increase of interest expense and penalties of $710,000, net of tax. In addition to the unrecognized tax benefits noted above, we had $4.2 million accrued for the payment of interest and penalties at December 31, 2024.\nWe file income tax returns in the United States federal jurisdiction as well as income tax returns in various state jurisdictions. The tax years 2021 through 2023 remain open to examination by the Internal Revenue Service and various state and local jurisdictions. At this time, we do not believe there will be any significant examination adjustments that would result in a material change to our financial position, results of operations or cash flows. It is reasonably possible that the amount of unrecognized tax benefits could change in the next twelve months in an amount ranging from zero to $12.0 million, as a result of the expiration of the statute of limitations and other federal and state income tax audits.\n\nWe have entered into operating leases relating principally to transportation and other equipment, and some real estate. Refer to Note 11.\nto the consolidated financial statements elsewhere in this report for this information.\nUnrecognized tax benefits.\nWe expect to make cash outlays in the future related to our unrecognized tax benefits; however, due to the uncertainty of the timing, we are unable to make reasonably reliable estimates regarding the period of cash settlement with the respective taxing authorities. Refer to Note 4.\nto the consolidated financial statements elsewhere in this report for this information.\nEnvironmental and Other Contingencies\nWe have incurred, and in the future will continue to incur, capital expenditures and operating expenses for matters relating to environmental control, remediation, monitoring, and compliance. During 2024, we incurred costs related to the monitoring and compliance of environmental matters in the amount of approximately $60.2 million and capital expenditures related to environmental compliance of approximately $4.3 million. Of the costs incurred during 2024 for monitoring and compliance, approximately 74% were related to the normal transportation of certain types of by-products produced in our steelmaking processes and other facilities in accordance with legal requirements. We incurred combined environmental remediation costs of approximately $4.9 million at all of our facilities during 2024. We have an accrual of $3.8 million recorded for environmental remediation related to our metals recycling operations, $2.6 million related to our idled Minnesota ironmaking operations, and $712,000 related to our steel operations. We believe, apart from our dependence on environmental construction and operating permits for our existing and any future manufacturing facilities, that compliance with current environmental laws and regulations is not likely to have a materially adverse effect on our financial condition, results of operations, or liquidity. However, environmental laws and regulations evolve and change, and we may become subject to more stringent environmental laws and regulations in the future, such as the impact of various governmental legislatures and agencies introducing regulatory changes in response to the potential of climate change.\nCritical Accounting Estimates\nManagement’s Discussion and Analysis of Our Financial Condition and Results of Operations is based upon our consolidated financial statements, which have been prepared in accordance with accounting principles generally accepted in the United States. We review the accounting estimates we use in reporting our financial results on a regular basis. The preparation of these financial s",
  "item2_clean": null
}