{
  "source_file": "stx-20251003.htm",
  "form_type": "10-Q",
  "item1_clean": null,
  "item7_clean": null,
  "item2_clean": "39.4% and net income of $549 million. Our operating cash flow was $532 million, we paid $153 million in dividends and we repurchased approximately 0.2 million of our ordinary shares for $29 million.\nBeginning in fiscal year 2026, we changed our presentation of principal data storage markets to better reflect current demand drivers and the growing impact of AI-driven applications. We now present our products and services under two end markets: Data center and Edge IoT. Data center comprises the majority of the Company’s business and primarily includes high-capacity nearline products for mass capacity data storage and systems sold to cloud and enterprise customers, as well as cloud-based video and image applications. Edge IoT primarily includes consumer and client-centric markets along with network-attached storage, mission critical and SSD.\nWe reflected these changes to our revenue and HDD exabytes shipped by end market retrospectively to the earliest period presented. The change had no impact on our previously reported consolidated net revenue.\nRecent Developments, Economic Conditions and Challenges\nIn the September 2025 quarter, the Data Center markets contributed 80% of total company revenue supported by ongoing demand for our high-capacity nearline drives. Demand growth was led by global cloud customers to support their data storage requirements for applications including AI inferencing and training. At the same time, we continue to operate in a dynamic macroeconomic environment marked by rapid shifts in trade policies and increasing geopolitical tensions. These factors may impact our business and results of operations. We will continue to monitor the situation and assess plans to mitigate future risk to the business. Over the long-term we expect our hard drive storage business to benefit from future growth in data demand and data value, including from the ongoing adoption of Generative AI applications.\nResults of Operations\nWe list in the tables below summarized information from our Condensed Consolidated Statements of Operations by dollar amounts and as a percentage of revenue:\n\nFor the Three Months Ended\n(Dollars in millions)\nMarketing and administrative\nRestructuring and other, net\nProduct Development Expense.\nProduct development expenses increased by $7 million in the September 2025 quarter compared to the June 2025 quarter primarily due to a $5 million increase in compensation and other employee benefits and a $2 million increase in facility costs.\nProduct development expenses increased by $5 million in the September 2025 quarter compared to the September 2024 quarter primarily due to a $3 million increase in facility costs and a $2 million increase in outside services costs.\nMarketing and Administrative Expense.\nMarketing and administrative expenses decreased by $10 million in the September 2025 quarter compared to the June 2025 quarter, primarily due to a $7 million decrease in outside services costs and a $5 million decrease in share-based compensation expense.\nMarketing and administrative expenses increased by $15 million in the September 2025 quarter compared to the September 2024 quarter primarily due to a $7 million increase in share-based compensation expense, a $5 million increase in outside services costs and a $3 million increase in facility costs.\nRestructuring and other, net.\nWe recorded $13 million of restructuring charges in the September 2025 quarter, primarily related to employee related termination benefits.\n\nCash Used in Financing Activities\nNet cash used in financing activities of $221 million for the three months ended October 3, 2025 was primarily attributable to the following activities:\n$153 million in dividends paid to our shareholders;\n$50 million taxes paid related to net share settlement of equity awards;\n$29 million in payments for repurchases of our ordinary shares; and\n$11 million debt fees primarily relating to the Obligor Exchange; partially offset by\n$22 million in proceeds from the issuance of ordinary shares under employee stock plans.\nOur primary sources of liquidity as of October 3, 2025, consist of: (1) approximately $1.1 billion in cash and cash equivalents, (2) cash we expect to generate from operations and (3) $1.3 billion available for borrowing under our senior unsecured revolving credit facility (“Revolving Credit Facility”), which is part of our Credit Agreement (as defined within “Part I, Item 1. Financial Statements—\nAs of October 3, 2025, no borrowings (including swing line loans) were outstanding and no commitments were utilized for letters of credit issued under the Revolving Credit Facility. The Revolving Credit Facility is available for borrowings, subject to compliance with a financial covenant and other customary conditions to borrowing.\nAs of October 3, 2025, the Credit Agreement includes one financial covenant, net leverage ratio of less than or equal to 6.75 to 1.00, commencing with the fiscal quarter ended June 27, 2025 and declining over time so that the maximum permitted net leverage ratio for each fiscal quarter ending after July 2, 2027 is 4.25 to 1.00. As of October 3, 2025, we were in compliance with all of the covenants under our debt agreements. Refer to “Part I, Item 1. Financial Statements—\nfor more details. We continue to evaluate our debt portfolio and structure to comply with our financial debt covenant.\nWe believe that our sources of cash will be sufficient to fund our operations and meet our cash requirements for at least the next 12 months. Our ability to fund liquidity requirements beyond 12 months will depend on our future cash flows, which are determined by future operating performance, and therefore, subject to prevailing global macroeconomic conditions and financial, business and other factors, some of which are beyond our control.\nCash Requirements and Commitments\nOur liquidity requirements are primarily to meet our working capital, product development and capital expenditure needs, to fund scheduled payments of principal and interest on our indebtedness, quarterly dividend, share repurchase program and any future strategic investments.\nPurchase obligations\n\n$1.7 billion, of which $299 million is expected to be paid within one year. As of the calendar quarter ended September 30, 2025, the conditional conversion option of the 2028 Notes was triggered in accordance with the terms of the 2028 Notes indenture.\nAccordingly, the 2028 Notes are exchangeable through December 31, 2025. As a result, we have classified the 2028 Notes within Current liabilities in our\nCondensed Consolidated Balance Sheets as of\nFrom time to time, we may refinance, repurchase, redeem or otherwise extinguish any of our outstanding senior notes in open market or privately negotiated purchases or otherwise, or we may repurchase or redeem outstanding senior notes pursuant to the terms of the applicable indenture. Refer to “Item 1. Financial Statements—\nBIS settlement penalty\nWe accrued a settlement penalty of $300 million for fiscal year 2023, related to BIS’ allegations of violations of the U.S. EAR, which were subsequently resolved by the Settlement Agreement in April 2023. As part of the Settlement Agreement with BIS, quarterly payments of $15 million are made over the course of five years beginning October 31, 2023, of which $60 million is expected to be paid within one year and $120 million thereafter. Refer to “Item 1. Financial Statements—\nNote 11. Legal, Environmental and Other Contingencies\nOn October 28, 2025, our Board of Directors declared a quarterly cash dividend of $0.74 per share, which will be payable on January 9, 2026 to shareholders of record as of the close of business on December 24, 2025. Our ability to pay dividends in the future will be subject to, among other things, general business conditions within the data storage industry, our financial results, the impact of paying dividends on our credit ratings and legal and contractual restrictions on the payment of dividends by our subsidiaries to us or by us to our ordinary shareholders, including restrictions imposed by covenants on our debt instruments.\nFrom time to time, at our discretion, we may repurchase any of our outstanding ordinary shares through private, open market, or broker assisted purchases, tender offers, or other means, including through the use of derivative transactions. During the three months ended October 3, 2025, we repurchased approximately 0.5 million of our ordinary shares including approximately 0.3 million shares withheld for statutory tax withholdings related to vesting of employee equity awards. As of October 3, 2025, $5.0 billion remained available for repurchase under our existing repurchase authorization limit. We may limit or terminate the repurchase program at any time. All repurchases are effected as redemptions in accordance with our Constitution.\nFor fiscal year 2026, we expect capital expenditures to be higher than fiscal year 2025. We require substantial amounts of cash to fund any increased working capital requirements, future capital expenditures, scheduled payments of principal and interest on our indebtedness and payments of dividends. We will continue to evaluate and manage the retirement and replacement of existing debt and associated obligations, including evaluating the issuance of new debt securities, exchanging existing debt securities for other debt securities and retiring debt pursuant to privately negotiated transactions, open market purchases, tender offers or other means or otherwise. In addition, we may selectively pursue strategic alliances, acquisitions, joint ventures and investments, which may require additional capital.\nCritical Accounting Estimates\nOur discussion and analysis of financial condition and results of operations are based upon our Condensed Consolidated Financial Statements, which have been prepared in accordance with U.S. GAAP. The preparation of such statements requires us to make estimates and assumptions th"
}