{
  "source_file": "stz-20250831.htm",
  "form_type": "10-Q",
  "item1_clean": null,
  "item7_clean": null,
  "item2_clean": "2025 Authorization may be accomplished at management’s discretion from time to time based on market conditions, our cash and debt position, and other factors as determined by management. Shares may be repurchased through open market or privately negotiated transactions. We may fund future share repurchases with cash generated from operations, proceeds from borrowings, and/or divestiture proceeds. Any repurchased shares will become treasury shares, including shares previously repurchased under the 2025 Authorization.\nWe currently expect to return $4.0 billion in share repurchases to stockholders from Fiscal 2026 through Fiscal 2028, but such repurchases are dependent upon our financial condition, results of operations, capital requirements, and other factors, including those set forth under Item 1A. “Risk Factors” of our 2025 Annual Report.\nFor additional information, refer to Note 17 of our consolidated financial statements included in our 2025 Annual Report and Note 13.\nAccounting guidance adopted for Six Months 2026 did not have a material impact on our Financial Statements.\n#WORTHREACHINGFOR I 49\nMD&A\nINFORMATION REGARDING FORWARD-LOOKING STATEMENTS\nThe statements under MD&A regarding:\nour business strategy, including our strategic vision, growth plans, digital acceleration initiatives, Beer segment focus on upholding our leadership position in the U.S. beer market, and Wine and Spirits segment focus on delivering growth and improving margins beyond Fiscal 2026;\nour beer expansion, optimization, and/or construction activities, including anticipated scope, capacity, costs, capital expenditures, and timeframes for completion;\nour innovation, marketing, sales, and distribution plans, activities, and strategies;\nour long-term financial model, target comparable net leverage and target dividend payout ratios, future operations, financial condition and position, net sales, expenses including potential future impairment losses, hedging programs, cost savings, restructuring, and efficiency initiatives, including the 2025 Restructuring Initiative, capital expenditures, effective tax rates, anticipated tax liabilities, and potential impacts to our income tax provision, expected volume, inventory, supply and demand levels, balance, cadence, and trends, access to capital markets, liquidity and capital resources, including our ability to consistently generate robust cash flow and raise or repay debt, and prospects, plans, and objectives of management;\nthe evolving consumer demand environment and trends, ongoing socioeconomic factors, including subdued spend, depressed sentiment, value-seeking behaviors, and reductions in the discretionary income, elevated unemployment, changing prices, inflation, other unfavorable global and regional economic conditions, demographic trends in the U.S., global supply chain disruptions and constraints, and geopolitical events,\nincluding the impact of military conflicts,\nand our responses thereto;\nrecent and potential future changes to trade and tariff policies, particularly on imports from Mexico, the European Union including Italy, and New Zealand into the U.S. and retaliatory tariffs and other responses imposed on certain product imports originating from the U.S.;\nexpected or potential actions of third parties, including possible changes to laws, rules, and regulations;\nthe potential impact of severe weather events or other weather conditions;\nthe manner, timing, and duration of the share repurchase program and source of funds for share repurchases; and\nthe amount and timing of future dividends.\nThe statements regarding the future reclassification of net gains from AOCI, potential future impairments of our Canopy investment, potential continued impacts from the OB3 Act on our effective tax rate and and our income tax provision, including from additional clarifications or interpretive guidance related to the OB3 Act, potential impacts from Pillar Two, and our aim to hedge 100% of our balance sheet exposures.\n#WORTHREACHINGFOR I 50\nMD&A\npotential further declines in the consumption of products we sell and our dependence on sales of our Mexican beer brands;\nimpacts of our acquisition, divestiture, investment, and new product development strategies and activities, including the 2025 Wine Divestitures;\ndependence upon our trademarks and proprietary rights, including the failure to protect our intellectual property rights;\npotential damage to our reputation;\ncompetition in our industry and for talent;\neconomic and other uncertainties associated with our international operations, including new or increased tariffs;\nwater, agricultural and other raw material, and packaging material supply, production, and/or transportation difficulties, disruptions, and impacts, including limited groups of certain suppliers;\nreliance on complex information systems and third‐party global networks, including internal control over financial reporting changes in connection with our OneStream consolidation system implementation, as well as risks associated with cybersecurity and artificial intelligence;\ndependence on limited facilities for production of our Mexican beer brands, including beer operations expansion, optimization, and/or construction activities, scope, capacity, supply, costs (including potential impairments), capital expenditures, and timing;\noperational disruptions or catastrophic loss to our breweries, wineries, other production facilities, or distribution systems;\nsevere weather, natural and man-made disasters, climate change, environmental sustainability and CSR-related regulatory compliance, and failure to meet environmental sustainability and CSR targets, commitments, and aspirations;\nthe success of our cost savings, restructuring, and efficiency initiatives, including changes in key personnel responsible for oversight of our internal control over financial reporting in connection with the 2025 Restructuring Initiative;\nreliance on wholesale distributors, major retailers, and government agencies;\ncontamination and degradation of product quality from diseases, pests, weather, and other conditions;\ncommunicable infection or disease outbreaks, pandemics, or other widespread public health crises impacting our consumers, employees, distributors, retailers, and/or suppliers;\neffects of employee labor activities that could increase our costs;\nour indebtedness and interest rate fluctuations;\nour international operations, worldwide and regional economic trends and financial market conditions, geopolitical uncertainty, including the impact of military conflicts, other governmental rules and regulations, and the U.S. federal government shutdown;\nclass action or other litigation we face or may face, including relating to alleged securities law violations, abuse or misuse of our products, product liability, marketing or sales practices, including product labeling, or other matters;\npotential impairments of our intangible assets, such as goodwill and trademarks;\nchanges to tax laws, fluctuations in our effective tax rate, accounting for tax positions, the resolution of tax disputes, changes to accounting standards, elections, assertions, or policies, and the potential impact of a global minimum tax rate;\nuncertainties related to future cash dividends and share repurchases, which may affect the price of our common stock;\nownership of our Class A Stock by certain individuals and entities affiliated with the Sands family and their Board of Director nomination rights; and\nthe choice-of-forum provision in our amended and restated by-laws regarding certain stockholder litigation.\n#WORTHREACHINGFOR I 51\nOTHER KEY INFORMATION\n\nITEM 2. MANAGEMENT’S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS.\nINTRODUCTION\nThis MD&A provides additional information on our businesses, current developments, financial condition, cash flows, and results of operations. It should be read in conjunction with our Financial Statements and with our consolidated financial statements and notes included in our 2025 Annual Report. This MD&A is organized as follows:\nThis section provides a general description of our business, which we believe is important in understanding the results of our operations, financial condition, and potential future trends.\nThis section provides a description of our strategy, including our 2025 Restructuring Initiative, and significant divestitures, acquisitions, and investments.\nResults of operations\nThis section provides an analysis of our results of operations presented on a business segment basis for the three months ended August 31, 2025, and August 31, 2024, and six months ended August 31, 2025, and August 31, 2024. In addition, a brief description of significant transactions and other items that affect the comparability of the results is provided.\nLiquidity and capital resources\nThis section provides an analysis of our cash flows, outstanding debt, and liquidity position. Included in the analysis of outstanding debt is a discussion of the financial capacity available to fund our on-going operations and future commitments, as well as a discussion of other financing arrangements.\nOVERVIEW\nWe are an international producer and marketer of beer, wine, and spirits with operations in the U.S., Mexico, New Zealand, and Italy with powerful, consumer-connected, high-quality brands like Modelo Especial, Corona Extra, Pacifico, Robert Mondavi Winery, Kim Crawford, The Prisoner Wine Company, High West, Casa Noble, and Mi CAMPO. In the U.S., we are one of the top growth contributors at retail among beverage alcohol suppliers. We are also the second-largest beer company and have the #1 beer brand, Modelo Especial, in dollar sales in the U.S. We continued to strengthen our leadership position in the U.S. beer market as the #1 dollar share gainer in the high-end and the overall\n#WORTHREACHINGFOR I 30\nMD&A\nU.S. beer market. Within wine and spirits, we have implemented a multi-year strategy that repositione"
}