{
  "source_file": "smur-20250930.htm",
  "form_type": "10-Q",
  "item1_clean": null,
  "item7_clean": null,
  "item2_clean": "results discussed below. More information regarding these risks and uncertainties and other important factors that could cause actual\n\nforward-looking statements that involve risks and uncertainties. Smurfit Westrock’s future results could differ materially from the\n\nRESULTS OF OPERATIONS\nThe following table summarizes Smurfit Westrock’s consolidated results for the periods presented ($ in millions):\nThree months ended September 30,\nNine months ended September 30,\nSelling, general and administrative expenses\nImpairment and restructuring costs\nTransaction and integration-related expenses associated with\nPension and other postretirement non-service income\nInterest expense, net\nIncome (loss) before income taxes\nNet loss attributable to noncontrolling interests\nNet income (loss) attributable to common shareholders\nResults of operations for the three and\n\ncomparable GAAP measure, for the periods presented ($ in millions).\nThree months ended September 30,\nNine months ended September 30,\nDepreciation, depletion and amortization\nImpairment and restructuring costs\nTransaction and integration-related expenses associated with\nAmortization of fair value step up on inventory\nInterest expense, net\nPension and other postretirement non-service (income)\nShare-based compensation expense\n3. Segment Information\nConsolidated Financial Statements for additional information regarding “Other\n\nindicative of the ongoing operating results of the business.\nThe following table contains selected financial information for Smurfit Westrock’s segments for the periods presented\nThree months ended September 30,\nNine months ended September 30,\nNet sales (aggregate):\nEurope, MEA and APAC\nLATAM\nSegment Adjusted EBITDA:\nEurope, MEA and APAC\nLATAM\nNet sales before intersegment eliminations\n\nbelow for additional information.\nRefer to “Results of Operations” for a detailed review of Smurfit Westrock’s performance.\nSIGNIFICANT FACTORS AND TRENDS AFFECTING SMURFIT WESTROCK’S RESULTS\nSmurfit Westrock’s operations have been, and will continue to be, affected by many factors, some of which are beyond the Company’s\n\nand a $12 million net negative impact from foreign currency translation of monetary assets and liabilities.\nIncome tax expense was\nin the three months ended\n, compared to an income tax expense of\n\nIt also directionally correlates with levels of industrial production and is impacted by the trends affecting the choice of medium (paper,\n\nresults to differ materially from those in the forward-looking statements is set forth under the heading “Risk Factors” in Part I, Item\n\ntons. In the third quarter of 2025, we reached agreements with the local works councils in Germany and are in the process of closing\n\nsolutions. These trends have, to date, been beneficial for paper-based packaging, which is typically made from renewable, recyclable\n\nthe third quarter, with no discrete period tax impacts of the change in tax law arising. Impacts from the legislation are either not\n\nincluded approximately $23 million for the extra five days in the quarter compared to the prior year period since the Combination\n\ndemand growth can be disrupted by other macroeconomic trends, including inflation, pandemics (such as the COVID-19 pandemic\n\nmaterials. Changing demographics can also influence demand trends in the pharmaceutical industry, a major user of consumer\n\nrestructuring costs consisted of\nof impairment charges and\nof restructuring costs. In the three months ended\n\n, while the effective tax rate for the three months ended\nIncome tax expense was\n\nInterest expense, net with unrelated parties\nInterest expense, net with Non-Obligor Subsidiaries\nNet income and net income attributable to the Obligor Group\nSUMMARIZED BALANCE SHEETS\nASSETS\nCurrent amounts due from Non-Obligor Subsidiaries\nOther current assets\nTotal current assets\nNon-current amounts due from Non-Obligor Subsidiaries\n\nin June 2025 and May 2025, respectively.\n5. Impairment and Restructuring Costs\nConsolidated Financial Statements for additional information.\nTransaction and Integration-related Expenses Associated with the Combination\nThe Company incurred transaction and integration-related expenses associated with the Combination of\n\nhigher costs of $84 million, partly offset by a higher selling price mix of $65 million.\nLIQUIDITY AND CAPITAL RESOURCES\nSources and Uses of Cash\nSmurfit Westrock’s primary sources of liquidity are the cash flows generated from its operations, its commercial paper program, and\n\nthat management believes are not indicative of the ongoing operating results of the business.\nManagement believes that the most directly comparable GAAP measure to Adjusted EBITDA is “\nSet forth below is a reconciliation of the non-GAAP financial measure Adjusted EBITDA to\n\nreceivables securitization facilities and the amount outstanding under the Company’s vendor financing and commercial card programs.\nThe following table contains selected financial information from Smurfit Westrock’s Condensed Consolidated Statements of Cash\n\nand unconditionally guarantees SWF’s obligations under the Original Notes and the New Notes. SKT and SWF are both wholly-\nowned subsidiaries of Smurfit Westrock plc. Smurfit Westrock plc and the Subsidiary Guarantors are collectively referred to herein as\n\nsubsidiaries, including, among others, Smurfit Kappa and WestRock, when referring to periods after the Combination.\nOVERVIEW\nSmurfit Westrock is one of the world's largest integrated manufacturers of paper-based packaging products in terms of volumes and\n\nmanagement believes are not indicative of the ongoing results of the business\n. Smurfit Westrock management also uses this non-\nGAAP financial measure in making financial, operating and planning decisions, and in evaluating company performance. Non-GAAP\n\nof 1933, as amended, and will not have any transfer restrictions, registration rights or additional interest provisions.\nThe Original Notes and the New Notes are subject to any limitations under applicable law, fully and unconditionally guaranteed,\n\nthe “Guarantors”, and the Issuers and the Guarantors are collectively referred to herein as the “Obligor Group”.\nOperations are conducted almost entirely through Smurfit Westrock plc’s subsidiaries other than the Issuers and the Subsidiary\n\nthe section above entitled “Cautionary Note Regarding Forward-Looking Statements” for additional information.\nSmurfit Kappa was determined to be the accounting acquirer in the Combination; therefore, the historical consolidated financial\n\nFlows for the periods presented ($ in millions):\nNine months ended September 30,\nNet cash provided by operating activities\nNet cash used for investing activities\nNet cash (used for) provided by financing activities\noperating activities\n\nConsolidated Financial Statements\nfor a discussion of the Company’s additional debt-related information.\nThe Company believes that the cash flows generated from its operations, cash on hand, its commercial paper program, available\n\nConsolidated Financial Statements for a discussion of the Company’s monetization facilities.\nSmurfit Westrock’s working capital management strategy includes working with its suppliers to revisit terms and conditions, including\n\nfinancial institutions, and receivables securitization facilities. The programs are described below.\nThe Company engages in certain customer-based SCF programs to accelerate the receipt of payment for outstanding accounts\n\nItem 2. Management’s Discussion and Analysis\nof Financial Condition and Results of Operations\nThe following discussion and analysis of Smurfit Westrock’s financial condition and results of operations should be read in\n\nof integration-related expenses associated with the Combination\nTransaction-related costs associated with the Combination were comprised of banking and financing related costs as well as legal and\n\nBasis of Preparation of the Summarized Financial Information\nThe tables below present summarized financial information provided in conformity with Rule 13-01 of the SEC’s Regulation S-X. The\n\nanticipated to impact the total tax expense.\nSEGMENT INFORMATION\nSmurfit Westrock has identified\noperating segments based on how the CODM makes key operating decisions, allocates resources\n\ndue to the strengthening of the euro against the U.S. dollar, partly offset by lower volumes of $37 million.\nNet sales before intersegment eliminations for the Europe, MEA and APAC segment\n\nby $27 million primarily due to a\nhigher sales price mix of $39 million, partly offset by lower volumes of $4 million.\nNet sales before intersegment eliminations for the LATAM segment\n\nresults of operations or financial position had the subsidiaries operated as independent entities ($ in millions).\nSUMMARIZED STATEMENT OF OPERATIONS\nNet sales to unrelated parties\n\nof $75 million and net negative foreign currency impact of $9 million.\nEurope, MEA and APAC Segment\nNet sales before intersegment eliminations for the Europe, MEA and APAC segment\n\nadjustments” in the table above.\nGUARANTOR SUMMARIZED FINANCIAL INFORMATION\nOn April 3, 2024, Smurfit Kappa Treasury Unlimited Company (“SKT”) completed a private offering of\n\nCapacity Reduction and Facility Closures\nOn April 30, 2025, we filed an 8-K that announced our plan to permanently close our coated recycled paperboard (“CRB”) mill in St.\n\nnegative foreign currency impact of $71 million, partly offse\nt by a $235 million i\nmpact from a higher sales price mix.\nAdjusted EBITDA for the North America segment\n\nof integration-related expenses\nassociated with the Combination.\nThe Company incurred transaction and integration-related expenses associated with the Combination of\n\ncustomers and overall volumes.\nConsumer patterns also play a significant role in demand for corrugated packaging and consumer packaging. In recent years, shifting\n\ndividends and other investment activity, including acquisitions.\n, Smurfit Westrock held cash and cash equivalents of\n, of which $234 million were held in euro,\n\nNon-GAAP Fi"
}