{
  "source_file": "swk-20250927.htm",
  "form_type": "10-Q",
  "item1_clean": null,
  "item7_clean": null,
  "item2_clean": "RESULTS OF OPERATIONS\nCertain Items Impacting Earnings and Non-GAAP Financial Measures\nThe Company has provided a discussion of its results both inclusive and exclusive of certain gains and charges. The results and measures, including gross profit, SG&A, Other, net, Income taxes, segment profit, and corporate overhead, on a basis excluding certain gains and charges, free cash flow, organic revenue and organic growth are Non-GAAP financial measures. These Non-GAAP financial measures are defined and reconciled to their most directly comparable GAAP financial measures below. The Company considers the use of Non-GAAP financial measures relevant to aid analysis and understanding of the Company’s results and business trends aside from the material impact of certain gains and charges and ensures appropriate comparability to operating results of prior periods. Supplemental Non-GAAP information should not be considered in isolation or as a substitute for the related GAAP financial measures. Non-GAAP financial measures presented herein may differ from similar measures used by other companies.\nThe Company provides expectations for the non-GAAP financial measures of full-year 2025 adjusted EPS, presented on a basis excluding certain gains and charges, as well as 2025 free cash flow. Forecasted full-year 2025 adjusted EPS is reconciled to forecasted full-year 2025 GAAP EPS under the section entitled \"2025 Planning Assumptions\" below. Consistent with past methodology, forecasted full-year 2025 GAAP EPS excludes the impacts of potential acquisitions and divestitures, potential future regulatory changes or strategic shifts that could impact the Company's contingent liabilities or intangible assets, respectively, potential future cost actions in response to external factors that have not yet occurred, and any other items not specifically referenced under “2025 Planning Assumptions.” A reconciliation of forecasted 2025 free cash flow to its most directly comparable GAAP estimate is not available without unreasonable effort due to high variability and difficulty in predicting items that impact cash flow from operations, which could be material to the Company’s results in accordance with U.S. GAAP. The Company believes such a reconciliation would also imply a degree of precision that is inappropriate for this forward-looking measure.\nThe Company also provides multi-year strategic goals for the non-GAAP financial measures of adjusted gross margin, presented on a basis excluding certain gains and charges, as well as organic revenue growth. A reconciliation for these non-GAAP measures is not available without unreasonable effort due to the inherent difficulty of forecasting the timing and/or amount of various items that have not yet occurred, including the high variability and low visibility with respect to certain gains or charges that would generally be excluded from non-GAAP financial measures and which could be material to the Company’s results in accordance with U.S. GAAP. Additionally, estimating such GAAP measures and providing a meaningful reconciliation consistent with the Company’s accounting policies for future periods requires a level of precision that is unavailable for these future multi-year periods and cannot be accomplished without unreasonable effort. The Company believes such a reconciliation would also imply a degree of precision that is inappropriate for these forward-looking measures.\nThe Company’s operating results at the consolidated level as discussed below include and exclude certain gains and charges impacting gross profit, SG&A, Other, net, and Income taxes. The Company’s business segment results as discussed below include and exclude certain gains and charges impacting gross profit and SG&A. Corporate overhead as discussed below includes and excludes certain gains and charges. These amounts for the third quarter and year-to-date periods of 2025 and 2024 are as follows:\n(Millions of Dollars)\nGAAP\nNon-GAAP Adjustments\n\nNet sales were $3.756 billion in the third quarter of 2025 in line with prior year sales of $3.751 billion in the third quarter of 2024, as a 5% increase in price and a 1% increase from foreign currency were offset by a 6% decrease in volume. Tools & Outdoor net sales were in line with the third quarter of 2024 as a 5% increase in price, a 1% increase from foreign currency, and a 1% increase from a product line transfer from Engineered Fastening were offset by a 7% decrease in volume. Engineered Fastening net sales increased 3% compared to the third quarter of 2024 as a 4% increase in volume, a 1% increase in price, and a 1% increase from foreign currency were partially offset by a 3% decrease from a product line transfer to Tools & Outdoor.\nNet sales were $11.446 billion in the first nine months of 2025 compared to $11.645 billion in the first nine months of 2024, representing a decrease of 2% as a 2% increase in price was more than offset by a 3% decrease in volume and a 1% decrease from the Infrastructure divestiture. Tools & Outdoor net sales decreased 1% compared to the first nine months of 2024 as a 2% increase in price was more than offset by a 3% decrease in volume. Engineered Fastening net sales decreased 8% compared to the first nine months of 2024 as a 1% increase in price was more than offset by a 6% decrease from the Infrastructure divestiture and a 3% decrease from a product line transfer to Tools & Outdoor.\nCost of Sales and Gross Profit:\nThe Company reported cost of sales of $2.577 billion in the third quarter of 2025 compared to $2.631 billion in the third quarter of 2024. The year-over-year change in cost of sales was primarily driven by lower volume and the supply chain transformation efficiencies, partially offset by the impact from tariffs and inflation. Gross profit, defined as sales less cost of sales, was $1.179 billion, or 31.4% of net sales, in the third quarter of 2025 compared to $1.121 billion, or 29.9% of net sales, in the third quarter of 2024. Non-GAAP adjustments, which increased cost of sales and reduced gross profit, were $8.0 million, or 0.2% of net sales, for the three months ended September 27, 2025 and $24.8 million, or 0.6% of net sales, for the three months ended September 28, 2024. Excluding these adjustments, gross profit was 31.6% of net sales, for the three months ended September 27, 2025, compared to 30.5% of net sales, for the three months ended September 28, 2024. The year-over-year change in gross profit as a percent of sales and adjusted gross profit as a percent of sales was primarily due to benefits from pricing strategies and supply chain transformation efficiencies, partially offset by tariffs, lower volume and inflation.\nThe Company reported cost of sales of $8.079 billion in the first nine months of 2025 compared to $8.275 billion in the first nine months of 2024. The year-over-year change in cost of sales was primarily driven by the same factors discussed above that impacted the third quarter of 2025. Gross profit, defined as sales less cost of sales, was $3.366 billion, or 29.4% of net sales, in the first nine months of 2025 compared to $3.370 billion, or 28.9% of net sales, in the first nine months of 2024. Non-GAAP adjustments, which increased cost of sales and reduced gross profit, were $44.7 million, or 0.4% of net sales, for the nine months ended September 27, 2025 and $72.7 million, or 0.7% of net sales, for the nine months ended September 28, 2024. Excluding these adjustments, gross profit was 29.8% of net sales, for the nine months ended September 27, 2025, compared to 29.6% of net sales, for the nine months ended September 28, 2024. The year-over-year change in gross profit as a percent of sales and adjusted gross profit as a percent of sales was primarily driven by the same factors discussed above that impacted the third quarter of 2025.\nSelling, general and administrative:\nSG&A, inclusive of the provision for credit losses, was $791.0 million, or 21.1% of net sales, in the third quarter of 2025, compared to $797.1 million, or 21.2% of net sales, in the third quarter of 2024. Within SG&A, Non-GAAP adjustments totaled $4.1 million, or 0.1% of net sales, for the three months ended September 27, 2025 and $15.1 million, or 0.4% of net sales, for the three months ended September 28, 2024. Excluding these adjustments, SG&A was 21.0% of net sales for the three months ended September 27, 2025, compared to 20.8% for the three months ended September 28, 2024. SG&A as a percent of sales and adjusted SG&A as a percent of sales are relatively flat year-over-year, as the Company continues to fund growth investments while exercising disciplined and targeted cost management.\nSG&A, inclusive of the provision for credit losses, was $2.531 billion, or 22.1% of net sales, in the first nine months of 2025, compared to $2.478 billion, or 21.3% of net sales, in the first nine months of 2024. Within SG&A, Non-GAAP adjustments totaled $78.7 million, or 0.7% of net sales, for the nine months ended September 27, 2025 and $62.8 million, or 0.6% of net sales, for the nine months ended September 28, 2024. Excluding these adjustments, SG&A was 21.4% of net sales for the nine months ended September 27, 2025, compared to 20.7% for the nine months ended September 28, 2024. The year-over-year change in SG&A as a percent of sales and adjusted SG&A as a percent of sales was driven by growth investments, which were partially offset by targeted cost management.\n\nDistribution center costs (i.e. warehousing and fulfillment facility and associated labor costs) are classified within SG&A. This classification may differ from other companies who may report such expenses within cost of sales. Due to diversity in practice, to the extent the classification of these distribution costs differs from other companies, the Company’s gross margins may not be comparable. Such distribution costs classified in SG&A amounted to $130.3 million and $390.4 million for the three and ni"
}