{
  "source_file": "swks-20251003.htm",
  "form_type": "10-K",
  "item1_clean": "ITEM 1. BUSINESS.\nSkyworks Solutions, Inc., together with its consolidated subsidiaries (“Skyworks” or the “Company”), is a leading developer, manufacturer and provider of analog and mixed-signal semiconductor products and solutions for numerous applications, including aerospace, automotive, broadband, cellular infrastructure, connected home, defense, entertainment and gaming, industrial, medical, smartphone, tablet, and wearables.\nOver the past two decades, Skyworks has made important investments to address key network technologies, from cellular to advanced Wi-Fi\n, enhanced GPS, and Bluetooth\n, among others. Capitalizing on both organic growth and strategic acquisitions, we are targeting high-growth verticals, while at the same time, seeking to diversify our revenue and customer set.\nTargeted investments in next-generation technology and solutions, technical talent, and fabrication capabilities have created the opportunity to expand into high-growth market segments, including electric and hybrid vehicles, industrial and motor control, power supply, 5G wireless infrastructure, optical data communication, data center, automotive, smart home, and several other applications.\nOur key customers include Amazon, Apple Inc. (“Apple”), Arcadyan, Arris, Bose, Ciena, Cisco, Ericsson, Fibocom, Garmin, Gemalto (a Thales company), General Electric, Google, Honeywell, Itron, Lenovo, LG Electronics, Microsoft, Motorola, NETGEAR, Nokia, Northrop Grumman, OPPO, Rockwell Collins, Sagemcom, Samsung, Schneider Electric, Sierra Wireless, Sonos, Sony, Technicolor, Telit, Tesla, TP-Link, VIVO, and Xiaomi. Our competitors include Analog Devices, Broadcom, Cirrus Logic, Murata Manufacturing, NXP Semiconductors, Qorvo, Qualcomm, and Texas Instruments.\nWireless connectivity is expanding on a global basis. A widening range of use cases is driving the high demand for wireless data across a broad array of applications. The advancement of 5G adoption, IoT, connectivity for everyone, automotive electrification and safety, as well as augmented reality and virtual reality technology, all demand faster speeds, increased bandwidth and capacity, significantly lower latency, and more reliable and secure wireless connectivity.\nThe speed and ultra-low latency characteristics inherent in 5G technology are dramatically altering wireless connectivity, creating a market for diverse and transformative applications, and changing how individuals live, work, play, and learn. Most of the world’s largest economies have implemented commercial 5G networks, and the world’s leading smartphone manufacturers have launched multiple generations of 5G-enabled devices.\nWe expect to see a continued expansion in data consumption, dependent on seamless and reliable wireless connectivity. A few statistics illustrate this point. According to the 2025 Ericsson Mobility Report, global mobile data for 5G subscriptions are forecast to reach 6.3 billion by the end of 2030, driven by new users, innovative services, and the convergence of artificial intelligence (“AI”) and 5G technology, and the total number of global IoT connections is now forecast to reach approximately 43 billion by 2030, including connected cars, machines, meters, sensors, point-of-sale terminals, consumer electronics and wearables. Connected cars are forecasted by McKinsey to make up 90% of new vehicles sold globally by 2030.\nSkyworks helps facilitate these opportunities with highly customized solutions that support a broad set of wireless systems and protocols including cellular (such as 5G), Wi-Fi\n, Accutime™, HD-Radio™, LoRa\n. Additionally, Wi-Fi\n8, the next generation of Wi-Fi\ntechnology, complements 5G by providing high-speed wireless connectivity in local environments. Faster data rates and improved efficiency cater to the growing number of devices reliant on wireless networks.\nWe believe AI can be a catalyst for more efficient and effective wireless communications. From endpoint devices to data centers, generative AI applications will drive the need for higher speed and higher bandwidth networks, while increasing the requirements for our precision timing solutions.\nThe first wave of AI-capable phones is reaching scale, and early demand signals are encouraging. As AI capabilities become more intuitive and integrated, we believe this could drive an inflection in upgrade cycles, leading to a potential tailwind to volumes and content over time.\nFinally, with the rapid transition towards electrification and advanced safety in vehicles, we are focused on high growth segments and content opportunities, including (i) power isolation chips for on-board chargers, powertrain, and battery management systems in electric vehicles, (ii) connectivity, with telematics and other solutions being enabled by 4G/5G cellular engines, Wi-Fi\n, Ultra-wide band, Ethernet, and GPS, and (iii) in-vehicle infotainment systems, driven by digital radio coprocessors, and solutions supporting advanced driver-assistance systems and autonomous driving.\nSolving Connectivity Challenges\nHighly integrated semiconductor solutions are pivotal in deploying next-generation standards, resolving analog, mixed-signal, and RF complexities that challenge existing hardware and network infrastructure. Addressing these design challenges requires diverse competencies including signal transmission, seamless hand-offs between multiple standards, power management, voltage regulation, battery charging, advanced filtering, and tuning.\nWe are at the forefront of this new era of connectivity, delivering the solutions that help enable the true potential of 5G and IoT. We have a rich heritage in analog systems design and have spent years investing in key technologies and resources. Our strength is underpinned by world-class performance and scale across a broad array of capabilities that include advanced TC-SAW and BAW filters, an expanded family of MIMO, ultra-high band, and diversity receive modules, timing devices, and digital power isolators. From our breakthrough Sky5\nunifying platform to our 5G small cell solutions, our approach across both infrastructure and user equipment facilitates powerful, high-speed, end-to-end 5G connectivity.\nMajor elements of our strategy include:\nIndustry-Leading Technology\nAs the industry migrates to more complex 5G architectures across a multitude of wireless applications, we are poised to help our customers handle growing levels of system complexity across both the transmit and receive chains. The trend towards increasing front-end and analog design challenges in smartphones and other platforms plays directly into our core strengths. Additionally, accelerating AI trends could catalyze the smartphone transformation with incremental content driving unprecedented functional and physical densities. These advancements will deliver more bandwidth, faster speeds, and enable applications like virtual reality, augmented reality, live video streaming, and seamless IoT connectivity. Crucially, they aim to bring us closer to achieving reliable low latency, ideal for massive machine communications, and introduces non-terrestrial networks that enable satellite connectivity for emergency applications.\nWe believe that we offer the broadest portfolio of radio and analog solutions from the transceiver to the antenna as well as all required manufacturing process technologies. We are also a leader in passive devices, advanced integration, including proprietary shielding and 3-D die stacking, as well as SAW, TC-SAW, and BAW filters. Our product portfolio is reinforced by a library of approximately 5,200 worldwide issued patents and other intellectual property that we own and control. Together, our industry-leading technology enables us to deliver the highest levels of product performance and integration.\nCustomer Relationships\nGiven our scale and technology leadership, we are engaged with leading original equipment manufacturers (“OEMs”), smartphone providers, and baseband reference design partners in the analog and mixed-signal semiconductor industry. Our customers value the scale of our global supply chain, our innovative technology, our ability to curate and deliver unique solutions, and our system engineering expertise, resulting in deep customer loyalty. We partner with our customers to support their long-term product road maps and are valued as a system solutions provider rather than just a discrete product vendor.\nWe are diversifying the reach of our business by expanding our addressable markets and broadening our product portfolio to serve a wider array of global customers. With the increasing adoption of 5G and the opportunity to enable more applications, we are growing our business beyond mobile devices (where we support leading top-tier manufacturers, including the leading smartphone suppliers and key baseband vendors) into additional high-performance analog markets, including automotive, home and factory automation, data center, solar, wireless infrastructure, aerospace and defense, medical, smart energy, and wireless\nnetworking. In these markets we leverage our scale, intellectual property, and worldwide distribution network, which spans approximately 6,900 customers and 4,900 unique products.\nDelivering Operational Excellence\nThrough advanced supply chain management, we combine our highly specialized internal manufacturing capabilities with alliances and strategic relationships for leading-edge technologies. This hybrid manufacturing model allows us to better balance our manufacturing capacity with the demand of the marketplace.\nAdditionally, we continue to drive reductions in product design and manufacturing cycle times and further improve product yields. The combination of agile, flexible capacity, and world-class module manufacturing and scale advantage allows us to achieve low product costs while integrating multiple technologies into highly sophisticated multi-chip modules and helping to ensure stable supply to our global customer base.\nMaintaining a Performance-Driven Culture\nWe consider our people and corporate culture to be a competitive advantage and a key component of our corporate strategy, aligning employee efforts and responsibilities with performance measurement. Accountability is paramount, and we compensate our employees through a pay-for-performance methodology.\nGenerating Superior Operating Results and Stockholder Returns\nWe believe our manufacturing scale, broad product portfolio, strong profitability, and consistent cash flow generation position us to provide superior results and strong returns to our stockholders.\nOur Product Portfolio\nOur extensive product portfolio includes:\nAmplifiers: the modules that strengthen the signal so that it has sufficient energy to reach a base station\nAntenna Tuners: aperture and impedance tuning products that improve antenna performance across frequencies\nAttenuators: circuits that allow a known source of power to be reduced by a predetermined factor (usually expressed as decibels)\nAutomotive Tuners and Digital Radios: tuners, data receivers, and digital radio coprocessors used in automotive infotainment systems\nWireless ASoC: an intelligent 2.4 GHz and 5GHz wireless radio integrated circuit that includes all the analog and digital functions optimized for building cognitive wireless audio headsets, headphones, and wireless speaker systems\nDC/DC Converters: an electronic circuit which converts a source of direct current from one voltage level to another\nDemodulators: a device or an RF block used in receivers to extract the information that has been modulated onto a carrier or from the carrier itself\nDetectors: devices used to measure and control RF power in wireless systems\nDigital Power Isolators: energy efficient solutions used in industrial control, solar inverters and hybrid/electric automotive drive trains\nDiodes: semiconductor devices that pass current in one direction only\nDirectional Couplers: transmission coupling devices for separate",
  "item7_clean": "OVERVIEW\nWe, together with our consolidated subsidiaries, are a leading developer, manufacturer and provider of analog and mixed-signal semiconductor products and solutions for numerous applications, including aerospace, automotive, broadband, cellular infrastructure, connected home, defense, entertainment and gaming, industrial, medical, smartphone, tablet, and wearables.\nPending Combination With Qorvo\nOn October 27, 2025, we entered into the Merger Agreement with Qorvo, a provider of connectivity and power solutions, to combine Qorvo and Skyworks in a cash-and-stock transaction that values the combined company at approximately $\nbillion as of the market close on October 27, 2025.\nUnder the terms of the Merger Agreement, at the effective time of the Mergers, each share of Qorvo common stock issued and outstanding immediately prior thereto (with certain exceptions set forth in the Merger Agreement) will be converted into the right to receive\n(the “Exchange Ratio”) of a share of Skyworks common stock and $\nin cash, without interest, subject to applicable withholding taxes. The Exchange Ratio is expected to result in Qorvo equityholders and Skyworks equityholders owning approximately 37% and 63%, respectively, of the combined company on a pro forma basis following the closing. The Merger Agreement also provides for Skyworks’ assumption of certain Qorvo equity awards, subject to certain adjustments thereto in respect of, among other things, performance-based vesting conditions.\nPursuant to the Merger Agreement, immediately following the closing, the Board of Directors will be comprised of 11 directors, consisting of (i) the Chief Executive Officer of Skyworks, who will be the Chief Executive Officer of Skyworks following the closing, (ii) seven directors designated by Skyworks and (iii) three directors designated by Qorvo who are reasonably acceptable to Skyworks, each of whom will hold office until the next annual meeting of stockholders of Skyworks. Promptly following the closing, the Board of Directors will also designate a Chairman. Robert Bruggeworth, Qorvo’s current President, Chief Executive Officer and director, will be one of Qorvo’s designees upon the closing.\nThe Mergers, which are anticipated to close early in calendar year 2027, are subject to the satisfaction or waiver of customary closing conditions, including adoption of the Merger Agreement by Qorvo’s stockholders and the approval by Skyworks’ stockholders of the issuance of Skyworks common stock included in the consideration to be paid to Qorvo stockholders, the expiration or early termination of the waiting period under the Hart-Scott-Rodino Antitrust Improvement Act of 1976, as amended, and other regulatory approvals under certain antitrust and foreign investment regimes, the absence of any order, injunction or law of such jurisdictions prohibiting the Mergers, and the effectiveness of a registration statement on Form S-4 to be filed by us.\nWe and Qorvo each have termination rights under the Merger Agreement. Under specified circumstances, including termination by a party to accept a superior proposal or termination by the other party upon a change in such party’s board of directors’ recommendation to its stockholders, each of Qorvo and us will be required to pay the other party a termination fee of $\nmillion, as more fully described in the Merger Agreement. Alternatively, under certain specified circumstances, including termination following an injunction arising in connection with certain antitrust or foreign investment laws, or failure to receive certain required regulatory approvals of specified governmental authorities, we will be required to pay Qorvo a termination fee of $\nmillion, as more fully described in the Merger Agreement.\nIn connection with the execution of the Merger Agreement, we entered into a commitment letter (“Bridge Commitment Letter”) on October 27, 2025, with Goldman Sachs Bank USA, which committed to provide, subject to the satisfaction of customary closing conditions, up to $\nmillion of senior unsecured bridge term loans for the purpose of financing a portion of the cash portion of the consideration to be paid to Qorvo stockholders, paying related fees and expenses in connection with the Mergers and the other transactions contemplated by the Merger Agreement and, in certain circumstances, to refinance certain of Qorvo’s senior notes. The receipt of financing by us is not a condition to our obligation to consummate the Mergers.\nConcurrently with the execution of the Merger Agreement, we and certain stockholders of Qorvo affiliated with Starboard Value (“SBV”), an affiliate of Peter Feld, a member of the board of directors of Qorvo so designated by SBV (each, a “SBV Stockholder”), entered into a Voting and Support Agreement (the “VSA”), pursuant to which each SBV Stockholder has agreed to vote its shares of Qorvo common stock in favor of the adoption of the Merger Agreement. As of October 24, 2025, the SBV Stockholders collectively held approximately 8% of Qorvo’s issued and outstanding shares. Each SBV Stockholder has also agreed, for a limited period of time not exceeding nine months from the date of the VSA, not to sell or transfer its shares of Qorvo common stock, subject to certain exceptions as specified in the VSA, and has agreed not to solicit any competing acquisition proposal. The VSA will terminate, as to each SBV Stockholder, upon the earliest to occur of (a) the closing, (b) the termination of the Merger Agreement, (c) the date of any Qorvo Triggering Event or Skyworks Triggering Event (each, as defined in the Merger Agreement) and (d) the written consent of Skyworks, Qorvo and the applicable SBV Stockholder.\nRESULTS OF OPERATIONS\nFiscal Years Ended October 3, 2025, September 27, 2024, and September 29, 2023\nResearch and development\nSelling, general, and administrative\nAmortization of intangibles\nRestructuring, impairment, and other charges\nTotal operating expenses\nIncome before income taxes\nProvision for income taxes\nDuring the fiscal year ended October 3, 2025, the following key factors contributed to our overall results of operations, financial position, and cash flows:\nNet revenue decreased 2.2% to $4,086.9 million in fiscal 2025, as compared to $4,178.0 million in fiscal 2024, driven primarily by a decrease in market share at a significant customer, partially offset by an increase in demand for our mobile and Wi-Fi products.\nOur ending cash, cash equivalents, and marketable securities balance decreased 11.8% to $1,388.4 million in fiscal 2025, as compared to $1,574.1 million in fiscal 2024. The decrease in cash, cash equivalents, and marketable securities during fiscal 2025 was primarily due to share repurchases of $830.2 million, dividend payments of $432.6 million, and capital expenditures of $195.0 million, partially offset by cash generated from operations of $1,300.8 million.\nOn February 4, 2025, the Board of Directors appointed Philip Brace as the President and Chief Executive Officer of the Company and as a director, effective February 17, 2025.\nOn May 7, 2025, the Board of Directors appointed Todd Lepinski as Senior Vice President, Sales and Marketing, effective as of June 2, 2025.\nOn August 23, 2025, the Board of Directors appointed Philip Carter as Senior Vice President and Chief Financial Officer of the Company, effective as of September 8, 2025.\n(dollars in millions)\nWe market and sell our products indirectly through electronic components distributors and directly to OEMs of communications and electronics products, third-party original design manufacturers, and contract manufacturers. We generally experience seasonal peaks during our fourth and first fiscal quarters (which correspond to the second half of the calendar year), primarily as a result of increased worldwide production of consumer electronics in anticipation of holiday sales, whereas our second and third fiscal quarters are typically lower and in line with seasonal industry trends.\nThe decrease in net revenue in fiscal 2025, as compared to fiscal 2024, was driven primarily by a decrease in market share at a significant customer, partially offset by an increase in demand for our mobile and Wi-Fi products.\n(dollars in millions)\nGross profit represents net revenue less cost of goods sold. Our cost of goods sold consists primarily of purchased materials, labor, and overhead (including depreciation, share-based compensation expense, and amortization of acquisition intangibles) associated with product manufacturing. Erosion of average selling prices of established products is typical of the semiconductor industry. Consistent with trends in the industry, we anticipate that average selling prices for our established products will continue to decline over time. As part of our normal course of business, we intend to improve gross profit with efforts to increase unit volumes, improve manufacturing efficiencies, lower manufacturing costs of existing products, and by introducing new and higher value-added products.\nThe decrease in gross profit in fiscal 2025, as compared to fiscal 2024, was primarily the result of unfavorable product mix, lower average selling prices, and an increase in costs associated with facility consolidation and closure, partially offset by higher unit volumes.\nResearch and Development\n(dollars in millions)\nResearch and development\nResearch and development expenses consist primarily of direct personnel costs including share-based compensation expense, costs for pre-production evaluation units and testing of new devices, non-production masks, engineering prototypes, and design tool costs.\nThe increase in research and development expenses in fiscal 2025, as compared to fiscal 2024, was primarily related to increases in headcount-related expenses, including share-based compensation and costs for engineering prototypes as a result of our increased investment in developing new technologies and products.\nSelling, General, and Administrative\n(dollars in millions)\nSelling, general, and administrative\nSelling, general, and administrative expenses include legal and related costs, accounting, treasury, human resources, information systems, customer service, bad debt expense, sales commissions, share-based compensation expense, advertising, marketing, costs associated with business combinations completed or contemplated during the period, and other costs.\nThe increase in selling, general, and administrative expenses in fiscal 2025, as compared to fiscal 2024, was primarily related to increases in headcount-related expenses, including share-based compensation and increases in professional services costs.\nAmortization of Intangibles\n(dollars in millions)\nAmortization of intangibles\nAmortization of intangible assets was consistent in fiscal 2025, as compared to fiscal 2024.\nRestructuring, Impairment, and Other Charges\n(dollars in millions)\nRestructuring, impairment, and other charges\nRestructuring, impairment, and other charges in fiscal 2025 was primarily due to certain management severance costs incurred in connection with Chief Executive Officer transition.\nRestructuring, impairment, and other charges in fiscal 2024 was primarily due to the abandonment or delay of previously capitalized in-process research and development (“IPR&D”) projects of $147.9 million and employee severance costs.\n(dollars in millions)\nThe decrease in interest expense in fiscal 2025, as compared to fiscal 2024, was due to certain debt repayments in prior periods that reduced the amount of outstanding indebtedness.\n(dollars in millions)\nThe increase in other income, net in fiscal 2025, as compared to fiscal 2024, was primarily due to an increase in interest income generated from cash, cash equivalents, and marketable securities.\nProvision for Income Taxes\n(dollars in millions)\nProvision for income taxes\nWe recorded a provision for income taxes of $49.6 million (which consisted of a benefit of $35.5 million and a provision of $0.1 million related to United States federal and state income taxes, respectively, and a provision of $85.0 million related to foreign income taxes) and $40.4 million (which consisted of benefits of $41.5 million and $0.3 million related to United States federal and state income taxes, respectively, and a provision of $82.2 million related to foreign income taxes) in fiscal 2025 and fiscal 2024, respectively.\nThe increase in income tax expense in fiscal 2025, as compared to fiscal 2024, was primarily due to higher foreign taxes including the tax impact of remeasuring existing net deferred tax liabilities in Singapore and a lower Foreign-Derived Intangible Income (“FDII”) benefit, partially offset by a decrease in Global Intangible Low-Taxed Income (“GILTI”), net of foreign tax credits and an increase in research and development credits.\nIn December 2021, the Organization for Economic Co-operation and Development’s (“OECD”) Inclusive Framework on Base Erosion and Profit Shifting (“BEPS”) released Global Anti-Base Erosion (“GloBE”) rules under Pillar Two. Many countries have implemented laws based on Pillar Two, which became effective for us beginning in fiscal 2025. The tax impact associated with Pillar Two was immaterial to the financial statements for fiscal 2025. We continue to evaluate the impact of proposed and enacted legislative changes as new guidance becomes available.\nIn July 2025, the U.S. government enacted the One Big Beautiful Bill Act (“OBBBA”). The OBBBA did not have a material impact to the financials for fiscal 2025. We continue to evaluate the impact of the OBBBA on our business for future periods.\nLIQUIDITY AND CAPITAL RESOURCES\nCash and cash equivalents at beginning of period\nNet cash provided by operating activities\nNet cash used in investing activities\nNet cash used in financing activities\nCash and cash equivalents at end of period\nCash provided by operating activities:\nCash provided by operating activities consists of net income for the period adjusted for certain non-cash items and changes in certain operating assets and liabilities. The $523.9 million decrease in cash provided by operating activities for fiscal 2025, as compared to fiscal 2024, was primarily related to a decrease in working capital of $370.7 million, due primarily to inventory and accounts receivable, and lower net income.\nCash used in investing activities:\nCash used in investing activities consists primarily of cash paid to purchase marketable securities, capital expenditures, and cash paid to acquire intangible assets, partially offset by cash received related to the sale or maturity of marketable securities. The $121.9 million decrease in cash used in investing activities for fiscal 2025, as compared to fiscal 2024, was primarily related to an increase of $531.8 million in the sale or maturity of marketable securities, partially offset by an increase of $362.6 million in purchases of marketable securities and an increase of $38.0 million in capital expenditures.\nCash used in financing activities:\nCash used in financing activities consists primarily of cash transactions related to equity and proceeds and payments related to our long-term borrowings. The $455.1 million increase in cash used in financing activities for fiscal 2025, as compared to fiscal 2024, was primarily related to an increase of $752.9 million in share repurchases, partially offset by a decrease of $300.0 million for the repayment of debt.\nCash, cash equivalents, and marketable securities totaled $1,388.4 million as of October 3, 2025, representing a decrease of $185.7 million from September 27, 2024.\nWe have outstanding $500.0 million of Notes Due 2026 and $500.0 million of Notes Due 2031 (the “Notes”). During fiscal 2024 and 2023, we repaid $300.0 million and $900.0 million of outstanding borrowings, respectively. We have a Revolving Credit Agreement (the “Revolving Credit Agreement”) under which we may borrow up to $750.0 million for general corporate pur",
  "item2_clean": null
}