{
  "source_file": "syk-20241231.htm",
  "form_type": "10-K",
  "item1_clean": "In 2024 we continued the full commercial launch of our Triathlon Hinge revision knee system. Triathlon Hinge received approval in August of 2023 and is now released in the U.S., Ca\nnada and New Zealand. We also continued delivering growth in total hip arthroplasty, particularly in the primary segment where Direct Anterior Reconstructive Technology and Mako Total Hip can help to reduce, if not eliminate, a surgeon's use of intraoperative fluoroscopy during direct anterior hip procedures. With the acquisition of SERF SAS, we strengthened distribution in key European markets and continue to scale differentiated solutions such as the Novae monolithic dual mobility cup engineered to deliver greater hip stability and reduce dislocation risk.\nWe continued to expand our global footprint of Mako SmartRobotics™ in 2024 which is now sold in more than 45 countries. To date more than one million robotic Mako Total Knees and 1.5 million robotic procedures across Total Hips, Total Knees and Partial Knees have been performed globally. Stryker’s Joint Replacement division also launched the “Scan. Plan. Mako Can.” direct to patient campaign, accelerating awareness of Mako technology in the U.S.\nOur spine enabling technologies portfolio includes best in class imaging solutions, image-guided surgical technology, patient specific implants and digital health solutions supporting surgeons and their patients throughout the continuum of care.\nIn December 2024 we performed our first Mako Shoulder procedure using robotic-arm assistance to remove bone, prepare the glenoid surface and enable positioning and placement of the Perform Reversed Glenoid implant.\nIn 2024 Trauma launched Pangea, a comprehensive variable angle plating portfolio designed to optimize plate fit to bone utilizing simple, intuitive instrumentation that enhances ease of use and reproducibility. These combined solutions empower Stryker to deliver a complete portfolio across all trauma segments.\nRaw Materials and Inventory\nRaw materials essential to our business are generally readily available from multiple sources; however, certain of our raw materials are currently sourced from single suppliers. Substantially all products we manufacture are stocked in inventory, while certain MedSurg products are assembled to order.\nPatents and Trademarks\nPatents and trademarks are significant to our business to the extent that a product or an attribute of a product represents a unique design or process. Patent protection of such products restricts competitors from duplicating these unique designs and features. We seek to obtain patent protection on our products whenever appropriate for protecting our competitive advantage. On December 31, 2024 we owned approximately 5,600 United States patents and approximately 8,600 patents in other countries.\nOur business is generally not seasonal in nature; however, the number of orthopaedic implant surgeries is typically lower in the\nDollar amounts in millions except per share amounts or as otherwise specified.\nSTRYKER CORPORATION\nsummer months, and sales of capital equipment are generally higher in the fourth quarter.\nIn each of our product lines we compete with local and global companies. The development of innovative products is important to our success in all areas of our business. Competition in research involving the development and improvement of new and existing products and processes is particularly significant. The competitive environment requires substantial investments in continuing research and maintaining sales forces.\nWe believe our commitment to innovation, quality and service and our reputation differentiates us in the highly competitive product categories in which we operate and enables us to compete effectively. We believe that our competitive position in the future will depend to a large degree on our ability to develop new products and make improvements to existing products.\nOur businesses are subject to varying degrees of governmental regulation in the countries in which we operate, and the general trend is toward increasingly stringent regulation. We are required to comply with the unique regulatory requirements of each country in which we market and sell our products.\nIn the United States the Medical Device Amendments of 1976 to the Federal Food, Drug and Cosmetic Act and its subsequent amendments and the regulations issued and proposed thereunder provide for federal regulation by the United States Food and Drug Administration (FDA) of the design, manufacture and marketing of medical devices, including most of our products. In addition, state licensing requirements often apply to certain of our business operations and products. On the federal level, many of our new products fall into FDA classifications that require notification submitted as a 510(k) and review by the FDA before we begin marketing them. Certain of our products require extensive clinical testing, consisting of safety and efficacy studies, followed by pre-market approval applications for specific surgical indications. Certain of our products also fall under other FDA classifications, such as drugs and Human Cells, Tissues, and Cellular and Tissue-Based Products.\nThe FDA's Quality System regulations set forth standards for our product design and manufacturing processes, require the maintenance of certain records and provide for inspections of our facilities by the FDA. There are also certain requirements of state, local and foreign governments that must be complied with in the manufacture and marketing of our products.\nThe European Union enacted the European Union Medical Device Regulation in May 2017 with an original effective date of May 2022, which imposes stricter requirements for the marketing and sale of medical devices, including in the areas of clinical evaluation requirements, quality systems, labeling and post-market surveillance. Extended transition timelines were published in 2023 which range from May 2026 through December 2028 depending on the type of device and our implementation is on track to meet these timelines.\nInitiatives to limit the growth of general healthcare expenses and hospital costs are ongoing in the markets we do business. These initiatives are sponsored by government agencies, legislative bodies and the private sector and include price regulation and competitive pricing. It is not possible to predict at this time the long-term impact of such cost containment measures on our future business. In addition, business practices in the healthcare industry are scrutinized, particularly in the United States, by federal and state government agencies. Any resulting\ninvestigations and prosecutions potentially carry the risk of significant civil and criminal penalties.\nWe are subject to various rules and regulation in the United States and internationally related to the protection of human health and the environment. Our operations involve the use of substances regulated under environmental laws, primarily in manufacturing and sterilization processes. We believe our policies, practices and procedures are properly designed to comply, in all material respects, with applicable environmental laws and regulations. We do not expect compliance with these requirements to have a material effect on purchases of property, plant and equipment, cash flows, net earnings or competitive position.\nOn December 31, 2024 we had approximately 53,000 employees globally, with approximately 27,000 employees in the United States. Our talented employees are an integral reason for our standing as a global leader in medical technologies where, together with our customers, we are driven to make healthcare better. Our company values of integrity, accountability, people and performance are a key component of that mission. Our people, as one of our core values, continue to be a key focus.\nOur success depends on our ability to attract the best talent. To do so, we continue to focus on creating and maintaining a great workplace. We believe in attracting the right people, maintaining and building employee engagement and developing our employees. We believe when people are able to do what they do best, they will look forward to coming to work and, in turn, will deliver great business results.\nOur leadership team and Board of Directors receive regular updates on our people and culture strategy and provide feedback on our strategy and goals, including alignment to our mission and values, peer benchmarking and stakeholder feedback.\nEmployee Development\nOur employee development is extensive and exists at all levels of the organization, including company-wide training on our Code of Conduct, job-related technical training and management and leadership training. Our development programs include on-the-job learning, coaching and mentoring, management and leadership development courses, team building and collaboration training and immersive experiences with expert partners.\nWe encourage all employees to establish development objectives, in partnership with their manager, to help employees gain the needed development experience to grow their careers.\nAn engaged workplace culture that drives performance and business outcomes is central to our mission. Listening to and learning from our employees forms the foundation of an engaging culture. More than 90% of our employees participate in our annual engagement survey, which provides a valued platform for listening and allows us to take action based on the feedback collected.\nWe supplement our annual engagement survey with targeted pulse surveys to gather feedback on topics relevant to the current climate.\nWe also provide tools and resources that enable managers and teams to act on the insights we gain from our surveys and to drive employee engagement and strong business outcomes.\nDollar amounts in millions except per share amounts or as otherwise specified.\nSTRYKER CORPORATION\nDiversity, Equity and Inclusion (DE&I)\nAn essential part of our culture is respecting each individual’s strengths and values. Building on this foundation, we are focused on maintaining an inclusive, engaging work environment in keeping with our values of integrity and people. Our DE&I strategy is centered around these three commitments:\nStrengthen the diversity of our workforce\nAdvance a culture of inclusion, engagement and belonging\nMaximize the power of inclusion to drive innovation and growth\nWe are advancing our commitments through the following actions, among others:\nIncreasing access to talent through strategic partnerships and campaigns\nGrowing and engaging talent with a range of opportunities to learn and develop\nAligning our employee resource groups, which are open to all employees, to focus on creating community and belonging\nAttracting and Hiring\nWe understand that every employee drives our success. We focus on attracting, identifying and selecting strong candidates who will be successful at Stryker and ensuring that each person we hire brings the talent, expertise and passion we need to continue to be successful.\nEnsuring our employees' safety is a top priority. It is a responsibility that we share throughout the company and one that has evolved to meet the needs of our workforce. Employees' safety risks vary depending on the roles they perform, so we tailor our safety efforts accordingly.\nCompetitive Pay and Benefits\nOur compensation and benefits programs are designed to attract and retain top talent and to incentivize performance and alignment to our mission and values.\nWe offer market-competitive base pay and benefits to our employees in countries around the world. We regularly evaluate our compensation and benefit offerings and levels, using recognized outside consulting firms to ensure internal fairness and competitiveness in our offerings.\nMost of our employees also have variable components to their compensation packages that reward employees based on individual, business unit and/or company-wide performance.\nO",
  "item7_clean": "The increase in MedSurg and Neurotechnology operating income as a percentage of net sales in 2024 from 2023 was primarily driven by higher unit volumes, higher prices and a decrease in selling, general and administrative expenses as a percentage of sales partially offset by higher manufacturing and supply chain costs.\nThe increase in MedSurg and Neurotechnology operating income as a percentage of net sales in 2023 from 2022 was primarily driven by higher unit volumes, higher prices and lower manufacturing and supply chain costs due to supply chain challenges impacting capital products in our MedSurg businesses in 2022 which improved in 2023 partially offset by higher selling, general and administrative expenses as a percentage of sales due to continued investments including sales growth incentives and a more normalized cadence of travel and meetings.\nThe increase in Orthopaedics operating income as a percentage of net sales for 2024 from 2023 was primarily driven by higher sales volumes and a decrease in selling, general and administrative expenses as a percentage of sales partially offset by higher manufacturing and supply chain costs.\nThe decrease in Orthopaedics operating income as a percentage of net sales for 2023 from 2022 was primarily driven by higher higher manufacturing and supply chain costs primarily due to increased inventory reserves partially offset by higher unit volumes.\nDollar amounts in millions except per share amounts or as otherwise specified.\nSTRYKER CORPORATION\nOther Income (Expense), Net\nOther income (expense), net was ($197), ($215) and ($158) in 2024, 2023 and 2022. The decrease in net expense in 2024 from 2023 was primarily due to higher interest income partially offset by lower interest expense in 2024. The increase in net expense in 2023 from 2022 was primarily due to the release of accrued interest of $50 in 2022 related to the effective settlement of the United States federal income tax audit for years 2014 through 2018. Refer to Note 11 to our Consolidated Financial Statements for further information and higher interest income in 2023.\nOur effective tax rate was 14.3%, 13.8% and 12.1% for 2024, 2023 and 2022. The effective income tax rate for 2024 decreased from 2023 due to the 2024 deferred tax benefit on the outside basis difference related to the anticipated sale of the Spinal Implants business partially offset by the 2023 tax effect related to transfers of intellectual property between tax jurisdictions. The effective income tax rate for 2023 increased from 2022 due to the 2022 effective settlement of the United States federal income tax audit for years 2014 through 2018 and the 2022 reversal of deferred income tax on undistributed earnings of foreign subsidiaries partially offset by the 2023 tax effect related to transfers of intellectual property between tax jurisdictions. Additionally, the effective income tax rates for 2024, 2023 and 2022 reflect the continued lower effective income tax rates as a result of our European operations and certain discrete tax items.\nThe Organisation for Economic Cooperation and Development (OECD), which represents a coalition of member countries, has put forth two proposed base erosion and profit shifting frameworks that revise the existing profit allocation and nexus rules (Pillar One) and ensure a minimal level of taxation (Pillar Two). On December 12, 2022 the European Union member states agreed to implement the Inclusive Framework’s global corporate minimum tax rate of 15%, and various countries within and outside the European Union have either enacted or proposed new tax laws implementing Pillar Two in 2024. The OECD continues to release additional guidance and we anticipate more countries will enact similar tax laws. Some of the new tax laws became effective in 2024 while others will be effective in future years. These tax law changes and any additional contemplated tax law changes could increase tax expense in future periods.\nNet earnings for 2024 increased to $2,993 or $7.76 per diluted share from $3,165 or $8.25 per diluted share in 2023 and $2,358 or $6.17 per diluted share in 2022. Refer to the comments above for discussion of the primary drivers of the change.\nNon-GAAP Financial Measures\nWe supplement the reporting of our financial information determined under accounting principles generally accepted in the United States (GAAP) with certain non-GAAP financial measures, including percentage sales growth in constant currency; percentage organic sales growth; adjusted gross profit; adjusted selling, general and administrative expenses; adjusted research, development and engineering expenses; adjusted operating income; adjusted other income (expense), net; adjusted income taxes; adjusted effective income tax rate; adjusted net earnings; and adjusted net earnings per diluted share (Diluted EPS). We believe these non-GAAP financial measures provide meaningful information to assist investors and shareholders in understanding our financial results and assessing our prospects for future performance. Management believes percentage sales growth in constant currency and the other adjusted measures described above are important indicators of our operations because they\nexclude items that may not be indicative of or are unrelated to our core operating results and provide a baseline for analyzing trends in our underlying businesses. Management uses these non-GAAP financial measures for reviewing the operating results of reportable business segments and analyzing potential future business trends in connection with our budget process and bases certain management incentive compensation on these non-GAAP financial measures. To measure percentage sales growth in constant currency, we remove the impact of changes in foreign currency exchange rates that affect the comparability and trend of sales. Percentage sales growth in constant currency is calculated by translating current and prior year results at the same foreign currency exchange rate. To measure percentage organic sales growth, we remove the impact of changes in foreign currency exchange rates, acquisitions and divestitures, which affect the comparability and trend of sales. Percentage organic sales growth is calculated by translating current year and prior year results at the same foreign currency exchange rates excluding the impact of acquisitions and divestitures. To measure earnings performance on a consistent and comparable basis, we exclude certain items that affect the comparability of operating results and the trend of earnings. The income tax effect of each adjustment was determined based on the tax effect of the jurisdiction in which the related pre-tax adjustment was recorded. These adjustments are irregular in timing and may not be indicative of our past and future performance. The following are examples of the types of adjustments that may be included in a period:\nAcquisition and integration-related costs\n. Costs related to integrating recently acquired businesses (e.g., costs associated with the termination of sales relationships, employee retention and workforce reductions, manufacturing integration costs and other integration-related activities), changes in the fair value of contingent consideration, amortization of inventory stepped-up to fair value, specific costs (e.g., deal costs and costs associated with legal entity rationalization) related to the consummation of the acquisition process and legal entity rationalization and acquisition-related tax items.\nAmortization of purchased intangible assets\n. Periodic amortization expense related to purchased intangible assets.\nStructural optimization and other special charges.\nCosts associated with employee retention and workforce reductions, the closure or transfer of manufacturing and other facilities (e.g., site closure costs, contract termination costs and redundant employee costs during the work transfers), product line exits (primarily inventory, long-lived asset and specifically-identified intangible asset write-offs), certain long-lived and intangible asset write-offs and impairments and other charges.\nMedical device regulations.\nCosts specific to updating our quality system, product labeling, asset write-offs and product remanufacturing to comply with the new medical device reporting regulations and other requirements of the European Union.\nRecall-related matters\n. Changes in our best estimate of the probable loss, or the minimum of the range of probable losses when a best estimate within a range is not known, to resolve the Rejuvenate, LFIT V40, Wright legacy hip products and other product recalls.\nRegulatory and legal matters\n. Changes in our best estimate of the probable loss, or the minimum of the range of probable losses when a best estimate within a range is not known, to resolve certain regulatory or other legal matters\nDollar amounts in millions except per share amounts or as otherwise specified.\nSTRYKER CORPORATION\nand the amount of favorable awards from settlements.\n. Impact of accounting for certain significant and discrete tax items.\nBecause non-GAAP financial measures are not standardized, it may not be possible to compare these financial measures with other companies' non-GAAP financial measures having the same or similar names. These adjusted financial measures should not be considered in isolation or as a substitute for reported sales growth, gross profit, selling, general and administrative expenses, research, development and engineering expenses, operating income, other income (expense), net, income taxes, effective income tax rate, net earnings and net earnings per diluted share, the most directly comparable GAAP financial measures. These\nnon-GAAP financial measures are an additional way of viewing aspects of our operations when viewed with our GAAP results and the reconciliations to corresponding GAAP financial measures at the end of the discussion of Consolidated Results of Operations below. We strongly encourage investors and shareholders to review our financial statements and publicly-filed reports in their entirety and not to rely on any single financial measure.\nThe weighted-average diluted shares outstanding used in the calculation of adjusted net earnings per diluted share are the same as those used in the calculation of reported net earnings per diluted share for the respective period.\nReconciliation of the Most Directly Comparable GAAP Financial Measure to Non-GAAP Financial Measure\nSelling, General & Administrative Expenses\nResearch, Development & Engineering Expenses\nOther Income (Expense), Net\n\nActual results could differ from our estimates and assumptions, and any such differences could be material to our results of operations and financial condition.\nOur annual tax rate is determined based on our income, statutory tax rates and the tax impacts of items treated differently for tax purposes than for financial reporting purposes. Tax law requires certain items be included in the tax return at different times than the items are reflected in the financial statements. Some of these differences are permanent, such as expenses that are not deductible in our tax return, and some differences are temporary and reverse over time, such as depreciation expense. These temporary differences create deferred tax assets and liabilities.\nDeferred tax assets generally represent the tax effect of items that can be used as a tax deduction or credit in future years for which we have already recorded the tax benefit in our income statement. Deferred tax liabilities generally represent tax expense recognized in our financial statements for which payment was deferred, the tax effect of expenditures for which a deduction was taken in our tax return but has not yet been recognized in our financial statements or assets recorded at fair value in business combinations for which there was no corresponding tax basis adjustment.\nDollar amounts in millions except per share amounts or as otherwise specified.\nSTRYKER CORPORATION\nInherent in determining our annual tax rate are judgments regarding business plans, tax planning opportunities and expectations about future outcomes. Realization of certain deferred tax assets is dependent upon generating sufficient taxable income in the appropriate jurisdiction prior to the expiration of the carryforward periods. Although realization is not assured, management believes it is more likely than not that our deferred tax assets, net of valuation allowances, will be realized.\nWe operate in multiple jurisdictions with complex tax policy and regulatory environments. In certain of these jurisdictions, we may take tax positions that management believes are supportable but are potentially subject to successful challenge by the applicable taxing authority. These differences of interpretation with the respective governmental taxing authorities can be impacted by the local economic and fiscal environment. We evaluate our tax positions and establish liabilities in accordance with the applicable accounting guidance on uncertainty in income taxes. We review these tax uncertainties in light of changing facts and circumstances, such as the progress of tax audits, and adjust them accordingly. We have a number of audits in process in various jurisdictions. Although the resolution of these tax positions is uncertain, based on currently available information, we believe that it is more likely than not that the ultimate outcomes will not have a material adverse effect on our financial position, results of operations or cash flows.\nDue to the number of estimates and assumptions inherent in calculating the various components of our tax provision, certain changes or future events, such as changes in tax legislation, geographic mix of earnings, completion of tax audits or earnings repatriation plans, could have an impact on those estimates and our effective tax rate.\nAcquisitions, Goodwill and Intangibles, and Long-Lived Assets\nOur financial statements include the operations of an acquired business starting from the completion of the acquisition. In addition, the assets acquired and liabilities assumed are recorded on the date of acquisition at their respective estimated fair values, with any excess of the purchase price over the estimated fair values of the net assets acquired recorded as goodwill.\nSignificant judgment is required in estimating the fair value of intangible assets and in assigning their respective useful lives. Accordingly, we typically obtain the assistance of third-party valuation specialists for significant items. The fair value estimates are based on available historical information and on future expectations and assumptions deemed reasonable by management but are inherently uncertain. We typically use an income method to estimate the fair value of intangible assets, which is based on forecasts of the expected future cash flows attributable to the respective assets. Significant estimates and assumptions inherent in the valuations reflect a consideration of other marketplace participants and include the amount and timing of future cash flows (including expected growth rates and profitability), the underlying product or technology life cycles, the economic barriers to entry and the discount rate applied to the cash flows. Unanticipated market or macroeconomic events and circumstances may occur that could affect the accuracy or validity of the estimates and assumptions.\nDetermining the useful life of an intangible asset also requires judgment. With the exception of certain trade names, the majority of our acquired intangible assets (e.g., certain trademarks or brands, customer and distributor relationships, patents and technologies) are expected to have determinable useful lives. Our assessment as to the useful lives of these intangible assets\nis based on a number of factors including competitive environment, market share, trademark, brand history, underlying product life",
  "item2_clean": null
}