{
  "source_file": "syy-20250927.htm",
  "form_type": "10-Q",
  "item1_clean": null,
  "item7_clean": null,
  "item2_clean": "The following tables include summarized financial information of the obligor group for the periods presented.\nCombined Parent and Guarantor Subsidiaries Summarized Balance Sheet\nASSETS\nReceivables due from non-obligor subsidiaries\nTotal current assets\nNotes receivable from non-obligor subsidiaries\nOther noncurrent assets\nTotal noncurrent assets\nLIABILITIES\nPayables due to non-obligor subsidiaries\nOther current liabilities\nTotal current liabilities\nNotes payable to non-obligor subsidiaries\nOther noncurrent liabilities\nTotal noncurrent liabilities\nCombined Parent and Guarantor Subsidiaries Summarized Results of Operations\n13-Week Period Ended Sep. 27, 2025\nInterest expense from non-obligor subsidiaries\nCritical Accounting Estimates\nForward-Looking Statements\nCertain statements made herein that look forward in time or express management’s expectations or beliefs with respect to the occurrence of future events are forward-looking statements under the Private Securities Litigation Reform Act of 1995. Forward-looking statements provide current expectations of future events based on certain assumptions and include any statement that does not directly relate to any historical or current fact. Forward-looking statements can also be identified by words such as “future,” “anticipates,” “believes,” “estimates,” “expects,” “intends,” “plans,” “predicts,” “will,” “would,” “could,” “can,” “may,” “projected,” “continues,” “continuously,” variations of such terms, and similar terms and phrases denoting anticipated or expected occurrences or results. This report contains various statements relating to future financial performance and results, business strategy, plans, goals and objectives, including certain outlook, business trends, our dividend and share repurchase programs, our expectation of future macroeconomic conditions and other statements that are not historical facts.\nthe risk that if sales from our locally managed customers do not grow at the same rate as sales from multi-unit customers, our gross margins may decline;\nthe risk that economic uncertainties can negatively impact consumer confidence and negatively impact foot traffic to restaurants;\nperiods of significant or prolonged inflation or deflation and their impact on our product costs and profitability generally, and our inability to predict inflation over the long term;\nthe risk that our efforts to modify truck routing in order to reduce outbound transportation costs may be unsuccessful;\nthe risk that we that we may not realize anticipated benefits from our operating cost reduction efforts, including our ability to accelerate and/or identify additional administrative cost savings;\nrisks related to unfavorable conditions in the Americas and Europe and the impact on our results of operations and financial condition;\nthe risks related to our efforts to implement our transformation initiatives and meet our other long-term strategic objectives, including the risk that these efforts may not provide the expected benefits in our anticipated time frame, if at all, and may prove costlier than expected;\nthe risk that competition in our industry and the impact of GPOs may adversely impact our margins and our ability to retain customers and make it difficult for us to maintain our market share, growth rate and profitability;\nthe risk that our relationships with long-term customers may be materially diminished or terminated;\nthe risk that changes in consumer eating habits could materially and adversely affect our business, financial condition, or results of operations;\nthe impact and effects of public health crises, pandemics and epidemics, and the adverse impact thereof on our business, financial condition and results of operations;\nthe risk that we may not be able to fully compensate for increases in fuel costs, and forward purchase commitments intended to contain fuel costs could result in above market fuel costs;\nthe risk of interruption of supplies and increase in product costs as a result of conditions beyond our control;\nthe potential impact on our reputation and earnings of adverse publicity or lack of confidence in our products;\nrisks related to unfavorable changes to the mix of locally managed customers versus corporate-managed customers;\ndifficulties in successfully expanding into international markets and complimentary lines of business;\nthe potential impact of product liability claims;\nthe risk that we fail to comply with requirements imposed by applicable law or government regulations, including but not limited to those related to environmental and tax and accounting laws, rules and regulations;\nrisks related to our ability to effectively finance and integrate acquired businesses;\nrisks related to our access to borrowed funds in order to grow and any default by us under our indebtedness that could have a material adverse impact on cash flow and liquidity;\nour level of indebtedness and the terms of our indebtedness could adversely affect our business and liquidity position;\nthe risk that we may not be able to effectively execute our capital allocation framework;\nthe risk that divestiture of one or more of our businesses may not provide the anticipated effects on our operations;\nrisks related to our ability to return capital to stockholders, including those related to the timing and amounts (including any plans or commitments in respect thereof) of any dividends and share repurchases;\ndue to our reliance on technology, any technology disruption or delay in implementing new technology could have a material negative impact on our business;\nthe risk of negative impacts to our business and our relationships with customers from a cybersecurity incident and/or other technology disruptions;\nrisks related to our ability to attract, motivate and retain employees, including key personnel;\nrisks related to labor issues, including the renegotiation of union contracts and shortage of qualified labor; and\nthe risk that the exclusive forum provisions in our amended and restated bylaws could limit our stockholders’ ability to obtain a favorable judicial forum for disputes with us or our directors, officers or employees.\n\nManagement’s Discussion and Analysis of Financial Condition and Results of Operations\nOur first quarter of fiscal 2026 results included sales growth of 3.2% as compared to the first quarter of fiscal 2025, driven by increased sales in our U.S. Foodservice Operations, International Foodservice Operations, and SYGMA segments. Our gross profit increased 3.9% compared to the first quarter of fiscal 2025, due to product cost savings driven by strategic sourcing initiatives. Operating income decreased 1.0% compared to the first quarter of fiscal 2025, due to increased restructuring and transformational project costs and acquisition-related costs. We consider these “Certain Item” expenses (as defined below). Excluding Certain Item expenses, adjusted operating income increased 2.9% as compared to the first quarter of fiscal 2025. Our net earnings for the first quarter of fiscal 2026 decreased 2.9% as compared to the first quarter of fiscal 2025. Excluding Certain Item expenses, adjusted net earnings increased by 2.0% as compared to the first quarter of fiscal 2025. See below for a comparison of our fiscal 2026 results to our fiscal 2025 results, both including and excluding Certain Items.\nComparisons of results from the first quarter of fiscal 2026 to the first quarter of fiscal 2025 are presented below:\nincreased 3.2%, or $664 million, to $21.1 billion;\ndecreased 1.0%, or $8 million, to $800 million;\nadjusted operating income increased 2.9%, or $25 million, to $898 million;\ndecreased 2.9%, or $14 million, to $476 million;\nadjusted net earnings increased 2.0%, or $11 million, to $551 million;\nBasic earnings per share:\ndecreased 1.0%, or $0.01, to $0.99 per share;\nDiluted earnings per share:\nunchanged, at $0.99 per share;\nadjusted diluted earnings per share increased 5.5%, or $0.06, to $1.15 per share;\nEBITDA:\ndecreased 3.1%, or $32 million, to $1.0 billion; and\nadjusted EBITDA increased 0.1%, or $1 million, to $1.1 billion.\nThe discussion of our results includes certain non-GAAP financial measures, including EBITDA and adjusted EBITDA, that we believe provide important perspective with respect to underlying business trends. Other than EBITDA and free cash flow, any non-GAAP financial measures will be denoted as adjusted measures to remove: (1) restructuring charges; (2) expenses associated with our various transformation initiatives; (3) severance charges; and (4) acquisition-related costs consisting of (a) intangible amortization expense and (b) acquisition costs and due diligence costs related to our acquisitions.\nThe fiscal 2026 and fiscal 2025 items discussed above are collectively referred to as “Certain Items.” The results of our operations can be impacted by changes in exchange rates applicable to converting from local currencies to U.S. dollars. We measure our results on a constant currency basis.\nEconomic and Industry Trends\n\nFoot traffic to restaurant trends experienced a sequential improvement of 60 basis points for the first quarter of fiscal 2026 as compared to foot traffic to restaurant trends experienced in the fourth quarter of fiscal 2025. Our U.S. Foodservice Operations local case growth trends experienced a sequential improvement of 120 basis points during the same time period, outpacing the industry’s foot traffic improvement trends. The macroeconomic environment was similar in the first quarter of fiscal 2026 as compared to the two prior fiscal quarters, which has continued to adversely impact consumer sentiment. Despite the current macroeconomic landscape, we expect to grow both sales and net earnings per share in fiscal 2026. We believe the food-away-from-home sector is a healthy, long-term growth market, and Sysco is diversified and well positioned as a market leader in food service.\nSales and Gross Profit Trends\nSales increased 3.2% in the firs"
}