{
  "source_file": "syy-20250628.htm",
  "form_type": "10-K",
  "item1_clean": "Sysco Corporation, acting through its subsidiaries and divisions, is the largest global distributor of food and related products primarily to the foodservice or food-away-from-home industry. Our purpose is “Connecting the World to Share Food and Care for One Another.” We provided products and related services to approximately 730,000 customer locations, including restaurants, healthcare and educational facilities, lodging establishments and other foodservice customers during fiscal 2025.\nFounded in 1969, Sysco commenced operations as a public company in March 1970 when the stockholders of nine companies exchanged their stock for Sysco common stock. Since our formation, we have grown from $115 million to our all-time high of $81.4 billion in annual sales in fiscal 2025, both through internal expansion of existing operations and acquisitions.\nSysco’s fiscal year ends on the Saturday nearest to June 30th. This resulted in a 52-week year ended June 28, 2025 for fiscal 2025, a 52-week year ended June 29, 2024 for fiscal 2024 and a 52-week year ended July 1, 2023 for fiscal 2023. We will have a 52-week year ending June 27, 2026 for fiscal 2026.\nAvailable Information\nas soon as reasonably practicable after they are electronically filed with or furnished with the SEC. Sysco also periodically provides certain information for investors on its website at\nSysco distributes food and related products to restaurants, healthcare and educational facilities, lodging establishments and other foodservice customers. Our primary operations are in North America and Europe. Under the accounting provisions related to disclosures about segments of an enterprise, we have combined certain operations into three reportable segments. “Other” financial information is attributable to our other operations that do not meet the quantitative disclosure thresholds.\nU.S. Foodservice Operations\n– primarily includes (a) our U.S. Broadline operations, which distribute a full line of food products, including custom-cut meat, seafood, produce, specialty Italian, specialty imports and a wide variety of non-food products and (b) our U.S. Specialty operations, which include our FreshPoint fresh produce distribution business, our Buckhead | Newport Meat & Seafood specialty protein operations, our growing Italian Specialty platform anchored by Greco & Sons, Inc., our Edward Don restaurant equipment and supplies distribution business, our Asian specialty distribution company and a number of other small specialty businesses that are not material to the operations of Sysco;\nInternational Foodservice Operations\n– includes operations outside of the United States (U.S.), which distribute a full line of food products and a wide variety of non-food products. The Americas primarily consists of operations in Canada, Bahamas, Costa Rica and Panama, as well as our export operations that distribute to international customers. Our European operations primarily consist of operations in the United Kingdom (U.K.), France, Ireland and Sweden;\nSYGMA\n– our U.S. customized distribution operations serving quick-service chain restaurant customer locations; and\n– primarily our hotel supply operations, Guest Worldwide.\nFoodservice operating sites distribute a full line of food products and a wide variety of non-food products to both independent and chain restaurant customers, hospitals, schools, hotels, industrial caterers and other venues where foodservice products are served. SYGMA operating sites distribute a full line of food products and a wide variety of non-food products to certain chain restaurant customer locations. Selected financial data for each of our reportable segments, as well as financial information concerning geographic areas, can be found in Note 21, “Business Segment Information,” in the Notes to Consolidated Financial Statements in Item 8.\nCustomers and Products\nSysco’s customers in the foodservice industry include restaurants, hospitals and skilled nursing facilities, schools and colleges, hotels and motels, industrial caterers and other similar venues where foodservice products are served.\nThe products we distribute include:\nfrozen foods, such as meats, seafood, fully prepared entrées, fruits, vegetables and desserts;\ncanned and dry foods;\nfresh meats and seafood;\nimported specialties; and\nWe also supply a wide variety of non-food items, including:\npaper products such as disposable napkins, plates and cups;\ntableware such as glassware and silverware;\ncookware such as pots, pans and utensils;\nrestaurant and kitchen equipment and supplies; and\nA comparison of the sales mix in the principal product categories during the last three years is presented below:\nPrincipal product categories\nFresh and frozen meats\nCanned and dry products\nFrozen fruits, vegetables, bakery and other\nPaper and disposables\nEquipment and smallwares\nOther sales relate to certain non-food products, including textiles and amenities for our hotel supply business, other janitorial products, and medical supplies.\nOur distribution centers, which we refer to as operating sites, distribute branded merchandise, as well as products packaged under our private brands. Products packaged under our private brands have been manufactured for Sysco according to specifications that have been developed by our quality assurance team. In addition, our quality assurance team certifies the manufacturing and processing plants where these products are packaged, enforces our quality control standards and identifies supply sources that satisfy our requirements.\nWe believe that prompt and accurate delivery of orders, competitive pricing, customer service and the ability to provide a full array of products and services to assist customers in their foodservice operations are of primary importance in the\nmarketing and distribution of foodservice products to our customers. Our operating sites offer daily delivery to certain customer locations and have the capability of delivering special orders on short notice. Through the sales and marketing representatives and support staff, we stay informed of the needs of our customers and acquaint them with new products and services. We also provide ancillary services relating to foodservice distribution, such as providing customers with product usage reports and other data, menu-planning advice, food safety training and assistance in inventory control. Additionally, we provide access to various third-party services designed to add value to our customers’ businesses.\nNo single customer accounted for 10% or more of Sysco’s total sales for the fiscal year ended June 28, 2025.\nWe estimate that our sales by type of customer during the past three fiscal years were as follows:\nEducation, government\nOther includes cafeterias that are not stand-alone restaurants, bakeries, caterers, churches, civic and fraternal organizations, vending distributors, other distributors and international exports, as well as retail food sales and logistics services. None of these types of customers, as a group, exceeded 5% of total sales in any of the years for which information is presented.\nWe estimate that sales to our customers in the food service management (FSM) sector, which include large customers that service cafeterias in institutions such as universities, hospitals, and sporting venues, accounted for 8% of sales in both fiscal 2025 and fiscal 2024. These sales are reflected within the respective customer types listed in the table above, depending on the type of customer the FSM operator serves.\nWe purchase from thousands of suppliers, both domestic and international, none of which individually accounted for more than 10% of our purchases for fiscal 2025. These suppliers consist generally of large corporations selling brand name and private label merchandise, as well as independent regional brand and private label processors and packers. We also provide specialty and seasonal products from small to mid-sized producers to meet a growing demand for locally sourced products. Our locally sourced products, including produce, meats, cheese and other products, help differentiate our customers’ offerings, satisfy demand for new products, and support local communities. Merchandise is generally purchased through both centrally developed programs, domestically and internationally, and direct programs established by our various operating sites. For our U.S. Foodservice Operations, which represents approximately 70% of our total sales, over 90% of products are purchased domestically.\nWe administer a consolidated product procurement program designed to develop, obtain and ensure consistent quality food and non-food products. The program covers the purchasing and marketing of branded merchandise, as well as products from several national brand suppliers, encompassing substantially all product lines. Some of our products are purchased internationally within global procurement centers to build strategic relationships with international suppliers and to optimize our supply chain network. We also focus on increasing profitability by lowering operating costs and aggregate inventory levels. This reduces future facility expansion needs at our operating sites, while providing greater value to our suppliers and customers.\nWorking Capital Practices\nOur growth is funded through a combination of cash on hand, cash flow from operations, commercial paper issuances and long-term borrowings. See the discussion in Item 7, “Management’s Discussion and Analysis of Financial Condition and Results of Operations – Liquidity and Capital Resources” regarding our liquidity, financial position and sources and uses of funds.\nWe extend credit terms to some of our customers based on our assessment of each customer’s creditworthiness. We monitor each customer’s account and will suspend shipments if necessary.\nA majority of our sales orders are filled within 24 hours of customer order placement. We generally maintain inventory on hand to meet customer demand. The level of inventory on hand will vary by product depending on shelf-life, supplier order\nfulfillment lead times and customer demand. We also purchase additional volumes of certain products based on supply or pricing opportunities. We take advantage of suppliers’ cash discounts where appropriate. Otherwise, we pay our suppliers according to our payment terms.\nGlobal Support Center\nOur Global Support Center (GSC) provides numerous centralized services to our operating sites and performs support activities for employees, suppliers and customers. GSC team members possess experience and expertise in, among other areas, customer and vendor contract administration, finance, legal, information technology, risk management and insurance, sales and marketing, merchandising, inbound logistics, human resources, and strategy.\nCapital Improvements\nDuring fiscal 2025, 2024 and 2023, $906 million, $832 million and $793 million, respectively, were invested in facilities, technology, equipment, delivery fleet and other capital asset enhancements. From time to time, we dispose of assets in the normal course of business, and we consider proceeds from these asset sales to be an offset to capital expenditures. During fiscal 2025, 2024 and 2023, capital expenditures, net of proceeds from sales of assets, were $692 million, $753 million and $751 million, respectively. Capital expenditures, net of proceeds from sales of assets, as a percentage of sales during fiscal 2025, 2024 and 2023 were 0.9%, 1.0% and 1.0%, respectively. During the three years ended June 28, 2025, capital expenditures were financed primarily by internally generated funds along with bank and other borrowings. We expect our capital expenditures, net of proceeds from sales of assets, to approximate $700 million in fiscal 2026, and we expect to finance these capital expenditures from cash flows from operations and bank and other borrowings.\nHuman Capital Resources\nWe believe engaged and empowered colleagues ar",
  "item7_clean": "(Dollars in millions)\nAdjusted operating expenses (Non-GAAP)\nAdjusted operating income (Non-GAAP)\nComparable sales using a constant currency basis (Non-GAAP)\nComparable gross profit using a constant currency basis (Non-GAAP)\nComparable operating expenses adjusted for Certain Items using a constant currency basis (Non-GAAP)\nComparable operating income adjusted for Certain Items using a constant currency basis (Non-GAAP)\nSee “Non-GAAP Reconciliations” below.\nThe following table sets forth the percentage and dollar value increase or decrease in sales over the comparable prior year period in order to demonstrate the cause and magnitude of change.\n(Dollars in millions)\nImpact of divestiture\nTotal change in sales\nSales increased 2.4% in fiscal 2025 as compared to fiscal 2024, primarily due to higher inflation and local case growth. Excluding the impact of the Mexico joint venture, which was divested during the second quarter of fiscal 2025, sales increased 4.8% in fiscal 2025 as compared to fiscal 2024.\nThe $62 million increase in operating income for fiscal 2025, as compared to fiscal 2024, was primarily due to growth in local case volumes, success in our strategic sourcing program, and positive contributions from our recent mergers and acquisitions efforts.\nThe increase in gross profit dollars in fiscal 2025, as compared to fiscal 2024, was primarily attributable to increases in local case volumes. Local case volumes increased approximately 4.0% in fiscal 2025, as compared to fiscal 2024.\nThe increase in operating expenses for fiscal 2025, as compared to fiscal 2024, was primarily due to increases in colleague-related costs and depreciation expense.\nResults of SYGMA and Other Segment\nOur SYGMA segment sales were 8.3% higher in fiscal 2025, as compared to fiscal 2024, primarily driven by the growth of new customers. Operating income increased by $9 million in fiscal 2025, as compared to fiscal 2024, primarily due to the growth of new customers and productivity improvements. We expect SYGMA’s sales growth rates to moderate in fiscal 2026 as we reach the one-year anniversary mark of fiscal 2025’s substantial customer additions.\nFor the operations that are grouped within our Other segment, sales were 7.3% lower in fiscal 2025, as compared to fiscal 2024. Operating income decreased $113 million in fiscal 2025, as compared to fiscal 2024. The operations of this group mainly consist of our hospitality business, Guest Worldwide. In fiscal 2025, a noncash goodwill impairment charge of $92 million was recorded within operating expenses for a portion of the goodwill attributable to our Guest Worldwide reporting unit. This impairment charge is considered a Certain Item (defined above). We do not expect a similar impairment charge in fiscal 2026 and as a result, are expecting improved operating results within our Other segment in fiscal 2026.\nGlobal Support Center Expenses\nOur Global Support Center generally includes all expenses of the corporate office and Sysco’s shared service operations. These expenses decreased $56 million in fiscal 2025, or 5.7% as compared to fiscal 2024, primarily due to decreases in colleague-related costs, including lower incentive compensation.\nIncluded in Global Support Center expenses are Certain Items that totaled $79 million in fiscal 2025, as compared to $81 million in fiscal 2024. Certain Items impacting fiscal 2025 were primarily expenses associated with severances, our business technology transformation initiatives, and expenses associated with acquisitions. In fiscal 2024, Certain Items that impacted the year were primarily expenses associated with severances, our business technology transformation initiatives, and expenses associated with acquisitions.\nInterest expense increased $28 million for fiscal 2025, as compared to fiscal 2024, primarily due to interest on new senior notes issued. We expect to incur $700 million in interest expense in fiscal 2026.\nNet earnings decreased 6.5% in fiscal 2025, as compared to fiscal 2024, due primarily to the items noted previously for operating income and interest expense, as well as items impacting our income taxes that are discussed in Note 19, “Income Taxes,” in the Notes to Consolidated Financial Statements in Item 8. Adjusted net earnings, excluding Certain Items, increased 0.8% in fiscal 2025, primarily due to an increase in sales volume as a result of recent acquisitions and disciplined strategic sourcing efforts.\nBasic earnings per share in fiscal 2025 were $3.74, a 4.1% decrease from the fiscal 2024 amount of $3.90 per share. Diluted earnings per share in fiscal 2025 were $3.73, a 4.1% decrease from the fiscal 2024 amount of $3.89 per share. Adjusted diluted earnings per share, excluding Certain Items (which is a non-GAAP financial measure for which a reconciliation is\nprovided in “Non-GAAP Reconciliations” on the subsequent page), in fiscal 2025 were $4.46, a 3.5% increase from the fiscal 2024 amount of $4.31 per share. These results were primarily attributable to the factors discussed previously related to net earnings in fiscal 2025.\nNon-GAAP Reconciliations\nThe discussion of our results includes certain non-GAAP financial measures, including EBITDA and adjusted EBITDA, that we believe provide important perspective with respect to underlying business trends. Other than EBITDA and free cash flow, any non-GAAP financial measures will be denoted as adjusted measures to remove (1) restructuring charges; (2) expenses associated with our various transformation initiatives; (3) severance charges; and (4) acquisition-related costs consisting of: (a) intangible amortization expense and (b) acquisition costs and due diligence costs related to our acquisitions. Adjustments provided herein for fiscal 2025 results of operations also remove the impact of a goodwill impairment charge. No similar charge was applicable in fiscal 2024.\nThe results of our operations can be impacted due to changes in exchange rates applicable in converting local currencies to U.S. dollars. We measure our results on a constant currency basis. Constant currency operating results are calculated by translating current-period local currency operating results with the currency exchange rates used to translate the financial statements in the comparable prior-year period to determine what the current-period U.S. dollar operating results would have been if the currency exchange rate had not changed from the comparable prior-year period. We also measure our sales growth excluding the impact of our joint venture in Mexico which was divested in the second quarter of fiscal 2025.\nManagement believes that adjusting its operating expenses, operating income, operating margin, net earnings and diluted earnings per share to remove these Certain Items, presenting its results on a constant currency basis, and adjusting its sales results to exclude the impact of its joint venture in Mexico provides an important perspective with respect to our underlying business trends and results. It provides meaningful supplemental information to both management and investors that (1) is indicative of the performance of the company’s underlying operations and (2) facilitates comparisons on a year-over-year basis.\nSysco has a history of growth through acquisitions and excludes from its non-GAAP financial measures the impact of acquisition-related intangible amortization, acquisition costs and due diligence costs for those acquisitions. We believe this approach significantly enhances the comparability of Sysco’s results for fiscal year 2025 and fiscal year 2024.\nSet forth on the following page is a reconciliation of sales, operating expenses, operating income, net earnings and diluted earnings per share to adjusted results for these measures for the periods presented. Individual components of diluted earnings per share may not be equal to the total presented when added due to rounding. Adjusted diluted earnings per share is calculated using adjusted net earnings divided by diluted shares outstanding.\n\nNet cash provided by operating activities (GAAP)\nAdditions to plant and equipment\nProceeds from sales of plant and equipment\nFree Cash Flow (Non-GAAP)\nFinancing Activities\nProceeds from exercises of share-based compensation awards were $110 million and $120 million in fiscal 2025 and fiscal 2024, respectively. The level of option exercises, and thus proceeds, will vary from period to period and is largely dependent on movements in our stock price and the time remaining before option grants expire.\nWe have traditionally engaged in share repurchase programs to allow Sysco to continue offsetting dilution resulting from shares issued under the company’s benefit plans and to make opportunistic repurchases. In May 2021, our Board of Directors approved a share repurchase program to authorize the repurchase of up to $5.0 billion of the company’s common stock which will remain available until fully utilized. We repurchased 16,988,703 shares for $1.3 billion during fiscal 2025. As of June 28, 2025, we had a remaining authorization of approximately $1.5 billion. We expect to complete approximately $1.0 billion in share repurchases in fiscal 2026; however, this amount is subject to change based on economic conditions and the level of any acquisition activity in fiscal 2026. As of August 5, 2025, we have repurchased no additional shares under this authorization.\nWe have made dividend payments to our shareholders in each fiscal year since our company’s inception. Dividends paid in fiscal 2025 were $1.0 billion, or $2.04 per share, as compared to $1.0 billion, or $2.00 per share, in fiscal 2024. In April 2025, we declared our regular quarterly dividend for the fourth quarter of fiscal 2025 of $0.54 per share, representing an increase of $0.03 per share. This dividend was paid in July 2025.\nIn August 2024, we filed a universal shelf registration statement with the SEC under which we, as a well-known seasoned issuer, have the ability to issue and sell an indeterminate amount of various types of debt and equity securities. The specific terms of any securities we issue under this registration statement will be provided in the applicable prospectus supplements.\nIn November 2000, we filed with the SEC a shelf registration statement covering 30,000,000 shares of common stock to be offered from time to time in connection with acquisitions. As of August 5, 2025, there were 29,477,835 shares remaining for issuance under this registration statement.\nDebt Activity and Borrowing Availability\nOur debt activity, including issuances and repayments, and our borrowing availability is described in Note 12, “Debt and Other Financing Arrangements,” in the Notes to Consolidated Financial Statements in Item 8. Our outstanding borrowings at June 28, 2025, and repayment activity since the end of fiscal 2025 are disclosed within those notes. Updated amounts at August 5, 2025, include:\nNo outstanding borrowings from the long-term revolving credit facility supporting our commercial paper programs;\n$746 million outstanding borrowings under our U.S. commercial paper program; and\n$341 million outstanding borrowings under our commercial paper program in Europe.\nOur aggregate commercial paper issuances and short-term bank borrowings had weighted average interest rates of 4.57% for fiscal 2025 and 5.49% for fiscal 2024.\nSenior notes classified within current maturities of long-term debt totaling $750 million will mature on October 1, 2025. Senior notes classified within long-term debt totaling $999 million will mature on July 15, 2026. We expect to fund the repayment of this debt using a combination of cash flows from operations and the proceeds from issuances of commercial paper and long-term debt.\nThe availability of financing in the form of debt is influenced by many factors, including our profitability, free cash flows, debt levels, credit ratings, debt covenants and economic and market conditions. As of August 5, 2025, Moody’s Investors Service has assigned us an unsecured debt credit rating of Baa1 and a ratings outlook of “stable.” Standard & Poor’s has assigned us an unsecured debt credit rating of BBB and a ratings outlook of “stable.” Fitch Ratings Inc. has assigned us an unsecured debt credit rating of BBB and a ratings outlook of “stable.” A significant downgrade in our credit ratings or adverse conditions in the capital markets may increase the cost of borrowing for us or limit our access to capital. To date, we have not experienced difficulty accessing the credit markets. As of August 5, 2025, the company had approximately $2.7 billion in cash and available liquidity.\nOur long-term revolving credit facility includes aggregate commitments of the lenders thereunder of $3.0 billion with an option to increase such commitments to $4.0 billion. The facility includes a covenant, among others, requiring Sysco to maintain a ratio of consolidated EBITDA to consolidated interest expense of 3.0 to 1.0 over four consecutive fiscal quarters. The revolving credit facility expires on April 29, 2027. As of June 28, 2025, Sysco was in compliance with all of its debt covenants and the company expects to remain in compliance through the next twelve months.\nSysco’s U.S. commercial paper dealer agreement includes an issuance allowance for an aggregate amount not to exceed $3.0 billion. Our commercial paper dealer agreement in Europe includes an issuance allowance for an aggregate amount not to exceed €500 million. Any outstanding commercial paper balances are classified within long-term debt, as the programs are supported by the long-term revolving credit facility.\nGuarantor Summarized Financial Information\nAll subsidiary guarantors are 100% owned by the parent company, all guarantees are full and unconditional, and all guarantees are joint and several. The guarantees rank equally and ratably in right of payment with all other existing and future unsecured and unsubordinated indebtedness of the respective guarantors.\nThe assets of Sysco Corporation consist principally of the stock of its subsidiaries. Therefore, the rights of Sysco Corporation and the rights of its creditors to participate in the assets of any subsidiary upon liquidation, recapitalization or otherwise will be subject to the prior claims of that subsidiary’s creditors, except to the extent that claims of Sysco Corporation itself and/or the claims of those creditors themselves may be recognized as creditor claims of the subsidiary. Furthermore, the ability of Sysco Corporation to service its indebtedness and other obligations is dependent upon the earnings and cash flow of its subsidiaries and the distribution or other payment to it of such earnings or cash flow. If any of Sysco Corporation’s subsidiaries becomes insolvent, the direct creditors of that subsidiary will have a prior claim on its assets. Sysco Corporation’s rights and the rights of its creditors, including the rights of a holder of senior notes as an owner of debt securities, will be subject to that prior claim unless Sysco Corporation or such noteholder, if such noteholder’s debt securities are guaranteed by such subsidiary, also is a direct creditor of that subsidiary.\nThe guarantee of any subsidiary guarantor with respect to a series of senior notes or debentures may be released under certain customary circumstances. If we exercise our defeasance option with respect to the senior notes or debentures of any series, then any subsidiary guarantor effectively will be released with respect to that series. Further, each subsidiary guarantee\nwill remain in full force and effect until the earliest to occur of the date, if any, on which (1) the applicable subsidiary guarantor shall consolidate with or merge into Sysco Corporation or any successor of Sysco Corporation or (2) Sysco Corporation or any successor of Sysco Corporation consolidates with or merges into the applicable subsidiary guarantor.\nBasis of Preparation of the Summar",
  "item2_clean": null
}