{
  "source_file": "t-20250930.htm",
  "form_type": "10-Q",
  "item1_clean": null,
  "item7_clean": null,
  "item2_clean": "increased in the third quarter and for the first nine months of 2025,\nreflecting higher Mobility and Consumer Wireline revenues, partially offset by declines in Business Wireline. Operating revenues in Mexico were higher in the third quarter but lower for the first nine months, reflecting unfavorable foreign exchange impacts during the first half of 2025\nOperations and support expenses\ndecreased in the third quarter and for the first nine months of 2025, primarily due to a $4,422 noncash goodwill impairment recorded in 2024. Also contributing to lower operating expenses were expense declines from our continued transformation efforts, lower content licensing fees and lower year-to-date restructuring costs. Partially offsetting these declines were higher Mobility equipment costs resulting from increased wireless equipment sales volumes, higher network-related costs and approximately $440 of apportioned legal settlements during the third quarter of 2025.\nDepreciation and amortization\nexpense increased in the third quarter and for the first nine months of 2025, primarily due to ongoing capital spending for strategic initiatives such as fiber and network upgrades, partially offset by lower depreciation impacts from our Open RAN network modernization efforts. We expect fourth-quarter 2025 depreciation expense to be lower than the comparable prior-year quarter, and full-year expense to be consistent with the prior year as certain legacy assets become fully depreciated.\nincreased in the third quarter and for the first nine months of 2025. Our operating income margin in the third quarter increased from 7.0% in 2024 to 19.9% in 2025 and for the first nine months increased from 15.2% in 2024 to 19.9% in 2025.\nincreased in the third quarter and decreased for the first nine months of 2025. The increase in the third quarter was primarily due to lower capitalized interest associated with spectrum acquisitions. The decrease for the first nine months was\nAT&T INC.\nSEPTEMBER 30, 2025\n\nItem 2. Management’s Discussion and Analysis of Financial Condition and Results of Operations- Continued\nDollars in millions except per share amounts\nprimarily due to lower average debt balances, partially offset by lower capitalized interest associated with spectrum acquisitions.\nEquity in net income (loss) of affiliates\ndecreased in the third quarter and increased for the first nine months of 2025. The decrease for the quarter is primarily due to the sale of our interest in DIRECTV to TPG Capital on July 2, 2025. The increase for the first nine months is attributable to the cash distributions received by AT&T in excess of the carrying amount of our investment in DIRECTV prior to disposition (see Note 9).\nOther income (expense) – net\nincreased in the third quarter and for the first nine months of 2025. The increase in the quarter was primarily due to a gain of approximately $5,500 recognized on the sale of our interest in DIRECTV (see Note 9). For the first nine months, the increase was also driven by a second-quarter 2025 gain on a prior disposition and first-quarter 2024 noncash impairment charges for a held-for-sale business and our SKY Mexico equity investment. Partially offsetting the increases in the quarter and for the first nine months were lower pension and postretirement benefit credits and lower returns on other benefit-related investments.\ndecreased in the third quarter and for the first nine months of 2025, primarily due to a lower effective tax rate driven by a tax-free gain on sale of DIRECTV in 2025 and a goodwill impairment in 2024, which is not deductible for tax purposes.\nOur effective tax rate was 9.2% in the third quarter and 15.4% for the first nine months of 2025, versus 89.9% and 31.1% in the comparable periods in the prior year, reflecting the nonrecognition of income taxes on the DIRECTV gain and larger discrete state tax benefits in 2025, and the goodwill impairment in 2024, which was not deductible for tax purposes.\nOur segments are comprised of strategic business units or other operations that offer products and services to different customer segments over various technology platforms and/or in different geographies that are managed accordingly. We evaluate segment performance based on operating income as well as EBITDA and/or EBITDA margin. See “Discussion and Reconciliation of Non-GAAP Measures” for a reconciliation of EBITDA and EBITDA margin to the most comparable financial measures calculated and presented in accordance with U.S. generally accepted accounting principles (GAAP).\nCOMMUNICATIONS SEGMENT\n\nBP\nIn addition to postpaid phones, includes tablets and wearables and other. Tablet net adds (losses) were (45) and (21) for the quarters ended September 30, 2025 and 2024 and 14 and 31 for the nine months ended September 30, 2025 and 2024. Wearables and other net adds (losses) were (32) and 47 for the quarters ended September 30, 2025 and 2024 and (47) and 209 for the nine months ended September 30, 2025 and 2024.\nExcludes migrations between wireless subscriber categories, including connected devices, and acquisition-related activity during the period.\nWireless subscribers and net additions exclude customers with free lines provided under promotional pricing until such lines are converted to paying lines.\nCalculated by dividing the aggregate number of wireless subscribers who canceled service during a month by the total number of wireless subscribers at the beginning of that month. The churn rate for the period is equal to the average of the churn rate for each month of that period.\nrevenue increased in the third quarter and for the first nine months of 2025, largely due to subscriber gains partially offset by promotional activity. Revenue comparisons in the third quarter were also impacted by approximately $90 of one-time noncash revenues related to administrative fees in 2024.\nARPU\nAverage revenue per subscriber (ARPU) decreased in the third quarter and increased for the first nine months of 2025. The decrease in the quarter includes the impact of one-time revenues related to administrative fees in 2024, as well as promotional activity and our success in attracting customers in underpenetrated segments with lower ARPUs, but attractive lifetime values, such as age 55-plus in our “value customers.” The increase for the first nine months was pressured by growth in our base of converged customers, who are typically eligible for service discounts.\n\nOperations and support\nexpenses decreased in the third quarter and for the first nine months of 2025, primarily driven by lower personnel and customer support costs associated with ongoing transformation initiatives, which were partially offset by favorable vendor settlements in the prior-year third quarter. As part of our transformation activities, we expect operations and support expense improvements through the remainder of 2025 as we further right size our operations in alignment with the strategic direction of the business.\nexpense increased in the third quarter and for the first nine months of 2025, primarily due to ongoing capital investment for strategic initiatives such as fiber, which we expect to continue through the remainder of 2025.\ndecreased in the third quarter and for the first nine months of 2025. Our Business Wireline operating income margin in the third quarter decreased from (0.9)% in 2024 to (8.3)% in 2025 and for the first nine months decreased from 0.9% in 2024 to (5.0)% in 2025. Our Business Wireline EBITDA margin in the third quarter decreased from 29.4% in 2024 to 27.8% in 2025 and for the first nine months remained consistent at 29.9% in 2024 and 2025.\nAT&T INC.\nSEPTEMBER 30, 2025\n\nExcludes the impact of subscriber disconnections resulting from the termination of AIA services in areas with unfavorable regulatory requirements in the first quarter of 2025.\nrevenues increased in the third quarter and for the first nine months of 2025, driven by increases in fiber revenues of 16.8% and 18.2%. Higher fiber revenues reflect an increase in fiber customers, which we expect to continue as we invest further in building our fiber footprint, and higher ARPU. This increase also includes growth in AIA revenues and was partially offset by declines in copper-based broadband services.\nLegacy voice and data services\nrevenues decreased in the third quarter and for the first nine months of 2025, reflecting the continued decline in demand for these services in favor of other technologies, such as wireless and fiber services.\nOther service and equipment\nrevenues decreased in the third quarter and for the first nine months of 2025, reflecting the continued decline in the number of VoIP customers.\nOperations and support\nexpenses decreased in the third quarter and for the first nine months of 2025, primarily driven by lower customer support costs and content licensing fees, largely offset by higher network-related costs and higher marketing costs.\nAT&T INC.\nSEPTEMBER 30, 2025\n\nItem 2. Management’s Discussion and Analysis of Financial Condition and Results of Operations- Continued\nDollars in millions except per share amounts\nOperations and support\nexpenses increased in the third quarter and decreased for the first nine months of 2025. The increase in the quarter was primarily due to higher equipment costs, bad debt expense from higher sales and unfavorable exchange rates. The decrease for the first nine months was primarily due to favorable foreign exchange impacts, partially offset by increased equipment and selling costs.\nDepreciation and amortization\nexpense increased in the third quarter and decreased for the first nine months of 2025. The increase in the quarter was primarily due to accelerated depreciation on certain network assets. The decrease for the first nine months was primarily due to foreign exchange impacts.\nincreased in the third quarter and for the first nine months of 2025. Our Mexico operating income margin in the third quarter increased from 1.0% in 2"
}