{
  "source_file": "t-20241231.htm",
  "form_type": "10-K",
  "item1_clean": "reconciles our segment results to consolidated operating income and income before income taxes.\nWe are a leader in providing connectivity services through our market focus areas of 5G and fiber. Fiber underpins the connectivity we deliver, both wired and wireless. Building on that fiber foundation is our solid spectrum portfolio, strengthened through Federal Communications Commission (FCC) auction acquisitions and 5G deployment. We believe our fixed wireline and mobile approach will differentiate our services and provide us with additional convergence growth opportunities in the future as bandwidth demands continue to grow. We will continue to demonstrate our commitment to ensure management attention is sharply focused on growth areas and operational efficiencies.\nOur integrated telecommunications network utilizes different technological platforms to provide instant connectivity at the higher speeds made possible by our fiber network expansion and wireless network enhancements. Streaming, augmented reality, “smart” technologies, user generated content and artificial intelligence (AI) are expected to continue to drive greater demand for broadband, which we believe will allow us to capitalize on our fiber and 5G deployments. During 2025, we are focused on the core capabilities of our products, our infrastructure and our network. Our concentration is to aggregate the most traffic on the largest, lowest marginal cost, converged network through efficient spectrum deployment and construction of the largest high-capacity broadband solutions in the United States, while also working with regulators and customers to decommission high-cost legacy technologies over the next several years.\nDuring 2024, we collaborated with Ericsson to lead the U.S. in commercial scale open radio access network (Open RAN) deployment to build a more robust ecosystem of network infrastructure providers and suppliers, fostering lower network costs, improved operational efficiencies and allowing for continued investment in our fast-growing broadband network. We plan for about 70% of our wireless network traffic to flow across open-capable platforms by late 2026. Beginning in 2025, we expect to scale this Open RAN environment throughout our wireless network in coordination with multiple suppliers. We believe the move to an open, agile, programmable wireless network positions us to quickly capitalize on the next generation of wireless technology and spectrum when it becomes available. These innovative technologies are expected to enable lower-power, sustainable networks with higher performance to deliver enhanced user experiences.\nWe continue to experience rapid growth in data usage as consumers are demanding seamless access across their wireless and wired devices, and businesses and municipalities are connecting more and more equipment and facilities to the internet. The deployment of 5G, which allows for faster connectivity, lower latency and greater bandwidth, requires modifications of existing cell sites to add equipment supporting new frequencies, like the C-Band and the 3.45 GHz band. The increased speeds and network operating efficiency expected with 5G technology should enable massive deployment of devices connected to the internet as well as faster delivery of data services. As the wireless industry has matured, with nearly full penetration of smartphones in the U.S. population, future wireless growth will depend on our ability to offer innovative services, plans and devices that bundle product offerings and take advantage of our 5G wireless network.\nTo support higher mobile data usage, our priority is to best utilize a wireless network that has sufficient spectrum and capacity to support these innovations on as broad a geogra\nphic basis as possible.\nWe expect to continue to invest significant capital in expanding our network capacity, as well as obtaining additional spectrum, when available, that meets our long-term needs. We participate in FCC spectrum auctions and have been redeploying spectrum previously used for more basic services to support\nDollars in millions except per share amounts\nmore advanced mobile internet services.\nAdditionally, in November 2024, we agreed to purchase select spectrum licenses from United States Cellular Corporation (UScellular) for approximately $1,000, subject to closing conditions, including the consummation of UScellular’s proposed sale of its wireless operations and select spectrum assets to T-Mobile US, Inc.\nIn North America, our network covers over 440 million people with 4G LTE and over 314 million with 5G technology. In the United States, our network covers all major metropolitan areas and more than 336 million people with our LTE technology and more than 314 million people with our 5G technology.\nBroadband Technology\nIn 2020, we identified fiber as a core priority for our business and enhanced our focus to expand our fiber footprint and grow customers. At December 31, 2024, we had more than 9.3 million fiber consumer wireline broadband customers, adding 1.0 million during the year. The expansion builds on our recent investments to convert to a software-based network, managing the migration of wireline customers to services using our fiber infrastructure to provide broadband technology. Software-based technologies align with our global leadership in software defined network (SDN) and network function virtualization (NFV). This network approach delivers a demonstrable cost advantage in the deployment of next-generation technology over the traditional, hardware-intensive network approach. Our virtualized network supports next-generation applications like 5G and broadband-based services quickly and efficiently. At December 31, 2024, we had 15.3 million broadband connections, compared to 15.1 million broadband connections in the prior year.\nCopper Decommissioning\nWhile building the network of the future, we are actively working to exit our legacy copper network operations across the large majority of our wireline footprint. Our exit strategy includes migrating customers to fiber and wireless alternatives, and working with policy-makers to decommission our inefficient and less reliable copper network. At December 31, 2024, we had 3.3 million network access lines in service and 127,000 DSL subscribers compared, to 4.2 million network access lines in service and 210,000 DSL subscribers in the prior year.\nBUSINESS OPERATIONS\nOPERATING SEGMENTS\nOur segments are strategic business units that offer different products and services over various technology platforms and/or in different geographies that are managed accordingly. We have two reportable segments: Communications and Latin America.\nAdditional information about our segments, including financial information, is included under the heading “Segment Results” in Item 7 and in Note 4 of Item 8.\nCOMMUNICATIONS\nOur Communications segment provides wireless and wireline telecom and broadband services to consumers located in the U.S. and businesses globally. Our Communications services and products are marketed under the AT&T, AT&T Business, Cricket, AT&T PREPAID\nSM\n, AT&T Fiber and AT&T Internet Air brand names. The Communications segment provided approximately 97% of 2024 segment operating revenues and accounted for substantially all of our 2024 total segment operating income. This segment contains the Mobility, Business Wireline and Consumer Wireline business units.\nOur Mobility business unit provides nationwide wireless service to consumers and wholesale and resale wireless subscribers located in the United States by utilizing our network to provide voice and data services, including high-speed internet over wireless devices. We classify our subscribers as either postpaid, prepaid or reseller. As of December 31, 2024, we served 118 million Mobility subscribers, including 89 million postpaid (73 million phone), 19 million prepaid and 10 million through resellers. Our Mobility business unit revenue includes the following categories: service and equipment.\nWe offer a comprehensive range of high-quality nationwide wireless voice and data communications services in a variety of pricing plans to meet the communications needs of targeted customer categories. Through FirstNet\nservices, we also provide a nationwide wireless broadband network dedicated to public safety.\nConsumers continue to require increasing availability of data-centric services and a network to connect and control those devices. An increasing number of our subscribers are using more advanced devices, including embedded computing systems and/or software, commonly called the Internet of Things (IoT). We offer unlimited plans that include features allowing for the sharing of voice, text and data across multiple devices, which attracts subscribers from other providers and helps minimize subscriber churn. We continue to upgrade our network and coordinate with equipment manufacturers and application developers to further capitalize on the continued growing demand for wireless data services.\nWe also offer nationwide wireless voice and data communications to certain customers who prefer to pay in advance. These services are offered under the Cricket and AT&T PREPAID brands and are typically monthly prepaid services.\nDollars in millions except per share amounts\nWe sell a wide variety of handsets, wireless data cards and wireless computing devices manufactured by various suppliers for use with our voice and data services. We also sell accessories, such as carrying cases/protective covers and wireless chargers. We sell online and through our own company-owned stores, agents and third-party retail stores. We provide our customers the ability to purchase handsets on an installment basis and the opportunity to bring their own device. Subscribers that bring their own devices or retain handsets for longer periods impact upgrade activity. Like other wireless service providers, we also provide postpaid contract subscribers promotional equipment offers to initiate, renew or upgrade service.\nOur Business Wireline business unit provides services to business customers, including multinational corporations, small and mid-sized businesses, and governmental and wholesale customers. Our Business Wireline business unit revenue includes the following categories: service and equipment.\nWe offer fiber and other advanced connectivity services, such as AT&T Dedicated Internet, fiber ethernet and broadband, fixed wireless, and hosted and managed professional services, as well as legacy voice and other transitional services comprised of copper-based voice and data, Virtual Private Networks (VPN), wholesale, outsourcing and IP sales. Historically, a majority of our Business Wireline service revenues came from legacy copper-based voice and data and traditional products; however, over recent years those services have been declining due to secular pressures.\nWe continue to reconfigure our wireline network to take advantage of the latest technologies and services, and rely on our SDN and NFV to enhance business customers’ digital agility in a rapidly evolving environment. Some of the services we have offered historically are in secular decline and, going forward, we will focus on our owned and operated connectivity services powered by 5G and fiber as well as evaluating opportunities where we can turn down existing copper infrastructure.\nEquipment revenues include customer premises equipment.\n– Our Consumer Wireline business unit provides broadband services, including fiber connections, AIA and legacy telephony voice communication services, to customers in the United States by utilizing our IP-based and copper wired network. Our Consumer Wireline business unit revenue includes the following categories: broadband, legacy voice and data services and other service and equipment.\nWe provide broadband and internet services to approximately 14.1 million customers, including 9.3 million fiber broadband s",
  "item7_clean": "BP\nBP\nExcludes migrations between wireless subscriber categories, including connected devices, and acquisition-related activity during the period.\nIn addition to postpaid phones, includes tablets and wearables and other. Tablet net adds (losses) were 167, (68) and 203 for the years ended December 31, 2024, 2023 and 2022, respectively. Wearables and other net adds were 430, 639 and 1,020 for the years ended December 31, 2024, 2023 and 2022, respectively.\nCalculated by dividing the aggregate number of wireless subscribers who canceled service during a month by the total number of wireless subscribers at the beginning of that month. The churn rate for the period is equal to the average of the churn rate for each month of that period, excluding the impact of disconnections resulting from our 3G network shutdown in February 2022.\nDollars in millions except per share amounts\nrevenue increased during 2024, largely due to growth from subscriber gains and higher postpaid average revenue per subscriber (ARPU).\nARPU\nARPU increased in 2024 and reflects pricing actions.\nThe effective management of subscriber churn is critical to our ability to maximize revenue growth and to maintain and improve margins. Postpaid churn and postpaid phone-only churn were lower in 2024.\nrevenue decreased in 2024, primarily driven by lower wireless device sales volumes. The decrease was partially offset by sales of higher-priced phones in 2024.\nOperations and support\nexpenses decreased in 2024, largely due to lower equipment and selling costs driven by lower wireless sales volumes, partially offset by higher network costs.\nexpense increased in 2024, primarily due to shortening of estimated economic lives of wireless equipment that will be replaced earlier than originally anticipated with our Open RAN deployment and network transformation, and ongoing capital spending for network upgrades and expansion, which we expect to continue through 2025.\nincreased in 2024 and 2023. Our Mobility operating income margin was 30.9% in 2024, 30.8% in 2023 and 29.1% in 2022. Our Mobility EBITDA margin was 42.8% in 2024, 40.9% in 2023 and 39.1% in 2022.\nBusiness Wireline Results\n\nUnder an agreement with the New York Attorney General, the law began to be enforced on January 15, 2025. In response, AT&T announced that it would no longer offer its AT&T Internet Air fixed wireless service in New York. Other states could consider similar legislation.\nSince 2018, some states have adopted legislation or issued executive orders that established state net neutrality rules, including California and Vermont. We expect additional states may seek to impose net neutrality requirements in the future.\nOn November 15, 2023, the FCC adopted rules to “facilitate” equal access to broadband and prevent digital discrimination in broadband access. The rules, which became effective March 22, 2024, prohibit covered entities from implementing policies or practices not justified by genuine issues of technical or economic feasibility, that differentially impact consumers’ access to broadband internet access service based on prohibited characteristics (including income level, race, and ethnicity) or that have such differential impact, whether intentional or not. The rules broadly apply prospectively to all aspects of an ISP’s service that could impact a consumer’s ability to access broadband, including deployment, marketing, and credit checks, among other things. We may be required to answer complaints alleging that the company has violated the FCC rules and those complaints may seek relief, including changes to our business practices or civil forfeitures that could result in significant costs or reputational harm. It is currently uncertain how the FCC will implement and enforce these new rules. Several business associations have filed appeals challenging the rules and several of those appeals have been consolidated in the Eighth Circuit, which held oral argument on September 25, 2024.\nPrivacy-related legislation continues to be adopted or considered in a number of jurisdictions. Legislative, regulatory and litigation actions could result in increased costs of compliance, further regulation or claims against broadband internet access service providers and others, and increased uncertainty in the value and availability of data.\nInfrastructure Investment\nOn November 15, 2021, the Infrastructure Investment and Jobs Act (IIJA) was signed into law. The legislation appropriates $65,000 to support broadband deployment and adoption. The National Telecommunications and Information Agency (NTIA) is responsible for distributing more than $48,000 of this funding, including $42,500 in state grants for broadband deployment projects in unserved and underserved areas through the Broadband, Equity, Access and Deployment (BEAD) Programs. NTIA and states are in the process of administering these grants. Where appropriate, AT&T has applied for, and in some cases has been awarded, and may continue to apply for grants under this or other government infrastructure programs.\nIndustry-wide network densification and 5G technology expansion efforts, which are needed to satisfy extensive demand for video and internet access, will involve significant deployment of “small cell” equipment. This increases the importance of local permitting processes that allow for the placement of small cell equipment in the public right-of-way on reasonable timelines and terms. The FCC has adopted multiple Orders streamlining federal, state, and local wireless structure review processes that had the tendency to delay and impede deployment of small cell and related infrastructure used to provide telecommunications and broadband services. Additional spectrum will be needed industrywide for 5G and future services. In 2023, the FCC’s statutory authority to conduct spectrum auctions lapsed and it is uncertain when Congress will reauthorize it. Also in 2023, the federal government released a national spectrum strategy that focused on spectrum sharing but did not include terms of future spectrum sharing model(s) or specific timelines to make additional spectrum bands available for 5G and future generations of service. As a result, the federal government’s ability and intent to make sufficient spectrum available to the industry in needed timeframes and on terms suitable for mobile broadband network deployments remains uncertain.\nIn June and November 2020, the FCC issued Declaratory Rulings clarifying the limits on state and local authority to deny applications to modify existing structures to accommodate wireless facilities. In September 2024, the Ninth Circuit Court of Appeals resolved challenges to those Declaratory Rulings, largely sustaining the FCC’s rulings. The decision ensures that the FCC retains the ability to remove state and local regulations that could delay or impede spectrum and technology upgrades on existing cell site facilities.\nIn recent years, the FCC took several actions to make spectrum available for 5G services, including the auction of 280 MHz of mid-band spectrum previously used for satellite service (the “C-Band” auction) and 39 GHz band spectrum. AT&T obtained spectrum in these auctions. The FCC also made 150 MHz of mid-band CBRS spectrum available, to be shared with Federal incumbents, which enjoy priority. In addition, in 2022, the FCC completed Auction 110, in which AT&T won 40 MHz of 3.45 GHz spectrum nationwide at a cost of $9,079. (See Note 6)\nDollars in millions except per share amounts\nACCOUNTING POLICIES AND STANDARDS\nCritical Accounting Policies and Estimates\nBecause of the size of the financial statement line items they relate to or the extent of judgment required by our management, some of our accounting policies and estimates have a more significant impact on our consolidated financial statements than others.\nPension and Postretirement Benefits\nOur actuarial estimates of retiree benefit expense and the associated significant weighted-average assumptions are discussed in Note 14. Our assumed weighted-average discount rates for pension and postretirement benefits of 5.70% and 5.60%, respectively, at December 31, 2024, reflect the hypothetical rate at which the projected benefit obligations could be effectively settled or paid out to participants. We determined our discount rate based on a range of factors, including a yield curve composed of the rates of return on several hundred high-quality, fixed income corporate bonds available at the measurement date and corresponding to the related expected durations of future cash outflows for the obligations. These bonds had an average rating of at least Aa3 or AA- by the nationally recognized statistical rating organizations, denominated in U.S. dollars, and generally not callable, convertible or index linked. For the year ended December 31, 2024, when compared to the year ended December 31, 2023, we increased our pension discount rate by 0.70%, resulting in a decrease in our pension plan benefit obligation of $1,994, and increased our postretirement discount rate by 0.60%, resulting in a decrease in our postretirement benefit obligation of $317.\nOur expected long-term rate of return is 7.75% on pension plan assets and 4.00% on postretirement plan assets for 2024 and 2025. Our expected return on plan assets is calculated using the actual fair value of plan assets. If all other factors were to remain unchanged, we expect that a 0.50% decrease in the expected long-term rate of return would cause 2025 combined pension and postretirement cost to increase $136, which under our accounting policy would be adjusted to actual returns in the current year upon remeasurement of our retiree benefit plans.\nWe recognize gains and losses on pension and postretirement plan assets and obligations immediately in “Other income (expense) – net” in our consolidated statements of income. These gains and losses are generally measured annually as of December 31, and accordingly, will normally be recorded during the fourth quarter, unless an earlier remeasurement is required. Should actual experience differ from actuarial assumptions, the projected pension benefit obligation and net pension cost and accumulated postretirement benefit obligation and postretirement benefit cost would be affected in future years. See Note 14 for additional discussions regarding our assumptions.\nAsset Valuations and Impairments\nGoodwill and other indefinite-lived intangible assets are not amortized but tested at least annually on October 1 for impairment. For impairment testing, we estimate fair values using models that predominantly rely on the expected cash flows to be derived from the reporting unit or use of the asset. Long-lived assets are reviewed for impairment whenever events or circumstances indicate that the book value may not be recoverable over the remaining life. Inputs underlying the expected cash flows include, but are not limited to, subscriber counts, revenue per user, capital investment and acquisition costs per subscriber, and ongoing operating costs. We based our assumptions on a combination of our historical results, trends, business plans and marketplace participant data.\nAnnual Goodwill Testing\nGoodwill is tested on a reporting unit basis by comparing the estimated fair value of each reporting unit to its book value. If the fair value exceeds the book value, then no impairment is measured. We estimate fair values using an income approach (also known as a discounted cash flow model) and market multiple approaches. The income approach utilizes our future cash flow projections with a perpetuity value discounted at an appropriate weighted average cost of capital. The market multiple approach uses the multiples of publicly traded companies whose services are comparable to those offered by the reporting units.\nDuring the third quarter of 2024, we updated the long-term strategic plan of our Business Wireline reporting unit. The updated plans reflected lower long-term projected future cash flows associated with the industry-wide secular decline, including a faster-than-previously anticipated decline of legacy services. We identified this as an impairment indicator and performed an interim quantitative goodwill impairment test of our Business Wireline reporting unit. The interim impairment test methodology was consistent with our approach for annual impairment testing (see Note 1), using similar models updated with our current view of key inputs and assumptions. We concluded that the calculated fair value of the Business Wireline reporting unit was lower than the book value, resulting in a noncash goodwill impairment charge of $4,422 for the entirety of our Business Wireline reporting unit goodwill.\nAs of October 1, 2024, the calculated fair values of the reporting units with remaining goodwill exceeded their book values in all circumstances in excess of 10%. If either the projected long-term growth rates declined by 0.5%, if the projected long-term\nDollars in millions except per share amounts\nEBITDA margin declined by 0.5%, or if the weighted average cost of capital increased by 0.5%, the fair values would still be higher than the book value of the reporting units.\nThe fair values of our remaining reporting units could be negatively impacted by future sustained declines in macroeconomic or business conditions, higher discount rates or declines in the value of AT&T stock and could result in goodwill impairment charges in future periods.\nU.S. Wireless Licenses\nThe fair value of U.S. wireless licenses is assessed using a discounted cash flow model (the Greenfield Approach) and a qualitative corroborative market approach based on auction prices, depending upon auction activity. The Greenfield Approach assumes a company initially owns only the wireless licenses and makes investments required to build an operation comparable to current use. These licenses are tested annually for impairment on an aggregated basis, consistent with their use on a national scope for the United States. For impairment testing, we assume subscriber and revenue growth will trend up to projected levels, with a long-term growth rate reflecting expected long-term inflation trends. We assume churn rates will initially exceed our current experience but decline to rates that are in line with industry-leading churn. We used a discount rate of 8.75%, based on the optimal long-term capital structure of a market participant and its associated cost of debt and equity for the licenses, to calculate the present value of the projected cash flows. If either the projected rate of long-term growth of cash flows or revenues declined by 0.5%, or if the discount rate increased by 0.5%, the fair values of these wireless licenses would still be higher than the book value. The fair value of these wireless licenses exceeded their book values by more than 10%.\nOur estimates of income taxes and the significant items giving rise to the deferred assets and liabilities are shown in Note 13 and reflect our assessment of actual future taxes to be paid on items reflected in the financial statements, giving consideration to both timing and probability of these estimates. Actual income taxes could vary from these estimates due to future changes in income tax law or the final review of our tax returns by federal, state or foreign tax authorities.\nWe use our judgment to determine whether it is more likely than not that we will sustain positions that we have taken on tax returns and, if so, the amount of benefit to initially recognize within our financial statements. We regularly review our uncertain tax positions and adjust our unrecognized tax benefits (UTBs) in light of changes in facts and circumstances, such as changes in tax law, interactions with taxing authorities and developments in case law. These adjustments to our UTBs may affect our income tax expense. Settlement of uncertain tax positions may require use of our cash.\nNew Accounting",
  "item2_clean": null
}