{
  "source_file": "tdg-20250930.htm",
  "form_type": "10-K",
  "item1_clean": "ITEM 1. BUSINESS\nTD Group, through its wholly-owned subsidiary, TransDigm Inc., is a leading global designer, producer and supplier of highly engineered aircraft components that are critical to the safe and effective operation of nearly all commercial and military aircraft worldwide. Our products are represented in nearly every commercial and military aircraft in service today. Our business is well diversified due to the broad range of products we offer to our customers. We estimate that approximately 90% of our net sales for fiscal year 2025 were generated by proprietary products.\nMost of our products generate significant aftermarket revenue. Once our parts are designed into and sold on a new aircraft, we generate net sales from aftermarket consumption over the life of that aircraft, which is generally estimated to be approximately 25 to 30 years. A typical platform can be produced for 20 to 30 years, giving us an estimated product life cycle in excess of 50 years. We estimate that approximately 55% of our net sales in fiscal year 2025 were generated from the aftermarket, the vast majority of which come from the commercial and military aftermarkets. Historically, these aftermarket revenues have produced a higher gross profit and have been more stable than net sales to original equipment manufacturers (“OEMs”).\nOur business strategy is made up of two key strengths: (1) successful execution of our value-driven operating strategy focused around our three core value drivers and (2) a selective acquisition strategy.\nValue-Driven Operating Strategy.\nOur three core value drivers are:\nObtaining Profitable New Business.\nWe attempt to obtain profitable new business by using our technical expertise and application skill and our detailed knowledge of our customer base and the individual niche markets in which we operate. We have regularly been successful in identifying and developing both aftermarket and OEM products to drive our growth.\nImproving Our Cost Structure.\nWe are committed to maintaining and continuously improving our lean cost structure through detailed attention to the cost of each of the products that we offer and our organizational structure, with a focus on reducing the cost of each.\nProviding Highly Engineered Value-Added Products to Customers.\nWe focus on the engineering, manufacturing and marketing of a broad range of highly engineered niche products that we believe provide value to our customers. We believe we have been consistently successful in communicating to our customers the value of our products. This has generally enabled us to price our products to fairly reflect the value we provide and the resources required to do so.\nSelective Acquisition Strategy.\nWe maintain a selective acquisition strategy, concentrating on proprietary commercial aerospace component businesses with significant aftermarket content where we see a clear path to value creation through the application of our three core value drivers. The integration of acquisitions into our existing businesses combined with implementing our proven operating strategy has historically resulted in improvements in the financial performance of the acquired businesses. Since the inception of our company in 1993, we have acquired 95 businesses and various product lines. Refer to Note 2, “Acquisitions,” in the notes to the consolidated financial statements included herein for information on the recent acquisitions.\nWe primarily design, produce and supply highly engineered proprietary aerospace components with significant aftermarket content. We seek to develop highly customized products to solve specific needs for aircraft operators and manufacturers. We attempt to differentiate ourselves from our competitors by producing highly engineered products with high quality, reliability and timely delivery. Our proprietary products, and particularly our new product initiatives, are designed by our engineers and are intended to serve the needs of the aircraft component industry. These proprietary designs must withstand the extraordinary conditions and stresses that will be endured by products during use and meet the rigorous demands of our customers’ tolerance and quality requirements. Our portfolio of products encompasses a vast array of essential components that play pivotal roles on commercial aerospace and defense platforms, as well as other products. For example, TransDigm’s operating units make aircraft seatbelts and cockpit security systems that keep passengers and pilots safe; parachutes that protect military personnel; and specialized equipment for the National Aeronautics and Space Administration’s (“NASA”) space telescopes, aiding in space exploration and scientific advancement.\nOur engineering costs are recorded in cost of sales and in selling and administrative expenses within our consolidated statements of income. Research and development costs are recorded in selling and administrative expenses within our consolidated statements of income. Refer to Note 1, “Summary of Significant Accounting Policies,” in the notes to the consolidated financial statements included herein with respect to the total costs of research and development.\nThe Company’s businesses are organized and managed in three reporting segments: Power & Control, Airframe and Non-aviation.\nThe Power & Control segment includes operations that primarily develop, produce and market systems and components that predominately provide power to or control power of the aircraft utilizing electronic, fluid, power and mechanical motion control technologies. Major product offerings include mechanical/electromechanical actuators and controls, ignition systems and engine technology, specialized pumps and valves, power conditioning devices, specialized AC/DC electric motors and generators, batteries and chargers, databus and power controls, advanced sensor products, switches and relay panels, high performance hoists, winches and lifting devices, cargo loading, handling, delivery systems and electronic components used in the generation, amplification, transmission and reception of microwave signals. Primary customers of this segment are engine and power system and subsystem suppliers, airlines, third party maintenance suppliers, military buying agencies and repair depots. Products are sold in the original equipment and aftermarket market channels.\nThe Airframe segment includes operations that primarily develop, produce and market systems and components that are used in non-power airframe applications utilizing airframe and cabin structure technologies. Major product offerings include engineered latching and locking devices, engineered rods, engineered connectors and elastomer sealing solutions, cockpit security components and systems, specialized and advanced cockpit displays, engineered audio, radio and antenna systems, specialized lavatory components, seat belts and safety restraints, engineered and customized interior surfaces and related components, thermal protection and insulation, lighting and control technology, parachutes, specialized flight, wind tunnel and jet engine testing services and equipment and complex testing and instrumentation solutions. Primary customers of this segment are airframe manufacturers and cabin system suppliers and subsystem suppliers, airlines, third party maintenance suppliers, military buying agencies and repair depots. Products are sold in the original equipment and aftermarket market channels.\nThe Non-aviation segment includes operations that primarily develop, produce and market products for non-aviation markets. Major product offerings include seat belts and safety restraints for ground transportation applications, mechanical/electromechanical actuators and controls for space applications, hydraulic/electromechanical actuators and fuel valves for land-based gas turbines, and refueling systems for heavy equipment used in mining, construction and other industries and turbine controls for the energy and oil and gas markets. Primary customers of this segment are off-road vehicle suppliers and subsystem suppliers, child restraint system suppliers, satellite and space system suppliers, manufacturers of heavy equipment used in mining, construction and other industries and turbine original equipment manufacturers, gas pipeline builders and electric utilities.\nFor financial information about our segments, refer to Note 15, “Segments,” in the notes to the consolidated financial statements included herein.\nWe predominantly serve customers in the commercial, regional, business jet and general aviation aftermarket, which generally account for 30% to 35% of our annual net sales; the commercial aerospace OEM market, comprising large commercial transport manufacturers and regional and business jet manufacturers, which generally account for 25% to 30% of our annual net sales; and the defense market (which includes defense OEMs and aftermarket sales to the U.S. and friendly foreign governments), which generally account for approximately 35% to 40% of our annual net sales.\nOur customers include: (1) distributors of aerospace components; (2) worldwide commercial airlines, including national and regional airlines; (3) large commercial transport and regional and business aircraft OEMs; (4) various armed forces of the United States and friendly foreign governments; (5) defense OEMs; (6) system suppliers; and (7) various other industrial customers. Our top ten customers for fiscal year 2025 accounted for approximately 40% of our net sales. Products supplied to many of our customers are used on multiple platforms. None of our customers individually accounted for greater than 10% of our net sales for fiscal year 2025. We believe that our diversified revenue base reduces our dependence on any particular product, platform or market channel and has been a significant factor in maintaining our financial performance.\nThe niche markets within the aerospace industry that we serve are relatively fragmented and we face several competitors for many of the products and services we provide. Due to the global nature of the commercial aircraft industry, competition in these categories comes from both U.S. and foreign companies. Competitors in our product offerings range in size from divisions of large public corporations to small privately-held entities with only one or two components in their entire product portfolios.\nWe compete on the basis of engineering, manufacturing and marketing high quality and reliable products, which we believe meet or exceed the performance and maintenance requirements of our customers, consistent and timely delivery, and superior customer service and support. The industry’s stringent regulatory, certification and technical requirements and the investments necessary in the development and certification of products may create disincentives for potential new competitors for certain products. If customers receive products that meet or exceed expectations and performance standards, we believe that they will have a reduced incentive to certify another supplier because of the cost and time of the technical design and testing certification process. In addition, we believe that the availability, dependability and safety of our products are reasons for our customers to continue long-term supplier relationships.\nGovernmental Regulations\nThe commercial aircraft component industry is highly regulated by the Federal Aviation Administration (“FAA”) in the United States and by the European Union Aviation Safety Agency in Europe and other agencies throughout the world, while the military aircraft component industry is governed by military quality specifications. We, and the components we manufacture, are required to be certified by one or more of these entities or agencies, and, in many cases, by individual OEMs, in order to engineer and service parts and components used in specific aircraft models.\nWe must also satisfy the requirements of our",
  "item7_clean": "ITEM 7. MANAGEMENT’S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS\nThe following discussion of our financial condition and results of operations should be read together with TD Group’s consolidated financial statements and the related notes included elsewhere in this report. The following discussion may contain predictions, estimates and other forward-looking statements that involve a number of risks and uncertainties, including those discussed under the heading entitled “Risk Factors” included elsewhere in this report. These risks could cause our actual results to differ materially from any future performance suggested below.\nWe believe we are a leading global designer, producer and supplier of highly engineered proprietary aerospace components with significant aftermarket content. We seek to develop highly customized products to solve specific needs for aircraft operators and manufacturers. We attempt to differentiate ourselves based on engineering, service and manufacturing capabilities. We believe that our products have strong brand names within the industry and that we have a reputation for high quality, reliability and strong customer support. We believe we have achieved steady, long-term growth in sales and improvements in operating performance we believe that due to our competitive strengths and through execution of our value-driven operating strategy. More specifically, focusing our businesses on our value-driven operating strategy of obtaining profitable new business, carefully controlling the cost structure via productivity and cost improvements and pricing our highly engineered value-added products to fairly reflect the value we provide and the resources required to do so has historically resulted in improvements in gross profit and income from operations over the long-term.\nOur selective acquisition strategy has also been an important contribution to the growth of our business. We maintain a selective acquisition strategy, concentrating on proprietary commercial aerospace component businesses with significant aftermarket content where we see a clear path to value creation through the application of our three core value drivers. The integration of acquisitions into our existing businesses combined with implementing our proven operating strategy has historically resulted in improvements in the financial performance of the acquired businesses.\nFor fiscal year 2025, we generated net sales of $8,831 million, gross profit of $5,311 million or 60.1% of net sales, and net income attributable to TD Group of $2,074 million.\nIn fiscal 2025, demand for air travel remained strong both domestically and internationally. Commercial aftermarket sales increased in fiscal 2025 compared to fiscal 2024 primarily due to the overall demand for air travel resulting in higher flight hours and utilization of passenger and freight aircraft as global air traffic continues to surpass pre-pandemic levels. In recent months, international air traffic growth has been outpacing domestic growth. Passenger load factors remain strong and have reached record levels in recent months in certain markets.\nOur commercial transport OEM shipments and revenues generally run ahead of aircraft delivery schedules. Consistent with prior years, our fiscal 2025 shipments were a function of, among other things, the estimated 2025 and 2026 commercial aircraft production rates for Boeing and Airbus. Airline demand for new aircraft remains high and the OEMs are working to increase aircraft production. However, aircraft production rates remain well below pre-pandemic levels as the struggles in the OEM supply chain and labor challenges persist, along with geopolitical challenges, though progress continues to be made in the build rates. Airbus has also encountered difficulties in ramping up production. For fiscal 2025, the impact across TransDigm's operating units was uneven and varied, resulting in consolidated commercial OEM sales decreasing compared to fiscal 2024.\nOur defense business fluctuates from year-to-year, and is dependent, to a degree, on government budget constraints, the timing of orders, macro and micro dynamics with respect to the DOD procurement policy and the extent of global conflicts, such as the ongoing geopolitical conflicts. Likewise, delays in government spending outlays and government funding reprioritization can impact demand. For a variety of reasons, the military spending outlook is very uncertain, though recent DOD budgets have trended upwards due to recent geopolitical challenge and conflicts, and current military modernization efforts. Defense sales in fiscal 2025 increased compared to fiscal 2024 primarily due to continued U.S. Government defense spend outlays.\nAt various points in 2025, the U.S. Government announced new or higher tariffs on goods imported into the U.S. from numerous countries resulting in multiple countries countering with reciprocal tariffs and other actions in response. Negotiations between the U.S. and other countries regarding the tariffs are ongoing and their status continues to evolve. TransDigm is primarily a domestic manufacturer. Because of this, tariffs did not have a significant impact on our fiscal 2025 operating results and we do not expect the tariffs to have a significant impact on our fiscal 2026 operating results. However, we continue to monitor the developments on tariffs and other changes in trade policy for its potential impact on the economic environment and on our business and operating results.\nResults of Operations\nThe following table sets forth, for the periods indicated, certain operating data of the Company, including presentation of the amounts as a percentage of net sales (amounts in millions, except per share data):\nFiscal Years Ended September 30,\nSelling and administrative expenses\nAmortization of intangible assets\nIncome from operations\nInterest expense-net\nIncome tax provision\nIncome from continuing operations\nLess: Net income attributable to noncontrolling interests\nNet income attributable to TD Group\nNet income applicable to TD Group common stockholders\nEarnings per share attributable to TD Group common stockholders:\nCash dividends declared per common share\nWeighted-average shares outstanding—basic and diluted\nEBITDA\n\nNet income applicable to TD Group common stockholders represents net income attributable to TD Group less special dividends declared or paid on participating securities, including dividend equivalents of $208 million and $233 million for the fiscal years ended September 30, 2025 and 2024, respectively.\nEarnings per share is calculated by dividing net income applicable to TD Group common stockholders by the basic and diluted weighted average common shares outstanding. Figures in the table may not recalculate exactly due to rounding. Earnings per share is calculated using unrounded numbers.\nRefer to “Non-GAAP Financial Measures” in this discussion and analysis for additional information and limitations regarding these non-GAAP financial measures, including a reconciliation to the comparable U.S. GAAP financial measure.\nChanges in Results of Operations\nFiscal year ended September 30, 2025 compared with fiscal year ended September 30, 2024\nNet organic sales and acquisition sales and the related dollar and percentage changes for the fiscal years ended September 30, 2025 and 2024 were as follows (amounts in millions):\nOrganic sales represent net sales from existing businesses owned by the Company, excluding sales from acquisitions. Acquisition sales represent net sales from acquired businesses for the period up to one year from the respective acquisition date. We believe this measure provides investors with a supplemental understanding of underlying sales trends by providing sales growth on a consistent basis. Refer to Note 2, “Acquisitions,” in the notes to the consolidated financial statements included herein for information on the Company's recent acquisitions.\nThe increase in organic sales of $615 million for the fiscal year ended September 30, 2025 compared to the fiscal year ended September 30, 2024 is primarily related to increases in defense and commercial aftermarket.\nCost of Sales and Gross Profit\nCost of sales increased by $252 million or 7.7%, to $3,520 million for the fiscal year ended September 30, 2025 compared to $3,268 million for the fiscal year ended September 30, 2024. Cost of sales and the related percentage of net sales for the fiscal years ended September 30, 2025 and 2024 were as follows (amounts in millions):\nCost of sales - excluding costs below\nNon-cash stock and deferred compensation expense\nInventory step-up amortization\nForeign currency losses\nLoss contract amortization\nGross profit (Net sales less Total cost of sales)\nGross profit percentage (Gross profit / Net sales)\nCost of sales during the fiscal year ended September 30, 2025 decreased as a percentage of net sales. This was primarily driven by the application of our three core value-driven operating strategy (obtaining profitable new business, continually improving our cost structure and providing highly engineered value-added products to customers) coupled with fixed overhead costs spread over higher production volume.\nForeign exchange rates continue to fluctuate; the loss is primarily attributable to the continued weakening of the U.S. dollar. Loss contract amortization fluctuates primarily based on the rate of actual to forecasted shipments of the products covered under the onerous contract.\nSelling and Administrative Expenses.\nSelling and administrative expenses decreased by $35 million to $945 million for the fiscal year ended September 30, 2025. The related percentage of net sales for the fiscal years ended September 30, 2025 and 2024 were as follows (amounts in millions):\nSelling and administrative expenses - excluding costs below\nNon-cash stock and deferred compensation expense\nAcquisition transaction and integration-related expenses\nTotal selling and administrative expenses\nThe decrease in non-cash stock and deferred compensation expense is primarily attributable to the appreciation of the stock price at a higher rate in fiscal 2024 compared to fiscal 2025, as the stock price is a key input used to determine the Black-Scholes fair value for the non-cash stock compensation expense, and lower deferred compensation expense.\nInterest Expense-net.\nInterest expense-net includes interest on borrowings outstanding, amortization of debt issuance costs, original issue discount, revolving credit facility fees, finance leases, interest income and the impact of interest rate swaps, caps and collars designated and qualifying as cash flow hedges. Interest expense-net increased $286 million, or 22.2%, to $1,572 million for the fiscal year ended September 30, 2025 from $1,286 million for the fiscal year ended September 30, 2024. The increase in interest expense-net was primarily due to an increase in outstanding borrowings (refer to Note 10, “Debt” in the notes to the consolidated financial statements for information on our debt) and a decrease in interest income. The weighted average interest rate for cash interest payments on total borrowings outstanding was 6.3% for the fiscal years ended September 30, 2025 and September 30, 2024.\nIncome Tax Provision.\nIncome tax expense as a percentage of income before income taxes was approximately 21.1% for the fiscal year ended September 30, 2025 compared to 22.6% for the fiscal year ended September 30, 2024. Refer to Note 12, “Income Taxes”, in the notes to the consolidated financial statements included herein for additional information.\nBasic and diluted earnings per share was $32.08 for the fiscal year ended September 30, 2025 and $25.62 for the fiscal year ended September 30, 2024. Net income attributable to TD Group for the fiscal year ended September 30, 2025 of $2,074 million was decreased by dividend equivalents of $208 million, or $3.58 per share, resulting in net income applicable to TD Group common stockholders of $1,866 million. Net income attributable to TD Group for the fiscal year ended September 30, 2024 of $1,714 million was decreased by dividend equivalents of $233 million, or $4.02 per share, resulting in net income applicable to TD Group common stockholders of $1,481 million.\nNet sales by segment for the fiscal years ended September 30, 2025 and 2024 were as follows (amounts in millions):\nFiscal Years Ended September 30,\nNet sales for the Power & Control segment increased $593 million primarily from increases in organic sales in defense, commercial aftermarket and commercial OEM.\nNet sales for the Airframe segment increased $303 million primarily from increases in organic sales in defense and commercial aftermarket.\nRefer to “Non-GAAP Financial Measures” in this discussion and analysis for additional information and limitations regarding these non-GAAP financial measures, including a reconciliation to the comparable U.S. GAAP financial measure. EBITDA As Defined by segment for the fiscal years ended September 30, 2025 and 2024 were as follows (amounts in millions):\nFiscal Years Ended September 30,\nTotal segment EBITDA As Defined\nLess: Unallocated corporate EBITDA As Defined\nTotal Company EBITDA As Defined\n\nRepresents principal maturities which excludes interest, debt issuance costs and original issue discount.\nRefer to Note 10, “Debt,” in the notes to the consolidated financial statements included herein for information on the maturity date of each tranche of term loans. The Term Loans Facility requires quarterly aggregate principal payments of approximately $28 million.\nAssumes that the variable interest rate on our existing term loans under our Term Loans Facility ranges from approximately 5.50% to 6.75% based on anticipated movements in Term SOFR, which given the ongoing volatility in rates, are highly uncertain. In addition, interest payments include the impact of the existing interest rate swap and collar agreements described in Note 18, “Derivatives and Hedging Activities,” in the notes to the consolidated financial statements included herein.\nOff-Balance Sheet Arrangements\nThe Company utilizes letters of credit to back certain payment and performance obligations. Letters of credit are subject to limits based on amounts outstanding under the Company’s revolving credit facility. As of September 30, 2025, the Company had $53 million in letters of credit outstanding.\nCritical Accounting Policies and Estimates\nOur consolidated financial statements have been prepared in conformity with generally accepted accounting principles in the United States (“U.S. GAAP”), which often requires the judgment of management in the selection and application of certain accounting principles and methods. Management believes that the quality and reasonableness of our most critical policies enable the fair presentation of our financial position and results of operations. However, investors are cautioned that the sensitivity of financial statements to these methods, assumptions and estimates could create materially different results under different conditions or using different assumptions.\nBelow are those policies applied in preparing our financial statements that management believes are the most dependent on the application of estimates and assumptions. For additional significant accounting policies, see Note 1, “Summary of Significant Accounting Policies,” in the notes to the consolidated financial statements included herein.\n– The Company recognizes revenue from contracts with customers using the five step model prescribed in ASC 606. A substantial portion of the Company's revenue is recorded at a point in time. Revenue is recognized from the sale of products or services when obligations under the terms of the contract are satisfied and control of promised goods or services have transferred to the customer. Control is transferred when the customer has the ability to direct the use of and obtain ben",
  "item2_clean": null
}