{
  "source_file": "tdy-20241229.htm",
  "form_type": "10-K",
  "item1_clean": "Our principal U.S. Government customer is the U.S. Department of Defense, with total net sales of $1,062.7 million and $1,081.3 million in 2024 and 2023, respectively. With the exception of the Engineered Systems segment, no U.S Government program in 2024 or 2023 accounted for more than 10% of net sales for any of our segments or for the total Company. In 2024 and 2023, the largest program with the U.S. Government within the Engineered Systems segment was the Marshall Operations, Systems, Services, and Integration II (“MOSSI II”) contract with the NASA Marshall Space Flight Center, which represented approximately 16% and approximately 17% of Engineered Systems net sales, respectively.\nAs described in greater detail under Item 1A. Risk Factors, there are risks associated with doing business with the U.S. Government. In 2024, approximately 78% of our U.S. Government prime contracts and subcontracts were fixed-price type contracts, compared to 79% in 2023, with the remaining U.S. Government contracts related to cost-reimbursable contracts (“cost-type”) contracts. Under fixed-price type contracts, we bear the inherent risk that actual performance cost may exceed the fixed contract price. Such contracts are typically not subject to renegotiation of profits if we fail to anticipate technical problems, estimate costs accurately or control costs during performance. Additionally, U.S. Government contracts are subject to termination by the U.S. Government at its convenience, without identification of any default. When contracts are terminated for convenience, we can recover costs incurred or committed, settlement expenses and profit on work completed prior to termination. During 2024 and 2023, contracts terminated by the U.S. Government did not materially impact our results of operations.\nMany of our U.S. Government contracts are awarded after a competitive bidding process in which we seek to emphasize our ability to provide superior products and technical solutions.\nRaw Materials and Suppliers\nMost raw materials used in our operations are readily available. Some raw materials are purchased from a limited set of suppliers, including international sources, due to technical capability, price, and other factors. We leverage our existing supplier relationships and are not dependent on any one supplier for a material amount of our purchases. While some of our businesses provide services, for those businesses that sell products, a portion of the value that we provide is labor-oriented, such as design, engineering, assembly and test activities. In manufacturing our products, we use our own production capabilities and third-party suppliers and subcontractors, including international sources. At times we have experienced difficulty in procuring raw materials, components, sub-assemblies and other supplies required in our manufacturing processes due to shortages and supplier-imposed allocation of components.\nOur sales and marketing approach varies by segment and by products within our segments. A shared fundamental tenet is the commitment to work closely with our customers to understand their needs, with an aim to secure preferred supplier and longer-term relationships. Given the technical nature of our products, we conduct our marketing activities through a direct internal sales force as well as third-party sales representatives and distributors. Several Teledyne businesses, including across our segments, are marketing and selling products collaboratively to certain customers.\nBecause of the diversity of products sold and the number of markets we serve, we encounter a wide variety of competitors, none of which we believe offer the same product and service lines or serve all of the same markets as we do. Although we have certain advantages that we believe help us compete effectively in our markets, each of our markets is highly competitive. Our businesses compete on quality, product performance and reliability, technical expertise, price and service. Many of our competitors have, and potential competitors could have, greater name recognition, a larger installed base of products, more extensive engineering, manufacturing, marketing and distribution capabilities and greater financial, technological and personnel resources than we do.\nIntellectual Property\nWe own and control various intellectual property rights, including patents, trade secrets, confidential information, trademarks, trade names, and copyrights. We license patents, technology and other intellectual property rights owned and controlled by others. Similarly, other companies license patents, technology and other intellectual property rights owned and controlled by us. We do not consider any single patent or trademark, or any group of them, essential either to Teledyne’s business as a whole or to any one of our reportable segments. The annual royalties received or paid under license agreements are not significant to any of our reportable segments or to our overall operations.\nPatents, patent applications and license agreements will expire or terminate over time by operation of law, in accordance with their terms or otherwise. We do not expect the expiration or termination of these patents, patent applications and license agreements to have a material adverse effect on our business, results of operations or financial condition.\nEnvironment and Other Government Regulations\nInformation with respect to environmental matters is set forth under “Other Matters – Environmental” of “\n. Management’s Discussion and Analysis of Results of Operation and Financial Condition” and Note\n. No material capital expenditures relating to environmental compliance are presently anticipated. See Note\nfor additional discussion of other government regulations.\nTeledyne continues to focus on developing solutions to address sustainability and climate challenges facing humanity today. Many of our products directly support sustainability and climate challenges. We provide a broad range of precision measurement technologies for environmental monitoring and climate research. Our sensors and instruments are deployed everywhere: in space, on aircraft and drones, on land, on the sea surface, in the water column, and on the seafloor. They operate around the clock, measuring greenhouse gases from space, precisely monitoring air and water quality throughout the world, and continuously profiling the Earth’s oceans. Applications of our instruments provide scientists information that spans time from the origin of the universe to providing real-time data regarding air pollution and dangerous storms, such as time-critical warning of hurricanes and tsunamis.\nThe prominence and importance of sustainability and Environmental, Social and Governance (“ESG”) initiatives have dramatically increased. In November 2022, we published our second Corporate Social Responsibility (“CSR”) report, in which we disclose and highlight some of our most recent efforts focused on sustainability and ESG. We published supplements to the CSR report in 2023 and 2024 to include updated financial information and other information in the report. The CSR report together with its supplements, which is not incorporated by reference in this document, is available at the Corporate Social Responsibility link on our website at www.teledyne.com under the tab “Who We Are”. The CSR Report and its supplements include data on Teledyne’s combined direct emissions (“Scope 1”) and indirect emissions from purchased energy (“Scope 2”), workplace safety, water usage, waste generation and recycling and workplace demographics.\nIn 2021, we compiled the first global inventory of our greenhouse gas (“GHG”) emissions (starting with fiscal year 2020) and have developed a GHG monitoring and management plan. We have set a goal to reduce our combined Scope 1 and Scope 2 in company operations, normalized for revenue, by 40% from 2020 levels by the end of 2040. Going forward, we will continue to evaluate our emission reduction goals, while at the same time providing the tools and technologies enabling environmental science and climatology across the globe. More information about our carbon footprint and GHG emission reduction efforts and goals, and the contributions that Teledyne products make to carbon monitoring and environmental and climate science, can be found in our CSR report.\nPursuant to the mandate in their respective charters, the Audit Committee of our Board of Directors (the “Board”) regularly reviews matters related to compliance with environmental laws and the health and safety of employees, and the Nominating and Governance Committee of our Board reviews and evaluates our policies and practices and monitors our efforts in areas of legal and social responsibility, sustainability and other ESG matters.\nWe consider our relations with our employees to be good. At December 29, 2024, our total workforce consisted of approximately 14,900 employees in 36 countries. Workforce demographics for various regions are provided below:\nGender (Self-Reported)\nPercent of Total Employees\nAverage Years of Service\nEurope, the Middle East and Africa\nWe have a stable and long-tenured workforce. In 2024, our voluntary employee turnover was approximately 8%. As of December 29, 2024, the average years of service of our employees was approximately 10 years.\nEmployees are vital to the success of our growth strategy. Our goal is to maintain a safe, hospitable and inclusive work environment in which every employee is encouraged to contribute to the success of the company. We are focused on attracting, developing, and retaining employees through competitive compensation and benefits, workforce and management development, succession planning, corporate culture and leadership quality, in compliance with applicable regulations. We strive to recruit the best possible candidate for each role.\nThe health and wellness of our employees is a critical component to the success of our business. Many of our larger facilities have on-site fitness centers and encourage healthy choices with various wellness challenge programs. These programs often include guest speakers on various topics, including mental health, heart disease, diabetes, and personal financial awareness. We also have vacation and sick leave policies that provide employees with flexibility to take time away from work for relaxation or to recover from illness. The majority of our employees (including all full-time employees in the United States, Canada and the United Kingdom) have access to our employee assistance program which includes third-party counseling and mental health services at no cost to the employee when life events impact an employee.\nWe are committed to identifying and developing the talents of our next generation of leaders. On an annual basis, we conduct an organization and leadership review for segment, business unit, and function leaders, focusing on our high performing and high potential talent and succession for our most critical roles. From this review, individualized development and retention programs are implemented or revised as needed. We also provide additional opportunities for our existing employees to enhance their careers. We invest in employee skills development in various ways, including through educational expense reimbursement. Specialized training in a job-related field gives employees new skills and a strong foundation of knowledge that can serve them throughout their career and that may allow them to progress to more responsible positions at Teledyne. We provide courses, webinars, and certification programs and targeted training programs on management, technical competencies, soft skills development, and compliance. Select, high-potential employees also receive strategic and operational leadership skills development through our leadership development program.\nAvailable Information\n\nDigital Imaging Segment\nOur Digital Imaging segment includes high-performance senso",
  "item7_clean": ". Management’s Discussion and Analysis of Results of Operation and Financial Condition” and Note\n. No material capital expenditures relating to environmental compliance are presently anticipated. See Note\nfor additional discussion of other government regulations.\nTeledyne continues to focus on developing solutions to address sustainability and climate challenges facing humanity today. Many of our products directly support sustainability and climate challenges. We provide a broad range of precision measurement technologies for environmental monitoring and climate research. Our sensors and instruments are deployed everywhere: in space, on aircraft and drones, on land, on the sea surface, in the water column, and on the seafloor. They operate around the clock, measuring greenhouse gases from space, precisely monitoring air and water quality throughout the world, and continuously profiling the Earth’s oceans. Applications of our instruments provide scientists information that spans time from the origin of the universe to providing real-time data regarding air pollution and dangerous storms, such as time-critical warning of hurricanes and tsunamis.\nThe prominence and importance of sustainability and Environmental, Social and Governance (“ESG”) initiatives have dramatically increased. In November 2022, we published our second Corporate Social Responsibility (“CSR”) report, in which we disclose and highlight some of our most recent efforts focused on sustainability and ESG. We published supplements to the CSR report in 2023 and 2024 to include updated financial information and other information in the report. The CSR report together with its supplements, which is not incorporated by reference in this document, is available at the Corporate Social Responsibility link on our website at www.teledyne.com under the tab “Who We Are”. The CSR Report and its supplements include data on Teledyne’s combined direct emissions (“Scope 1”) and indirect emissions from purchased energy (“Scope 2”), workplace safety, water usage, waste generation and recycling and workplace demographics.\nIn 2021, we compiled the first global inventory of our greenhouse gas (“GHG”) emissions (starting with fiscal year 2020) and have developed a GHG monitoring and management plan. We have set a goal to reduce our combined Scope 1 and Scope 2 in company operations, normalized for revenue, by 40% from 2020 levels by the end of 2040. Going forward, we will continue to evaluate our emission reduction goals, while at the same time providing the tools and technologies enabling environmental science and climatology across the globe. More information about our carbon footprint and GHG emission reduction efforts and goals, and the contributions that Teledyne products make to carbon monitoring and environmental and climate science, can be found in our CSR report.\nPursuant to the mandate in their respective charters, the Audit Committee of our Board of Directors (the “Board”) regularly reviews matters related to compliance with environmental laws and the health and safety of employees, and the Nominating and Governance Committee of our Board reviews and evaluates our policies and practices and monitors our efforts in areas of legal and social responsibility, sustainability and other ESG matters.\nWe consider our relations with our employees to be good. At December 29, 2024, our total workforce consisted of approximately 14,900 employees in 36 countries. Workforce demographics for various regions are provided below:\nGender (Self-Reported)\nPercent of Total Employees\nAverage Years of Service\nEurope, the Middle East and Africa\nWe have a stable and long-tenured workforce. In 2024, our voluntary employee turnover was approximately 8%. As of December 29, 2024, the average years of service of our employees was approximately 10 years.\nEmployees are vital to the success of our growth strategy. Our goal is to maintain a safe, hospitable and inclusive work environment in which every employee is encouraged to contribute to the success of the company. We are focused on attracting, developing, and retaining employees through competitive compensation and benefits, workforce and management development, succession planning, corporate culture and leadership quality, in compliance with applicable regulations. We strive to recruit the best possible candidate for each role.\nThe health and wellness of our employees is a critical component to the success of our business. Many of our larger facilities have on-site fitness centers and encourage healthy choices with various wellness challenge programs. These programs often include guest speakers on various topics, including mental health, heart disease, diabetes, and personal financial awareness. We also have vacation and sick leave policies that provide employees with flexibility to take time away from work for relaxation or to recover from illness. The majority of our employees (including all full-time employees in the United States, Canada and the United Kingdom) have access to our employee assistance program which includes third-party counseling and mental health services at no cost to the employee when life events impact an employee.\nWe are committed to identifying and developing the talents of our next generation of leaders. On an annual basis, we conduct an organization and leadership review for segment, business unit, and function leaders, focusing on our high performing and high potential talent and succession for our most critical roles. From this review, individualized development and retention programs are implemented or revised as needed. We also provide additional opportunities for our existing employees to enhance their careers. We invest in employee skills development in various ways, including through educational expense reimbursement. Specialized training in a job-related field gives employees new skills and a strong foundation of knowledge that can serve them throughout their career and that may allow them to progress to more responsible positions at Teledyne. We provide courses, webinars, and certification programs and targeted training programs on management, technical competencies, soft skills development, and compliance. Select, high-potential employees also receive strategic and operational leadership skills development through our leadership development program.\nAvailable Information\nThe following discussion sets forth the material risk factors that could affect Teledyne’s financial condition and operations. You should not consider any descriptions of these factors to be a complete set of all potential risks that could affect Teledyne. Any of the risk factors discussed below could by itself, or combined with other factors, materially and adversely affect our business, results of operations, financial condition, competitive position or reputation, including by materially increasing expenses or decreasing revenues, which could result in material losses or a decrease in earnings.\nRisks Related to our Business and Industry\nA possible recession in the United States or globally may adversely affect us.\nWe sell products and services to customers in industries that are sensitive to the level of general economic activity and consumer spending habits. If another recession emerges, either globally or in the United States, we may experience declines in revenues, profitability and cash flows from reduced orders, payment delays, collection difficulties, increased price pressures for our products, increased risk of excess and obsolete inventories or other factors caused by the economic problems of our customers.\nAcquisitions and our ability to make acquisitions involve inherent risks that may adversely affect our operating results and financial condition.\nOur growth strategy includes acquisitions. Acquisitions involve various inherent risks, such as:\nour ability to assess accurately the value, strengths, weaknesses, internal controls, contingent and other liabilities and potential profitability of acquisition candidates;\ndifficulties in integrating acquired businesses, including the potential loss of key personnel from an acquired business, our potential inability to achieve identified financial, operating and other synergies anticipated to result from an acquisition, and integration issues associated with internal controls of acquired businesses;\nthe diversion of management’s attention from our existing businesses;\nthe potential impairment of assets;\npotential unknown liabilities associated with a business that we acquire or in which we invest, including environmental liabilities;\nnew and proposed regulations limiting the enforcement of noncompetition and nonsolicitation agreements;\nproduction delays associated with consolidating acquired facilities and manufacturing operations;\npre-existing vulnerabilities, undetected malware and access management issues at the acquired business and its supply chain;\nthe incurrence of significant transaction costs, including for acquisitions which we may not complete; and\nthe inadequacy of indemnification, insurance, escrows, holdbacks or other forms of protection for liabilities of the acquired company.\nIf we are unable to make acquisitions our future growth may be adversely impacted. Our ability to make acquisitions depends on a number of factors, including the availability of potential acquisition candidates at reasonable prices, competition from other bidders, the ability to obtain regulatory approvals, including under merger control and foreign direct investment laws, and the availability of debt and equity financing, among other factors. For additional discussion of business acquisition, see the discussion under “Item\n. Management’s Discussion and Analysis of Operations and Financial Condition” and Note\nHigher interest rates and other factors could cause our customers to reduce capital spending, which could adversely impact us.\nHigher interest rates may reduce capital spending by our existing and potential customers, which could result in lower sales of our products.\nIncreased prices for components and raw materials used in our products and higher labor and shipping costs could adversely impact our profitability.\nIn recent years, inflation and supply chain constraints resulted in sustained increases in the prices we pay for many of the components and raw materials used in our products. In addition, we have experienced higher labor costs due to increased competition for personnel in many regions in which we operate as well as general inflationary conditions, and higher shipping costs due to labor and rising energy prices. If we are unable to increase our product prices enough to offset these increased costs, our gross margins and profitability could decrease, perhaps significantly over a sustained period of time.\nWe have experienced component and raw material shortages in the past that impacted our ability to manufacture and ship all the product for which we have demand, and these constraints may continue in the future.\nOur business in the recent past was impacted by interruptions in the supply chain, due in part to the COVID pandemic, a resumption of strong worldwide demand for electronic products and components across a number of end markets, and interruption in supplier operations. As a result, we experienced delivery delays and shortages of certain components and raw materials needed for many of the products we manufacture. Any such delays in the future would reduce our revenue and margins for the periods affected and would also result in an increase in our inventory of other components, which would reduce our operating cash flow.\nWe may not have sufficient resources to fund all future research and development and capital expenditures.\nIn order to remain competitive, we must make substantial investments in research and development of new or enhanced products and continuously upgrade our process technology and manufacturing capabilities. Our research and development efforts primarily involve engineering and design related to improving existing products and developing new products and technologies in the same or similar fields. We may be unable to fund all of our research and development and capital investment needs or possible strategic acquisitions of businesses or product lines. Our ability to raise additional capital will depend on a variety of factors, some of which will not be within our control, including the existence of bank and capital markets, investor perceptions of us, our businesses and the industries in which we operate, and general economic conditions. Failure to successfully raise needed capital or generate cash flow on a timely or cost-effective basis could have a material adverse effect on our business, results of operations and financial condition.\nWe may be unable to successfully introduce new and enhanced products in a timely and cost-effective manner or increase our participation in new markets, which could harm our profitability and prospects.\nOur operating results depend in part on our ability to introduce new and enhanced products on a timely basis. Some of our businesses are engaged in major development activities. If we fail to execute on these development activities in a timely manner, our business could be negatively impacted. Some products, especially those sold by our Test and Measurement group, have short lifecycles that require frequent updating and new product innovation. We may not be able to develop and introduce new or enhanced products in a timely and cost-effective manner or develop and introduce products that satisfy customer requirements.\nIncreasing competition could reduce the demand for our products and services.\nEach of our markets is highly competitive. Many of our competitors have, and potential competitors could have, greater name recognition, a larger installed base of products, more extensive engineering, manufacturing, marketing and distribution capabilities and greater financial, technological and personnel resources. New or existing competitors may also develop new technologies that could adversely affect the demand for our products and services. We have been experiencing increased competition for some of our key products. Furthermore, some of our patents have expired or are expiring, which could open up further competition. Additionally, some of our customers have been developing competing products or electing to vertically integrate and replace our products with their own.\nLow-cost competition from China and other developing countries could also result in decreased demand for our products. Increasing competition could reduce the volume of our sales or the prices we may charge, which would negatively impact our revenues. We are experiencing increasing competition in many of our businesses, especially our digital imaging and instrumentation businesses, from Chinese manufacturers that offer lower cost products with increasingly advanced technical capabilities.\nRisks Related to International Operations\nWe are subject to the risks associated with international sales and international operations, and events in those countries could harm our business or results of operations.\nIn 2024 and 2023, sales to customers outside the United States accounted for approximately 48% and 49% of total net sales, respectively. In both 2024 and 2023, we sold products to customers in over 100 foreign countries. In 2024, the top five countries for sales to international customers, ranked by net sales, were the United Kingdom, China, Germany, Japan and France and represented approximately 19% of our total net sales. We anticipate that future sales to international customers will continue to account for a significant and increasing percentage of our revenues.\nRisks associated with international sales and operations include, but are not limited to:\npolitical and economic instability, including the war between Ukraine and Russia, the conflict in ",
  "item2_clean": null
}