{
  "source_file": "tech-20250930x10q.htm",
  "form_type": "10-Q",
  "item1_clean": null,
  "item7_clean": null,
  "item2_clean": "2. MANAGEMENT'S DISCUSSION AND ANALYSIS OF FINANCIAL\nCONDITION AND RESULTS OF OPERATIONS\nOVERVIEW\nBio-Techne and its subsidiaries, collectively doing business as Bio-Techne Corporation (Bio-Techne, we, our, us or the Company) develop, manufacture and sell biotechnology reagents, instruments and services for the research and clinical diagnostic markets worldwide. With our deep product portfolio and application expertise, we sell integral components of scientific investigations into biological processes and molecular diagnostics, revealing the nature, diagnosis, etiology and progression of specific diseases. Our products aid in drug discovery efforts and provide the means for accurate clinical tests and diagnoses.\nWe are committed to providing the life sciences community with innovative, high-quality scientific tools that allow our customers to make extraordinary discoveries and treat and diagnose diseases. We intend to build on Bio-Techne’s past accomplishments, high product quality reputation and sound financial position by executing strategies that position us to serve as the standard for biological content in the research market, and to leverage that leadership position to enter the diagnostics and other adjacent markets. The Company’s strategic pillars for long-term growth and profitability are grow and leverage the core, capitalize on high potential markets, market expansion through innovation and acquisition, deliver best-in-class customer experience, and develop people through a transformative culture.\nOur Protein Sciences segment is a leading developer and manufacturer of high-quality purified proteins and reagent solutions, most notably cytokines and growth factors, antibodies, immunoassays, biologically active small molecule compounds, tissue culture reagents and T-Cell activation technologies. This segment also includes protein analysis solutions that offer researchers efficient and streamlined options for automated western blot and multiplexed ELISA workflow. Our Diagnostics and Spatial Biology segment develops and manufactures diagnostic products, including FDA-regulated controls, calibrators, blood gas and clinical chemistry controls and other reagents for OEM and clinical customers, as well as a portfolio of clinical molecular diagnostic oncology assays. This segment also manufactures and sells advanced tissue-based in-situ hybridization assays (ISH) for research and clinical use.\nRESULTS OF OPERATIONS\nConsolidated net sales for the quarter ended September 30, 2025 were $286.6 million, a decrease of 1% compared to the same prior year period. Organic revenue for the quarter ended September 30, 2025 decreased 1% compared to the prior year, with foreign currency exchange having a favorable impact of 1% and businesses held-for-sale having an unfavorable impact of 1%. Organic revenue for the quarter ended September 30, 2025 was primarily driven by favorable performance by our Diagnostics and Spatial Biology portfolio offset by volume pressure in our Protein Sciences segment.\nConsolidated gross margin for the quarter ended September 30, 2025 was 65.6% compared to 63.2% for the same prior year period. Excluding the impact of costs recognized upon the sale of acquired inventory, amortization of intangibles, stock-based compensation expense, restructuring and restructuring-related costs, and the impact of businesses held-for-sale, adjusted gross margin for the quarter ended September 30, 2025 was 70.2% compared to 69.5% for the quarter ended September 30, 2024. Fluctuations in consolidated gross margin and adjusted gross margin, as a percentage of sales, have primarily resulted from changes in product mix and a reduction in restructuring charges. We expect that, in the future, gross margins will continue to be impacted by the mix of our portfolio growing at different rates as well as future acquisitions.\n\nThe Diagnostics and Spatial Biology segment’s net sales for the quarter ended September 30, 2025 was $79.5 million, with a reported decrease of 4% compared to the same respective prior year period.\nOrganic revenue growth was 3% for the first quarter of fiscal 2026, with foreign currency exchange having an immaterial impact.\nAs of June 30, 2025, a business within the Diagnostics and Spatial Biology segment met the criteria as held-for-sale; this held-for-sale business has been excluded from the segment’s fiscal 2026 operating results and had an unfavorable impact of 7%.\nThe operating margin for the segment was 11.2% for the quarter ended September 30, 2025 compared to 5.1% in the comparative prior year period. The segment’s operating margin was favorably impacted by the Exosome Diagnostics divestiture and productivity initiatives.\nIncome taxes were at an effective rate of 20.4% of consolidated earnings for the quarter ended September 30, 2025, compared to 16.4% for the same respective prior year period. The change in the Company’s tax rate for the quarter ended September 30, 2025 was driven by the mix of net income.\nThe forecasted tax rate as of the first fiscal quarter of 2026 before discrete items is 26.5% compared to the prior year forecasted tax rate before discrete items of 23.6%. Excluding the impact of discrete items, the Company expects the consolidated income tax rate for the remainder of fiscal 2026 to range from 26% to 30%.\n\nDuring fiscal year 2022, the Company paid $25 million to enter into a two-part forward contract which requires the Company to purchase the full equity interest in Wilson Wolf if certain annual revenue or EBITDA thresholds are met. During fiscal year 2023, Wilson Wolf met the EBITDA target and the Company paid an additional $232 million to acquire 19.9% of Wilson Wolf. Since the first part of the forward contract has been triggered, the second part of the forward contract will automatically trigger, which requires the Company to acquire the remaining 80.1% of Wilson Wolf on December 31, 2027. The second part of the contract would be accelerated in advance of December 31, 2027 if Wilson Wolf meets certain financial milestones. As of September 30, 2025, the second milestones have not been met. The second option payment of approximately $1 billion plus potential contingent consideration is forecasted to occur between fiscal 2026 and fiscal 2028.\nManagement of the Company expects to be able to meet its cash and working capital requirements for operations, facility expansion, capital additions, and cash dividends for the foreseeable future, and at least the next 12 months, through currently available cash, cash generated from operations, and remaining credit available on its existing revolving line of credit.\nCash Flows From Operating Activities\nThe Company generated cash of $27.6 million from operating activities in the first quarter of fiscal 2026 compared to $63.9 million in the first quarter of fiscal 2025. The decrease from the prior year was primarily due to changes in the timing of cash payments on certain operating assets and liabilities.\nCash Flows From Investing Activities\nWe continue to make investments in our business, including capital expenditures.\nCapital expenditures for fixed assets for the first quarter of fiscal 2026 and 2025 were $5.4 million and $9.2 million, respectively. Capital expenditures for the remainder of fiscal 2026 are expected to be approximately $27 million. Capital expenditures are expected to be financed through currently available funds and cash generated from operating activities. Expected additions in fiscal 2026 are related to increasing capacity to meet expected sales growth across the Company.\nDuring the first quarter of fiscal 2026, the Company received $4.6 million for assets held-for-sale. There was no comparable activity in the first quarter of fiscal 2025.\nDuring the first quarter of fiscal 2025, the Company invested $15.0 million into Spear Bio. There was no comparable activity in the first quarter of fiscal 2026.\nDuring the first quarter of fiscal 2025, certificates of deposit reached maturity for $1.1 million. There was no comparable activity in the first quarter of fiscal 2026.\nThe Company received tax distributions of $1.4 million from its equity method investee during the first quarter of both fiscal 2026 and 2025.\nCash Flows From Financing Activities\nDuring the first quarter of fiscal 2026 and 2025, the Company paid cash dividends of $12.4 million and $12.7 million, respectively, to all common shareholders. On November 5, 2025, the Company announced the payment of a $0.08 per share cash dividend, or approximately $12.5 million, will be payable November 28, 2025 to all common shareholders of record on November 17, 2025.\nCash of $23.5 million and $25.1 million was received during the first quarter of fiscal 2026 and 2025, respectively, from the exercise of stock options.\n\nAdditionally, gains and losses from investments that are either isolated or cannot be expected to occur again with any predictability are excluded. The Company independently calculates a non-GAAP adjusted tax rate to be applied to the identified non-GAAP adjustments considering the impact of discrete items on these adjustments and the jurisdictional mix of the adjustments. In addition, the tax impact of other discrete and non-recurring charges which impact our reported GAAP tax rate are adjusted from net earnings. We believe these tax items can significantly affect the period-over-period assessment of operating results and not necessarily reflect costs and/or income associated with historical trends and future results.\nThe Company periodically reassesses the components of our non-GAAP adjustments for changes in how we evaluate our performance, changes in how we make financial and operational decisions, and considers the use of these measures by our competitors and peers to ensure the adjustments are still relevant and meaningful.\nReaders are encouraged to review the reconciliations of the adjusted financial measures used in management's discussion and analysis"
}