{
  "source_file": "tel-20250926x10k.htm",
  "form_type": "10-K",
  "item1_clean": "Human Capital Management\nWe have employees located throughout the world. As of fiscal year end 2025, we employed approximately 93,000 people worldwide, including 13,000 contract employees. Approximately 34,000 were in the Asia–Pacific region, 34,000 were in the EMEA region, and 25,000 were in the Americas region. Of our total employees, approximately 55,000 were employed in manufacturing. Our strong employee base, along with their commitment to uncompromising values, provides the foundation of our success.\nWe are governed by our core values of integrity, accountability, inclusion, teamwork, and innovation. They guide our decisions and our actions, both individually and as an organization. Additionally, our employees are responsible for upholding our purpose—to create a safer, sustainable, productive, and connected future. We track and report internally on key talent metrics including workforce demographics, critical role pipeline data, global diversity data, and engagement and inclusion indices. As part of its charter, the management development and compensation committee of our board of directors oversees our policies and practices related to the management of human capital resources including talent management, culture, global diversity, and inclusion.\nWe are committed to leveraging the skills and perspectives of a wealth of backgrounds and experiences, and building a workforce and supplier network that represents our global markets and the customers we serve. We strive to maintain a work environment where all employees are engaged, feel their differences are valued and mutually-respected, and believe that all opinions count. Our people reflect our customers and markets. Our employees work in over 50 countries and represent approximately 150 nationalities, and our total employee population is over 40% women.\nOur employee resource groups (“ERGs”) are company-sponsored, employee-led groups that focus on shared identities or experiences of employees. These groups apply those perspectives to create value for our company as a whole. The ERGs provide a space where employees can foster connections and develop in a supportive environment. As of fiscal year end 2025, we had eight ERGs—African Heritage, ALIGN (lesbian, gay, bisexual, transgender, and queer employees (LGBTQ+) and their allies), Asian Heritage, Latin Heritage, TE Veterans, TE Young Professionals, THRIVE (employees with mental, emotional, and physical disabilities and their allies), and Women in Networking—with over 12,000 members worldwide. Our ERGs welcome any employee interested in supporting their mission and participation is optional.\nOur annual employee engagement survey explores how employees feel about their experience at our company and enables us to develop tailored actions to enhance the working environment. Focused on measuring engagement, inclusion, well-being, and leadership effectiveness, this fully digital, enterprise-wide survey is available to all employees in 22 languages. In fiscal 2025, we had a participation rate of 88% and year over year improvement in all four indices of engagement, inclusion, well-being, and leadership effectiveness. Our engagement and inclusion\nscores were once again favorable when compared to external global manufacturing benchmark\nTraining and Development\nWe provide employees with a range of development programs, opportunities, skills, and resources, empowering them to unleash their potential. Also, we emphasize employee development and training to support engagement and retention. Our LEARN@TE platform supplements our talent development strategies. It is an online portal that enables employees to access instructor-led classroom or virtual courses and self-directed web-based courses. Strategy, execution, and talent (“SET”) leadership expectations, which focus on how we drive strategy, effectively execute, and build talent, are expectations of all employees and are embedded in all of our leadership programs. We integrate these behavioral expectations into the way we assess and select talent, manage performance, and develop and reward our people.\nWe are committed to identifying and developing our next generation of leaders. We have a robust talent and succession planning process, and we offer programs to support the development of leaders at all levels and those in critical roles, general management, engineering, and operations. We are focused on recruiting top candidates, developing employees at all levels, and providing opportunities for career advancement. On an annual basis, we conduct an organization and leadership review process with our Chief Executive Officer and all segment, business unit, and function leaders focusing on our high-performing and high-potential talent, globally diverse talent, and the succession for our most critical roles. Also, our\n\nITEM\n1. BUSINESS\nWe are a global industrial technology leader creating a safer, sustainable, productive, and connected future. As a trusted innovation partner, our broad range of connectivity and sensor solutions enable the distribution of power, signal, and data to advance next-generation transportation, energy networks, automated factories, data centers enabling artificial intelligence, and more. References in this report to “TE Connectivity,” the “Company,” “we,” “us,” or “our” refer to TE Connectivity Ltd. before September 30, 2024 and to TE Connectivity plc on or after September 30, 2024.\nWe became an independent, publicly traded company in 2007; however, through our predecessor companies, we trace our foundations in the connectivity business back to 1941.\nDuring fiscal 2024, our board of directors and shareholders approved a change in our jurisdiction of incorporation from Switzerland to Ireland. In connection with the change, TE Connectivity Ltd., our former parent entity, entered into a merger agreement with TE Connectivity plc, its then wholly-owned subsidiary and a public limited company incorporated under Irish law. Under the merger agreement, TE Connectivity Ltd. merged with and into TE Connectivity plc, which was the surviving entity, in order to effect our change in jurisdiction of incorporation from Switzerland to Ireland. The merger was completed on September 30, 2024, thereby changing our jurisdiction of incorporation from Switzerland to Ireland. Effective for fiscal 2025, we are organized under the laws of Ireland. We have not had and do not anticipate any material changes in our operations or financial results as a result of the merger and change in place of incorporation.\nWe acquired Richard Manufacturing Co. (“Richards Manufacturing”) in fiscal 2025. See Note 4 to the Consolidated Financial Statements for additional information regarding the acquisition.\nWe have a 52- or 53-week fiscal year that ends on the last Friday of September. Fiscal 2025, 2024, and 2023 ended on September 26, 2025, September 27, 2024, and September 29, 2023, respectively. Fiscal 2025, 2024, and 2023 were each 52 weeks in length. For fiscal years in which there are 53 weeks, the fourth fiscal quarter includes 14 weeks, with the next occurrence taking place in fiscal 2028.\nEffective for fiscal 2025, we reorganized our management and segments to align the organization around our current strategy. Prior period segment results have been recast to conform to the new segment structure. See additional information regarding our segments in Notes 1 and 20 to the Consolidated Financial Statements.\nWe now operate through two reportable segments: Transportation Solutions and Industrial Solutions. We believe our two segments served a combined market of approximately $200 billion as of fiscal year end 2025.\nOur net sales by segment as a percentage of our total net sales were as follows:\n\nTransportation Solutions\nThe Transportation Solutions segment is a leader in connectivity and sensor technologies. The primary products sold by the Transportation Solutions segment include terminals and connector systems and components, sensors, heat shrink tubing, relays, and application tooling. The Transportation Solutions segment’s products, which must withstand harsh conditions, are used in the following end markets:\nAutomotive (75% of segment’s net sales)—\nWe are one of the leading providers of advanced automobile connectivity solutions. The automotive industry uses our products in automotive technologies for body and chassis systems, convenience applications, driver information, infotainment solutions, miniaturization solutions, motor and powertrain applications, and safety and security systems. Hybrid and electronic mobility solutions include in-vehicle technologies, battery technologies, and charging solutions.\nCommercial transportation (15% of segment’s net sales)—\nWe deliver reliable connectivity products designed to withstand harsh environmental conditions for on- and off-highway vehicles and recreational transportation, including heavy trucks, construction, agriculture, buses, and other vehicles.\nSensors (10% of segment’s net sales)—\nWe offer a portfolio of intelligent, efficient, and high-performing sensor solutions that are used by customers across multiple industries, including automotive, industrial equipment, commercial transportation, medical solutions, aerospace and defense, and consumer applications.\nThe Transportation Solutions segment’s major competitors include Yazaki, Aptiv, Sumitomo, Sensata, Honeywell, Molex, and Amphenol.\nIndustrial Solutions\nThe Industrial Solutions segment is a leading supplier of products that connect and distribute power, data, and signals. The primary products sold by the Industrial Solutions segment include terminals and connector systems and components, interventional medical components, heat shrink tubing, relays, wire and cable, and filters. The Industrial Solutions segment’s products are used in the following end markets:\nDigital data networks (28% of segment’s net sales)—\nWe deliver products and solutions that are used in a variety of equipment architectures within the networking, data center, and wireless infrastructure industries. Additionally, we deliver a range of connectivity solutions for the Internet of Things, smartphones, tablet computers, virtual reality, and artificial intelligence/machine learning applications to help our customers meet their current challenges and future innovations.\nAutomation and connected living (27% of segment’s net sales)—\nOur products are used in factory and warehouse automation and process control systems such as industrial controls, robotics, human machine interface, industrial communication, and power distribution. Our building automation and smart city infrastructure products are used to connect lighting and offer solutions in HVAC, elevators/escalators, and security. Our rail products are used in high-speed trains, metros, light rail vehicles, locomotives, and signaling switching equipment. Additionally, we provide both standard products and custom-designed solutions to meet the daily demands of home appliances, including washers, dryers, refrigerators, air conditioners, dishwashers, cooking appliances, water heaters, air purifiers, floor care devices, and microwaves.\nAerospace, defense, and marine (19% of segment’s net sales)—\nWe design, develop, and manufacture a comprehensive portfolio of critical electronic components and systems for the harsh operating conditions of the commercial aerospace, defense, and marine industries. Our products and systems are designed and manufactured to operate effectively in harsh conditions ranging from the depths of the ocean to the far reaches of space.\nEnergy (17% of segment’s net sales)—\nOur products are used by electric power utilities, OEMs, and engineering procurement construction companies serving the electrical power grid and renewables industries. They include a wide range of insulation, protection, and connection solutions for electrical power generation, transmission, distribution, and industrial markets.\n\nMedical",
  "item7_clean": "We are a global industrial technology leader creating a safer, sustainable, productive, and connected future. As a trusted innovation partner, our broad range of connectivity and sensor solutions enable the distribution of power, signal, and data to advance next-generation transportation, energy networks, automated factories, data centers enabling artificial intelligence, and more.\nChange in Place of Incorporation\nDuring fiscal 2024, our board of directors and shareholders approved a change in our jurisdiction of incorporation from Switzerland to Ireland. In connection with the change, TE Connectivity Ltd., our former parent entity, entered into a merger agreement with TE Connectivity plc, its then wholly-owned subsidiary and a public limited company incorporated under Irish law. Under the merger agreement, TE Connectivity Ltd. merged with and into TE Connectivity plc, which was the surviving entity, in order to effect our change in jurisdiction of incorporation from Switzerland to Ireland. The merger was completed on September 30, 2024, thereby changing our jurisdiction of incorporation from Switzerland to Ireland. Effective for fiscal 2025, we are organized under the laws of Ireland. We have not had and do not anticipate any material changes in our operations or financial results as a result of the merger and change in place of incorporation.\nNew Segment Structure\nEffective for fiscal 2025, we reorganized our management and segments to align the organization around our current strategy. We now operate through two reportable segments: Transportation Solutions and Industrial Solutions. Prior period segment results have been recast to conform to the new segment structure. See additional information regarding our segments in Notes 1 and 20 to the Consolidated Financial Statements.\nSummary of Fiscal 2025 Performance\nOur fiscal 2025 net sales increased 8.9% from fiscal 2024 due to sales growth in the Industrial Solutions segment, partially offset by sales declines in the Transportation Solutions segment. Richards Manufacturing, which was acquired in April 2025, contributed net sales of $179 million. On an organic basis, our net sales increased 6.4% in fiscal 2025 as compared to fiscal 2024.\nOur net sales by segment were as follows:\nTransportation Solutions\n—Our net sales decreased 1.0% in fiscal 2025 due primarily to sales declines in the sensors and commercial transportation end markets.\nIndustrial Solutions\n—Our net sales increased 23.7% in fiscal 2025 as a result of sales growth in the digital data networks; energy; automation and connected living; and aerospace, defense, and marine end markets, partially offset by sales declines in the medical end market.\nWe paid cash dividends to shareholders of $2.72 per ordinary share in fiscal 2025. Also, in September 2025, our board of directors declared a regular quarterly cash dividend of $0.71 per ordinary share, payable on December 12, 2025, to shareholders of record on November 21, 2025.\nNet cash provided by operating activities was $4,139 million in fiscal 2025.\nOur business and operating results have been and will continue to be affected by worldwide economic conditions. The global economy has been impacted in recent years by supply chain disruptions, inflationary cost pressures, and, most recently, tariff and trade policies. We are monitoring the current environment and its potential effects on our customers and the end markets we serve.\nIn recent years, we have experienced inflationary cost pressures including increased costs for transportation, energy, and raw materials. However, we have been able to mitigate increased costs and supply chain disruptions through productivity and/or price increases. Also, we have taken and continue to focus on actions to manage costs, including restructuring and\n\nInterest payments exclude the impact of any interest rate swap and cross-currency swap contracts. Interest payments on debt are projected for future periods using rates in effect as of fiscal year end 2025 and are subject to change in future periods.\nOperating leases represents the undiscounted lease payments. See Note 11 to the Consolidated Financial Statements for additional information regarding leases.\nPurchase obligations consist primarily of commitments for purchases of goods and services.\nThe above table does not reflect unrecognized income tax benefits of $719 million and related accrued interest and penalties of $89 million, the timing of which is uncertain. See Note 15 to the Consolidated Financial Statements for additional information regarding unrecognized income tax benefits, interest, and penalties.\nThe above table does not reflect pension obligations to certain employees and former employees. We are obligated to make contributions to our pension plans; however, we are unable to determine the amount of plan contributions due to the inherent uncertainties of obligations of this type, including timing, interest rate charges, investment performance, and amounts of benefit payments. We expect to contribute approximately $70 million to pension plans in fiscal 2026, before consideration of any voluntary contributions. See Note 14 to the Consolidated Financial Statements for additional information regarding these plans and our estimates of future contributions and benefit payments.\nabove table does not reflect redeemable noncontrolling interests of $145 million associated with our First Sensor AG (“First Sensor”) subsidiary. Noncontrolling interest holders can elect either (1) to remain First Sensor noncontrolling interest shareholders and receive recurring annual compensation of €0.56 per First Sensor share or (2) to put their First Sensor shares in exchange for compensation of €33.27 per First Sensor share. The ultimate amount and timing of any future cash payments is uncertain. See Note 17 to the Consolidated Financial Statements for additional information regarding redeemable noncontrolling interests\nIn the normal course of business, we are subject to various legal proceedings and claims, including patent infringement claims, product liability matters, employment disputes, disputes on agreements, other commercial disputes, environmental matters, antitrust claims, trade compliance matters, and tax matters, including non-income tax matters such as value added tax, sales and use tax, real estate tax, and transfer tax. Although it is not feasible to predict the outcome of these proceedings, based upon our experience, current information, and applicable law, we do not expect that the outcome of these proceedings, either individually or in the aggregate, will have a material effect on our results of operations, financial position, or cash flows.\nCritical Accounting Policies and Estimates\nThe preparation of the Consolidated Financial Statements in conformity with GAAP requires management to make estimates and assumptions that affect the reported amounts of assets and liabilities, the disclosure of contingent assets and liabilities, and the reported amounts of revenue and expenses. Our significant accounting policies are summarized in Note 2 to the Consolidated Financial Statements. We believe the following accounting policies are the most critical as they require significant judgments and assumptions that involve inherent risks and uncertainties. Management’s estimates are based on the relevant information available at the end of each period.\nWe account for revenue in accordance with Accounting Standards Codification (“ASC”) 606,\nRevenue from Contracts with Customers\n. Our revenues are generated principally from the sale of our products. Revenue is recognized as performance obligations under the terms of a contract, such as a purchase order with a customer, are satisfied; generally this occurs with the transfer of control. We transfer control and recognize revenue when we ship product to our customers, the customers accept and have legal title for the product, and we have a right to payment for such product. Revenue is measured as the amount of consideration that we expect to receive in exchange for those products and excludes taxes assessed by governmental authorities and collected from customers concurrent with the sale of products. Shipping and handling costs are treated as fulfillment costs and are included in cost of sales. Since we typically invoice our customers when we satisfy our performance obligations, we do not have material contract assets or contract liabilities. Our credit terms are customary and do not contain significant financing components that extend beyond one year of fulfillment of performance obligations. We apply the practical expedient of ASC 606 with respect to financing components and do not evaluate contracts in which payment is due within one year of satisfaction of the related performance obligation. Since our performance obligations to deliver products are part of contracts that generally have original durations of one year or less, we have elected to use the\n\ncertain deferred tax assets, which arise from temporary differences between the income tax return and financial statement recognition of revenue and expense.\nIn evaluating our ability to recover our deferred tax assets, we consider all available positive and negative evidence including our past operating results, the existence of cumulative losses in the most recent years, and our forecast of taxable income. In estimating future taxable income, we develop assumptions including the amount of pre-tax operating income in various tax jurisdictions, the reversal of temporary differences, and the implementation of feasible and prudent tax planning strategies. These assumptions require significant judgment about the forecasts of taxable income and are consistent with the plans and estimates we are using to manage the underlying businesses.\nWe currently have recorded significant valuation allowances that we intend to maintain until it is more likely than not the deferred tax assets will be realized. Our income tax expense recorded in the future will be reduced to the extent of decreases in our valuation allowances. The realization of our remaining deferred tax assets is dependent primarily on future taxable income in the appropriate jurisdictions. Any reduction in future taxable income including any future restructuring activities may require that we record an additional valuation allowance against our deferred tax assets. An increase in the valuation allowance would result in additional income tax expense in such period and could have a significant impact on our future earnings.\nChanges in tax laws and rates also could affect recorded deferred tax assets and liabilities in the future. Management is not aware of any enacted changes that would have a material effect on our results of operations, financial position, or cash flows.\nThe calculation of our tax liabilities includes estimates for uncertainties in the application of complex tax regulations across multiple global jurisdictions where we conduct our operations. Under the uncertain tax position provisions of ASC 740,\n, we recognize liabilities for tax and related interest for issues in tax jurisdictions based on our estimate of whether, and the extent to which, additional taxes and related interest will be due. These tax liabilities and related interest are reflected net of the impact of related tax loss carryforwards, as such tax loss carryforwards will be applied against these tax liabilities and will reduce the amount of cash tax payments due upon the eventual settlement with the tax authorities. These estimates may change due to changing facts and circumstances. Due to the complexity of these uncertainties, the ultimate resolution may result in a settlement that differs from our current estimate of the tax liabilities and related interest. These tax liabilities and related interest are recorded in income taxes and accrued and other current liabilities on the Consolidated Balance Sheets.\nOur defined benefit pension plan expense and obligations are developed from actuarial assumptions. The funded status of our plans is recognized on the Consolidated Balance Sheets and is measured as the difference between the fair value of plan assets and the projected benefit obligation at the measurement date. The projected benefit obligation represents the actuarial present value of benefits projected to be paid upon retirement factoring in estimated future compensation levels. The fair value of plan assets represents the current market value of cumulative company and participant contributions made to irrevocable trust funds, held for the sole benefit of participants, which are invested by the trustees of the funds. The benefits under our defined benefit pension plans are based on various factors, such as years of service and compensation.\nNet periodic pension benefit cost is based on the utilization of the projected unit credit method of calculation and is charged to earnings on a systematic basis over the expected average remaining service lives of current participants, or, for inactive plans, over the remaining life expectancy of participants.\nTwo critical assumptions in determining pension expense and obligations are discount rates and expected long-term returns on plan assets. We evaluate these assumptions at least annually. Other assumptions reflect demographic factors such as retirement, mortality, and employee turnover. These assumptions are evaluated periodically and updated to reflect our actual experience. Actual results may differ from actuarial assumptions. Discount rates represent the market rate for high-quality fixed income investments and are used to calculate the present value of the expected future cash flows for benefit obligations to be paid under our pension plans. A decrease in discount rates increases the present value of pension benefit obligations. At fiscal year end 2025, a 25-basis-point decrease in discount rates would have increased the present value of our pension obligations by $63 million; a 25-basis-point increase would have decreased the present value of our pension obligations by $60 million. We consider the current and expected asset allocations of our pension plans, as well as historical and expected long-term rates of return on those types of plan assets, in determining the expected long-term rates of return on\n\nplan assets. A 50-basis-point decrease or increase in the expected long-term returns on plan assets would have increased or decreased, respectively, our fiscal 2025 pension expense by $9 million.\nAt fiscal year end 2025, the long-term target asset allocation in our U.S. plans’ master trust is 25% return-seeking assets and 75% liability-hedging assets. Asset re-allocation to meet that target is occurring over a multi-year period based on the funded status. We expect to reach our target allocation when the funded status of the plans exceeds 110%. Based on the funded status of the plans as of fiscal year end 2025, our target asset allocation is 67% return-seeking and 33% liability-hedging.\nAccounting Pronouncements\nSee Note 2 to the Consolidated Financial Statements for information regarding recently issued and adopted accounting pronouncements.\nNon-GAAP Financial Measure\nOrganic Net Sales Growth (Decline)\nWe present organic net sales growth (decline) as we believe it is appropriate for investors to consider this adjusted financial measure in addition to results in accordance with GAAP. Organic net sales growth (decline) represents net sales growth (decline) (the most comparable GAAP financial measure) excluding the impact of foreign currency exchange rates, and acquisitions and divestitures that occurred in the preceding twelve months, if any. Organic net sales growth (decline) is a useful measure of our performance because it excludes items that are not completely under management’s control, such as the impact of changes in foreign currency exchange rates, and items that do not refl",
  "item2_clean": null
}