{
  "source_file": "tel-20250627x10q.htm",
  "form_type": "10-Q",
  "item1_clean": null,
  "item7_clean": null,
  "item2_clean": "Forward-Looking Information\nForward-looking statements involve risks, uncertainties, and assumptions. Actual results may differ materially from those expressed in these forward-looking statements. Investors should not place undue reliance on any forward-looking statements. We do not have any intention or obligation to update forward-looking statements after we file this report except as required by law.\nconditions in the global or regional economies and global capital markets, and cyclical industry conditions, including recession, inflation, tariffs, and higher interest rates;\nconditions affecting demand for products in the industries we serve, particularly the automotive industry;\nrisk of future goodwill impairment;\npricing pressure and competition, including competitive risks associated with the pace of technological change;\nmarket acceptance of our new product introductions and product innovations and product life cycles;\nraw material availability, quality, and cost;\nproduct liability, warranty, and product recall claims and our ability to defend such claims;\nfluctuations in foreign currency exchange rates and impacts of offsetting hedges;\nfinancial condition and consolidation of customers and vendors;\nreliance on third-party suppliers;\nrisks associated with current and future acquisitions and divestitures;\nglobal risks of business interruptions due to natural disasters or other disasters which have impacted and could continue to negatively impact our results of operations as well as customer behaviors, business, and manufacturing operations as well as our facilities and the facilities of our suppliers, and other aspects of our business;\nglobal risks of political, economic, and military instability, including the continuing military conflicts in certain parts of the world, and volatile and uncertain economic conditions and the evolving regulatory system in China;\n\nrisks associated with cybersecurity incidents and other disruptions to our information technology infrastructure, including as a result of artificial intelligence;\nrisks related to compliance with current and future environmental and other laws and regulations, including those related to climate change;\nrisks related to the increasing scrutiny and expectations regarding environmental, social, and governance matters;\nrisks associated with compliance with applicable antitrust or competition laws or applicable trade regulations;\nour ability to protect our intellectual property rights;\nrisks of litigation, regulatory actions, and compliance issues;\nour ability to operate within the limitations imposed by our debt instruments;\nthe possible effects on us of various non-U.S. and U.S. legislative proposals and other initiatives that could materially increase our worldwide corporate effective tax rate, increase global cash taxes, and negatively impact our U.S. government contracts business;\nrequirements related to chemical usage, hazardous material content, recycling, and other circular economy initiatives;\nvarious risks associated with being an Irish corporation;\nthe impact of fluctuations in the market price of our shares; and\nthe impact of certain provisions of our articles of association on unsolicited takeover proposals.\nThere may be other risks and uncertainties that we are unable to predict at this time or that we currently do not expect to have a material adverse effect on our business.\n\nIn certain instances, we have guaranteed the performance of third parties and provided financial guarantees for uncompleted work and financial commitments. The terms of these guarantees vary with end dates ranging from fiscal 2025 through the completion of such transactions. The guarantees would be triggered in the event of nonperformance, and the potential exposure for nonperformance under the guarantees would not have a material effect on our results of operations, financial position, or cash flows.\nIn disposing of assets or businesses, we often provide representations, warranties, and/or indemnities to cover various risks including unknown damage to assets, environmental risks involved in the sale of real estate, liability for investigation and remediation of environmental contamination at waste disposal sites and manufacturing facilities, and unidentified tax liabilities and legal fees related to periods prior to disposition. We do not expect that these uncertainties will have a material adverse effect on our results of operations, financial position, or cash flows.\nAt June 27, 2025, we had outstanding letters of credit, letters of guarantee, and surety bonds of $217 million.\n\nITEM\n2. MANAGEMENT’S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS\nOur Condensed Consolidated Financial Statements have been prepared in United States (“U.S.”) dollars, in accordance with accounting principles generally accepted in the U.S. (“GAAP”).\nThe following discussion includes organic net sales growth (decline) which is a non-GAAP financial measure. See “Non-GAAP Financial Measure” for additional information regarding this measure.\nTE Connectivity plc (“TE Connectivity” or the “Company,” which may be referred to as “we,” “us,” or “our”) is a global industrial technology leader creating a safer, sustainable, productive, and connected future. Our broad range of connectivity and sensor solutions enable the distribution of power, signal, and data to advance next-generation transportation, energy networks, automated factories, data centers, medical technology, and more.\nChange in Place of Incorporation\nAt the beginning of fiscal 2025, our jurisdiction of incorporation changed from Switzerland to Ireland. We do not anticipate any material changes in our operations or financial results as a result of the change in place of incorporation. See additional information in Note 1 to the Condensed Consolidated Financial Statements.\nNew Segment Structure\nEffective for fiscal 2025, we reorganized our management and segments to align the organization around our current strategy. We now operate through two reportable segments: Transportation Solutions and Industrial Solutions. Prior period segment results have been recast to conform to the new segment structure. See additional information in Note 1 to the Condensed Consolidated Financial Statements.\nSummary of Performance\nOur net sales increased 13.9% in the third quarter of fiscal 2025 due to sales growth in the Industrial Solutions segment and, to a lesser degree, the Transportation Solutions segment. In the first nine months of fiscal 2025, our net sales increased 6.2% due to sales growth in the Industrial Solutions segment, partially offset by sales declines in the Transportation Solutions segment. Richards Manufacturing Co. (“Richards Manufacturing”), which was acquired in April 2025, contributed net sales of $73 million. On an organic basis, our net sales increased 9.1% and 4.8% in the third quarter and first nine months of fiscal 2025, respectively, as compared to the same periods of fiscal 2024.\nOur net sales by segment were as follows:\nTransportation Solutions\n—Our net sales increased 2.8% in the third quarter of fiscal 2025 due primarily to sales increases in the automotive end market and, to a lesser degree, the commercial transportation end market. In the first nine months of fiscal 2025, our net sales declined 2.5% as a result of sales declines in all end markets.\n\nIndustrial Solutions\n—Our net sales increased 30.0% and 19.7% in the third quarter and first nine months of fiscal 2025, respectively, as a result of sales growth in the digital data networks; energy; aerospace, defense, and marine; and automation and connected living end markets, partially offset by sales declines in the medical end market.\nIn June 2025, our board of directors declared a regular quarterly dividend of $0.71 per ordinary share, payable on September 12, 2025, to shareholders of record on August 22, 2025.\nNet cash provided by operating activities was $2,718 million in the first nine months of fiscal 2025.\nWe acquired Richards Manufacturing, a U.S.-based producer of overhead and underground electrical and gas distribution products, in the third quarter of fiscal 2025.\nIn the fourth quarter of fiscal 2025, we expect our net sales to be approximately $4.55 billion, as compared to $4.07 billion in the fourth quarter of fiscal 2024. This increase is due primarily to sales growth in the Industrial Solutions segment, which will benefit from the recently completed acquisition of Richards Manufacturing. In the fourth quarter of fiscal 2025, we expect diluted earnings per share from continuing operations to be approximately $2.18 per share. This outlook reflects the positive impact of foreign currency exchange rates on net sales and earnings per share of approximately $111 million and $0.03 per share, respectively, in the fourth quarter of fiscal 2025 as compared to the same period of fiscal 2024 and includes the impact of currently enacted tariffs which we expect to largely mitigate through pricing actions and sourcing changes. Also, this outlook is based on foreign currency exchange rates and commodity prices that are consistent with current levels.\nAs discussed above, on April 1, 2025, we acquired 100% of Richards Manufacturing for cash of approximately $2.3 billion, net of cash acquired. The acquired business has been reported as part of the energy business within our Industrial Solutions segment from the date of acquisition.\nDuring the first nine months of fiscal 2025, we acquired two additional businesses for a combined cash purchase price of $321 million, net of cash acquired. The acquired businesses have been reported as part of our Industrial Solutions segment from the date of acquisition.\nSee Note 3 to the Condensed Consolidated Financial Statements for additional information regarding acquisitions.\nResults of Operations\nThe following table presents our net sales and the percentage of total net sales by segment:\n\nNet sales increased $"
}