{
  "source_file": "ter-20241231.htm",
  "form_type": "10-K",
  "item1_clean": null,
  "item7_clean": "We are a leading global supplier of automated test equipment and robotics products. We design, develop, manufacture and sell automated test systems and robotics products. Our automated test systems are used to test semiconductors, wireless products, data storage and complex electronics systems in many industries including consumer electronics, wireless, automotive, industrial, computing, communications, and aerospace and defense industries. Our Robotics products include collaborative robotic arms and autonomous mobile robots (“AMRs”) used by global manufacturing, logistics and industrial customers to improve quality, increase manufacturing and material handling efficiency and decrease manufacturing and logistics costs. Our automated test equipment and robotics products and services include:\n\nThe global supply shortage of electrical components, including semiconductor chips, impacted our supply chain in the first half of 2023. In the second half of 2023 and the full year of 2024, we saw improvements related to supply constraints and, consequently, did not experience material increases in our lead times and costs for components. In addition, in 2023 and 2024, inflationary pressures contributed to increased costs for product components and wage inflation, which had a minimal impact on our cost of products, gross margin and profit for the year. While our businesses could be impacted by supply constraints in the future, we do not anticipate supply chain constraints will have a material impact on our financial results in 2025.\n\nThe increase in income before income taxes in Semiconductor Test was driven primarily by higher tester sales for computing, ADAS, and memory applications, partially offset by lower tester sales for legacy automotive application. The decrease in income before income taxes in Robotics was primarily driven by continued weakness in the Industrial Automation market and softer sales in Universal Robots along with higher selling and administrative costs. The decrease in income before income taxes in All Other was driven primarily by a decrease in sales of Wireless Test products.\n\nIn November 2023, the Financial Accounting Standards Board (\"FASB\") issued Accounting Standard Update (\"ASU\") No. 2023-07,\n\"Segment Reporting (Topic 280): Improvements to Reportable Segment Disclosures\"\n, which requires us to disclose significant segment expenses and other segment items used by the Chief Operating Decision Maker (\"CODM\") on an annual and interim basis as well as provide in interim periods all disclosures about a reportable segment’s profit or loss and assets that are currently required annually. Additionally, we are required to disclose the title and position of the CODM. We retrospectively adopted and complied with this standard for the annual period ending December 31, 2024. See Note U: \"Segment, Geographic and Significant Customer Information.\" The adoption of this standard had no impact on our results of operations, cash flows or financial condition.\n\nWe have identified the policies and estimates discussed below as critical to understanding our business and our results of operations and financial condition. The impact and any associated risks related to these estimates on our business operations is discussed throughout Management’s Discussion and Analysis of Financial Condition and Results of Operations where such policies affect our reported and expected financial results. For a full description of our accounting policies related to the below items refer to Note B. Accounting Policies, included in the Notes to Consolidated Financial Statements in this Annual Report.\n\nWe are subject to numerous United States and foreign laws and regulations, including, without limitation, tariffs, trade sanctions, trade barriers, trade embargoes, regulations relating to import-export control, technology transfer restrictions, and other laws and regulations. Additionally, United States and foreign governmental authorities have taken, and may continue to take, administrative, legislative or regulatory action that could impact our operations. We believe that our operations are in material compliance with applicable trade regulations. The costs we incurred in complying with applicable trade regulations for the year ended December 31, 2024 were not material, and we do not currently expect the cost of complying with existing trade laws and regulations to have a material adverse effect on our capital expenditures or earnings or on our competitive position in any one year. It is possible, however, that future developments, including changes in laws and regulations or government policies, could lead to material costs, and such costs may have a material adverse effect on our future business or prospects.\n\nDuring the year ended December 31, 2023, we recorded a charge of $14.7 million of severance charges related to headcount reductions of 215 people primarily in Semiconductor Test and Robotics, which included charges related to a voluntary early retirement program for employees meeting certain conditions, $3.1 million of acquisition and divestiture expenses related to the Technoprobe transaction, a $1.5 million contract termination charge, and a charge of $1.1 million for an increase in environmental liabilities.\n\nThe increase in Semiconductor Test revenues of $166.7 million, or 8.5%, was driven primarily by higher tester sales for computing, ADAS, and memory applications, partially offset by lower tester sales for legacy automotive applications. The decrease in Robotics revenues of $10.4 million, or 2.8%, was driven primarily by continued weakness in the Industrial Automation market and softer sales in Universal Robots.\n\nCritical accounting estimates are complex and may require significant judgment by management. Changes to the underlying assumptions may have a material impact on our financial condition and results of operations. These estimates may change, as new events occur, and additional information is obtained. Actual results could differ significantly from these estimates under different assumptions or conditions.\n\nThe decrease in operating liabilities was due to a $57.2 million decrease in deferred revenue and customer advance payments, a $26.9 million decrease in income taxes, a $21.2 million decrease in accrued employee compensation, and $5.5 million of retirement plan contributions, partially offset by a $45.0 million increase in accounts payable, and a $23.0 million increase in other accrued liabilities.\n\nOur product revenues increased $198.6 million, or 9.5%, primarily driven by higher tester sales for computing, ADAS, and memory applications, partially offset by lower tester sales for legacy automotive application. Our service revenues decreased $55.1 million, or 9.5%, primarily in Semiconductor Test related to the sale of the DIS business on May 27, 2024.\n\nThe decrease in operating liabilities was due to a $48.2 million decrease in accounts payable, a $6.2 million decrease in other accrued compensation, $5.8 million of retirement plan contributions, and a $3.6 million decrease in income taxes, partially offset by a $12.2 million increase in deferred revenue and customer advance payments.\n\nAt our annual meeting of stockholders held May 21, 2013, our stockholders approved an amendment to the 2006 Equity Plan to increase the number of shares issuable thereunder by 10.0 million, for an aggregate of 32.0 million shares issuable thereunder, and our stockholders also approved an amendment to our 1996 Employee Stock Purchase Plan to increase the number of shares issuable thereunder by 5.0 million, for an aggregate of 30.4 million shares issuable thereunder. At our annual meeting of stockholders held May 12, 2015, our stockholders approved an amendment to the 2006 Equity Plan to extend its term until May 12, 2025. At our annual meeting of stockholders held May 7, 2021, our stockholders approved an amendment to our 1996 Employee Stock Purchase Plan to increase the number of shares issuable thereunder by 3.0 million, for an aggregate of 33.4 million shares issuable thereunder.\n\nThe decrease in operating assets was due to a $71.0 million decrease in accounts receivable due to lower sales and a $5.3 million decrease in inventories, partially offset by a $43.1 million increase in prepayments and other assets due to prepayments to our contract manufacturers.\n\nOn May 1, 2020, we entered into a credit agreement providing a three-year, senior secured revolving credit facility of $400 million. On December 10, 2021, the credit agreement was amended to extend the senior secured revolving credit facility to December 10, 2026. On October 5, 2022, the credit agreement was amended to increase the amount of the credit facility to $750.0 million from $400.0 million. On November 7, 2023, the Credit Agreement was amended to allow for the purchase of the shares of Technoprobe. On May 16, 2024, we borrowed $185.0 million under the credit agreement to partially fund the acquisition of 10% of the issued and outstanding shares of Technoprobe. We fully repaid our borrowings on the revolving credit facility prior to December 31, 2024. As of February 20, 2025, there are no outstanding borrowings under the credit facility.\n\nThe decrease in operating assets was primarily due to a decrease in other assets and inventory of $119.5 million and $8.7 million respectively, partially offset by a $52.7 million increase in accounts receivable, driven by higher sales at year-end.\n\nIn November 2024, the FASB issued ASU 2024-03-\n\"Income Statement - Reporting Comprehensive Income -Expense Disaggregation Disclosures (Subtopic 220-40): Disaggregation of Income Statement Expenses\"\n, which requires disclosure of additional expense information on an annual and interim basis, including the amounts of inventory purchases, employee compensation, depreciation and intangible amortization included within each income statement expense caption. This standard is effective for fiscal years beginning after December 15, 2026, and interim periods within fiscal years beginning after December 15, 2027, with early adoption permitted. The amendments in this update should be applied on a prospective basis, but retrospective application is permitted. We are currently evaluating the impact of this new standard.\n\nThe increase of $39.7 million in selling and administrative expenses was primarily due to higher sales and marketing spending in Semiconductor Test.\n\nThe increase of $42.8 million in engineering and development expenses was primarily due to higher spending in Semiconductor Test.\n\nManagement’s Discussion and Analysis of Financial Condition and Results of Operations\n\nIn accordance with ASC 606, “\nRevenue from Contracts with Customers” (“ASC 606”)\n, we recognize revenues, when or as control is transferred to a customer. Our determination of revenue requires judgment in the determination of performance obligations and allocation of the transaction price to performance obligations. We often sell bundled orders that include both product and services or multiple different products within the same order. We evaluate each of the deliverables to determine if it meets the definition of a performance obligation, which requires that it is capable of being distinct and distinct within the context of the contract. This determination is based on an assessment of contractual rights of the contract and the ability of the performance obligation to perform on its own or with readily available resources. In bundled transactions we estimate the standalone selling price of each identified performance obligation and use that estimate to allocate the transaction price among said performance obligations. The estimated standalone selling price is determined using all information reasonably available to us, including standalone transactions, market information and other observable inputs.\n\nWe assess goodwill for impairment at least annually in the fourth quarter, as of December 31, on a reporting unit basis, or more frequently, when events and circumstances occur indicating that the recorded goodwill may be impaired. We review intangible and long-lived assets for impairment whenever events or changes in business circumstances indicate that the carrying amount of the assets may not be fully recoverable or that the useful lives of these assets are no longer appropriate. Goodwill impairment will be the amount by which a reporting unit’s carrying value exceeds its fair value, not to exceed the carrying amount of goodwill. Impairment of intangible and long-lived assets would result in the asset being written down to its estimated fair value. The calculated fair value of a reporting unit or intangible or long-lived asset is dependent upon discounted cash flow (“DCF”) models, discount rates, and market multiples. DCF models rely on our forecasted mid-term plans which are subjective based on customer or market conditions and can change materially. We utilize third party specialists when determining discount rates and selected market multiples. A change in any of these key assumptions could result in a reporting unit, intangible asset, or long-lived asset being impaired in a future period.\n\nThe decrease in the effective tax rate from 2023 to 2024 is primarily attributable to a shift in the geographic distribution of income which resulted in a reduction in income in higher tax rate foreign jurisdictions, the benefit of the release of reserves for uncertain tax positions as a result of the expiration of statute and a decrease in non-deductible officer’s compensation. These decreases in expense were partially offset by reductions in benefits from foreign tax credits, U.S research and development credits and the U.S. foreign derived intangible income deduction.\n\nWe account for investments using the equity method of accounting when it has significant influence over the financial and operating policies, but not control, of the investee. The equity method investments are initially recorded at cost and included in the 'Equity method investment' in the consolidated balance sheet. We record our share of investee's net income or loss and other comprehensive income, and the amortization of equity method basis difference, calculated as the difference between the investment and the amount of underlying equity in net assets acquired, on a 3-month lag, which is applied consistently from period to period. Our share of investee's net income and the amortization of equity method basis difference are reported in 'Equity in net earnings of affiliate' in the consolidated statement of operations. We include our share of investee's other comprehensive income and a cumulative translation adjustment in the consolidated statements of comprehensive income. We monitor on an ongoing basis its equity method investments for indicators of other-than-temporary declines in fair value below carrying value.\n\nThe purpose of the 2006 Equity Plan is to motivate employees, officers and directors by providing equity ownership and compensation opportunities in Teradyne. The aggregate number of shares available under the 2006 Equity Plan as of December 31, 2024 was 3,638,237 shares of our common stock. The 2006 Equity Plan authorizes the grant of stock-based awards in the form of (1) non-qualified and incentive stock options, (2) stock appreciation rights, (3) restricted stock awards and restricted stock unit awards, (4) phantom stock, and (5) other stock-based awards. Awards may be tied to time-based vesting schedules and/or performance-based vesting measured by reference to performance criteria chosen by the Compensation Committee of the Board of Directors, which administers the 2006 Equity Plan. Awards may be made to any employee, officer, consultant and advisor of Teradyne and our subsidiaries, as well as to our directors. The maximum number of shares of stock-based awards that may be granted to one participant during any one fiscal year is",
  "item2_clean": null
}