{
  "source_file": "tfc-20250930.htm",
  "form_type": "10-Q",
  "item1_clean": null,
  "item7_clean": null,
  "item2_clean": "Goodwill and intangible assets, net of deferred taxes\nTangible common equity\nCommon shares outstanding at end of period\nTangible common equity is a non-GAAP measure that excludes the impact of intangible assets, net of deferred taxes. This measure is useful for evaluating the performance of a business consistently, whether acquired or developed internally. Truist’s management uses this measure to assess balance sheet risk and shareholder value.\nTotal shareholders’ equity was $65.6 billion at September 30, 2025, an increase of $2.0 billion from December 31, 2024. This increase includes $4.0 billion in net income and $1.8 billion in OCI, partially offset by $2.3 billion in common and preferred dividends and $1.8 billion in common share repurchases, including excise taxes. For the third quarter of 2025, the dividend payout ratio was 50% and the total payout ratio was 87%. Truist’s book value per common share at September 30, 2025 was $46.70, compared to $43.90 at December 31, 2024. Truist’s TBVPS of $32.57 at September 30, 2025, increased 8.5% compared to December 31, 2024.\nTruist Financial Corporation 67\nTruist seeks to maintain a comprehensive risk management framework supported by people, processes, and systems to identify, measure, monitor, manage, and report significant risks arising from its exposures and business activities. A key objective of the Company’s risk management framework is to promote the execution of strategic goals and objectives in alignment with its risk appetite.\nTruist is committed to fostering a culture that supports the identification and escalation of risks across the organization. All teammates are responsible for upholding the Company’s purpose, mission, and values, and are encouraged to speak up if there is any activity or behavior that is inconsistent with the Company’s culture. The Truist code of ethics influences the Company’s decision making and informs teammates on how to act in the absence of specific guidance.\nTruist seeks an appropriate return for the risk taken in its business operations. Risk-taking activities must be evaluated and prioritized to identify those that present attractive risk-adjusted returns, while preserving asset value and capital.\nMarket risk is the risk to current or anticipated earnings, capital, or economic value arising from changes in interest rates, spreads, or prices of financial instruments, and the corresponding impact on the composition of the balance sheet or trading and fair value positions. Market risk results from changes in the level, volatility, or correlations among financial market risk factors or prices, including interest rates, credit spreads, foreign exchange rates, equity, and commodity prices.\nTruist’s most significant market risk exposure is to interest rate risk in its balance sheet; however, market risk also results from underlying product liquidity risk, price risk, and volatility risk of instruments held in Truist’s business units. Interest rate risk results from: differences between the timing of rate changes and the timing of cash flows associated with assets and liabilities (re-pricing risk); changing rate relationships among different yield curves affecting bank activities (basis risk); changing rate relationships across the spectrum of maturities (yield curve risk); and interest-related options inherently embedded in bank products (options risk).\nThe primary objectives of market risk management are to minimize adverse effects from changes in market risk factors on net interest income, net income, and capital, and to offset the risk of price changes for certain assets and liabilities recorded at fair value. At Truist, market risk management also includes the enterprise-wide IPV function.\nInterest Rate Market Risk\nAs a financial institution, Truist is exposed to interest rate risk from assets, liabilities, and off-balance sheet positions. Truist primarily monitors this risk through two measurement types, (i) NII at risk and (ii) economic value of equity. Truist manages this risk with securities, derivatives, and broader asset liability management activities. Truist uses derivatives to hedge interest income variability of floating rate loans and to hedge valuation changes of long-term debt and investment securities.\nIRR measurement is reported monthly through the ALCO. Monthly IRR reporting includes exposure and historical trends relative to risk limit scenarios, impacts to a wide range of rate scenarios, and sensitivity tests of key assumptions. IRR reporting is provided to the BRC quarterly.\nIRR measurement is influenced by data, assumptions, and models. Due to their high sensitivity to market rates, mortgage (loan and security) prepayments leverage an industry model that results in varying prepayment speeds across rate scenarios. Prepayments for non-mortgage loans leverage a mix of dynamic models (varying results based on market rates) and static prepayment assumptions based on historical experience. Our analysis incorporates dynamic client deposit balance levels, the mix across product types, and deposit rate paid across alternate rate scenarios based on modeled changes in client and bank behavior. The use of dynamic deposit balance models results in rotation to higher cost funding products (e.g., CDs) when market rates increase and to lower cost funding products (e.g., non-maturity deposits) when market rates decrease. The use of dynamic rate paid models results in varying deposit betas based on the timing and conditions within market rate cycles.\n68 Truist Financial Corporation\nNII at risk measures the change in NII under alternate interest rate scenarios relative to Truist’s baseline scenario, which incorporates Truist’s current balance sheet and off-balance sheet hedges as well as expectations for new business over the forecast horizon. Truist’s baseline scenario relies on assumptions including expectations of the economy and interest rates – which are influenced by market conditions, new business volume, pricing, and client behavior. In measuring NII at risk, Truist assumes that changes in key factors, such as prepayments and deposit pricing (betas), largely move in line with those it has experienced in prior rate cycles. However, future behavior of key factors may vary from Truist’s assumptions. NII at risk measurement assumes, when applicable, that U.S. interest rates floor at zero and Truist does not take any balance sheet or hedging actions in response to the rate scenarios.\nTruist evaluates a wide range of alternate scenarios including instantaneous and gradual as well as parallel and non-parallel changes in interest rates. The table below presents the estimated change to NII over the following 12 months for select parallel alternate scenarios, expressed as a percentage change relative to baseline NII.\nTable 18: Interest Sensitivity Simulation Analysis\nUp 200bps gradual change in interest rates\nUp 50bps instantaneous change in interest rates\nDown 50bps instantaneous change in interest rates\nDown 200bps gradual change in interest rates\nTruist performs and monitors sensitivity tests of key assumptions used in NII risk including:\nAsset prepayment speeds\nNew loan volume pricing spreads\nInterest-bearing deposit betas\nNon-interest-bearing demand deposit balance runoff, replaced by market funding\nEVE measures changes in the economic value of Truist’s current balance sheet and off-balance sheet hedges under alternate rate scenarios relative to starting economic value. Truist uses EVE as a longer-term measure of interest rate risk. Truist performs and monitors sensitivity tests of key assumptions used in EVE including:\nAsset prepayment speeds\nMortgage spreads (mortgage loan and security valuations)\nInterest-bearing deposit beta\nDeposit runoff / decay\nKey assumption tests are generally performed by increasing and decreasing the assumption, whether static or dynamically modeled, relative to their respective starting values and then measuring the resulting impact to NII and EVE under baseline and alternate rate scenarios.\nThe identification and testing of key assumptions are influenced by market conditions and management views of key risks. The results of key assumption sensitivity tests are reported to ALCO and BRC at least quarterly. Key assumptions and their associated sensitivity tests are reviewed with ALCO and BRC at least annually.\nMarket Risk from Trading Activities\nAs a financial intermediary, Truist provides its clients access to derivatives, foreign exchange, and securities markets, which generate market risks. Trading market risk is managed using a multi-faceted risk management approach, which includes measuring risk using VaR, stress testing, and sensitivity analysis. Risk metrics are monitored against a suite of limits at both the trading desk level and at the aggregate portfolio level.\nTruist is also subject to risk-based capital guidelines for market risk under the Market Risk Rule.\nTruist Financial Corporation 69\nCovered Trading Positions\nCovered positions subject to the Market Risk Rule include trading assets and liabilities, specifically those held for the purpose of short-term resale or with the intent of benefiting from actual or expected short-term price movements or to lock in arbitrage profits. Truist’s trading portfolio of covered positions results primarily from market making and underwriting services for the Company’s clients, as well as associated risk mitigating hedging activity. The trading portfolio, measured in terms of VaR, consists primarily of four sub-portfolios of covered positions: (i) credit trading, (ii) fixed income securities, (iii) interest rate derivatives, and (iv) equity derivatives. As a market maker across different asset classes, Truist’s trading portfolio also contains other sub-portfolios, including foreign exchange, loan trading, and commodity derivatives; however, these portfolios do not generate material trading risk exposures.\nValuation policies and methodologies exis"
}