{
  "source_file": "tfc-20241231.htm",
  "form_type": "10-K",
  "item1_clean": "% of Truist’s Deposits\nDeposit Market Share Rank\nNA\nNA\nDeposit market share rank excludes home office deposits.\nSource: FDIC.gov data as of June 30, 2024.\nAs of December 31, 2024.\n4 Truist Financial Corporation\nThe financial services industry is intensely competitive and constantly evolving. Management believes that Truist’s purpose, mission, and values, including a caring client-first approach, are a competitive advantage that strengthens the Company’s ability to provide financial products and services to businesses and individuals in its markets. The Company has recently made significant investments to develop its digital platform, including enhancements to its mobile and online applications to meet its clients’ digital expectations. Legislative, regulatory, economic, and technological changes, as well as continued consolidation within the industry, have resulted in increased competition from new and existing market participants, which is expected to continue in the future. Truist competes actively with national, regional, and local financial services providers, including banks, thrifts, credit unions, investment advisers, asset managers, securities brokers and dealers, private-equity funds, hedge funds, mortgage-banking companies, finance companies, and financial technology companies. At the same time, non-banking entities, including financial technology companies, have increased competition by providing financial products and services directly to customers and indirectly through partnerships.\nMany of our competitors have substantial positions nationally or in the markets in which we operate. Some also have greater scale, financial and operational resources, investment capacity, product and service offerings, and brand recognition. Our competitors may be subject to different and, in some cases, less stringent legislative, regulatory, and supervisory regimes than Truist. Certain competitors differ from us in their strategic and tactical priorities and, for example, may be willing to suffer meaningful financial losses in the pursuit of disruptive innovation and client growth or to accept more aggressive business, compliance, and other risks in the pursuit of higher returns and market valuations. Competition affects every aspect of our business, including product and service offerings, rates, pricing and fees, credit limits, and client service. Successfully competing in our markets also depends on our ability to innovate, to invest in technology and infrastructure, to execute transactions reliably and efficiently, to maintain and enhance our reputation, and to attract, retain, and motivate talented teammates, all while effectively managing risks and expenses. We expect that competition will only intensify in the future.\nPurpose, Mission, and Values\nOur purpose is to inspire and build better lives and communities.\nProvide clients with distinctive, secure, and successful experiences through touch and technology;\nCreate an inclusive and energizing environment that empowers teammates to learn, grow, and have meaningful careers; and\nOptimize long-term value for stakeholders through safe, sound, and ethical practices.\nTrustworthy – we serve with integrity\nCaring – everyone and every moment matters\nOne Team – together we can accomplish anything\nSuccess – when our clients win, we all win\nHappiness – positive energy changes lives\nOur strategic direction is to build the top super regional bank that grows with our clients with care. Our 2025 strategic objectives are to:\nLeverage our capital position by growing and capturing additional share within our high growth markets and existing client base in key focus areas in WB and CSBB and in areas, markets, and client solutions where we have invested significantly and have momentum.\nIn WB, deepen and grow existing client relationships in areas like Payments and Wealth, enhance the client digital experience, continue our momentum in Investment Banking and Trading, and capture more share of the commercial middle market.\nIn CSBB, grow core deposits, deepen existing relationships with Premier clients, enhance the client digital experience, and drive additional fee and loan growth through our differentiated consumer lending solutions.\nContinue to invest in important areas like new and existing talent, technology, risk, and cybersecurity, while maintaining our expense discipline with a goal of driving positive operating leverage.\nMaintain our credit and risk discipline.\nReturn capital to shareholders through our common stock dividend and share repurchase authorization.\nTruist Financial Corporation 5\nAlthough mergers and acquisitions are not a top capital deployment priority for Truist, the Company will assess opportunities when strategic and business objectives, profitability, cultural fit, market and regulatory conditions, capital and liquidity, and risk-management considerations favorably align.\nChallenges and unforeseen events could have an adverse impact on Truist’s financial condition, results of operations, and strategy. See the sections titled “Forward-Looking Statements” and “Risk Factors” for examples of such challenges and events.\nRegulatory and Supervisory Considerations\nWe are subject to significant regulatory frameworks that affect the products and services that we may offer and the manner in which we may offer them, the risks that we may take, the ways in which we may operate, and the corporate and financial actions that we may take.\nVarious governmental agencies and self-regulatory organizations oversee our business activities and therefore supervise and periodically examine us. These agencies and organizations generally have broad authority and discretion in restricting and otherwise affecting our businesses and operations and may take formal or informal supervisory, enforcement, and other actions against us when, in the applicable agency’s or organization’s judgment, our businesses or operations fail to comply with applicable law, comport with safe and sound practices, or meet supervisory expectations.\nThe regulatory and supervisory framework applicable to banking organizations is intended primarily for the protection of depositors and other customers, the DIF, the broader economy, and the stability of the U.S. financial system, rather than for the protection of shareholders and non-deposit creditors. In addition to banking statutes, regulations, and other laws, Truist is subject to various other laws that directly or indirectly affect its business and operations, including its ability to make distributions to shareholders. Governmental agencies and self-regulatory organizations also issue policy statements, interpretive letters, guidance, and other documents and communications that similarly impact Truist. The scope, complexity, intensity, and interpretation of these laws, documents, communications, and actions can vary based on such factors as the state of the economy, the prevailing political environment, and the performance of businesses and operations by us and other financial institutions.\nThe scope of the laws, documents, communications, and actions, including the intensity of the supervision to which the banking industry is subject, have increased in recent years. Regulatory enforcement and fines have also increased across the banking and financial services sector. Truist expects to remain subject to extensive regulation and supervision.\nThis section summarizes some relevant provisions of the principal statutes, regulations, and other laws that apply to us. These descriptions, however, are qualified in their entirety by the full text and judicial or administrative interpretations of those laws. This summary also does not cover all possible or proposed changes in laws applicable to us.\nAs a BHC, Truist is subject to the BHCA and to regulation, supervision, and examination by the FRB. Truist Bank, a North Carolina state-chartered commercial bank that is not a member of the Federal Reserve System, is subject to regulation, supervision, and examination by the NCCOB and the FDIC. Truist Bank and its affiliates are also subject to examination by the CFPB for compliance with most federal consumer financial protection laws.\nTruist and certain of its subsidiaries and affiliates, including those that engage in derivatives transactions, securities underwriting, market making, brokerage, and investment advisory activities, are subject to other federal and state laws and regulations, as well as supervision and examination by other federal and state regulatory agencies and other regulatory authorities, including the SEC, CFTC, FINRA, and NFA. Truist Bank is subject to additional state and federal laws, as well as various regulations, which govern its activities, the investments it may make, and the aggregate amount of loans that may be granted to one borrower.\nExaminations by regulators consider not only compliance with applicable laws, regulations, and supervisory policies of the agency, but also capital levels, asset quality, risk management effectiveness, the ability and performance of management and the Board, the effectiveness of internal controls, earnings, liquidity, and various other factors. Following examinations by banking supervisors, Truist and Truist Bank may receive supervisory findings and ultimately are assigned supervisory ratings. Examination reports, supervisory ratings, and other actions under this supervisory framework, which are considered confidential supervisory information, can impact the conduct, growth, and profitability of Truist’s operations, possibly to a significant degree. Refer to Item 1A, “Risk Factors” for more information on legal, regulatory, and compliance risks.\n6 Truist Financial Corporation\nUnder the FRB’s Large Financial Institution Rating System, component ratings are assigned for capital planning and positions, liquidity risk management, and governance and controls. To be considered “well managed” under this rating system, a firm must be rated “broadly meets expectations” or “conditionally meets expectations” for each of its three component ratings.\nDepending on the results of examinations of Truist, federal or state bank regulators can impose significant limitations on our activities and growth. These regulatory agencies generally have broad enforcement authority and discretion to impose restrictions and limitations on the operations of a regulated entity. Examples of restrictions and limitations include the imposition of substantial monetary penalties and nonmonetary requirements where the relevant agency determines that the operations of the regulated entity or any of its subsidiaries fail to comply with applicable laws or regulations, are conducted in an unsafe or unsound manner, engage in an unfair, deceptive, abusive act or practice, or do not meet supervisory expectations. The intensity of supervision has increased in recent years.\nTruist has elected to be treated as a FHC, which allows it to engage in a broader range of activities than would otherwise be permissible for a BHC, including activities that are financial in nature or incidental thereto, such as securities underwriting or merchant banking. Although FHCs may engage in certain acquisitions of nonbank companies without prior approval of the FRB, any acquisition of a nonbank company or voting shares of a nonbank company with total consolidated assets of $10 billion or more would require prior approval of the FRB. To maintain its standing as a FHC, Truist and its affiliated IDI must be well-capitalized and well managed and Truist Bank must have at least a satisfactory CRA rating. If the FRB determines that a FHC is not well-capitalized or well managed, the FRB may impose corrective capital and managerial requirements on the FHC. In such a situation, the FRB may also place limitations on the ability of an FHC to conduct certain business activities that FHCs are generally permitted to conduct, as well as the FHC’s ability to ",
  "item7_clean": "ITEM 7. MANAGEMENT’S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS\nA description of certain factors that may affect our future results and risk factors is set forth in Part I, Item 1A-Risk Factors of this report.\n2024 was an important year for Truist. We added new clients and deepened existing relationships, invested in our core banking business, made enhancements to our technology and risk infrastructure, and maintained our credit and expense discipline.\nWe executed on several important strategic initiatives, including the sale of TIH and the repositioning of our balance sheet. On May 6, 2024, we completed the divestiture of TIH. Refer to “Note 2. Discontinued Operations” for additional information. Following the sale of TIH, Truist executed a strategic balance sheet repositioning of a portion of its AFS investment securities portfolio by selling lower-yielding investment securities, resulting in an after-tax loss of $5.1 billion in 2024, allowing Truist to reinvest a portion of the proceeds in higher yielding securities.\nThese actions increased our capital and further enhanced our ability to support the growth needs of clients, while also returning capital to shareholders. We returned $3.8 billion of capital to our common shareholders through $2.8 billion of common stock dividends and $1.0 billion of common share repurchases during 2024. As of December 31, 2024, we have $4.0 billion remaining under our $5.0 billion common share repurchase authorization through the end of 2026.\nIn addition, Truist redeemed all outstanding shares of its perpetual preferred stock series L and the corresponding depositary shares representing fractional interests in such series for $750 million.\nIn July 2024, we successfully completed the sale of Sterling Capital Management LLC, an asset management business. Cash proceeds and the gain recognized on the sale were not material.\nClarke R. Starnes III retired from his position as CRO and Vice Chair. Brad Bender, a 20-year Truist veteran who previously served as Truist’s Head of Enterprise Operational Services and interim Chief Information Officer, succeeded Starnes as CRO.\nHugh S. “Beau” Cummins III, Vice Chair and Chief Operating Officer of Truist, resigned from his position, effective January 13, 2025. Following Mr. Cummins’ departure, management of the enterprise payments business transitioned to Kristin Lesher, Senior Executive Vice President and Chief Wholesale Banking Officer. Mr. Cummins’ remaining responsibilities, including leading teams responsible for enterprise operational services, enterprise corporate services, the strategy, transformation, and performance office, and the governance and controls organization, transitioned to Michael B. Maguire, Senior Executive Vice President and CFO.\nWe launched Truist Cares for Western North Carolina, a three-year, $725 million commitment to support and sustain hurricane recovery and resiliency through dedicated capital to support rebuilding and resiliency, loans or investments in Community Development Financial Institutions, philanthropic grants to local and national nonprofit organizations, and community service hours.\nTruist Financial Corporation 47\nOur strategic direction is to build the top super regional bank that grows with our clients with care. Our 2025 strategic objectives are to:\nLeverage our capital position by growing and capturing additional share within our high growth markets and existing client base in key focus areas in WB and CSBB and in areas, markets, and client solutions where we have invested significantly and have momentum.\nIn WB, deepen and grow existing client relationships in areas like Payments and Wealth, enhance the client digital experience, continue our momentum in Investment Banking and Trading, and capture more share of the commercial middle market.\nIn CSBB, grow core deposits, deepen existing relationships with Premier clients, enhance the client digital experience, and drive additional fee and loan growth through our differentiated consumer lending solutions.\nContinue to invest in important areas like new and existing talent, technology, risk, and cybersecurity, while maintaining our expense discipline with a goal of driving positive operating leverage.\nMaintain our credit and risk discipline.\nReturn capital to shareholders through our common stock dividend and share repurchase authorization.\nNet income to common shareholders totaled $4.5 billion, or $3.36 per share, for 2024, compared to a net loss available to common shareholders of $1.5 billion, or $1.09 per share, from the prior year.\nResults from continuing operations for 2024 included securities losses of $6.7 billion ($5.1 billion after-tax or $3.82 per share) from the balance sheet repositioning, a charitable contribution to the Truist Foundation of $150 million ($115 million after-tax, or $0.09 per share), restructuring charges of $120 million ($92 million after-tax, or $0.07 per share), and the FDIC special assessment adjustment of $64 million ($49 million after-tax, or $0.04 per share).\nResults from continuing operations for 2023 included a non-cash goodwill impairment charge of $6.1 billion ($4.56 per share), the FDIC special assessment of $507 million ($387 million after-tax, or $0.29 per share), restructuring charges of $320 million ($244 million after-tax, or $0.18 per share), and a discrete tax benefit of $204 million ($0.15 per share).\nNet income from discontinued operations was $4.9 billion for 2024, compared to $456 million for 2023.\nResults from discontinued operations for 2024 included a gain on the sale of TIH of $6.9 billion ($4.8 billion after-tax, or $3.64 per share), the accelerated recognition of TIH equity compensation expense for certain event-driven awards of $99 million ($76 million after tax, or $0.06 per share), and restructuring charges of $82 million ($62 million after-tax, or $0.05 per share).\nResults from discontinued operations for 2023 included restructuring charges of $55 million ($42 million after-tax, or $0.03 per share).\nTable 8: Earnings Highlights\nYear Ended December 31,\n(Dollars in millions)\nNet income (loss) available to common shareholders\nDiluted earnings per common share\nNet interest income - TE\nTotal taxable-equivalent revenue\nLess taxable-equivalent adjustment\nReturn on average assets\nReturn on average common shareholders’ equity\nNet interest margin - TE\n48 Truist Financial Corporation\nTruist’s TE revenue for 2024 was $13.5 billion. Excluding securities losses, TE revenue was $20.1 billion, representing a decrease of $101 million compared to 2023. Net interest income on a TE basis was $14.3 billion, down $441 million, or 3.0%, from the prior year primarily as a result of having a smaller more efficient balance sheet after the repositioning improving NIM by five basis points.\nAverage earning assets decreased $21.6 billion, or 4.4%, compared to the prior year primarily due to declines in average total loans of $15.8 billion, or 4.9%, and average securities of $13.7 billion, or 10.0%, partially offset by an increase in other earning assets of $7.3 billion, or 25%. The change in average securities was driven by maturities and the balance sheet repositioning. The change in other earning assets (increase in balances held at the Federal Reserve) was driven by the balance sheet repositioning.\nAverage deposits decreased $13.3 billion, or 3.3%, average short-term borrowings were flat, and average long-term debt decreased $13.0 billion, or 26% as a result of the smaller more efficient balance sheet.\nNIM was 3.03% for 2024, up five basis points compared to the prior year.\nThe yield on the average total loan portfolio was 6.34% for 2024, up 22 basis points, compared to the prior year primarily reflecting higher market interest rates. The yield on the average securities portfolio was 2.83% for 2024, up 60 basis points compared to the prior year, reflecting the balance sheet repositioning and reinvesting cash flows into higher yielding securities.\nThe average cost of total deposits was 2.02% for 2024, up 42 basis points compared to the prior year. The average cost of short-term borrowings was 5.36% for 2024, up 11 basis points compared to the prior year. The average cost of long-term debt was 4.94% for 2024, up 48 basis points compared to the prior year. The increases in rates on deposits and other funding sources was largely attributable to the repricing of lower cost funding sources.\nThe provision for credit losses was $1.9 billion for the year ended December 31, 2024 compared to $2.1 billion for the year ended December 31, 2023. The net charge-off ratio for the current year of 0.59% was up 9 basis points compared to the prior year.\nThe decrease in the current year provision expense primarily reflects a lower allowance build.\nThe net charge-off ratio was up compared to the prior year driven by higher net charge-offs in the CRE, other consumer, credit card, and indirect auto portfolios, partially offset by higher recoveries in the commercial and industrial portfolio. Additionally, the prior year included $98 million of charge-offs related to the sale of the student loan portfolio.\nNoninterest income was down $6.3 billion for the year ended December 31, 2024 compared to the year ended December 31, 2023 primarily due to $6.7 billion of securities losses resulting from the balance sheet repositioning, lower lending related fees, operating lease income, and card and payment related fees, partially offset by higher investment banking and trading income, wealth management income, service charges on deposits, and other income. Excluding securities losses, noninterest income was up $340 million, or 6.2%, compared to the prior year.\nNoninterest expense was down $6.7 billion, or 36%, for the year ended December 31, 2024 compared to the year ended December 31, 2023 primarily due to the 2023 goodwill impairment of $6.1 billion, lower regulatory charges due to the FDIC special assessment and related adjustments ($64 million in 2024 compared to $507 million in 2023), lower other expense, excluding the charitable contribution to the Truist Foundation, lower amortization of intangibles, and operating lease depreciation, partially offset by a $150 million charitable contribution to the Truist Foundation (other expense) and higher professional fees and outside processing expense. Restructuring charges decreased $200 million; both periods included restructuring charges for severance charges as well as facilities optimization costs. Noninterest expenses excluding the charitable contribution, the amortization of intangibles, the FDIC special assessment adjustment, restructuring charges, and a small loss on the early extinguishment of debt, decreased $44 million, or 0.4%.\nTruist had a benefit from income taxes of $556 million for 2024, compared to a provision for income taxes of $738 million in 2023. The provision for income taxes for 2023 reflects a pre-tax loss, which includes a non-deductible goodwill impairment charge, partially offset by a discrete tax benefit in the fourth quarter of 2023.\nTruist’s total assets at December 31, 2024 were $531.2 billion, a decrease of $4.2 billion, or 0.8%, compared to December 31, 2023 as loans and leases, net of ALLL, decreased $5.7 billion, or 1.9%, total securities decreased $3.4 billion, or 2.8%, partially offset by an increase of $8.7 billion, or 35%, in interest-bearing deposits with banks.\nTotal liabilities at December 31, 2024 were $467.5 billion, a decrease of $8.6 billion, or 1.8%, from the prior year, reflecting a decrease of $5.3 billion, or 1.3%, in deposits and a decrease of $4.0 billion, or 10.2%, in long-term debt, partially offset by an increase of $4.4 billion, or 17.6%, in short-term borrowings.\nTruist Financial Corporation 49\nTotal shareholders’ equity was $63.7 billion at December 31, 2024, an increase of $4.4 billion from December 31, 2023. This increase includes $4.8 billion in net income and $4.3 billion in OCI, partially offset by $3.1 billion in common and preferred dividends, $1.0 billion in common share repurchases, and $750 million for the redemption of series L preferred stock. Truist’s book value per common share at December 31, 2024 was $43.90, compared to $39.31 at December 31, 2023. Truist’s TBVPS of $30.01 at December 31, 2024 increased 37% compared to December 31, 2023.\nAsset quality remained stable.\nNonperforming loans and leases held for investment totaled $1.4 billion or 0.47% of loans and leases held for investment at December 31, 2024, up three basis points compared to December 31, 2023.\nLoans 90 days or more past due and still accruing totaled $587 million or 0.19% of loans and leases held for investment at December 31, 2024, up two basis point as a percentage of loans and leases compared with December 31, 2023. Excluding government guaranteed loans, the ratio of loans 90 days or more past due and still accruing as a percentage of loans and leases was 0.05% at December 31, 2024, up one basis point from December 31, 2023.\nThe allowance for credit losses was $5.2 billion and includes $4.9 billion for the allowance for loan and lease losses and $304 million for the reserve for unfunded commitments. The ALLL ratio was 1.59%, up five basis points compared with December 31, 2023.\nCapital strengthened during 2024.\nTruist’s CET1 ratio was 11.5% as of December 31, 2024, up 140 basis points since December 31, 2023 from the sale of TIH and organic capital generation, partially offset by the balance sheet repositioning, common dividends, and share repurchases.\nTruist returned $3.8 billion to common shareholders through declared common dividends of $2.8 billion or $2.08 per share during 2024 and repurchases of $1.0 billion of common stock, resulting in a dividend payout ratio of 62% and total payout ratio of 85%.\nTruist redeemed all outstanding shares of its perpetual preferred stock series L and the corresponding depositary shares representing fractional interests in such series for $750 million.\nTruist’s average consolidated LCR was 109% for the three months ended December 31, 2024, compared to the regulatory minimum of 100%.\nAnalysis of Results of Operations\nNet Interest Income and NIM\nTaxable-equivalent net interest income for the year ended December 31, 2024 was down $441 million, or 3.0%, compared to the year ended December 31, 2023 primarily as a result of having a smaller more efficient balance sheet after the repositioning. Net interest margin was 3.03%, up five basis points compared to the prior year.\nAverage earning assets decreased $21.6 billion, or 4.4%, compared to the prior year primarily due to declines in average total loans of $15.8 billion, or 4.9%, and average securities of $13.7 billion, or 10.0%, partially offset by an increase in other earning assets of $7.3 billion, or 25%. The change in average securities was driven by maturities and the balance sheet repositioning. The change in other earning assets (increase in balances held at the Federal Reserve) was driven by the balance sheet repositioning.\nThe yield on the average total loan portfolio was 6.34% for 2024, up 22 basis points, compared to the prior year primarily reflecting higher market interest rates. The yield on the average securities portfolio was 2.83% for 2024, up 60 basis points compared to the prior year, reflecting the balance sheet repositioning and reinvesting cash flows into higher yielding securities.\nAverage deposits decreased $13.3 billion, or 3.3%, average short-term borrowings were flat, and average long-term debt decreased $13.0 billion, or 26% due to decreased funding needs.\nThe average cost of total deposits was 2.02% for 2024, up 42 basis points compared to the prior year. The average cost of short-term borrowings was 5.36% for 2024, up 11 basis points compared to the prior year. The average cost of long-term debt was 4.94% for 2024, up 48 basis points compared to the prior year. The increases in rates on deposits and oth",
  "item2_clean": null
}