{
  "source_file": "tgt-20251101.htm",
  "form_type": "10-Q",
  "item1_clean": null,
  "item7_clean": null,
  "item2_clean": "Business Environment\nIn April 2025, the U.S. imposed a range of tariffs on the vast majority of products manufactured in foreign countries and jurisdictions, and subsequently imposed incremental tariffs, paused, modified, or issued specific exceptions to recently imposed tariffs. The U.S. has indicated that it is actively negotiating or expects to negotiate country-specific agreements that it expects will result in changes to imposed tariff rates. Approximately one-half of the merchandise we offer is sourced from outside the U.S., either directly or through our vendors, with China as the single largest source of merchandise we import.\nWe are closely monitoring the evolving consumer and regulatory landscape and adjusting plans as needed. The collective interaction of tariffs, sourcing strategies, pricing actions, consumer response and behaviors, and other factors, could materially impact our sales and results of operations in future periods.\nBusiness Transformation Initiatives\nIn May 2025, we announced a multi-year initiative to transform various aspects of our business—including our organizational structure, processes, and technology—to enable greater agility and optimize the use of the Company's assets. The three months ended November 1, 2025, included costs and charges related to our business transformation initiatives, including a reduction in our headquarters workforce.\nto the Financial Statements provides additional information.\nWe may incur additional business transformation costs and charges in future periods, which may adversely affect our results of operations and financial condition; however, we cannot reasonably estimate the amount of such costs and charges at this time.\nTARGET CORPORATION\nMANAGEMENT'S DISCUSSION AND ANALYSIS\nANALYSIS OF RESULTS OF OPERATIONS\nAnalysis of Results of Operations\nSummary of Operating Income\n\nNote: Merchandise Sales fulfilled by stores include in-store purchases and digitally originated sales fulfilled by shipping merchandise from stores to guests, Order Pickup, Drive Up, and Same Day Delivery.\nMerchandise Sales by Product Category\nApparel & accessories\nHome furnishings & décor\nHousehold essentials\nTARGET CORPORATION\nMANAGEMENT'S DISCUSSION AND ANALYSIS\nANALYSIS OF RESULTS OF OPERATIONS\nto the Financial Statements provides additional product category sales information. The collective interaction of a broad array of macroeconomic, competitive, and consumer behavioral factors, as well as sales mix and the transfer of sales to new stores, makes further analysis of sales metrics infeasible.\nWe monitor the percentage of purchases that are paid for using Target Circle™ Cards (Target Circle Card Penetration) because our internal analysis has indicated that a meaningful portion of the incremental purchases on our Target Circle Cards are also incremental sales for Target. Guests receive a 5 percent discount on virtually all purchases when they use a Target Circle Card at Target. For the three months ended November 1, 2025, and November 2, 2024, total Target Circle Card Penetration was 16.9 percent and 17.7 percent, respectively. For the nine months ended November 1, 2025, and November 2, 2024, total Target Circle Card Penetration was 17.0 percent and 17.8 percent, respectively.\nTARGET CORPORATION\nMANAGEMENT'S DISCUSSION AND ANALYSIS\nANALYSIS OF RESULTS OF OPERATIONS\nFor the three months ended November 1, 2025, our gross margin rate was 28.2 percent compared with 28.3 percent in the comparable prior-year period. The decrease reflected the net impact of\nmerchandising, primarily due to higher markdown rates partially offset by growth in advertising and other revenues;\nlower inventory shrink; and\nlower supply chain and digital fulfillment costs, reflecting the comparison over costs in 2024 related to timing of receipts and elevated inventory, combined with the benefit of productivity improvements at supply chain facilities and in digital fulfillment, partially offset by the deleveraging impact of lower sales.\nFor the nine months ended November 1, 2025, our gross margin rate was 28.5 percent compared with 29.0 percent in the comparable prior-year period. The decrease reflected the net impact of\nmerchandising activities, including higher markdown rates and purchase order cancellation costs, partially offset by growth in advertising and other revenues;\nhigher supply chain and digital fulfillment costs, partially due to the combined impact of investments in new supply chain facilities and the deleveraging impact of lower sales; and\nlower inventory shrink.\nTARGET CORPORATION\nMANAGEMENT'S DISCUSSION AND ANALYSIS\nANALYSIS OF RESULTS OF OPERATIONS\nSelling, General, and Administrative Expense Rate\nFor the three months ended November 1, 2025, our SG&A expense rate was 21.9 percent compared with 21.3 percent for the comparable prior-year period. The increase reflected business transformation costs of approximately 0.6 percentage points. The deleveraging impact of lower Net Sales was offset by a reduction in other costs, including lower incentive compensation expense.\nFor the nine months ended November 1, 2025, our SG&A expense rate was 20.8 percent compared with 21.1 percent for the comparable prior-year period. The decrease reflected a favorable impact of interchange fee settlements during the first quarter of 2025 of approximately 0.8 percentage points. This rate benefit was partially offset by the deleveraging impact of lower Net Sales, and the net impact of other costs, including 0.2 percentage points related to business transformation costs.\nInterchange fee settlements and business transformation costs are further described in\n, respectively, to the Financial Statements.\nChange in Number of Stores\nBeginning store count\nNumber of Stores and\n\nItem 2. Management’s Discussion and Analysis of Financial Condition and Results of Operations\nThird quarter 2025 included the following notable items:\nGAAP diluted earnings per share were $1.51 and Adjusted EPS\nNet Sales were $25.3 billion, a decrease of 1.5 percent from the comparable prior-year period.\nComparable sales decreased 2.7 percent, reflecting a 2.2 percent decrease in traffic and a 0.5 percent decrease in average transaction amount.\nComparable stores-originated sales declined 3.8 percent.\nComparable digitally-originated sales increased 2.4 percent.\nOperating income of $0.9 billion was 18.9 percent lower than the comparable prior-year period.\nGAAP diluted earnings per share\nAdjusted diluted earnings per share\nNote: Amounts may not foot due to rounding.\nAdjusted diluted earnings per share (Adjusted EPS), a non-GAAP metric, excludes the impact of certain items. Management believes that Adjusted EPS is useful in providing period-to-period comparisons of the results of our operations. A reconciliation of non-GAAP financial measures to GAAP measures is provid\nWe report after-tax return on invested capital (ROIC) because we believe ROIC provides a meaningful measure of our capital allocation effectiveness over time. For the trailing twelve months ended November 1, 2025, after-tax ROIC\ncompared with 15.9 percent for the trailing twelve months ended November 2, 2024. The calculation of ROIC is\n\nThe trailing twelve months ended November 2, 2024, consisted of 53 weeks compared with 52 weeks in the current-year period.\nRepresents the add-back to operating income driven by the hypothetical interest expense we would incur if the property under our operating leases was owned or accounted for under finance leases. Calculated using the discount rate for each lease and recorded as a component of rent expense within Operating Income. Operating lease interest is added back to Operating Income in the ROIC calculation to control for differences in capital structure between us and our competitors.\nCalculated using the effective tax rates, which were\nand 22.5 percent for the trailing twelve months ended November 1, 2025, and November 2, 2024, respectively. For the trailing twelve months ended November 1, 2025, and November 2, 2024, includes tax effect of $1.2 billion and $1.4 billion, respectively, related to EBIT and $38 million and $35 million, respectively, related to operating lease interest.\nTotal short-term and long-term operating lease liabilities included within Accrued and Other Current Liabilities and Noncurrent Operating Lease Liabilities, respectively.\nAverage based on the invested capital at the end of the current period and the invested capital at the end of the comparable prior period.\nFor the trailing twelve months ended November 1, 2025, includes the impact of after-tax net gains on interchange fee settlements and business transformation costs, which had a net impact on after-tax ROIC of 1.0 percentage point.\nto the Financial Statements provide additional information.\nTARGET CORPORATION\nMANAGEMENT'S DISCUSSION AND ANALYSIS\nANALYSIS OF FINANCIAL CONDITION\nAnalysis of Financial Condition\nLiquidity and Capital Resources\nWe follow a disciplined and balanced approach to capital allocation based on the following priorities, ranked in order of importance: first, we fully invest in opportunities to profitably grow our business, create sustainable long-term value, and maintain our current operations and assets; second, we maintain a competitive quarterly dividend and seek to grow it annually; and finally, we return any excess cash to shareholders by repurchasing shares within the limits of our credit rating goals.\nOur cash and cash equivalents balance was $3.8 billion, $4.8 billion, and $3.4 billion as of November 1, 2025, February 1, 2025, and November 2, 2024, respectively. Our cash and cash equivalents balance includes short-term investments of $2.9 billion, $3.9 billion, and $2.5 billion as of November 1, 2025, February 1, 2025, and November 2, 2024, respectively. Our investment policy is designed to preserve principal and liquidity of our short-term investments. This policy allows investments in large money market funds or in highly-rated direct short"
}