{
  "source_file": "tjx-20251101.htm",
  "form_type": "10-Q",
  "item1_clean": null,
  "item7_clean": null,
  "item2_clean": "Item 2. Management’s Discussion and Analysis of Financial Condition and Results of Operations\nThe Thirteen Weeks (third quarter) and Thirty-Nine Weeks (nine months) Ended November 1, 2025\nThe Thirteen Weeks (third quarter) and Thirty-Nine Weeks (nine months) Ended November 2, 2024\nOVERVIEW\nWe are the leading off-price apparel and home fashions retailer in the U.S. and worldwide. Our mission is to deliver great value to our customers every day. We do this by selling a rapidly changing assortment of apparel, home fashions and other merchandise at prices generally 20% to 60% below full-price retailers’ (including department, specialty and major online retailers) regular prices on comparable merchandise, every day through our stores\nand six e-commerce sites\n5,200 stores through our four segments: in the U.S., Marmaxx (which operates TJ Maxx, Marshalls, tjmaxx.com and marshalls.com) and HomeGoods (which operates HomeGoods and Homesense); TJX Canada (which operates Winners, HomeSense and Marshalls in Canada); and TJX International (which operates TK Maxx, Homesense, tkmaxx.com, tkmaxx.de, and tkmaxx.at in Europe, and TK Maxx in Australia). In addition to our four segments, Sierra operates retail stores and sierra.com in the U.S. The results of Sierra are included in the Marmaxx segment.\nRESULTS OF OPERATIONS\nAs an overview of our financial performance, results for the quarter ended November 1, 2025 include the following:\nNet sales increased 7% to $15.1 billion for the third quarter of fiscal 2026 versus last year’s third quarter sales of $14.1 billion. As of November 1, 2025, the number of stores in operation increased approximately 3% and the selling square footage increased approximately 2% compared to the end of the third quarter of fiscal 2025.\nConsolidated comp sales increased 5% for the third quarter of fiscal 2026. See Net Sales below for our definition of comp sales.\nDiluted earnings per share for the third quarter of fiscal 2026 were $1.28 versus $1.14 in the third quarter of fiscal 2025.\nPre-tax profit margin (the ratio of pre-tax income to net sales) for the third quarter of fiscal 2026 was 12.7%, a 0.4 percentage point increase compared with 12.3% in the third quarter of fiscal 2025.\nOur cost of sales, including buying and occupancy costs, ratio for the third quarter of fiscal 2026 was 67.4%, a 1.0 percentage point decrease compared with 68.4% in the third quarter of fiscal 2025.\nOur selling, general and administrative (“SG&A”) expense ratio for the third quarter of fiscal 2026 was 20.1%, a 0.6 percentage point increase compared with 19.5% in the third quarter of fiscal 2025.\nOur consolidated average per store inventories, including inventory on hand at our distribution centers (which excludes inventory in transit) and excluding our e-commerce sites, were up 8% at the end of the third quarter of fiscal 2026 compared to the third quarter of fiscal 2025. Starting in the first quarter of fiscal 2026, Sierra stores are included in the consolidated average per store inventories.\nDuring the third quarter of fiscal 2026, we returned $1.1 billion to our shareholders through share repurchases and dividends.\nRecent Events and Trends\nGlobal Economic Conditions and Tariffs\nWe continue to closely monitor changes in international trade relations, economic and monetary policies, and legislation and regulations including those related to tariffs on imports from China and other countries. While we have been, and believe we can continue to be, successful in mitigating tariff pressures, tariffs have led to significant volatility in the global economy. The extent and duration of the tariffs and the resulting impact on general economic conditions and on our business continues to be uncertain. Our buying organization’s ability to execute our merchandise sourcing model to offset the effects of the tariffs is a key factor. We are continuing to implement and consider additional measures that seek to mitigate the impact of tariffs. However, the overall impact depends on a range of factors, including trade negotiations between the U.S. and other countries, responses of other countries, exceptions that could be granted, and cost of alternative sources of merchandise. It is possible that some of the actions we might take to adapt could increase risk, drive a modification of our operations that might be time-consuming or expensive, or possibly impact pricing on certain items, which could impact our business. Uncertainty remains regarding the continued impact on our direct imports, indirect imports, vendor and competitor pricing, consumer demand, tariff pass-throughs, and reciprocal or retaliatory tariffs.\nOperating Results as a Percentage of Net Sales\nThe following table sets forth our consolidated operating results as a percentage of net sales:\nThirteen Weeks Ended\nThirty-Nine Weeks Ended\n\nFigures may not foot due to rounding.\nNet sales for the quarter ended November 1, 2025 totaled $15.1 billion, a 7% increase versus third quarter fiscal 2025 net sales of $14.1 billion. This increase reflects a 5% increase in comp sales, a 2% increase from non-comp sales and a neutral impact from foreign currency. Net sales from our e-commerce sites combined amounted to approximately 2% of total sales for each of the third quarters of fiscal 2026 and fiscal 2025.\nNet sales for the nine months ended November 1, 2025 totaled $42.6 billion, a 7% increase versus the first nine months of fiscal 2025 net sales of $40 billion. This increase reflects a 4% increase in comp sales, a 2% increase from non-comp sales and a 1% positive impact from foreign currency. Net sales from our e-commerce sites combined amounted to approximately 2% of total sales for each of the first nine months of fiscal 2026 and fiscal 2025.\nComp sales increased 5% and 3% for the third quarters of fiscal 2026 and fiscal 2025, respectively. Comp sales increased 4% and 3% for the first nine months of fiscal 2026 and fiscal 2025, respectively. Both apparel comp sales growth (as defined below) and home comp sales growth (as defined below) performed in line with comp sales growth for both the third quarter and first nine months of fiscal 2026. Comp sales for the third quarter of fiscal 2026 were driven by a higher average basket and an increase in customer transactions. Comp sales for the first nine months of fiscal 2026 were primarily driven by an increase in customer transactions.\nAs of November 1, 2025, our store count increased approximately 3% and selling square footage increased approximately 2% compared to the end of the third quarter last year.\nDefinition of Comparable Sales\nWe define comparable sales, or comp sales, to be sales of stores and e-commerce sites that have been in operation for all or a portion of two consecutive fiscal years, or, in other words, stores or e-commerce sites that are starting their third fiscal year of operation. In any given fiscal year, we calculate comp sales on a 52-week basis by comparing the current and prior year weekly periods that are most closely aligned. Relocated stores and stores that have changed in size are generally classified in the same way as the original store, and we believe that the impact of these stores on the consolidated comp sales percentage is immaterial. Starting in fiscal 2026, sales from e-commerce sites are included in comp sales, and the impact of such sales on the consolidated comp sales percentage is immaterial.\nSales excluded from comp sales (“non-comp sales”) consist of sales from:\nNew stores or e-commerce sites - stores or sites that have not yet met the comp sales criteria, which represents a substantial majority of non-comp sales\nStores or e-commerce sites that are closed permanently or for an extended period of time\nWe determine which stores and e-commerce sites are included in the comp sales calculation at the beginning of a fiscal year, and the classification remains constant throughout that year unless a store or e-commerce site is closed permanently or for an extended period during that fiscal year.\nComp sales of our foreign segments are calculated on a constant currency basis. We define constant currency basis as translating the current year’s results using the prior year’s exchange rates. This removes the effect of changes in currency exchange rates, which we believe is a more appropriate measure of performance.\nComp sales may be referred to as “same store” sales by other retail companies. The method for calculating comp sales varies across the retail industry; therefore, our measure of comp sales may not be comparable to that of other retail companies. Comparable sales for a category such as home or apparel include sales from merchandise within such category combined across all divisions that fall within the Company’s definition of comparable sales for such period.\nWe define customer transactions to be the number of transactions in stores or online included in the comp sales calculation. We define average ticket to be the average retail price of the units sold. We define average basket to be the average dollar value of transactions.\nImpact of Foreign Currency Exchange Rates\nOur operating results are affected by foreign currency exchange rates as a result of changes in the value of the U.S. dollar or a division’s local currency in relation to other currencies. We specifically refer to “foreign currency” as the impact of translational foreign currency exchange and mark-to-market of inventory derivatives, as described in detail below. This does not include the impact foreign currency exchange rates can have on various transactions that are denominated in a currency other than an operating division's local currency, which is referred to as “transactional foreign exchange,” and also described below.\nTranslation Foreign Exchange\nIn our Consolidated Financial Statements, we translate the operations of TJX Canada and TJX International from local currencies into U.S. dollars using currency rates in effect at differen"
}