{
  "source_file": "tmo-20250927.htm",
  "form_type": "10-Q",
  "item1_clean": null,
  "item7_clean": null,
  "item2_clean": "Item 2. Management’s Discussion and Analysis of Financial Condition and Results of Operations\nForward-looking statements, within the meaning of Section 21E of the Securities Exchange Act of 1934 (the Exchange Act), are made throughout this Management’s Discussion and Analysis of Financial Condition and Results of Operations. Any statements contained herein that are not statements of historical fact may be deemed to be forward-looking statements, including without limitation statements regarding: projections of revenues, expenses, earnings, margins, tax rates, tax provisions, cash flows, pension and benefit obligations and funding requirements, and our liquidity position; cost reductions, restructuring activities, new product and service developments, competitive strengths or market position, acquisitions or divestitures; growth, declines and other trends in markets we sell into; new or modified laws, regulations and accounting pronouncements; outstanding claims, legal proceedings, tax audits and assessments and other contingent liabilities; foreign currency exchange rates and fluctuations in those rates; general economic and capital markets conditions; the timing of any of the foregoing; assumptions underlying any of the foregoing; and any other statements that address events or developments that Thermo Fisher intends or believes will or may occur in the future. Without limiting the foregoing, the words “believes,” “anticipates,” “plans,” “expects,” “seeks,” “estimates,” and similar expressions are intended to identify forward-looking statements, although not all forward-looking statements are accompanied by such words. While the company may elect to update forward-looking statements in the future, it specifically disclaims any obligation to do so, even if the company’s estimates change, and readers should not rely on those forward-looking statements as representing the company’s views as of any date subsequent to the date of the filing of this report.\nA number of important factors could cause the results of the company to differ materially from those indicated by such forward-looking statements, including those detailed under the caption “Risk Factors” in the company’s\nfor the year ended December 31, 2024 (which is on file with the SEC). Important factors that could cause actual results to differ materially from those indicated by forward-looking statements include risks and uncertainties relating to: the need to develop new products and adapt to significant technological change; implementation of strategies for improving growth; general economic conditions and related uncertainties; dependence on customers’ capital spending policies and government funding policies; the effect of economic and political conditions, impact of tariffs, and exchange rate fluctuations on international operations; use and protection of intellectual property; the effect of changes in governmental regulations; any natural disaster, public health crisis, pandemic, or other catastrophic event; and the effect of laws and regulations governing government contracts, as well as the possibility that expected benefits related to recent or pending acquisitions may not materialize as expected.\nThe company refers to various amounts or measures not prepared in accordance with generally accepted accounting principles (non-GAAP measures). These non-GAAP measures are further described and reconciled to their most directly comparable amount or measure under the section “\n” later in this “Management’s Discussion and Analysis of Financial Condition and Results of Operations.”\nThermo Fisher Scientific Inc. enables customers to make the world healthier, cleaner and safer by helping them accelerate life sciences research, solve complex analytical challenges, increase laboratory productivity, and improve patient health through diagnostics and the development and manufacture of life-changing therapies. Markets served include pharmaceutical and biotech, academic and government, industrial and applied, as well as healthcare and diagnostics. The company’s operations fall into four segments (Note 11): Life Sciences Solutions, Analytical Instruments, Specialty Diagnostics, and Laboratory Products and Biopharma Services.\nConsolidated Results\n(Dollars in millions except per share amounts)\nGAAP operating income\nGAAP operating income margin\nAdjusted operating income\nAdjusted operating income margin\nGAAP diluted earnings per share attributable to Thermo Fisher Scientific Inc.\nAdjusted earnings per share\nTHERMO FISHER SCIENTIFIC INC.\nOrganic Revenue Growth\nImpact of acquisitions\nImpact of currency translation\nOrganic revenue growth\nDuring the third quarter of 2025, revenues grew in the pharma and biotech market, driven by our trusted partner status with customers. Revenues in the academic and government market declined, reflecting customer hesitancy in a more uncertain environment, which resulted in muted demand for equipment and instruments. Revenues grew in the industrial and applied market due to strong demand for our innovative products serving this market. Revenue to customers in the diagnostics and healthcare market declined as we navigated headwinds in China. During the third quarter of 2025, sales grew in North America. Sales growth was strong in Europe and Asia-Pacific, despite weak economic activity in China. Contributions to organic revenue during the third quarter of 2025 were led by the Laboratory Products and Biopharma Services and Life Sciences Solutions segments.\nDuring the first nine months of 2025, revenues grew in the pharma and biotech market due to increased demand from customers, partially offset by reduced demand for COVID-19 vaccine and therapy related products and services. Revenues in the academic and government market declined, driven by customer hesitancy in a more uncertain environment in the U.S. and macro conditions in China. Revenue to customers in the industrial and applied market grew. Revenue to customers in the diagnostics and healthcare market declined slightly. During the first nine months of 2025, sales grew in North America, Europe and Asia-Pacific, but declined in China. Contributions to organic revenue during the first nine months of 2025 were led by the Laboratory Products and Biopharma Services and Life Sciences Solutions segments.\nThe company continues to execute its proven growth strategy which consists of three pillars:\nHigh-impact innovation,\nOur trusted partner status with customers, and\nOur unparalleled commercial engine.\nGAAP operating income margin and adjusted operating income margin increased in the third quarter of 2025 due primarily to very strong productivity improvements, partially offset by strategic investments, the impact of tariffs and related foreign currency effects, and unfavorable business mix. GAAP operating income margin in the third quarter of 2025 was also impacted by higher levels of restructuring and other charges incurred for headcount reductions and facility consolidations in an effort to streamline operations (Note 6).\nGAAP operating income margin and adjusted operating income margin increased the first nine months of 2025 due primarily to very strong productivity improvements, partially offset by unfavorable business mix. GAAP operating income margin in the first nine months of 2025 benefited from lower amortization expense when compared to 2024; however, this was partially offset by higher levels of restructuring and other charges incurred for headcount reductions and facility consolidations in an effort to streamline operations (Note 6).\nThe company’s references to strategic investments generally refer to targeted spending for enhancing commercial capabilities, including expansion of geographic sales reach and e-commerce platforms, marketing initiatives, expanded service and operational infrastructure, research and development projects and other expenditures to enhance the customer experience, as well as incentive compensation and recognition for employees. The company’s references throughout this discussion to productivity improvements generally refer to improved cost efficiencies from its Practical Process Improvement (PPI) business system to address inflation, including reduced costs resulting from implementing continuous improvement methodologies, global sourcing initiatives, a lower cost structure following restructuring actions including headcount reductions and consolidation of facilities, and low cost region manufacturing.\nNotable Recent Acquisitions\nOn July 10, 2024, the company acquired, within the Life Sciences Solutions segment, Olink Holding AB (publ), a Swedish-based provider of next-generation proteomics solutions. The acquisition enhances the segment’s capabilities in the high-growth proteomics market with the addition of highly differentiated solutions. It also complements the existing life sciences and mass spectrometry offerings, accelerating protein biomarker discovery and providing strong synergy opportunities.\nOn September 1, 2025, the company acquired, within the Life Sciences Solutions segment, Solventum Corporation’s Purification and Filtration business, which became the company’s filtration and separation business, a leading provider of\nTHERMO FISHER SCIENTIFIC INC.\npurification and filtration technologies used in the production of biologics as well as in medical technologies and industrial applications. The business strengthens the segment’s bioproduction offerings with advanced filtration technologies that improve quality and efficiency across upstream and downstream workflows. In addition, its industrial filtration and membrane solutions will expand our reach into industries including battery, semiconductor and medical device manufacturing.\nThe company’s management evaluates segment operating performance using operating income before certain charges/credits as defined in Note 11 to the Consolidated Financial Statements of the company’s\nfor 2024. Accordingly, th"
}