{
  "source_file": "tmus-20250930.htm",
  "form_type": "10-Q",
  "item1_clean": null,
  "item7_clean": null,
  "item2_clean": "Item 2. Management’s Discussion and Analysis of Financial Condition and Results of Operations\nCautionary Statement Regarding Forward-Looking Statements\ncompetition, industry consolidation and changes in the market for wireless communications services and other forms of connectivity;\ncriminal cyberattacks, disruption, data loss or other security breaches;\nour inability to timely adopt and effectively deploy network technology developments;\nour inability to effectively execute our digital transformation and drive customer and employee adoption of emerging technologies;\nour inability to retain or motivate key personnel, hire qualified personnel or maintain our corporate culture;\nsystem failures and business disruptions, allowing for unauthorized use of or interference with our network and other systems;\nthe scarcity and cost of additional wireless spectrum, and regulations relating to spectrum use;\nthe timing and effects of any pending and future acquisition, divestiture, investment, joint venture or merger involving us, including our inability to obtain any required regulatory approval necessary to consummate any such transactions or to achieve the expected benefits of such transactions;\nadverse economic, political or market conditions in the U.S. and international markets, including changes resulting from increases in inflation or interest rates, tariffs and trade restrictions, supply chain disruptions, fluctuations in global currencies, immigration policies, and impacts of geopolitical instability, such as the Ukraine-Russia, Iran-Israel and Israel-Hamas wars and further escalations thereof;\npotential operational delays, higher procurement and operational costs, and regulatory and compliance complexities as a result of changes to trade policies, including higher tariffs, restrictions and other economic disincentives to trade;\nour inability to successfully deliver new products and services;\nany disruption or failure of our third parties (including key suppliers) to provide products or services for the operation of our business;\nsociopolitical volatility and polarization and risks related to environmental, social and governance matters;\nour substantial level of indebtedness and our inability to service our debt obligations in accordance with their terms;\nchanges in the credit market conditions, credit rating downgrades or an inability to access debt markets;\nour inability to maintain effective internal control over financial reporting;\nany changes in regulations or in the regulatory framework under which we operate;\nlaws and regulations relating to the handling of privacy, data protection and artificial intelligence;\nunfavorable outcomes of and increased costs from existing or future regulatory or legal proceedings;\ndifficulties in protecting our intellectual property rights or if we infringe on the intellectual property rights of others;\nour offering of regulated financial services products and exposure to a wide variety of state and federal regulations;\nnew or amended tax laws or regulations or administrative interpretations and judicial decisions affecting the scope or application of tax laws or regulations;\nour wireless licenses, including those controlled through leasing agreements, are subject to renewal and may be revoked;\nour exclusive forum provision as provided in our Certificate of Incorporation;\ninterests of Deutsche Telekom AG (“DT”), our controlling stockholder, which may differ from the interests of other stockholders;\nour current and future stockholder return programs may not be fully utilized, and our share repurchases and dividend payments pursuant thereto may fail to have the desired impact on stockholder value; and\nfuture sales of our common stock by DT and SoftBank Group Corp. (“SoftBank”) and our inability to attract additional equity financing outside the United States due to foreign ownership limitations by the Federal Communications Commission (“FCC”).\nGiven these risks and uncertainties, readers are cautioned not to place undue reliance on such forward-looking statements. We undertake no obligation to revise or publicly release the results of any revision to these forward-looking statements, except as required by law.\nInvestors and others should note that we announce material information to our investors using our investor relations website (https://investor.t-mobile.com), newsroom website (https://t-mobile.com/news), press releases, SEC filings and public conference calls and webcasts.\nWe intend to also use certain social media accounts as a means of disclosing information about us and our services and for complying with our disclosure obligations under Regulation FD (the @TMobileIR X account (https://x.com/TMobileIR), the @MikeSievert X account (https://x.com/MikeSievert) and our Chief Executive Officer’s LinkedIn account (https://www.linkedin.com/in/sievert), both of which Mr. Sievert also uses as a means for personal communications and observations, the @SriniGopalan X account (https://x.com/SriniGopalan) and our COO’s LinkedIn account (https://www.linkedin.com/in/srini-gopalan/), both of which Mr. Gopalan also uses as a means for personal communications and observations, and the @TMobileCFO X account (https://x.com/tmobilecfo) and our Chief Financial Officer’s LinkedIn account (https://www.linkedin.com/in/peter-osvaldik-3887394), both of which Mr. Osvaldik also uses as a means for personal communication and observations). The information we post through these social media channels may be deemed material. Accordingly, investors should monitor these social media channels in addition to following our press releases, SEC filings and public conference calls and webcasts. The social media channels that we intend to use as a means of disclosing the information described above may be updated from time to time as listed on our investor relations website.\nThe objectives of our Management’s Discussion and Analysis of Financial Condition and Results of Operations (“MD&A”) are to provide users of our condensed consolidated financial statements with the following:\nA narrative explanation from the perspective of management of our financial condition, results of operations, cash flows, liquidity and certain other factors that may affect future results;\nContext to the condensed consolidated financial statements; and\nInformation that allows assessment of the likelihood that past performance is indicative of future performance.\nOur MD&A is provided as a supplement to, and should be read together with, our unaudited condensed consolidated financial statements as of and for the three and nine months ended September 30, 2025, included in\nAcquisition of UScellular Wireless Business\nTransaction Overview\nOn May 24, 2024, we entered into a securities purchase agreement with United States Cellular Corporation (“UScellular”), Telephone and Data Systems, Inc., and USCC Wireless Holdings, LLC for the acquisition of substantially all of UScellular’s wireless operations and select AWS, PCS, 600 MHz, 700 MHz and other spectrum assets for an aggregate purchase price of approximately $4.4 billion, payable in cash and the assumption of up to $2.0 billion of debt through exchange offers to certain UScellular debtholders.\nOn May 23, 2025, we launched exchange offers (the “Exchange Offers”) for any and all of certain outstanding senior notes of UScellular for new notes of T-Mobile with the same interest rate, interest payment dates, maturity dates and redemption terms as each corresponding series of senior notes of UScellular. In conjunction with the Exchange Offers, we also solicited consents for each series of the outstanding senior notes of UScellular to effect a number of amendments to the applicable indenture under which each such series of notes were issued and are governed (the “Consent Solicitations”). The consummation of the Exchange Offers and Consent Solicitations were subject to the closing of the UScellular acquisition, which occurred on August 1, 2025.\nOn July 22, 2025, we entered into asset purchase agreements for the acquisition of substantially all of the wireless operations assets (together with UScellular’s wireless operations and select spectrum assets, the “UScellular Wireless Business”) of each of Farmers Cellular Telephone Company, Inc., Iowa RSA No. 9 Limited Partnership, and Iowa RSA No. 12 Limited Partnership (collectively, the “Iowa Entities”) for an aggregate purchase price of $175 million payable in cash. Prior to our acquisition of the Iowa Entities, UScellular held a minority interest in each of the Iowa Entities.\nThe UScellular Wireless Business offers a comprehensive range of wireless communications products and services. As a combined company, we expect to increase competition in the U.S. wireless and broadband industries, achieve synergies and enhance our rural 5G coverage with our combined network footprint. Following the closing of the transactions, UScellular and the Iowa Entities will retain ownership of their other spectrum licenses, as well as their towers.\nOn August 1, 2025, upon the completion of certain customary closing conditions, including the receipt of certain regulatory approvals (the “UScellular Acquisition Date”), we completed the acquisition of the UScellular Wireless Business (the “UScellular Acquisition”), and as a result, the UScellular Wireless Business became wholly owned by T-Mobile. In exchange, on the UScellular Acquisition Date, we transferred cash of $2.8 billion. Additionally, the closing of the UScellular Acquisition obligated us to execute the Exchange Offers. On August 5, 2025, we executed the Exchange Offers of certain senior notes of UScellular with an aggregate outstanding principal balance of $1.7 billion for T-Mobile notes with the same interest rate, interest payment dates, maturity dates and redemption terms as each corresponding series of senior notes of UScellular.\nFor more information regarding the UScellular Acquisition, see\nNote 2 – Business"
}