{
  "source_file": "tpl-20250930.htm",
  "form_type": "10-Q",
  "item1_clean": null,
  "item7_clean": null,
  "item2_clean": "Texas Pacific Land Corporation (which, together with its subsidiaries as the context requires, may be referred to as “TPL”, the “Company”, “our”, “we” or “us”) is a Delaware corporation and one of the largest landowners in the State of Texas with approximately 882,000 surface acres of land, principally concentrated in the Permian Basin. Additionally, we own a 1/128th nonparticipating perpetual oil and gas royalty interest (“NPRI”) under approximately 85,000 acres of land, a 1/16th NPRI under approximately 371,000 acres of land, and approximately 16,000 additional net royalty acres (normalized to 1/8th) (“NRA”), for a collective total of approximately 207,000 NRA, principally concentrated in the Permian Basin.\nThe Company was originally organized under a Declaration of Trust, dated February 1, 1888, to receive and hold title to extensive tracts of land in the State of Texas, previously the property of the Texas and Pacific Railway Company. We completed our reorganization on January 11, 2021 from a business trust, Texas Pacific Land Trust, into Texas Pacific Land Corporation.\nWe are not an oil and gas producer. Our business activity is generated from surface and royalty interest ownership, primarily in the Permian Basin. Our revenues are derived from oil and gas royalties, water sales, produced water royalties, easements and other surface-related income and land sales. Due to the nature of our operations and concentration of our ownership in one geographic location, our revenue and net income are subject to substantial fluctuations from quarter to quarter and year to year. In addition to fluctuations in response to changes in the market price for oil and gas, our financial results are also subject to decisions by not only the owners and operators of the oil and gas wells to which our oil and gas royalty interests relate, but also to other owners and operators in the Permian Basin as it relates to our other revenue streams, principally water sales, produced water royalties, easements, and other surface-related revenue.\nFor a detailed overview of our business and business segments, see Part I, Item 1. “Business — General” in our 2024 Annual Report.\nAverage WTI oil prices for the nine months ended September 30, 2025 were down approximately 14% compared to average oil prices during the same period last year. Oil prices continue to be impacted by certain actions by OPEC+, geopolitics, and evolving global supply and demand trends, among other factors. In addition, ambiguity around tariffs implemented by and towards the United States has created incremental global economic uncertainty, which has, in part, contributed to relatively weaker oil prices in 2025 to-date. Average Henry Hub natural gas prices during 2025 have increased approximately 64% compared to average prior year natural gas prices. Global and domestic natural gas markets have benefited from improved supply-demand balances, including tailwinds from expanded liquefied natural gas capacity and improved industrial and power demand, among other factors. Since mid-2022, the Waha Hub located in Pecos County, Texas has at times experienced significant negative price differentials relative to Henry Hub, located in Erath, Louisiana, due in part to growing local Permian natural gas production and limited natural gas pipeline takeaway capacity. Midstream infrastructure is currently being developed by operators to provide additional takeaway capacity, though the impact on future basis differentials will be dependent on future natural gas production and other factors. Changes in global and domestic macro-economic conditions could result in additional shifts in oil and gas supply and demand in future periods. Although our revenues are directly and indirectly impacted by oil and natural gas prices, we believe our royalty interests (which require no capital expenditures or operating expense burden from us for well development), strong balance sheet, and liquidity position will help us navigate through potential commodity price volatility.\nPermian Basin Activity\nThe Permian Basin is one of the oldest and most well-known hydrocarbon-producing areas and currently accounts for a substantial portion of oil and gas production in the United States, covering approximately 86,000 square miles across southeastern New Mexico and western Texas. Exploration and production (“E&P”) companies operating in the Permian Basin continue to maintain robust drilling and development activity. Per the U.S. Energy Information Administration, Permian production is currently in excess of 6.6 million barrels per day, which is higher than the average daily production in this region for any year prior to 2025.\nDue to our ownership concentration in the Permian Basin, our revenues are directly impacted by oil and gas pricing and drilling activity in the Permian Basin. Below are metrics for the three and nine months ended September 30, 2025 and 2024:\nOil and Gas Pricing Metrics:\nWTI Cushing oil average price per bbl\nHenry Hub natural gas average price per mmbtu\nWaha Hub natural gas average price per mmbtu\nActivity Metrics specific to the Permian Basin:\nAverage monthly horizontal permits\nAverage monthly horizontal wells drilled\nAverage weekly horizontal rig count\nDUCs as of September 30 for each applicable year\nTotal Average U.S. weekly horizontal rig count\n(1) Commonly used definitions in the oil and gas industry provided in the table above are defined as follows: WTI Cushing represents West Texas Intermediate. Bbl represents one barrel of 42 U.S. gallons of oil. Mmbtu represents one million British thermal units, a measurement used for natural gas. Waha Hub natural gas pricing data per Bloomberg. DUCs represent drilled but uncompleted wells. DUC classification is based on well data and date stamps provided by Enverus. DUCs are based on wells that have a drilled/spud date stamp but do not have a completed or first production date stamp. Excludes wells that have been labeled plugged and abandoned or permit expired and wells drilled/spud more than five years ago.\n(2) Permian Basin specific information per Enverus analytics. U.S. weekly horizontal rig counts per Baker Hughes United States Rotary Rig Count for horizontal rigs. Statistics for similar data are also available from other sources. The comparability between these other sources and the sources used by the Company may differ.\nThe metrics above show selected domestic benchmark oil and natural gas prices and approximate activity levels in the Permian Basin for the three and nine months ended September 30, 2025 and 2024. While average oil prices for the nine months ended September 30, 2025 decreased compared to the same period in 2024, average Henry Hub and Waha natural gas prices for the nine months ended September 30, 2025 increased compared to the same period in 2024. E&P companies broadly have continued to deploy capital towards drilling and development activities in the Permian Basin at a measured pace. As we are a significant landowner in the Permian Basin and not an oil and gas producer, our revenue is affected by the development decisions made by companies that operate in the areas where we own royalty interests and land. Accordingly, these decisions made by others affect, both directly and indirectly, our oil and gas royalties, produced water royalties, water sales, and other surface-related income.\n\nFor the Nine Months Ended September 30, 2025 as Compared to the Nine Months Ended September 30, 2024\nTotal revenues were $586.6 million for the nine months ended September 30, 2025 compared to $520.0 million for the nine months ended September 30, 2024. Total operating expenses were $143.7 million for the nine months ended September 30, 2025 compared to $123.4 million for the nine months ended September 30, 2024. Net income was $358.0 million for the nine months ended September 30, 2025 compared to $335.6 million for the three months ended September 30, 2024. Individual revenue and expense line items are discussed below under “Segment Results of Operations.”\nSegment Results of Operations\nWe operate our business in two reportable segments: Land and Resource Management and Water Services and Operations. We eliminate any inter-segment revenues and expenses upon consolidation.\nWe evaluate the performance of our operating segments separately to monitor the different factors affecting financial results. The reportable segments presented are consistent with our reportable segments discussed in Note 14, “Business Segment Reporting” in the notes to the condensed consolidated financial statements in this Quarterly Report. We monitor our reporting segments based upon net income calculated in accordance with accounting principles generally accepted in the United States of America (“GAAP”).\nAs discussed in “Market Conditions” and “Permian Basin Activity” above, our segment revenues are directly influenced by development decisions made by our customers and the overall activity level in the Permian Basin. Accordingly,\nour segment revenues, sales volumes and associated expenses, as further discussed below, fluctuate from period to period based upon those decisions and activity levels.\nFor the Three Months Ended September 30, 2025 as Compared to the Three Months Ended September 30, 2024\nLand and Resource Management\nOil and gas royalties.\nOil and gas royalty revenue was $108.7 million for the three months ended September 30, 2025 compared to $94.4 million for the three months ended September 30, 2024, an increase of $14.3 million. Our share of production increased to 36.3 thousand barrels of oil equivalent (“Boe”) per day for the three months ended September 30, 2025 compared to 28.3 thousand Boe per day for the same period of 2024. The average realized price decreased 10.4% to $34.10 per Boe for the three months ended September 30, 2025 from $38.04 per Boe for the three months ended September 30, 2024.\nThe financial and operational data by royalty stream is presen"
}