{
  "source_file": "tpl-20241231.htm",
  "form_type": "10-K",
  "item1_clean": "Texas Pacific Land Corporation (which, together with its subsidiaries as the context requires, may be referred to as “TPL,” the “Company,” “our,” “we,” or “us”) is a Delaware Corporation and one of the largest landowners in the State of Texas with approximately 873,000 surface acres of land, principally concentrated in the Permian Basin. Additionally, we own a 1/128th nonparticipating perpetual oil and gas royalty interest (“NPRI”) under approximately 85,000 acres of land, a 1/16th NPRI under approximately 371,000 acres of land, and approximately 16,000 additional net royalty acres (normalized to 1/8th) (“NRA”), for a collective total of approximately 207,000 NRA, principally concentrated in the Permian Basin.\nThe Company was originally organized as Texas Pacific Land Trust (the “Trust”) under a Declaration of Trust, dated February 1, 1888 (the “Declaration of Trust”), to receive and hold title to extensive tracts of land in the State of Texas, previously the property of the Texas and Pacific Railway Company. The Declaration of Trust provided for the appointment of trustees (the “Trustees”) to manage the assets of the Trust with all of the powers of an absolute owner. On January 11, 2021, the Trust completed its reorganization from a business trust, Texas Pacific Land Trust, into Texas Pacific Land Corporation, a corporation formed and existing under the laws of the State of Delaware (“the “Corporate Reorganization”).\nOur surface and royalty ownership provide revenue opportunities throughout the oil and gas development value chain. While we are not an oil and gas producer, we benefit from various revenue sources throughout the life cycle of a well. During the initial development phase whereby infrastructure for oil and gas development is constructed, we receive fixed fee payments for use of our land and revenue for sales of materials (caliche) used in the construction of the infrastructure. During the drilling and completion phase, we generate revenue for providing sourced water and/or treated produced water, fixed fee payments for use of our land and revenue related to the sale of sand to operators. During the production phase, we receive revenue from our oil and gas royalty interests and revenue related to saltwater disposal on our land. In addition, we generate revenue from pipeline, power line and utility easements, commercial leases and temporary permits principally related to a variety of land uses, including, but not limited to, midstream infrastructure projects and processing facilities as hydrocarbons are processed and transported to market. Additionally, as a result of an acquisition in 2024, we have recently begun receiving commercial revenue related to a nonhazardous oilfield solids waste disposal site. See further discussion in Note 3, “Assets Acquired in a Business Combination” in the notes to our consolidated financial statements included under Part II, Item 8. “Financial Statements and Supplementary Data.”\nOur mission is to pursue a thoughtful, long-term approach towards optimizing and building upon the commercial and environmental virtues of our extensive lands and resources. We have a long history of responsible management of our legacy assets, and in recent years, we have expanded our business strategy to generate incremental revenue streams that take advantage of our vast surface and royalty footprint, such as our investments in the Water Services and Operations business segment. Beyond our current businesses, we continue to explore new opportunities related to renewable energy, environmental\nsustainability, and technology, among others, that can leverage our existing legacy surface and royalty assets. Our business model emphasizes high cash flow margins and relatively low ongoing capital expenditure requirements, and we expect new opportunities to generally align with these priorities. We remain focused on optimizing long-term value creation and profitability, fostering responsible stewardship of our assets, providing quality customer service, and engaging with and advocating for employee and stakeholder interests.\nOn March 26, 2024, we effected a three-for-one stock split in the form of a stock dividend of two additional shares of common stock, par value $0.01 per share (“Common Stock”), for every share of Common Stock outstanding to stockholders of record as of March 18, 2024. All shares, restricted stock awards (“RSAs”), restricted stock units (“RSUs”), performance stock units (“PSUs”) and per share information have been retroactively adjusted to reflect the stock split. The shares of Common Stock retained a par value of $0.01 per share. Accordingly, an amount equal to the par value of the increased shares resulting from the stock split was reclassified from “Additional paid-in capital” to “Common Stock” on our consolidated balance sheets.\nAcquisition Activity During 2024\nIn August 2024, we acquired 4,120 surface acres in Martin, County, Texas along with other surface-related tangible and intangible assets from an unaffiliated seller, for total cash consideration of $45.0 million, of which $20.4 million represented assets acquired for the Land and Resource Management segment with the remaining $24.6 million of assets acquired for the Water Services and Operations segment. In addition to surface acres, we acquired water sourcing assets and other contractual rights including a contractual right to a 7.5% royalty on revenue generated from a nonhazardous oilfield solids waste disposal site. These assets generate revenue streams across both segments including water sales, produced water royalties, and other surface related (“SLEM”) revenue and provide additional commercial growth opportunities for us to expand water sourcing and produced water opportunities to both new and existing customers. See further discussion of this acquisition in Note 3, “Assets Acquired in a Business Combination” in the notes to our consolidated financial statements included under Part II, Item 8. “Financial Statements and Supplementary Data.”\nAlso in August 2024, we acquired mineral interests across 4,106 NRA located in Culberson County, Texas for a purchase price of $120.3 million, net of post-closing adjustments. The acquisition was completed in conjunction with Brigham Royalties Fund I Holdco, L.L.C., a subsidiary of Brigham Royalties, LLC (“Brigham Royalties”) in an arms-length transaction with an unaffiliated seller. See further discussion of this acquisition in Note 4, “Oil and Gas Royalty Interests” in the notes to our consolidated financial statements included under Part II, Item 8. “Financial Statements and Supplementary Data.” The acquired mineral interests overlap with existing TPL royalty acreage.\nIn October 2024, we acquired 7,490 NRA located primarily in the Midland Basin in Martin, Midland and other counties in Texas and New Mexico, with over 80% of the acquired interests adjacent to or overlapping existing TPL surface and royalty acreage for cash consideration of $275.2 million, net of post-closing adjustments.\n\nThe chart below depicts our total revenues and revenues from customers representing 10% or more of our 2024 consolidated revenues:\nWhile approximately 41% of our 2024 revenue was derived from only three customers, two of these customers are in the top 10, and the remaining customer is in the top 50, energy companies in the world based on market capitalization, and we believe each of them is a strong and reliable operator. Given their major presence in the Permian Basin and our significant surface lands in the same area, the high concentration of business with these three customers is expected. Further, the choice of whom we do business with largely depends on location of mineral royalties and surface rights on or near our assets and consists of a limited universe of oil and gas companies who operate in the Permian Basin.\n\nWhile our business is not seasonal in nature, as that term is generally understood, revenue from oil and gas royalties may fluctuate from period to period based upon market prices for oil and gas and production decisions made by the operators. Our other revenue streams, which include, but are not limited to, water sales and royalties, easements and other surface related income and sales of land, may also fluctuate from period to period. In addition, our results are generally dependent on the decisions and actions of third parties out of our ultimate control. As a consequence, the results of our operations for any particular period are not necessarily indicative of the results of operations for a full year.\n\nOur Water Services and Operations segment encompasses the business of providing full-service water offerings to operators in the Permian Basin through our wholly-owned subsidiary, Texas Pacific Water Resources LLC (“TPWR”).\nThese full-service water offerings include, but are not limited to, water sourcing, produced-water treatment, infrastructure development, and disposal solutions. We are committed to sustainable water development. Our significant surface ownership in the Permian Basin provides TPWR with a unique opportunity to provide multiple full-service water offerings to operators.\nThe revenue streams of this segment principally consist of revenue from sales of sourced and treated water\n\nOil and gas royalties\nEasements and other surface-related income\nTotal Revenue – Land and Resource Management segment\nSee Part II, Item 7. “Management’s Discussion and Analysis of Financial Condition and Results of Operations — Segment Results of Operations” for a discussion of our segment-level financial results.\nOil and Gas Activity for the Year Ended December 31, 2024\nFor the year ended December 31, 2024, our share of crude oil, natural gas and natural gas liquid (“NGL”) production was 26.8 thousand barrels of oil equivalent (“Boe”) per day compared to 23.5 thousand Boe per day for the same period of 2023. The average realized price was $39.87 per Boe for the year ended December 31, 2024, a decrease of 6.4% compared to the average realized price of $42.58 per Boe for the same period of 2023.\nThere are a number of oil and gas wells in which we have royalty interests that have been permitted but are still awaiting drilling and completion activity. In addition, we have also identified oil and gas wells in which we have a royalty interest that have been drilled but are not yet completed (“DUC”). These permitted and DUC wells represent potential near-term\ncandidates for further development by operators towards ultimately being placed into production. We have identified 506 permitted gross wells (an estimated 6.4 net wells) and 793 DUC wells (an estimated 13.2 net wells) subject to our royalty interest as of December 31, 2024. The number of DUC wells is determined using uniform drilling spacing units with pooled interests for all wells awaiting completion.\n\nProduced water royalties\nEasements and other surface-related income\nTotal Revenue – Water Services and Operations segment\nSee Part II, Item 7. “Management’s Discussion and Analysis of Financial Condition and Results of Operations — Segment Results of Operations” for a discussion of our segment-level operating results.\nActivity for the year ended December 31, 2024\nThe increase in water sales during 2024 compared to 2023 is principally due to a 31.0% increase in water sales volumes over the same period.\nIn May 2024, we announced our progress towards developing new solutions for produced water in the Permian Basin. Over the last few years, we have been working with a leading industrial technology and manufacturing firm to develop an energy-efficient desalination and treatment process and associated equipment that can recycle produced water into fresh water with quality standards appropriate for surface discharge and beneficial reuse. With the Permian Basin generating approximately 19 million barrels of produced water per day, we believe this technology would provide an attractive and critical a",
  "item7_clean": "Year Ended December 31, 2023\nConsolidated Revenues and Net Income:\nTotal revenues increased $74.2 million, or 11.8%, to $705.8 million for the year ended December 31, 2024 compared to $631.6 million for the year ended December 31, 2023. This increase was principally due to the $38.5 million increase in water sales, the $19.9 million increase in produced water royalties and the $15.9 million increase in oil and gas royalty revenue in 2024 over 2023. Individual revenue line items are discussed below under “Segment Results of Operations.” Net income of $454.0 million for the year ended December 31, 2024 was 11.9% higher than 2023, principally as a result of the increase in total revenues, partially offset by an increase in operating expenses, as discussed below.\nConsolidated Expenses:\nSalaries and related employee expenses\n. Salaries and related employee expenses were $53.6 million for the year ended December 31, 2024 compared to $43.4 million for 2023. The number of employees increased from 100 at December 31, 2023 to 111 as of December 31, 2024, which, when coupled with market compensation adjustments effective at the beginning of 2024, resulted in increased salary and related employee expenses for the year ended December 31, 2024 compared to 2023. Additionally, contract labor expenses for the year ended December 31, 2024 increased over 2023, principally as a result of the 34.3% increase in water sales over the same period.\nWater service-related expenses\n. Water service-related expenses increased $12.6 million to $46.1 million for the year ended December 31, 2024 compared to 2023. Certain types of water service-related expenses, including, but not limited to, treatment, transfer, water purchases, repairs and maintenance, equipment rental, and fuel costs vary from period to period as our customers’ needs and requirements change. Right of way and other expenses also vary from period to period depending on the location of customer delivery. The increase in water service-related expenses for the year ended December 31, 2024 was principally related to a 34.3% increase in water sales over 2023, primarily as a result of increased water volumes. Research and development expenses related to development of a new energy-efficient method of produced water desalination and treatment were $2.5 million and $1.2 million for the years ended December 31, 2024 and 2023, respectively. For further discussion of this new treatment method, see “Liquidity and Capital Resources — Development of New Solutions for Produced Water and Capital Expenditures” above.\nGeneral and administrative expenses.\nGeneral and administrative expenses decreased $12.0 million to $34.5 million for the year ended December 31, 2024 from $46.5 million for the same period of 2023. The decrease in general and administrative expenses during the year ended December 31, 2024 compared to the same period of 2023 was principally related to a reduction in legal and professional fees associated with stockholder matters that occurred during 2023.\nDepreciation, depletion and amortization\n. Depreciation, depletion and amortization was $25.2 million for the year ended December 31, 2024 compared to $14.8 million for the year ended December 31, 2023. The increase is principally due to additional depletion expense associated with royalty interests acquired in August 2024 and October 2024, as well as additional amortization expense associated with intangible assets acquired in August 2023 and August 2024.\nOther income, net was $39.7 million and $31.5 million for the years ended December 31, 2024 and 2023, respectively. The increase in other income, net was primarily related to increased interest income earned on our cash balances during 2024. Higher interest yields during the year ended December 31, 2024 contributed to the increase in interest income. Additionally, during the year ended December 31, 2024, we recorded a curtailment and settlement gain of $4.6 million related to the Company’s pension plan. See further discussion at Note 8, “Pension and Other Postretirement Benefits” in the notes to our consolidated financial statements included under Part II, Item 8, “Financial Statements and Supplementary Data.”\nTotal income tax expense.\nTotal income tax expense was $124.9 million and $111.9 million for the years ended December 31, 2024 and 2023, respectively. The increase in income tax expense was primarily related to increased operating income resulting from increased consolidated revenues.\nSegment Results of Operations\nWe operate our business in two reportable segments: Land and Resource Management and Water Services and Operations. We eliminate any inter-segment revenues and expenses, if any, upon consolidation.\n\nNet income for the Land and Resource Management segment increased to $314.9 million for the year ended December 31, 2024 compared to $306.7 million for 2023. Segment operating income increased $8.9 million for the year ended December 31, 2024 compared to 2023. The increase was principally due to a $15.9 million increase in oil and gas royalty revenue and a $13.5 million decrease in general and administrative expenses, partially offset by increased depletion expense and salaries and related employee expenses. Expenses are discussed further above under “Results of Operations — Consolidated.”\n\nYear Ended December 31, 2023\nLand and Resource Management\nLand and Resource Management segment revenues increased $8.7 million, or 2.0%, to $440.8 million for the year ended December 31, 2024 as compared to 2023. The increase in Land and Resource Management segment revenues was related to a $15.9 million increase in oil and gas royalty revenue, partially offset by a decrease in easements and other surface-related income of $4.8 million and a decrease in land sales of $2.4 million for the year ended December 31, 2024 compared to 2023.\nOil and gas royalties\n. Oil and gas royalty revenue was $373.3 million for the year ended December 31, 2024 compared to $357.4 million for the year ended December 31, 2023, an increase of 4.5%. Oil and gas royalties for the year ended December 31, 2023 included an $8.7 million recovery with an operator with respect to unpaid oil and gas royalties for older production periods. Excluding the impact of the $8.7 million recovery on 2023 revenue, oil and gas royalties for the year ended December 31, 2024 increased $24.6 million due to increased production volumes over 2023. Our share of production volumes increased to 26.8 thousand Boe per day for the year ended December 31, 2024 compared to 23.5 thousand Boe per day for 2023. The average realized prices decreased to $39.87 per Boe for the year ended December 31, 2024 from $42.58 per Boe for 2023.\nThe table below provides financial and operational data by royalty stream for the years ended December 31, 2024 and 2023:\nYears Ended December 31,\nOur share of production volumes\nEquivalents per day (MBoe/d)\nOil and gas royalties (in thousands):\nNatural gas royalties\nTotal oil and gas royalties\n(1) Commonly used definitions in the oil and gas industry not previously defined: MBbls represents one thousand barrels of crude oil, condensate or NGLs. Mcf represents one thousand cubic feet of natural gas. MMcf represents one million cubic feet of natural gas. MBoe represents one thousand Boe. MBoe/d represents one thousand Boe per day.\n(2) The metrics and dollars provided for the year ended December 31, 2023\n\nWe evaluate the performance of our operating segments separately to monitor the different factors affecting financial results. The reportable segments presented are consistent with our reportable segments discussed in Note 15, “Business Segment Reporting” in the notes to our consolidated financial statements included under Part II, Item 8. “Financial Statements and Supplementary Data.” We monitor our reporting segments based upon revenue and net income calculated in accordance with accounting principles generally accepted in the United States of America (“GAAP”).\nOur oil and gas royalty revenue, and, in turn, our results of operations for the year ended December 31, 2024 have been impacted by lower average commodity prices compared to 2023. However, our oil and gas royalty revenues increased for the year ended December 31, 2024 due to increased royalty production. Additionally, revenues derived from water sales and produced water royalties for the year ended December 31, 2024 were also positively impacted by our active management of our surface and royalty interests in recent years.\nYear Ended December 31, 2024\n\n. Net income for the Water Services and Operations segment was $139.1 million for the year ended December 31, 2024 compared to $98.9 million for the year ended December 31, 2023. Segment operating income increased $44.2 million for the year ended December 31, 2024 compared to 2023. The increase was principally due to a $65.5 million increase in segment revenues which were partially offset by a $12.6 million increase in water service-related expenses and a $10.9 million increase in income tax expense. Expenses are discussed further above under “Results of Operations — Consolidated.”\nNon-GAAP Performance Measures\n\nTPL was originally organized in 1888 as a business trust to hold title to extensive tracts of land in the State of Texas that were previously the property of the Texas and Pacific Railway Company. On January 11, 2021, we completed our Corporate Reorganization from a business trust to a corporation and changed our name from Texas Pacific Land Trust to Texas Pacific Land Corporation.\nOur business activity is generated from our surface and royalty interest ownership, primarily in the Permian Basin. Our revenues are derived from oil and gas royalties, water sales, produced water royalties, easements and other surface-related income and land sales. Due to the nature of our operations and concentration of our ownership in one geographic location, our revenue and net income are subject to substantial fluctuations from quarter to quarter and year to year. In addition to fluctuations in response to changes in the market price for oil and gas, our financial results are subject to decisions by not only the owners and operators of oil and gas wells to which our oil and gas royalty interests relate, but also to other owners and operators in the Permian Basin as it relates to our other revenue streams, principally water sales, produced water royalties, easements and other surface-related revenue.\nAverage oil prices for the year ended December 31, 2024 were relatively flat compared to average oil prices during the same period last year. Oil prices continue to be impacted by certain actions by OPEC+, geopolitics, and evolving global supply and demand trends, among other factors. Average natural gas prices during 2024 decreased compared to average prior year natural gas prices. Global and domestic natural gas markets have experienced volatility due to macroeconomic conditions, infrastructure and logistical constraints, weather, and geopolitics, among other factors. Since mid-2022, the Waha Hub located in Pecos County, Texas has at times experienced significant negative price differentials relative to Henry Hub, located in Erath, Louisiana, due in part to growing local Permian natural gas production and limited natural gas pipeline takeaway capacity. Midstream infrastructure is currently being developed by operators to provide additional takeaway capacity, though the impact on future basis differentials will be dependent on future natural gas production and other factors. Changes in global and domestic macro-economic conditions could result in additional shifts in oil and gas supply and demand in future periods. Although our revenues are directly and indirectly impacted by changes in oil and natural gas prices, we believe our royalty interests (which require no capital expenditures or operating expense burden from us for well development), strong balance sheet, and liquidity position will help us navigate through potential commodity price volatility.\nPermian Basin Activity\nThe Permian Basin is one of the oldest and most well-known hydrocarbon-producing areas and currently accounts for a substantial portion of oil and gas production in the United States, covering approximately 86,000 square miles in 52 counties across southeastern New Mexico and western Texas. Exploration and production (“E&P”) companies active in the Permian have generally increased their drilling and development activity in 2024 compared to recent prior year activity levels. Per the U.S. Energy Information Administration (“EIA”), Permian production averaged approximately 6.3 million barrels per day during 2024, which represents the highest annual production ever. The EIA currently estimates that Permian oil production for December 2024 was approximately 6.5 million barrels per day.\nDue to our ownership concentration in the Permian Basin, our revenues are directly impacted by oil and gas pricing and drilling activity in the Permian Basin. The metrics below show selected benchmark oil and natural gas prices and approximate activity levels in the Permian Basin for the years ended December 31, 2024 and 2023:\nYears Ended December 31,\nOil and Gas Pricing Metrics:\nWTI Cushing average price per bbl\nHenry Hub average price per mmbtu\nWaha Hub natural gas average price per mmbtu\nActivity Metrics specific to the Permian Basin:\nAverage monthly horizontal permits\nAverage monthly horizontal wells drilled\nAverage weekly horizontal rig count\nDUCs as of December 31 for each applicable year\nTotal Average US weekly horizontal rig count\n(1) Commonly used definitions in the oil and gas industry provided in the table above are defined as follows: WTI Cushing represents West Texas Intermediate. Bbl represents one barrel of 42 U.S. gallons of oil. Mmbtu represents one million British thermal units, a measurement used for natural gas. DUCs represent drilled but uncompleted wells. DUC classification is based on well data and date stamps provided by Enverus. DUCs is based on wells that have a drilled/spud date stamp but do not have a completed or first production date stamp. Excludes wells that have been labeled plugged and abandoned or permit expired and wells drilled/spud more than five years ago.\n(2) Permian Basin specific information per Enverus analytics. US weekly horizontal rig counts per Baker Hughes United States Rotary Rig Count for horizontal rigs. Statistics for similar data are also available from other sources. The comparability between these other sources and the sources used by the Company may differ.\nWhile average oil prices for the year ended December 31, 2024 were generally flat compared to the same period in 2023, Henry Hub and Waha Hub natural gas prices for the year ended December 31, 2024 declined compared to the same period last year. E&P companies generally have continued to deploy capital at a measured pace as drilling and development activities across the Permian Basin have remained strong overall. Although average rig counts during the year ended December 31, 2024 were lower compared to the same period last year, increased drilling and completion efficiencies have allowed operators to maintain robust levels of well development. As we are a significant landowner in the Permian Basin and not an oil and gas producer, our revenue is affected by the development decisions made by companies that operate in the areas where we own royalty interests and land. Accordingly, these decisions made by others affect not only our share of production volumes and produced water disposal volumes, but also directly impact our surface-related income and water sales.\n\nAcquisition Activity\nWe completed the following asset acquisitions and business combination during 2024:\nAcquired mineral interests across 7,490 NRA located primarily in the Midland Basin in Martin, Midland and other counties in Texas and New Mexico for cash consideration of $275.2 million",
  "item2_clean": null
}