{
  "source_file": "trgp-20250930.htm",
  "form_type": "10-Q",
  "item1_clean": null,
  "item7_clean": null,
  "item2_clean": "In August 2025, we announced a 43-mile extension of our Bull Run intrastate natural gas pipeline (the “Bull Run Extension”) to expand and enhance connectivity of our Permian Delaware system to the WAHA hub in West Texas. The Bull Run Extension is expected to begin operations in the first quarter of 2027.\nIn September 2025, we announced a new 35-mile intrastate natural gas pipeline that will enhance connectivity across several of our plants in the Permian Midland and a 55-mile conversion of an existing Targa pipeline into natural gas service (together, “Buffalo Run”) that will connect our Permian Midland and Permian Delaware intra-basin natural gas systems. Buffalo Run is expected to be completed in stages and fully complete in early 2028.\nIn November 2025, we announced the Forza Pipeline (“Forza”), a new 36-mile interstate natural gas pipeline in Permian Delaware that will connect our new and existing gas plants and enhance connectivity to the Waha hub. Forza will shortly file a certificate application with the Federal Energy Regulatory Commission and is expected to begin operations in the middle of 2028, pending receipt of necessary regulatory approvals.\n\nIn November 2024, we announced the construction of a new 275 MMcf/d cryogenic natural gas processing plant in Permian Delaware (the “Falcon II plant”). The Falcon II plant is expected to begin operations in the second quarter of 2026.\nIn November 2024, we announced the construction of a new 275 MMcf/d cryogenic natural gas processing plant in Permian Midland (the “East Driver plant”). The East Driver plant is expected to begin operations in the third quarter of 2026.\nIn September 2025, we announced the construction of a new 275 MMcf/d cryogenic natural gas processing plant in Permian Delaware (the “Yeti plant”). The Yeti plant is expected to begin operations in the third quarter of 2027.\nIn November 2025, we announced the construction of a new 275 MMcf/d cryogenic natural gas processing plant in Permian Delaware (the “Copperhead plant”). The Copperhead plant is expected to begin operations in the first quarter of 2027.\n\nIn August 2023, we announced the construction of a new 275 MMcf/d cryogenic natural gas processing plant in Permian Delaware (the “Bull Moose plant”). The Bull Moose plant commenced operations in the first quarter of 2025\nIn May 2024, we announced the construction of a new 275 MMcf/d cryogenic natural gas processing plant in Permian Midland (the “Pembrook II plant”). The Pembrook II plant commenced operations in the third quarter of 2025.\nIn August 2024, we announced the construction of a new 275 MMcf/d cryogenic natural gas processing plant in Permian Delaware (the “Bull Moose II plant”). The Bull Moose II plant commenced operations in the fourth quarter of 2025.\nIn August 2024, we announced the construction of a new 275 MMcf/d cryogenic natural gas processing plant in Permian Midland (the “East Pembrook plant”). The East Pembrook plant is expected to begin operations in the second quarter of 2026.\n\nThe change in net cash provided by (used in) financing activities was due to higher proceeds from debt financings in 2025, and lower distributions to noncontrolling interests subsequent to the CBF Acquisition in the fourth quarter of 2024 and the Badlands Transaction in the first quarter of 2025, partially offset by higher repurchases of noncontrolling interests due to the Badlands Transaction and higher dividends paid. The increase in cash flows from our debt activity was due to higher net borrowings of our senior unsecured notes in 2025 and higher net borrowings under the Securitization Facility, partially offset by lower net borrowings under the Commercial Paper Program. In addition, in 2024, we fully repaid the remaining balance outstanding under the $1.5 billion unsecured term loan facility.\n\nAs of September 30, 2025, inclusive of our consolidated joint venture accounts, we had $124.1 million of Cash and cash equivalents on our Consolidated Balance Sheets. On a consolidated basis, our main sources of liquidity and capital resources are internally generated cash flows from operations, borrowings under the TRGP Revolver, the Commercial Paper Program, the Securitization Facility, and access to debt and equity capital markets. We supplement these sources of liquidity with joint venture arrangements and proceeds from asset sales. Our exposure to adverse credit conditions includes our credit facilities, cash investments, hedging abilities, customer performance risks and counterparty performance risks.\n\nIn February 2025, we announced an intra-Delaware Basin expansion of our Grand Prix pipeline system in Permian Delaware. The expansion is expected to begin operations in the second quarter of 2026.\nIn September 2025, we announced plans to construct the Speedway NGL Pipeline (“Speedway”) which will transport NGLs from our existing assets and future plant additions in the Permian Basin to our fractionation and storage complex in Mont Belvieu, Texas. The project consists of approximately 500 miles of 30-inch diameter pipeline and associated infrastructure with an initial capacity of approximately 500 MBbl/d, expandable to 1,000 MBbl/d. Speedway is expected to begin operations in the third quarter of 2027.\n\nThe primary drivers of cash flows from operating activities are: (i) the collection of cash from customers from the sale of NGLs and natural gas, as well as fees for processing, gathering, export, fractionation, terminaling, storage and transportation; (ii) the payment of amounts related to the purchase of NGLs and natural gas; and (iii) the payment of other expenses, primarily field operating costs, general and administrative expense and interest expense. In addition, we use derivative instruments to manage our exposure to commodity price risk. Changes in the prices of the commodities we hedge impact our derivative settlements as well as our margin deposit requirements on unsettled futures contracts.\n\nThe profitability of our business is a function of the difference between: (i) the revenues we receive from our operations, including fee-based revenues from services and revenues from the natural gas, NGLs, crude oil and condensate we sell, and (ii) the costs associated with conducting our operations, including the costs of wellhead natural gas, crude oil and mixed NGLs that we purchase as well as operating, general and administrative costs and the impact of our commodity hedging activities. Because commodity price movements tend to impact both revenues and costs, increases or decreases in our revenues alone are not necessarily indicative of increases or decreases in our profitability. Our contract portfolio, the prevailing pricing environment for natural gas, NGLs and crude oil, the impact of our commodity hedging program and its ability to mitigate exposure to commodity price movements, and the volumes of natural gas, NGLs and crude oil throughput on our systems are important factors in determining our profitability. Our profitability is also affected by the NGL content in gathered wellhead natural gas, supply and demand for our products and services, utilization of our assets and changes in our customer mix.\n\nRepresents adjustments related to our subsidiaries with noncontrolling interests, including depreciation and amortization expense as well as earnings for certain plants within our WestTX joint venture not subject to noncontrolling interest accounting.\nLitigation expense includes charges related to litigation resulting from the major winter storm in February 2021 that we consider outside the ordinary course of our business and/or not reflective of our ongoing core operations. We may incur such charges from time to time, and we believe it is useful to exclude such charges because we do not consider them reflective of our ongoing core operations and because of the generally singular nature of the claims underlying such litigation.\nExcludes amortization of interest expense. The nine months ended September 30, 2024 includes $55.8 million of interest expense on a 2024 legal ruling associated with an agreement, dated December 27, 2015, for crude oil and condensate between Targa Channelview LLC, then a subsidiary of the Company, and Noble Americas Corp (the “Splitter Agreement”).\nRepresents capital expenditures, net of any reimbursements of project costs and contributions from noncontrolling interests, and includes contributions to investments in unconsolidated affiliates.\n\nSegment operating statistics include the effect of intersegment amounts, which have been eliminated from the consolidated presentation. For all volume statistics presented, the numerator is the total volume sold during the period and the denominator is the number of calendar days during the period.\nPlant natural gas inlet represents our undivided interest in the volume of natural gas passing through the meter located at the inlet of a natural gas processing plant.\nPlant natural gas inlet volumes and gross NGL production volumes include producer take-in-kind volumes, while natural gas sales and NGL sales exclude producer take-in-kind volumes.\nPermian Midland includes operations in WestTX, of which we own a 72.8% undivided interest, and other plants that are owned 100% by us. Operating results for the WestTX undivided interest assets are presented on a pro-rata net basis in our reported financials.\nOperations include facilities that are not wholly owned by us.\nBadlands natural gas inlet represents the total wellhead volume and includes the Targa volumes processed at the Little Missouri 4 plant.\nAverage realized prices, net of fees, include the effect of realized commodity hedge gain/loss attributable to our equity volumes. The price is calculated using total commodity sales plus the hedge gain/loss as the numerator and total sales volume as the denominator, net of fees.\n\nIn January 2023, we reached an agreement with our partners in Gulf Coast Fractionators (“GCF”) to reactivate GCF’s"
}