{
  "source_file": "trmb-20251003.htm",
  "form_type": "10-Q",
  "item1_clean": null,
  "item7_clean": null,
  "item2_clean": "ITEM 2. MANAGEMENT’S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS\nCRITICAL ACCOUNTING POLICIES AND ESTIMATES\nRECENT ACCOUNTING PRONOUNCEMENTS\nFor a summary of recent accounting pronouncements applicable to our Condensed Consolidated Financial Statements, refer to\n“Overview and Accounting Policies”\nEXECUTIVE LEVEL OVERVIEW\nWe are a leading provider of technology solutions that enable professionals and field mobile workers to improve or transform their work processes. Our comprehensive work process solutions are used across a range of industries, including architecture, building construction, civil engineering, geospatial, survey and mapping, natural resources, utilities, transportation, and government. Our representative customers include construction owners, contractors, engineering and construction firms, surveying companies, energy and utility companies, trucking companies, and state, federal, and municipal governments.\nOur growth strategy is centered on multiple elements:\nExecute on our Connect & Scale strategy;\nDeliver customer outcomes that can enable productivity, quality, safety, transparency, and environmental sustainability;\nFocus on software and services;\nAddress attractive markets with significant growth and profitability potential;\nCapitalize on domain knowledge and technological innovation that benefit a diverse customer base;\nDrive geographic expansion with a localization strategy;\nOptimize go-to-market strategies to best access our markets; and\nPursue strategic and targeted acquisitions, divestitures, joint ventures, and investments.\nOur focus on these growth drivers has led over time to growth in revenue and profitability and an increasingly diversified business model. We continue to experience a shift toward a more significant mix of recurring revenue as demonstrated by our success in driving annualized recurring revenue (“ARR”) of $2,310.3 million, which represents growth of 6% year-over-year at the end of the third quarter of 2025. Excluding the impact of foreign currency, acquisitions, and divestitures, organic ARR growth was 14%. This shift toward recurring revenue has positively impacted our revenue mix, growth, and profitability over time and is leading to improved visibility in our businesses. Our software, services, and recurring revenue represented 78% and 76% of total revenue for the third quarter of 2025 and 2024, and 78% and 75% of total revenue for the first three quarters of 2025 and 2024. Additionally, we continue to maintain focus on increasing our mix of higher margin recurring revenue, which was accelerated by the Ag divestiture that closed in the second quarter of 2024 and the Mobility divestiture that closed in the first quarter of 2025.\nAs our solutions have expanded, our go-to-market model has also evolved with a balanced mix between direct, distribution, and OEM customers as well as enterprise-level customer relationships.\nanagement’s Discussion and Analysis of Financial Condition and Results of Operations” section, we refer to organic revenue growth, which is a non-GAAP measure. For a full definition of ARR, organic ARR, and organic revenue growth as used in this discussion and analysis, refer to the\n“Supplemental Disclosure of Non-GAAP Financial Measures and Annualized Recurring Revenue”\nbelow in this Item 2.\nImpact of Recent Events on Our Business\nAcquisitions and Divestitures\nWe acquire businesses that align with our long-term growth strategies, including our strategic product roadmap and, conversely, we divest certain businesses that no longer fit those strategies. This is demonstrated by the 13 acquisitions and 23 divestitures that we have completed since 2020.\nMobility Divestiture\nOn February 8, 2025, we completed the sale of our Mobility business to Platform Science in exchange for equity ownership interests with a fair value of $253.9 million. The fair value was based on unobservable inputs, including discounted cash flow projections, market comparables, and an option pricing model. Following the closing of the transaction, we own, or\nhave rights to acquire,\n32.5% of Platform Science’s expanded business comprised of (i) shares of preferred stock, with certain liquidation preferences, that represent 28.5% ownership, and (ii) common stock warrants allowing us the rights to acquire 4% of additional ownership.\nUpon closing of the transaction, we deconsolidated $277.3 million of net assets including $145.3 million of goodwill, and we recorded our equity investment at its fair value under the measurement alternative election, which represents a non-cash investing activity. As a result, we recognized a cumulative, pre-tax loss of $30.6 million from the held for sale date in the third quarter of 2024 to the closing date. Mobility was reported as a part of our T&L segment.\nThe combined business aims to enhance driver experience, fleet safety, efficiency, and compliance by combining two cutting-edge in-cab commercial vehicle ecosystems.\nOn April 1, 2024, we completed the sale and contribution of our Ag business to AGCO in exchange for $1.9 billion of cash proceeds and an equity ownership interest in PTx Trimble, a JV that was formed by Trimble and AGCO, with a fair value of $275.6 million. The fair value was based on a combination of the equity value, primarily the transaction price, and an option pricing model for a put and call option. Following the closing of the transaction, we own 15% of the JV.\nUpon closing of the transaction, we deconsolidated $457.3 million of net assets, including $357.4 million of goodwill, and we recorded our equity investment at its fair value under the equity method of accounting, which represents a non-cash investing activity. As a result, we recognized a pre-tax gain of $1.7 billion in the second quarter of 2024, which includes the gain for our retained 15% ownership interest in the JV. The sale and contribution of the Ag business excluded certain GNSS and guidance technologies. Ag was reported as a part of our Field Systems segment.\nThe formation of the JV is expected to better serve farmers with factory-fit and aftermarket applications in the mixed fleet precision agriculture market to help farmers drive productivity, efficiency, and sustainability.\nMacroeconomic Conditions\nMacroeconomic conditions continue to present significant challenges globally, driven by geopolitical tensions, tariff and trade policies, exchange rate and interest rate volatility, and persistent inflationary pressures. The heightened trade tensions and related imposition of tariffs and export control restrictions between the United States and its trading partners, the extent and duration of these tariffs, and their impact on global economic conditions remain uncertain and depend on various factors, including international negotiations, policy responses, potential exemptions, and shifts in global supply and demand. If there were to be a deterioration in the global economy, the economies of the countries or regions where our customers are located or do business, or the industries that we or our customers serve, the demand for our products and services may decrease. We are closely monitoring global trade developments and have contingency plans in place to respond to a variety of potential market scenarios. We are also monitoring the impact of the U.S. federal government shutdown, which has not had a material impact on our business to date.\nRESULTS OF OPERATIONS\nThe following table shows revenue by category, gross margin and gross margin as a percentage of revenue, operating income and operating income as a percentage of revenue, diluted earnings per share, and annualized recurring revenue compared for the periods indicated:\n\nSubscription and Services\nSubscription and Services\nForeign currency exchange\nNote that the fiscal year of 2025 began on January 4, 2025 compared to the fiscal year of 2024, which began on December 30, 2023. This significantly impacted overall Company and AECO year-over-year comparisons in the first quarter and first three quarters due to the timing of revenue recognition for January 1 annual software term license renewals (“software renewals”). For the total Company, the estimated impact of the software renewals was $49.6 million or a 2% negative impact on revenue growth for the first three quarters. For AECO, the estimated impact was $49.0 million or a 5% negative impact on AECO segment revenue growth for the first three quarters.\nTotal organic revenue increased for the third quarter and the first three quarters primarily due to subscription and services growth. In addition, the revenue increase for the first three quarters was partially offset by the timing impact of prior year AECO software renewals.\nOrganic product revenue increased for the third quarter primarily due to strong end-user demand for Civil Construction solutions. Organic product revenue was flat for the first three quarters due to strong end-user demand for Civil Construction solutions, mostly offset by lower demand in surveying.\nOrganic subscription and services revenue increased for the third quarter and the first three quarters primarily due to strong subscription growth across all segments, with particular strength in both AECO and Field Systems and, to a lesser extent, software term license growth. The increase for the first three quarters was partially offset by the impact of prior year AECO software renewals.\nGross margin and gross margin as a percentage of revenue increased for the third quarter and first three quarters primarily due to the improved mix of higher margin subscription and software term license sales, lower intangible amortization cost due to fully amortized intangibles, as well as the divestiture of lower margin businesses.\nOperating income increased for the third quarter and first three quarters primarily due to organic revenue and gross margin expansion, partially offset by the loss of divestiture income and higher operating ex"
}