{
  "source_file": "trmb-20250103.htm",
  "form_type": "10-K",
  "item1_clean": "Our Transporeon solutions cover the transportation lifecycle from freight sourcing and procurement, through freight execution including dock and yard management all the way to freight auditing. Our collective offerings position us uniquely to help customers tackle everyday challenges in the supply chain industry. Our products aim to solve problems where they occur—in between companies—and hence are aimed for collaboration, interoperability, and data-driven decision making. Each Transporeon product can be used standalone or in combination with each other. With the amount of data we generate every day—up to approximately 200,000 transports and dock scheduling appointments get executed and booked on the Transporeon platform daily—we are able to provide data insights and market benchmarks, and enable our customers to use Generative AI enabled products, which base the decision making and learning on historical data as well as a constantly growing set of new information.\nDuring 2024, we had a number of developments in T&L. In September 2024, Trimble and Platform Science announced a partnership to transform the transportation industry through a definitive agreement for Platform Science to acquire\nour Mobility business.\nThe transaction closed on\nand Trimble became a shareholder in Platform Science’s expanded business. Additionally, (i) we integrated our real-time visibility solutions from Trimble and Transporeon for workflows to improve customer service and operational efficiency by giving customers the ability to notify their ecosystems of exceptions and delays with their shipments in real-time; and (ii) Transporeon offerings were standardized on Trimble Maps and PC*Miler routing offering customers the benefit of Trimble’s commercial routing solution globally.\nThe T&L segment generally sells directly to end users and OEMs. Competitors in this segment are typically companies that provide transportation management software, and digital freight matching. We compete principally on the basis of interoperability, domain expertise, customer support and service, price, innovative product offerings, quality, and the completeness of our solutions.\nSeasonality of Business\nConstruction equipment revenue, within our Field Systems segment, historically has been higher in early spring. However, overall, as a company, we are experiencing less seasonality as a result of the diversification of our businesses across segments and the increased impact of software and subscription revenue. Changes in global macroeconomic conditions could also impact the level of seasonality we experience.\nWe outsource the manufacturing of many of our hardware products to our key contract manufacturing partners that include Jabil and Benchmark Electronics Inc. Our contract manufacturing partners are responsible for significant material procurement, assembly, and testing. We continue to manage product design through pilot production for the subcontracted products, and we are directly involved in qualifying suppliers and key components used in all our products. We also utilize original design manufacturers for some of our products.\nWe manufacture our optics-based products, as well as some of our GPS products, at our plants in Dayton, Ohio and Danderyd, Sweden\nSome of these products or portions of these products are also subcontracted to third parties for assembly.\nOur primary design, manufacturing, and distribution sites in Dayton, Ohio; Sunnyvale, California; Eindhoven, Netherlands; and Danderyd, Sweden\nregistered to ISO9001:2015 covering the design, production, distribution, and servicing of our products.\nResearch and Development and Intellectual Property\nWe believe that our competitive position is maintained through the development and introduction of new products, including software and services. Trimble delivers digital technologies that enhance the physical world by integrating and connecting industry workflows, stakeholders, and data, while modernizing its interfaces and business models to make it easier for customers to do business. Our platform investments allow us to extend our differentiation in positioning and sensing, modeling, and analytics into emerging industry solutions and to drive ecosystem collaboration across our target industries. This improves our value over the customer lifecycle, while enhancing our leadership in software and services, which already accounts fo\nr over 70% of our R&D investment. O\nur investments enable us to push the state-of-the-art in key technology areas and to connect other leading technologies to solve customer problems in new and unique ways.\nAs part of our technology development practices, we actively establish and maintain our intellectual property rights through the use of patents, copyrights, trademarks, and trade secret laws. We hold over\nunique issued and enforceable patents covering key technology areas, including precision GNSS, optical and inertial positioning solutions, AI and machine learning, IoT, cloud computing, laser scanning, 3D modeling, point cloud processing, augmented reality, and many others.\nOur patent portfolio is continuously updated with new patent grants that emerge from our investments in R&D.\nWe actively manage the intellectual property used in the development, operations, and sales of our products and services. We also own numerous trademarks and service marks that contribute to the identity and recognition of Trimble and that of its global products and services.\nWe value sustainability, and we are taking action to harness our potential to address global challenges. Inspired by our mission of “Transforming the Way the World Works,” and fueled by the dedication of our employees, we are working to build momentum and strive for continual improvement and measurable progress in shaping a sustainable future.\nSustainability is deeply integrated into our business strategy, threaded throughout our products and solutions and our people and culture. It’s what guides our innovations and investments. It’s what drives us to build resilience for our company and our customers, to foster our people and culture, and to lead with integrity in all that we do.\nEnable customers to adapt, grow and thrive in the face of change\nDriving decarbonization in our own operations and supply chain\nGuided by our values of Belong, Grow, and Innovate\nActivated by our leadership capabilities of Inspire, Engage and Achieve\nLeading with Integrity\nCorporate and Sustainability Governance\nEthical Business Practices\nPrivacy and Cybersecurity\nBuilding Resilience.\nWe build resilience for our customers, our company, and our supply chain. Our technologies in positioning, modeling, and data analytics help our customers take meaningful, precise action, including for sustainability challenges. By connecting the physical and digital worlds, our solutions provide the information to make the right decisions at the right time. We are working throughout our value chain, with suppliers and customers, as well as within our own operations, toward a more sustainable future.\nOur core growth strategy for our customers includes: (i) our Connect & Scale strategy through industry cloud platforms to optimize customers’ work for maximum collaboration, effectiveness, and efficiencies; (ii) enabling our customers to make better decisions and work smarter; and (iii) investing in cutting-edge innovation through new ventures to accelerate digital transformation in the industries we serve.\nWe continue to apply our innovation and efficiency capabilities in line with our own climate action roadmap. Guided by our Science-Based Targets initiative (SBTi), approved enterprise-level GHG emissions reduction targets, we continue to work towards (i) cutting our GHG footprint in half by 2030; (ii) source 100% renewable energy by 2025; and (iii) engage 70% of our suppliers to set their own science-based emission reduction targets by 2026\nThe SBTi covers our two absolute reduction targets: (i) Trimble commits to reduce absolute scope 1 and 2 GHG emissions 50% by 2030 from a 2019 base year; and (ii) Trimble commits to reduce absolute scope 3 GHG emissions from fuel and energy related activities, business travel, and upstream transportation and distribution 50% by 2030 from a 2019 base year.\nGuided by our values of Belong, Grow, and Innovate, our community of talented and innovative employees creates opportunities for our customers and community members to thrive. As further described in the below Human Capital section, our focus on our values enables our employees to do their best work and empowers them to better solve complex problems for our customers and the communities that we serve.\nLeading with Integrity.\nWe are dedicated to leadership principles that ensure excellence in all we do. Through transparency, good governance, and a deep commitment to sustainability and ethics, we continue operating from a strong foundation of integrity now and in the future.\nSupported by the Audit Committee, People and Compensation Committee, and Nominating and Corporate Governance Committee, the Board of Directors reviews, monitors, and guides our sustainability strategy, commitments, and accountability for risk management. Our executive management team further executes the strategies and steers operations.\nOur operations adhere to key guiding policies, such as our Environmental Policy and Human Rights and Labor Policy. The Code of Business Conduct provides the tools and information necessary for our team and partners to maintain high ethical standards and business integrity.\nOur culture reflects our guiding principles at work and is fundamental to sustaining our success. That company culture is foundational to a thriving workplace; it is the behaviors and values of leaders and employees that are the foundation for who we are. At Trimble, we value being yourself and thriving together; being intentional and humble; and being curious and solving problems. Our leaders inspire purpose and vision, engage to draw out the best from each other, and strive to achieve meaningful results. This mindset shapes how we treat one another and how we serve our customers, colleagues, and stockholders.\nAt the end of 2024, we employed over 12,100 full-time and part-time employees, the overwhelming majority of which were full-time employees. Approximately 42%, 34%, 19%, and 5% of employees reside in North America, Europe, Asia-Pacific, and the rest of the world. Our employees work in over 40 countries.\nWe are committed to providing every employee the opportunity to learn, grow, and excel in a collaborative environment where everyone feels they belong. We believe that a variety of experiences and perspectives fuels innovation and drives our best thinking. Our leaders activate their teams through our leadership capabilities of Inspire, Engage, and Achieve. They inspire their teams by fostering a shared vision built on integrity and aspiration; they engage them through opportunities that cultivate humility, curiosity, and collaboration; and they strive to achieve exceptional results for our customers through relentless innovation. Our leaders cultivate an environment of collaboration, innovation, and growth, helping ensure every employee is empowered to contribute their best.\nWe engage employees in a variety of ways that promote open, transparent communication. Our global engagement surveys are designed to encourage employees to share meaningful feedback that allows us to celebrate our strengths and openly talk about areas that require improvement and continued focus. Our performance management program focuses on aligning managers and employees on priorities that best contribute to our strategic objectives and also fosters coaching and feedback that reinforces our shared values.\nThrough our internal global talent platform, we empower employees to identify internal job opportunities, skill development resources, and projects to achieve their personal development goals",
  "item7_clean": "Item 7. Management’s Discussion and Analysis of Financial Condition and Results of Operations\nEXECUTIVE LEVEL OVERVIEW\nWe are a leading provider of technology solutions that enable professionals and field mobile workers to improve or transform their work processes. Our comprehensive work process solutions are used across a range of industries including architecture, building construction, civil engineering, geospatial, survey and mapping, natural resources, utilities, transportation, and government. Our representative customers include construction owners, contractors, engineering and construction firms, surveying companies, energy and utility companies, trucking companies, and state, federal, and municipal governments. Further information on our business is presented in Part I,\nOur growth strategy is centered on multiple elements:\nExecute on our Connect & Scale strategy;\nDeliver customer outcomes that can enable productivity, quality, safety, transparency, and environmental sustainability;\nFocus on software and services;\nAddress attractive markets with significant growth and profitability potential;\nCapitalize on domain knowledge and technological innovation that benefit a diverse customer base;\nDrive geographic expansion with a localization strategy;\nOptimize go-to-market strategies to best access our markets; and\nPursue strategic and targeted acquisitions, divestitures, joint ventures, and investments.\nOur focus on these growth drivers has led over time to growth in revenue and profitability and an increasingly diversified business model. We continue to experience a shift toward a more significant mix of recurring revenue as demonstrated by our success in driving annualized recurring revenue (“ARR”) of\n$2,257.8 million, which represents growth of 14% year-over-year\n. Excluding the impact of foreign currency, acquisitions, and divestitures, organic ARR growth was\nshift toward recurring revenue h\nas positively impacted our revenue mix, growth, and profitability over time and is leading to improved visibility in our businesses.\nOur software, services, and recurring revenue represented 76% and 67% of total revenue for 2024 and 2023.\nAdditionally, we continue to maintain focus on increasing our mix of recurring revenue, which is accelerated by the Transporeon\nacquisition that closed in the second quarter of 2023\nthe Ag divestiture that closed in the second quarter of 2024\nAs our solutions have expanded, our go-to-market model has also evolved with a balanced mix between direct, distribution, and OEM customers as well as enterprise-level customer relationships.\nThroughout this “Management’s Discussion and Analysis of Financial Condition and Results of Operations” section, we refer to organic revenue growth, which is a non-GAAP measure. For a full definition of ARR, organic ARR, and organic revenue growth as used in this discussion and analysis, refer to the\n“Supplemental Disclosure of Non-GAAP Financial Measures and Annualized Recurring Revenue”\nfound later in this Item 7.\nImpact of Recent Events on Our Business\nAcquisitions and Divestitures\nWe acquire businesses that align with our long-term growth strategies including our strategic product roadmap and, conversely, we divest certain businesses that no longer fit those strategies. This is demonstrated by the 12 acquisitions and 23 divestitures that we have completed since 2020, including the Transporeon acquisition, the Ag divestiture, and the Mobility divestiture.\nMobility Divestiture\nOn September 14, 2024, we entered into a definitive agreement with Platform Science to sell our Mobility business. Subsequent to the end of the year 2024, the transaction closed on\nFebruary 8, 2025 resulting in our\n, or rights to acquire ownership of\n32.5% of Platform Science’s expanded business with an approximate fair value of $248.7 million. The approximate fair value was determined based on unobservable inputs, including discounted cash flow projections, market comparables, and an option pricing model. We received (i) shares of preferred stock of Platform Science, with\ncertain liquidation preferences, that represent 28.5% of Platform Science’s expanded business and (ii) warrants allowing us the rights to acquire 4% of Platform Science’s expanded business. The combined businesses aim to enhance driver experience, fleet safety, efficiency, and compliance by combining two cutting-edge in-cab commercial vehicle ecosystems, which gives customers access to more applications and offerings.\nThe assets and liabilities of Mobility were classified as held for sale beginning in the third quarter of 2024. A valuation allowance was established to reduce the carrying value of the disposal group assets to the approximate fair value of the consideration we would receive. As a result, we recorded a pre-tax loss of approximately $32.9 million included within Divestitures gain, net in our Consolidated Statements of Income in 2024.\nUpon the closing of the transaction in the first quarter of 2025, we derecognized the assets and liabilities that were transferred and recorded our equity investment at its cost. Mobility was reported as a part of our T&L segment. See\nin Item 8 of this report.\nOn September 28, 2023, we executed a Sale and Contribution Agreement with AGCO that provided for the formation of a joint venture, called PTx Trimble, that operates in the mixed fleet precision agriculture market. The agreement was amended and restated on March 31, 2024, and the transaction closed on April 1, 2024. Under the terms of the agreement, we contributed our Ag business, excluding certain GNSS and guidance technologies, in exchange for $1.9 billion in cash proceeds, subject to working capital adjustments. Following the closing of this transaction, we own 15% and AGCO owns 85% of PTx Trimble. In addition to forming PTx Trimble, the parties concurrently entered into agreements that include the following: (i) long-term supply agreement for key GNSS and guidance technologies, (ii) technology transfer and license agreement, (iii) trademark license agreement, (iv) master sale and distribution agreement for positioning services, and (v) transition services agreement. Ag was reported as a part of our Field Systems segment.\nUpon closing of the transaction in the second quarter of 2024, we recognized a pre-tax gain of $1.7 billion. The gain included $275.6 million for our retained 15% ownership interest in PTx Trimble, an LLC, which is reported as an equity method investment.\nThe formation of PTx Trimble is expected to better serve farmers with factory fit and aftermarket applications in the mixed fleet precision agriculture market to help farmers drive productivity, efficiency, and sustainability. Additionally, the transaction is expected to (i) simplify our Connect & Scale strategy, (ii) reduce risk of channel transition in the agriculture market, and (iii) enhance our financial profile and flexibility with a resulting higher mix of software, services, and recurring revenue.\nWe repaid $1.0 billion of our variable-rate debt through use of the net proceeds and expect to use the majority of the remaining proceeds after tax to repurchase stock.\nMacroeconomic Conditions\nMacroeconomic conditions continue to present significant challenges globally, driven by geopolitical tensions, tariff and trade policies, exchange rate and interest rate volatility, and persistent inflationary pressures. The heightened trade tensions and related imposition of tariffs between the United States and its trading partners, the extent and duration of these tariffs, and their impact on global economic conditions remain uncertain and depend on various factors, including international negotiations, policy responses, potential exemptions, and shifts in global supply and demand. These evolving dynamics may have a negative impact on our business operations. In response, we are closely monitoring global trade developments and considering ways to mitigate potential impacts on our business.\nCRITICAL ACCOUNTING POLICIES AND ESTIMATES\nThe preparation of financial statements and related disclosures in conformity with U.S. GAAP requires us to make judgments, assumptions, and estimates that affect the reported amounts of assets, liabilities, revenue, costs of sales, operating expenses, and related disclosures. We consider the accounting polices described below to be our critical accounting policies. These critical accounting policies are impacted significantly by judgments, assumptions, and estimates used in the preparation of the consolidated financial statements, and actual results could differ materially from the amounts reported based on these policies. Our accounting policies are more fully described in\nNote 1 “Description of Business and Accounting Policies”\nin Item 8 of this report.\nRevenue is recognized upon transfer of control of promised products or services to customers in an amount that reflects the consideration we expect to receive in exchange for those products or services. Revenue is recognized net of allowance for returns and any taxes collected from customers. We enter into contracts that may include various combinations of products and services, which are generally capable of being distinct and accounted for as separate performance obligations; however,\ndetermining whether products or services are considered distinct performance obligations that should be accounted for separately versus together may sometimes require significant judgment.\nJudgment is required to determine stand-alone selling price (“SSP”) for each performance obligation. We use a range of amounts to estimate SSP and determine whether there is a discount to be allocated based on the relative SSP of the various products and services. We estimate SSP considering multiple factors including but not limited to, our internal cost, pricing practices, sales channel, competitive positioning, and overall market and business environments. As our offerings and markets change, we may be required to reassess our estimated SSP and, as a result, the timing and classification of our revenue could be affected.\nWe are a U.S. based multinational company operating in multiple U.S. and foreign jurisdictions. Judgment is required in evaluating our uncertain tax positions and determining our provision for income taxes. We consider many factors when evaluating and estimating our tax positions and tax benefits, which may require periodic adjustments and may not accurately forecast actual tax audit outcomes. Determining whether an uncertain tax position is effectively settled requires judgment. Changes in recognition or measurement of our uncertain tax positions would result in the recognition of a tax benefit or an additional charge to the tax provision.\nIncome taxes are accounted for under the liability method, whereby deferred tax assets or liability account balances are calculated at the balance sheet date using current tax laws and rates in effect for the year in which the differences are expected to affect taxable income. A valuation allowance is recorded to reduce the carrying amounts of deferred tax assets if we believe it is more likely than not such assets will not be realized.\nWe are subject to the periodic examination of our domestic and foreign tax returns by the IRS, state, local, and foreign tax authorities who may challenge our tax positions. We regularly assess the likelihood of adverse outcomes from these examinations in determining the adequacy of our provision for income taxes.\nBusiness Combinations, Divestitures, and Goodwill and Purchased Intangible Assets\nFor business combinations, we allocate the purchase consideration to the assets acquired and liabilities assumed based on their fair values at the acquisition date. When determining the fair values, we make significant estimates and assumptions, especially concerning intangible assets. Critical estimates when valuing intangible assets include expected future cash flows based on consideration of revenue and revenue growth rates and margins, customer attrition rates, future changes in technology and brand awareness, loyalty and position, and discount rates. Any purchase consideration in excess of the fair values of the net assets acquired is recorded as goodwill.\nWhen divesting a business, a significant portion of the gain or loss may be impacted by the goodwill allocated to the divested business and the fair value of any equity interests acquired in exchange for the disposal group. We allocate a portion of the applicable reporting unit’s goodwill to the divested business using the ratio of the fair value of the divested business compared to the fair value of the reporting unit. The fair value of the reporting units, divested businesses, and acquired equity interests is generally determined using a combination of the discounted cash flow method and the guideline company method.\nThe significant assumptions used in the discounted cash flow model to estimate the fair values include certain assumptions that form the basis of the forecasted results, specifically, revenue, revenue growth rates, and discount rates. These significant assumptions are forward looking and could be affected by future economic and market conditions.\nWe evaluate goodwill on an annual basis in our fourth quarter or more frequently if indicators of potential impairment exist. To determine whether goodwill is impaired, we first assess qualitative factors. Qualitative factors include but are not limited to macroeconomic conditions, industry and market considerations, cost factors, overall financial performance, or other relevant company-specific events. If it is determined more likely than not that the fair value of a goodwill reporting unit is less than its carrying amount, we perform a quantitative analysis. Alternatively, we may bypass the qualitative assessment and perform a quantitative impairment test.\nWhen performing a quantitative approach, we compare the reporting unit’s carrying amount, including goodwill, to the reporting unit's fair value. The estimation of a reporting unit's fair value involves using estimates and assumptions, including expected future operating performance using risk-adjusted discount rates. If the reporting unit's carrying amount exceeds its fair value, an impairment loss is recognized.\nWe review intangible assets for impairment whenever events or changes in circumstances indicate that the carrying amount of those assets may not be recoverable based on their future cash flows. The estimated future cash flows are primarily based on assumptions about expected future operating performance.\nRESULTS OF OPERATIONS\nThe following table shows revenue by category, gross margin and gross margin as a percentage of revenue, operating income and operating income as a percentage of revenue, diluted earnings per share, and annualized recurring revenue compared for the periods indicated:\n\n“Supplemental Disclosure of Non-GAAP Financial Measures and Annualized Recurring Revenue”\nof this report for definitions.\nBasis of Presentation\nWe use a 52–53 week fiscal year ending on the Friday nearest to December 31, which for 2024 was January 3, 2025. 2024\n. 2025 will be a 52-week year.\nYear 2024 Compared with Year 2023\nSubscription and Services\nOrganic total revenue increased due to the increased mix of subscription and services revenue and the impact of the additional week in fiscal 2024.\nOrganic product revenue decreased due to lower Ag demand in the first quarter and higher U.S. federal government sales of Surveying hardware in the prior year.\nOrganic subscription and services revenue increased primarily due to strong growth in subscription and software term licenses in all segments, primarily AECO, and to a lesser extent, the impact of the additional week.\nGross margin increased due to the organic growth of higher margin software and subscription sales, including the impact of the additional week, partially offset by the divestiture ",
  "item2_clean": null
}