{
  "source_file": "trow-20241231.htm",
  "form_type": "10-K",
  "item1_clean": "ASSETS UNDER MANAGEMENT (AUM).\nOur consolidated net revenues and net income are derived largely from investment advisory services provided by our subsidiaries, primarily T. Rowe Price Associates (TRPA), T. Rowe Price Investment Management (TRPIM), Oak Hill Advisors (OHA), and T. Rowe Price International Ltd (TRPIL). Our revenues depend largely on the total value and composition of our assets under management. Accordingly, fluctuations in financial markets and in the composition of assets under management impact our revenues and results of operations.\nAt December 31, 2024, we had $1,606.6 billion in assets under management, an increase of $162.1 billion from the end of 2023. This increase in assets under management was driven by market appreciation, net of distributions not reinvested, of $205.3 billion, offset by net cash outflows of $43.2 billion.\nIn 2024, our target date retirement products experienced net cash inflows of $16.3 billion. The assets under management in our target date retirement products totaled $475.6 billion at December 31, 2024, or 29.6% of our managed assets at December 31, 2024, compared to 28.3% at the end of 2023.\nThe following charts show our AUM (in billions) by asset class, client type, geography, and account type as of December 31 for the prior three years:\nFixed Income, including money market\nThe underlying AUM of the multi-asset portfolios have been aggregated and presented in this category and not reported in the equity and fixed income rows.\nThe alternatives asset class includes strategies authorized to invest more than 50% of its holdings in private credit, leveraged loans, mezzanine, real assets/CRE, structured products, stressed/distressed, non-investment grade CLOs, special situations, business development companies, or that have absolute return as its investment objective. Generally, only those strategies with longer than daily liquidity are included. Unfunded capital commitments of $16.2 billion at December 31, 2024, $11.6 billion at December 31, 2023, and $10.5 billion at December 31, 2022 are not reflected in AUM above.\nInstitutional includes assets sourced from institutions along with defined contribution assets that are sourced through intermediaries and our full-service recordkeeping business.\nRetail includes assets sourced through our direct-marketed business and financial intermediaries.\n\nCOMPETITION.\nAs a member of the financial services industry, we are subject to substantial competition in all aspects of our business. A significant number of proprietary and other sponsors’ investment products are sold to the public by other investment management firms, broker-dealers, mutual fund companies, banks, and insurance companies. We compete with brokerage and investment banking firms, insurance companies, banks, traditional and alternative asset management companies, hedge funds, and other financial institutions and funds in all aspects of our business and in every country in which we offer our products and services. Some of these financial institutions have greater resources, may have more developed brand awareness in particular markets, or offer additional services to clients than we do. We compete with other providers of investment advisory services based primarily on the availability and objectives of the investment products offered, investment performance, fees and related expenses, and the scope and quality of investment advice and other client services.\nWe have and will continue to face significant competition from passive oriented investment strategies. As a result, such products have taken market share from active managers. While we cannot predict how much market share these competitors will continue to gain, we believe there will always be demand for good active management investment products.\nIn order to maintain and enhance our competitive position, we may review acquisition and venture opportunities and, if appropriate, engage in discussions and negotiations that could lead to an acquisition transaction or other financial relationships with another entity.\nHUMAN CAPITAL.\nAt T. Rowe Price, our people are our greatest asset. Our culture of collaboration, diversity and inclusion enables us to identify and challenge our best ideas to arrive at well-informed decisions for our clients. To attract and retain the highest quality talent, we invest in the associate experience and develop talent and succession plans; deliver individual and firmwide training and development opportunities for our associates to learn and grow; and provide strong, competitive, and regionally specific benefits and programs that promote the health and wellness of our associates.\nAs of December 31, 2024, we employed 8,158 associates, an increase of 3.2% from the 7,906 associates employed at the end of 2023. We add temporary and part-time personnel to complement our staff from time to time to meet periodic and special project demands, primarily for technology and collective investment fund administrative services.\n\nT. Rowe Price Group, Inc. (\"T. Rowe Price Group\", \"T. Rowe Price\", \"the firm\", \"we\", \"us\", or \"our\") is a financial services holding company that provides global investment advisory services through its subsidiaries to investors worldwide. We are driven by our purpose: to identify and actively invest in opportunities to help people thrive in an evolving world. With more than 85 years of experience, we provide a broad range of investment solutions across equity, fixed income, multi-asset, and alternative capabilities for clients around the world— from individuals to advisors to institutions to retirement plan sponsors. We also provide certain investment advisory clients with related administrative services, including distribution, mutual fund transfer agent, accounting, and shareholder services; participant recordkeeping and transfer agent services for defined contribution retirement plans; brokerage; trust services; and non-discretionary advisory services through model delivery. We take an active, independent approach to investing, offering our dynamic perspective and meaningful partnership, so our clients can feel more confident.\nThe late Thomas Rowe Price, Jr., founded our firm in 1937, and the common stock of T. Rowe Price Associates, Inc. was first offered to the public in 1986. The T. Rowe Price Group, Inc. corporate holding company structure was established in 2000. Our common stock trades on the NASDAQ Global Select Market under the symbol \"TROW\".\nOur core capabilities have enabled us to deliver excellent operating results since our initial public offering. We maintain a strong corporate culture focused on delivering superior long-term investment performance and world-class service to our clients. We distribute our broad array of active investment solutions through a diverse set of distribution channels and vehicles to meet the needs of our clients globally. These vehicles include an array of U.S. mutual funds, collective investment trusts, exchange-traded funds, subadvised funds, separately managed accounts, and other sponsored products. The other sponsored products include: open-ended investment products offered to investors outside the U.S., products offered through variable annuity life insurance plans in the U.S., affiliated private investment funds, business development companies, an interval fund, and collateralized loan obligations.\nThe investment management industry has been evolving and industry participants are facing several challenging trends including passive investments taking market share from traditional active strategies; continued downward fee pressure; demand for new investment vehicles to meet client needs; and an ever-changing regulatory landscape.\nDespite these challenging trends, we believe there are significant opportunities that align to our core capabilities. Our ongoing financial strength and discipline allows us to respond to these opportunities with several strategic, multi-year initiatives that are designed to strengthen our long-term competitive position and to:\nSustain our leadership position in retirement.\nAccess growth of the U.S. wealth management channel through improved vehicle capabilities, technology, specialist sales, and content.\nFocus on further global growth in select high-opportunity countries where we have existing business by investing more in resources, products, and marketing.\nBroaden our reach in the private and alternatives market by leveraging our distribution channels and expanding our investment capabilities.\nEnhance our relationships with clients and renew our individual investor base by investing in our ability to provide exceptional service and unique offerings.\nStrengthen our distribution technology to enhance the digital client experience and client reporting.\nAttract and retain top talent and enable effective hybrid collaboration.\nNurture our brand globally and leverage it effectively across channels and geographies.\nDeliver strong financial results and balance sheet strength for our stockholders over the long term.\n\nAmericas financial intermediaries\nEMEA & APAC financial intermediaries\nIndividual U.S. investors on a direct basis\nU.S. Defined Contribution\nInstitutional investors\nCollective Investment Trusts\nExchange-Traded Funds\nCollege Savings Plans\nSeparately Managed Accounts (SMAs)\nCanadian Pooled Funds\nAustralian Unit Trusts\nCollateralized Loan Obligations\nBusiness Development Company (BDC)\nIncludes both model delivery and manager traded SMAs,\nSociété d'Investissement à Capital Variable (Luxembourg),\nFonds Commun de Placement (Luxembourg),\nOpen-Ended Investment Company (U.K.),\nJapanese Investment Trust Management Funds,\nProvided through our ActivePlus and Retirement Advisory Service Portfolios.\nINVESTMENT ADVISORY FEES.\nWe derive substantially all of our net revenue from investment advisory fees that are earned pursuant to agreements with our sponsored products and clients. Nearly 57% of our investment advisory fees are earned from our sponsored U.S. mutual funds, with the remaining investment advisory fees earned from our collective investment trusts, subadvised funds, separately managed accounts, and other sponsored products. The other sponsored investment portfolios include: open-ended investment products offered to investors outside the U.S., products offered through variable annuity life insurance plans in the U.S., exchange traded funds, affiliated private investment funds, business development companies, and sponsored collateralized loan obligations.\nOur investment advisory fees are generally computed using the value of assets under management at a contracted annual fee rate or an effective fee rate for those products with a tiered-fee rate structure. For the majority of our revenue, the value of the assets under management used to calculate the fees are based on a daily valuation. The contracted fee rate(s) applied to the fund or account’s assets under management will vary depending on the services provided, the asset class, and vehicle. For example, fee rates are typically higher for equities and alternatives compared to multi-asset and fixed income products. Additionally, fees rates are typically higher for commingled vehicles including U.S. mutual funds, private investment funds and collective investment trusts compared to\n\nREGULATION.\nAll aspects of our business are subject to extensive federal, state, and foreign laws and regulations. These laws and regulations are primarily intended to benefit or protect our clients and product shareholders. They generally grant supervisory agencies and bodies broad administrative powers, including the power to limit or restrict the conduct of our business if we fail to comply with laws and regulations. Possible sanctions that may be imposed on us, if we fail to comply, include the suspension of individual employees, limitations on engaging in certain business activities for specified periods of time, revocation of our invest",
  "item7_clean": "Performance-based advisory fees were previously included in investment advisory fees. Prior periods were recast to reflect this change.\nCapital allocation-based income represents the change in accrued carried interest.\nSee the reconciliation to the comparable U.S. GAAP measures at the end of the Results of Operations section of this Management's Discussion and Analysis.\nResults Overview - 2024 compared to 2023\nInvestment advisory fees\nare earned based on the value and composition of our assets under management, which change based on fluctuations in financial markets, investment performance, and net cash flows. As our average assets under management increase or decrease in a given period, the level of our investment advisory fees for that same period generally fluctuate in a similar manner. Our annualized effective fee rates can be impacted by market or cash flow related shifts among asset and share classes, shifts among vehicles, price changes in existing products, and asset level changes in products with tiered-fee structures.\nInvestment advisory fees earned in 2024 increased 12.1% compared to 2023 as average assets under management increased $199.6 billion, or 14.7%, to $1,561.9 billion.\nThe average annualized effective fee rate, excluding performance-based advisory fees, earned on our assets under management was 41.0 basis points in 2024, compared to 41.9 basis points earned in 2023. Our effective fee rate has declined largely due to a mix shift in assets toward lower fee products and asset classes from client flows and transfers, partially offset by higher market returns. The average annualized fee rate, excluding performance-based fees, was 40.5 basis points for the fourth quarter of 2024.\nwere $4,760.3 million in 2024, an increase of 6.4% compared to 2023. The increase was primarily driven by higher compensation costs, distribution and servicing costs, and advertising and promotion costs. Additionally, 2023 included a $82.4 million reduction in operating expenses related to the remeasurement of the contingent consideration liability compared to a $13.4 million reduction in 2024.\n\nwas 32.9% in 2024 compared to 30.7% in 2023. The increase is primarily driven by net revenue growth outpacing operating expense growth primarily due to higher average assets under management.\nDiluted earnings per share\nwas $9.15 in 2024 compared to $7.76 in 2023. The increase in GAAP basis diluted earnings per share was primarily due to higher operating income and a lower effective tax rate.\nOn a non-GAAP basis, diluted earnings per share was $9.33 in 2024 compared to $7.59 in 2023. The increase was primarily due to higher operating income and a lower effective tax rate.\nSee our non-GAAP reconciliations later in this Management's Discussion and Analysis section.\nResults Overview - 2023 compared to 2022\nInvestment advisory fees\nare earned based on the value and composition of our assets under management, which change based on fluctuations in financial markets and net cash flows. As our average assets under management increase or decrease in a given period, the level of our investment advisory fees for that same period generally fluctuates in a similar manner. Our annualized effective fee rates can be impacted by market or cash flow related shifts among asset and share classes, price changes in existing products, and asset level changes in products with tiered-fee structures.\nInvestment advisory fees earned in 2023 decreased 3.7% over the comparable 2022 period as average assets under our management decreased $36.1 billion, or 2.6%, to $1,362.3 billion.\nThe average annualized effective fee rate earned on our assets under management was 41.9 basis points in 2023, compared to 42.6 basis points earned in 2022. Our effective fee rate has declined largely due to a mix shift toward lower fee asset classes and vehicles as a result of net equity outflows, partially offset by higher market returns. The average annualized fee rate earned on our assets under management was 41.5 basis points for the fourth quarter of 2023.\nwere $4,474.3 million in 2023, an increase of 8.7% over the comparable 2022 period. The impact of market movements on the supplemental savings plan liability accounted for about 70% of the increase in U.S. GAAP operating expenses. Non-operating income has a corresponding increase due to our economic hedge of the liability.\nOn a non-GAAP basis, operating expenses were $4,260.7 million, a 4.2% increase over the comparable 2022 period. The increase in our non-GAAP operating expenses was primarily driven by higher costs across compensation and benefits, accrued carried interest related compensation expense, technology, facility, advertising, and professional fees. These increases were offset in part by higher capitalized labor, lower stock-based compensation, and a non-recurring recovery of general and administrative costs incurred in 2022.\nwas 30.7% in 2023, compared to 36.6% in 2022. The decrease in our operating margin in 2023 compared to 2022 is primarily driven by a decrease in investment advisory fees as a result of lower average assets under management and higher operating expenses.\n\nin 2024 were $588.0 million, an increase of $37.1 million compared to 2023. The increase was primarily driven by higher average assets on which we earn non-discretionary advisory services revenue and higher transfer agent servicing activities provided to the T. Rowe Price mutual funds.\nFor 2023, the decrease was primarily driven by lower transfer agent servicing activities provided to the T. Rowe Price mutual funds, and lower 12b-1 revenue earned from the Advisor and R share classes of the U.S. mutual funds as a result of lower average assets under management in these share classes. The decrease in 12b-1 revenue was offset entirely by a decrease in the costs paid to third-party intermediaries that source these assets and is reported in distribution and servicing expense.\nNet revenues are presented after the elimination of $3.6 million for 2024, $2.1 million for 2023, and $2.0 million for 2022, earned from our consolidated investment products. The corresponding expenses recognized by these consolidated investment products were also eliminated from operating expenses.\n\nItem 7. Management’s Discussion and Analysis of Financial Condition and Results of Operations.\nOVERVIEW.\nOur revenues and net income are derived primarily from investment advisory services provided to individual and institutional investors in a broad range of investment solutions across equity, fixed income, multi-asset, and alternative capabilities. We also provide certain investment advisory clients with related administrative services, including distribution, mutual fund transfer agent, accounting, and shareholder services; participant recordkeeping and transfer agent services for defined contribution retirement plans; brokerage; trust services; and non-discretionary advisory services.\nInvestment advisory fees depend largely on the total value and composition of assets under our management. Accordingly, fluctuations in financial markets and in the composition of assets under management affect our revenues and results of operations.\nWe incur significant expenditures to develop new products and services and improve and expand our capabilities and distribution channels in order to attract new clients and additional investments from our existing clients. These efforts often involve costs that precede any future revenues we may recognize from an increase to our assets under management.\nThe investment management industry has been evolving and\n\nDiluted earnings per share.\nDiluted earnings per share was $7.76 in 2023 compared to $6.70 in 2022. The increase in 2023 GAAP basis diluted earnings per share from 2022 was primarily due to net investment income in 2023 compared to net investment losses in 2022. These increases were partially offset by lower operating income and a higher effective tax rate.\nOn a non-GAAP basis, diluted earnings per share was $7.59 in 2023 compared to $8.02 in 2022. The decrease in 2023 was primarily due to lower operating income and a higher effective tax rate. These decreases were offset by net investment income earned on our cash and discretionary investment portfolio in 2023 compared to net investment losses in 2022.\nSee our non-GAAP reconciliations later in this Management's Discussion and Analysis section.\n2024 compared to 2023\n2023 compared to 2022\nInvestment advisory fees\nFixed income, including money markets\nPerformance-based advisory fees\nCapital allocation-based income\nAdministrative, distribution, and servicing fees\nDistribution and servicing fees\nAverage AUM (in billions):\nFixed income, including money market\nEnding AUM (in billions)\nn/m - the percentage change is not meaningful.\nPerformance-based advisory fees were previously included in investment advisory fees. Prior periods were recast to reflect this change.\nInvestment advisory fees.\nThe relationship between the change in average assets under management and the change in investment advisory fees for 2024, 2023 and 2022 are presented above.\nIn 2024, the increase in investment advisory fees was due to higher average AUM as stronger market returns and appreciation were offset by net outflows over the last two years.\nIn 2023, the decline in overall advisory revenues was driven by lower average AUM and a mix shift toward lower fee asset classes and vehicles. A lower starting AUM and net outflows in 2023 were the primary drivers of a lower average AUM in 2023. These impacts were partially offset by stronger overall market returns in 2023.\nPerformance-based advisory fees\nin each period were primarily related to alternative strategies.\n\nwere $2,603.4 million, an increase of $152.7 million, or 6.2%, compared to 2023. The increase was driven by a higher bonus pool on an increase in revenue and higher salaries and related benefits partially offset by higher capitalized labor and lower other employee related costs. The firm employed 8,158 associates at December 31, 2024, an increase of 3.2% from the end of 2023.\nFor 2023, compensation, benefits and related costs were $2,450.7 million, an increase of $44.9 million, or 1.9%, compared to 2022. The increase was driven by $99.1 million in higher salaries and related benefits as a result of base salary increases in January 2023 and July 2022. These increases were offset by higher capitalized labor, lower non-cash stock-based compensation, and lower other employee-related costs.\nDistribution and servicing costs\nwere $354.1 million for 2024, an increase of $64.2 million, or 22.1%, compared to $289.9 million in 2023. The increase was primarily driven by higher average assets under management distributed through intermediaries.\nFor 2023, distribution and services costs were $289.9 million, a decrease of $11.6 million, or 3.8%, compared to 2022. The decrease was primarily driven by lower average assets under management in certain share classes of the U.S. mutual funds that earn 12b-1 fees and SICAVs. These decreases were partially offset by higher costs incurred to distribute certain products through U.S. intermediaries as the average assets under management in these products were higher.\nThe costs in this expense category primarily include amounts paid to third-party intermediaries that source the assets of certain share classes of our U.S. mutual funds, ETFs and our international products, such as our Japanese ITMs and SICAVs. These costs were offset entirely by the distribution revenue we earn and report in net revenues: 12b-1 revenue is recognized in administrative, distribution, and servicing fees for the Advisor and R share classes of the U.S. mutual funds and investment advisory fees for our international products.\nAdvertising and promotion costs\nwere $129.6 million for 2024, an increase of $15.4 million, or 13.5%, compared to 2023. The increase was primarily driven by higher media advertising.\nFor 2023, advertising and promotion costs were $114.2 million, an increase of $16.9 million, or 17.4%, compared to 2022. The increase was primarily driven by higher media advertising and agency costs in 2023.\n\nProduct and recordkeeping related costs\nwere $297.5 million for 2024, an increase of $6.5 million, or 2.2%, compared to 2023. The increase was primarily driven by higher product related costs to be reimbursed from our sponsored investment products partially offset by lower recordkeeping related costs.\nFor 2023, product and recordkeeping related costs were $291.0 million for 2023, a decrease of $9.1 million, or 3.0%, compared to 2022. The decrease was driven by lower recordkeeping related costs.\nTechnology, occupancy, and facility costs\nwere $644.1 million for 2024, an increase of $11.5 million or 1.8%, compared to 2023. The increase was due to ongoing investment in our technology capabilities, primarily hosted solutions, partially offset by lower facility costs as 2023 included the rent cost of two London facilities until we occupied our new building in September 2023.\nFor 2023, technology, occupancy, and facility costs were $632.6 million, an increase of $72.1 million or 12.9%, compared to 2022. The increase was primarily due to ongoing investment in our technology capabilities, including depreciation and hosting solution licenses, and increased office facility costs, mainly related to rent expense associated with a new London office that we began leasing in the second half of 2022 and occupied in September 2023.\nGeneral, administrative, and other costs\nwere $433.8 million for 2024, an increase of $12.5 million or 3.0%, compared to 2023. The increase was primarily due to a cost recovery recognized in 2023 that did not recur in 2024, higher professional fees and travel costs. These increases were partially offset by lower external research fees and other general and administrative costs. In 2024, the firm changed its approach to paying for external research, consistent with regulations and general industry practice.\nFor 2023, general, administrative, and other costs were $421.3 million, an increase of $9.1 million or 2.2% compared to 2022. The increase was primarily due to higher professional fees and travel costs, partially offset by a $20.8 million recovery of nonrecurring costs that were incurred in 2022.\nChange in fair value of contingent consideration.\nOur contingent consideration consists of an earnout arrangement as part of the 2021 acquisition of OHA in which additional purchase price may be due to the sellers upon satisfying or exceeding certain defined revenue targets. Each reporting period, we record the fair value of the contingent consideration due under this arrangement. Reduced revenue expectations have resulted in a reduction in the fair value of the contingent consideration liability of $13.4 million in 2024, $82.4 million in 2023, and $161.2 million in 2022. The fair value of the contingent consideration liability as of December 31, 2024 is zero.\nAcquisition-related amortization and impairment costs\nprimarily relate to the indefinite- and definite-lived intangible assets identified and separately recognized, at fair value, on acquisition date. In 2024, we recognized acquisition-related amortization and impairment costs of $156.7 million, an increase of $22.5 million or 16.8%, compared to 2023. The increase was primarily driven by impairment charges related to the trade name intangible asset.\nFor 2023, we recognized acquisition-related amortization and impairment costs of $134.2 million, a decrease of $149.3 million, compared to 2022. The decrease was primarily driven by an insignificant amount of impairment charges in 2023 for certain intangibles compared to $175.1 million in 2022.\nThe impairment charges for both periods were the result of reduced growth expectations for both investment management and incentive fees and higher discount rate compared to when the acquisition closed in 2021.\nThe remaining weighted average amorti",
  "item2_clean": null
}