{
  "source_file": "trv-20250930.htm",
  "form_type": "10-Q",
  "item1_clean": null,
  "item7_clean": null,
  "item2_clean": "The $3.61 billion increase in gross claims and claim adjustment expense reserves since December 31, 2024 primarily reflected the impacts of (i) catastrophe losses in the first nine months of 2025, (ii) higher volumes of insured exposures and (iii) loss cost trends for the current accident year, partially offset by (iv) claim payments made during the first nine months of 2025 and (v) net favorable prior year reserve development.\nFUTURE APPLICATION OF ACCOUNTING STANDARDS\nSee note 1 of the notes to the unaudited consolidated financial statements contained in this quarterly report and in the Company’s 2024 Annual Report for a discussion of recently issued accounting pronouncements.\nTHE TRAVELERS COMPANIES, INC. AND SUBSIDIARIES\nFORWARD-LOOKING STATEMENTS\nThis report contains, and management may make, certain “forward-looking statements” within the meaning of the Private Securities Litigation Reform Act of 1995. All statements, other than statements of historical facts, may be forward-looking statements. Words such as “may,” “will,” “should,” “likely,” “probably,” “anticipates,” “expects,” “intends,” “plans,” “projects,” “believes,” “views,” “ensures,” “estimates” and similar expressions are used to identify these forward-looking statements. These statements include, among other things, the Company’s statements about:\nthe Company’s outlook, the impact of trends on its business and its future results of operations and financial condition (including, among other things, anticipated premium volume, premium rates, renewal premium changes, underwriting margins and underlying underwriting margins, net and core income, investment income and performance, loss costs, return on equity, core return on equity and expected current returns, and combined ratios and underlying combined ratios);\nthe impact of legislative or regulatory actions or court decisions;\nshare repurchase plans;\nfuture pension plan contributions;\nthe sufficiency of the Company’s reserves, including asbestos;\nthe impact of emerging claims issues as well as other insurance and non-insurance litigation;\nthe cost and availability of reinsurance coverage;\ncatastrophe losses and modeling, including statements about probabilities or likelihood of exceedance;\nthe impact of investment (including changes in interest rates), economic (including inflation, the impact of tariffs, changes in tax laws, changes in commodity prices and fluctuations in foreign currency exchange rates) and underwriting market conditions;\nthe Company’s approach to managing its investment portfolio;\nthe impact of changing climate conditions;\nstrategic and operational initiatives to improve growth, profitability and competitiveness;\nthe Company’s competitive advantages and innovation agenda, including executing on that agenda with respect to artificial intelligence;\nthe Company’s cybersecurity policies and practices;\nnew product offerings;\nthe impact of developments in the tort environment, such as increased attorney involvement in insurance claims;\nthe impact of developments in the geopolitical environment;\nthe impact of a continued shutdown of the U.S. government; and\nthe sale of our Canadian personal insurance business and the majority of our Canadian commercial insurance business, including with respect to the expected closing of the transaction, use of proceeds, including share repurchases, and financial impact of the sale.\nThe Company cautions investors that such statements are subject to risks and uncertainties, many of which are difficult to predict and generally beyond the Company’s control, that could cause actual results to differ materially from those expressed in, or implied or projected by, the forward-looking information and statements.\nSome of the factors that could cause actual results to differ include, but are not limited to, the following:\nInsurance-Related Risks\nhigh levels of catastrophe losses, including as a result of factors such as increased concentrations of insured exposures in catastrophe-prone areas and changing climate conditions, could materially and adversely affect the Company’s results of operations, its financial position and/or liquidity, and could adversely impact the Company’s ratings, the Company’s ability to raise capital and the availability and cost of reinsurance;\nif actual claims exceed the Company’s claims and claim adjustment expense reserves, if changes in the estimated level of claims and claim adjustment expense reserves are necessary, or if the Company is unable to offset increases in loss costs with sufficient price increases, including as a result of, among other things, changes in the legal/tort, regulatory and economic environments in which the Company operates, including increased inflation and the impact of tariffs, the Company’s financial results could be materially and adversely affected;\nthe Company’s business could be harmed because of its continued exposure to asbestos and environmental claims and related litigation;\nthe Company is exposed to, and may face adverse developments involving, mass tort claims such as those relating to exposure to potentially harmful products or substances; and\nTHE TRAVELERS COMPANIES, INC. AND SUBSIDIARIES\nFORWARD-LOOKING STATEMENTS, Continued\nthe effects of emerging claim and coverage issues on the Company’s business are uncertain, and court decisions or legislative changes that take place after the Company issues its policies\n\nNet realized investment gains on equity securities still held of $40 million and $41 million, respectively, in the third quarter and first nine months of 2025 were driven by the impact of changes in fair value attributable to favorable equity markets. Net realized investment gains on equity securities still held of $51 million and $102 million, respectively, in the third quarter and first nine months of 2024 were driven by the impact of changes in fair value attributable to favorable equity markets.\nOther revenues in the third quarter of 2025 were $148 million, $28 million higher than in the same period of 2024. Other revenues in the first nine months of 2025 were $383 million, $46 million higher than in the same period of 2024. Other revenues include revenues from Simply Business, installment premium charges and other policyholder service charges.\nClaims and Claim Adjustment Expenses\nClaims and claim adjustment expenses in the third quarter of 2025 were $6.59 billion, $402 million or 6% lower than in the same period of 2024, driven by (i) lower catastrophe losses in all three segments and (ii) lower losses in Personal Insurance, partially offset by (iii) loss cost trends in all three segments, (iv) lower net favorable prior year reserve development and (v) higher business volumes in Business Insurance and Bond & Specialty Insurance. Catastrophe losses in the third quarter of 2025 primarily resulted from severe wind and hail storms in multiple states. Catastrophe losses in the third quarter of 2024 primarily resulted from Hurricane Helene and severe wind and hail storms in multiple states.\nClaims and claim adjustment expenses in the first nine months of 2025 were $21.39 billion, $364 million or 2% higher than in the same period of 2024, driven by (i) higher catastrophe losses in Personal Insurance and Business Insurance, partially offset by lower catastrophe losses in Bond & Specialty Insurance, (ii) loss cost trends in all three segments and (iii) higher business volumes in Business Insurance and Bond & Specialty Insurance, partially offset by (iv) higher net favorable prior year reserve development in all three segments and (v) lower losses in Personal Insurance. Catastrophe losses in the first nine months of 2025 included the third quarter events described above, as well as the January 2025 California wildfires and severe wind and hail storms in multiple states in the first six months of 2025. Catastrophe losses in the first nine months of 2024 included the third quarter events described above, as well as numerous severe wind and hail storms in multiple states in the first six months of 2024.\nTHE TRAVELERS COMPANIES, INC. AND SUBSIDIARIES\n\nMANAGEMENT'S DISCUSSION AND ANALYSIS, Continued\nSegment income in the third quarter of 2025 was $907 million, $209 million or 30% higher than segment income of $698 million in the same period of 2024. The increase in segment income before income taxes primarily reflected the pre-tax impacts of (i) lower catastrophe losses and (ii) higher net investment income, partially offset by (iii) higher net unfavorable prior year reserve development. Catastrophe losses in the third quarters of 2025 and 2024 were $139 million and $340 million, respectively. Net unfavorable prior year reserve development in the third quarters of 2025 and 2024 was $125 million and $91 million, respectively. Income tax expense in the third quarter of 2025 was higher than in the same period of 2024, primarily reflecting the impact of the increase in segment income before income taxes.\nSegment income in the first nine months of 2025 was $2.40 billion, $285 million or 13% higher than segment income of $2.12 billion in the same period of 2024. The increase in segment income before income taxes primarily reflected the pre-tax impacts of (i) higher underlying underwriting margins, (ii) higher net investment income and (iii) net favorable prior year reserve development of $28 million compared to net unfavorable prior year reserve development of $57 million in the same period of 2024, partially offset by (iv) higher catastrophe losses. Catastrophe losses in the first nine months of 2025 and 2024 were $1.02 billion and $938 million, respectively. The higher underlying underwriting margins primarily reflected the impacts of (i) the benefit of earned pricing and (ii) higher business volumes, partially offset by (iii) higher general and administrative expenses. Income tax expense in the first nine months of 2025 was higher than in the same period of 2024, primarily reflecting the impac"
}