{
  "source_file": "tsla-20250930.htm",
  "form_type": "10-Q",
  "item1_clean": null,
  "item7_clean": null,
  "item2_clean": "Three Months Ended September 30,\nNine Months Ended September 30,\n(Dollars in millions)\nAutomotive regulatory credits\nTotal automotive revenues\nTotal automotive & services and other segment revenue\nEnergy generation and storage segment revenue\nAutomotive & Services and Other Segment\nAutomotive sales revenue increased $1.53 billion, or 8%, in the three months ended September 30, 2025 as compared to the three months ended September 30, 2024, due to an increase of approximately 46,000 combined Model 3 and Model Y cash deliveries, partially offset by a decrease of approximately 8,000 deliveries of other models and a decrease in one-time FSD recognition as we had recognized $326 million of FSD revenue for Cybertruck and certain features such as Actually Smart Summon in the third quarter of 2024.\nAutomotive sales revenue decreased $4.75 billion, or 9%, in the nine months ended September 30, 2025 as compared to the nine months ended September 30, 2024, due to a decrease of approximately 24,000 deliveries of other models and a decrease of approximately 49,000 combined Model 3 and Model Y cash deliveries in part from bringing down all of our vehicle factories simultaneously for the changeover to New Model Y. Additionally, there was a decrease in one-time FSD recognition compared to the prior period and a lower average selling price per unit driven by sales mix and higher customer incentives such as attractive financing options.\nAutomotive regulatory credits revenue decreased $322 million, or 44%, in the three months ended September 30, 2025 as compared to the three months ended September 30, 2024. Automotive regulatory credits revenue decreased $620 million, or 30%, in the nine months ended September 30, 2025 as compared to the nine months ended September 30, 2024. Fluctuations in automotive regulatory credits are impacted by our supply of credits, subject to changes in regulation, production and sales. Furthermore, we are impacted by the demand for credits by other automobile manufacturers.\nServices and other revenue increased $685 million, or 25%, in the three months ended September 30, 2025 as compared to the three months ended September 30, 2024, primarily due to increases in used vehicle sales volume, paid Supercharging sessions, non-warranty maintenance services and collision revenue and insurance business revenue.\nServices and other revenue increased $1.47 billion, or 19%, in the nine months ended September 30, 2025 as compared to the nine months ended September 30, 2024, primarily due to increases in paid Supercharging sessions, non-warranty maintenance services and collision revenue, used vehicle sales volume and insurance business revenue.\nEnergy Generation and Storage Segment\nEnergy generation and storage revenue increased $1.04 billion, or 44%, in the three months ended September 30, 2025 as compared to the three months ended September 30, 2024. Energy generation and storage revenue increased $1.91 billion, or 27%, in the nine months ended September 30, 2025 as compared to the nine months ended September 30, 2024. The increases were primarily due to increases in Megapack and Powerwall deployments compared to the prior periods, partially offset by a decrease in average selling price of Megapack.\nCost of Revenues and Gross Margin\nThree Months Ended September 30,\nNine Months Ended September 30,\n(Dollars in millions)\nTotal automotive cost of revenues\nTotal automotive & services and other segment cost of revenues\nEnergy generation and storage segment\nTotal cost of revenues\nGross profit total automotive\nGross margin total automotive\nGross profit total automotive & services and other segment\nGross margin total automotive & services and other segment\nGross profit energy generation and storage segment\nGross margin energy generation and storage segment\nAutomotive & Services and Other Segment\nCost of automotive sales revenue increased $1.62 billion, or 10%, in the three months ended September 30, 2025 as compared to the three months ended September 30, 2024, primarily due a net increase in deliveries year over year as discussed above and a higher average cost per unit due to lower fixed cost absorption, an increase in tariffs and sales mix, partially offset by lower material costs.\nCost of automotive sales revenue decreased $3.21 billion, or 7%, in the nine months ended September 30, 2025 as compared to the nine months ended September 30, 2024, due to the decreases in deliveries year over year as discussed above and lower average cost per unit due to sales mix and lower material costs, partially offset by lower fixed cost absorption and an increase in tariffs compared to the prior period.\nCost of services and other revenue increased $565 million, or 22%, in the three months ended September 30, 2025 as compared to the three months ended September 30, 2024, primarily due to increases in used vehicle sales volume, cost of paid Supercharging revenue, and cost of non-warranty maintenance services and collision revenue.\nCost of services and other revenue increased $1.33 billion, or 19%, in the nine months ended September 30, 2025 as compared to the nine months ended September 30, 2024, primarily due to increases in used vehicle sales volume and cost, cost of paid Supercharging sessions, and cost related to our insurance business.\nGross margin for total automotive decreased from 20.1% to 17.0% in the three months ended September 30, 2025 as compared to the three months ended September 30, 2024. Gross margin for total automotive decreased from 19.0% to 16.9% in the nine months ended September 30, 2025 as compared to the nine months ended September 30, 2024. The decreases were primarily due to the changes in automotive sales revenue and cost of automotive sales revenue, as discussed above, as well as decreases in regulatory credits revenue.\nGross margin for total automotive & services and other segment decreased from 18.7% to 16.1% in the three months ended September 30, 2025 as compared to the three months ended September 30, 2024. Gross margin for total automotive & services and other segment decreased from 17.6% to 15.4% in the nine months ended September 30, 2025 as compared to the nine months ended September 30, 2024. The changes in gross margin were primarily due to the automotive gross margin factors discussed above, partially offset by an improvement in services and other margins.\nEnergy Generation and Storage Segment\nCost of energy generation and storage revenue increased $691 million, or 42%, in the three months ended September 30, 2025 as compared to the three months ended September 30, 2024, primarily due to an increase in Megapack and Powerwall deployments compared to the prior period, partially offset by a decrease in average cost per unit for Megapack from lower raw material costs, lower manufacturing costs for Megapack in part from the ramp of Shanghai Megafactory, partially offset by higher tariffs.\nCost of energy generation and storage revenue increased $1.07 billion, or 21%, in the nine months ended September 30, 2025 as compared to the nine months ended September 30, 2024, primarily from increases in Megapack and Powerwall deployments compared to the prior period, partially offset by a decrease in average cost per unit for Megapack and Powerwall primarily from lower raw material costs, lower manufacturing costs for Megapack in part from the ramp of Shanghai Megafactory, partially offset by higher tariffs.\nGross margin for energy generation and storage increased from 30.5% to 31.4% in the three months ended September 30, 2025 as compared to the three months ended September 30, 2024. Gross margin for energy generation and storage increased from 26.6% to 30.3% in the nine months ended September 30, 2025 as compared to the nine months ended September 30, 2024. The increases were primarily due to the changes in energy generation and storage revenue and cost of energy generation and storage revenue, as discussed above.\nResearch and Development Expense\nThree Months Ended September 30,\nNine Months Ended September 30,\n(Dollars in millions)\nResearch and development\nAs a percentage of revenues\nResearch and development (“R&D”) expenses increased $591 million, or 57%, in the three months ended September 30, 2025 as compared to the three months ended September 30, 2024. R&D expenses increased $1.36 billion, or 42%, in the nine months ended September 30, 2025 as compared to the nine months ended September 30, 2024. These increases were primarily due to increases in costs related to AI and other programs as we continue to expand our product roadmap and technologies. Additionally, there were increases in stock-based compensation of $145 million and $338 million in the three and nine months ended September 30, 2025 as compared to the prior periods, respectively.\nR&D expenses as a percentage of revenue increased from 4% to 6% in the three months ended September 30, 2025 as compared to the three months ended September 30, 2024, primarily due to higher R&D expenses, partially offset by an increase in total revenues in the current period. R&D expenses as a percentage of revenue increased from 5% to 7% in the nine months ended September 30, 2025 as compared to the nine months ended September 30, 2024, primarily due to higher R&D expenses and a decrease in total revenues in the current period.\nSelling, General and Administrative Expense\nThree Months Ended September 30,\nNine Months Ended September 30,\n(Dollars in millions)\nSelling, general and administrative\nAs a percentage of revenues\nSelling, general and administrative (“SG&A”) expenses increased $376 million, or 32%, in the three months ended September 30, 2025 as compared to the three months ended September 30, 2024, driven by a $168 million increase in operating expenses including legal charges, a $151 million increase in employee and labor costs, including professional services, a $38 million increase in stock-based compensation and a $25 million increase in marketing expense"
}