{
  "source_file": "tsn-20250628.htm",
  "form_type": "10-Q",
  "item1_clean": null,
  "item7_clean": null,
  "item2_clean": "Sales volume decreased in the third quarter of fiscal 2025 primarily due to lower head harvested, partially offset by higher average carcass weights. Sales volume for the first nine months were relatively flat as higher average carcass weights were offset by lower head harvested.\n- Average sales price increased in the third quarter and first nine months of fiscal 2025 primarily due to increased input costs and strong demand. The change in average sales price for the first nine months of fiscal 2025 excludes a $93 million reduction of Sales from the recognition of a legal contingency accrual recorded in the second quarter of fiscal 2025.\nOperating Income (Loss)\n- Operating loss increased in the third quarter and first nine months of fiscal 2025 due to compressed Beef margins and the recognition of a goodwill impairment charge, partially offset by improved operational execution. Additionally, the operating loss increase for the first nine months of fiscal 2025 was impacted by the recognition of a legal contingency accrual and network optimization plan charges in fiscal 2025, partially offset by lapping the impacts of plant closures and disposal charges recorded in the first nine months of fiscal 2024.\nPork Segment Results\nAverage sales price change\nOperating income (loss)\nThird quarter and nine months – Fiscal 2025 vs Fiscal 2024\n- Sales volume increased in the third quarter of fiscal 2025 due to a sell-through of inventory. Sales volume decreased in the first nine months of fiscal 2025 due to production decreases associated with a plant closure in 2024 which were partly offset by production increases at other facilities and higher average carcass weights.\n- Average sales price decreased in the third quarter of fiscal 2025 primarily driven by changes in mix. Average sales price increased in first nine months of fiscal 2025 due to increased input costs and strong demand for our pork products. The change in average sales price for the nine months ended excludes a $250 million reduction of Sales from the recognition of a legal contingency accrual recorded in the second quarter of fiscal 2025. The change in average sales price for both the three months ended and nine months ended excludes a $45 million reduction of Sales from the recognition of a legal contingency accrual recorded in the second quarter of fiscal 2024.\nOperating Income (Loss)\n- Operating income increased in the third quarter of fiscal 2025 due to lower operating costs, improved results in our live hog operations and lapping the impacts of a legal contingency accrual and plant closures and disposal charges recorded in the third quarter of fiscal 2024, partially offset by compressed pork margins. Operating loss increased in first nine months of fiscal 2025 due to compressed pork margins and the recognition of a legal contingency accrual, partially offset by lower operating costs, improved results in our live hog operations and lapping the impacts of plant closures and disposal charges recorded in the first nine months of fiscal 2024.\nChicken Segment Results\nAverage sales price change\nThird quarter and nine months – Fiscal 2025 vs Fiscal 2024\n- Sales volume increased in the third quarter and first nine months of fiscal 2025 primarily due to increased domestic production.\n- Average sales price increased in the third quarter due to mix and strong demand. Average sales price remained relatively flat in the first nine months of fiscal 2025 as the impact of lower input costs was offset by strong demand.\n- Operating income increased in the third quarter and first nine months of fiscal 2025 driven by operational execution, improved volumes and $20 million and $285 million of net decreases in feed ingredient costs, respectively, which was partially offset by increased marketing, advertising and promotion expenses. Additionally, operating income in the third quarter was impacted by reduced legal contingency accruals and net gains recognized from the network optimization plan, which included a gain from the sale of storage facilities net of other plan charges. The operating income increase in the first nine months of fiscal 2025 was also impacted by reduced legal contingency accruals and lower plant closures and disposal charges, partially offset by brand discontinuation charges, network optimization plan charges and lapping of insurance proceeds related to a production facility fire.\nPrepared Foods Segment Results\nAverage sales price change\nThird quarter and nine months – Fiscal 2025 vs Fiscal 2024\n– Sales volume decreased in the third quarter and first nine months of fiscal 2025 due to a challenging consumer environment.\n– Average sales price increased in the third quarter and first nine months of 2025 primarily due to the pass through of increased raw material costs.\n– Operating income increased in the third quarter and first nine months of fiscal 2025 primarily due to higher average sales price and improved operational execution, partly offset by increased raw material costs. Additionally, operating income increased in the first nine months of fiscal 2025 due to lower freight costs, selling, general and administrative costs and restructuring and related charges. For the third quarter and first nine months of fiscal 2025, operating income also benefited from net gains recognized from the network optimization plan, which included a gain from the sale of storage facilities net of other plan charges.\nInternational/Other Results\nOperating income (loss)\nThird quarter and nine months – Fiscal 2025 vs Fiscal 2024\n– Sales for the third quarter and first nine months of fiscal 2025 decreased primarily due to lower average sales price.\nOperating Income (Loss)\n– Operating income increased in the third quarter and first nine months of fiscal 2025 primarily due to improved performance, insurance proceeds and lapping the charges related to a production facility fire in the first quarter of fiscal 2024 and the subsequent decision to sell the facility and remuneration received related to the relocation of a production facility in China.\nLIQUIDITY AND CAPITAL RESOURCES\nOur cash needs for working capital, capital expenditures, growth opportunities, repurchases of senior notes, repayment of maturing debt, the payment of dividends and share repurchases are expected to be met with current cash on hand, cash flows provided by operating activities or short-term borrowings. Based on our current expectations, we believe our liquidity and capital resources will be sufficient to operate our business. However, we may take advantage of opportunities to generate additional liquidity or refinance existing debt through capital market transactions. The amount, nature and timing of any capital market transactions will depend on our operating performance and other circumstances; our then-current commitments and obligations; the amount, nature and timing of our capital requirements; any limitations imposed by our current credit arrangements; and overall market conditions.\nCash Flows from Operating Activities\nNon-cash items in net income\nNet changes in operating assets and liabilities:\n(Increase) decrease in accounts receivable\n(Increase) decrease in inventories\nIncrease (decrease) in accounts payable\nIncrease (decrease) in income taxes payable/receivable\nNet changes in other operating assets and liabilities\nNet cash provided by operating activities\nNon-cash items in net income primarily included depreciation and amortization of $1,029 million and $1,082 million for the nine months ended June 28, 2025 and June 29, 2024, respectively, and a $343 million goodwill impairment in the first nine months of fiscal 2025.\nCash provided by operating activities for the first nine months of fiscal 2025 was $1,620 million, a decrease of $353 million compared to the first nine months of fiscal 2024, as the $103 million of higher earnings, net of non-cash items, was more than offset by a $456 million decrease in cash provided by the net changes in operating assets and liabilities which was primarily impacted by:\nA decrease of $443 million due to an increase in inventory of $194 million in the first nine months of fiscal 2025, compared to a decrease of $249 million in the first nine months of fiscal 2024, primarily due to increased average cost of inventory and higher volume of livestock.\nA decrease of $228 million due to a decrease in the net changes in other operating assets and liabilities of $13 million in the first nine months of fiscal 2025, compared to an increase of $215 million in the first nine months of 2024, primarily due to performance-based compensation.\nA decrease of $121 million due to an increase in accounts receivable of $48 million in the first nine months of fiscal 2025, compared to a decrease of $73 million in the first nine months of fiscal 2024 as days sales outstanding decreased more during the first nine months of fiscal 2024 than the first nine months of fiscal 2025.\nPartially offset by:\nAn increase of $247 million due to a decrease in accounts payable of $5 million during the first nine months of fiscal 2025, compared to a decrease of $252 million in the first nine months of fiscal 2024, primarily due to a reduction in accounts payable in fiscal 2024 associated with lower input costs.\nCash Flows from Investing Activities\nAdditions to property, plant and equipment\nProceeds from sale of (purchases of) marketable securities, net\nProceeds from sale of storage facilities\nAcquisition of equity investments\nNet cash used for investing activities\nAdditions to property, plant and equipment included spending for production growth, safety and animal well-being, new equipment, infrastructure replacements and upgrades to maintain competitive standing and position us for future opportunities.\nWe expect capital expenditures at or below $1 billion for fiscal 2025. Capital expenditures include investments in profit improvement projects as well as projects for maintenance and repair. This includes complet"
}