{
  "source_file": "tsn-20250927.htm",
  "form_type": "10-K",
  "item1_clean": "ITEM 1. BUSINESS\nGENERAL\nTyson Foods, Inc. and its subsidiaries (collectively, the “Company,” “we,” “us,” “our,” “Tyson Foods” or “Tyson”) (NYSE: TSN) is a world-class food company and recognized leader in protein. Founded in 1935 by John W. Tyson, it has grown under four generations of family leadership. The Company is unified by this purpose: Tyson Foods. We Feed the World Like Family™ and has a broad portfolio of iconic products and brands including Tyson®, Jimmy Dean®, Hillshire Farm®, Ball Park®, Wright®, State Fair®, Aidells® and ibp®. Tyson Foods is dedicated to bringing high-quality food to every table in the world, safely, and affordably, now and for future generations. Headquartered in Springdale, Arkansas, the Company had approximately 133,000 employees (“team members”) on September 27, 2025. Through its Core Values, Tyson Foods strives to operate with integrity, create value for its shareholders, customers, communities and team members, be faith-friendly and inclusive, provide a safe work environment and serve as a steward of the animals, land and environment entrusted to it. Some of the key factors influencing our business are customer demand for our products; the ability to maintain and grow relationships with customers and introduce new and innovative products to the marketplace; accessibility of international markets; market prices for our products; the cost and availability of live cattle and hogs, raw materials and feed ingredients; availability of team members to operate our production facilities; and operating efficiencies of our facilities.\nWe operate a fully vertically-integrated chicken production process. Our integrated operations consist of breeding stock, contract farmers, feed production, processing, further-processing, marketing and transportation of chicken and related specialty products, including animal and pet food ingredients. Through our wholly-owned subsidiary, Cobb-Vantress, we are one of the leading poultry breeding stock suppliers in the world. Investing in breeding stock research and development allows us to breed into our flocks the characteristics found to be most desirable.\nWe also process live fed cattle and hogs and fabricate dressed beef and pork carcasses into primal and sub-primal meat cuts, case-ready beef and pork and fully-cooked meats. In addition, we derive value from specialty products such as hides and variety meats sold to further processors and others.\nWe produce a wide range of fresh, value-added, frozen and refrigerated food products. Our products are marketed and sold primarily by our sales staff to grocery retailers, grocery wholesalers, meat distributors, warehouse club stores, military commissaries, industrial food processing companies, chain restaurants or their distributors, live markets, international export companies and domestic distributors who serve restaurants, foodservice operations such as plant and school cafeterias, convenience stores, hospitals and other vendors. Additionally, sales to the military and a portion of sales to international markets are made through independent brokers and trading companies.\nAs part of our commitment to innovation and growth, we have a subsidiary focused on investing in companies developing breakthrough technologies, business models and products that have the potential to transform the food industry. Tyson New Ventures, LLC is used to broaden our exposure to innovative, new forms of protein and ways of improving animal welfare, water management, and packaging and land stewardship initiatives to complement the Company’s continuing investments in innovation in our core Beef, Pork, Chicken and Prepared Foods businesses.\nFINANCIAL INFORMATION OF SEGMENTS\nWe operate in four reportable segments: Beef, Pork, Chicken and Prepared Foods. We measure segment profit as operating income (loss). International/Other primarily includes our foreign operations in China, Malaysia, Mexico, South Korea, Thailand and the Kingdom of Saudi Arabia, third-party merger and integration costs and corporate overhead related to Tyson New Ventures, LLC. The contribution of each segment to net sales and operating income (loss), and the identifiable assets attributable to each segment, are set forth in Part II, Item 8, Notes to Consolidated Financial Statements, Note 17: Segment Reporting.\nDESCRIPTION OF SEGMENTS\nBeef includes our operations related to processing live fed cattle and fabricating dressed beef carcasses into primal and sub-primal meat cuts and case-ready products. Products are marketed domestically to food retailers, foodservice distributors, restaurant operators, hotel chains and noncommercial foodservice establishments such as schools, healthcare facilities, the military and other food processors, as well as to international export markets. This segment also includes sales from specialty products such as hides, rendered products and variety meats, as well as logistics operations to move products through the supply chain.\nPork includes our operations related to processing live market hogs and fabricating pork carcasses into primal and sub-primal cuts and case-ready products. Products are marketed domestically to food retailers, foodservice distributors, restaurant operators, hotel chains and noncommercial foodservice establishments such as schools, healthcare facilities, the military and other food processors, as well as to international export markets. This segment also includes our live swine group, related specialty product processing activities and logistics operations to move products through the supply chain.\nChicken includes our domestic operations related to raising and processing live chickens into and purchasing raw materials for fresh, frozen and value-added chicken products, as well as sales from specialty products. Our value-added chicken products primarily include breaded chicken strips, nuggets, patties and other ready-to-fix or fully cooked chicken parts. Products are marketed domestically to food retailers, foodservice distributors, restaurant operators, convenience stores, hotel chains and noncommercial foodservice establishments such as schools, healthcare facilities, the military and other food processors, as well as to international export markets. This segment also includes logistics operations to move products through our domestic supply chain and the global operations of our chicken breeding stock subsidiary.\nPrepared Foods includes our operations related to manufacturing and marketing frozen and refrigerated food products and logistics operations to move products through the supply chain. This segment includes brands such as Jimmy Dean®, Hillshire Farm®, Ball Park®, Wright®, State Fair®, as well as artisanal brands Aidells® and Gallo Salame®. Products primarily include a mixture of ready-to-cook and ready-to-eat sandwiches, sandwich components such as flame-grilled hamburgers and Philly steaks, pepperoni, bacon, breakfast sausage, turkey, lunchmeat, hot dogs, flour and corn tortilla products, appetizers, snacks, prepared meals, ethnic foods, side dishes, meat dishes, breadsticks and processed meats. Products are marketed domestically to food retailers, foodservice distributors, restaurant operators, convenience stores, hotel chains and noncommercial foodservice establishments such as schools, healthcare facilities, the military and other food processors, as well as to international export markets.\nRAW MATERIALS AND SOURCES OF SUPPLY\nThe primary raw materials used in our beef operations are live cattle. We do not have facilities of our own to raise cattle but employ cattle buyers located throughout cattle producing areas who visit independent feed yards and public auctions to buy live cattle on the open spot market. These buyers are trained to select high quality animals, and we continually measure their performance. We also enter into various risk-sharing and procurement arrangements with producers to secure a supply of livestock for our facilities. Although we generally expect adequate supply of live cattle in the regions we operate, there may be periods of imbalance in supply and demand. The U.S. cattle market is currently experiencing limited supply of market-ready cattle and uncertainty exists regarding the timing of anticipated cattle herd rebuild.\nThe primary raw materials used in our pork operations are live hogs. The majority of our live hog supply is obtained through various procurement relationships with independent producers. We employ hog buyers who make purchase agreements of various time durations as well as purchase hogs on a daily basis, generally a few days before the animals are processed. These buyers are trained to select high quality animals, and we continually measure their performance. Additionally, we raise a small number of weanling swine to sell to independent finishers and to supply a minimal amount of market hogs and live swine for our own processing needs. Although we generally expect adequate supply of live hogs in the regions we operate, there may be periods of imbalance in supply and demand.\nThe primary raw materials used in our domestic chicken operations are corn and soybean meal, used as feed, and live chickens raised primarily by independent contract farmers. Our vertically-integrated chicken process begins with breeding our pedigree and great grandparent stock out to produce the grandparent breeder flocks and ends with broilers for processing. Breeder flocks (i.e., grandparents) are raised to maturity in grandparent growing and laying farms where fertile eggs are produced. Fertile eggs are incubated at the grandparent hatchery and produce pullets (i.e., parents). Pullets are raised to 20 weeks of age, sent to breeder houses, and the resulting eggs are sent to our hatcheries. Once chicks have hatched, they are sent to broiler farms. There, contract farmers care for and raise the chicks according to our standards, with advice from our technical service personnel, until the broilers reach the desired processing weight. Adult chickens are transported to processing facilities where they are harvested and converted into finished products, which are then sent to distribution centers and delivered to customers.\nWe operate feed mills to produce scientifically-formulated feeds. In fiscal 2025, corn, soybean meal and other feed ingredients were major production costs, representing roughly 53% of our cost of growing a live chicken domestically. In addition to feed ingredients to grow the chickens, we use cooking ingredients, packaging materials and cryogenic agents. We believe our sources of supply for these materials are adequate for our present needs, and we do not anticipate any difficulty in acquiring these materials in the future.\nWhile we produce nearly all our inventory of breeder chickens and live broilers, we also purchase ice-packed or deboned chicken to meet production and sales requirements.\nThe primary raw materials used in our prepared foods operations are commodity-based raw materials, including beef, pork, chicken, turkey, flour, vegetables, cheese, eggs, seasonings and other cooking ingredients. Some of these raw materials are provided by our other segments, while others may be purchased from numerous suppliers and manufacturers. We believe the sources of supply of raw materials are adequate for our present needs.\nSEASONAL DEMAND\nDemand for beef, chicken, pork and certain prepared foods products, such as hot dogs and smoked sausage, generally increases during the spring and summer months and other key holiday periods and is generally softer during the winter months. Other prepared foods products, such as prepared meals, meat dishes, appetizers, bacon, and breakfast sausage, generally experience increased demand during the winter months, and also key holiday seasons, while demand generally is softer during the spring and summer months.\nCUSTOMERS\nWalmart Inc. accounted for approximately\n% of our fiscal 2025 consolidated s",
  "item7_clean": "primarily due to a non-deductible goodwill impairment in fiscal 2025.\nNet Income (Loss) Attributable to Tyson\nin millions, except per share data\nNet income (loss) attributable to Tyson\nNet income (loss) attributable to Tyson - per diluted share\n– Included the following items:\n$738 million pretax, or ($1.58) per diluted share, of legal contingency accruals.\n$343 million pretax, or ($0.96) per diluted share, related to a goodwill impairment (non-tax deductible).\n$45 million pretax, or ($0.11) per diluted share, of restructuring and related charges.\n$41 million pretax, or ($0.09) per diluted share, related to a charge from a product recall.\n$28 million pretax, or ($0.08) per diluted share, related to impairment of equity investments.\n$23 million pretax, or ($0.05) per diluted share, related to brand and product line discontinuations.\n$17 million pretax, or ($0.04) per diluted share, of plant closure and disposal charges.\n$36 million pretax, or $0.12 per diluted share, of facility fire related insurance proceeds.\n– Included the following items:\n$182 million pretax, or ($0.41) per diluted share, of plant closure and disposal charges.\n$174 million pretax, or ($0.38) per diluted share, of legal contingency accruals.\n$18 million pretax, or ($0.02) per diluted share, of facility fire related insurance proceeds, net of costs.\n$31 million pretax, or ($0.06) per diluted share, of restructuring and related charges.\n$8 million pretax, or ($0.02) per diluted share, related to brand and product line discontinuations.\nSEGMENT RESULTS\nWe operate in four reportable segments: Beef, Pork, Chicken, and Prepared Foods. International/Other primarily includes our foreign operations in China, Malaysia, Mexico, South Korea, Thailand and the Kingdom of Saudi Arabia, third-party merger and integration costs and corporate overhead related to Tyson New Ventures, LLC. Additional information regarding the geographic areas of our foreign operations is set forth in Part II, Item 8, Notes to Consolidated Financial Statements, Note 17: Segment Reporting. The following table is a summary of segment sales and operating income (loss) for fiscal years ended 2025, 2024 and 2023, which is how we measure segment income (loss):\nOperating Income (Loss)\n(a) Beef segment results for fiscal 2025 included $343 million of goodwill and intangible impairments, $318 million of legal contingency accruals and $48 million of restructuring and related charges. Beef segment results for fiscal 2024 included a $45 million legal contingency accrual and $41 million of plant closure and disposal charges. Beef segment results for fiscal 2023 included $333 million of goodwill and intangible impairments, $42 million of facility fire related insurance proceeds and $33 million of restructuring and related charges.\n(b) Pork segment results for fiscal 2025 included $380 million of legal contingency accruals. Pork segment results for fiscal 2024 included $108 million of plant closure and disposal charges and $73 million of legal contingency accruals.\n(c) Chicken segment results for fiscal 2025 included $23 million related to brand and product line discontinuations, $23 million of plant closure and disposal charges and $9 million of restructuring and related charges. Chicken segment results for fiscal 2024 included a $56 million legal contingency accrual, $33 million of plant closure and disposal charges and $70 million of facility fire related insurance proceeds. Chicken segment results for fiscal 2023 included $322 million of plant closure and disposal charges, $210 million of goodwill and intangible impairments, $156 million of legal contingency accruals, $16 million of restructuring and related charges and $11 million of facility fire related insurance proceeds.\n(d) Prepared Foods segment results for fiscal 2025 included $41 million of charges related to a product recall and a net benefit of $26 million related to restructuring and related charges, which included a gain from the sale of storage facilities net of other plan charges. Prepared Foods segment results for fiscal 2024 included $24 million of restructuring and related charges. Prepared Foods segment results for fiscal 2023 included $49 million of restructuring and related charges and $17 million of brand and product line discontinuations.\n(e) International/Other results for fiscal 2025 included a $40 million legal contingency charge related to the 2015 sale of our Mexico operation, $18 million of facility fire related insurance proceeds and $14 million of restructuring and related charges. International/Other results for fiscal 2024 included $86 million of facility fire related costs. International/Other results for fiscal 2023 included a $238 million goodwill and intangible impairments.\nBeef Segment Results\nChange 2025 vs. 2024\nChange 2024 vs. 2023\nAverage Sales Price Change\nOperating Income (Loss)\n– Sales volume decreased as lower head harvested were offset by higher average carcass weights.\n– Average sales price increased due to increased input costs and strong demand. The change in average sales price for fiscal 2025 excludes a $318 million reduction of Sales from the recognition of legal contingency accruals.\nOperating Income (Loss)\n– Operating loss increased in fiscal 2025 due to compressed Beef margins, goodwill and intangible impairments, legal contingency accruals and increased restructuring and related charges, partially offset by improved operational execution and lapping the impacts of plant closure and disposal charges recorded in fiscal 2024.\n– Sales volume increased primarily due to higher average carcass weights.\n– Average sales price increased due to increased input costs and increased demand.\nOperating Income (Loss)\n– Operating income decreased primarily due to compressed beef margins, the recognition of legal contingency accruals and plant closure and disposal charges in fiscal 2024, and recognition of facility fire related insurance proceeds in fiscal 2023 related to a fire at a production facility in 2019, partially offset by goodwill and intangible impairments recorded in fiscal 2023.\nPork Segment Results\nChange 2025 vs. 2024\nChange 2024 vs. 2023\nAverage Sales Price Change\nOperating Income (Loss)\n– Sales volume decreased due to production decreases associated with a plant closure in 2024 which were partially offset by production increases at other facilities and higher average carcass weights.\n– Average sales price increased due to increased input costs and strong demand for our pork products. The change in average sales price excludes a $380 million and $45 million reduction of Sales from the recognition of legal contingency accruals recorded in fiscal 2025 and 2024, respectively.\nOperating Income (Loss)\n– Operating loss increased due to compressed pork margins and the recognition of legal contingency accruals, partially offset by lower operating costs, improved results in our live hog operations and lapping the impacts of plant closure and disposal charges and restructuring and related charges recorded in fiscal 2024.\n– Sales volume increased due to improved market conditions and increased domestic availability of market-ready hogs.\n– Average sales price decreased driven by lower pricing on drop credit items. The change in average sales price excludes the impact of a $45 million reduction of Sales from the recognition of legal contingency accruals in fiscal 2024.\nOperating Income (Loss)\n– Operating income increased primarily due to higher pork margins, improved results in our live hog operations and lapping the impacts of facility fire related costs in the third quarter of fiscal 2023, partially offset by the recognition of legal contingency accruals and plant closure and disposal costs in fiscal 2024.\nChicken Segment Results\nChange 2025 vs. 2024\nChange 2024 vs. 2023\nAverage Sales Price Change\nOperating Income (Loss)\n– Sales volume increased primarily due to increased domestic production.\n– Average sales price remained relatively flat as the impact of lower input costs was offset by strong demand.\nOperating Income (Loss)\n– Operating income increased primarily due to improved operational execution, improved volumes and $340 million of net decreases in feed ingredient costs which was partially offset by increased marketing, advertising and promotion expenses. Operating income was also impacted by reduced legal contingency accruals partially offset by increased costs related to brand and product line discontinuations, restructuring and related charges and lapping of facility fire related insurance proceeds recognized in fiscal 2024 associated with a production facility fire in the fourth quarter of fiscal 2021.\n– Sales volume decreased primarily due to reduced domestic production.\n– Average sales price decreased due to the impact of lower input costs. The change in average sales price excludes the impact of a $156 million reduction of Sales from the recognition of legal contingency accruals in fiscal 2023.\nOperating Income (Loss)\n– Operating income increased primarily due to improved operational efficiencies, goodwill and intangible impairments recorded in fiscal 2023, lower plant closure and disposal charges, reduced legal contingency accruals, decreased freight costs and an increase in facility fire related insurance proceeds, net of costs associated with a production facility fire in the fourth quarter of fiscal 2021. Additionally, we experienced $895 million of lower feed ingredient costs in fiscal 2024 which was partially offset by associated decreases in average sales price.\nPrepared Foods Segment Results\nChange 2025 vs. 2024\nChange 2024 vs. 2023\nAverage Sales Price Change\n– Sales volume decreased due to a challenging consumer environment and the impact from a product recall.\n– Average sales price increased primarily due to the pass through of increased raw material costs.\n– Operating income increased primarily due to higher average sales price, improved operational execution and lower selling, general and administrative costs, partially offset by increased raw material costs and charges related to a product recall. Additionally, fiscal 2025 benefited from net gains recognized from restructuring and related charges, which included a gain from the sale of storage facilities.\n– Sales volume increased primarily due to the acquisition of Williams Sausage Company in the third quarter of 2023.\n– Average sales price decreased primarily due to sales mix.\n– Operating income increased primarily due to lower raw materials costs, freight costs, marketing, advertising and promotion expenses and restructuring and related charges.\nInternational/Other Results\nChange 2025 vs. 2024\nChange 2024 vs. 2023\nOperating Income (Loss)\n– Sales decreased due to lower average sales price.\nOperating Income (Loss)\n– Operating income increased primarily due to improved performance, insurance proceeds and lapping the charges related to a production facility fire in the first quarter of fiscal 2024, partially offset by the recognition of a legal accrual related to the 2015 sale of our Mexico operation.\n– Sales decreased due to lower average sales price and the impact of the production facility fire in the Netherlands partially offset by increased volumes in the other regions.\nOperating Income (Loss)\n– Operating income increased primarily due to a goodwill impairment charge recorded in fiscal 2023, partially offset by the impacts of a production facility fire in the first quarter of fiscal 2024 and the subsequent decision to sell the facility.\nLIQUIDITY AND CAPITAL RESOURCES\nOur cash needs for working capital, capital expenditures, growth opportunities, repurchases of senior notes, repayment of maturing debt, the payment of dividends and share repurchases are expected to be met with current cash on hand, cash flows provided by operating activities or short-term borrowings. Based on our current expectations, we believe our liquidity and capital resources will be sufficient to operate our business. However, we may take advantage of opportunities to generate additional liquidity or refinance existing debt through capital market transactions. The amount, nature and timing of any capital market transactions will depend on our operating performance and other circumstances; our then-current commitments and obligations; the amount, nature and timing of our capital requirements; any limitations imposed by our current credit arrangements; and overall market conditions.\nCash Flows from Operating Activities\nNon-cash items in net income\nNet changes in operating assets and liabilities:\n(Increase) decrease in accounts receivable\n(Increase) decrease in inventories\nIncrease (decrease) in accounts payable\nIncrease in income taxes payable/receivable\nNet changes in other operating assets and liabilities\nNet cash provided by operating activities\nNon-cash items in net income primarily included depreciation and amortization of $1,361 million and $1,400 million in fiscal 2025 and fiscal 2024, respectively, and a $343 million goodwill impairment in fiscal 2025.\nCash provided by operating activities for fiscal 2025 was $2.2 billion, a decrease of $435 million compared to fiscal 2024, due to $105 million of lower earnings, net of non-cash items, and a $330 million decrease in cash provided by the net changes in operating assets and liabilities which was primarily impacted by:\nA decrease of $602 million due to an increase in inventory of $449 million in fiscal 2025, compared to a decrease of $153 million in fiscal 2024, primarily due to increased average cost of inventory and higher volume of livestock.\nA decrease of $180 million due to an increase in accounts receivable of $121 million in fiscal 2025, compared to a decrease of $59 million in fiscal 2024 as days sales outstanding increased more during fiscal 2025 than fiscal 2024 driven largely by increased average sales prices.\nPartially offset by:\nAn increase of $389 million due to an increase in accounts payable of $184 million during fiscal 2025, compared to a decrease of $205 million in fiscal 2024, primarily due to higher input costs and increase in days payables outstanding.\nAn increase of $145 million due to an increase of $273 million in the net changes in other operating assets and liabilities in fiscal 2025, compared to an increase of $128 million in fiscal 2024, primarily driven by an increase in legal accruals net of payments offset by an increase in fiscal 2024 performance-based compensation.\nCash Flows from Investing Activities\nAdditions to property, plant and equipment\n(Purchases of)/Proceeds from marketable securities, net\nProceeds from sale of business\nProceeds from sale of storage facilities\nAcquisition of equity investments\nNet cash used for investing activities\nAdditions to property, plant and equipment included spending for production growth, safety, animal well-being, new equipment, infrastructure replacements and upgrades to maintain competitive standing and position us for future opportunities.\nApproximately $520 million will be necessary to complete buildings and equipment under construction at September 27, 2025.\nWe expect capital expenditures between $0.7 billion and $1.0 billion for fiscal 2026. Capital expenditures include investments in profit improvement projects as well as projects for maintenance and repair.\nProceeds from sale of business related to the sale of our Vienna, Georgia facility in fiscal 2024.\nProceeds from sale of storage facilities related to the sale of multiple Tyson-owned and operated cold storage facilities in fiscal 2025.\nOther, net for fiscal 2025 primarily included insurance proceeds related to fires at our production facilities and proceeds from disposition of assets. Other, net for fiscal 2024 primarily included proceeds from disposition of corporate assets, proceeds on the sale of an equity method investment and insurance proceeds related to fires at our production facilities.\nCash Flows from Financing Activities\nProceeds from is",
  "item2_clean": null
}