{
  "source_file": "ttd-20241231.htm",
  "form_type": "10-K",
  "item1_clean": "The Trade Desk, Inc. (the “Company,” “we,” “our,” or “The Trade Desk”) offers a self-service, cloud-based ad-buying platform that empowers our clients to plan, manage, optimize and measure more expressive data-driven digital advertising campaigns. Our platform allows clients to execute integrated campaigns across ad formats and channels, including connected television (“CTV”) and other video, display, audio, and native, on a multitude of devices, such as televisions, streaming devices, mobile devices, computers and digital-out-of-home devices. Our platform’s integrations with major inventory, publisher and data partners provide ad buyers reach and decisioning capabilities, and our enterprise application programming interfaces (“APIs”) enable our clients to customize and expand platform functionality.\nOur clients are advertising agencies, advertisers and other service providers for agencies or advertisers, with whom we enter into ongoing master services agreements (“MSAs”). We generate revenue by charging our clients a platform fee generally based on a percentage of our clients’ total platform spend and from providing value-added services and data to support their advertising campaigns.\nThe Trade Desk was originally incorporated in 2009 and is a Nevada corporation. We are headquartered in Ventura, California.\nWe believe that several trends in the advertising industry, happening in parallel, will result in programmatic advertising — the buying and selling of advertising inventory using algorithmic software that automates the process — being the predominant means by which companies reach consumers online and through connected devices.\nSome of the key industry trends are:\nMedia is Increasingly Digital.\nMedia is increasingly digital as a result of advances in technology and changes in consumer behavior. This shift has enabled unprecedented options for advertisers to target and measure their advertising campaigns across nearly every media channel and connected device. The digital advertising market is a significant and growing part of the total advertising market. As media becomes increasingly digital, decisions based on consumer and behavioral data are more prevalent.\nFragmentation of Audience.\nAs digital media grows, audience fragmentation is accelerating. A growing “long tail” of mobile applications, social media platforms, streaming services and websites presents a challenge for advertisers trying to reach a large audience. Additionally, the number of devices used by individual consumers has increased. Both of these fragmentation trends are opportunities for technology companies that can consolidate and simplify media buying options for advertisers and agencies.\nWe are witnessing a generational shift from linear television to CTV as Internet and television programming converge. New technologies support seamless delivery of streaming video content, accelerating consumers’ demand to watch what they want, when they want and where they want. We believe that this increased demand for CTV will bring about new opportunities for content owners and advertisers to connect with consumers, including through ad-supported subscription models, and will further drive the shift towards data-driven advertising.\nIncreased Use of Data and Measurement.\nAdvances in software and hardware, and the ubiquitous use of the Internet, have enabled the generation of user data at an unprecedented scale. Data vendors and other organizations are able to collect this user data across a wide range of Internet properties and connected devices, aggregate it and combine it with other data sources. This data is pseudonymized and made available within seconds based on specific parameters and attributes. Advertisers can integrate this targeting data with their own data or an agency’s proprietary data relating to client attributes, the advertisers’ own store locations and other related characteristics. Through the use of these types of data sources, together with measurement features, including real-time feedback on consumer reactions to the ads, programmatic advertising increases the value of impressions for advertisers and inventory owners, and viewers receive more relevant ads. At the same time, new laws, enforcement of existing laws, and self-regulatory rules regarding the collection, use, and disclosure of personal information continue to impact these practices.\nAutomation of Ad Buying.\nThe growing complexity of digital advertising and the laws and rules that govern it have increased the need for automation. Technology that enables fast, accurate and cost-effective decision making through the application of computer algorithms that use extensive data sets has become critical for the success of digital advertising campaigns. Using programmatic inventory buying tools, advertisers are able to automate their campaigns, providing them with better price discovery on an impression-by-impression basis. As a result, advertisers are able to bid on and purchase the advertising inventory they value the most, pay less for advertising inventory they do not value as much and abstain from buying advertising inventory that does not fit their campaign parameters.\nDigital Advertising Ecosystem\nThe digital advertising ecosystem is divided into buyers, sellers and marketplaces, which can be further segmented on the basis of whether participants provide services or technology. We believe that participants on the buy side or sell side should be advocates for their buyers or sellers, while those in the marketplace business should act as a referee or have market-driven incentives to protect or enhance the integrity of the marketplace.\nWe empower ad buyers by providing a self‑service cloud-based ad-buying platform that enables them to plan, manage, optimize and measure data‑driven digital advertising campaigns. Our platform allows clients to execute integrated campaigns across various advertising channels and formats, including CTV and other video, display, audio and native, on a multitude of devices, including televisions, streaming devices, mobile devices, computers and digital-out-of-home devices.\nWe Are Focused on the Buy Side.\nWe focus on buyers since they control the advertising budgets. The supply of digital advertising inventory exceeds demand, and accordingly, we believe it is a buyer’s market. We also believe that by aligning our core offerings with buyers, we are able to avoid conflicts of interest that exist when serving both the buy side and sell side. We provide and are developing additional offerings and features that work with publishers and supply-side partners to help ensure access to quality advertising inventory and to enable improved evaluation of such inventory and better decisioning capabilities for buyers of advertising. This focus allows us to build trust with clients, many of whom leverage their proprietary data on our platform. That trust and ability to use their own data on our platform, without worrying about it being used by other participants, enables our clients and their advertisers to achieve better results. This trust provides us with the benefit of long-term and stable relationships with our clients.\nWe Are an Enabler, Not a Disruptor.\nThrough our platform and related offerings, we enable advertisers, agencies and other service providers that participate in the digital advertising ecosystem. Advertisers are able to use our platform directly or through their agencies of choice.\nOur platform was founded on the principle that data-driven decisions will be the future of advertising. We built a data-management platform first, before building our ad-buying technology. While data from third-party data providers improves campaign performance, our clients’ success often relies largely on our ability to ingest proprietary data directly from advertisers and agencies to enable intelligent decisioning that optimizes advertising campaigns. Given our independent buy-side focused approach and our strict protocols governing the ingestion of client first-party data into our data management platform, our clients trust us with their most granular and expressive data. Our technology platform enables effective use of such data, allowing our clients to run precisely targeted advertising campaigns that help maximize their return on advertising investments. Additionally, we are able to better optimize campaigns by using the data streams that we capture across different devices, so that data from one channel can be used to inform another (subject to appropriate consumer choices). The breadth of data that we make available on our data marketplace from numerous data sources across channels gives our clients a holistic view of their target audiences, enabling more effective targeting across different channels. Finally, the depth of data we make available, such as various types of retail data, including in-store purchase data, gives our clients the ability to engage in more precise attribution and closed-loop measurement.\nWe Do Not Arbitrage Advertising Inventory.\nTo further align our interests with those of our clients, we do not buy advertising inventory in order to resell it to our clients for a profit. Instead, we provide our clients with a platform that allows them to manage their omnichannel advertising campaigns, on a self-service basis with robust reporting. With our platform, our clients control their campaign spend and can access and choose from many inventory sources.\nWe Have Ongoing Relationships with Clients.\nWe derive substantially all of our revenue from ongoing MSAs with our clients, rather than episodic insertion orders. We believe this approach strengthens our relationships with our clients and helps us grow their use of our platform over the long term, providing us with a highly scalable business model.\nWe Are a Clear Box, Not a Black Box.\nOur platform is transparent and shows our clients their spend on advertising inventory, value-added services and data; the platform fee; and detailed performance metrics on their advertising campaigns. Our clients directly access and execute campaigns on our platform and control all facets of inventory purchasing decisions. Clients also receive detailed, real-time reporting on all their advertising campaigns. By providing transparent information on our platform, we enable our clients to continually compare results and target their budgets toward the most effective advertising inventory, data providers and channels.\nWe Are an Open Platform.\nClients can customize and build their own features on top of our platform. For example, clients may use our APIs to design their own user interface, bulk manage advertising campaigns and link other systems, including ad servers or reporting tools. By using our APIs or by working with our engineering team, clients can invest their own resources to build their own proprietary tools for reporting, campaign strategy, custom algorithms, proprietary data use or other use cases. Our open platform approach enables our advertising agency and service provider clients to provide differentiated offerings to their clients, which we believe leads to long-term relationships and increased use of our platform.\nAt the core of our platform is our bid-factor-based architecture that allows users to define desirable factors and the value associated with those factors. Based on these factors, our platform can compute the value of impressions in real time and bid only for optimal impressions. Because of the granularity of the bid factors, users of our platform can rapidly create billions of different bid permutations with only a few clicks. This expressiveness enables better targeting, pricing and campaign results.\nOur platform is powerful and user friendly:\nEasy to Use, Open and Customizable.\nOur platform includes easy-to-use tools and interfaces that help our users focus on managing the key elements of their campaigns. Our platform also enables clients to integ",
  "item7_clean": "We offer a self-service, cloud-based ad-buying platform that empowers our clients to plan, manage, optimize and measure more expressive data-driven digital advertising campaigns. Our platform allows clients to execute integrated campaigns across ad formats and channels, including CTV and other video, display, audio, and native, on a multitude of devices, such as televisions, streaming devices, mobile devices, computers and digital-out-of-home devices. Our platform’s integrations with major inventory, publisher and data partners provide ad buyers reach and decisioning capabilities, and our enterprise APIs enable our clients to customize and expand platform functionality.\nOur clients are advertising agencies, advertisers and other service providers for agencies or advertisers, with whom we enter into ongoing MSAs. We generate revenue by charging our clients a platform fee generally based on a percentage of our clients’ total spend on our platform and from providing value-added services and data to support their advertising campaigns.\nYear Ended December 31,\n(in millions, except percentages)\nFor internal management purposes, we utilize gross spend as a metric to assess our market share and scale, plan for optimal levels of support for our clients and measure our growth from existing clients. Gross spend measures the amount of a client’s spend on our platform for advertising inventory, value-added services and data; plus the platform fee, which is generally based on a percentage of a client’s total spend on our platform. We expect our take rate (revenue as a percentage of gross spend) to fluctuate due to the types of services rendered and client-selected features purchased through our platform and certain volume discounts. Other companies, including companies in our industry, may calculate gross spend or similarly titled measures differently, which reduces its usefulness as a comparative measure.\nTrends, Opportunities and Challenges\nThe growing digitization of media and fragmentation of audiences has increased the complexity of advertising, and thereby increased the need for automation in ad buying, which we provide on our platform. In order to grow, we will need to continue to develop our platform’s programmatic capabilities and expand our advertising inventory, value-added services and data to support our clients’ advertising campaigns. We believe that key opportunities include our ongoing global expansion, continuing development of our omnichannel ad inventory (including in channels such as CTV and other video, mobile, audio and others), adoption and utilization of retail data and continuing development and adoption of the data usage, measurement and targeting capabilities provided by our platform.\nWe believe that growth of the programmatic advertising market is important for our ability to grow our business. Adoption of programmatic advertising by advertisers allows us to acquire new clients and grow revenue from existing clients. Although our clients include some of the largest advertising agencies and advertisers in the world, we believe there is significant room for us to expand further within these clients and gain a larger amount of their advertising spend through our platform. We also believe that the industry trends noted above will lead to advertisers adopting programmatic advertising through platforms such as ours.\nSimilarly, the adoption of programmatic advertising by inventory owners and content providers allows us to expand the volume and type of advertising inventory we present to our clients. For example, we have expanded our CTV, audio and other advertising offerings through our integrations with supply-side partners and publishers.\nWe invest for long-term growth. We anticipate that our operating expenses will continue to increase in the foreseeable future as we invest in platform operations and technology and development to enhance our platform, including programmatic buying of CTV ad inventory, and hosting capabilities. We also anticipate that our sales and marketing expenses will continue to increase to acquire new clients and reinforce our relationships with existing clients. In addition, we expect to continue making investments in our infrastructure, including our information technology, financial and administrative systems and controls to support our growing operations.\nWe believe the markets outside of the United States, and in particular across Europe and Asia in markets such as the U.K, Germany, France, China, Japan, India and Australia, offer opportunities for growth. However, such markets may also pose challenges related to compliance with local laws and regulations, restrictions on foreign ownership or investment, uncertainty related to trade relations and a variety of additional risks. We intend to make additional investments in sales and marketing and product development to expand in international markets where we are making significant investments in our platform and growing our team.\nWe believe that these investments will contribute to our long-term growth, although they may negatively impact profitability in the near term.\nOur business model has allowed us to grow significantly, and we believe that our operating leverage enables us to support future long-term growth profitably.\nMacroeconomic Uncertainty\nChanges in interest and foreign currency exchange rates, inflation and geopolitical developments have resulted, and may continue to result, in a global slowdown of economic activity, which may decrease demand for a broad variety of goods and services in various industries, including those provided by our clients, while also disrupting supply channels, sales channels and advertising and marketing activities for an unknown period of time until economic activity normalizes. As a result of the current uncertainty in economic activity, we are unable to predict the size and duration of the impact on our revenue and our results of operations. The extent of the impact of these macroeconomic factors on our operational and financial performance will depend on a variety of factors, and the duration and extent of geopolitical and global economic disruption and their respective impacts on our clients, partners, industry and employees, all of which are uncertain at this time and cannot be accurately predicted. See “\nItem 1A. Risk Factors\nFactors Affecting Our Performance\nGrowth in and Retention of Client Spend\nOur recent growth has been driven by expanding our share of spend by our existing clients and adding new clients. Our clients include some of the largest advertising agencies and advertisers in the world, and we believe there is significant room for us to expand further within these clients. As a result, future revenue growth depends upon our ability to retain our existing clients and to gain a larger amount of their spend through our platform in a highly competitive advertising market.\nIn order to analyze gross spend contributions and growth from existing clients, we measure annual gross spend for the set of clients, or cohort, that commenced spending on our platform in a specific year relative to subsequent periods. The gross spend from each of our cohorts has increased over subsequent periods. However, over time, we will likely lose clients from each cohort, clients may spend less on our platform and the growth rate of gross spend may change. Any such change could have a significant negative impact on gross spend and operating results.\nAbility to Expand our Omnichannel Reach, Including CTV, and Innovate across our Platform\nWe enable the purchase of advertising inventory in a wide variety of ad formats and channels, including CTV and other video, display, audio, and native, on a multitude of devices, such televisions, streaming devices, mobile devices, computers and digital-out-of-home devices. Our future growth will depend on our ability to maintain and grow the inventory and spend across these channels, in addition to continued growth in CTV. Our future growth will also depend on our ability to continue innovating and improving the technology underlying our platform and related offerings and enhancing their functionality, including the development of new or improved value-added services or the inclusion of additional data. We believe that our ability to integrate and offer CTV and other advertising inventory for purchase through our platform, our ability to continuously improve the features and functionality of our platform and related offerings and, in particular, our ability to manage the increased costs that will accompany these efforts, will impact the future growth of our business.\nGrowth of the Programmatic Advertising Market\nOur operating results and prospects will be impacted by the overall adoption of programmatic advertising by inventory owners and content providers, as well as advertisers and the agencies and service providers that represent them. Programmatic advertising has grown rapidly in recent years, and any acceleration or slowing of this growth may affect our operating and financial performance. In addition, even if the programmatic advertising market continues to grow at its current rate, our ability to position ourselves within the market will impact the future growth of our business. Further, our ability to effectively manage our investments in infrastructure and headcount in response to this potential growth will impact our future profitability.\nDevelopment of International Markets\nWe have been increasing our focus on markets outside the United States to serve the global needs of our clients. As the middle class grows abroad, we believe that the global opportunity for programmatic advertising is significant and\nshould continue to expand as publishers and advertisers outside the United States seek to adopt the benefits that programmatic advertising provides. To capitalize on this opportunity, we intend to continue investing in our presence internationally. Our growth and the success of our initiatives in newer markets will depend on the continued adoption of our platform by our existing clients, as well as new clients, in these markets. Information about geographic concentrations of our business is set forth in\nNote 12—Segment and Geographic Information\nIn the advertising industry, companies commonly experience seasonal fluctuations in revenue. For example, many advertisers allocate the largest portion of their budgets to the fourth quarter of the calendar year in order to coincide with increased holiday purchasing. Historically, the fourth quarter of the year reflects our highest level of advertising activity and the first quarter reflects the lowest level of such activity. We expect our revenue to continue to fluctuate based on seasonal factors that affect the advertising industry as a whole.\nComponents of Our Results of Operations\nWe have one primary business activity and one operating segment.\nWe generate revenue from clients who enter into agreements with us to use our platform to purchase advertising inventory, value-added services and data. We charge our clients for total spend on our platform, which includes spend and fees on advertising inventory, value-added services and data to support those purchases, in addition to the platform fee that is generally based on a percentage of our clients’ total spend on the platform. Generally, we report revenue on a net basis, which represents gross billings net of amounts we pay suppliers for the cost of advertising inventory, supplier-provided components of value-added services and data (collectively, “Supplier Components”).\nAccounts receivable is recorded at the amount of gross billings to clients, net of allowances, for the amounts we are responsible to collect; and our accounts payable are recorded at the amount payable to suppliers. Accordingly, both accounts receivable and accounts payable appear large in relation to revenue reported on a net basis.\nRevenue as a percentage of gross spend may fluctuate due to the types of services rendered and client-selected features purchased through our platform and certain volume discounts. We expect that our revenue as a percentage of gross spend will fluctuate in the future, especially as we introduce new and enhanced platform features on our platform that are adopted by our clients, expand our omnichannel capabilities, extend our reach to more CTV and other inventory and add additional clients whose businesses may have different underlying business models.\n“Critical Accounting Policies and Estimates—Revenue Recognition”\nbelow for a description of our revenue recognition policies.\nWe classify our operating expenses into the following four categories and allocate overhead such as information technology infrastructure, rent, office support and occupancy charges based on headcount for these categories:\nPlatform Operations.\nPlatform operations expense consists of expenses related to hosting our platform, which includes “internet traffic” associated with the viewing of available impressions or queries per second (“QPS”), purchasing data used to inform and improve the platform and providing support to our clients. Platform operations expense includes hosting costs, personnel costs, data-related costs and amortization of capitalized software costs for platform development. Personnel costs include salaries, bonuses, stock-based compensation, employee benefit costs and travel for personnel who support our platform and provide our clients with platform support. We capitalize certain costs associated with the development of our platform, which are amortized in platform operations expense over their estimated useful lives.\nWe expect platform operations expenses to increase in absolute dollars in future periods as we continue to experience increased volumes of QPS through our platform, invest in our hosting capabilities and hire additional personnel to support our clients.\nSales and Marketing.\nSales and marketing expense consists primarily of personnel costs, including salaries, bonuses, stock-based compensation, employee benefits costs, commission costs and travel, for our sales and marketing\npersonnel. Sales and marketing expense also includes costs for market development programs, marketing events, advertising and promotional and other marketing activities. Commissions costs are expensed as incurred.\nOur sales organization focuses on marketing our platform to increase its adoption by existing and new clients. We are also focused on expanding our international business by growing our sales teams in countries in which we currently operate, as well as establishing a presence in additional countries. As a result, we expect sales and marketing expenses to increase in absolute dollars in future periods. Sales and marketing expense as a percentage of revenue may fluctuate from period to period based on revenue levels and the timing of our investments in our sales and marketing functions as these investments may vary in scope and scale over periods and are impacted by the revenue seasonality in our industry and business.\nTechnology and Development.\nTechnology and development expense consists primarily of personnel costs, including salaries, bonuses, stock-based compensation, employee benefits costs and travel as well as third-party consultant costs associated with the ongoing development of our platform and related offerings as well as integrations with our advertising inventory and data suppliers. Technology and development costs are expensed as incurred, except to the extent that such costs are associated with software development that qualifies for capitalization. We record capitalized software development costs related to platform development in other assets, non-current in our consolidated balance sheets, and we amortize those costs in platform operations expense.\nWe believe that continued investment in our platform is critical to attaining our strategic objectives ",
  "item2_clean": null
}