{
  "source_file": "ttwo-20250331.htm",
  "form_type": "10-K",
  "item1_clean": "Pull the Pin, Screw Jam\nIn October 2024, we sold our Private Division label, including our rights to substantially all of the label's titles. The label was dedicated to bringing titles from the industry's leading creative talent to market and was the publisher, developer, and owner of\nKerbal Space Program\nIntellectual Property\nOur business is highly dependent on the creation, acquisition, licensing, and protection of intellectual property. We believe that content ownership facilitates our internal product development efforts and maximizes profit potential. We attempt to protect our software and production techniques under copyright, patent, trademark, and trade secret laws as well as through contractual restrictions on disclosure, copying, and distribution.\nWe also enter into content license agreements, such as those with sports leagues, players associations, copyrighted fictional characters and entertainment brands, car manufacturers, music labels, and musicians. These licenses are typically limited to the use of the licensed rights in products for specific time periods. In addition, we license and include console\nmanufacturer technology in our products on a non-exclusive basis, which allows our games to be played on their respective hardware systems.\nPlatform manufacturers, such as Sony, Microsoft, and Nintendo, either manufacture or control the selection of approved manufacturers of physical copies of software products sold for use on their respective hardware platforms. We place a purchase order for the manufacture of our products with Sony, Nintendo, or Microsoft's approved replicator and then send software code to the manufacturer, together with related artwork, user instructions, warranty information, brochures and packaging designs for approval, defect testing and manufacture. Games are generally shipped within two to three weeks of receipt of our purchase order and all materials.\nOur software titles typically carry a 90-day limited warranty.\nArrangements with Platform Manufacturers\nWe have entered into license agreements with Sony and Microsoft to develop and publish software in Asia, Australia, Europe, North America, and certain Latin American, Middle Eastern, and African countries. We are not required to obtain any licenses from hardware manufacturers to develop titles for the PC.\nEffective March 23, 2017, we entered into a PlayStation Global Developer and Publisher Agreement with Sony Computer Entertainment, Inc. and certain of its affiliates, pursuant to which Sony granted us the right and license to develop, publish, have manufactured, market, advertise, distribute and sell PlayStation compatible products for all PlayStation systems. The agreement requires us to submit products to Sony for approval and for us to make royalty payments to Sony based on the number of units manufactured or revenue from digitally downloaded content. In addition, products for PlayStation systems are required to be manufactured by Sony-approved manufacturers. On September 30, 2020, we entered into a PlayStation 5 Amendment, with an effective date of May 1, 2020 (the “PS5 Amendment”), to our existing PlayStation Global Developer and Publisher Agreement. The PS5 Amendment amends the existing agreement to include the PlayStation 5 interactive entertainment system in the definition of systems in the agreement and to extend all of the terms and conditions of the existing agreement to our PlayStation 5 products and services.\nThe term of the agreement, as amended, expires on March 31, 2026, with automatic one-year renewal terms thereafter (unless one party gives the other notice of termination). Sony may terminate the agreement for any or no reason upon 30 days’ notice. The agreement may also be terminated by Sony immediately in the event of a breach by us or our bankruptcy or insolvency. Upon expiration or termination of the agreement, we have certain rights to sell off existing inventories.\nUnder the terms of the license agreements that we have entered into with Microsoft Corporation and its affiliates, Microsoft granted us the right and license to develop, publish, have manufactured, market, advertise, distribute and sell Xbox compatible products. The agreements require us to submit products to Microsoft for approval and to make royalty payments to Microsoft based on the number of units manufactured or revenue from digitally downloaded content. In addition, products for the Xbox consoles are required to be manufactured by Microsoft-approved manufacturers.\nEffective as of November 17, 2005, we entered into an Xbox 360 Publisher License Agreement with Microsoft for the Xbox 360 console (the “Xbox 360 Agreement”). Effective as of July 1, 2020, we entered into an Xbox Console Publisher License Agreement with Microsoft for the Xbox Series X|S and Xbox One consoles (the “Xbox Next Gen Agreement” and, together with Xbox 360 Agreement, the “Xbox Agreements”). The terms of both Xbox Agreements expire on March 31, 2026, each with automatic one-year renewal terms thereafter (unless one party gives the other advance notice of non-renewal). These Xbox Agreements may be terminated by Microsoft immediately in the event of a breach by us, and the Xbox Next Gen Agreement may also be terminated by Microsoft immediately in the event of our bankruptcy or insolvency. Upon expiration or termination of each of the Xbox Agreements, we have certain rights to sell off existing inventories.\nWe sell software titles both digitally and physically through direct relationships with digital storefronts and platform partners, large retail customers, and third-party distributors. We sell our products globally and have sales operations in Australia, Canada, France, Germany, Japan, Singapore, South Korea, Taiwan, the U.K., and the U.S. We manage a direct-to-consumer platform, primarily for our mobile business, to drive purchases directly with our consumer base. By leveraging our direct-to-consumer platform, we are able to build closer relationships with our players, understand their behaviors and preferences more accurately, and provide value with various offers and event types.\nWe are dependent on a limited number of customers that account for a significant portion of our sales. Sales to our five largest customers during the fiscal year ended March 31, 2025, accounted for 81.0% of our net revenue, with Apple, Sony, Google, and Microsoft each accounting for more than 10.0% of our net revenue.\nWe distribute our titles, add-on content, and in-game purchases through direct digital download to consoles, PCs, and mobile devices. We view digital distribution as the principal channel for our industry and Company; however, we expect that packaged goods and traditional retailers will continue to be an important channel for the sale of our console products for the foreseeable future, particularly in connection with the release of certain titles for consoles or certain regions where digital distribution is not as well established.\nWe also sell advertising within a number of our games, primarily in mobile. Our advertising offerings provide creative ways for marketers and advertisers to reach and engage with our players and are generally essential for our free-to-play titles. Our advertising offerings include banner and interstitial advertisements, engagement advertisements and offers in which players can participate in watch-to-earn engagements or other offer engagements, branded virtual items, and sponsorships that integrate relevant advertising and messaging within game play.\nOur marketing and promotional efforts are intended to acquire new users, maximize consumer interest in our titles, promote brand name recognition of our franchises, assist retailers and to properly position, package and merchandise our titles. Marketing is particularly important for our mobile titles to build a large community of players. From time to time, we also receive marketing support from hardware manufacturers in connection with their own promotional efforts.\nWe market titles by:\nImplementing public relations campaigns, using social, digital, online, television, outdoor, and print marketing, including certain performance marketing programs. We aim to label and market our products in accordance with the applicable principles and guidelines of the Entertainment Software Rating Board, (\"ESRB\"), an independent self-regulatory body that assigns ratings and enforces advertising guidelines for the interactive software industry in the U.S. In addition, we work with similar global agencies, including the Pan-European Game Information, which is used throughout most of Europe in more than 35 countries, and the International Age Rating Coalition (\"IARC\"), a rating and age classification system for digitally delivered games and apps that reflects the unique cultural differences among nations and regions.\nStimulating continued sales by reducing the wholesale prices of our products to retailers, digital storefronts, and platform providers at various times during the life of a product. Price protection may occur at any time in a product's life cycle but typically occurs three to nine months after a product's initial launch. In certain international markets, we also provide volume rebates to stimulate continued product sales.\nEmploying various other marketing methods designed to promote consumer awareness, including social media, in-store promotions and point-of-purchase displays, direct mail, cooperative advertising, attendance at trade shows as well as product sampling through demonstration software distributed via the Internet or the digital online services.\nWe have been able to build a large community of players, particularly for mobile titles, through players discovering of our games in platform storefronts, the viral and social features built into the network effects of our games, as well as the cross-promotion of our games to our existing audience. However, we also acquire our players through paid advertising channels. We advertise our mobile games primarily within other mobile applications and on social networks, often through in-app and other advertising partners such as Facebook and Google.\nAs of March 31, 2025, we had a sales and marketing staff of 1,418 full-time employees.\nCompetition in the interactive entertainment industry is based on innovation, features, playability, product quality, brand name recognition, compatibility with popular platforms, access to distribution channels, price, marketing, and customer service. Our business is driven by hit titles, which require increasing budgets for development and marketing. Competition for our titles is influenced by the timing of competitive product releases and the similarity of such products to our titles.\nIn our business, we compete with:\nOther interactive entertainment companies that range in size and cost structure from very small with limited resources to very large with greater financial, marketing, technical, and other resources than ours. Examples of our competitors include Electronic Arts Inc., Embracer Group AB, Playrix, Playtika, Roblox, Savvy Games, Tencent, and Ubisoft Entertainment S.A. We also expect new competitors to enter the market and existing competitors to allocate more resources to develop and market competing games and applications.\nSony, Microsoft, and Nintendo for the sale of interactive entertainment software. Each of these competitors is a large developer and marketer of software for their own platforms and has the financial resources to withstand significant price competition and to implement extensive advertising campaigns.\nOther software, hardware, entertainment, and media for limited retail shelf space and promotional resources. The competition for shelf space, whether physical or virtual, and promotional support is intense among an increasing number of newly introduced entertainment software titles and hardware.\nOther forms of entertainment such as motion pictures, televis",
  "item7_clean": "Item 7. Management's Discussion and Analysis of Financial Condition and Results of Operations\nWe are a leading developer, publisher, and marketer of interactive entertainment for consumers around the globe. We develop, operate, and publish products principally through Rockstar Games, 2K, and Zynga. Our products are currently designed for console gaming systems, mobile, including smartphones and tablets, and PC. We deliver our products through physical retail, digital download, online platforms, and cloud streaming services. Refer to\nfor additional discussion.\nDuring the fiscal year ended March 31, 2025, we recognized Goodwill impairment charges of $3,545.2, representing a partial impairment related to one of our reporting units, and we recognized impairment charges of $137.0 for acquisition-related Developed Game Technology intangible assets within Cost of revenue and $39.3 for acquisition-related Branding and Trade Names intangible assets within Depreciation and amortization. The impairment charges are a result of a reduction in the forecasted performance of certain games due to industry conditions and changes in our strategies in response to those conditions. Key assumptions and estimates used in deriving the fair values of these assets are forecasted revenue, EBITDA margins, long-term decay rate, and discount rate (refer to\nNote 9 - Goodwill and Intangible Assets, Net\n). Future changes in those key assumptions and estimates could result in additional impairments.\nDuring the fiscal year ended March 31, 2025, we also recognized impairment charges related to our Software development costs and licenses of $77.5, of which $35.1 related to title cancellations as part of our cost reduction program (refer to\nNote 7 - Software Development Costs and Licenses\nNote 21 - Business Reorganization)\nTrends and Factors Affecting our Business\nProduct Release Schedule.\nOur financial results are affected by the timing of our product releases and the commercial success of our titles. Generally, a significant portion of our revenue has been derived from a few popular franchises, particularly around new releases within those franchises, some of which have annual or biennial releases. Additionally, our\nproducts in particular have historically accounted for a significant portion of our revenue. Sales of\nproducts generated 12.6% of our net revenue for the fiscal year ended March 31, 2025. The timing of our\nproduct releases may affect our financial performance on a quarterly and annual basis.\nEconomic Environment and Retailer Performance.\nWe continue to monitor various macroeconomic and geopolitical factors, such as global tariff policy, that may affect our business in several areas, including consumer demand, inflation, pricing pressure on our products, credit quality of our receivables, and foreign currency exchange rates. Actions we have taken to date and other potential actions we may take in the future in response to these factors could result in negative impacts in future periods.\nThe economic environment has affected our customers in the past and may do so in the future. There has been increased consolidation in our industry, as larger, better capitalized competitors will be in a stronger position to withstand prolonged periods of economic downturn and sustain their business through the financial volatility. Also, bankruptcies or consolidations of our large retail customers could seriously hurt our business, due to uncollectible accounts receivable and the concentration of purchasing power among the remaining large retailers.\nWe derive a substantial portion of our revenue from the sale of products made for video game consoles manufactured by third parties. Such console revenue comprised 37.3% of our net revenue by product platform for the fiscal year ended March 31, 2025. The success of our business is dependent upon consumer acceptance of these platforms and\nthe continued growth in the installed base of these platforms, which could be impacted by global economic factors, including global tariff policy. When new hardware platforms are introduced, demand for interactive entertainment developed for older platforms typically declines, which may negatively affect our business during the market transition to the new consoles. The latest Sony and Microsoft consoles provide \"backwards compatibility\" (i.e., the ability to play games for the previous generation of consoles). The inclusion of such features on new consoles could mitigate the risk of such a decline. However, we cannot be certain how backwards compatibility will affect demand for our products. Further, events beyond our control may impact the availability of these new consoles, which may also affect demand. We manage our product delivery on each current and future platform in a manner we believe to be most effective to maximize our revenue opportunities and achieve the desired return on our investments in product development. Accordingly, our strategy for these platforms is to focus our development efforts on a select number of the highest quality titles.\nOnline Content and Digital Distribution.\nWe provide a variety of online delivered products, including direct digital downloads of our titles, and access to additional offerings through virtual currency, add-on content, in-game purchases, and in-game advertising, which drive ongoing engagement and incremental revenue from recurrent consumer spending on our titles. Net revenue from digital online channels comprised 96.4% of our net revenue for the fiscal year ended March 31, 2025. We expect online delivery of games and game offerings to continue to be the primary part of our business over the long term.\nA significant portion of our mobile titles are distributed, marketed, and promoted through third parties, primarily Apple’s App Store and the Google Play Store. Virtual items for our mobile games are purchased principally through the payment processing systems of these platform providers, as well as our direct-to-consumer commerce platform. We generate a significant portion of our net revenue through the Apple and Google platforms and expect to continue to do so for the foreseeable future. Apple and Google generally have the discretion to set the amounts of their platform fees and change their platforms’ terms of service and other policies with respect to us or other developers at their sole discretion, and those changes may be unfavorable to us. These platform fees are recorded as cost of revenue as incurred. Further, as a result of the platform fees associated with online game sales, our mobile net revenue generally generates a lower gross margin percentage than our Console or PC revenue. Accordingly, the overall product mix between mobile and other game sales may affect our gross margin percentage. We are also continuing to expand our direct-to-consumer efforts more meaningfully across our mobile portfolio to enhance profitability.\nPlayer acquisition costs.\nPrincipally for our mobile titles, we use advertising and other forms of player acquisition and retention to grow and retain our player audience. These expenditures, which are recorded within Sales and marketing in our Consolidated Statements of Operations, generally relate to the promotion of new game launches and ongoing performance-based programs to drive new player acquisition and lapsed player reactivation. Over time, the effectiveness or cost of these acquisition and retention-related programs may change, affecting our operating results.\nContent Release Highlights\nDuring fiscal year 2025, 2K released\nNBA 2K25\nSid Meier's Civilization VII\nPGA TOUR 2K25\nWWE 2K25\n, and Zynga released\nGame of Thrones: Legends\n. Rockstar plans to release\nFiscal 2025 Financial Summary\nOur net revenue for the fiscal year ended March 31, 2025 was led by a variety of our top franchises, primarily\nNBA 2K, Grand Theft Auto\nWWE 2K\nSid Meier's Civilization,\nas well as top contributors\n, our hyper-casual mobile portfolio,\nOur net revenue for the fiscal year ended March 31, 2025 was $5,633.6, an increase of $284.0 or 5.3% compared to the fiscal year ended March 31, 2024.\nOur operating loss for the fiscal year ended March 31, 2025 was $4,391.1 compared to operating loss of $3,590.6 for fiscal year ended March 31, 2024, primarily due to an increase in Goodwill impairment charges of $1,203.1 related to an additional partial impairment related to one of our reporting units. For the fiscal year ended March 31, 2025, our net loss was $4,478.9, as compared to net loss of $3,744.2 in the prior year. Diluted loss per share for the fiscal year ended March 31, 2025 was $25.58, as compared to Diluted loss per share of $22.01 for the fiscal year ended March 31, 2024.\nAt March 31, 2025, we had $1,559.2 of Cash, cash equivalents, and restricted cash and cash equivalents, compared to $1,102.0 at March 31, 2024. The increase was primarily due to Net cash provided by financing activities, primarily related to proceeds from the issuance of our 2029 Notes and 2034 Notes (refer to\n) and the issuance of common stock. This increase was partially offset by (i) Net cash used in investing activities, which was primarily due to the purchase of fixed assets and (ii) Net cash used in operating activities, which was primarily due to investments in software development and licenses, partially offset by sales of our products.\nOn June 11, 2024, we completed the purchase of 100%\nof the issued and outstanding capital stock of The Gearbox Entertainment Company, Inc. (\"Gearbox\"), from Embracer Group AB, for an initial consideration of\n2.8 shares of our common stock (refer to\nNote 20 - Acquisitions\nCritical Accounting Policies and Estimates\nOur most critical accounting policies, which are those that require significant judgment, include revenue recognition, capitalization and recognition of software development costs and licenses, fair value estimates including valuation of goodwill and intangible assets, valuation and recognition of stock-based compensation, and income taxes. See\nNote 1 - Basis of Presentation and Significant Accounting Policies\nRecently Adopted and Recently Issued Accounting Pronouncements\nNote 1 - Basis of Presentation and Significant Accounting Policies\nWe monitor Net Bookings as a key operating metric in evaluating the performance of our business. Net Bookings is defined as the net amount of products and services sold digitally or sold-in physically during the period and includes licensing fees, merchandise, in-game advertising, strategy guides, and publisher incentives. Net Bookings were as follows:\nFiscal Year Ended March 31,\nIncrease/(decrease) %\n\nForeign currency exchange rates decreased total operating expenses by $6.8 for the fiscal year ended March 31, 2025 as compared to the prior year.\nSelling and marketing\nSelling and marketing expenses increased by $133.5 for the fiscal year ended March 31, 2025 as compared to the prior year period, primarily due to (i) higher overall marketing expenses for\nGame of Thrones: Legends\nSid Meier's Civilization\nfranchise, partially offset by lower marketing expenses for our hyper-casual mobile portfolio, and (ii) lower amortization related to our intangible assets.\nResearch and development\nResearch and development expenses increased by $57.0 for the fiscal year ended March 31, 2025, as compared to the prior year period, primarily due to increases in (i) personnel expenses due to increased headcount and (ii) production and development expenses for titles that are not technologically feasible, partially offset by the timing of tax related credits for certain titles.\nGeneral and administrative\nGeneral and administrative expenses increased by $167.2 for the fiscal year ended March 31, 2025, as compared to the prior year period, primarily due to increases in (i) transaction costs related to our acquisition of Gearbox (refer to\n), (ii) personnel expenses due to increased headcount, (iii) legal fees and contingencies related to the IBM case against Zynga, (iv) IT-related expenses for cloud-based services and IT infrastructure, as well as, (v) a reduction of expense in the prior year related to updating the fair value of contingent earn-out liability for our acquisition of Popcore with no corresponding reduction in the current year.\nGeneral and administrative expenses for the fiscal years ended March 31, 2025 and 2024 include occupancy expense (primarily rent, utilities and office expenses) of $73.9 and $69.9, respectively, related to our development studios.\nDepreciation and amortization\nDepreciation and amortization expenses increased by $58.2 for the fiscal year ended March 31, 2025, as compared to the prior year period, primarily due to increases in (i) impairment expense related to our intangible assets (refer to\nNote 9 - Goodwill and Intangible Assets, Net\n), (ii) IT infrastructure expense, and (iii) leasehold improvements for office buildouts.\nGoodwill impairment expense for the fiscal years ended March 31, 2025 and 2024, were $3,545.2 and $2,342.1, respectively, due to partial impairments recognized related to one of our reporting units (refer to\nNote 9 - Goodwill and Intangible Assets, Net\nBusiness reorganization\nBusiness reorganization expense increased by $1.9 for the fiscal year ended March 31, 2025, as compared to the prior year period, primarily due to an increase in employee-related costs and losses on our divestitures, partially offset by a decrease in expense due to cancellations of our titles (refer to\n- Business Reorganization\nInterest and other, net\n% Increase/(decrease)\n\nFor the fiscal year ended March 31, 2025, Net Bookings increased by $315.0 as compared to the prior year. The increase was primarily due to an increase in Net Bookings from\nSid Meier's Civilization\nfranchise, the latest installment of which,\n, released in February 2025;\nNBA 2K\n, which released in April 2024. These increases were partially offset by a decrease in Net Bookings from\nfranchise, our hyper- and hybrid-casual mobile portfolio, and\n, which released in May 2023.\nResults of Operations\nIn this section, we discuss the results of our operations for the fiscal year ended March 31, 2025 compared to the fiscal year ended March 31, 2024. For the comparison of fiscal year 2024 to fiscal year 2023, refer to\nPart II, Item 7 “Management’s Discussion and Analysis of\nThe following table sets forth, for the periods indicated, our statements of operations, net revenue by content type, net revenue by platform, and net revenue by distribution channel:\n\nInterest and other, net\nInterest and other, net was expense of $93.3 for the fiscal year ended March 31, 2025, as compared to $103.6 for the fiscal year ended March 31, 2024. The net decrease in expense was primarily due to an increase in interest income primarily due to increases in interest rates and cash balances and a gain on the sale of an investment. These decreases in net expense were partially offset by increases in foreign currency losses, interest expense related to our debt transactions (refer to\n) and a gain on debt extinguishment recognized in the prior year on the partial repayment of our 2024 Notes.\nLoss on fair value adjustments, net\nLoss on fair value adjustments, net for the fiscal year ended March 31, 2025 was a loss of $6.9 compared to a loss of $8.6 in the prior year period. The change was primarily due to changes in fair value based on observable price changes of our long-term investments and an increase in fair value of our Convertible Notes.\nBenefit from income taxes\nOur income tax benefit was $12.4 for the fiscal year ended March 31, 2025 as compared to a provision for income taxes of $41.4 for the fiscal year ended March 31, 2024.\nWhen compared to the statutory rate of 21%, the effective tax rate of 0.3% for the fiscal year ended March 31, 2025 was primarily due to an expense of $718.0 from nondeductible goodwill impairments, $222.7 from an increase in the U.S. valuation allowance expense, $25.5 from an increa",
  "item2_clean": null
}