{
  "source_file": "ttwo-20250930.htm",
  "form_type": "10-Q",
  "item1_clean": null,
  "item7_clean": null,
  "item2_clean": "At September 30, 2025, we had $1,961.0 of cash and cash equivalents and restricted cash and cash equivalents, compared to $1,559.2 at March 31, 2025. The increase was primarily due to Net cash provided by financing activities, primarily related to proceeds from our equity issuance of our common stock (refer to\nNote 10 - Loss Per Share\n), partially offset by the repayment of our 2025 Notes (refer to\n). The increase was also due to Net cash provided by operating activities, which was primarily due to sales of our products, partially offset by investments in software development and licenses. This net increase was partially offset by the decrease in Net cash used in investing activities, which was primarily due to the purchase of short-term investments and fixed assets.\nNote 11 - Commitments and Contingencies\nfor disclosures regarding our commitments.\nCapital Expenditures\nIn fiscal year 2026, we anticipate capital expenditures to be approximately $180.0. During the six months ended September 30, 2025, capital expenditures were $57.0.\nInternational Operations\nNet revenue earned outside of the United States is principally generated by our operations in Europe, Asia, Australia, Canada, and Latin America. For the three months ended September 30, 2025 and 2024, 41.6% and 39.8%, respectively, of our net revenue was earned outside the U.S. We are subject to risks inherent in foreign trade, including increased credit risks, tariffs and duties, fluctuations in foreign currency exchange rates, shipping delays and international political, regulatory and economic developments, all of which can have a significant effect on our operating results.\nFluctuations in Quarterly Operating Results and Seasonality\nWe have experienced fluctuations in quarterly and annual operating results as a result of the timing of the introduction of new titles, variations in sales of titles developed for particular platforms, market acceptance of our titles, development and promotional expenses relating to the introduction of new titles, sequels or enhancements of existing titles, projected and actual changes in platforms, the timing and success of title introductions by our competitors, product returns, changes in pricing policies by us and our competitors, the accuracy of retailers' forecasts of consumer demand, the size and timing of acquisitions, the timing of orders from major customers, and order cancellations and delays in product shipment. Sales of our full game products are also seasonal, with peak demand typically occurring in the fourth calendar quarter during the holiday season. For certain of our software products with multiple performance obligations, we defer the recognition of our net revenue over an estimated service period which generally ranges from six to fifteen months. As a result, the quarter in which we generate the highest Net Bookings may be different from the quarter in which we recognize the highest amount of Net revenue. Quarterly comparisons of operating results are not necessarily indicative of future operating results.\n\nNBA 2K26\nWe have announced that, during the remainder of fiscal year 2026, 2K plans to release\nWWE 2K26.\nEconomic Environment and Retailer Performance.\nWe continue to monitor various macroeconomic and geopolitical factors, such as global tariff policies, that may affect our business in several areas, including consumer demand, inflation, pricing pressure on our products and third party hardware platforms, credit quality of our receivables, and foreign currency exchange rates. Actions we have taken to date and other potential actions we may take in the future in response to these factors could result in negative impacts in future periods.\nThe economic environment has affected our customers in the past and may do so in the future. There has been increased consolidation in our industry, which is extremely competitive, and larger, better capitalized competitors will be in a stronger position to withstand prolonged periods of economic downturn and sustain their business through periods of financial\nvolatility. Also, bankruptcies or consolidations of our large retail customers could hurt our business, due to uncollectible accounts receivable and the concentration of purchasing power among the remaining large retailers.\nWe derive a substantial portion of our revenue from the sale of products made for video game consoles manufactured by third parties. Such console revenue comprised 38.8% of our net revenue for the six months ended September 30, 2025. The success of our business is dependent upon consumer acceptance of these platforms and the continued growth in the installed base of these platforms, which could be impacted by global economic factors, including global tariff policies. When new hardware platforms are introduced, demand for interactive entertainment developed for older platforms typically declines, which may negatively affect our business during the market transition to the new consoles. The latest Sony and Microsoft consoles provide \"backwards compatibility\" (i.e., the ability to play games for the previous generation of consoles). The inclusion of such features on new consoles could mitigate the risk of such a decline. However, we cannot be certain how backwards compatibility will affect demand for our products. Further, events beyond our control may impact the availability of these new consoles, which may also affect demand for our products. We manage our product delivery on each current and future platform in a manner we believe to be most effective to maximize our revenue opportunities and achieve the desired return on our investments in product development. Accordingly, our strategy for these platforms is to focus our development efforts on a select number of the highest quality titles.\nOnline Content and Digital Distribution.\nWe provide a variety of online delivered products, including direct digital downloads of our titles, and access to additional offerings through virtual currency, add-on content, in-game purchases, and in-game advertising, which drive ongoing engagement and incremental revenue from recurrent consumer spending on our titles. Net revenue from digital online channels comprised 96.7% of our net revenue for the six months ended September 30, 2025. We expect online delivery of games and game offerings to continue to be the primary part of our business over the long term.\nA significant portion of our mobile titles are distributed, marketed, and promoted through third parties, primarily Apple’s App Store and the Google Play Store. Virtual items for our mobile games are purchased principally through the payment processing systems of these platform providers, as well as our direct-to-consumer commerce platform. We generate a significant portion of our net revenue through the Apple and Google platforms and expect to continue to do so for the foreseeable future. Apple and Google generally have the discretion to set the amounts of their platform fees and change their platforms’ terms of service and other policies with respect to us or other developers at their sole discretion, and those changes may be unfavorable to us. These platform fees are recorded as cost of revenue as incurred. Further, as a result of the platform fees associated with online game sales, our mobile net revenue generally generates a lower gross margin percentage than our Console or PC revenue. Accordingly, the overall product mix between mobile and other game sales may affect our gross margin percentage. We are also continuing to expand our direct-to-consumer efforts more meaningfully across our mobile portfolio to enhance profitability.\nPlayer acquisition costs.\nPrincipally for our mobile titles, we use advertising and other forms of player acquisition and retention to grow and retain our player audience. These expenditures, which are recorded within Selling and marketing in our Condensed Consolidated Statements of Operations, generally relate to the promotion of new game launches and ongoing performance-based programs to drive new player acquisition and lapsed player reactivation. Over time, the effectiveness or cost of these acquisition and retention-related programs may change, affecting our operating results.\nCritical Accounting Policies and Estimates\nOur most critical accounting policies, which are those that require significant judgment, include revenue recognition, capitalization and recognition of software development costs and licenses, fair value estimates including valuation of goodwill and intangible assets, valuation and recognition of stock-based compensation, and income taxes. In-depth descriptions of our other critical accounting policies and estimates can be found in our\nfor the fiscal year ended March 31, 2025.\nRecently Adopted and Recently Issued Accounting Pronouncements\nNote 1 - Basis of Presentation and Significant Accounting Policies\nfor further discussion.\nWe monitor Net Bookings as a key operating metric in evaluating the performance of our business. Net Bookings is defined as the net amount of products and services sold digitally or sold-in physically during the period and includes licensing fees, merchandise, in-game advertising, and publisher incentives. Net Bookings were as follows:\nThree Months Ended September 30,\nSix Months Ended September 30,\n\nChanges in foreign currency exchange rates increased total operating expenses by $12.1 for the six months ended September 30, 2025, as compared to the prior year period.\nSelling and marketing\nSelling and marketing expenses increased by $52.7 for the six months ended September 30, 2025, as compared to the prior year period, primarily driven by (i) higher personnel expense due to higher performance-based compensation and (ii) higher overall marketing expense for\nfranchise, partially offset by lower overall marketing expenses for\nGame of Thrones: Legends\nResearch and development\nResearch and development expenses increased by $62.9 for the si"
}