{
  "source_file": "txn-20241231.htm",
  "form_type": "10-K",
  "item1_clean": "We design and manufacture semiconductors that we sell to electronics designers and manufacturers all over the world. Our operations began in 1930, and we are incorporated in Delaware. With headquarters in Dallas, Texas, we have design, manufacturing or sales operations in more than 30 countries. Our two reportable segments are Analog and Embedded Processing, and we report the results of our remaining business activities in Other. In 2024, we generated $15.64 billion of revenue.\nFor decades, we have operated with a passion to create a better world by making electronics more affordable through semiconductors. We were pioneers in the transition from vacuum tubes to transistors and then to integrated circuits. As each generation has become more reliable, more affordable and lower in power, semiconductors are used by a growing number of customers and markets. Our passion continues to be alive today as we help our customers develop electronics and new applications.\nFor many years, we have run our business with three overarching ambitions in mind. First, we will act like owners who will own the company for decades. Second, we will adapt and succeed in a world that is ever changing. And third, we will be a company that we are personally proud to be a part of and that we would want as our neighbor. Our ambitions are foundational to ensuring that we operate in a sustainable and environmentally responsible manner. When we are successful in achieving these ambitions, our employees, customers, communities and shareholders all win.\nAs engineers, we are fortunate to work on exciting technology which helps our customers innovate to create a better world. Technology is the foundation of our company, but ultimately, our objective and the best metric for owners to measure our progress is through the growth of free cash flow per share over the long term.\nOur strategy to maximize long-term free cash flow per share growth has three elements:\nThe first element of our strategy is a business model that is focused on analog and embedded processing products and built around four competitive advantages. This business model is the result of a series of strategic decisions made over the years and that continue today. The four sustainable competitive advantages are a strong foundation of manufacturing and technology, a broad portfolio of analog and embedded processing products, the reach of our market channels, and diversity and longevity of our products, markets and customer positions. In combination, these four competitive advantages provide tangible benefits, are difficult to replicate and ultimately separate us from our best peers. Together, these competitive advantages help position TI in a unique class of companies capable of generating and returning significant amounts of cash for our owners. We make our investments with an eye towards long-term strengthening and leveraging of these advantages.\nThe second element of our strategy to maximize free cash flow per share growth is disciplined allocation of capital. This spans how we select R&D projects, develop new capabilities, invest in manufacturing capacity or how we think about acquisitions and returning cash to our owners. Over a 10-year period from 2015 to 2024, we allocated $101 billion, which reinforces the importance of discipline in capital allocation. The largest allocation over this period was to drive organic growth, which includes investments in R&D, sales and marketing, capital expenditures and working capital for inventory. In this period, we allocated about $20 billion to capital expenditures. Our increased capital expenditures are to support future revenue growth, which will be a greater component of free cash flow per share growth going forward. Beyond that, we also allocated capital to dividends and share repurchases. Dividends are designed to appeal to a broad set of investors, and share repurchases are made with the goal of the accretive capture of future free cash flow for long-term investors. Lastly, for inorganic growth, we allocate to acquisitions that meet our financial and strategic objectives.\nThe third element of our strategy is efficiency, which we think of as constantly striving for more output for every dollar spent. This is about getting our investments in the most impactful areas to maximize the growth of long-term free cash flow per share; it is not just about optimizing cost cutting to get to the last dollar of expense. We bring this philosophy of efficiency and continuous improvement to all areas of the company, and this focus on efficiency contributes to revenue growth, improved gross margins, disciplined R&D and SG&A expense, free cash flow margins and ultimately to free cash flow per share growth.\nWe believe that our business model with the combined effect of our four competitive advantages sets TI apart from our peers and will for a long time to come. We will invest to strengthen our competitive advantages, be disciplined in capital allocation and stay diligent in our pursuit of efficiencies. Finally, we will remain focused on the belief that long-term growth of free cash flow per share is the ultimate measure to generate value.\nSemiconductors are electronic components that serve as the building blocks inside modern electronic systems and equipment. Semiconductors, generally known as “chips,” combine multiple transistors to form a complete electronic circuit. We have a diverse product portfolio that is used to accomplish many different things, such as converting and amplifying signals, interfacing with other devices, managing and distributing power, processing data, canceling noise and improving signal resolution. This broad portfolio includes more than 80,000 products that are integral to almost every type of electronic equipment.\nOur segments represent groups of products that have similar design and development requirements, product characteristics and manufacturing processes. Our segments also reflect how management allocates resources and measures results.\nOur Analog segment generated $12.16 billion of revenue in 2024. Analog semiconductors change real-world signals, such as sound, temperature, pressure or images, by conditioning them, amplifying them and often converting them to a stream of digital data that can be processed by other semiconductors, such as embedded processors. Analog semiconductors are also used to manage power in all electronic equipment by converting, distributing, storing, discharging, isolating and measuring electrical energy, whether the equipment is plugged into a wall or using a battery. As the digitization of electronics continues, there is a growing need and opportunity for analog chips to provide the power to run devices and the critical interfaces with human beings, the real world and other electronic devices. Our Analog products are used in many markets, particularly industrial, automotive and personal electronics.\nSales of our Analog products generated about 78% of our revenue in 2024.\nOur Analog segment includes the following major product lines: Power and Signal Chain.\nPower includes products that help customers manage power in electronic systems. Our broad portfolio is designed to manage power requirements across different voltage levels, including battery-management solutions, DC/DC switching regulators, AC/DC and isolated DC/DC switching regulators, power switches, linear and low-dropout regulators, voltage references, multiphase controllers and power stages, and lighting products.\nSignal Chain includes products that sense, condition and measure real-world signals to allow information to be transferred or converted for further processing and control. Our Signal Chain products include amplifiers, data converters, interface products, motor drives, clocks, logic and sensing products.\nOur Embedded Processing segment generated $2.53 billion of revenue in 2024. Embedded Processing products are the digital “brains” of many types of electronic equipment. They are designed to handle specific tasks and can be optimized for various combinations of performance, power and cost, depending on the application. Our devices vary from simple, low-cost microcontrollers used in applications such as electric toothbrushes to highly specialized, complex devices such as motor control. Our Embedded Processing products are used in many markets, particularly industrial and automotive.\nAn important characteristic of our Embedded Processing products is that our customers often invest their own R&D to write software that operates on our products. This investment tends to increase the length of our customer relationships because many customers prefer to reuse software from one product generation to the next.\nSales of Embedded Processing products generated about 16% of our revenue in 2024.\nOur Embedded Processing segment includes microcontrollers, processors, wireless connectivity and radar products. Microcontrollers are self-contained systems with a processor core, memory and peripherals that are designed to control a set of specific tasks for electronic equipment and often integrate analog functionality. Our processors are designed for specific computing activity in embedded applications.\nWe report the results of our remaining business activities in Other, which includes operating segments that do not meet the quantitative thresholds for individually reportable segments and cannot be aggregated with other operating segments. Other generated $947 million of revenue in 2024 and includes revenue from DLP\nproducts (primarily used to project high-definition images), calculators and certain custom semiconductors known as application-specific integrated circuits (ASICs).\nIn Other, we also include items that are not used in evaluating the results of or in allocating resources to our segments. Examples of these items include acquisition, integration and restructuring charges, as well as certain corporate-level items, such as litigation expenses, environmental costs and gains and losses from other activities, including asset dispositions.\nMarkets for our products\nThe table below lists the major markets for our products in 2024 and the estimated percentage of our 2024 revenue that the market represented. The chart also lists, in declining order of our revenue, the sectors within each market.\nIndustrial automation\nMedical & healthcare\nEnergy infrastructure\nOther industrial equipment\nInfotainment & cluster\nAdvanced driver assistance systems (ADAS)\nHybrid, electric & powertrain systems\nBody electronics & lighting\nPersonal electronics\nPortable electronics\nConnected peripherals & printers\nHome theater & entertainment\nTV\nWearables (non-medical)\nData center & enterprise computing\nEnterprise projectors\nCommunications equipment\nWireless infrastructure\nBroadband fixed line access\nOther (calculators and other)\nMarket characteristics\nCompetitive landscape\nDespite consolidation, the analog and embedded processing markets remain highly fragmented. As a result, we face significant global competition from dozens of large and small companies, including both broad-based suppliers and niche suppliers. Our competitors also include emerging companies, particularly in Asia.\nWe believe that competitive performance in the semiconductor market generally depends on several factors, including the breadth of a company’s product line, the strength and reach of its channels to market, technological innovation, product development execution, technical support, customer service, quality, reliability, price and manufacturing capacity and capabilities. In addition, manufacturing process and package technologies that provide differentiated levels of performance and a structural cost advantage are competitive factors for our analog products, and customers’ prior investments in software development is a competitive factor for our embedded processing products.\nThe “semiconductor cycle” refers to the ebb and flow of supply and demand and the buil",
  "item7_clean": "ITEM 7. Management’s discussion and analysis of financial condition and results of operations\nWe design and manufacture semiconductors that we sell to electronics designers and manufacturers all over the world. Technology is the foundation of our company, but ultimately, our objective and the best metric for owners to measure our progress is through the growth of free cash flow per share over the long term.\nOur strategy to maximize long-term free cash flow per share growth has three elements:\nA great business model that is focused on analog and embedded processing products and built around four sustainable competitive advantages. The four sustainable competitive advantages are powerful in combination and provide tangible benefits:\n(a) A strong foundation of manufacturing and technology that provides lower costs and greater control of our supply chain.\n(b) A broad portfolio of analog and embedded processing products that offers more opportunity per customer and more value for our investments.\n(c) The reach of our market channels that gives access to more customers and more of their design projects, leading to the opportunity to sell more of our products into each design and gives us better insight and knowledge of customer needs.\n(d) Diversity and longevity of our products, markets and customer positions that provide less single point dependency and longer returns on our investments.\nTogether, these competitive advantages help position TI in a unique class of companies capable of generating and returning significant amounts of cash for our owners. We make our investments with an eye towards long-term strengthening and leveraging of these advantages.\nDiscipline in allocating capital to the best opportunities. This spans how we select R&D projects, develop new capabilities, invest in manufacturing capacity or how we think about acquisitions and returning cash to our owners.\nEfficiency, which means constantly striving for more output for every dollar spent.\nWe believe that our business model with the combined effect of our four competitive advantages sets TI apart from our peers and will for a long time to come. We will invest to strengthen our competitive advantages, be disciplined in capital allocation and stay diligent in our pursuit of efficiencies. Finally, we will remain focused on the belief that long-term growth of free cash flow per share is the ultimate measure to generate value.\nManagement’s discussion and analysis of financial condition and results of operations (MD&A) should be read in conjunction with the financial statements and the related notes that appear elsewhere in this document. In the following discussion of our results of operations:\nOur segments represent groups of similar products that are combined on the basis of similar design and development requirements, product characteristics, manufacturing processes and distribution channels, and how management allocates resources and measures results. See Note 1 to the financial statements for more information regarding our segments.\nWhen we discuss our results:\nUnless otherwise noted, changes in our revenue are attributable to changes in customer demand, which are evidenced by fluctuations in shipment volumes.\nNew products do not tend to have a significant impact on our revenue in any given period because we sell such a large number of products.\nFrom time to time, our revenue and gross profit are affected by changes in demand for higher-priced or lower-priced products, which we refer to as changes in the “mix” of products shipped.\nBecause we own much of our manufacturing capacity, a significant portion of our operating cost is fixed. When factory loadings decrease, our fixed costs are spread over reduced output and, absent other circumstances, our profit margins decrease. Conversely, as factory loadings increase, our fixed costs are spread over increased output and, absent other circumstances, our profit margins increase.\nFor an explanation of free cash flow, see the Non-GAAP financial information section.\nAll dollar amounts in the tables are stated in millions of U.S. dollars.\nResults of operations\nOur strategic focus is on analog and embedded processing products. We sell our products into six end markets: industrial, automotive, personal electronics, enterprise systems, communications equipment and other. While all of these end markets represent good opportunities, we place additional strategic emphasis on designing and selling our products into the industrial and automotive markets, which we believe represent the best long-term growth opportunities.\nOur focus on analog and embedded processing allows us to generate strong cash flow from operations. Our cash flow from operations of $6.32 billion underscored the strength of our business model, the quality of our product portfolio and the benefit of 300mm production. Free cash flow was $1.50 billion and represented 9.6% of revenue. During 2024, we invested $3.75 billion in R&D and SG&A, invested $4.82 billion in capital expenditures and returned $5.72 billion to shareholders.\nDetails of financial results – 2024 compared with 2023\nRevenue of $15.64 billion decreased $1.88 billion, or 10.7%, due to lower revenue from Analog and Embedded Processing.\nGross profit of $9.09 billion was down $1.93 billion, or 17.5%, primarily due to lower revenue and, to a lesser extent, higher manufacturing costs associated with our planned capacity expansions. As a percentage of revenue, gross profit decreased to 58.1% from 62.9%.\nOperating expenses (R&D and SG&A) were $3.75 billion compared with $3.69 billion.\nRestructuring charges/other was a credit of $124 million primarily due to a gain on the sale of a property during 2024. See Note 11 to the financial statements.\nOperating profit was $5.47 billion, or 34.9% of revenue, compared with $7.33 billion, or 41.8% of revenue.\nOther income and expense (OI&E) was $496 million of income compared with $440 million of income, due to interest income. See Note 11 to the financial statements.\nInterest and debt expense of $508 million increased $155 million due to the issuance of additional long-term debt. See Note 8 to the financial statements.\nOur provision for income taxes was $654 million compared with $908 million. This decrease was due to lower income before income taxes. Our effective tax rate, which includes discrete tax items, was 12.0% in 2024 compared with 12.2% in 2023. See Note 4 to the financial statements for a reconciliation of the U.S. statutory corporate tax rate to our effective tax rate.\nNet income was $4.80 billion compared with $6.51 billion. EPS was $5.20 compared with $7.07.\nSegment results – 2024 compared with 2023\nAnalog (includes Power and Signal Chain product lines)\n\nIncludes restructuring charges/other\nOther revenue decreased $164 million, and operating profit increased $3 million.\nAt the end of 2024, total cash (cash and cash equivalents plus short-term investments) was $7.58 billion, a decrease of $995 million from the end of 2023.\nAccounts receivable were $1.72 billion, a decrease of $68 million compared with the end of 2023. Days sales outstanding at the end of 2024 and 2023 were 39.\nInventory was $4.53 billion, an increase of $528 million from the end of 2023. Days of inventory at the end of 2024 were 241 compared with 219 at the end of 2023.\nLiquidity and capital resources\nOur primary source of liquidity is cash flow from operations. Additional sources of liquidity are cash and cash equivalents, short-term investments and access to debt markets. We also have a variable-rate, revolving credit facility. As of December 31, 2024, our credit facility was undrawn, and we had no commercial paper outstanding. Cash flows from operating activities for 2024 were $6.32 billion, a decrease of $102 million due to lower net income, partially offset by lower cash used for working capital. Cash flows from operating activities for 2024 include a cash benefit of $588 million from the U.S. CHIPS and Science Act (CHIPS Act) investment tax credit (ITC) used to reduce income taxes payable.\nInvesting activities for 2024 used $3.20 billion compared with $4.36 billion in 2023. Capital expenditures were $4.82 billion compared with $5.07 billion in 2023 and were primarily for semiconductor manufacturing equipment and facilities in both periods. Short-term investments provided cash proceeds of $1.47 billion in 2024 compared with $682 million in 2023.\nAs we continue to invest to strengthen our competitive advantages in manufacturing and technology, as part of our long-term capacity planning, our capital expenditures are expected to remain at elevated levels. We expect to receive between $7.5 billion to $9.5 billion through 2034 from the CHIPS Act. This includes the ITC for qualified U.S. manufacturing investments and direct funding of up to $1.6 billion for our three large-scale 300mm wafer fabs currently under construction in Sherman, Texas, and Lehi, Utah. We received $588 million\n\nin associated cash benefit from qualifying capital expenditures in 2024.\nFinancing activities for 2024 used $2.88 billion compared with $2.14 billion in 2023. In 2024, we received net proceeds of $2.98 billion from the issuance of fixed-rate, long-term debt and retired maturing debt of $600 million. In 2023, we received net proceeds of $3.00 billion from the issuance of fixed-rate, long-term debt and retired maturing debt of $500 million. Dividends paid in 2024 were $4.80 billion compared with $4.56 billion in 2023, reflecting an increased dividend rate. We used $929 million to repurchase 4.7 million shares of our common stock compared with $293 million used in 2023 to repurchase 1.8 million shares. Employee exercises of stock options provided cash proceeds of $517 million compared with $263 million in 2023.\nWe had $3.20 billion of cash and cash equivalents and $4.38 billion of short-term investments as of December 31, 2024. We believe we have the necessary financial resources and operating plans to fund our working capital needs, capital expenditures, dividend and debt-related payments and other business requirements for at least the next 12 months.\nNon-GAAP financial information\nThis MD&A includes references to free cash flow and ratios based on that measure. These are financial measures that were not prepared in accordance with generally accepted accounting principles in the United States (GAAP). Free cash flow was calculated by subtracting capital expenditures from the most directly comparable GAAP measure, cash flows from operating activities (also referred to as cash flow from operations).\nWe believe that free cash flow and the associated ratios provide insight into our liquidity, our cash-generating capability and the amount of cash potentially available to return to shareholders, as well as insight into our financial performance. These non-GAAP measures are supplemental to the comparable GAAP measures.\nReconciliation to the most directly comparable GAAP measures is provided in the table below.\nFor Years Ended December 31,\nCash flow from operations (GAAP) *\n\n* Includes a cash benefit of $588 million from the CHIPS Act ITC used to reduce income taxes payable for 2024\nCritical accounting estimates\nOur accounting policies are more fully described in Note 2 of the consolidated financial statements. As disclosed in Note 2, the preparation of consolidated financial statements in conformity with U.S. GAAP requires management to make estimates and assumptions about future events that affect the amounts reported in the financial statements and accompanying notes. Management believes it is unlikely that applying other estimates and assumptions would have a material impact on the financial statements. We consider the following accounting policies to be those that are most important to the portrayal of our financial condition and that require a higher degree of judgment.\nIn determining net income for financial statement purposes, we must make certain estimates and judgments in the calculation of tax provisions and the resultant tax liabilities that arise from temporary differences between the tax and financial statement recognition of revenue and expense.\nIn the ordinary course of global business, there may be many transactions and calculations where the ultimate tax outcome is uncertain. The evaluation of tax liabilities involves dealing with uncertainties in the interpretation and application of complex tax laws, and significant judgment is necessary to determine whether, based on the technical merits, a tax position is more likely than not to be sustained. We determine potential liabilities for anticipated tax audit issues in the United States and other tax jurisdictions based on an estimate of the ultimate resolution of whether, and the extent to which, additional taxes will be due. Although we believe our analysis of the underlying issues and the associated estimates are reasonable, no assurance can be given that the final outcome of these matters will not be different from what is reflected in the historical income tax provisions and accruals.\nCommitments and contingencies\nSee Note 10 to the financial statements for a discussion of our commitments and contingencies.\n\nAnalog revenue decreased due to the mix of products shipped in both product lines, led by Signal Chain. Operating profit decreased primarily due to lower revenue and higher manufacturing costs.\nEmbedded Processing (includes microcontrollers and processors)\n\nEmbedded Processing revenue decreased. Operating profit decreased primarily due to lower revenue and associated gross profit.\nproducts, calculators and custom ASIC products)",
  "item2_clean": null
}