{
  "source_file": "txt-20241228.htm",
  "form_type": "10-K",
  "item1_clean": "The following description of our business and operating segments should be read in conjunction with Item 7. Management’s Discussion and Analysis of Financial Condition and Results of Operations.\nTextron Aviation Segment\nTextron Aviation is a leader in general aviation. Textron Aviation manufactures, sells and services Cessna and Beechcraft aircraft, and services the Hawker brand of business jets. The segment has two principal product lines: aircraft and aftermarket parts and services. Aircraft includes sales of business jets, turboprop aircraft, military trainer and defense aircraft and piston engine aircraft. Aftermarket parts and services includes commercial parts sales and maintenance, inspection and repair services, and advanced flight training devices.\nTextron Aviation's business jets include the Cessna Citation M2 Gen2, Citation CJ3+, Citation CJ4 Gen2, Citation XLS Gen2, Citation Latitude and the Citation Longitude. In October 2024, Textron Aviation introduced its next generation of light jets, the Citation M2 Gen3, CJ3 Gen3 and CJ4 Gen3, which will include the revolutionary Garmin Emergency Autoland technology. Currently under development, the CJ3 Gen2 is expected to enter into service in 2025, the CJ4 Gen3 is expected to enter into service in 2026, and the M2 Gen3 and CJ3 Gen3 are expected to enter into service in 2027. In addition, Textron Aviation is developing the Citation Ascend, a high-performance midsize business jet, which is continuing to progress through the Federal Aviation Administration's (FAA) certification process and is expected to enter into service in 2025.\nTextron Aviation’s turboprop aircraft include the Beechcraft King Air 260, King Air 360ER and King Air 360, and the Cessna Caravan, Grand Caravan EX and SkyCourier. The Beechcraft Denali, a high-performance single engine turboprop aircraft under development, continues toward FAA certification. The Denali will be powered by an engine expected to be up to 20% more efficient than similarly sized engines.\nTextron Aviation’s military trainer and defense aircraft include the Beechcraft T-6 trainer, which has been used to train pilots from more than 40 countries, and the AT-6 light attack military aircraft. Textron Aviation’s piston engine aircraft include the Cessna Skyhawk, Skylane, Turbo Skylane, Turbo Stationair HD and the Beechcraft Baron G58 and Bonanza G36.\nTextron Aviation markets its products worldwide through its own sales force, as well as through a network of authorized independent sales representatives. With a product lineup ranging from introductory training aircraft through super mid-size business jets, Textron Aviation’s diverse customer base includes fractional aircraft businesses, charter and fleet operators, corporate aviation, individual buyers, training schools, airlines, and special mission, military and government operators.\nIn support of its family of aircraft, Textron Aviation operates a global network of more than 20 service centers. In addition, more than 300 authorized independent service centers are located throughout the world. Textron Aviation-owned service centers provide customers with 24-hour service and maintenance. Textron Aviation also provides its customers with around-the-clock parts support and offers a mobile support program with over 80 mobile service units.\nBell is a leading supplier of military and commercial helicopters, tiltrotor aircraft, and related spare parts and services in the world. Tiltrotor aircraft are designed to provide the benefits of both helicopters and fixed-wing aircraft.\nBell supplies advanced military helicopters and provides parts and support services to the U.S. Government and to military customers outside the United States. Bell’s primary U.S. Government programs are for the development of a next generation tiltrotor aircraft for the U.S. Army’s Future Long Range Assault Aircraft (FLRAA) program and the production and support of the V-22 tiltrotor aircraft and H-1 helicopters. Under the U.S. Government-sponsored foreign military sales program, Bell offers the V-22 tiltrotor aircraft and H-1 helicopter products for sale to other countries.\nThe FLRAA development contract was awarded to Bell in December 2022. In 2024, the U.S. Army announced approval of Milestone B for the FLRAA program, establishing FLRAA as a program of record and transitioning the program to the Engineering and Manufacturing Development phase. This phase includes continued digital modeling, detailed hardware and software design, and fabrication of hardware, as Bell proceeds to critical design review and the first prototype flight planned for 2026.\nThrough its commercial business, Bell is a leading supplier of commercially certified helicopters and support to corporate, private, law enforcement, utility, public safety and emergency medical helicopter operators, and U.S. and foreign governments. Bell produces a variety of commercial aircraft types, including light single- and twin-engine helicopters and medium twin-engine helicopters, along with other related products. The commercial helicopters currently offered by Bell include the 429, 407GXi, 412EPX and 505 Jet Ranger X. Bell’s super medium commercial helicopter, the 525 Relentless, continues toward FAA certification.\nFor both its military programs and its commercial products, Bell provides post-sale support and service for an installed base of approximately 13,000 helicopters. Bell operates a global network of eight Company-operated service centers and four global parts distribution centers. In addition, approximately 85 independent service centers are located in about 35 countries. Collectively, these service sites offer a complete range of logistics support, including parts, support equipment, technical data, training devices, pilot and maintenance training, component repair and overhaul, engine repair and overhaul, aircraft modifications, aircraft customizing, accessory manufacturing, contractor maintenance, field service and product support engineering.\nTextron Systems Segment\nThe businesses in our Textron Systems segment develop, manufacture and integrate a variety of products and services for U.S. and international military, government and commercial customers to support defense, homeland security, aerospace, infrastructure protection and other customer missions. Product and service offerings of this segment include electronic systems and solutions, advanced marine craft, piston aircraft engines, live military air-to-air and air-to-ship training, weapons and related components, unmanned aircraft systems and both manned and unmanned armored and specialty vehicles.\nNotable products currently developed and produced by the Textron Systems segment include the Ship-to-Shore Connector, the U.S. Navy's next generation of Landing Craft Air Cushion vehicles; a family of test and simulation products; the Aerosonde Small Unmanned Aircraft System, a multi-mission capable unmanned aircraft system for commercial and military operations; and piston aircraft engines under the Lycoming brand. Notable service offerings of the segment include fee-for-service programs, using unmanned aircraft systems, and live military air-to-air and air-to-ship training and support services for U.S. Navy, Marine and Air Force personnel provided by Airborne Tactical Advantage Company.\nOur Industrial segment designs and manufactures a variety of products within the Kautex and Textron Specialized Vehicles businesses.\nKautex is a leader in designing and manufacturing plastic fuel systems for automobiles and light trucks, including blow-molded solutions for conventional plastic fuel tanks and pressurized plastic fuel tanks for hybrid vehicle applications. Kautex also develops and manufactures clear-vision systems for automotive safety and advanced driver assistance systems (ADAS). Our cleaning systems are comprised of nozzles, reservoirs, inlets and pumps to support onboard cleaning for windscreens, headlamps and ADAS cameras and sensors. In addition, Kautex produces plastic tanks for selective catalytic reduction systems used to reduce emissions from diesel engines, and other fuel system components. Kautex also offers lightweight, composite Pentatonic battery systems, which include enclosures, underbody protection and thermal management systems, for use in electric vehicles, from hybrid to full battery-powered.\nKautex’s business model is focused on developing and maintaining long-term customer relationships with leading global original equipment manufacturers (OEMs). Kautex, which is headquartered in Bonn, Germany, operates over 30 plants in 13 countries in close proximity to its customers, along with 9 engineering/research and development locations around the world.\nOur Textron Specialized Vehicles businesses manufacture and sell products under our E-Z-GO, Arctic Cat, TUG Technologies, Douglas Equipment, Premier, Safeaero, Ransomes, Jacobsen and Cushman brands. These businesses design, manufacture and sell golf cars; off-road utility vehicles; powersports products; light transportation vehicles; aviation ground support equipment; professional turf-maintenance equipment; and specialized turf-care vehicles. A significant portion of the products sold by these businesses are powered with lithium batteries, greatly reducing the products’ impact on the environment.\nThe diversified customer base for Textron Specialized Vehicles includes golf courses and resorts, government agencies and municipalities, consumers, outdoor enthusiasts, and commercial and industrial users such as factories, warehouses, airlines, planned communities, hunting preserves, educational and corporate campuses, sporting venues and landscaping professionals. Sales are made through a network of independent distributors and dealers worldwide and the Bass Pro Shops and Cabela's retail outlets, which sell our powersports products under the Tracker Off Road brand, as well as factory direct resources. In addition, we also manufacture powersports products for OEMs for resale to customers under the OEM’s branding.\nTextron eAviation Segment\nOur Textron eAviation segment is focused on research and development initiatives related to sustainable aviation solutions and includes Pipistrel, a manufacturer of light aircraft. Pipistrel offers a family of light aircraft and gliders with both electric and combustion engines, including the Velis Electro, which is the world’s first, and currently only, electric aircraft to receive full type certification from the European Union Aviation Safety Agency and from the UK Civil Aviation Authority. In 2024, the FAA granted a light-sport aircraft airworthiness exemption for the Pipistrel Velis Electro, allowing flight training in an electric aircraft within the United States.\nThe Textron eAviation segment is also developing both hybrid and electric propulsion aircraft, including Pipistrel's Nuuva V300, a long-range, large-capacity hybrid-electric vertical takeoff and landing aircraft, and an electric vertical takeoff and landing (eVTOL) aircraft. The Nuuva V300's first hover flight is expected in 2025 and initial testing on the Nexus, a full-scale technology demonstrator eVTOL, is expected to begin in 2025.\nOur Finance segment, or the Finance group, is a commercial finance business that consists of Textron Financial Corporation (TFC) and its consolidated subsidiaries. The Finance segment provides financing primarily to purchasers of new and pre-owned Textron Aviation aircraft and Bell helicopters. A substantial number of the originations in our finance receivable portfolio are cross-border transactions for aircraft sold outside of the U.S. In 2024 and 2023, our Finance group made payments of $109 million and $160 million, respectively, to finance the Manufacturing group's sale of Textron-manufactured products to third parties.\nBacklog represents amounts allocated to contracts that we expect to recognize as revenue in future periods when we perform under the con",
  "item7_clean": "Item 7. Management’s Discussion and Analysis of Financial Condition and Results of Operations\nIn 2024, our operating results were adversely impacted by a strike at the Textron Aviation segment. On September 21, 2024, the International Association of Machinists and Aerospace Workers (IAM) District 70, Local Lodge 774 called a strike against Textron Aviation. On October 20, 2024, an agreement was reached on a new five-year labor contract. As a result, our revenues and profit were unfavorably impacted in the second half of 2024 due to delayed aircraft deliveries and manufacturing inefficiencies associated with the labor disruption and the recovery of operating activities. At the Industrial segment, we experienced lower revenues and profit in 2024, largely resulting from a decline in demand in our end markets for Textron Specialized Vehicles products. We are in the process of conducting a strategic review of our powersports product line, as discussed in Note 15 to the Consolidated Financial Statements on page\nAt our Bell segment, the ramp up of the FLRAA program contributed to a 14% growth in its revenues for the year. In August, the U.S. Army announced approval of Milestone B for the FLRAA program, establishing it as a program of record and transitioning it to the Engineering and Manufacturing Development phase. In the second half of the year, Bell was awarded contracts totaling approximately $3.0 billion for this phase of the program that contributed to a total company backlog increase of $4.0 billion, 29%, to $17.9 billion at the end of 2024. This backlog increase included growth of $676 million at the Textron Aviation segment, reflecting steady customer demand supported by new products, and $644 million at the Textron Systems segment, which included new contract awards for the Ship-to-Shore Connector program.\nFinancial highlights for 2024 also include:\nGenerated $1.0 billion of net cash from operating activities from our manufacturing businesses.\nInvested $491 million in research and development projects and $364 million in capital expenditures.\nReturned $1.1 billion to our shareholders through the repurchase of 12.9 million shares of our common stock.\nIn November 2023, the Financial Accounting Standards Board issued Accounting Standard Update (ASU) No. 2023-07,\nSegment Reporting (Topic 280): Improvements to Reportable Segment Disclosures\n, which requires a public entity to disclose, on an annual and interim basis, significant segment expenses and other segment items that are regularly provided to the Chief Operating Decision Maker. The new standard is effective for fiscal years beginning after December 15, 2023. We adopted ASU 2023-07 in the fourth quarter of 2024 and have recast management’s discussion and analysis of the results of operations of our company to include a discussion of the additional expense categories. In connection with the adoption of this standard, research and development costs previously included within Cost of products sold are now reported on a separate line in our Consolidated Statements of Operations. Prior period amounts have been recast to conform to the new presentation.\nThe following discussion should be read in conjunction with our Consolidated Financial Statements and related Notes included in Item 8. Financial Statements and Supplementary Data.\nConsolidated Results of Operations\n(Dollars in millions)\nGross margin as a percentage of Manufacturing revenues\nResearch and development costs\nSelling and administrative expense\nInterest expense, net\nNon-service components of pension and postretirement income, net\nRevenues increased $19 million in 2024, compared with 2023, largely due to the following factors:\nHigher Bell revenues of $432 million, largely reflecting higher military aircraft and support revenues of $347 million, primarily due to higher volume on the FLRAA program, partially offset by lower volume on the V-22 program.\nLower Industrial revenues of $326 million, due to lower revenues of $263 million at Textron Specialized Vehicles, principally in the powersports and personal transportation vehicles product lines due to reduced demand in their end markets, and lower revenues of $63 million at Kautex.\nLower Textron Aviation revenues of $89 million, reflecting lower volume and mix of $270 million, principally a result of the strike discussed in the Segment Analysis section below, partially offset by higher pricing of $181 million in both the aircraft and aftermarket parts and services product lines.\nCost of sales includes cost of products and services sold for the Manufacturing group. In 2024, cost of sales increased $365 million, 3%, compared with 2023. The increase in cost was largely due to a $299 million impact from inflation and higher LIFO inventory provision and a $38 million inventory valuation charge to write down inventory to its net realizable value at Textron Specialized Vehicles as discussed in Note 15 to the Consolidated Financial Statements on page\nConsolidated gross margin as a percentage of Manufacturing revenues decreased 250 basis points in 2024, compared with 2023, primarily due to lower gross margin at the Bell segment, largely due to the mix of contracts discussed above, and at the Textron Aviation segment, reflecting the mix of aircraft sold and manufacturing inefficiencies, largely due to the strike. In addition, higher LIFO inventory provision and the inventory valuation charge noted above accounted for 80 basis points of the decrease.\nResearch and Development Costs\nResearch and development costs decreased $79 million, 14%, in 2024, compared with 2023, largely reflecting the winddown of the Future Attack Reconnaissance Aircraft Program at the Bell segment, partially offset by a $17 million increase at the Textron eAviation segment, largely due to development efforts on hybrid and electric propulsion aircraft.\nSelling and Administrative Expense\nSelling and administrative expense decreased $69 million, 6%, in 2024, compared with 2023, primarily reflecting lower compensation expense, which included lower shared-based and incentive compensation and savings from restructuring activities.\nInterest Expense, Net\nInterest expense, net includes interest expense for both the Finance and Manufacturing borrowing groups, with interest on intercompany borrowings eliminated, and interest income earned on cash and equivalents for the Manufacturing borrowing group. In 2024, interest expense, net increased $20 million, 26%, compared with 2023, primarily due to an increase in the weighted-average interest rate of our debt and $7 million in lower interest income. For 2024, 2023 and 2022, gross interest expense totaled $146 million, $133 million and $129 million, respectively.\nSpecial charges of $78 million and $126 million in 2024 and 2023, respectively, include restructuring activities and asset impairment charges as described in Note 15 to the Consolidated Financial Statements on page\nNon-service Components of Pension and Postretirement Income, Net\nNon-service components of pension and postretirement income, net increased by $26 million, 11%, in 2024, compared with 2023. The increase is based on our annual valuation at the end of 2023 and is primarily driven by the impact of actual pension asset returns that exceeded our expected return on plan assets.\nIn 2024, the effective tax rate of 12.5% was lower than the U.S. federal statutory tax rate of 21%, largely due to the favorable impact of research and development credits and the effective settlement of certain tax positions in the fourth quarter of 2024, which is discussed in Note 16 to the Consolidated Financial Statements on page\n. In 2023, the effective tax rate of 15.2% was lower than the U.S. federal statutory tax rate of 21%, largely due to the favorable impact of research and development credits and tax deductions for foreign-derived intangible income.\nFor a full reconciliation of our effective tax rate to the U.S. federal statutory tax rate, see Note 16 to the Consolidated Financial Statements on page\nWe operate in, and report financial information for, the following six operating segments: Textron Aviation, Bell, Textron Systems, Industrial, Textron eAviation and Finance. Segment profit is an important measure used for evaluating performance and for decision-making purposes. Segment profit for the manufacturing segments excludes the non-service components of pension and postretirement income, net; LIFO inventory provision; intangible asset amortization; interest expense, net for Manufacturing group; certain corporate expenses; gains/losses on major business dispositions; special charges and the inventory valuation charge to write down production-related powersports inventory. The operating costs used to derive segment profit for our manufacturing segments includes cost of sales, research and development costs and selling and administrative expense. The cost of sales discussed in this Segment Analysis section excludes the LIFO inventory provision, intangible asset amortization and the inventory valuation charge discussed above that are reported within Cost of products sold or Cost of services sold on the Consolidated Statement of Operations. The measurement for the Finance segment includes interest income and expense along with intercompany interest income and expense.\nIn our discussion of comparative results for the Manufacturing group, material changes in revenues and segment profit for our commercial businesses typically are expressed in terms of product line revenues, including volume and mix and pricing; foreign exchange; acquisitions and dispositions; inflation; manufacturing efficiency; and changes in research and development costs and selling and administrative expense. For revenues, volume and mix represents changes in revenues from increases or decreases in the number of units delivered or services provided and the composition of products and/or services sold. For segment profit, volume and mix represents a change due to the number of units delivered or services provided and the composition of products and/or services sold at different profit margins. Pricing represents changes in unit pricing. Foreign exchange is the change resulting from translating foreign-denominated amounts into U.S. dollars at exchange rates that are different from the prior period. Revenues generated by acquired businesses are reflected in Acquisitions for a twelve-month period, while reductions in revenues and segment profit from the sale of businesses are reflected as Dispositions. Inflation represents higher material, wages, benefits, pension service cost or other costs. Manufacturing efficiency includes changes in material, labor and overhead variances to standards, typically due to scrap rates, labor efficiency or inefficiencies, facility usage and other manufacturing productivity inputs.\nApproximately 25% of our 2024 revenues were derived from contracts with the U.S. Government, including those under the U.S. Government-sponsored foreign military sales program. For our segments that contract with the U.S. Government, material changes in revenues related to these contracts are expressed in terms of volume. Changes in segment profit for these contracts are typically expressed in terms of volume and mix and contract performance, which includes cumulative catch-up adjustments associated with a) revisions to the transaction price that may reflect contract modifications or changes in assumptions related to award fees and other variable consideration or b) changes in the total estimated costs at completion due to improved or deteriorated operating performance.\n(Dollars in millions)\nAftermarket parts and services\nResearch and development costs\nSelling and administrative expense\nTextron Aviation’s revenues decreased $89 million, 2%, in 2024, compared with 2023, reflecting lower volume and mix of $270 million, which was principally a result of the strike discussed below, partially offset by higher pricing of $181 million. Aircraft revenues decreased $203 million, 6%, due to lower volume and mix, largely from Citation jet and commercial turboprop deliveries, partially offset by higher pricing. We delivered 151 Citation jets and 127 commercial turboprops in 2024, compared with 168 Citation jets and 153 commercial turboprops in 2023. Aftermarket parts and services revenues increased $114 million, 6%, due to higher pricing and volume.\nOn September 21, 2024, the IAM District 70, Local Lodge 774 called a strike against Textron Aviation. The strike impacted approximately 5,000 of Textron Aviation’s employees at the manufacturing, parts and distribution and service center facilities in Wichita. On October 20, 2024, Textron Aviation and the IAM reached an agreement on a new five-year labor contract. The strike had a significant adverse impact on Textron Aviation’s ability to meet its production and delivery schedules in the third quarter and continuing into the fourth quarter of 2024. As a result, our revenues and profit were unfavorably impacted in the second half of 2024 by delayed aircraft deliveries and manufacturing inefficiencies associated with the labor disruption and the recovery of operating activities.\nTextron Aviation’s cost of sales decreased $14 million in 2024, compared with 2023. The impact of lower volume and mix on our cost of sales was offset by $127 million of inflation and $43 million in manufacturing inefficiencies, largely reflecting idle facilities costs resulting from the strike discussed above.\nTextron Aviation’s segment profit decreased $83 million, 13%, in 2024, compared with 2023, primarily due to lower volume and mix and the manufacturing inefficiencies discussed above, partially offset by higher pricing, net of inflation.\nTextron Aviation’s backlog increased $676 million, 9%, in 2024, reflecting orders in excess of deliveries.\n(Dollars in millions)\nMilitary aircraft and support programs\nCommercial helicopters, parts and services\nResearch and development costs\nSelling and administrative expense\nBell’s military aircraft and support programs include a development contract for the U.S. Army's FLRAA program, as well as production, upgrade, and support contracts for the V-22 tiltrotor aircraft and H-1 helicopters. The FLRAA program represents an increasing portion of Bell’s revenues as development activities have ramped. In August 2024, the U.S. Army announced approval of Milestone B for the FLRAA program, establishing it as a program of record and transitioning it to the Engineering and Manufacturing Development phase. In the second half of 2024, Bell was awarded contracts totaling approximately $3.0 billion for this phase of the program.\nBell’s military and support programs revenues increased $347 million, 20%, in 2024, compared with 2023, primarily due to higher volume on the FLRAA program, partially offset by lower volume on the V-22 program. Commercial helicopters, parts and services increased $85 million, 6%. We delivered 172 commercial helicopters in 2024, compared with 171 commercial helicopters in 2023.\nBell's cost of sales increased $507 million, 21%, in 2024, compared with 2023, primarily due to the higher volume and mix discussed above.\nBell's research and development costs decreased $95 million, 49%, in 2024, compared with 2023, largely due to the winddown of the Future Attack Reconnaissance Aircraft Program.\nSelling and administrative expense decreased at Bell by $30 million, 12%, in 2024, compared with 2023, primarily due to a gain on a legal settlement recorded in the first quarter of 2024 and lower bid and proposal costs.\nBell’s segment profit increased $50 million, 16%, in 2024, compared with 2023, primarily due to lower research and development costs, as described above, partially offset by an unfavorable impact from mix as volume increased on lower margin FLRAA development activities while volume decreased on higher margin V-22 program revenues.\nBacklog increased $2.7 billion, 5",
  "item2_clean": null
}