{
  "source_file": "txt-20250927.htm",
  "form_type": "10-Q",
  "item1_clean": null,
  "item7_clean": null,
  "item2_clean": "Item 2. Management’s Discussion and Analysis of Financial Condition and Results of Operations\nBusiness Environment\nChanges to the United States trade policy have resulted in new or higher tariffs on goods imported from numerous countries, and some countries have imposed retaliatory tariffs on imports from the United States. We are principally a North American manufacturer and 71% of our 2024 revenues were generated in the U.S. Our aircraft products, subassemblies, parts and components manufactured in Canada and Mexico are largely qualified under the rules of the United States-Mexico-Canada Agreement (USMCA) for preferential treatment on tariffs imposed by the U.S. on Canada and Mexico imports. In addition, our operations outside of North America primarily source materials and components from outside of North America and manufacture products for non-U.S. customers. Many of our businesses also source materials and components from outside of North America. These businesses have been and will continue to be impacted by these imposed U.S. tariffs. In order to mitigate these impacts our businesses have been managing, and will continue to manage, pricing and supply chain optimization strategies. In addition, our aircraft businesses have begun the tariff reconciliation and refund process with the U.S. Government to recover tariff costs that were previously paid related to materials and components that were subsequently determined to be USMCA compliant. To date, we have not experienced a material adverse impact from these tariffs. We will continue to evaluate the ongoing impact of these tariffs and any further developments or changes in global tariff policies on our business and financial position.\nAppropriations for FY 2026 were not enacted by September 30, 2025, and on October 1, 2025, the U.S. Government entered a shutdown, which is ongoing. Consistent with federal guidelines, we are continuing to perform work on existing contracts funded with appropriations from prior fiscal years. If a prolonged government shutdown occurs, it could result in program disruptions, limit the U.S. Government’s ability to progress programs and make timely payments, and impact new program starts. A prolonged shutdown could have significant consequences for our company, our employees, our suppliers and our industry and could result in delayed cash collections and/or have a material adverse effect on our financial position, results of operations and/or cash flows.\nConsolidated Results of Operations\n(Dollars in millions)\nGross margin as a % of Manufacturing revenues\nResearch and development costs\nSelling and administrative expense\nInterest expense, net\nNon-service components of pension and postretirement income, net\nAn analysis of our consolidated operating results is set forth below. A more detailed analysis of our segments’ operating results is provided in the Segment Analysis section on pages 24 to 28.\nRevenues increased $175 million, 5%, in the third quarter of 2025, compared with the third quarter of 2024. The revenue increase primarily included the following factors:\nHigher Textron Aviation revenues of $138 million, reflecting higher aircraft revenues of $116 million and higher aftermarket parts and services revenues of $22 million.\nHigher Bell revenues of $97 million due to higher military aircraft and support programs revenues of $128 million, primarily for the Future Long Range Assault Aircraft (FLRAA) program, now designated as MV-75 by the U.S. Army, partially offset by lower commercial revenues of $31 million.\nLower Industrial revenues of $79 million, due to lower revenues of $97 million at Textron Specialized Vehicles, largely reflecting the impact from the disposition of the Powersports business in April 2025 as discussed in Note 12 to the Consolidated Financial Statements, partially offset by higher revenues of $18 million at Kautex.\nHigher Textron Systems revenues of $6 million, largely due to higher volume.\nRevenues increased $535 million, 5%, in the first nine months of 2025, compared with the first nine months of 2024. The revenue increase primarily included the following factors:\nHigher Bell revenues of $575 million, due to higher military aircraft and support programs revenues of $431 million, primarily for the MV-75 program and for military sustainment programs, as well as higher commercial revenues of $144 million.\nHigher Textron Aviation revenues of $204 million, reflecting higher aircraft revenues of $148 million and higher aftermarket parts and services revenues of $56 million.\nLower Industrial revenues of $254 million, with $225 million at Textron Specialized Vehicles, largely reflecting the impact from the disposition and lower volume and mix, primarily in golf products. Kautex revenues decreased $29 million, largely due to lower volume.\nLower Textron Systems revenues of $6 million, largely due to lower volume.\nManufacturing group revenues increased $161 million and $517 million in the third quarter and first nine months of 2025, respectively, compared with the corresponding periods of 2024, largely reflecting an increase of $159 million and $853 million, respectively, in product revenues. The increase in product revenues in the first nine months of 2025 was partially offset by a decrease of $336 million in service revenues, largely related to the classification of revenues for the MV-75 program, which was service-related prior to the transition of the program to the Engineering and Manufacturing Development phase in the third quarter of 2024 when it became product-related.\nCost of sales includes cost of products and services sold for the Manufacturing group. Cost of sales increased $139 million, 5%, in the third quarter of 2025, compared with the third quarter of 2024, largely due to higher net volume and mix of $143 million and a $61 million impact from inflation, partially offset by the impact from the disposition of the Powersports business.\nCost of sales increased $514 million, 6%, in the first nine months of 2025, compared with the first nine months of 2024, largely due to higher net volume and mix of $401 million and a $193 million impact from inflation and higher LIFO inventory provision, partially offset by the impact from the disposition. Gross margin as a percentage of Manufacturing revenues decreased 90 basis points in the first nine months of 2025, primarily due to lower margin at the Bell segment.\nResearch and Development Costs\nResearch and development costs decreased $8 million, 6%, in the third quarter of 2025, and increased $12 million, 3%, in the first nine months of 2025, compared with the corresponding periods of 2024. The higher research and development costs in the first nine months of 2025 included an increase of $32 million at Bell, reflecting lower costs in 2024 due to the wind down of the Future Attack Reconnaissance Aircraft program, partially offset by a decrease of $10 million at each of the Textron Systems and Textron eAviation segments.\nSelling and Administrative Expense\nSelling and administrative expense decreased $25 million, 9%, and $33 million, 4%, in the third quarter and first nine months of 2025, compared with the corresponding periods of 2024, primarily due to a $16 million gain resulting from the early termination of a vendor contract in the third quarter of 2025 at the Textron Systems segment. The decrease in expense in the first nine months of 2025 also included lower share-based compensation expense, partially offset by a 2024 recovery of amounts that were previously written off related to one customer relationship in the Finance segment.\nInterest Expense, Net\nInterest expense, net includes interest expense for both the Finance and Manufacturing borrowing groups, with interest on intercompany borrowings eliminated, and interest income earned on cash and equivalents for the Manufacturing borrowing group. In the third quarter and first nine months of 2025, interest expense, net increased $4 million, 15%, and $19 million, 27%, respectively, compared with the corresponding periods of 2024. The increase in expense in the first nine months of 2025 primarily reflected lower interest income. Gross interest expense totaled $39 million and $36 million in the third quarter of 2025 and 2024, respectively, and $116 million and $110 million in the first nine months of 2025 and 2024, respectively.\nSpecial charges largely include restructuring activities as discussed in Note 12 to the Consolidated Financial Statements on page\nOur effective tax rate was 25.6% and 11.5% in the third quarter of 2025 and 2024, respectively, and 19.9% and 15.8% for the first nine months of 2025 and 2024, respectively.\nOn July 4, 2025, the One Big Beautiful Bill Act (the Act) was enacted and changed certain sections of U.S. income tax law. Among other things, the Act makes permanent: 1) the option to deduct domestic research and development expenditures immediately in the year incurred, 2) the deduction of the full cost of eligible assets in the year placed in service, and 3) the EBITDA-based business interest expense limitation as well as modifications to the international tax framework.\nIn the third quarter of 2025, our effective tax rate was higher than the U.S. federal statutory rate of 21%, largely reflecting the impact of certain provisions of the Act, primarily those that affected tax deductions for foreign-derived intangible income and research and development credits. In the first nine months of 2025, our effective tax rate was lower than the U.S. federal statutory rate, primarily due to the favorable impact of research and development credits.\nIn the third quarter of 2024, the effective tax rate was lower than the U.S. federal statutory rate, largely due to the favorable impact of research and development credits and foreign tax credits. Our effective tax rate for the first nine months of 2024 was lower than the U.S. federal statutory rate largely due to the favorable impact of research and develo"
}