{
  "source_file": "tyl-20250930.htm",
  "form_type": "10-Q",
  "item1_clean": null,
  "item7_clean": null,
  "item2_clean": "ITEM 2. Management’s Discussion and Analysis of Financial Condition and Results of Operations\nCAUTIONARY NOTE CONCERNING FORWARD-LOOKING STATEMENTS\nThis document contains “forward-looking statements” within the meaning of Section 27A of the Securities Act of 1933 and Section 21E of the Securities Exchange Act of 1934 that are not historical in nature and typically address future or anticipated events, trends, expectations or beliefs with respect to our financial condition, results of operations or business. Forward-looking statements often contain words such as “believes,” “expects,” “anticipates,” “foresees,” “forecasts,” “estimates,” “plans,” “intends,” “continues,” “may,” “will,” “should,” “projects,” “might,” “could” or other similar words or phrases. Similarly, statements that describe our business strategy, outlook, objectives, plans, intentions or goals also are forward-looking statements. We believe there is a reasonable basis for our forward-looking statements, but they are inherently subject to risks and uncertainties and actual results could differ materially from the expectations and beliefs reflected in the forward-looking statements. We presently consider the following to be among the important factors that could cause actual results to differ materially from our expectations and beliefs: (1) changes in the budgets or regulatory environments of our clients, including local, state and federal government agencies, that could negatively impact information technology spending; (2) disruption to our business and harm to our competitive position resulting from cyber-attacks, security vulnerabilities and software updates; (3) our ability to protect client information from security breaches and provide uninterrupted operations of data centers; (4) our ability to achieve growth or operational synergies through the integration of acquired businesses, while avoiding unanticipated costs and disruptions to existing operations; (5) material portions of our business require the Internet infrastructure to be adequately maintained; (6) our ability to actively monitor developments in artificial intelligence (\"AI\") regulation and ethical standards as we expect that future changes in the regulatory landscape may affect our product development timelines, compliance costs, and market opportunities related to AI; (7) our ability to achieve our financial forecasts due to various factors, including project delays by our clients, reductions in transaction size, fewer transactions, delays in delivery of new products or releases or a decline in our renewal rates for service agreements; (8) general economic, political and market conditions, including inflation and changes in interest rates; (9) technological and market risks associated with the development of new products or services or of new versions of existing or acquired products or services; (10) competition in the industry in which we conduct business and the impact of competition on pricing, client retention and pressure for new products or services; (11) the ability to attract and retain qualified personnel and dealing with rising labor costs, the loss or retirement of key members of management or other key personnel; and (12) costs of compliance and any failure to comply with government and stock exchange regulations. These factors and other risks that affect our business are described in Item 1A, “Risk Factors”. We expressly disclaim any obligation to publicly update or revise our forward-looking statements.\nGENERAL\nWe provide integrated information management solutions and services for the public sector. We develop and market a broad line of software products and services to address the information technology (“IT”) needs of public sector entities. We provide subscription-based services such as software as a service (“SaaS”) and transaction-based services primarily related to digital government services and payment processing. In addition, we provide professional IT services to our clients, including software and hardware installation, data conversion, training, and for certain clients, product modifications, along with continuing maintenance and support for clients using our systems. Additionally, we provide property appraisal services for taxing\nWe report our results in two reportable segments. Our reportable segments are organized on the basis of a combination of the products and services they deliver to clients and the function that the public sector client performs. Operating segments that have met the aggregation criteria have been combined into our two reportable segments. The Enterprise Software (“ES”) reportable segment provides public sector entities with software systems and services to meet their information technology and automation needs for mission-critical “back-office” functions such as: public administration solutions, courts and public safety solutions, education solutions, and property and recording solutions. The Platform Technologies (“PT”) reportable segment provides public sector entities with platform and transformative solutions including digital solutions, payment processing, streamlined data processing, and improved operations and workflows.\nOur Chief Operating Decision Maker (“CODM”) uses segment operating income or loss to assess performance and to allocate resources (including employees, property, and financial or capital resources) for each segment, predominantly in the annual budget and forecasting process. During the fiscal periods presented, we had no significant transactions between reportable segments. Corporate unallocated amounts are comprised of non-cash amortization of intangible assets associated with acquisitions, depreciation associated with unallocated property and equipment assets, compensation costs for the executive management team and certain shared services staff, and share-based compensation expense for the entire company. Corporate unallocated amounts also include incidental revenues and expenses related to a company-wide user conference and rental income.\nSee Note 3, “Segment and Related Information,” in the notes to the financial statements for additional information.\nOn July 28, 2025, we acquired Emergency Networking, Inc (“EN”). EN is a SaaS company specializing in cloud-native software for fire departments and emergency medical services (EMS) agencies. The total cash purchase price, net of cash acquired of $497,000, was approximately $19.4 million, subject to certain post-closing adjustments, including holdbacks of $2.5 million. The actual operating results of EN are included with the operating results of the ES segment since the date of acquisition.\nOn January 31, 2025, we acquired MyGov, LLC (“MyGov”), a provider of SaaS platform solutions for community development. The total cash purchase price, net of cash acquired of $215,000, was approximately $18.2 million. The actual operating results of MyGov are included with the operating results of the ES segment since the date of acquisition.\nWe did not complete any acquisitions during the 2024 fiscal period.\nFor both the three and nine months ended September 30, 2025, total revenues increased 10%, compared to the prior period, primarily due to an increase in subscription revenue.\nSubscriptions revenue grew 15.5% and 18.8%, respectively, for the three and nine months ended September 30, 2025, compared to the prior period, primarily due to an ongoing shift toward SaaS arrangements for both new and existing clients, along with growth in certain transaction-based revenues.\nOur total employee count increased to 7,689 as of September 30, 2025, including 29 employees who joined us through acquisitions completed since September 30, 2024, from 7,386 as of September 30, 2024.\nAnnualized Recurring Revenues\nAnnualized recurring revenues (ARR) - Subscriptions and maintenance are considered recurring revenue sources. ARR is calculated by annualizing the current quarter’s recurring revenues from maintenance and subscriptions as reported in our statement of income. Management believes ARR is an indicator of the annual run rate of our recurring revenues, as well as a measure of the effectiveness of the strategies we deploy to drive revenue growth over time. ARR is a metric widely used by companies in the technology sector and by investors, which we believe offers insight into the stability of our maintenance and subscription revenues to be recognized within the year.\nSubscription revenues primarily consist of revenues derived from our SaaS arrangements and transaction-based fees. These revenues are considered recurring because revenues from these sources are expected to re-occur in similar annual amounts for the term of our relationship with the client. Transaction-based fees are generally the result of multi-year contracts with our clients that result in fees generated by payment transactions and digital government services and are collected on a recurring basis during the contract term. Transaction-based revenues are historically highest in the second quarter, which coincides with peak outdoor recreation seasons and statutory filing deadlines in many jurisdictions, and lowest in the fourth quarter, due to fewer business days and lower transaction volumes around holidays. Because ARR is an annualized revenue amount, the metric can fluctuate from quarter to quarter due to this seasonality.\nARR was $2.05 billion and $1.85 billion as of September 30, 2025, and 2024, respectively. ARR increased approximately 11% compared to the prior period primarily due to an increase in subscriptions revenue resulting from an ongoing shift toward SaaS arrangements for both new and existing clients and expansion in transaction-based fee arrangements.\nCRITICAL ACCOUNTING POLICIES AND ESTIMATES\nANALYSIS OF RESULTS OF OPERATIONS\nPercent of Total Revenues\nThree Months Ended September 30,\nNine Months Ended September 30,\nProfessional services\nSoftware licenses and royalties\n\nThe following table sets "
}