{
  "source_file": "ual-20250930.htm",
  "form_type": "10-Q",
  "item1_clean": null,
  "item7_clean": null,
  "item2_clean": "Cash flows used in investing activities increased $3.8 billion in the first nine months of 2025 as compared to the year-ago period, primarily due to an increase in the purchase of short-term and other investments as well as a decrease in proceeds from the sale of short-term and other investments.\nFinancing Activities.\nSignificant financing events in the nine months ended September 30, 2025 were as follows:\nDebt, Finance Lease and Other Financial Liability Principal Payments\n. During the nine months ended September 30, 2025, the Company made payments for debt, finance leases, and other financial liabilities of $4.2 billion.\nAs of the filing date of this report, UAL and United had the following corporate credit ratings:\nS&P\nUAL\nBB+\nBB\nBB+\nBB\n*The credit agency does not issue corporate credit ratings for subsidiary entities.\nThe Company has been able to secure financing with investment grade credit ratings for certain enhanced equipment trust certificates (\"EETCs\"), term loans and secured bond financings. Downgrades from these rating levels, among other things, could restrict the availability, or increase the cost, of future financing for the Company as well as affect the fair market value of existing debt. A rating reflects only the view of a rating agency and is not a recommendation to buy, sell or hold securities. Ratings can be revised upward or downward at any time by a rating agency if such rating agency decides that circumstances warrant such a change. Currently, Moody's and Fitch have assigned the Company a positive outlook, while S&P maintains a stable outlook.\nCommitments, Contingencies and Liquidity Matters.\nCRITICAL ACCOUNTING POLICIES\nFORWARD-LOOKING INFORMATION\nThis report contains certain \"forward-looking statements,\" within the meaning of Section 27A of the Securities Act of 1933, as amended, and Section 21E of the Securities Exchange Act of 1934, as amended (the \"Exchange Act\"), including in Part I, Item 2. Management's Discussion and Analysis of Financial Condition and Results of Operations and elsewhere, relating to, among other things, goals, plans and projections regarding the Company's financial position, results of operations, capital allocation and investments, market position, airline capacity, fleet plan strategy, fares, booking trends, product development, corporate citizenship-related strategy initiatives and business strategy. Such forward-looking statements are based on historical performance and current expectations, estimates, forecasts and projections about the Company's future financial results, goals, plans, commitments, strategies and objectives and involve inherent risks, assumptions and uncertainties, known or unknown, including internal or external factors that could delay, divert or change any of them, that are difficult to predict, may be beyond the Company's control and could cause the Company's future financial results, goals, plans, commitments, strategies and objectives to differ materially from those expressed in, or implied by, the statements. Words such as \"should,\" \"could,\" \"would,\" \"will,\" \"may,\" \"expects,\" \"plans,\" \"intends,\" \"anticipates,\" \"indicates,\" \"remains,\" \"believes,\" \"estimates,\" \"projects,\" \"forecast,\" \"guidance,\" \"outlook,\" \"goals,\" \"targets,\" \"pledge,\" \"confident,\" \"optimistic,\" \"dedicated,\" \"positioned,\" \"on track\" and other words and terms of similar meaning and expression are intended to identify forward-looking statements, although not all forward-looking statements contain such terms. All statements, other than those that relate solely to historical facts, are forward-looking statements.\nAdditionally, forward-looking statements include conditional statements and statements that identify uncertainties or trends, discuss the possible future effects of known trends or uncertainties, or that indicate that the future effects of known trends or uncertainties cannot be predicted, guaranteed or assured. All forward-looking statements in this report are based upon information available to us on the date of this report. We undertake no obligation to publicly update or revise any forward-looking statement, whether as a result of new information, future events, changed circumstances or otherwise, except as required by applicable law or regulation.\nOur actual results could differ materially from these forward-looking statements due to numerous factors including, without limitation, the following: execution risks associated with our strategic operating plan; changes in our fleet and network strategy or other factors outside our control resulting in less economic aircraft orders, costs related to modification or termination of aircraft orders or entry into aircraft orders on less favorable terms, as well as any inability to accept or integrate new aircraft into our fleet as planned, including as a result of any mandatory groundings of aircraft; any failure to effectively manage, and receive anticipated benefits and returns from, acquisitions, divestitures, investments, joint ventures and other portfolio actions, or related exposures to unknown liabilities or other issues or underperformance as compared to our expectations; adverse publicity, increased regulatory scrutiny, harm to our brand, reduced travel demand, potential tort liability and operational restrictions as a result of an accident, catastrophe or incident involving us, our regional carriers, our codeshare partners or another airline; the highly competitive nature of the global airline industry and susceptibility of the industry to price discounting and changes in capacity, including as a result of alliances, joint business arrangements or other consolidations; our reliance on a limited number of suppliers to source a majority of our aircraft, engines and certain parts, and the impact of any failure to obtain timely deliveries, additional equipment or support from any of these suppliers; disruptions to our regional network and United Express flights provided by third-party regional carriers; unfavorable economic and political conditions in the United States and globally; reliance on third-party service providers and the impact of any significant failure of these parties to perform as expected, or interruptions in our relationships with these providers or their provision of services; extended interruptions or disruptions in service at major airports where we operate and space, facility and infrastructure constraints at our hubs or other airports (including as a result of government shutdowns); geopolitical conflict, terrorist attacks or security events (including the suspension of our overflying in Russian airspace as a result of the Russia-Ukraine military conflict and interruptions of our flying as a result of the military conflicts in the Middle East, as well as any escalation of the broader economic consequences of any conflicts beyond their current scope or a delay in any planned resumption of service to an area impacted by conflict); any damage to our reputation or brand image; our reliance on technology and automated systems to operate our business and the impact of any significant failure or disruption of, or failure to effectively integrate and implement, these technologies or systems; increasing privacy, data security and cybersecurity obligations or a significant data breach; increased use of social media platforms by us, our employees and others; the impacts of union disputes, employee strikes or slowdowns, and other labor-related disruptions or regulatory compliance costs on our operations or financial performance; any failure to attract, train or retain skilled personnel, including our senior management team or other key employees; the monetary and operational costs of compliance with extensive government regulation of the airline industry; current or future litigation and regulatory actions, or failure to comply with the terms of any settlement, order or agreement relating to these actions; costs, liabilities and risks associated with environmental regulation and climate change; high and/or volatile fuel prices or significant disruptions in the supply of aircraft fuel; the impacts of our significant amount of financial leverage from fixed obligations and the impacts of insufficient liquidity on our financial condition and business; failure to comply with financial and other covenants governing our debt; limitations on our ability to use our net operating loss carryforwards and certain other tax attributes to offset future\nThe foregoing list sets forth many, but not all, of the factors that could impact our ability to achieve results described in any forward-looking statements. Investors should understand that it is not possible to predict or identify all such factors and should not consider this list to be a complete statement of all potential risks and uncertainties. It is routine for our internal projections and expectations to change as the year or each quarter in the year progresses, and therefore it should be clearly understood that the internal projections, beliefs and assumptions upon which we base our expectations may change. For instance, we regularly monitor future demand and booking trends and adjust capacity, as needed. As such, our actual flown capacity may differ materially from currently published flight schedules or current estimations.\n\nITEM 2. MANAGEMENT'S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS.\nEXECUTIVE SUMMARY\nUnited Airlines Holdings, Inc. (together with its consolidated subsidiaries, \"UAL\" or the \"Company\") is a holding company incorporated in Delaware and its wholly-owned subsidiary is United Airlines, Inc. (together with its consolidated subsidiaries, \"United\").\nOur shared purpose is \"Connecting People. Uniting the World.\" We have the most comprehensive route network among North American carriers, including U.S. mainland hubs in Chicago, Denver, Houston, Los Angeles, New York/Newark, San Francisco and Washington, D.C. The Compa"
}