{
  "source_file": "ual-20241231.htm",
  "form_type": "10-K",
  "item1_clean": "ITEM 1. BUSINESS.\nUnited Airlines Holdings, Inc. (together with its consolidated subsidiaries, \"UAL\" or the \"Company\") is a holding company and its wholly-owned subsidiary is United Airlines, Inc. (together with its consolidated subsidiaries, \"United\"). United's shared purpose is \"Connecting People. Uniting the World.\" United has the most comprehensive route network among North American carriers, including U.S. mainland hubs in Chicago, Denver, Houston, Los Angeles, New York/Newark, San Francisco and Washington, D.C.\nAs UAL consolidates United for financial statement purposes, disclosures that relate to activities of United also apply to UAL, unless otherwise noted. United's operating revenues and operating expenses comprise nearly 100% of UAL's revenues and operating expenses. In addition, United comprises approximately the entire balance of UAL's assets, liabilities and operating cash flows. When appropriate, UAL and United are named specifically for their individual contractual obligations and related disclosures and any significant differences between the operations and results of UAL and United are separately disclosed and explained. We sometimes use the words \"we,\" \"our,\" \"us,\" and the \"Company\" in this report for disclosures that relate to all of UAL and United.\nThe Company transports people and cargo throughout North America and to destinations in Asia, Europe, Africa, the Pacific, the Middle East and Latin America. UAL, through United and its regional carriers, operates across six continents, with hubs at Chicago O'Hare International Airport (\"ORD\"), Denver International Airport (\"DEN\"), George Bush Intercontinental Airport (\"IAH\"), Los Angeles International Airport (\"LAX\"), Newark Liberty International Airport (\"EWR\"), San Francisco International Airport (\"SFO\"), Washington Dulles International Airport (\"IAD\") and A.B. Won Pat International Airport (\"GUM\").\nAll of the Company's domestic hubs are located in large business and population centers, contributing to a large amount of \"origin and destination\" traffic. The hub and spoke system allows us to transport passengers between a large number of destinations with substantially more frequent service than if each route were served directly. The hub system also allows us to add service to a new destination from a large number of cities using only one or a limited number of aircraft. As discussed under Alliances below, United is a member of Star Alliance, the world's largest alliance network.\nIn 2024 the Company continued to make progress with its United Next plan to align its network and product with the potential of its hubs while remaining focused on protecting the safety of its employees and customers and providing a superior customer experience. United Next aims to increase customer choice and win brand-loyal customers by offering a diversity of products ranging from Basic Economy to Polaris and growing our leading global network, which the Company believes will lead to diverse revenue streams for the Company. As part of its United Next growth plan, the Company expects to\ntake delivery of over 660 new narrow- and widebody aircraft by the end of 2033. The new aircraft that the Company has taken delivery of to date have increased the Company's gauge, scale and connectivity as well as improved the Company's fuel efficiency. Other key highlights of its United Next plan include:\nincreasing our employee headcount by more than 30,000 employees since 2020;\nsurpassing 300 new and retrofit aircraft featuring United's signature interior with bigger bins, seatback screens at every seat and Bluetooth connectivity;\nexpanding the Company's leading global network to destinations like Ulaanbaatar, Mongolia; Nuuk, Greenland; Kaohsiung, Taiwan; Palermo, Italy; Bilbao, Spain; Faro, Portugal; Madeira Island, Portugal; Puerto Escondido, Mexico; and Dakar, Senegal;\nlaunching Kinective Media\nSM\n(the first media network that uses insights from travel behaviors to connect customers to personalized advertising, experiences and offers from leading brands);\nannouncing an industry-leading agreement with SpaceX to bring Starlink's Wi-Fi service (the world's fastest, most reliable Wi-Fi in the sky) to our aircraft; and\nmaking significant technology changes that empower the Company's employees and improve the customer experience.\nThe Company's business and operations are dependent on its regional flight network, with regional capacity accounting for approximately 6% of the Company's total capacity for the year ended December 31, 2024. The Company has contractual relationships with various regional carriers to provide regional aircraft service branded as United Express. This regional service complements our operations by carrying traffic that connects to our hubs and allows flights to smaller cities that cannot be provided economically with mainline aircraft. CommuteAir LLC (\"CommuteAir\"), GoJet Airlines LLC (\"GoJet\"), Mesa Airlines, Inc. (\"Mesa\"), Republic Airways Inc. (\"Republic\") and SkyWest Airlines, Inc. (\"SkyWest\") are all regional carriers that operate with capacity contracted to United under capacity purchase agreements (\"CPAs\"). Under these CPAs, the Company pays the regional carriers contractually agreed fees (carrier costs) for operating these flights plus a variable rate adjustment based on agreed performance metrics, subject to annual adjustments. The fees are based on specific rates multiplied by specific operating statistics (e.g., block hours, departures), as well as fixed monthly amounts. Under these CPAs, the Company is also responsible for all fuel costs incurred, as well as landing fees and other costs, which are either passed through by the regional carrier to the Company without any markup or directly incurred by the Company. In some cases, the Company owns some or all of the aircraft subject to the CPA and leases such aircraft to the regional carrier. In return, the regional carriers operate the capacity of the aircraft included within the scope of such CPA exclusively for United, on schedules determined by the Company. The Company also determines pricing and revenue management, assumes the inventory and distribution risk for the available seats and permits mileage accrual and redemption for regional flights through its MileagePlus loyalty program.\nUnited is a member of Star Alliance, a global integrated airline network and the largest and most comprehensive airline alliance in the world. In 2024, Star Alliance carriers continued to serve more than 1,200 airports in 195 countries and territories with over 17,000 average daily departures. Star Alliance members, in addition to United, are Aegean Airlines, Air Canada, Air China, Air India, Air New Zealand, All Nippon Airways (\"ANA\"), Asiana Airlines, Austrian Airlines, Aerovías del Continente Americano (Avianca), Brussels Airlines, Copa Airlines, Croatia Airlines, EGYPTAIR, Ethiopian Airlines, EVA Air, LOT Polish Airlines, Lufthansa, Shenzhen Airlines, Singapore Airlines, South African Airways, SWISS, TAP Air Portugal, THAI Airways International and Turkish Airlines. In addition to its members, Star Alliance includes Shanghai-based Juneyao Airlines as a connecting partner and Germany-based Deutsche Bahn, a rail company, as an intermodal partner.\nUnited has a variety of bilateral commercial alliance agreements and obligations with Star Alliance members, addressing, among other things, reciprocal earning and redemption of frequent flyer miles, access to airport lounges and, with certain Star Alliance members, codesharing of flight operations (whereby one carrier's selected flights can be marketed under the brand name of another carrier). In addition to the alliance agreements with Star Alliance members, United currently maintains independent alliance agreements with other air carriers, including Aer Lingus, Air Dolomiti, Airlink, Azul Linhas Aéreas Brasileiras, Cape Air, Discover Airlines, Emirates, Eurowings, flydubai, Hawaiian Airlines, JetSuiteX, Olympic Air, Silver Airways and Virgin Australia Airlines.\nUnited also participates in four passenger joint business arrangements (\"JBAs\"): one with Air Canada and the Lufthansa Group (which includes Lufthansa and its affiliates Air Dolomiti, Austrian Airlines, Brussels Airlines, Discover Airlines, Edelweiss, Eurowings and SWISS) covering transatlantic routes, one with ANA covering certain transpacific routes, one with Air New Zealand covering certain routes between the United States and New Zealand, and one with Air Canada covering certain United States and Canada transborder routes. These passenger JBAs enable the participating carriers to integrate the services they\nprovide in the respective regions, capturing revenue synergies and delivering enhanced customer benefits, such as highly competitive flight schedules, fares and services. Separate from the passenger JBAs, United is also a party to a JBA with Lufthansa for transatlantic cargo services. This cargo JBA offers expanded and more seamless access to cargo space across the carriers' respective combined networks.\nUnited's MileagePlus loyalty program builds customer loyalty by offering awards, benefits and services to program participants. Members in this program earn miles for flights on United, United Express, Star Alliance members and certain other airlines that participate in the program. Members can also earn miles by purchasing goods and services from our network of non-airline partners, such as domestic and international credit card issuers, retail merchants, hotels and car rental companies. Members can redeem miles for free (other than taxes and government-imposed fees), discounted or upgraded travel and non-travel awards.\nUnited has an agreement with JPMorgan Chase Bank, N.A. (\"Chase\"), pursuant to which members of United's MileagePlus loyalty program who are residents of the United States can earn miles for making purchases using a MileagePlus credit card issued by Chase (the \"Co-Brand Agreement\"). The Co-Brand Agreement also provides for joint marketing and other support for the MileagePlus credit card and provides Chase with other benefits such as permission to market to the Company's customer database.\nIn 2024, approximately 9.2 million MileagePlus flight awards were used on United and United Express. These awards represented approximately 9% of United's total revenue passenger miles. Total miles redeemed for flights on United and United Express, including class-of-service upgrades, represented approximately 93% of the total miles redeemed. In addition, excluding miles redeemed for flights on United and United Express, MileagePlus members redeemed miles for approximately 3.7 million other awards. These awards include United Club memberships, car and hotel awards, merchandise and flights on other air carriers.\nThe Company provides freight and mail transportation services (\"Air Cargo\"). The majority of Air Cargo services are provided to commercial businesses, freight forwarders, logistics firms and national postal services. Through our global network, the Company's Air Cargo operations are able to connect the world's major freight gateways. The Company generates Air Cargo revenues in domestic and international markets through the use of cargo capacity on regularly scheduled passenger flights, interline and charter flights, and ground trucking arrangements.\nDistribution Channels.\nThe Company's airline seat inventory and fares are distributed through the Company's direct channels, traditional travel agencies and online travel agencies (\"OTA\"). The use of the Company's direct sales website, www.united.com, the Company's mobile applications and alternative distribution systems provides the Company with an opportunity to de-commoditize its services, better present its content, make more targeted offerings, better retain its customers, enhance its brand and lower its ticket distribution costs. Agency sales are primarily sold using global distribution systems (\"GDS\"). Uni",
  "item7_clean": "ITEM 7. MANAGEMENT'S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS.\nUnited Airlines Holdings, Inc. (together with its consolidated subsidiaries, \"UAL\" or the \"Company\") is a holding company and its wholly-owned subsidiary is United Airlines, Inc. (together with its consolidated subsidiaries, \"United\").\nAs UAL consolidates United for financial statement purposes, disclosures that relate to activities of United also apply to UAL, unless otherwise noted. United's operating revenues and operating expenses comprise nearly 100% of UAL's revenues and operating expenses. In addition, United comprises approximately the entire balance of UAL's assets, liabilities and operating cash flows. When appropriate, UAL and United are named specifically for their individual contractual obligations and related disclosures and any significant differences between the operations and results of UAL and United are separately disclosed and explained. We sometimes use the words \"we,\" \"our,\" \"us,\" and the \"Company\" in this report for disclosures that relate to all of UAL and United.\nOur current expectations described below are forward-looking statements and our actual results and timing may vary materially based on various factors that include, but are not limited to, those discussed below under \"Strategy,\" \"Economic and Market Factors,\" \"Governmental Actions,\"\n. The results presented in this report are not necessarily indicative of future operating results.\nOur shared purpose is \"Connecting People. Uniting the World.\" We have the most comprehensive route network among North American carriers, including U.S. mainland hubs in Chicago, Denver, Houston, Los Angeles, New York/Newark, San Francisco and Washington, D.C.\nWe are the largest airline measured by available seat miles in the world, helping to connect around 174 million passengers to more than 360 destinations across six continents. The Company remains focused on delivering on four strategic pillars, which it believes has helped, and will continue, to differentiate United from the rest of the industry:\nIn 2024 we continued to make progress with our United Next plan to align our network and product with the potential of our hubs while remaining focused on protecting the safety of our employees and customers and providing a superior customer experience. United Next aims to increase customer choice and win brand-loyal customers by offering a diversity of products ranging from Basic Economy to Polaris and growing our leading global network, which the Company expects will lead to diverse revenue streams for the Company. As part of our United Next growth plan, we expect to take delivery of over 660 new narrow- and widebody aircraft by the end of 2033. The new aircraft that the Company has taken delivery of to date have increased our gauge, scale, and connectivity, as well as improved the Company's fuel efficiency. Other key highlights of our United Next plan include:\nincreasing our employee headcount by more than 30,000 employees since 2020;\nsurpassing 300 new and retrofit aircraft featuring our signature interior with bigger bins, seatback screens at every seat and Bluetooth connectivity;\nexpanding our leading global network to destinations like Ulaanbaatar, Mongolia; Nuuk, Greenland; Kaohsiung, Taiwan; Palermo, Italy; Bilbao, Spain; Faro, Portugal; Madeira Island, Portugal; Puerto Escondido, Mexico; and Dakar, Senegal;\nlaunching Kinective Media\nSM\n(the first media network that uses insights from travel behaviors to connect customers to personalized advertising, experiences and offers from leading brands);\nannouncing an industry-leading agreement with SpaceX to bring Starlink's Wi-Fi service (the world's fastest, most reliable Wi-Fi in the sky) to the Company's aircraft; and\nmaking significant technology changes that empower our employees and improve the customer experience.\nOperational excellence:\nThe most important factor for customer satisfaction is on-time flights. We face some unique challenges in this respect because we operate hubs in the most congested and constrained airports in the country. That backdrop means that United needs to be a leader at using technology to overcome these challenges. We have been working strategically to overcome operational challenges and continue to innovate in order to make advancements in this area.\nWe believe that best-in-class margin performance will provide the cash flow needed to support our planned investments in growth.\nWe believe that excellent customer service is part of de-commoditizing air travel. Our people are our greatest asset and they are by far the most important part of our product. Ultimately our people provide customers with the service they expect.\nEconomic and Market Factors\nThe airline industry is highly competitive, marked by significant competition with respect to routes, fares, airline capacity, schedules (both timing and frequency), services, products, customer service and frequent flyer programs. We, like other companies in our industry, have been subject to these and other industry-specific competitive dynamics. In addition, our operations, supply chain, partners and suppliers have been subject to various global macroeconomic factors. We expect to continue to remain vulnerable to a number of industry-specific and global macroeconomic factors that may cause our actual results of operations to differ from our historical results of operations or current expectations. The economic and market factors and trends that we currently believe are or will be most impactful to our results of operations and financial condition include the following: the execution and effect of our business strategies, including our United Next plan, especially relating to our focus on expanding market and product opportunities and the growth in the scale of our operations; the impact on the Company of significant operational challenges by third parties on which we rely; aircraft delivery delays; rising inflationary pressures; labor market and supply chain constraints and related costs affecting us and our partners; volatile fuel prices; increasing maintenance expenses; changes in interest rates; and changes in general economic conditions in the markets in which the Company operates, including an economic downturn leading to a decrease in demand for air travel or fluctuations in foreign currency exchange rates that may impact international travel demand. We continue to monitor the potential favorable or unfavorable impacts of these and other factors on our business, operations, financial condition, future results of operations, liquidity and financial flexibility, which are dependent on future developments, including as a result of those factors discussed in Part I, Item 1A. Risk Factors. Our future results of operations may be subject to volatility and our growth plans may be delayed, particularly in the short term, due to the impact of the above factors and trends.\nGovernmental Actions\nWe operate in complex, highly regulated environments in the U.S., the European Union, the United Kingdom and other regions around the world. Compliance with laws, regulations, administrative practices and other restrictions or legal requirements in the countries in which we do business is onerous and expensive. In addition, changes to existing legal requirements or the implementation of new legal requirements and any failure to comply with such legal requirements could negatively impact our business, operations, financial condition, future results of operations, liquidity and financial flexibility by increasing the Company's costs, limiting the Company's ability to offer a product, service or feature to customers, impacting customer demand for the Company's products and services and requiring changes to the Company's supply chain and its business. Legal requirements that we currently believe are or will be most impactful to our results of operations and financial condition include the following: the closure of our flying airspace and termination of other operations due to regional conflicts, including the suspension of our overflying in Russian airspace as a result of the Russia-Ukraine military conflict and interruptions of our flying as a result of the military conflict in the Middle East, as well as any escalation of the broader economic consequences of these conflicts beyond their current scope; delays in aircraft certification (especially relating to the 737 MAX 10 aircraft); increased FAA oversight of the aircraft production process; any legal requirement that would result in a reshaping of the\nbenefits that we provide to our consumers through our loyalty program or the co-branded credit cards issued by our partner; the effect of any potential changes in trade tariffs that we are unable to mitigate; and certain rules and regulations proposed by the DOT that would impose additional costs and operational restrictions on airlines. Changes in existing applicable legal requirements or new applicable legal requirements as well as the related interpretations and enforcement practices regarding them, create uncertainty about how such laws and regulations will be understood and applied. As a result, the impact of changing and new legal requirements generally cannot be reasonably predicted and those requirements may ultimately require extensive system and operational changes, be difficult to implement, increase our operating costs and require significant capital expenditures.\nResults of Operations\nSelect financial data and operating statistics are provided in the tables below:\nNonoperating expense, net\nIncome before income taxes\nPassengers (thousands) (a)\nRevenue passenger miles (\"RPMs\") (millions) (b)\nAvailable seat miles (\"ASMs\") (millions) (c)\nCargo revenue ton miles (millions) (d)\nPassenger load factor (e)\nPassenger revenue per available seat mile (\"PRASM\") (cents)\nTotal revenue per available seat mile (\"TRASM\") (cents)\nAverage yield per revenue passenger mile (\"Yield\") (cents) (f)\nCost per available seat mile (\"CASM\") (cents)\nAverage price per gallon of fuel, including fuel taxes\nFuel gallons consumed (millions)\nAverage stage length (miles) (g)\nEmployee headcount, as of December 31\nThe number of revenue passengers measured by each flight segment flown.\nThe number of scheduled miles flown by revenue passengers.\nThe number of seats available for passengers multiplied by the number of scheduled miles those seats are flown.\nThe number of cargo revenue tons transported multiplied by the number of miles flown.\nRPMs divided by ASMs.\nThe average passenger revenue received for each revenue passenger mile flown.\nAverage stage length equals the average distance a flight travels weighted for size of aircraft.\nThe table below illustrates the year-over-year percentage change in the Company's operating revenues for the years ended December 31 (in millions, except percentage changes):\nOther operating revenue\nTotal operating revenue\nThe table below presents passenger revenue and select operating data of the Company, broken out by geographic region, expressed as year-over-year changes:\nIncrease (decrease) from 2023:\n\nto the financial statements included in Part II, Item 8 of this report. For information regarding non-cash investing and financing activities, see the Company's statements of consolidated cash flows. For a discussion of the Company's sources and uses of cash in 2023 as\ncompared to 2022, see \"Liquidity and Capital Resources\" in Part II, Item 7. Management's Discussion and Analysis of Financial Condition and Results of Operations in the 2023 Annual Report.\nAs of the filing date of this report, UAL and United had the following corporate credit ratings:\nS&P\nUAL\nBB\nBB-\nBB\nBB-\n*The credit agency does not issue corporate credit ratings for subsidiary entities.\nThe Company has been able to secure financing with investment grade credit ratings for certain enhanced equipment trust certificates (\"EETCs\"), term loans and secured bond financings. Downgrades from these rating levels, among other things, could restrict the availability, or increase the cost, of future financing for the Company as well as affect the fair market value of existing debt. A rating reflects only the view of a rating agency and is not a recommendation to buy, sell or hold securities. Ratings can be revised upward or downward at any time by a rating agency if such rating agency decides that circumstances warrant such a change. Currently Moody's and Fitch have assigned the Company a positive outlook, while S&P maintains a stable outlook.\nOther Liquidity Matters\nBelow is a summary of additional liquidity matters. See the indicated notes to our consolidated financial statements included in Part II, Item 8 of this report for additional details related to these and other matters affecting our liquidity and commitments.\nPension and other postretirement plans\nLong-term debt and debt covenants\nCommitments, contingencies and capacity purchase agreements\nThe Company's business is capital intensive, requiring significant amounts of capital to fund the acquisition of assets, particularly aircraft. In the past, the Company has funded the acquisition of aircraft with cash, by using EETC financing, by entering into finance or operating leases, or through other financings. The Company also often enters into long-term lease commitments with airports to ensure access to terminal, cargo, maintenance and other required facilities.\nThe table below provides a summary of the Company's current and long-term material cash requirements as of December 31, 2024 (in billions):\nLong-term debt and related interest (a)\nOperating leases (b)\nLeases not yet commenced (c)\nOther financial liabilities\nPostretirement benefit payments and pension funding (e)\nCapital and other purchases (f)\nLong-term debt presented in the Company's financial statements is net of $184 million of debt discount, premiums and debt issuance costs which are being amortized over the debt terms. Cash requirements do not include the debt discount, premiums and debt issuance costs. Future interest payments on variable rate debt were computed using the rates as of December 31, 2024.\nRepresents future payments under fixed rate operating lease obligations. See Note 11 to the financial statements included in Part II, Item 8 of this report for information on variable rate and short-term operating leases.\nRepresents future payments under leases that have not yet commenced and are not included in the consolidated balance sheet. See Note 11 to the financial statements included in Part II, Item 8 of this report for information on these leases.\nRepresents our estimates of future minimum noncancelable commitments under our CPAs and does not include the portion of the underlying obligations for aircraft and facility rent that is disclosed as part of operating lease obligations. Amounts also exclude a portion of United's finance lease obligations recorded for certain of its CPAs. See Note 12 to the financial statements included in Part II, Item 8 of this report for the significant assumptions used to estimate the payments.\nAmounts represent postretirement benefit payments and an estimate of the minimum funding requirements as determined by government regulations for United's U.S. pension plans through 2034. Amounts are subject to change based on numerous assumptions, including the performance of assets in the plans and bond rates. Postretirement benefit payments approximate plan contributions as plans are substantially unfunded. See Note 8 to the financial statements included in Part II, Item 8 of this report for additional information on these benefit plans.\nRepresents contractual commitments for firm order aircraft, spare engines and other purchase commitments. See Note 12 to the financial statements included in Part II, Item 8 of this report for a discussion of our purchase commitments.\nThe Company has significant financial obligations and guaran",
  "item2_clean": null
}