{
  "source_file": "uber-20250930.htm",
  "form_type": "10-Q",
  "item1_clean": null,
  "item7_clean": null,
  "item2_clean": "ITEM 2. MANAGEMENT’S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS\nWe are a technology platform that uses a massive network, leading technology, operational excellence, and product expertise to power movement from point A to point B. We develop and operate proprietary technology applications supporting a variety of offerings on our platform. We connect consumers with providers of ride services, merchants as well as delivery service providers for meal preparation, grocery and other delivery services. Uber also connects consumers with public transportation networks. We use this same network, technology, operational excellence, and product expertise to connect Shippers with Carriers in the freight industry by providing Carriers with the ability to book a shipment, transportation management and other logistics services. We are also developing technologies designed to provide new solutions to solve everyday problems.\nDriver Classification Developments\nThe classification of Drivers is currently being challenged in courts, by legislators and by government agencies in the United States and abroad. We are involved in numerous legal proceedings globally, including putative class and collective class action lawsuits, demands for arbitration, charges and claims before administrative agencies, and investigations or audits by labor, social security, and tax authorities that claim that Drivers should be treated as our employees (or as workers or quasi-employees where those statuses exist), rather than as independent contractors. Of particular note are proceedings in California, where on May 5, 2020, the California Attorney General, in conjunction with the city attorneys for San Francisco, Los Angeles and San Diego, filed a complaint in San Francisco Superior Court (the “Court”) against Uber and Lyft, Inc., alleging that drivers are misclassified, and sought an injunction and monetary damages related to the alleged competitive advantage caused by the alleged misclassification of drivers.\nTo comply with Proposition 22, we have incurred and expect to incur additional expenses, including expenses associated with a guaranteed minimum earnings floor for Drivers, insurance for injury protection and subsidies for health care. We do not expect these changes will have a material impact on our business, results of operations, financial position, or cash flows.\nIf, as a result of legislation or judicial decisions, we are required to classify Drivers as employees, workers or quasi-employees where those statuses exist, we would incur significant additional expenses for compensating Drivers, including expenses associated with the application of wage and hour laws (including minimum wage, overtime, and meal and rest period requirements), employee benefits, social security contributions, taxes (direct and indirect), and potential penalties. Additionally, we may not have adequate Driver supply as Drivers may opt out of our platform given the loss of flexibility under an employment model, and we may not be able to hire a majority of the Drivers currently using our platform. Any of these events could negatively impact our business, results of operations, financial position, and cash flows.\nFor a discussion of risk factors related to how misclassification challenges may impact our business, result of operations, financial position and operating condition and cash flows, see the risk factor titled “-\nOur business would be adversely affected if Drivers were classified as employees, workers or quasi-employees\nFinancial and Operational Highlights\nThree Months Ended September 30,\n(In millions, except percentages)\nMonthly Active Platform Consumers (“MAPCs”)\nIncome from operations\nNet income attributable to Uber Technologies, Inc.\nNine Months Ended September 30,\nNet cash provided by operating activities\nSee the section titled “Reconciliations of Non-GAAP Financial Measures” for more information and reconciliations to the most directly comparable GAAP financial measure.\nSee the section titled “Certain Key Metrics” for more information.\nHighlights for the Third Quarter 2025\nIn the third quarter of 2025, our MAPCs were 189 million, growing 17% compared to the same period in 2024.\nOverall Gross Bookings increased to $49.7 billion in the third quarter of 2025, up 21% on a constant currency basis, compared to the same period in 2024. Mobility Gross Bookings grew 19% year-over-year, on a constant currency basis primarily due to an increase in Mobility Trip volumes. Delivery Gross Bookings grew 24% year-over-year, on a constant currency basis, primarily driven by an increase in Delivery Trip volumes. Freight Gross Bookings remained flat year-over-year, on a constant currency basis.\nRevenue was $13.5 billion, up 20% year-over-year, primarily attributable to an increase in Gross Bookings of 21%. The increase in Gross Bookings was primarily driven by an increase in Mobility and Delivery Trip volumes.\nNet income attributable to Uber Technologies, Inc. was $6.6 billion, which includes: (i) a $4.9 billion benefit from the release of our Netherlands’ deferred tax assets valuation allowance and (ii) the favorable impact of a pre-tax unrealized gain on debt and equity securities, net of $1.5 billion primarily related to changes in the fair value of our equity securities, including: a $760 million unrealized gain on our Didi investment, a $530 million unrealized gain on our Grab investment, and a $181 million net unrealized gain on our other investments.\nAdjusted EBITDA was $2.3 billion, up $566 million compared to the same period in 2024. Mobility Adjusted EBITDA was $2.0 billion, up $356 million compared to the same period in 2024. Delivery Adjusted EBITDA was $921 million, up $293 million compared to the same period in 2024. These increases were partially offset by an $82 million increase in Corporate G&A and Platform R&D costs, year-over-year.\nComponents of Results of Operations\nWe generate substantially all of our revenue from fees paid by Drivers and Merchants for use of our platform. We have concluded that we are an agent in these arrangements as we arrange for other parties to provide the service to the end-user. Under this model, revenue is net of Driver and Merchant earnings and Driver incentives. We act as an agent in these transactions by connecting consumers to Drivers and Merchants to facilitate a Trip, meal, grocery or other delivery service. In certain markets we are responsible for the Mobility or Delivery services (and in most markets we are responsible for the Freight services), and in these markets we present revenue from end-users and from Shippers on a gross basis, with the payments to Drivers and Carriers classified within cost of revenue, exclusive of depreciation and amortization.\nWe would expect revenue to fluctuate on an absolute dollar basis for the foreseeable future based upon factors such as Trip volume, Driver supply, macroeconomic conditions, global travel activities and management pricing and promotional activities.\nCost of Revenue, Exclusive of Depreciation and Amortization\nCost of revenue, exclusive of depreciation and amortization, primarily consists of costs incurred for certain Mobility and Delivery transactions where we are primarily responsible for Mobility and Delivery services and pay Drivers and Couriers for services, certain insurance costs related to our Mobility and Delivery offerings, costs incurred with Carriers for Uber Freight transportation services, credit card processing fees, bank fees, data center and networking expenses, mobile device and service costs, and amounts related to fare chargebacks and other credit card losses.\nWe expect that cost of revenue, exclusive of depreciation and amortization, will fluctuate on an absolute dollar basis for the foreseeable future primarily driven by Trip volume changes on the platform.\nOperations and Support\nOperations and support expenses primarily consist of compensation expenses, including stock-based compensation, for employees that support operations in cities, including the general managers, Driver operations, platform user support representatives and community managers. Also included is the cost of customer support, Driver background checks and the allocation of certain corporate costs.\nWe would expect operations and support expenses to vary from period to period on an absolute dollar basis, but decrease as a percentage of revenue as we become more efficient in supporting platform users.\nSales and marketing expenses primarily consist of advertising costs, product marketing costs, consumer discounts, promotions, credits and refunds provided to end-users who are not customers, compensation costs, including stock-based compensation to sales and marketing employees, and the allocation of certain corporate costs. We expense advertising and other promotional expenditures as incurred.\nWe would expect sales and marketing expenses to vary from period to period as a percentage of revenue due to timing of marketing campaigns.\nResearch and Development\nResearch and development expenses primarily consist of compensation costs, including stock-based compensation, for employees in engineering, design and product development. Expenses also include ongoing improvements to, and maintenance of, existing products and services, and allocation of certain corporate costs. We expense substantially all research and development expenses as incurred.\nWe would expect research and development expenses to increase on an absolute dollar basis and vary from period to period as a percentage of revenue as we continue to invest in research and development activities relating to ongoing improvements to and maintenance of our platform offerings and other research and development programs.\nGeneral and Administrative\nGeneral and administrative expenses primarily consist of compensation costs, including stock-based compensation, for executive management and administrative employees, i"
}