{
  "source_file": "udr-20250930x10q.htm",
  "form_type": "10-Q",
  "item1_clean": null,
  "item7_clean": null,
  "item2_clean": "risks that third parties who have an interest in or are otherwise involved in projects in which we have an interest, including mezzanine borrowers, joint venture partners or other investors, do not perform as expected;\nchanging interest rates, which could increase interest costs and affect the market price of our securities;\npotential liability for environmental contamination, which could result in substantial costs to us;\nthe imposition of federal taxes if we fail to qualify as a REIT under the Code in any taxable year;\nour internal control over financial reporting may not be considered effective which could result in a loss of investor confidence in our financial reports, and in turn have an adverse effect on our stock price; and\nchanges in real estate laws, tax laws, rent control or stabilization laws or other laws affecting our business.\nA discussion of these and other factors affecting our business and prospects is set forth in Part II, Item 1A. Risk Factors. We encourage investors to review these risk factors.\nAlthough we believe that the assumptions underlying the forward-looking statements contained herein are reasonable, any of the assumptions could be inaccurate, and therefore such statements included in this Report may not prove to be accurate. In light of the significant uncertainties inherent in the forward-looking statements included herein, the inclusion of such information should not be regarded as a representation by us or any other person that the results or conditions described in such statements or our objectives and plans will be achieved.\nForward-looking statements and such risks, uncertainties and other factors speak only as of the date of this Report, and we expressly disclaim any obligation or undertaking to update or revise any forward-looking statement contained herein, to reflect any change in our expectations with regard thereto, or any other change in events, conditions or circumstances on which any such statement is based, except to the extent otherwise required by law.\nWe are a self-administered real estate investment trust, or REIT, that owns, operates, acquires, renovates, develops, redevelops, disposes of, and manages multifamily apartment communities in targeted markets located in the United States. We were formed in 1972 as a Virginia corporation. In June 2003, we changed our state of incorporation from Virginia to Maryland. Our subsidiaries include the Operating Partnership and the DownREIT Partnership.\nAt September 30, 2025, our consolidated real estate portfolio included 168 communities in 12 states plus the District of Columbia totaling 55,808 apartment homes. In addition, we have an ownership interest in 11,193 completed or to-be-completed apartment homes through unconsolidated joint ventures or partnerships, including 6,766 apartment homes owned by entities in which we hold preferred equity investments. The\nSame-Store Community\napartment home population for the three and nine months ended September 30, 2025, was 54,915 and 54,442, respectively.\n\nSame-Store Communities\nSame-Store Community\nproperties, those acquired, developed, and stabilized prior to July 1, 2024 (for quarter-to-date comparison) and January 1, 2024 (for year-to-date comparison) and held on September 30, 2025 consisted of 54,915 and 54,442 apartment homes, respectively, and provided 96.8% and 96.6% of our total NOI for the three and nine months ended September 30, 2025.\nThree Months Ended September 30, 2025 vs. Three Months Ended September30, 2024\nSame-Store Community\nproperties increased 2.3%, or $6.5 million, for the three months ended September 30, 2025 compared to the same period in 2024. The increase in property NOI was attributable to a\n2.6%, or $10.4 million, increase in property rental income, partially offset by a 3.1%, or $4.0 million, increase in operating expenses\n. The increase in property rental income was primarily driven by a 1.1%, or $4.1 million, increase in rental rates, an 8.5%, or $4.1 million, increase in reimbursement and other income and a 10.1%, or $1.4 million, decrease in vacancy loss. Weighted average physical occupancy increased by 0.3% to 96.6% and total monthly income per occupied home increased by 2.2% to $2,605.\nThe increase in operating expenses was primarily driven by a 3.5%, or $1.7 million increase in real estate taxes due to higher assessed valuations for certain properties, a 9.5%, or $0.9 million, increase in administration and marketing primarily due to the cost for providing property-wide Wi-Fi and a 4.7%, or $0.9 million, increase in utilities primarily due to an increase in energy costs.\nThe operating margin (property net operating income divided by property rental income) was 68.2% and 68.4% for the three months ended September 30, 2025 and 2024, respectively.\n\nForward-Looking Statements\nThis Report contains forward-looking statements within the meaning of Section 27A of the Securities Act of 1933 and Section 21E of the Securities Exchange Act of 1934, as amended (the “Exchange Act”). Such forward-looking statements include, without limitation, statements concerning property acquisitions and dispositions, development activity and capital expenditures, capital raising activities, rent growth, occupancy and rental expense growth. Words such as “expects,” “anticipates,” “intends,” “plans,” “likely,” “will,” “believes,” “seeks,” “estimates,” and variations of such words and similar expressions are intended to identify such forward-looking statements.\nThe following factors, among others, could cause our future results to differ materially from those expressed in the forward-looking statements:\ngeneral market and economic conditions;\nthe impact of inflation/deflation, tariffs, geopolitical tensions and government shutdowns;\nunfavorable changes in apartment market and economic conditions that could adversely affect occupancy levels and rental rates;\nthe failure of acquisitions, developments or redevelopments to achieve anticipated results;\npossible difficulty in selling apartment communities;\ncompetitive factors that may limit our ability to lease apartment homes or increase or maintain rents;\ninsufficient cash flow that could affect our debt financing and create refinancing risk;\nfailure to generate sufficient revenue, which could impair our debt service payments and distributions to stockholders;\ndevelopment and construction risks that may impact our profitability;\npotential damage from natural disasters, including hurricanes, fires, floods, ice storms and other weather-related events, which could result in substantial costs to us;\nrisks from climate change that impacts our properties or operations;\nrisks from extraordinary losses for which we may not have insurance or adequate reserves;\nrisks from cybersecurity breaches of our information technology systems and the information technology systems of our third party vendors and other third parties;\nthe availability of capital and the stability of the capital markets;\nchanges in job growth, home affordability and the demand/supply ratio for multifamily housing;\nthe failure of automation or technology to help grow net operating income;\nuninsured losses due to insurance deductibles, self-insurance retention, uninsured claims or casualties, or losses in excess of applicable coverage;\ndelays in completing developments and lease-ups on schedule or at expected rent and occupancy levels;\nour failure to succeed in new markets;\n\nAll $1.5 billion and $1.4 billion notes payable to UDR as of September 30, 2025 and December 31, 2024, respectively, and $14.7 million and $13.7 million of interest expense on notes payable to UDR for the three months ended September 30, 2025 and 2024, respectively, and $42.4 million and $39.9 million of interest expense on notes payable to UDR for the nine months ended September 30, 2025 and 2024, respectively, eliminate upon consolidation of UDR’s consolidated financial statements.\nCritical Accounting Policies and Estimates and New Accounting Pronouncements\nOur critical accounting policies are those having the most impact on the reporting of our financial condition and results and those requiring significant judgments and estimates. These policies include those related to (1) capital expenditures, (2) impairment of long-lived assets, (3) real estate investment properties, and (4) revenue recognition.\nStatements of Cash Flows\nThe following discussion explains the changes in\nNet cash provided by/(used in) operating activities\nNet cash provided by/(used in) investing activities\nNet cash provided by/(used in) financing activities\nthat are presented in our Consolidated Statements of Cash Flows for the nine months ended September 30, 2025 and 2024.\n\nNOI enhancing improvements are expenditures that we believe will result in increased income generation or decreased expense growth.\nMajor renovations include major structural changes and/or architectural revisions to existing buildings.\nTotal capital expenditures includes amounts capitalized during the year. Cash paid for capital expenditures is impacted by the net change in related accruals.\nAverage number of homes is calculated based on the number of homes outstanding at the end of each month.\nWe intend to continue to selectively add NOI enhancing improvements, which we believe will provide a return on investment in excess of our cost of capital. Our objective in redeveloping a community is twofold: we aim to meaningfully grow rental rates while also achieving cap rate compression through asset quality improvement.\nConsolidated Real Estate Under Development and Redevelopment\nAt September 30, 2025,\nour development pipeline consisted of one wholly-owned community totaling 300 apartment homes, none of which have been completed, with a budget of $133.6 million, in which we have a gross carrying value of $52.7 million. The homes are estimated to be completed during the second quarter of 2027\n. In addition, the Company is incurring and capitalizing costs direct"
}