{
  "source_file": "udr-20241231x10k.htm",
  "form_type": "10-K",
  "item1_clean": "and our portfolio strategy generally govern our review process on where and when to allocate development capital. At December 31, 2024, the Company was not developing any communities, although the Company was incurring and capitalizing costs directly related to predevelopment activities in preparation of future development commencements. During the year ended December 31, 2024, the Company completed the development of two communities located in Tampa, Florida and Addison, Texas, with a total of 415 apartment homes.\nRedevelopment Activities\nOur objective in redeveloping a community is twofold: we aim to grow rental rates while also producing a higher yielding and more valuable asset through asset quality improvement. During the year ended December 31, 2024, we incurred $51.4 million in major renovations, which included major structural changes and/or architectural revisions to existing buildings. As of December 31, 2024, the Company\nhad no communities at which it was conducting substantial redevelopment activities\nJoint Venture and Partnership Activities\nWe have entered into, and may continue in the future to enter into, joint ventures (including limited liability companies or partnerships) through which we own an indirect economic interest of less than 100% of the community or communities owned directly by such joint ventures. Our decision to either hold an apartment community in fee simple or have an indirect interest in the community through a joint venture is based on a variety of factors and considerations, including: (i) the economic and tax terms required by the seller of land or a community; (ii) our desire to diversify our portfolio of communities by market, submarket and product type; (iii) our desire at times to preserve our capital resources to maintain liquidity or balance sheet strength; and (iv) our projections, in some circumstances, that we will achieve higher returns on our invested capital or reduce our risk if a joint venture vehicle is used. Each joint venture agreement is individually negotiated, and our ability to operate and/or dispose of a community in our sole discretion may be limited to varying degrees depending on the terms of the joint venture agreement.\nMaintaining a Strong Balance Sheet\nWe maintain a capital structure that we believe allows us to proactively source potential investment opportunities in the marketplace. We have structured our debt maturity schedule to be able to opportunistically access both secured and unsecured debt markets when appropriate.\nAs part of our plan to finance our activities, we utilize proceeds from debt and equity offerings and refinancings to extend maturities, pay down existing debt, fund development and redevelopment activities, and acquire apartment communities.\nConsistently Driving Operational Excellence\nInvestment in new technologies continues to drive operating efficiencies in our business and helps us to better meet the changing needs of our business and our residents. Our residents can conduct business with us 24 hours a day, 7 days a week, including completing online leasing applications and renewals and submitting maintenance or other requests throughout our portfolio using our web-based resident internet portal or, increasingly, a smart-device application.\nAs a result of transforming our operations through technology, residents’ satisfaction has improved, and our operating teams have become more efficient. Web-based technologies have also resulted in declining marketing and advertising costs, improved cash management, and better pricing management of our available apartment homes.\nAdvancing a Strong Corporate Culture and Ensuring High Resident Satisfaction\nHuman Capital Management\nfor further information on the Company’s corporate culture.\nCompetitive Conditions\nCompetition for new residents is generally intense across our markets. Some competing communities offer amenities that our communities do not have. Competing communities can use rental concessions or lower rents to obtain temporary competitive advantages. Also, some competing communities are larger or newer than our communities. The competitive position of each community is different depending upon many factors, including sub-market supply and\n\nUDR is a self-administered real estate investment trust, or REIT, that owns, operates, acquires, renovates, develops, redevelops, disposes of, and manages multifamily apartment communities in targeted markets located in the United States. At December 31, 2024, our consolidated real estate portfolio consisted of 169 communities located in 21 markets, consisting of 55,696 completed apartment homes, which are held directly or through our subsidiaries, including the Operating Partnership and the DownREIT Partnership, and consolidated joint ventures. In addition, we have an ownership interest in 10,860 completed or to-be-completed apartment homes through unconsolidated joint ventures or partnerships, including 6,436 apartment homes owned by entities in which we hold preferred equity investments. At December 31, 2024, the Company was not developing any communities, although the Company was incurring and capitalizing costs directly related to predevelopment activities in preparation of future development commencements. During the year ended December 31, 2024, the Company completed the development of two communities located in Tampa, Florida and Addison, Texas, with a total of 415 apartment homes.\nUDR has elected to be taxed as a REIT under the Internal Revenue Code of 1986, as amended, which we refer to in this Report as the “Code.” To continue to qualify as a REIT, we must continue to meet certain tests which, among other things, generally require that our assets consist primarily of real estate assets, our income be derived primarily from real estate assets, and that we distribute at least 90% of our REIT taxable income (other than our net capital gains) to our stockholders annually. As a REIT, we generally will not be subject to U.S. federal income taxes at the corporate level on our net income to the extent we distribute such net income to our stockholders annually. In 2024, we declared total distributions of $1.70 per common share and paid dividends of $1.695 per common share.\n\nThroughout 2024, the talent development team assessed the current training curriculum, audited the quality of existing content, and began documenting opportunities for improvement. As we look to the future, our long-term strategy will focus on UDR-developed content that supports the enhancement of skills and competencies at all levels and emphasizes personalized learning paths, ongoing development opportunities, and career progression.\nDuring 2024, we introduced two digital customer experience service training courses and subsequent leader guides to approximately 1,200 associates to improve overall customer service skills and increase resident satisfaction and loyalty. In addition, more than 450 UDR associates completed a DiSC assessment, which is a personality tool that measures preferences and tendencies, not skill or ability. Finally, in 2024 more than 400 leaders across the Company participated in in-person experiential training, leveraging hands-on learning activities to improve team effectiveness, trust, communication, and collaboration.\nIn total, over 6,000 training courses are available to our associates, spanning topics such as leasing skills, property maintenance, customer service, project management, and leadership development. In 2024, our associates collectively invested 38,225 hours in training, averaging 27 hours per full time associate. By the end of 2024, 90% of associates had completed annual IT security training, fair housing, harassment, workplace violence, diversity and inclusion, and business ethics training.\n\nOur principal business objective is to maximize the economic returns of our apartment communities in a sustainable manner to provide our stockholders with the greatest possible total return and value. To achieve this objective, we intend to continue to pursue the following goals and strategies:\nown and operate a diversified portfolio of apartments in targeted markets in the United States, which are characterized by strong total income growth, high working age population growth, relatively robust rental versus single-family home affordability and favorable demand/supply ratio for multifamily housing, thus enhancing stability and predictability of returns to our stockholders;\nmanage real estate cycles by taking an opportunistic approach to buying, selling, renovating, redeveloping, and developing apartment communities;\nempower our associates to manage our communities efficiently and effectively to improve resident satisfaction;\nmeasure and reward associates based on specific performance targets; and\nmanage our capital structure with the intent of lowering our relative cost of capital to enhance profitability and predictability of liquidity, earnings and dividends.\nCommitment to Shareholders\n\ngeographic location, including proximity to jobs, entertainment, transportation, and our existing communities which can deliver significant economies of scale;\nour climate assessments for the market and sub-market in which the property is located;\nconstruction quality, condition, design and sustainability features of, or the potential to implement sustainability initiatives at, the property;\ncurrent and projected cash flow of the property and the ability to increase cash flow;\nability of the property’s projected returns to exceed our cost of capital;\npotential for capital appreciation of the property;\nability to increase the value and profitability of the property through operations and redevelopment;\nterms of resident leases, including the potential for rent increases;\noccupancy and demand by residents for properties of a similar type in the vicinity;\nprospects for liquidity through sale, financing or refinancing of the property; and\ncompetition from existing multifamily communities and the potential for the construction of new multifamily properties in the area.\nWe regularly monitor our assets to increase the quality and performance of our portfolio. Factors we consider in deciding whether to dispose of a property include:\nwhether it is in a market targeted for divestment or a reduction in investment;\ncurrent market price for an asset compared to projected economics for that asset;\npotential increases in new construction in the market area;\nareas with low job growth prospects;\nnear- and long-term capital expenditure needs for the asset; and\noperating efficiencies.\nThe following table summarizes our apartment community acquisitions and dispositions and our consolidated year-end ownership position for the past five years (\ndollars in thousands\n\ndemand. In addition, other real estate investors compete with us to acquire existing properties, redevelop existing properties, and to develop new properties. These competitors include insurance companies, pension and investment funds, public and private real estate companies, investment companies and other public and private apartment REITs, some of which may have greater resources, or lower capital costs, than we do.\nWe believe that, in general, we are well-positioned to compete effectively for residents and investments. We believe our competitive advantages include:\na fully integrated organization with property management, development, redevelopment, acquisition, marketing, sales and financing expertise;\nscalable operating and support systems, which include automated systems to meet the changing needs of our residents and to effectively focus on our internet-based marketing efforts;\naccess to diversified sources of capital;\ngeographic diversification with a presence in 21 markets across the country; and\nsignificant presence in many of our major markets that allows us to be a local operating expert.\nMoving forward, we will continue to improve lease management, improve exp",
  "item7_clean": "annual market increases for personnel compensation during the year ended December 31, 2024, as compared to the same period in 2023;\nan increase in casualty-related charges/(recoveries), net of $12.0 million primarily attributable to an increase in claim charges due to severe weather events and a decrease in insurance recoveries during the year ended December 31, 2024 as compared to the same period in 2023; and\nan increase in other operating expenses of $10.2 million primarily attributable to an increase in legal-related expenses and political contributions during the year ended December 31, 2024, as compared to the same period in 2023.\nThis was partially offset by:\nan increase in total property NOI of $24.1 million primarily due to\nhigher revenue per occupied home, an increase in weighted average physical occupancy, and NOI from additional operating communities,\npartially offset by an increase in property operating expenses and a decrease from communities sold during 2023 and 2024;\na decrease in net income attributable to redeemable noncontrolling interests in the Operating Partnership and DownREIT Partnership of $23.9 million primarily attributed to the noncontrolling interests’ share of the gain from the partial sale of four operating communities located in various markets and the sale of an operating community located in Hillsboro, Oregon during the year ended December 31, 2023, as compared to the sale of one operating community located in Arlington, Virginia in the same period of 2024; and\nan increase in income/(loss) from unconsolidated entities of $15.5 million primarily attributable to a $24.3 million loss on consolidation related to one of the Company’s preferred equity investments being consolidated during the year ended December 31, 2023, partially offset by an $8.1 million non-cash impairment loss on one of the Company’s preferred equity investments during the year ended December 31, 2024\nApartment Community Operations\nOur net income results are primarily from NOI generated from the operation of our apartment communities. The Company defines NOI, which is a non-GAAP financial measure, as rental income less direct property rental expenses. Rental income represents gross market rent less adjustments for concessions, vacancy loss and bad debt. Rental expenses include real estate taxes, insurance, personnel, utilities, repairs and maintenance, administrative and marketing. Excluded from NOI is property management expense, which is calculated as 3.25% of property revenue, and land rent. Property management expense covers costs directly related to consolidated property operations, inclusive of corporate management, regional supervision, accounting and other costs.\nManagement considers NOI a useful metric for investors as it is a more meaningful representation of a community’s continuing operating performance than net income as it is prior to corporate-level expense allocations, general and administrative costs, capital structure and depreciation and amortization.\nAlthough the Company considers NOI a useful measure of operating performance, NOI should not be considered an alternative to net income or net cash flow from operating activities as determined in accordance with GAAP. NOI excludes several income and expense categories as detailed in the reconciliation of NOI to\nNet income/(loss) attributable to UDR, Inc.\n\nan 8.3%, or $13.4 million, increase in reimbursement and ancillary and fee income. Weighted average physical occupancy increased by 0.1% to 96.8% and total monthly income per occupied home increased 2.2% to $2,554.\nThe increase in operating expenses was primarily driven by an 11.0%, or $6.7 million, increase in personnel costs primarily due to annual market increases and a refundable payroll tax credit related to the Employee Retention Credit program in 2023, a 5.1%, or $4.6 million, increase in repair and maintenance expense due to an increase in the cost per home of those that were turned during the year, the impact of inflation on third party vendor costs and weather-related events, a 12.6%, or $3.8 million, increase in administration and marketing primarily due to the cost for providing property-wide Wi-Fi, and a 1.8%, or $3.3 million, increase in real estate taxes due to higher assessed valuations.\nThe operating margin (property net operating income divided by property rental income) was 69.0% and 69.6% for the years ended December 31, 2024 and 2023, respectively.\nNon-Mature Communities/Other\nNon-Mature Communities/Other\nrepresent those communities that do not meet the criteria to be included in\nSame-Store Communities\n, which include communities recently developed or acquired, redevelopment properties, sold or held for disposition properties, and non-apartment components of mixed use properties.\nThe remaining 7.6%, or $86.4 million, of our total NOI during the year ended December 31, 2024 was generated from our\nNon-Mature Communities/Other\nNon-Mature Communities/Other\nincreased by 11.3%, or $8.8 million, for the year ended December 31, 2024 as compared to the same period in 2023. The increase was primarily attributable to a $24.2 million increase in NOI from stabilized, non-mature communities, primarily due to development communities completed becoming stabilized and communities acquired in 2023 being owned for the full year, and a $5.1 million increase in non-residential/other NOI primarily due to higher retail tenant rents, partially offset by a $22.8 million decrease in sold and held for disposition communities NOI due to the sale of an operating community and two operating communities being held for disposition during the year ended December 31, 2024 as compared to the sale of one operating community, one operating community held for disposition during the year ended December 31, 2023, and the partial sale of four operating communities in 2023.\nGain/(Loss) on Sale of Real Estate Owned\nDuring the year ended December 31, 2024, the Company recognized a gain of $16.9 million from the sale of one operating community located in Arlington, Virginia.\nDuring the year ended December 31, 2023, the Company recognized a gain of $351.2 million from the partial sale of four operating communities located in various markets and the sale of an operating community located in Hillsboro, Oregon.\nInterest income and other income/(expense)\nFor the years ended December 31, 2024 and 2023, the Company recognized interest income and other income/(expense), net of $(12.3) million and $17.8 million, respectively. The decrease of\n$30.1 million was primarily due to a $37.3 million non-cash loan reserve related to one of the Company’s joint venture loan investments during the year end December 31, 2024,\nwhich was due to the Company’s assessment of the borrower’s ability to make future scheduled payments on the senior loan and a decrease in the value of the operating community,\npartially offset by a $9.7 million increase in interest income from our notes receivables primarily due to higher outstanding balances during the year ended December 31, 2024\n, as compared the same period in 2023\n\nFor the years ended December 31, 2024 and 2023, the Company recognized interest expense of $195.7 million and $180.9 million, respectively. The increase in 2024 as compared to 2023 was primarily due to higher overall debt balances during the year ended December 31, 2024, as compared the same period in 2023.\nGeneral and administrative\nFor the years ended December 31, 2024 and 2023, the Company recognized general and administrative expense of $84.3 million and $69.9 million, respectively. The increase of $14.4 million was primarily attributable to severance benefits associated with the retirement of an executive officer and the reorganization of certain departments, higher incentive and bonus accruals primarily driven by better Company performance, and annual market increases for personnel compensation during the year ended December 31, 2024, as compared to the same period in 2023.\nCasualty-related charges/(recoveries), net\nFor the years ended December 31, 2024 and 2023, the Company recognized casualty-related charges/(recoveries), net of $15.2 million and $3.1 million, respectively. The increase of $12.0 million was primarily attributable to an increase in claim charges due to severe weather events and a decrease in insurance recoveries during the year ended December 31, 2024 as compared to the same period in 2023.\nOther operating expenses\nFor the years ended December 31, 2024 and 2023, the Company recognized other operating expenses of $30.4 million and $20.2 million, respectively. The increase of $10.2 million was primarily attributable to an increase in legal-related expenses and political contributions during the year ended December 31, 2024, as compared to the same period in 2023.\nNoncontrolling Interest\nFor the years ended December 31, 2024 and 2023, the Company recognized net income attributable to redeemable noncontrolling interests in the Operating Partnership and DownREIT Partnership of $6.2 million and $30.1 million, respectively. The decrease in 2024 as compared to 2023 was\nprimarily attributed to the noncontrolling interests’ share of a gain from the sale of an operating community in Arlington, Virginia during the year ended December 31, 2024, as compared to the noncontrolling interests’ share of the gains from the partial sale of four operating communities located in various markets and a gain form the sale of an operating community located in Hillsboro, Oregon during the year ended December 31, 2023.\nIncome/(Loss) from Unconsolidated Entities\nDuring the year ended December 31, 2024, the Company recognized income/(loss) from unconsolidated entities of $20.2 million, which was primarily\ndue to net income from our operating joint ventures and preferred equity investments, partially offset by an $8.1 million non-cash impairment loss on one of the Company’s preferred equity investments\nDuring the year ended December 31,\n2023, the Company recognized income/(loss) from unconsolidated entities of $4.7 million, which was primarily\ndue to net income from our operating joint ventures and preferred equity investments, partially offset by a $24.3 million loss on consolidation of one of our\npreferred equity investments\nInflation primarily impacts our results of operations as a result of wage pressures and increases in utilities and repair and maintenance costs. In addition, inflation could also impact our general and administrative expenses, the interest on our debt if variable or refinanced in a high-inflationary environment, our cost of capital, and our cost of development, redevelopment, maintenance or other operating activities. However, the majority of our apartment leases have initial terms of 12 months or less, which in an inflationary environment, and absent other factors such as increased supply, generally enables us to compensate for inflationary effects by increasing rents on our apartment homes. Although an extreme or sustained escalation in costs could have a negative impact on our residents and their ability to absorb rent increases, we do not believe this had a material impact on our results for the year ended December 31, 2024\n\nInvestment in Unconsolidated Entities\nWe may enter into various joint venture agreements and/or partnerships with unrelated third parties to hold or develop real estate assets. We must determine for each of these ventures whether to consolidate the entity or account for our investment under the equity method of accounting. We determine whether to consolidate a joint venture or partnership based on our rights and obligations under the venture agreement, applying the applicable accounting guidance. The application of the rules in evaluating the accounting treatment for each joint venture or partnership is complex and requires substantial management judgment. We evaluate our accounting for investments on a regular basis including when a significant change in the design of an entity occurs. Throughout our financial statements, and in this Management’s Discussion and Analysis of Financial Condition and Results of Operations, we use the term “joint venture” or “partnership” when referring to investments in entities in which we do not have a 100% ownership interest.\nWe continually evaluate our investments in unconsolidated joint ventures when events or changes in circumstances indicate that there may be an other-than-temporary decline in value. We consider various factors to determine if a decrease in the value of the investment is other-than-temporary. These factors include, but are not limited to, age of the venture, our intent and ability to retain our investment in the entity, the financial condition and long-term prospects of the entity, and the relationships with the other joint venture partners and its lenders. The amount of loss recognized is the excess of the investment’s carrying amount over its estimated fair value. If we believe that the decline in fair value is temporary, no impairment is recorded. The aforementioned factors are taken as a whole by management in determining the valuation of our investment property. Should the actual results differ from management’s judgment, the valuation could be negatively affected and may result in a negative impact to our Consolidated Financial Statements.\nImpairment of Long-Lived Assets\nQuarterly or when changes in circumstances warrant, we will assess our real estate properties for indicators\nof impairment. The judgments regarding the existence of impairment indicators are based on certain factors. Such factors include, among other things, operational performance, market conditions, the Company’s intent and ability to hold the related asset, as well as any significant cost overruns on development properties.\nIf a real estate property has indicators of impairment, we assess whether the long-lived asset’s carrying value exceeds the community’s undiscounted future cash flows, which is representative of projected net operating income (“NOI”) plus the residual value of the community. Our future cash flow estimates are based upon historical results adjusted to reflect our best estimate of future market and operating conditions and our estimated holding periods. If such indicators of impairment are present and the carrying value exceeds the undiscounted cash flows of the community, an impairment loss is recognized equal to the excess of the carrying amount of the asset over its estimated fair value. Our estimates of fair value represent our best estimate based primarily upon unobservable inputs related to rental rates, operating costs, growth rates, discount rates, capitalization rates, industry trends and reference to market rates and transactions.\nFor long-lived assets to be disposed of, impairment losses are recognized when the fair value of the asset less estimated cost to sell is less than the carrying value of the asset. Properties classified as real estate held for disposition generally represent properties that are actively marketed or contracted for sale with the closing expected to occur within the next twelve months. Real estate held for disposition is carried at the lower of cost, net of accumulated depreciation, or fair value, less the cost to sell, determined on an asset-by-asset basis. Expenditures for ordinary repair and maintenance costs on held for disposition properties are charged to expense as incurred. Expenditures for improvements, renovations, and replacements related to held for disposition properties are capitalized at cost. Depreciation is not recorded on real estate held for disposition.\nReal Estate Investment Properties\nWe purchase real estate investment properties from time to time and record the fair value to various components, such as land, buildings, and intangibles related to in-place leases, based on the fair value of each component. In making estimates of fair values for purposes of allocating purchase ",
  "item2_clean": null
}