{
  "source_file": "uhs-20241231.htm",
  "form_type": "10-K",
  "item1_clean": "Changes in laws or policies governing the terms of foreign trade, and in particular increased trade restrictions, tariffs or taxes on imports from where our import products or materials (either directly or through our suppliers) could have an impact on our competitive position, business operations and financial results. In February 2025, the U.S. government imposed or threatened to impose new tariffs, including on imported products from Mexico, Canada and China. The impact of these tariffs is subject to a number of factors, including the effective date and duration of such tariffs, changes in the amount, scope and nature of the tariffs in the future, any retaliatory responses to such actions that the target countries may take and any mitigating actions that may become available. If significant tariffs or other restrictions are imposed on our imported pharmaceutical ingredients, medical devices, medical equipment and their ingredients and components, there could be significant strain on our supply chains, causing major disruptions in procurement processes and contract negotiations with suppliers due to increased costs, pricing volatility, longer procurement lead times and supply shortages stemming from increased production costs and import restrictions. As a result, we have to attempt to shift increased costs onto insurers and patients (in the form of higher service charges), reduce procurement volumes and delay equipment upgrades to mitigate financial strain. While we continue to evaluate the potential impact of the new tariffs on our business, given the uncertainty regarding the scope and duration of any new tariffs, as well as the potential for additional tariffs or trade barriers by the U.S., Mexico, Canada, China or other countries, we can provide no assurance that any strategies we implement to mitigate the impact of such tariffs or other trade actions will be successful.\n\na potentially higher risk of experiencing events such as severe weather conditions and earthquakes. Given the location of our facilities, we are particularly susceptible to revenue loss, cost increase, or damage caused by severe weather conditions or natural disasters such as hurricanes, wildfires, earthquakes, or tornadoes. Any significant loss due to a natural disaster may not be covered by insurance and may lead to an increase in the cost of insurance or unavailability on acceptable terms. Climate change may also have effects on our business by increasing the cost of property insurance or making coverage unavailable on acceptable terms. To the extent that significant changes in the climate occur in areas where our facilities are located, we may experience increased frequency of severe weather conditions or natural disasters or other changes to weather patterns, all of which may result in physical damage to or a decrease in demand for properties affected by these conditions. Should the impact of climate change be material in nature or occur for lengthy periods of time, our financial condition, revenues, results of operations, or cash flow may be adversely affected. In addition, government regulation intended to mitigate the impact of climate change, severe weather patterns, or natural disasters could result in additional required capital expenditures to comply with such regulation without a corresponding increase in our revenues. In addition, technological developments and pharmaceutical improvements may reduce the demand for healthcare services or the profitability of the services we offer.\n\nOur patient volumes, revenues and financial results depend significantly on the universe of patients with health insurance, which to a large extent is dependent on the employment status of individuals in our markets. Worsening of economic conditions, including inflation and rising interest rates, may result in a higher unemployment rate which may increase the number of individuals without health insurance. As a result, our facilities may experience a decrease in patient volumes, particularly in less intense, more elective service lines, or an increase in services provided to uninsured patients. These factors could have a material unfavorable impact on our future patient volumes, revenues and operating results.\n\nWe rely extensively on our information technology (“IT”) systems to manage clinical and financial data, communicate with our patients, payers, vendors and other third parties and summarize and analyze operating results. In addition, we have made significant investments in technology to adopt and utilize electronic health records and to become meaningful users of health information technology pursuant to the American Recovery and Reinvestment Act of 2009. Our IT systems, and the networks and information systems of third parties that we rely on, are subject to damage or interruption from power outages, facility damage, computer and telecommunications failures, computer viruses, security breaches including credit card or personally identifiable information breaches, vandalism, theft, natural disasters, catastrophic events, human error and potential cyber threats, including malicious codes, worms, phishing attacks, denial of service attacks, ransomware and other sophisticated cyber-attacks, and our disaster recovery planning cannot account for all eventualities. Our systems, in turn, interface with and rely on third-party systems that we do not control, including medical devices and other processes supporting the interoperability of healthcare infrastructures. Third parties to whom we outsource certain of our functions, or with whom our systems interface and who may, in some instances, store our sensitive and confidential data, are also subject to the risks outlined above and may not have or use controls effective to protect such information. An attack, breach or other system disruption affecting any of these third parties could similarly harm our business.\n\nCumberland Hospital for Children and Adolescents (“Cumberland”), an indirect subsidiary of the Company, is a defendant in multi-plaintiff lawsuits filed in the Circuit Court for Richmond, Virginia (the “Cumberland Litigation”), relating to allegations of inappropriate sexual contact during medical examinations by Dr. Daniel Davidow, an independent contractor and the former medical director for Cumberland. The Company and UHS of Delaware, Inc., our administrative services subsidiary (“UHS Delaware”), were also named as co-defendants in the Cumberland Litigation. Plaintiffs have asserted claims of negligence, assault and battery (against Dr. Davidow), false imprisonment, violations of the Virginia Consumer Protection Act (“VCPA”), and vicarious liability for Dr. Davidow’s conduct against Cumberland, the Company, and UHS Delaware. The Company and UHS Delaware were dismissed from the action during the trial, which occurred in September, 2024. On September 27, 2024, a jury entered a verdict finding Dr. Davidow and Cumberland liable and awarded these three plaintiffs combined compensatory damages of $60 million for all liability theories, an additional combined $180 million in trebled damages for violation of the VCPA, and an additional combined $120 million in punitive damages. Cumberland is evaluating all legal options and intends to challenge this verdict, including the amounts awarded in the verdict, in post-trial proceedings and on appeal. Based upon Virginia law, we expect that the punitive damage amount should be reduced to a combined maximum of $1.05 million as a matter of law. There are approximately 40 additional plaintiffs making similar allegations with claims pending in the Cumberland Litigation. We expect that the trials for the remaining plaintiffs, as well as any additional plaintiffs, will be scheduled at various times over the next several years and will continue to be tried in small groups.\n\nCertain states in which we operate hospitals have certificates of need (“CON”) laws as a condition prior to hospital capital expenditures, construction, expansion, modernization or initiation of major new services. Our failure to obtain necessary state approval could result in our inability to complete a particular hospital acquisition, expansion or replacement, make a facility ineligible to receive reimbursement under the Medicare or Medicaid programs, result in the revocation of a facility’s license or impose civil or criminal penalties on us, any of which could harm our business.\n\nOur ability to repurchase shares will depend upon, among other factors, our cash flows from operations, our available capital and potential future capital requirements for strategic transactions, including acquisitions, debt service requirements, and investing in our existing markets as well as our results of operations, financial condition, interest rates, our access to the capital markets and other factors beyond our control that our Board of Directors may deem relevant. A suspension or elimination of our share repurchase could have a negative effect on our stock price.\n\nOur revenues and volume trends are dependent on many factors, including physicians’ clinical decisions and availability, payer programs shifting to a more outpatient-based environment, whether or not certain services are offered, seasonal and severe weather conditions, including the effects of extreme low temperatures, hurricanes and tornadoes, earthquakes, climate change, current local economic and demographic changes. We have a high concentration of facilities in various geographic areas, including states that have\n\nWe are experiencing inflationary pressures, primarily in personnel costs, and we anticipate continuing impacts on other cost areas within the next twelve months. The extent of any future impacts from inflation on our business and our results of operations will be dependent upon how long the elevated inflation levels persist and the extent to which the rate of inflation further increases, if at all, neither of which we are able to predict. If elevated levels of inflation were to persist or if the rate of inflation were to accelerate, our expenses could increase faster than anticipated and we may utilize our capital resources sooner than expected. Further, given the complexities of the reimbursement landscape in which we operate, our ability to pass on increased costs associated with providing healthcare to Medicare and Medicaid patients is limited due to various federal, state and local laws, which in certain circumstances, limit our ability to increase prices, commercial payers may be unwilling or unable to increase reimbursement rates commensurate with the inflationary impacts on our costs.\n\nConversely, as a potential means of generating additional funds to operate and expand our business, we may from time-to-time issue equity through the sale of stock which would increase the number of outstanding shares of our Class B Common Stock. Based upon factors such as, but not limited to, the market price of our stock, interest rate on borrowings and uses or potential uses for cash, repurchase or issuance of our stock could have a dilutive effect on our future basic and diluted earnings per share.\n\nIn particular, government investigations, as well as qui tam and stockholder lawsuits, may lead to material fines, penalties, damages payments or other sanctions, including exclusion from government healthcare programs. The federal False Claims Act permits private parties to bring qui tam, or whistleblower, lawsuits on behalf of the government against companies alleging that the defendant has defrauded the federal government. These private parties are entitled to share in any amounts recovered by the government, and, as a result, the number of whistleblower lawsuits that have been filed against providers has increased significantly in recent years. Because qui tam lawsuits are filed under seal, we could be named in one or more such lawsuits of which we are not aware. Settlements of lawsuits involving",
  "item7_clean": "the healthcare industry is labor intensive and salaries, wages and benefits are subject to inflationary pressures, as are supplies expense and other operating expenses. In the past, staffing shortages have, at times, required us to hire expensive temporary personnel and/or enhance wages and benefits to recruit and retain nurses and other clinical staff and support personnel. At certain facilities, particularly within our behavioral health care segment, there have been occasions when we were unable to fill all vacant positions and, consequently, we were required to limit patient volumes. We have also experienced general inflationary cost increases related to certain of our other operating expenses. Many of these factors, which had a material unfavorable impact on our results of operations in prior years, have moderated more recently. However, we cannot predict future inflationary increases, which if significant, could have a material unfavorable impact on our future results of operations. We have experienced inflationary pressures, primarily in personnel costs, although those pressures have moderated more recently. The extent of any future impacts from inflation on our business and our results of operations will be dependent upon how long the elevated inflation levels persist and the extent to which the rate of inflation further increases, if at all, neither of which we are able to predict. If elevated levels of inflation were to persist or if the rate of inflation were to accelerate, our expenses could increase faster than anticipated and we may utilize our capital resources sooner than expected. Further, given the complexities of the reimbursement landscape in which we operate, our ability to pass on increased costs associated with providing healthcare to Medicare and Medicaid patients is limited due to various federal, state and local laws, which in certain circumstances, limit our ability to increase prices;\n\nWe are experiencing inflationary pressures, primarily in personnel costs, and we anticipate continuing impacts on other cost areas within the next twelve months. The extent of any future impacts from inflation on our business and our results of operations will be dependent upon how long the elevated inflation levels persist and the extent to which the rate of inflation further increases, if at all, neither of which we are able to predict. If elevated levels of inflation were to persist or if the rate of inflation were to accelerate, our expenses could increase faster than anticipated and we may utilize our capital resources sooner than expected. Further, given the complexities of the reimbursement landscape in which we operate, our ability to pass on increased costs associated with providing healthcare to Medicare and Medicaid patients is limited due to various federal, state and local laws, which in certain circumstances, limit our ability to increase prices, commercial payers may be unwilling or unable to increase reimbursement rates commensurate with the inflationary impacts on our costs.\n\nWe cannot predict the degree to which we will be affected by the future availability or cost of attracting and retaining talented medical support staff. If our general labor and related expenses increase, we may not be able to raise our rates correspondingly. Our failure to either recruit and retain qualified hospital management, nurses and other medical support personnel or control our labor costs could harm our results of operations.\n\nOther operating expenses increased by $214 million, or 9.9%, during 2024, as compared to 2023. Operating expenses incurred by our commercial health insurer, consisting primarily of medical costs, increased by $69 million during 2024, as compared to 2023. In addition, as discussed above in\nResults of Operations-Adjustments to Self-Insured Professional and General Liability Reserves\n, included in the other operating expenses of our acute care hospital services during 2024, as compared to 2023, was a $36 million increase in the adjustments made to our self-insured professional and general liability reserves that was applicable to our acute care facilities. Excluding these expense items from each year, other operating expenses increased by $109 million, or 6.3%. Contributing to the increase during 2024, as compared to 2023, were the expenses incurred in connection with the increase in patient volumes. As a percentage of net revenues, other operating expenses increased to 27.8% during 2024, as compared to 27.4% during 2023.\n\nWe have experienced inflationary pressures, primarily in personnel costs, although those pressures have moderated more recently. The extent of any future impacts from inflation on our business and our results of operations will be dependent upon how long the elevated inflation levels persist and the extent to which the rate of inflation further increases, if at all, neither of which we are able to predict. If elevated levels of inflation were to persist or if the rate of inflation were to accelerate, our expenses could increase faster than anticipated and we may utilize our capital resources sooner than expected. Further, given the complexities of the reimbursement landscape in which we operate, our ability to pass on increased costs associated with providing healthcare to Medicare and Medicaid patients is limited due to various federal, state and local laws, which in certain circumstances, limit our ability to increase prices.\n\nOther operating expenses increased $94 million, or 8.0%, during 2024, as compared to 2023. Included in the increase, as discussed above in\nResults of Operations-Adjustments to Self-Insured Professional and General Liability Reserves\n, included in the other operating expenses of our behavioral health care services during 2024, as compared to 2023, was an $18 million increase in the adjustments made to our self-insured professional and general liability reserves that was applicable to our behavioral health facilities. As a percentage of net revenues during each year, other operating expenses decreased to 18.8% during 2024 as compared to 19.3% during 2023.\n\nIn addition, we also: (i) own commercial health insurers headquartered in Nevada and Puerto Rico, and; (ii) maintain self-insured employee benefits programs for employee healthcare and dental claims. The ultimate costs related to these programs/operations include expenses for claims incurred and paid in addition to an accrual for the estimated expenses incurred in connection with claims incurred but not yet reported. Given our significant insurance-related exposure, there can be no assurance that a sharp increase in the number and/or severity of claims asserted against us will not have a material adverse effect on our future results of operations.\n\nRevenue and volume trends may be affected by seasonal and severe weather conditions, including the effects of extreme low temperatures, hurricanes and tornadoes, earthquakes, climate change, current local economic and demographic changes. We have a high concentration of facilities in various geographic areas, including states that have a potentially higher risk of experiencing events such as severe weather conditions and earthquakes. Given the location of our facilities, we are particularly susceptible to revenue loss, cost increase, or damage caused by severe weather conditions or natural disasters such as hurricanes, wildfires, earthquakes, or tornadoes. Any significant loss due to a natural disaster may not be covered by insurance and may lead to an increase in the cost of insurance or unavailability on acceptable terms. Climate change may also have effects on our business by increasing the cost of property insurance or making coverage unavailable on acceptable terms. To the extent that significant changes in the climate occur in areas where our facilities are located, we may experience increased frequency of severe weather conditions or natural disasters or other changes to weather patterns, all of which may result in physical damage to or a decrease in demand for properties affected by these conditions. Should the impact of climate change be material in nature or occur for lengthy periods of time, our financial condition, revenues, results of operations, or cash flow may be adversely affected.\n\nWe derive a significant portion of our revenue from third-party payers, including the Medicare and Medicaid programs. Changes in these government programs in recent years have resulted in limitations on reimbursement and, in some cases, reduced levels of reimbursement for healthcare services. Payments from federal and state government programs are subject to statutory and regulatory changes, administrative rulings, interpretations and determinations, requirements for utilization review, and federal and state funding restrictions, all of which could materially increase or decrease program payments, as well as affect the cost of providing service to patients and the timing of payments to facilities. Changes resulting from the outcome of the 2024 elections may include increased reliance on Medicare Advantage programs, work requirements for Medicaid waiver program eligibility, increased focus on hospital outpatient site neutral payment policies, and similar initiatives that may reduce the availability of funding for federal healthcare programs or make eligibility for benefits more difficult. There have been proposals to substantially decrease federal funding for state Medicaid Programs. Any significant reduction in federal Medicaid funding to states would likely result in states reducing Medicaid payments to us which would have a material adverse effect on us. We are unable to predict the effect of recent and future policy changes on our operations. In addition, the uncertainty and fiscal pressures placed upon federal and state governments as a result of, among other things, deterioration in general economic conditions and the funding requirements from the federal healthcare reform legislation, may affect the availability of taxpayer funds for Medicare and Medicaid programs. In addition, the vast majority of the net revenues generated at our behavioral health facilities located in the United Kingdom are derived from governmental payers. If the rates paid or the scope of services covered by governmental payers in the United States or United Kingdom are reduced, there could be a material adverse effect on our business, financial position and results of operations.\n\nCollection of receivables from third-party payers and patients is our primary source of cash and is critical to our operating performance. Our primary collection risks relate to uninsured patients and the portion of the bill that is the patient’s responsibility, which primarily includes co-payments and deductibles. However, we also have substantial receivables due to us from certain state-based funding programs. We estimate our provisions for doubtful accounts based on general factors such as payer mix, the agings of the receivables, historical collection experience and assessment of probability of future collections. We routinely review accounts receivable balances in conjunction with these factors and other economic conditions that might ultimately affect the collectability of the patient accounts and make adjustments to our allowances as warranted. Significant changes in business office operations, payer mix, economic conditions or trends in federal and state governmental health coverage could affect our collection of accounts receivable, cash flow and results of operations. If we experience unexpected increases in the growth of uninsured and underinsured patients or in bad debt expenses, our results of operations will be harmed.\n\nControls imposed by third-party payers designed to reduce admissions and lengths of stay, commonly referred to as “utilization review,” have affected and are expected to continue to affect our facilities. Utilization review entails the review of the admission and course of treatment of a patient by managed care plans. Inpatient utilization, average lengths of stay and occupancy rates continue to be negatively affected by payer-required preadmission authorization and utilization review and by payer pressure to maximize outpatient and alternative healthcare delivery services for less acutely ill patients. Efforts to impose more stringent cost controls are expected to continue. In addition, we have been experiencing increasing rates of denied claims (“denials”) from managed care payers, including managed Medicare, which have reduced our net revenues and increased our operating costs as we devote additional resources to enhanced documentation and collection efforts. Although we cannot predict the effect these factors will have on our operations, significant limits on the scope of services reimbursed, and reimbursements withheld due to denials, could have a material adverse effect on our business, financial position and results of operations.\n\na potentially higher risk of experiencing events such as severe weather conditions and earthquakes. Given the location of our facilities, we are particularly susceptible to revenue loss, cost increase, or damage caused by severe weather conditions or natural disasters such as hurricanes, wildfires, earthquakes, or tornadoes. Any significant loss due to a natural disaster may not be covered by insurance and may lead to an increase in the cost of insurance or unavailability on acceptable terms. Climate change may also have effects on our business by increasing the cost of property insurance or making coverage unavailable on acceptable terms. To the extent that significant changes in the climate occur in areas where our facilities are located, we may experience increased frequency of severe weather conditions or natural disasters or other changes to weather patterns, all of which may result in physical damage to or a decrease in demand for properties affected by these conditions. Should the impact of climate change be material in nature or occur for lengthy periods of time, our financial condition, revenues, results of operations, or cash flow may be adversely affected. In addition, government regulation intended to mitigate the impact of climate change, severe weather patterns, or natural disasters could result in additional required capital expenditures to comply with such regulation without a corresponding increase in our revenues. In addition, technological developments and pharmaceutical improvements may reduce the demand for healthcare services or the profitability of the services we offer.\n\nTo address cybersecurity risks facing our organization, we have adopted a “continuous risk assessment” process. We engage a\nto conduct a bi-annual National Institute of Technology-Cyber Security Framework assessment to determine the effectiveness of our program and related controls. The results of that assessment are shared with management, which drives prioritization and investment in resources to address those risks. Likewise, annual penetration tests occur to review the efficacy of our technical controls, results which are reviewed by management and resolved in a timely manner. Other factors that feed into our risk management practices are also operational events and incidents, which can lead to controls being reviewed and enhanced.\nWe also have a mature incident response process in place in the event a cybersecurity incident occurs. This process defines roles, responsibilities and action plans designed to contain and eradicate the issue and then restore systems in the event of a major disruption. Regularly, we conduct tabletop exercises to simulate responses to an incident and implement any insight gained from those exercises to improve our recovery practices. As part of these processes, we regularly engage with assessors, consultants, auditors, and other third parties to review our cybersecurity program to help identify",
  "item2_clean": null
}