{
  "source_file": "ulta-20250201x10k.htm",
  "form_type": "10-K",
  "item1_clean": "efficient processes designed for e-commerce order fulfillment. In addition to ship to home order fulfillment, we offer guests “Buy Online, Pick-up in Store,” “Curbside Pickup,” and “Store 2 Door,” which provides the ability for customers to order in-store and have products delivered to their homes. In addition, we offer same-day delivery for e-commerce orders in virtually all markets.\nTo expand loyalty member engagement and introduce new guests to Ulta Beauty, we have a partnership with Target Corporation to create Ulta Beauty at Target, a “shop-in-shop” concept that offers a curated assortment of more than 60 established and emerging prestige brands across a variety of categories. Co-designed by Ulta Beauty and Target, the Ulta Beauty at Target shop is intended to reflect the Ulta Beauty experience with a unique and elevated presentation in 1,000 square feet of dedicated space separate but adjacent to Target’s core beauty department. The shop is staffed by Target team members who are trained by Ulta Beauty to provide recommendations and answer product questions. Members in our loyalty program, Ulta Beauty Rewards, can earn points for purchases made in the Ulta Beauty at Target shop. Loyalty points can only be redeemed in Ulta Beauty stores, on Ulta.com or through our mobile applications. As of February 1,\n2025, Ulta Beauty at Target was available in over 600 Target locations and on target.com. Over time, we believe Ulta Beauty at Target could be in up to 800 Target locations, in addition to our freestanding Ulta Beauty stores.\nWe are committed to growing our business outside of the U.S. through international expansion in Mexico and the Middle East. In Mexico, we have a joint venture partnership with Grupo Axo, an experienced operator of global brands to launch and operate Ulta Beauty in Mexico beginning in 2025. In the Middle East, we entered into a franchise partnership with Alshaya Group, a leading international franchise operator, whereby Alshaya will license the Ulta Beauty brand name and operating model in the Middle East.\nWe offer one of the most extensive product and brand selections in our industry, including a broad assortment of branded and private label beauty and wellness products in cosmetics, fragrance, haircare, skincare, bath and body products, and salon styling tools. Across our stores, Ulta.com and our mobile applications, we offer approximately 29,000 products from approximately 600 well-established and emerging beauty and wellness brands across all categories and price points, including Ulta Beauty’s own private label, Ulta Beauty Collection. Our merchandising team continually monitors beauty and wellness trends, sales trends, and new product launches to keep Ulta Beauty’s product assortment fresh and relevant and to ensure that our assortment reflects the diversity of our guests. We believe our broad selection of merchandise, from moderately-priced brands to higher-end luxury brands, creates a unique shopping experience for our guests.\nIn addition to our partners’ brands, we believe our recently relaunched private label brand, Ulta Beauty Collection, is a strategically important opportunity for growth and profit contribution. Our objective is to provide quality, trend-right private label products to continue to strengthen our guests’ perception of Ulta Beauty, and serve as an important pillar of the Conscious Beauty at Ulta Beauty\nprogram. Ulta Beauty manages the full development cycle of these products from concept through production to deliver differentiated packaging and formulas that enhance our brand image. Ulta Beauty Collection has been certified in the Clean Ingredients and Cruelty Free pillars within the Conscious Beauty at Ulta Beauty\nprogram. We also offer products such as Tarte Double Duty Beauty cosmetics and IT Brushes for Ulta that are permanently exclusive to Ulta Beauty. Similarly, we offer a number of brands and products that are exclusive for a limited period of time or are offered in advance of our competitors, such as Morphe, Peach & Lily, and R.E.M Beauty. Ulta Beauty Collection and permanent Ulta Beauty exclusive products represented approximately 4% of our net sales in fiscal 2024. Both permanent and temporary exclusive products represented approximately 9% of our net sales in fiscal 2024.\nWe offer a balanced portfolio across six primary categories: (1) cosmetics; (2) skincare; (3) haircare; (4) fragrance; (5) services; and (6) other, which includes other revenue sources such as the private label and co-branded credit card\n\nended February 3, 2024 (fiscal 2023), respectively. We believe our brand partners view us as a significant distribution channel for growth and brand enhancement, and we work closely with them to market both new and existing brands.\nAll brand partners and respective subcontractors and their facilities are subject to the applicable Ulta Vendor Standards, which set forth the ethical, legal, social, and workplace standards to meet in order to do business with Ulta Beauty. In addition to complying with Ulta Vendor Standards, many brand partners have committed to help advance our mission to\nmaintain the beauty of our environment\nminimize our impact on the world around us by offering sustainable packaging. We have made a commitment that 50% of packaging from products sold at our stores will be recyclable, refillable, or made from recycled or bio-sourced materials by the end of fiscal 2025.\nMarketing and advertising\nWe employ a multi-faceted marketing strategy to increase brand awareness, drive traffic to our stores, website, and mobile applications, acquire new loyalty program members, improve guest retention, increase frequency of shopping, and increase spend per member. We communicate with our guests and prospective guests through multiple vehicles, including print advertising, digital and social media, television and radio. These vehicles highlight the breadth of our selection of prestige, mass and salon beauty products, new products and services, and special offers, as well as build an emotional connection with guests. Our comprehensive public relations strategy enhances Ulta Beauty’s reputation as a beauty destination, increases brand awareness, and drives awareness of new products, in-store events, and new store openings.\nThe Ulta Beauty Rewards loyalty program is an important tool to increase retention of existing guests and to enhance their loyalty to the Ulta Beauty brand. Our CRM platform enables sophisticated analysis of the customer data in our loyalty member database as well as greater personalization of our marketing campaigns, digital experiences, and day-to-day communications. Our data demonstrates that loyalty members spend more per visit as compared to non-members. Ulta Beauty Rewards enables customers to earn points based on their purchases at Ulta Beauty stores, through our digital platforms, and at Ulta Beauty at Target. Points earned are valid for at least one year and may be redeemed on any product we sell or service we provide in Ulta Beauty stores or through our digital platforms. To enhance our loyalty program, we offer co-branded and private label credit cards. The credit cards drive higher wallet share and greater loyalty from our rewards members, provide increased consumer insights, and offer attractive economics.\nWe are directing a growing percentage of our marketing expense towards digital, social media, and streaming advertising. We believe these channels are highly effective in communicating with existing guests, as well as driving consideration amongst those who have not yet shopped with us. In social media channels, influencers and affiliates play an important role in beauty, and we engage talent from our UB Collective, our affiliate program, and Ulta Beauties, our associate ambassador program to support our marketing efforts. Our digital marketing strategy includes search engine optimization, paid search, mobile advertising, social media, display advertising, and other digital marketing channels. Digital marketing, coupled with our national TV and radio advertising, has helped us increase brand awareness and consideration among those not familiar with Ulta Beauty, which we believe has resulted in new guests.\nRetail media network\nWe have a deep understanding of our Ulta Beauty Rewards loyalty members and their preferences. This unique understanding, combined with our ongoing investment in data analytics and CRM capabilities, enables us to create personalized experiences and value for our guests and has unlocked new ways for us to support our brand partners and drive additional vendor income. In 2022, we launched our retail media network, UB Media, to transform the way our brand partners can connect with beauty enthusiasts. UB Media offers brands a suite of media and advertising capabilities that aim to personalize guest engagement and drive the acquisition of new guests.\n\nWe target beauty enthusiasts across multiple demographics and shopping behaviors. Beauty enthusiasts have a deep emotional connection with beauty, and historically, this connection has not diminished in softer economic environments. Our proprietary consumer research confirms engagement with the beauty category remains strong. Strong engagement paired with increasing use of social media and the convergence of beauty and wellness has invited even more consumers into the beauty category and expanded the addressable market. At the same time, the beauty landscape is evolving and guest expectations are rising, which will require continued innovation and investment to further our leadership position.\nReflecting our understanding about how the consumer and beauty category are evolving, in 2024 we refreshed our strategic framework. Through a focus on four foundational areas, our strategies are designed to position Ulta Beauty as the destination for beauty enthusiasts for a lifetime, drive market share leadership in beauty and wellness, and deliver long-term profitable growth.\nAssortment: Curating the best of all things beauty and wellness for all beauty enthusiasts.\nBeauty enthusiasts enjoy the experience of discovering and trying new products and consider beauty very much part of their self-care and wellness journey. Reflecting these insights, our objective is to engage and continuously delight beauty enthusiasts with a curated, differentiated beauty and wellness assortment. We intend to drive product newness through a differentiated portfolio of exclusive, emerging and established brands, including Ulta Beauty Collection, and accelerate our leadership position in wellness with an expanded assortment and elevated experience.\nExperience: Fostering authentic, empowering human connections that inspire, delight and engage guests at every touchpoint.\nThe guest experience is central to driving guest love and loyalty. Our consumer research suggests there are several important experience elements that are most critical to the beauty enthusiast including: creating a welcoming and inclusive environment, providing trusted guidance, offering convenience and ease, and delivering fun and immersion. To deliver on these critical needs and foster authentic, empowering human connections that inspire, delight and engage guests at every touchpoint, we intend to enhance the in-store experience by investing in our best-in-class store associates and stylists, distinct service offerings, and signature events and heighten omnichannel satisfaction, meeting every guest where they are with a robust suite of offerings and increased convenience.\nLoyalty: Building lifelong loyalty and brand love through member growth and personalization.\nTo understand longer-term shifts in consumer values, perceptions, and behaviors, as well as of-the-moment insights, we have developed a robust consumer research capability. In addition, with more than 95% of total sales coming from our 44.6 million active Ulta Beauty Rewards loyalty program members, we have unique ",
  "item7_clean": "Mother’s Day and Valentine’s Day. Any decrease in sales during these higher sales volume periods could have an adverse effect on our business, financial condition, or operating results for the entire fiscal year. Our quarterly results of operations have varied in the past and are likely to do so again in the future. As such, we believe that period-to-period comparisons of our results of operations should not be relied upon as an indication of our future performance.\nCritical accounting policies and estimates\nManagement’s discussion and analysis of financial condition and results of operations is based upon our consolidated financial statements, which have been prepared in accordance with U.S. generally accepted accounting principles. The preparation of these financial statements required the use of estimates and judgments that affect the reported amounts of our assets, liabilities, revenues, and expenses. Management bases estimates on historical experience and other assumptions it believes to be reasonable under the circumstances and evaluates these estimates on an on-going basis. Actual results may differ from these estimates. A discussion of our more significant estimates follows. Management has discussed the development, selection, and disclosure of these estimates and assumptions with the Audit Committee of the Board of Directors.\nMerchandise inventories are carried at the lower of cost or net realizable value. Cost is determined using the moving average cost method and includes costs incurred to purchase and distribute goods as well as related vendor allowances including co-op advertising, markdowns, and volume discounts. We record valuation adjustments to our inventories if the cost of a specific product on hand exceeds the amount we expect to realize from the ultimate sale or disposal of the inventory as well as for any excess or discontinued inventory. These estimates are based on management’s judgment regarding future demand, age of inventory, and analysis of historical experience. If actual demand or market conditions are different than those projected by management, future merchandise margin rates may be affected by adjustments to these estimates.\nInventories are adjusted for the results of periodic physical inventory counts at each of our locations. We record a shrink reserve representing management’s estimate of inventory losses by location that have occurred since the date of the last physical count. This estimate is based on management’s analysis of historical results, including consideration of current loss rates.\nWe do not believe that there is a reasonable likelihood that there will be a material change in the future estimates or assumptions we use to calculate our inventory reserves. Adjustments to earnings resulting from revisions to management’s estimates of the inventory reserves have been insignificant during fiscal 2024, 2023, and 2022. An increase or decrease in the lower of cost or net realizable value reserve of 10% would not have a material impact on our operating income for fiscal 2024. An increase or decrease in the shrink rate included in the shrink reserve calculation of 10% would not have a material impact on our operating income for fiscal 2024.\nThe majority of cash consideration received from a vendor is considered to be a reduction of the cost of the related products and is reflected in cost of sales in our consolidated statements of income as the related products are sold unless it is in exchange for an asset or service or a reimbursement of a specific, incremental, identifiable cost incurred by the Company in selling the vendors’ products. We estimate the amount recorded as a reduction of inventory at the end of each period based on a detailed analysis of inventory turns and management’s analysis of the facts and circumstances of the various contractual agreements with vendors. We record cash consideration expected to be received from vendors in receivables. We do not believe there is a reasonable likelihood there will be a material change in the future estimates or assumptions we use to calculate our reduction of inventory. An increase or decrease in inventory turns of five basis points would not have a material impact on our operating income for fiscal 2024.\n\nthe number of new stores opened and the impact on the average age of all of our comparable stores.\nCost of sales includes:\nthe cost of merchandise sold, offset by vendor income that is not a reimbursement of specific, incremental, and identifiable costs;\ndistribution costs including labor and related benefits, freight, rent, depreciation and amortization, real estate taxes, utilities, and insurance;\nshipping and handling costs for e-commerce orders;\nretail store occupancy costs including rent, depreciation and amortization, real estate taxes, utilities, repairs and maintenance, insurance, and licenses;\nsalon services payroll and benefits; and\nshrink and inventory valuation reserves.\nOur cost of sales may be negatively impacted as we open new stores. Changes in our merchandise or channel mix may also have an impact on cost of sales. This presentation of items included in cost of sales may not be comparable to the way in which our competitors or other retailers compute their cost of sales.\nSelling, general and administrative (SG&A) expenses include:\npayroll, bonus, and benefit costs for retail store and corporate employees;\nadvertising and marketing costs, offset by vendor income that is a reimbursement of specific, incremental, and identifiable costs;\noccupancy costs related to our corporate office facilities;\nstock-based compensation expense;\ndepreciation and amortization for all assets, except those related to our retail stores and distribution operations, which are included in cost of sales; and\nlegal, finance, information systems, and other corporate overhead costs.\nThis presentation of items in selling, general and administrative expenses may not be comparable to the way in which our competitors or other retailers compute their selling, general and administrative expenses.\nPre-opening expenses include non-capital expenditures during the period prior to store opening for new, remodeled, and relocated stores including rent during the construction period for new and relocated stores, store set-up labor, management and employee training, and grand opening advertising.\nInterest income represents interest from cash equivalents, which include highly liquid investments such as money market funds and certificates of deposit with an original maturity of three months or less from the date of purchase. Interest expense includes interest costs and facility fees associated with our credit facility, which is structured as an asset-based lending instrument. Our credit facility interest is based on a variable interest rate structure which can result in increased cost in periods of rising or elevated interest rates.\nIncome tax expense reflects the federal statutory tax rate and the weighted average state statutory tax rate for the states in which we operate stores.\nResults of operations\nOur fiscal years are the 52- or 53-week periods ending on the Saturday closest to January 31. The Company’s fiscal years ended February 1, 2025 (fiscal 2024), February 3, 2024 (fiscal 2023), and January 28, 2023 (fiscal 2022) were 52, 53, and 52 week years, respectively.\n\nGross profit increased $6.2 million, or 0.1%, to $4.39 billion in fiscal 2024, compared to $4.38 billion in fiscal 2023. Gross profit as a percentage of net sales decreased 30 basis points to 38.8% in fiscal 2024 compared to 39.1% in fiscal 2023. The decrease in gross profit margin was primarily due to:\n40 basis points of deleverage in merchandise margins driven by lapping favorable price increase impacts from the prior year and higher promotional activity;\n20 basis points of deleverage of store fixed costs driven by more net new store openings; and\n10 basis points of deleverage due to higher supply chain costs; partially offset by\n20 basis points of leverage in inventory shrink; and\n20 basis points of leverage due to favorable channel mix.\nSelling, general and administrative expenses\nSG&A expenses increased $114.0 million, or 4.2%, to $2.8 billion in fiscal 2024 compared to $2.7 billion in fiscal 2023. As a percentage of net sales, SG&A expenses increased 90 basis points to 24.9% in fiscal 2024 compared to 24.0% in fiscal 2023. The deleverage of SG&A expenses was primarily due to:\n60 basis points of deleverage of store payroll and benefits due to wage investments;\n40 basis points of deleverage of corporate overhead primarily due to strategic investments; and\n10 basis points of deleverage of store expenses due to ongoing inflationary pressures; partially offset by\n20 basis points of leverage due to lower incentive compensation.\nPre-opening expenses\nPre-opening expenses increased $5.2 million, or 60.9%, to $13.7 million in fiscal 2024 compared to $8.5 million in fiscal 2023.\nInterest income, net\nNet interest income was $15.1 million in fiscal 2024 compared to $17.6 million in fiscal 2023, due to lower average cash balances. We did not have any outstanding borrowings on our credit facility as of February 1, 2025 and February 3, 2024.\nIncome tax expense of $378.9 million in fiscal 2024 represents an effective tax rate of 24.0%, compared to fiscal 2023 income tax expense of $404.6 million and an effective tax rate of 23.9%.\nNet income decreased $89.9 million to $1.2 billion in fiscal 2024 compared to $1.3 billion in fiscal 2023. The decrease in net income was primarily due to a $114.0 million increase in SG&A expenses and a $5.2 million increase in pre-opening expenses, partially offset by a $25.7 million decrease in income taxes and a $6.2 million increase in gross profit.\nFiscal year 2023 versus fiscal year 2022\nNet sales increased $998.7 million, or 9.8%, to $11.2 billion in fiscal 2023 compared to $10.2 billion in fiscal 2022. The net sales increase was primarily due to increased comparable sales, strong new store performance, an increase of $68.3 million in other revenue and the benefit of an extra week of sales in fiscal 2023. Net sales for the 53\n\n2023 were approximately $181.9 million. The total comparable sales increase of 5.7% in fiscal 2023, compared to an increase of 15.6% in fiscal 2022, was driven by a 7.4% increase in transactions and a 1.5% decrease in average ticket.\nGross profit increased $336.6 million, or 8.3%, to $4.4 billion in fiscal 2023, compared to $4.0 billion in fiscal 2022. Gross profit as a percentage of net sales decreased 50 basis points to 39.1% in fiscal 2023 compared to 39.6% in fiscal 2022. The decrease in gross profit margin was primarily due to:\n80 basis points of deleverage in merchandise margins driven by higher promotional activity and category mix, as well as lapping of benefits from price increases; and\n40 basis points of deleverage in inventory shrink; partially offset by\n50 basis points of leverage in other revenue primarily due to credit card income growth, an increase in royalty income from our partnership with Target, and higher loyalty point redemptions; and\n20 basis points of leverage of store fixed costs attributed to the impact of higher sales.\nSelling, general and administrative expenses\nSG&A expenses increased $299.3 million, or 12.5%, to $2.7 billion in fiscal 2023 compared to $2.4 billion in fiscal 2022. As a percentage of net sales, SG&A expenses increased 50 basis points to 24.0% in fiscal 2023 compared to 23.5% in fiscal 2022. The deleverage of SG&A expenses was primarily due to:\n60 basis points of deleverage of corporate overhead primarily due to strategic investments;\n20 basis points of deleverage of store payroll and benefits due to wage investments;\n10 basis points of deleverage of store expenses due to ongoing inflationary pressures; and\n10 basis points of deleverage due to higher marketing expenses; partially offset by\n50 basis points of leverage due to lower incentive compensation.\nPre-opening expenses\nPre-opening expenses decreased $2.1 million, or 19.7%, to $8.5 million in fiscal 2023 compared to $10.6 million in fiscal 2022.\nInterest income, net\nNet interest income was $17.6 million in fiscal 2023 compared to $4.9 million in fiscal 2022, due to higher average interest rates on cash balances. We did not have any outstanding borrowings on our credit facility as of February 3, 2024 and January 28, 2023.\nIncome tax expense of $404.6 million in fiscal 2023 represents an effective tax rate of 23.9%, compared to fiscal 2022 income tax expense of $401.1 million and an effective tax rate of 24.4%. The lower income tax rate is primarily due to a decrease in state income taxes compared to fiscal 2022 and a tax benefit from the income tax accounting for stock-based compensation.\nNet income increased $48.6 million to $1.3 billion in fiscal 2023 compared to $1.2 billion in fiscal 2022. The increase in net income was primarily due to a $336.6 million increase in gross profit, partially offset by a $299.3 million increase in SG&A expenses and a $3.5 million increase in income taxes.\n\nManagement’s Discussion and Analysis of Financial Condition and Results of Operations\nWe were founded in 1990 as a beauty retailer at a time when prestige, mass, and salon products were sold through distinct channels – department stores for prestige products; drug stores and mass merchandisers for mass products; and salons and authorized retail outlets for professional hair care products. We developed a unique specialty retail concept that offers a broad range of brands and price points, select beauty services, and a convenient and welcoming shopping environment. We define our target consumer as a beauty enthusiast, a consumer who is passionate about the beauty category, uses beauty for self-expression, experimentation, and self-investment, and has high expectations for the shopping experience. We estimate there are approximately 140 million beauty enthusiasts in the U.S. We believe our strategy provides us with the competitive advantages that have contributed to our financial performance.\nToday, we are the largest specialty beauty retailer in the United States and the premier beauty destination for cosmetics, fragrance, skin care products, hair care products, wellness products, and salon services. Key aspects of our business include: a differentiated assortment of approximately 29,000 beauty products across a variety of categories and price points as well as a variety of beauty services, including salon services, in more than 1,400 stores predominantly located in convenient, high-traffic locations; engaging digital experiences delivered through our website, Ulta.com, and our mobile applications; our best-in-class loyalty program that enables members to earn points for every dollar spent on products and beauty services and provides us with deep, proprietary customer insights; and our ability to cultivate human connection with warm and welcoming guest experiences across all of our channels.\nThe continued growth of our business and any future increases in net sales, net income, and cash flows is dependent on our ability to execute our strategic priorities across four foundational focus areas: 1) Assortment: curating the best of all things beauty and wellness for all beauty enthusiasts; 2) Experience: fostering authentic, empowering human connections that inspire, delight and engage guests at every touchpoint; 3) Loyalty: building lifelong loyalty and brand love through member growth and personalization; and 4) Access: engaging our guests wherever they want to shop by expanding our reach through seamless and immersive omnichannel experiences. We operate in an attractive and growing U.S. beauty products and salon services industry, and believe our strong operating model, competitive advantages, and financial foundation, paired with our investments to drive our growth, position us to capture additional market share in the industry.\nCompar",
  "item2_clean": null
}