{
  "source_file": "unh-20241231.htm",
  "form_type": "10-K",
  "item1_clean": "by improving financial performance and enhancing outcomes through proactive analytics, a comprehensive payment integrity portfolio and technology-enabled and staff-supported risk and quality services. Optum Insight helps health plans navigate a dynamic environment defined by shifts in employer vs. public-sector coverage, the demand for affordable benefit plans and the need to leverage new technology to reduce complexity.\nProvides advanced technology and analytics services to modernize the administration of critical safety net programs, such as Medicaid, while improving cost predictability.\nLife Sciences Companies.\nCombines data and analytics expertise with comprehensive technologies and health care knowledge to help life sciences companies, including those in pharmaceuticals and medical technology, adopt a more comprehensive approach to advancing therapeutic discoveries and improving clinical outcomes.\nMany of Optum Insight’s software and information products and professional services are delivered over extended periods, often several years. Optum Insight maintains an order backlog to track unearned revenues under these long-term arrangements. The backlog consists of estimated revenue from signed contracts, other legally binding agreements and anticipated contract renewals based on historical experience with Optum Insight’s customers. Optum Insight’s aggregate backlog as of December 31, 2024 was approximately $32.8 billion, of which $19.8 billion is expected to be realized within the next 12 months. The aggregate backlog includes $12.5 billion related to affiliated agreements. Optum Insight’s aggregate backlog as of December 31, 2023, was $32.1 billion, including $11.9 billion related to affiliated agreements.\nOptum Insight’s products and services are sold primarily through a direct sales force. Optum Insight’s products are also supported and distributed through an array of alliances and business partnerships with other technology vendors, who integrate and interface Optum Insight’s products with their applications.\nOptum Rx provides a full spectrum of pharmacy care services through its network of more than 65,000 retail pharmacies, through home delivery, specialty and community health pharmacies, the provision of in-home and community-based infusion services and through rare disease and gene therapy support services. It also offers direct-to-consumer solutions.\nOptum Rx manages a broad range of prescription drug spend, including widely available retail drugs as well as limited and ultra-limited distribution drugs in oncology, HIV, pain management and ophthalmology. Optum Rx serves the growing pharmacy needs of people with behavioral health and substance use disorders. In 2024, Optum Rx managed $178 billion in pharmaceutical spending, including $74 billion in specialty pharmaceutical spending.\nOptum Rx serves health benefits providers, large national employer plans, unions and trusts, purchasing coalitions and public-sector entities. Optum Rx sells its services through direct sales, health insurance brokers and other health care consultants.\nOptum Rx offers multiple clinical programs, digital tools and services to help clients manage overall pharmacy and health care costs in a clinically appropriate manner which are designed to deliver improved consumer experiences, better health outcomes and a lower total cost of care. Optum Rx provides various utilization management, medication management, quality assurance, adherence and counseling programs to complement each client’s plan design and clinical strategies. Optum Rx is accelerating the integration of medical, pharmacy and behavioral care and treating the whole patient by embedding our pharmacists as key members of the patient care team.\nThrough its health benefits offerings, UnitedHealthcare is enabling better health, creating a better health care experience for its customers and helping to control rising health care costs. UnitedHealthcare’s market position is built on:\nstrong local-market relationships;\nthe breadth of product offerings, based upon extensive expertise in distinct market segments in health care;\nservice and advanced technology, including digital consumer engagement;\ncompetitive medical and operating cost positions;\neffective clinical engagement; and\ninnovation for customers and consumers.\nUnitedHealthcare arranges for discounted access to care through its extensive networks and uses Optum’s capabilities to help coordinate and provide patient care, improve affordability of medical care, analyze cost trends, manage pharmacy care services, work with care providers more effectively and create a simpler and more satisfying consumer and physician experience.\nUnitedHealthcare is subject to extensive government regulation. See further discussion of our regulatory environment below under\n“Government Regulation”\nPart II, Item 7, “Management’s Discussion and Analysis of Financial Condition and Results of Operations.”\nUnitedHealthcare Employer & Individual\nDomestically, UnitedHealthcare Employer & Individual offers a comprehensive array of consumer-oriented health benefit plans and services for large national employers, public sector employers, mid-sized employers, small businesses, and individuals. As of December 31, 2024, UnitedHealthcare Employer & Individual provides access to medical services for 29.7 million people.\nThrough its risk-based product offerings, UnitedHealthcare Employer & Individual assumes the risk of both medical and administrative costs for its customers in return for a monthly premium which is typically a fixed rate per individual served for a one-year period. Through its administrative and other management services arrangements to customers who elect to self-fund the health care costs of their employees and employees’ dependents, UnitedHealthcare Employer & Individual receives a fixed\nmonthly service fee per individual served. These customers retain the risk of financing medical benefits for their employees and employees’ dependents, while UnitedHealthcare Employer & Individual provides services such as coordination and facilitation of medical and related services to customers, consumers and health care professionals, administration of transaction processing and access to a contracted network of physicians, hospitals and other health care professionals, including dental and vision professionals. UnitedHealthcare Employer & Individual is focused on providing informed benefit solutions that create customized plan designs and clinical programs for employers that contribute to well-being and reduce the total cost of care along with providing simpler consumer experiences in response to market dynamics.\nUnitedHealthcare Employer & Individual typically distributes its products through a variety of channels, dependent upon the specific product, including: through consultants or direct sales, in collaboration with brokers and agents, through wholesale agents or agencies who contract with health insurance carriers to distribute individual or group benefits, through professional employer organizations and associations and through both multi-carrier and its own proprietary private exchange marketplaces.\nUnitedHealthcare Employer & Individual’s major product families include consumer engagement products, such as high-deductible consumer driven benefit plans and a variety of innovative consumer centric products; traditional products; clinical and pharmacy products; and specialty benefits, such as vision, dental, accident protection, critical illness, disability and hospital indemnity offerings.\nUnitedHealthcare Medicare & Retirement\nUnitedHealthcare Medicare & Retirement provides health and well-being services to seniors and other Medicare eligible consumers, addressing their unique needs. UnitedHealthcare Medicare & Retirement has distinct benefit designs, pricing, underwriting, clinical program management and marketing capabilities dedicated to health products and services in this market.\nUnitedHealthcare Medicare & Retirement offers a selection of products allowing people choice in obtaining the health coverage and services they need as their circumstances change. These offerings include care management and health system navigator services, clinical management programs, nurse health line services, 24-hour access to health care information, access to discounted health services from a network of care providers and administrative services.\nUnitedHealthcare Medicare & Retirement has extensive distribution capabilities and experience, including direct marketing to consumers on behalf of its key clients, a membership organization, and state and U.S. government agencies. Products are also offered through agents, employer groups and digital channels.\nMajor product categories include:\n\nITEM 1. BUSINESS\nOUR BUSINESSES\nThe terms “we,” “our,” “us,” “its,” “UnitedHealth Group,” or the “Company” used in this report refer to UnitedHealth Group Incorporated and its subsidiaries.\nUnitedHealth Group Incorporated is a health care and well-being company with a mission to help people live healthier lives and help make the health system work better for everyone. Our two distinct, yet complementary businesses — Optum and UnitedHealthcare — are working to help build a modern, high-performing health system through improved access, affordability, outcomes and experiences for the individuals and organizations we are privileged to serve.\nThe ability to analyze complex data and apply deep health care expertise and insights allows us to serve patients, consumers, care providers, businesses, communities and governments with more innovative products and complete, end-to-end offerings for many of the biggest challenges facing health care today.\nOptum seeks to create a higher-performing, value-oriented and more connected approach to health care. Bringing together clinical expertise, technology and data to make care simpler, more effective and more affordable, we seek to advance whole-person health, creating a seamless consumer experience and supporting clinicians with insights to deliver personalized, evidence-based care. Optum serves the broad health care marketplace, including patients and consumers, payers, care providers, employers, governments and life sciences companies, through its Optum Health, Optum Insight and Optum Rx businesses. These businesses improve overall health system performance by optimizing health care quality and delivery, reducing costs and improving patient, consumer and provider experience, leveraging distinctive capabilities in data and analytics, pharmacy care services, health care operations, population health and health financial services.\nUnitedHealthcare offers a full range of health benefits, designed to simplify the health care experience and make it more affordable for consumers to access high-quality care. UnitedHealthcare Employer & Individual serves consumers and employers, ranging from sole proprietorships to large, multi-site and national employers and public sector employers. UnitedHealthcare Medicare & Retirement delivers health and well-being benefits to seniors and other Medicare eligible consumers. UnitedHealthcare Community & State serves consumers who are economically disadvantaged, the medically underserved and those without the benefit of employer sponsored health benefits coverage.\nWe have four reportable segments:\nUnitedHealthcare, which includes UnitedHealthcare Employer & Individual, UnitedHealthcare Medicare & Retirement and UnitedHealthcare Community & State.\nOptum is an information and technology-enabled health services business serving the broad health care marketplace, including:\nThose who need care: patients who need the right care, information, resources, products and engagement to improve their health, achieve their health goals and receive an improved patient experience that is personalized, comprehensive and delivered in all care settings, including in-home and virtually.\nT",
  "item7_clean": "EXECUTIVE OVERVIEW\nUnitedHealth Group is a health care and well-being company with a mission to help people live healthier lives and help make the health system work better for everyone. Our two distinct, yet complementary businesses — Optum and UnitedHealthcare — are working to help build a modern, high-performing health system through improved access, affordability, outcomes and experiences for the individuals and organizations we are privileged to serve.\nWe have four reportable segments across our two businesses:\nUnitedHealthcare, which includes UnitedHealthcare Employer & Individual, UnitedHealthcare Medicare & Retirement and UnitedHealthcare Community & State.\nFurther information on our business and reportable segments is presented in\nPart I, Item 1, “Business”\nNote 14 of the Notes to the Consolidated Financial Statements included in Part II, Item 8, “Financial Statements and Supplementary Data.”\nChange Healthcare Cyberattack\nAs previously announced, on February 21, 2024, we identified that cybercrime threat actors had gained access to certain Change Healthcare information technology systems. Upon detection of this outside threat, we isolated the impacted systems to protect our partners and customers.\nWe have substantially mitigated the impact to consumers and care providers of the unprecedented cyberattack on the U.S. health system and restored or replaced the majority of the affected Change Healthcare services. To support care providers we provided interest-free loans of more than $9 billion through December 31, 2024. For the year ended December 31, 2024, we incurred $2.2 billion of direct response costs, including costs associated with providing interest-free loans; increased medical care expenditures, as we suspended some care management activities to help care providers with their workflow processes; network restoration; and notifications of impacted persons. Optum Insight also experienced estimated business disruption impacts of $867 million for the year ended December 31, 2024, reflecting lost revenue while maintaining full readiness of the affected Change Healthcare services. We expect to continue to incur direct response costs and experience business disruption impacts at a lesser extent in 2025 as we work to bring transaction volumes back to pre-event levels and win new business.\nWe have determined the estimated total number of individuals impacted by the Change Healthcare cyberattack is approximately 190 million. The vast majority of those people have already been provided individual or substitute notice. The final number will be confirmed and filed with the Office for Civil Rights. Change Healthcare is not aware of any misuse of individuals’ information as a result of this incident and has not seen electronic medical record databases appear in the data during the analysis. It is possible that future risks and uncertainties resulting from the Change Healthcare cyberattack, including risks related to impacted data, litigation, reputational harm, and regulatory actions could adversely affect our financial condition or results of operations.\nOur businesses participate in the United States and certain other international health markets. In the United States, health care spending has grown consistently for many years and comprises 18% of gross domestic product (GDP). We expect overall spending on health care to continue to grow in the future, due to inflation, medical technology and pharmaceutical advancement, regulatory requirements, demographic trends in the population and national interest in health and well-being. The rate of market growth may be affected by a variety of factors, including macroeconomic conditions, which could impact our results of operations, including our continued efforts to control health care costs.\nTo price our health care benefits, products and services, we start with our view of expected future costs, including medical care patterns, inflation and labor market dynamics. We frequently evaluate and adjust our approach in each of the local markets we serve, considering relevant factors, such as product positioning, price competitiveness and environmental, competitive, legislative and regulatory considerations, including minimum medical loss ratio (MLR) thresholds and similar revenue adjustments. We will continue seeking to balance growth and profitability across all these dimensions.\nThe commercial risk market remains highly competitive in the small group, large group and individual segments. We expect broad-based competition to continue as the industry adapts to individual and employer needs.\nMedicare Advantage funding continues to be pressured, as discussed below in\n“Regulatory Trends and Uncertainties”\nand we have observed increased care patterns as discussed below in “Medical Cost Trends.” Our 2025 benefit design approach contemplates these trends.\nIn Medicaid, we believe the payment rate environment creates the risk of continued downward pressure on Medicaid margin percentages. We continue to take a prudent, market-sustainable posture for both new business and maintenance of existing relationships. We continue to advocate for actuarially sound rates commensurate with our medical cost trends and we remain dedicated to partnering with those states that are committed to the long-term viability of their programs.\nMedical Cost Trends.\nOur medical cost trends primarily relate to changes in unit costs, care activity and prescription drug costs. As expected and contemplated in our benefits design, we have continued to observe increased care patterns, which may continue in future periods. We also observed an upshift in hospital coding intensity and an acceleration in the prescribing of certain high-cost medications in early response to the Inflation Reduction Act (IRA). We expect these additional factors to continue into future periods. We endeavor to mitigate those increases by engaging hospitals, physicians and consumers with information and helping them make clinically sound choices, with the objective of helping them achieve high-quality, affordable care.\nAs a result of the Change Healthcare cyberattack, we incurred medical costs related to the impact of the temporary suspension of some care management activities, impacting our UnitedHealthcare and Optum Health businesses, to help care providers with their workflow processes. Early in the second quarter we resumed these activities. For the year ended December 31, 2024, medical costs related to the temporary suspension of some care management activities were approximately $640 million.\nMedicaid Redeterminations.\nMedicaid redeterminations have impacted the number of people served through our Medicaid offerings, partially offset by an increase in consumers served through our commercial offerings as we endeavor to ensure that people and families have continued access to care. The Medicaid redetermination process has also caused a timing mismatch between the current health status of people served through Medicaid and state rate updates, which remained well short of current care activity. We expect this gap between people’s health status and rates will narrow in 2025.\nDelivery System and Payment Modernization.\nThe health care market continues to change based on demographic shifts, new regulations, political forces and both payer and patient expectations. Health plans and care providers are being called upon to work together to close gaps in care and improve overall care quality and patient experience, improve the health of populations and reduce costs. We are working to accelerate this vision through the innovation and integration of our care delivery models including in-clinic, in-home, behavioral and virtual care, and by using our data and analytics to provide clinicians with the necessary information in order to provide the best possible care in the most cost efficient setting. We continue to see a greater number of people enrolled in fully accountable value-based plans rewarding high-quality, affordable care and fostering collaboration.\nThis trend is creating needs for health management services which can coordinate care around the primary care physician, including new primary care channels, and for investments in new clinical and administrative information and management systems, which we believe provide growth opportunities for our Optum business platform. A key focus of our future growth is to accelerate the transition from fee-for-service care delivery and payment models to fully accountable value-based care. This transition requires initial costs such as system enhancements, integrated care coordination technology, physician training and clinical engagement. Enhanced clinical engagement is a critical step to improving the experience and health outcomes of the people we serve and should result in lower costs to the overall health system over time.\nRegulatory Trends and Uncertainties\nFollowing is a summary of management’s view of the trends and uncertainties related to regulatory matters. For additional information regarding regulatory trends and uncertainties, see\nPart I, Item 1 “Business - Government Regulation”\nItem 1A, “Risk Factors.”\nMedicare Advantage Rates.\nMedicare Advantage rate notices over the years have at times resulted in industry base rates well below industry forward medical trend. For example, the Final Notice for 2024 and 2025 rates resulted in an industry base rate decrease, both of which are well short of what is an increasing industry forward medical cost trend. The Advance Notice for 2026 rates proposes an industry base rate increase also well short of forward medical cost trend, creating continued pressure in the Medicare Advantage program. Further, substantial revisions to the risk adjustment model, which serves to adjust rates to reflect a patient’s health status and care resource needs, will result in reduced funding and potentially benefits for people, especially those with some of the greatest health and social challenges.\nAs a result of ongoing Medicare funding pressures, there are adjustments we can make to partially offset these rate pressures and reductions for a particular period. For example, we can seek to intensify our medical and operating cost management, make changes to the size and composition of our care provider networks, adjust member benefits and implement or increase the member premiums supplementing the monthly payments we receive from the government. Additionally, we decide annually on a county-by-county basis where we will offer Medicare Advantage plans.\nSELECTED OPERATING PERFORMANCE ITEMS\nThe following summarizes select 2024 year-over-year operating comparisons to 2023 and other financial results.\nConsolidated revenues grew 8%, UnitedHealthcare revenues grew 6% and Optum revenues grew 12%.\nUnitedHealthcare served 2.1 million more people domestically, driven by growth in commercial offerings, partially offset by the impact of Medicaid redeterminations.\nEarnings from operations of $32.3 billion compared to $32.4 billion last year.\nDiluted earnings per common share was $15.51, impacted by the loss on sale of subsidiary and subsidiaries held for sale.\nCash flows from operations were $24.2 billion.\nRESULTS SUMMARY\nThe following table summarizes our consolidated results of operations and other financial information:\n(in millions, except percentages and per share data)\nFor the Years Ended December 31,\nInvestment and other income\nCost of products sold\nDepreciation and amortization\nTotal operating costs\nEarnings from operations\nLoss on sale of subsidiary and subsidiaries held for sale\nEarnings before income taxes\nProvision for income taxes\nEarnings attributable to noncontrolling interests\nNet earnings attributable to UnitedHealth Group common shareholders\nDiluted earnings per share attributable to UnitedHealth Group common shareholders\nMedical care ratio (a)\nOperating cost ratio\nNet earnings margin (b)\nReturn on equity (c)\nMedical care ratio (MCR) is calculated as medical costs divided by premium revenue.\nNet earnings margin attributable to UnitedHealth Group common shareholders.\nReturn on equity is calculated as net earnings attributable to UnitedHealth Group common shareholders divided by average shareholders’ equity. Average shareholders’ equity is calculated using the shareholders’ equity balance at the end of the preceding year and the shareholders’ equity balances at the end of each of the four quarters of the year presented.\n2024 RESULTS OF OPERATIONS COMPARED TO 2023 RESULTS\nConsolidated Financial Results\nThe increases in revenues were primarily driven by growth in Optum Rx, UnitedHealthcare’s domestic offerings and Optum Health, partially offset by the sale of UnitedHealthcare’s Brazil operations.\nMedical Costs and MCR\nMedical costs increased primarily due to growth in people served through Medicare Advantage and domestic commercial offerings and member mix. The MCR increased as a result of the revenue effects of the Medicare funding reductions, Medicaid timing mismatch between people’s health status and rates, upshift in hospital coding intensity, specialty pharmaceutical prescribing patterns, member mix and due to incremental medical costs for accommodations made to care providers as a result of the Change Healthcare cyberattack.\nOperating Cost Ratio\nThe operating cost ratio decreased primarily due to operating cost management and gains related to business portfolio refinement, including strategic transactions, partially offset by the impact of our direct response efforts to the Change Healthcare cyberattack and investments to support future growth.\nLoss on Sale of Subsidiary and Subsidiaries Held for Sale\nOn February 6, 2024, the Company completed the sale of its Brazil operations. During the year ended December 31, 2024, we recorded a loss of $7.1 billion, of which $4.1 billion related to the impact of cumulative foreign currency translation losses previously included in accumulated other comprehensive loss.\nIn the second quarter of 2024, the Company initiated a plan to sell its remaining South American operations, which were classified as held for sale as of December 31, 2024. During the year ended December 31, 2024, we recorded a loss of $1.2 billion, of which $855 million related to the impact of cumulative foreign currency translation losses.\nNote 14 of Notes to the Consolidated Financial Statements included in Part II, Item 8, “Financial Statements and Supplementary Data”\nfor more information on our segments. We utilize various metrics to evaluate and manage our reportable segments, including individuals served by UnitedHealthcare by major market segment and funding arrangement, people served by Optum Health and adjusted scripts for Optum Rx. These metrics are the main drivers of revenue, earnings and cash flows at each business. The metrics also allow management and investors to evaluate and understand business mix, including the level and scope of services provided to people and pricing trends when comparing the metrics to revenue by segment.\nThe following table presents a summary of the reportable segment financial information:\n\n(in thousands, except percentages)\nCommercial - domestic:\nTotal commercial - domestic\nMedicare Supplement (Standardized)\nTotal community and senior\nTotal UnitedHealthcare - domestic medical\nTotal UnitedHealthcare - medical\nMedicare Part D stand-alone\nUnitedHealthcare’s revenues increased due to growth in the number of people served through Medicare Advantage and domestic commercial offerings, partially offset by decreased people served globally due to the sale of the Brazil operations and in Medicaid offerings due to redeterminations. Earnings from operations decreased due to Medicare Advantage funding reductions, the impacts of Medicaid redeterminations, member mix and incremental medical costs for accommodations to support care providers as a result of the Change Healthcare cyberattack, partially offset by gains rela",
  "item2_clean": null
}