{
  "source_file": "unh-20250930.htm",
  "form_type": "10-Q",
  "item1_clean": null,
  "item7_clean": null,
  "item2_clean": "ITEM 2. MANAGEMENT’S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS\nThe following discussion should be read together with the accompanying Condensed Consolidated Financial Statements and Notes and with our 2024 10-K, including the Consolidated Financial Statements and Notes included in Part II, Item 8, “Financial Statements and Supplementary Data” in that report. Unless the context indicates otherwise, references to the terms “UnitedHealth Group,” the “Company,” “we,” “our” or “us” used throughout this Management’s Discussion and Analysis of Financial Condition and Results of Operations refer to UnitedHealth Group Incorporated and its consolidated subsidiaries.\nReaders are cautioned that the statements, estimates, projections or outlook contained in this Management's Discussion and Analysis of Financial Condition and Results of Operations, including discussions regarding financial prospects, economic conditions, trends and uncertainties contained in this Item 2, may constitute forward-looking statements within the meaning of the Private Securities Litigation Reform Act of 1995 (PSLRA). These forward-looking statements involve risks and uncertainties that may cause our actual results to differ materially from the results discussed or implied in the forward-looking statements. A description of some of the risks and uncertainties is set forth in Part I, Item 1A, “Risk Factors” in our 2024 10-K and in the discussion below.\nEXECUTIVE OVERVIEW\nUnitedHealth Group is a health care and well-being company with a mission to help people live healthier lives and help make the health system work better for everyone. Our two distinct, yet complementary businesses — Optum and UnitedHealthcare — are working to help build a modern, high-performing health system through improved access, affordability, outcomes and experiences for the individuals and organizations we are privileged to serve.\nWe have four reportable segments:\nUnitedHealthcare, which includes UnitedHealthcare Employer & Individual, UnitedHealthcare Medicare & Retirement and UnitedHealthcare Community & State.\nFurther information on our business is presented in Part I, Item 1, “Business” and Part II, Item 7, “Management’s Discussion and Analysis of Financial Condition and Results of Operations” in our 2024 10-K and additional information on our segments can be found in this Item 2 and in\nNote 10 of Notes to the Condensed Consolidated Financial Statements\nincluded in Part I, Item 1 of this report.\nOur businesses participate primarily in the United States health markets. We expect overall spending on health care to continue to grow in the future, due to inflation, medical technology and pharmaceutical advancement, regulatory requirements, demographic trends in the population and national interest in health and well-being. The rate of market growth may be affected by a variety of factors, including macroeconomic conditions and regulatory changes, which could impact our results of operations, including our continued efforts to control health care costs.\nTo price our health care benefits, products and services, we start with our view of expected future costs, including medical care patterns, the mix and health status of people served, inflation and labor market dynamics. For 2025, our pricing trends and patient and member health status assumptions were well-short of the medical cost trends incurred, significantly impacting our earnings. We continually evaluate and adjust our approach in each of the local markets we serve, considering relevant factors, such as product positioning, price competitiveness and environmental, competitive, legislative and regulatory considerations, including minimum medical loss ratio thresholds and similar revenue adjustments. We seek to balance growth and profitability across all these dimensions.\nThe commercial risk market remains highly competitive in the small group, large group and individual segments. We expect broad-based competition to continue as the industry adapts to individual and employer needs. Continued increased medical costs may impact both future pricing and benefit design, including for our individual exchange products in markets where we choose to remain, and result in shifts between product categories for our employer benefits. These potential changes, along with certain regulatory impacts, may result in decreased membership in future periods.\nMedicare Advantage funding continues to be pressured, as discussed below in\n“Regulatory Trends and Uncertainties\nand we have observed increased care patterns as discussed below in “Medical Cost Trends,” which may impact pricing and benefit design in future periods.\nOptum Health’s fully accountable value-based care businesses have been impacted by Medicare funding reductions and have also seen continued medical cost trend pressures, which may impact future pricing in the markets we continue to participate.\nThe Medicaid redetermination process has caused a timing mismatch between the health status of people served through Medicaid and state rate updates. Due to elevated care activity, specifically related to behavioral, pharmacy and home health, there continues to be a mismatch between the updated rates in 2025 and underlying member acuity. The funding and payment rate environment remains insufficient to meet the health needs of patients and creates the risk of continued downward pressure on Medicaid margin percentages. We continue to take a prudent, market-sustainable posture for both new business and maintenance of existing relationships. We continue to advocate for actuarially sound rates commensurate with our medical cost trends and we remain dedicated to partnering with those states that are committed to the long-term viability of their programs. Additionally, we expect some Medicaid membership losses in 2026 as a result of early adoption of recent legislation.\nMedical Cost Trends.\nOur medical cost trends primarily relate to changes in unit costs, care activity and prescription drug costs. We have observed increased care patterns, more notably related to physician and outpatient care, and to a lesser extent inpatient and emergency room utilization, that are above what we expected and contemplated in our pricing and benefits design. We have also observed an increase in health care unit costs and in the intensity of services delivered, driven by increases in provider pricing and additional services bundled per visit. Additionally, the member profile of newly added patients under value-based care arrangements, people served in Medicare Advantage in markets where other have plans exited, and people served within our individual exchange business have contributed to increased medical costs. These trends may continue in future periods.\nThe Inflation Reduction Act (IRA) altered the Medicare Part D model and benefits, shifting more risk to plans, which results in both increased premiums and medical costs. The IRA also changed the quarterly relationship of medical costs to premiums, altering the seasonal progression and creating a more consistent relationship between medical costs and premiums throughout the year.\nWe endeavor to mitigate medical cost increases by engaging hospitals, physicians and consumers with information and helping them make clinically sound choices, with the objective of helping them achieve high-quality, affordable care. Additionally, we have elevated our audit, clinical policy and payment integrity tools to protect customers and patients from unnecessary costs.\nTrends and Uncertainties\nMedicare Advantage Rates.\nMedicare Advantage rate notices for numerous years have resulted in industry base rates well below the industry forward medical cost trend, with the Final Notice for 2026 beginning to approach the industry forward medical cost trend. Additionally, increased medical costs in 2025, which are significantly above initial cost trend estimates, adds to the compounding impact of the previous multi-year rate shortfalls creating sustained pressure on the Medicare Advantage program. Further, substantial revisions to the risk adjustment model, which serves to adjust rates to reflect a patient’s health status and care resource needs, have resulted and will continue to result in reduced funding and potentially benefits for people, especially those with some of the greatest health and social challenges.\nAs a result of ongoing Medicare funding pressures, there are adjustments we can make to partially offset these rate pressures and reductions for a particular period. For example, we can seek to intensify our medical and operating cost management, make changes to the size and composition of our care provider networks, adjust member benefits and implement or increase the member premiums supplementing the monthly payments we receive from the government. Additionally, we decide annually on a county-by-county basis where we will offer Medicare Advantage plans.\nSELECTED OPERATING PERFORMANCE AND OTHER SIGNIFICANT ITEMS\nThe following summarizes select\n2025 year-over-year operating comparisons to\n2024 and other financial results.\nConsolidated revenues grew 12%, UnitedHealthcare revenues grew 16% and Optum revenues grew 8%.\nUnitedHealthcare served 795,000 more people, primarily driven by growth in Medicare Advantage.\nConsolidated earnings from operations of $4.3 billion compared to $8.7 billion last year, with 2025 impacted by elevated medical cost trend and 2024 impacted by the Change Healthcare cyberattack.\nDiluted earnings per common share were $2.59.\nCash flows from operations for the nine months ended September 30, 2025 were $18.6 billion.\nRESULTS SUMMARY\nThe following table summarizes our consolidated results of operations and other financial information:\n(in millions, except percentages and per share data)\nInvestment and other income\nCost of products sold\nDepreciation and amortization\nTotal operating costs\nEarnings from operations\nLoss on sale of sub"
}