{
  "source_file": "unp-20241231.htm",
  "form_type": "10-K",
  "item1_clean": "GENERAL\nUnion Pacific Railroad Company is the principal operating company of Union Pacific Corporation. One of America's most recognized companies, Union Pacific Railroad Company connects 23 states in the western two-thirds of the country by rail, providing a critical link in the global supply chain. The Railroad’s diversified business mix includes Bulk, Industrial, and Premium. Union Pacific serves many of the fastest-growing U.S. population centers, operates from all major West Coast and Gulf Coast ports to Eastern gateways, connects with Canada's rail systems, and is the only railroad serving all six major Mexico gateways. Union Pacific provides value to its roughly 10,000 customers by delivering products in a safe, reliable, fuel-efficient, and environmentally responsible manner.\nUnion Pacific Corporation was incorporated in Utah in 1969 and maintains its principal executive offices at 1400 Douglas Street, Omaha, NE 68179. The telephone number at that address is (402) 544-5000. The common stock of Union Pacific Corporation is listed on the New York Stock Exchange (NYSE) under the symbol “UNP”.\nFor purposes of this report, unless the context otherwise requires, all references herein to \"Union Pacific\", “UPC”, “Corporation”, “Company”, “we”, “us”, and “our” shall mean Union Pacific Corporation and its subsidiaries, including Union Pacific Railroad Company, which we separately refer to as “UPRR” or the “Railroad”.\nSTRATEGY\nSafety, Service, and Operational Excellence supports the Company's long-term initiative to Grow its freight volumes. Together as a team, the Company will focus on achieving the best safety record in the industry, being known for superior service, grounded in operational excellence, which, in turn, drives growth.\nis paramount and, as our first area of focus, sets the foundation for achieving the Company's objectives. The mindset and culture are built around a personal commitment by all employees to prioritize safety so everyone goes home safely.\nis all about delivering what we sold our customers. We work with our customers to understand the service they need to win in their markets and then drive how we win together. We commit to these service levels and do it with excellence.\nOperational Excellence\nis about operating efficiently and productively. We will drive value with our available resources but also maintain a buffer so our service is resilient, managing the inevitable ups and downs that come with weather, fluctuating volumes, and securing growth.\nis the outcome of executing our strategy to be the industry leader in both safety and service resulting in improved margins and greater cash generation, creating long term enterprise value. The expected outcome of successfully executing our strategy will be an industry leading operating ratio and return on invested capital.\nAs we work to transform our railroad, our core values continue to guide us. Our passion for performance will help us win; our high ethical standards ensure we win in a way that supports all of our stakeholders; and our teamwork ensures we win together.\nOPERATIONS\nThe Railroad, along with its subsidiaries and rail affiliates, is our one reportable operating segment. Although we provide and analyze revenues by commodity group, we treat the financial results of the Railroad as one segment due to the integrated nature of our rail network. Additional information regarding our business and operations, including revenues, financial information and data, and other information regarding environmental matters, is presented in Risk Factors, Item 1A; Legal Proceedings, Item 3; Management’s Discussion and Analysis of Financial Condition and Results of Operations, Item 7; and the Financial Statements and Supplementary Data, Item 8.\n– UPRR is a Class I railroad operating in the U.S. We have 32,880 route miles, connecting Pacific Coast and Gulf Coast ports with the Midwest and Eastern U.S. gateways and providing several corridors to key Mexican and Canadian gateways. We serve the western two-thirds of the country and maintain coordinated schedules with other rail carriers to move freight to and from the Atlantic Coast, the Pacific Coast, the Southeast, the Southwest, Canada, and Mexico. Export and import traffic moves through Gulf Coast, Pacific Coast, and East Coast ports and across the Mexican and Canadian borders. In 2024, we generated freight revenues totaling $22.8 billion from the following three commodity groups:\n2024 Freight Revenues\n– The Company's Bulk shipments consist of grain and grain products, fertilizer, food and refrigerated, and coal and renewables. In 2024, this group generated 32% of our freight revenues. We access most major grain markets, connecting the Midwest and Western U.S. producing areas to export terminals in the Pacific Northwest and Gulf Coast ports as well as Mexico. We also serve significant domestic markets, including grain processors, animal feeders, ethanol, and renewable biofuel producers in the Midwest and West. Fertilizer movements originate in the Gulf Coast region, Midwest, Western U.S., and Canada (through interline access) for delivery to major agricultural users in those areas as well as abroad. The Railroad’s network supports the transportation of coal shipments to independent and regulated power companies and industrial facilities throughout the U.S. Through interchange gateways and ports, UPRR’s reach extends to Eastern U.S. utilities as well as to Mexico and other international destinations. Coal traffic originating in the Powder River Basin (PRB) area of Wyoming is the largest portion of the Railroad’s coal business.\n– Our extensive network facilitates the movement of numerous commodities between thousands of origin and destination points throughout North America. The Industrial group consists of several categories, including construction, industrial chemicals, plastics, forest products, specialized products (primarily waste, salt, and roofing), metals and ores, petroleum, liquid petroleum gases (LPG), soda ash, and sand. Transportation of these products accounted for 37% of our freight revenues in 2024. Commercial, residential, and governmental infrastructure investments drive shipments of steel, aggregates, cement, and wood products. Industrial and light manufacturing plants receive steel, nonferrous materials, minerals, and other raw materials.\nThe industrial chemicals market consists of a vast number of chemical compounds that support the manufacturing of more complex chemicals. Plastics shipments support automotive, housing, and the durable and disposable consumer goods markets. Forest product shipments include lumber and paper commodities. Lumber shipments originate primarily in the Pacific Northwest or Western Canada and move throughout the U.S. for use in new home construction and repairs and remodeling. Paper shipments primarily support packaging needs. Oil and gas drilling generates demand for raw steel, finished pipe, stone, and drilling fluid commodities. The Company’s petroleum and LPG shipments are primarily impacted by refinery utilization rates, regional crude pricing differentials, pipeline capacity, and the use of asphalt for road programs. Soda ash originates in southwestern Wyoming and California, destined for chemical and glass producing markets in North America and abroad.\n– In 2024, Premium shipments generated 31% of Union Pacific’s total freight revenues. Premium includes finished automobiles, automotive parts, and merchandise in intermodal containers, both domestic and international. International business consists of import and export traffic moving in 20 or 40-foot shipping containers, that mainly pass through West Coast ports, destined for one of the Company's many inland intermodal terminals. Domestic business includes container and trailer traffic picked up and delivered within North America for intermodal marketing companies (primarily shipper agents and logistics companies) as well as truckload carriers.\nWe are the largest automotive carrier west of the Mississippi River and operate or access 39 vehicle distribution centers. The Railroad’s extensive franchise accesses six vehicle assembly plants and connects to West Coast ports, all six major Mexico gateways, and the Port of Houston to accommodate both import and export shipments. In addition to transporting finished vehicles, the Company provides expedited handling of automotive parts in both boxcars and intermodal containers destined for Mexico, the U.S., and Canada.\n– Some of the commodities we carry have peak shipping seasons, reflecting either or both the nature of the commodity (such as certain agricultural and food products that have specific growing and harvesting seasons) and the demand cycle for the commodity (such as intermodal traffic that generally peaks during the third quarter to meet back-to-school and holiday-related demand for consumer goods during the fourth quarter). The peak shipping seasons for these commodities can vary considerably each year depending upon various factors, including the strength of domestic and\ninternational economies and currencies; consumer demand; the strength of harvests, which can be adversely affected by severe weather; market prices for agricultural products; and supply chain disruptions.\nProud & Engaged Workforce\n– Our employees are central to our strategy of Safety, Service, and Operational Excellence leading to Growth, and investing in our workforce is key to our success.\nOur award-winning, multigenerational workforce includes talented people from all walks of life, in many stages of life. Made up of management and craft professionals, we are focused on attracting, retaining, and developing talent across our entire system.\nAs of December 31, 2024, the Company employed 32,439 employees. Our workforce includes five generations from Traditionalists (born before 1946) to Generation Z (born after 1998). The average age is 46.9 with an average tenure of 16.2\n\nUnion Pacific works with 13 major rail unions, representing approximately 84% of our workforce. Pursuant to the Railway Labor Act (RLA), a federal statute enacted in 1926, our collective bargaining agreements are subject to modification every five years. Existing agreements remain in effect until new agreements are ratified or until the RLA procedures are exhausted. The RLA is designed to bring the railroads and unions to agreement without disruptions to rail transportation. Local negotiations began on January 1, 2025, related to years 2025-2029.\nAt Union Pacific, the How Matters – high ethical standards guide the decisions we make and action we take to protect our employees, communities, and customers. Our passion for performance drives our safety, customer experience, and financial results while we work as a team to create opportunity for all.\nSafety is central to everything we do at Union Pacific. Together, we are committed to cultivating a safety-focused culture, so our employees return home safely every day. To achieve this, our employees identify risks, initiate action to mitigate those risks, and have the courage to care to keep each other safe.\nOur success is measured by our personal injury rate (the number of reportable injuries for every 200,000 employee-hours worked) and our derailment incident rate (the number of reportable derailment incidents per million train miles). Reportable personal injuries are defined as on duty incidents or occupational illnesses that result in employees losing time away from work, modifying or restricting their normal duties, or receiving any medical treatment above and beyond first aid. Reportable derailment incidents are defined as any occurrence where a wheel of a locomotive or rail car falls off the track and causes damage to track, equipment, or structures above the Federal Railroad Administration (FRA) reporting threshold, regardless of ownership\nfor 2025) per million train miles. Personal injuries and derailment incidents th",
  "item7_clean": "Property and Depreciation\n– See Note 11 to the Financial Statements and Supplementary Data, Item 8.\nAssets purchased or constructed throughout the year are capitalized if they meet applicable minimum units of property.\nEstimated service lives of depreciable railroad property may vary over time due to changes in physical use, technology, asset strategies, and other factors that will have an impact on the retirement profiles of our assets. We are not aware of any specific factors that are reasonably likely to significantly change the estimated service lives of our assets. Actual use and retirement of our assets may vary from our current estimates, which would impact the amount of depreciation expense recognized in future periods.\nChanges in estimated useful lives of our assets due to the results of our depreciation studies could significantly impact future periods’ depreciation expense and have a material impact on our Consolidated Financial Statements. If the estimated useful lives of all depreciable assets were increased by one year, annual depreciation expense would decrease by approximately $73 million. If the estimated useful lives of all depreciable assets were decreased by one year, annual depreciation expense would increase by approximately $78 million. We are projecting an increase in our depreciation expense of approximately 3% to 4% in 2025 versus 2024. This is driven by an increase in our projected depreciable asset base.\n– See Note 5 to the Financial Statements and Supplementary Data, Item 8.\nThe critical assumptions used to measure pension obligations and expenses are the discount rates and expected rate of return on pension assets.\nWe evaluate our critical assumptions at least annually, and selected assumptions are based on the following factors:\nWe measure the service cost and interest cost components of our net periodic pension benefit/cost by using individual spot rates matched with separate cash flows for each future year. Discount rates are based on a Mercer yield curve of high-quality corporate bonds (rated AA by a recognized rating agency).\nExpected return on plan assets is based on our asset allocation mix and our historical return, taking into consideration current and expected market conditions.\nThe following tables present the key assumptions used to measure net periodic pension benefit/cost for 2025 and the estimated impact on 2025 net periodic pension benefit/cost relative to a change in those assumptions:\nDiscount rate for benefit obligations\nDiscount rate for interest on benefit obligations\nDiscount rate for service cost\nDiscount rate for interest on service cost\nExpected return on plan assets\n0.25% decrease in discount rates\n0.25% decrease in expected return on plan assets\nThe following table presents the net periodic pension benefit/cost for the years ended December 31:\nNet periodic pension (benefit)/cost\nCAUTIONARY INFORMATION\nCertain statements in this report, and statements in other reports or information filed or to be filed with the SEC (as well as information included in oral statements or other written statements made or to be made by us), are, or will be, forward-looking statements as defined by the Securities Act of 1933 and the Securities Exchange Act of 1934. These forward-looking statements and information include, without limitation, statements in the CEO’s letter preceding Part I; statements regarding planned capital expenditures under the caption “2025 Capital Plan” in Item 2 of Part I; and statements and information set forth under the captions “2025 Outlook”; “Liquidity and Capital Resources” in Item 7 of Part II regarding our capital plan, share repurchase programs, contractual obligations, \"Pension Benefits\", and \"Other Matters\" in this Item 7 of Part II. Forward-looking statements and information also include any other statements or information in this report (including information incorporated herein by reference) regarding: potential impacts of public health crises, including pandemics, epidemics, and the outbreak of other contagious disease, such as COVID; the Russia-Ukraine and Israel-Hamas wars and other geopolitical tensions in the Middle East, and any impacts on our business operations, financial results, liquidity, and financial position, and on the world economy (including customers, employees, and supply chains), including as a result of fluctuations in volumes and carloadings; closing of customer manufacturing, distribution or production facilities; expectations as to operational or service improvements; expectations as to hiring challenges; availability of employees; expectations regarding the effectiveness of steps taken or to be taken to improve operations, service, infrastructure improvements, and transportation plan modifications (including those discussed in response to increased traffic); expectations as to cost savings, revenue growth, and earnings; the time by which goals, targets, aspirations, or objectives will be achieved; projections, predictions, expectations, estimates, or forecasts as to our business, financial, and operational results, future economic performance, and general economic conditions; proposed new products and services; estimates of costs relating to environmental remediation and restoration; estimates and expectations regarding tax matters; estimates and expectations regarding potential tariffs; expectations that claims, litigation, environmental costs, commitments, contingent liabilities, labor negotiations or agreements, cyber-attacks, or other matters will not have a material adverse effect on our consolidated results of operations, financial condition, or liquidity and any other similar expressions concerning matters that are not historical facts. Forward-looking statements may be identified by their use of forward-looking terminology, such as “believes,” “expects,” “may,” “should,” “would,” “will,” “intends,” “plans,” “estimates,” “anticipates,” “projects” and similar words, phrases, or expressions.\nForward-looking statements should not be read as a guarantee of future performance, results, or outcomes, and will not necessarily be accurate indications of the times that, or by which, such performance, results or outcomes will be achieved, if ever. Forward-looking statements and information are subject to risks and uncertainties that could cause actual performance or results to differ materially from those expressed in the statements and information. Forward-looking statements and information reflect the good faith consideration by management of currently available information, and may be based on underlying assumptions believed to be reasonable under the circumstances. However, such information and assumptions (and, therefore, such forward-looking statements and information) are or may be subject to variables or unknown or\nunforeseeable events or circumstances over which management has little or no influence or control, and many of these risks and uncertainties are currently amplified by and may continue to be amplified by, or in the future may be amplified by, among other things, macroeconomic and geopolitical conditions.\nForward-looking statements speak only as of the date the statement was made. We assume no obligation to update forward-looking information to reflect actual results, changes in assumptions, or changes in other factors affecting forward-looking information. If we do update one or more forward-looking statements, no inference should be drawn that we will make additional updates with respect thereto or with respect to other forward-looking statements.\n\nAs reported to the STB.\nGross and Revenue Ton-Miles\n– Gross ton-miles are calculated by multiplying the weight of loaded and empty freight cars by the number of miles hauled. Revenue ton-miles are calculated by multiplying the weight of freight by the number of tariff miles. In 2024, gross ton-miles increased 1% and revenue ton-miles decreased 1%, while carloadings were up 3% year-over-year. Changes in commodity mix drove the year-over-year variances between gross ton-miles, revenue ton-miles, and carloads due to lower coal shipments, which are heavier, and increased international intermodal shipments that are lighter.\nFreight Car Velocity\n– Freight car velocity measures the average daily miles per car on our network. The two key drivers of this metric are the speed of the train between terminals (average train speed) and the time a rail car spends at the terminals (average terminal dwell time). Freight car velocity increased 2% driven by record terminal dwell levels. The 2023 metrics were negatively impacted by operational challenges caused by weather in the first quarter and train crew shortages in some locations in the first half of 2023, positively impacting the year-over-year comparison.\nLocomotive Productivity\n– Locomotive productivity is gross ton-miles per average daily locomotive horsepower. Locomotive productivity improved 5% in 2024 compared to 2023 driven by improved network fluidity and asset utilization despite maintaining a buffer in 2024 to flex the fleet size as we experienced and subsequently recovered from certain weather events and reacted to higher volume levels.\n– Train length is the average maximum train length on a route measured in feet. Our train length increased 1% compared to 2023 due to train length improvement initiatives and increases in international intermodal shipments, which generally move on longer trains, partially offset by declines in coal train length.\nService Performance Index (SPI)\n– SPI is a ratio of the service customers are currently receiving relative to the best monthly performance over the last three years. Measuring our performance relative to a historical benchmark demonstrates our focus on continuously improving service for our customers, and we believe it is a better indicator of service performance than the previously disclosed trip plan compliance. SPI does not replace the service commitments we have contractually agreed to with a small number of customers. SPI is calculated for intermodal and manifest products. Intermodal SPI improved 2 points, at the same time international volume surged. Manifest SPI improved 4 points in 2024 compared to 2023.\nWorkforce Productivity\n– Workforce productivity is average daily car miles per employee. Workforce productivity improved 6% in 2024 as average daily car miles increased 2% and employees decreased 4% compared to 2023. Our active TE&Y workforce increased to support carload demand and increased crew needs associated with labor agreements that went into effect in the third quarter of 2023. In addition, we are maintaining an adequate training pipeline to provide a capacity buffer to enable responsiveness in an ever-changing demand and operating environment.\n– Operating ratio is our operating expenses reflected as a percentage of operating revenues. Our operating ratio of 59.9% improved 2.4 points compared to 2023 driven by productivity initiatives, core pricing gains, and the year-over-year impact from lower fuel prices, partially offset by inflation and other costs. In addition, operating ratio year-over-year comparison was positively impacted by 2024 contract settlements, a 2024 gain on the sale of intermodal equipment, and lower labor agreement ratification charges than in 2023.\nReturn on Average Common Shareholders’ Equity\nMillions, Except Percentages\n\nOther includes bridges and tunnels, signals, other road assets, and road work equipment.\nLocomotives and freight cars include lease buyouts of $143 million, $57 million, and $70 million in 2024, 2023, and 2022, respectively.\nWeather-related damages for 2024, 2023, and 2022 are immaterial.\n– In 2025, we expect our capital plan to be approximately $3.4 billion, consistent with 2024. We plan to continue to make investments to support our growth strategy, improve the safety, resiliency, and operational efficiency of the network, harden our infrastructure, and replace older assets, including modernization of our locomotive fleet and acquiring freight cars to support replacement and growth opportunities. In addition, the plan includes investments in growth-related projects to drive more carloads to the network and enhance productivity. This includes siding construction and extension projects, terminal investments supporting our manifest network, and invest in certain ramps to efficiently handle volumes from new and existing intermodal customers. The capital plan may be revised if business conditions warrant or if laws or regulations affect our ability to generate sufficient returns on these investments.\nFinancing Activities\nCash used in financing activities increased in 2024 compared to 2023 driven by an increase in share repurchases and a decrease in debt issued, partially offset by a decrease in the repayment of commercial paper.\nSee Note 14 to the Financial Statements and Supplementary Data, Item 8, for a description of all our outstanding financing arrangements and significant new borrowings, and Note 18 to the Financial Statements and Supplementary Data, Item 8, for a description of our share repurchase programs.\nOTHER MATTERS\n– For capital-intensive companies, inflation significantly increases asset replacement costs for long-lived assets. As a result, assuming that we replace all operating assets at current price levels, depreciation charges (on an inflation-adjusted basis) would be substantially greater than historically reported amounts.\nSensitivity Analyses\n– The sensitivity analyses that follow illustrate the economic effect that hypothetical changes in interest and tax rates could have on our results of operations and financial condition. These hypothetical changes do not consider other factors that could impact actual results.\n– At December 31, 2024, we did not have variable-rate debt.\nMarket risk for fixed-rate debt is estimated as the potential increase in fair value resulting from a hypothetical 1% decrease in interest rates as of December 31, 2024, and totals an increase of approximately $3.0 billion to the fair value of our debt at December 31, 2024. We estimated the fair values of our fixed-rate debt by considering the impact of the hypothetical interest rates on quoted market prices and current borrowing rates.\n– Our deferred tax assets and liabilities are measured based on current tax law. Future tax legislation, such as a change in the federal corporate tax rate, could have a material impact on our financial condition, results of operations, or liquidity. For example, a future, permanent 1% increase in our federal income tax rate would increase our deferred tax liability by approximately $525 million. Similarly, a future, permanent 1% decrease in our federal income tax rate would decrease our deferred tax liability by approximately $525 million.\nAccounting Pronouncements\n– See Note 3 to the Financial Statements and Supplementary Data, Item 8.\nAsserted and Unasserted Claims\n– See Note 17 to the Financial Statements and Supplementary Data, Item 8.\n– See Note 17 to the Financial Statements and Supplementary Data, Item 8.\n– Climate change could have an adverse impact on our operations and financial performance (see Risk Factors under Item 1A of this report). We utilize climate scenario analyses to better understand climate-related risks and opportunities the Company may face in the future under a range of potential scenarios. We continue to refine our approach to understand climate-related risks and are taking an iterative approach in our business planning processes as risk factors, solutions, and technology develop. However, we are unable to predict the likelihood, manner, severity, or ultimate financial impact of actual future incidents as climate scenario analysis considers a range of potential outcomes.\nWe continue to take steps and explore opportunities to reduce our operational impact on the environment, including improving our operational fluidity to increase fuel efficienc",
  "item2_clean": null
}