{
  "source_file": "ups-20250930.htm",
  "form_type": "10-Q",
  "item1_clean": null,
  "item7_clean": null,
  "item2_clean": "Three Months Ended September 30,\nAverage Daily Package Volume (in thousands):\nTotal Average Daily Package Volume\nAverage Revenue Per Piece:\nTotal Average Revenue Per Piece\nOperating Days in Period\nRevenue (in millions):\nOperating Expenses (in millions):\nNon-GAAP Adjustments to Operating Expenses\nTransformation Strategy Costs\nGoodwill and Asset Impairment Charges\nN/A\nNon-GAAP Adjusted Operating Expenses\nOperating Profit (in millions) and Operating Margin:\nNon-GAAP Adjusted Operating Profit\nNon-GAAP Adjusted Operating Margin\nThe change in revenue was due to the following:\nRevenue Change Drivers:\nThird quarter 2025 vs. 2024\nYear to date 2025 vs. 2024\nComparative results were impacted by one less operating day in the nine months ended September 30, 2025. The growth in rates and product mix shown above includes the growth in our air cargo product during both the third quarter and the year-to-date periods in 2025, as air cargo under our contract with the USPS was fully onboarded during the fourth quarter of 2024. Air cargo is measured by dimensional weight, not on a per piece basis, and therefore does not impact the volume and revenue per piece discussions below.\nUNITED PARCEL SERVICE, INC. AND SUBSIDIARIES\nMANAGEMENT'S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND\nRESULTS OF OPERATIONS\nAverage daily volume decreased for both the quarter and year-to-date periods, driven by our strategic execution of planned volume declines from our largest customer, challenging market conditions and decreases in our Ground Saver product as a result of pricing actions we are taking with respect to certain e-commerce volume.\nResidential (\"business-to-consumer\") and commercial (\"business-to-business\") volume decreased for both the quarter and year-to-date periods. Business-to-business volume decreased 4.8% for the quarter (down 1.9% year to date), primarily driven by demand softness within the retail and manufacturing sectors. Business-to-consumer volume decreased 17.6% for the quarter (down 11.9% year to date), as a result of the planned volume declines and pricing actions discussed above. These overall declines were partially offset by continued growth from SMBs who leveraged our Digital Access Program.\nWithin our Air products, average daily volume decreased 13.9% for the quarter (down 11.7% year to date), driven by the continued execution of planned volume declines from our largest customer, partially offset by increased demand from customers in the healthcare and technology sectors.\nGround average daily volume decreased 12.0% for the quarter (down 7.1% year to date) driven by residential volume decreases of 17.4% for the quarter (down 11.2% year to date) which were primarily as a result of the pricing actions discussed above.\nRevenue per piece increased 9.8% for the quarter (up 6.5% year to date), with increases in both Air and Ground products due to favorable trends in customer and product mix as a result of pricing actions we are taking. Changes in package characteristics and fuel surcharges also contributed to the increase in revenue per piece.\nIn December 2024, we implemented an average 5.9% net increase in base and accessorial rates for both our Air and Ground products, which also contributed to the increase.\nWe apply a fuel surcharge on our domestic air and ground services that adjusts weekly. Our air fuel surcharge is based on the U.S. Department of Energy's (\"DOE\") Gulf Coast spot price for a gallon of kerosene-type fuel, and our ground fuel surcharge is based on the DOE's On-Highway Diesel Fuel price.\nFuel surcharge revenue increased $141 million for the quarter (up $166 million year to date), as pricing initiatives more than offset the impact of lower volume.\nOperating expenses and non-GAAP adjusted operating expenses decreased for both the quarter and year-to-date periods primarily due to a decline of $398 million for the quarter (down $998 million year to date) in facility and transportation-related costs driven by the insourcing of our Ground Saver product.\nThese decreases were partially offset by:\nCompensation and benefits expense attributable to our Air and Ground products increased $141 million for the quarter (up $589 million year to date). The increases were primarily driven by increased hours resulting from additional stops as a result of the insourcing of our Ground Saver product. Increased seniority and contractual wage rate increases within our U.S. union workforce and workers' compensation expense also drove an increase to compensation and benefits expense. These increases were partially offset by reduced headcount resulting from the strategic execution of our\nNetwork Reconfiguration\nEfficiency Reimagined\nAir cargo expense increased $64 million for the quarter (up $490 million year to date) as we fully onboarded our contract with the USPS during the fourth quarter of 2024.\nOther expenses increased $56 million for the quarter (down $216 million year to date). For the year-to-date period, other expenses decreased driven by gains on real estate and aircraft engine sales and a reduction in costs resulting from the strategic execution of our\nNetwork Reconfiguration\nEfficiency Reimagined\nUNITED PARCEL SERVICE, INC. AND SUBSIDIARIES\nMANAGEMENT'S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND\nRESULTS OF OPERATIONS\nOur non-GAAP adjusted operating expenses exclude the impact of transformation strategy costs of $302 and $76 million in the third quarters of 2025 and 2024, respectively, and $400 and $93 million in the 2025 and 2024 year-to-date periods, respectively. The 2024 year-to-date period non-GAAP adjusted operating expenses also excluded asset impairment charges of $5 million. Transformation strategy costs during both the 2025 and 2024 periods relate to our Fit to Serve and Transformation 2.0 programs. The costs in the 2025 periods also include costs related to our\nNetwork Reconfiguration\nEfficiency Reimagined\nprograms. Within these programs, we incurred compensation and benefits costs, as well as fees paid to outside professional service providers. See\nSupplemental Information - Items Affecting Comparability\nfor additional discussion of transformation strategy costs excluded from our non-GAAP financial measures.\nCost per piece increased 12.3% during the third quarter of 2025 (up 7.2% year to date). Non-GAAP adjusted cost per piece increased 10.4% during the third quarter of 2025 (up 6.4% year to date). The increase in cost per piece was primarily driven by increased compensation and benefits costs from the insourcing of our Ground Saver product in addition to lower average daily volume. These impacts were not fully offset by the benefits of our cost-saving initiatives.\nUNITED PARCEL SERVICE, INC. AND SUBSIDIARIES\nMANAGEMENT'S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND\nRESULTS OF OPERATIONS\nInternational Package\n\nprograms and anticipated lower volumes, including early asset retirement, lease related costs and gains from the sale of properties. It is our intention to exit or abandon leases, sell property and transfer or dispose of equipment associated with closed facilities. During the first nine months of 2025, we incurred $45 million in accelerated depreciation and asset retirement obligations related to closed facilities and abandoned equipment and $54 million in gains on sale of properties. We expect the costs associated with these actions may increase should we determine to close additional buildings.\nFor more information regarding transformation strategy costs, see note 17 to the unaudited, consolidated financial statements.\nGoodwill and Asset Impairment Charges\nWe exclude the impact of goodwill and certain asset impairment charges, including impairments of long-lived assets and equity method investments. We do not consider these non-cash charges when evaluating the operating performance of our business units, making decisions to allocate resources or in determining incentive compensation awards. For more information regarding goodwill and asset impairment charges, see note 5 and note 8 to the unaudited, consolidated financial statements.\nExpense for Regulatory Matter\nWe have excluded the impact of an expense to settle a previously disclosed regulatory matter. We do not believe this is a component of our ongoing operations and we do not expect this or similar expenses to recur.\nOne-Time Payment for International Regulatory Matter\nGain and Losses Related to Divestitures\nWe exclude the impact of gains (or losses) related to the divestiture of businesses. We do not consider these transactions to be a component of our ongoing operations, nor do we consider the impact of these transactions when evaluating the operating performance of our business units, making decisions to allocate resources or in determining incentive compensation awards.\nUNITED PARCEL SERVICE, INC. AND SUBSIDIARIES\nMANAGEMENT'S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND\nRESULTS OF OPERATIONS\nReversal of Income Tax Valuation Allowance\nWe previously recorded non-GAAP adjustments for transactions that resulted in capital loss deferred tax assets not expected to be realized. As a result of property sales during 2025, we now expect all of these capital losses to be realized. We supplement our presentation with non-GAAP adjusted financial measures that exclude the impact of the reversals of the valuation allowances against these deferred tax assets as we believe such treatment is consistent with how the valuation allowance was initially established.\nNon-GAAP Adjusted Cost per Piece\nWe evaluate the efficiency of our operations using various metrics, including non-GAAP adjusted cost per piece. Non-GAAP adjusted cost per piece is calculated as non-GAAP adjusted operating expenses in a period divided by total volume for that period. Because non-GAAP adjusted operating expenses exclude costs or charges that we do not consider a part of underlying business performance when monitoring and evaluating the operating performance of our "
}