{
  "source_file": "ups-20241231.htm",
  "form_type": "10-K",
  "item1_clean": "Failure to attract or retain qualified employees could materially adversely affect us\" and \"- Strikes, work stoppages or slowdowns by our employees could materially adversely affect us\".\nWe have approximately 490,000 employees (excluding temporary seasonal employees), of which 406,000 are in the U.S. and 84,000 are located internationally. Our global workforce includes approximately 78,000 management employees (38% of whom are part-time) and 412,000 hourly employees (50% of whom are part-time). More than 75% of our U.S. employees are represented by unions, primarily those employees handling or transporting packages. Many of these employees are employed under a national master agreement and various supplemental agreements with local unions affiliated with the International Brotherhood of Teamsters (\"Teamsters\"). Our national master agreement with the Teamsters expires on July 31, 2028. In addition, approximately 3,300 of our pilots are represented by the Independent Pilots Association (\"IPA\"). Our agreement with the IPA becomes amendable September 1, 2025. We have approximately 1,900 airline mechanics who are covered by a collective bargaining agreement with Teamsters Local 2727 which becomes amendable November 1, 2026. In addition, approximately 3,000 of our auto and maintenance mechanics who are not represented by the IBT are employed under a collective bargaining agreement with the International Association of Machinists and Aerospace Workers (\"IAM\"). In July 2024, the IAM ratified a new collective bargaining agreement that will expire on July 31, 2029.\nDuring 2024, we executed under our \"Fit to Serve\" initiative, intended to right-size our business and create a more efficient operating model to enhance responsiveness to changing market dynamics. During 2024, we reduced our workforce by approximately 14,000 positions, primarily within management. Fit to Serve is expected to conclude in 2025.\nIn January 2025, we announced a reconfiguration of our U.S. network and\nEfficiency Reimagined\ninitiatives. We expect these actions to result in decreases in the size of our operational and management workforce. For additional information on the expected operational and financial impacts of these initiatives, see “Management’s Discussion and Analysis of Financial Condition and Results of Operations”.\nOversight and management\nOur board, directly and through the Compensation and Human Capital Committee, is responsible for oversight of human capital matters. Effective oversight is accomplished through a variety of methods and processes including regular updates and discussions around human capital transformation efforts, technology initiatives impacting the workforce, health and safety matters, employee survey results related to culture and other matters, hiring and retention, employee backgrounds, labor relations and contract negotiations, compensation and benefits, succession planning and employee training initiatives.\nIn addition, the Compensation and Human Capital Committee charter includes oversight responsibility for performance and talent management, workforce representation, work culture and employee development and retention. We believe the board’s oversight of these matters helps identify and mitigate exposure to labor and human capital management risks and is part of the broader framework that guides how we attract, retain and develop a workforce that aligns with our values and strategies.\nAdditional information on our human capital efforts is contained in our annual sustainability report, which describes our activities that support our commitment to acting responsibly and contributing to society. This report is available under the heading \"Our Impact\" at www.about.ups.com.\nCollective bargaining\nWe bargain in good faith with the unions that represent our employees. We frequently engage union leaders at the national level and at local chapters throughout the United States. We participate in works councils and associations outside the U.S., which allows us to respond to emerging issues abroad. This work helps our operations to build and maintain productive relationships with our employees. For additional information regarding employees employed under collective bargaining agreements, see note 6 to the audited, consolidated financial statements.\nEmployee health and safety\nWe seek to provide industry-leading employee health, safety and wellness programs across our workforce. UPS's Comprehensive Health and Safety Program (\"CHSP\") is an occupational health and safety system tailored to our varied operational environments.\nOur CHSP covers a wide array of roles, from package handling to administration, and spans geographical boundaries to include sorting facilities, mobile logistics, administrative offices, and other locations worldwide. UPS conducts audits to assess specific risks and hazards, including equipment safety, workplace environment, and emergency response protocols. We monitor our safety performance through various measurable targets, including recordable injury frequency, lost time injury frequency and the number of recorded auto accidents.\nBuilding and maintaining long-term customer relationships through superior service is a competitive strength of UPS. In 2024, we served 1.6 million shipping customers and more than 10.1 million delivery recipients daily. For the year ended December 31, 2024, one customer, Amazon.com, Inc. and its affiliates, represented approximately 11.8% of our consolidated revenues, substantially all of which was within our U.S. Domestic Package segment. In the first quarter of 2025, we entered into an agreement in principle with this customer that will provide for a reduction in their volume by more than 50% by June 2026. For additional information on the expected operational and financial impacts arising from this agreement, see “Management’s Discussion and Analysis of Financial Condition and Results of Operations”. For additional information on this and other customers, see \"Risk Factors - Business and Operating Risks - Changes in our relationships with any of our significant customers, including the loss or reduction in business from one or more of them, could have a material adverse effect on us\" and note 14 to the audited, consolidated financial statements.\nWe offer a broad array of transportation and logistics services and compete with many local, regional, national and international logistics providers as well as national postal services. We believe our strategy, network and competitive strengths position us well to compete in the marketplace. For additional information on our competitive environment, see \"Risk Factors - Business and Operating Risks - Our industry is rapidly evolving. We expect to continue to face significant competition, which could materially adversely affect us\".\nGovernment Regulation\nWe are subject to numerous laws and regulations in the countries in which we operate. Continued compliance with increasingly stringent laws, regulations and policies in the U.S. and in the other countries in which we operate may result in materially increased costs, or we could be subject to substantial fines or possible revocation of our authority to conduct our operations.\nThe U.S. Department of Transportation (\"DOT\"), the Federal Aviation Administration (\"FAA\") and the U.S. Department of Homeland Security, through the Transportation Security Administration (\"TSA\"), have primary regulatory authority over our air transportation services.\nThe DOT’s authority primarily relates to economic aspects of air transportation, such as operating authority, insurance requirements, pricing, non-competitive practices, interlocking relations and cooperative agreements. The DOT also regulates international routes, fares, rates and practices and is authorized to investigate and take action against discriminatory treatment of U.S. air carriers abroad. International operating rights for U.S. airlines are usually subject to bilateral agreements between the U.S. and foreign governments or, in the absence of such agreements, by principles of reciprocity. We are also subject to current and potential aviation, health, customs and immigration regulations imposed by governments in other countries in which we operate, including registration and license requirements and security regulations. We have international route operating rights granted by the DOT and we may apply for additional authorities when those operating rights are available and are required for the efficient operation of our international network. The efficiency and flexibility of our international air transportation network is subject to DOT and foreign government regulations and operating restrictions.\nThe FAA’s authority primarily relates to operational, technical and safety aspects of air transportation, including certification, aircraft operating procedures, transportation of hazardous materials, record keeping standards and maintenance activities and personnel. In addition, we are subject to non-U.S. government regulation of aviation rights involving non-U.S. jurisdictions and non-U.S. customs regulation.\nUPS's aircrew, dispatch and aircraft maintenance certification, training, programs and procedures, including aircraft inspection and repair at periodic intervals, are approved for all aircraft and carrier operations under FAA regulations. The future cost of changes and repairs pursuant to these programs and procedures may fluctuate according to aircraft condition, age and the enactment of additional FAA regulatory requirements.\nThe TSA regulates various security aspects of air cargo transportation. Our airport and off-airport locations, as well as our personnel, facilities and procedures involved in air cargo transportation must comply with TSA regulations.\nWe participate in the Civil Reserve Air Fleet (\"CRAF\") program. Our participation in this program allows the U.S. Department of Defense (\"DOD\") to requisition specified UPS aircraft for military use during a national defense emergency. The DOD is required to compensate us for any use of aircraft under the CRAF program. In addition, participation in the CRAF program entitles us to bid for other U.S. Government opportunities including small package and airfreight.\nOur ground transportation of packages in the U.S. is subject to regulation by the DOT and its agency, the Federal Motor Carrier Safety Administration (the \"FMCSA\"). Ground transportation also falls under state jurisdiction with respect to the regulation of operations, safety and insurance. Our ground transportation of hazardous materials in the U.S. is subject to regulation by the DOT's Pipeline and Hazardous Materials Safety Administration. We also must comply with safety and fitness regulations promulgated by the FMCSA, including those relating to drug and alcohol testing and hours of service for drivers. Ground transportation of packages outside of the U.S. is subject to similar regulatory schemes in the countries in which we transport those packages.\nThe Postal Reorganization Act of 1970 created the USPS as an independent establishment of the executive branch of the federal government, and created the Postal Rate Commission, an independent agency, to recommend postal rates. The Postal Accountability and Enhancement Act of 2006 amended the 1970 Act to give the re-named Postal Regulatory Commission revised oversight authority over many aspects of the USPS, including postal rates, product offerings and service standards. As a result of recent changes in the USPS operating model, in January 2025 we announced that we have begun delivering 100% of our SurePost volume. We sometimes participate in proceedings before the Postal Regulatory Commission in an attempt to facilitate compliance with fair competition requirements for competitive services.\nOur ground operations are also subject to compliance with various cargo-security and transportation regulations issued by the U.S. Department ",
  "item7_clean": "Management’s Discussion and Analysis of Financial Condition and Results of Operations\nSupplemental Information - Items Affecting Comparability\nU.S. Domestic Package Operations\nInternational Package Operations\nSupply Chain Solutions Operations\nConsolidated Operating Expenses\nOther Income and (Expense)\nLiquidity and Capital Resources\nCollective Bargaining Agreements\nNew Accounting Pronouncements\nCritical Accounting Estimates",
  "item2_clean": null
}