{
  "source_file": "uri-20250930.htm",
  "form_type": "10-Q",
  "item1_clean": null,
  "item7_clean": null,
  "item2_clean": "Management’s Discussion and Analysis of Financial Condition and Results of Operations (dollars in millions, except per share data, unless otherwise indicated)\nGlobal Economic Conditions\nOur operations are impacted by global economic conditions, including inflation, tariffs, interest rate fluctuations and supply chain constraints, and we take actions to modify our plans to address such economic conditions. To date, the impact from supply chain disruptions has been limited, but we may experience more severe supply chain disruptions in the future. Interest rates on our debt instruments have increased in recent years. For example, in March 2024, United Rentals (North America), Inc. (“URNA”) issued $1.1 billion aggregate principal amount of senior unsecured notes at a 6\npercent interest rate, while URNA's issuance in August 2021 of $750 aggregate principal amount of senior unsecured notes was at a 3 ¾ percent interest rate. Additionally, the weighted average interest rates on our variable debt instruments were 5.5 percent and 1.4 percent for the nine months ended September 30, 2025 and the year ended December 31, 2021, respectively. We have experienced and are continuing to experience inflationary pressures. A portion of inflationary cost increases is passed on to customers. The most significant cost increases that can be, in part, passed on to customers are for fuel and delivery, and there are other costs for which the pass through to customers is less direct, such as repairs and maintenance, and labor. Tariffs could result in the costs we incur being more than anticipated, as well as impact consumer confidence and/or result in declines in construction or industrial activity. The impact of inflation, tariffs and interest rate fluctuations may be significant in the future.\nWe continue to assess the economic environment in which we operate and take appropriate actions to address the economic challenges we face.\nWe are the largest equipment rental company in the world, with an integrated network of 1,739 rental locations. We primarily operate in the United States and Canada, and have a smaller presence in Europe, Australia and New Zealand. Although the equipment rental industry is highly fragmented and diverse, we believe that we are well positioned to take advantage of this environment because, as a larger company, we have more extensive resources and certain competitive advantages. These include a fleet of rental equipment with a total original equipment cost (“OEC”) of $22.8 billion, and a North American branch network that operates in 49 U.S. states and every Canadian province, and serves 99 of the 100 largest metropolitan areas in the U.S. Our size also gives us greater purchasing power, the ability to provide customers with a broader range of equipment and services, the ability to provide customers with equipment that is more consistently well-maintained and therefore more productive and reliable, and the ability to enhance the earning potential of our assets by transferring equipment among branches to satisfy customer needs.\nWe offer our equipment for rent to a diverse customer base that includes construction and industrial companies, manufacturers, utilities, municipalities, homeowners and government entities. Our revenues are derived from the following sources: equipment rentals, sales of rental equipment, sales of new equipment, contractor supplies sales and service and other revenues. Equipment rentals represented 86 percent of total revenues for the nine months ended September 30, 2025.\nFor the past several years, we have executed a strategy focused on improving the profitability of our core equipment rental business through revenue growth, margin expansion and operational efficiencies. In particular, we have focused on customer segmentation, customer service differentiation, rate management, fleet management and operational efficiency. Our general strategy focuses on profitability and return on invested capital, and, in particular, calls for:\nA consistently superior standard of service to customers\noften provided through a single lead contact who can coordinate the cross-selling of the various services we offer throughout our network. We utilize a proprietary software application, Total Control®, which provides our key customers with a single in-house software application that enables them to monitor and manage all their equipment needs. Total Control® is a unique customer offering that enables us to develop strong, long-term relationships with our larger customers. Our digital capabilities, including our Total Control® platform, allow our sales teams to provide contactless end-to-end customer service;\nThe further optimization of our customer mix and fleet mix, with a dual objective\nto enhance our performance in serving our current customer base, and to focus on the accounts and customer types that are best suited to our strategy for profitable growth. We believe these efforts will lead to even better service of our target accounts, primarily large construction and industrial customers, as well as select local contractors. Our fleet team's analyses are aligned with these objectives to identify trends in equipment categories and define action plans that can generate improved returns;\nA continued focus on “Lean” management techniques, including kaizen processes focused on continuous improvement\nWe have a dedicated team responsible for reducing waste in our operational processes, with the objectives of: condensing the cycle time associated with preparing equipment for rent; optimizing our resources for delivery and pickup of equipment; improving the effectiveness and efficiency of our repair and maintenance operations; and implementing customer service best practices;\nThe continued expansion and cross-selling of adjacent specialty and services products, which enables us to provide a\nshop for our customers\n. We believe that the expansion of our specialty business, as exhibited by our acquisition of Yak Access, LLC, Yak Mat, LLC and New South Access & Environmental Solutions, LLC (collectively, “Yak”) in March 2024, as well as our tools and onsite services offerings, further positions United Rentals as a single source provider of total jobsite solutions through our extensive product and service resources and technology offerings; and\nThe pursuit of strategic acquisitions to continue to expand our core equipment rental business,\nas exhibited by our acquisition of assets of Ahern Rentals, Inc. (“Ahern Rentals”) in December 2022. Strategic acquisitions allow us to invest our capital to expand our business, further driving our ability to accomplish our strategic goals.\nPrior to taking actions pertaining to our financial flexibility and liquidity, we assess our available sources and anticipated uses of cash, including, with respect to sources, cash generated from operations and from the sale of rental equipment. In 2025, we have taken the following actions to improve our financial flexibility and liquidity, and to position us to invest the necessary capital in our business:\nAmended our ABL facility, primarily to increase the facility size from $4.25 billion to $4.50 billion and to extend the maturity date to July 2030;\nAmended our term loan facility, which bears interest based on SOFR plus a spread, primarily to reduce this spread.\nAs of September 30, 2025, we had available liquidity of $2.452 billion, comprised of cash and cash equivalents, and availability under the ABL and accounts receivable securitization facilities.\nIn January 2024, our Board of Directors authorized a $1.5 billion share repurchase program, which was completed in the first quarter of 2025. In April 2025, our Board of Directors authorized a new $1.5 billion share repurchase program, and repurchases under this program began in April 2025. Subsequent to the enactment of the new federal tax legislation discussed below (see \"Results of Operations-Other costs/(income)-effective tax rates”) on July 4, 2025, and with consideration of the expected cash flow benefit associated with the legislation, our Board of Directors approved an increase in the size of the current share repurchase program, from $1.5 billion to $2.0 billion. We have repurchased $1.033 billion under this program through September 30, 2025, and intend to repurchase $1.65 billion under the program in 2025, with the remaining $350 under the program carried into 2026. Including the $250 of repurchases made to complete the prior $1.5 billion share repurchase program, we expect to complete $1.9 billion of repurchases in 2025. A 1 percent excise tax is imposed on “net repurchases” (certain purchases minus certain issuances) of common stock. The repurchases above (as well as the total program sizes) do not include the excise tax, which totaled $12 year-to-date through September 30, 2025 (the total excise tax amount relates to both the current program and the prior program that was completed in the first quarter of 2025).\nOur Board of Directors also approved our first-ever quarterly dividend program in January 2023, and the first dividend under the program was paid in February 2023. During the nine months ended September 30, 2025 and 2024, we paid dividends of $350 ($5.37 per share) and $326 ($4.89 per share), respectively. On October 22, 2025, our Board of Directors declared a quarterly dividend of $1.79 per share, payable on November 26, 2025 to stockholders of record on November 12, 2025.\nMerger Termination Benefit.\nIn January 2025, we announced that we had signed a merger agreement to acquire H&E Equipment Services, Inc. d/b/a H&E Rentals (“H&E”). In February 2025, following the termination of that merger agreement, we received a break-up fee of $64. The merger agreement was terminated in the first quarter of 2025, and the merger termination had no impact on the results for the three months ended September 30, 2025. Our results for the nine months ended September 30, 2025 include a net $"
}