{
  "source_file": "uri-20241231.htm",
  "form_type": "10-K",
  "item1_clean": "United Rentals is the largest equipment rental company in the world, operates throughout the United States and Canada, and has a smaller presence in Europe, Australia and New Zealand. The table below presents key information about our business as of and for the years ended December 31, 2024 and 2023. Our business is discussed in more detail below. The data below should be read in conjunction with, and is qualified by reference to, our Management’s Discussion and Analysis and our consolidated financial statements and notes thereto contained elsewhere in this report.\nPERFORMANCE MEASURES\nTotal revenues (in millions)\nEquipment rental revenue percent of total revenues\nEquipment rental revenue variance components:\nYear-over-year change in average original equipment cost (“OEC”)\nAssumed year-over-year inflation impact (1)\nFleet productivity (2)\nContribution from ancillary and re-rent revenue (3)\nTotal equipment rental revenue variance\nPro forma equipment rentals variance components (4):\nYear-over-year change in average OEC\nAssumed year-over-year inflation impact (1)\nFleet productivity (2)\nContribution from ancillary and re-rent revenue (3)\nTotal equipment rental revenue variance\nKey account percent of equipment rental revenue\nNational account percent of equipment rental revenue\nFLEET\nFleet OEC (in billions)\nEquipment rental revenue percent by fleet type:\nGeneral construction and industrial equipment\nAerial work platforms\nGeneral tools and light equipment\nPower and HVAC (heating, ventilating and air conditioning) equipment\nTrench safety equipment\nFluid solutions equipment\nMobile storage equipment and modular office space\nSurface protection mats (5)\nLOCATIONS/PERSONNEL\nApproximate range of branches per district\nApproximate range of districts per region\nRange of regions per division\nINDUSTRY\nEstimated North American market share (6)\nEstimated North American equipment rental industry revenue growth (6)\nCUSTOMERS/SUPPLIERS\nLargest customer percent of total revenues\nTop 10 customers percent of total revenues\nLargest supplier percent of capital expenditures\nTop 10 supplier percent of capital expenditures\nReflects the estimated impact of inflation on the revenue productivity of fleet based on OEC, which is recorded at cost.\nReflects the combined impact of changes in rental rates, time utilization, and mix that contribute to the variance in owned equipment rental revenue. See note 3 to the consolidated financial statements for a discussion of the different types of equipment rentals revenue. Rental rate changes are calculated based on the year-over-year variance in average contract rates, weighted by the prior period revenue mix. Time utilization is calculated by dividing the amount of time an asset is on rent by the amount of time the asset has been owned during the year. Mix includes the impact of changes in customer, fleet, geographic and segment mix.\nReflects the combined impact of changes in the other types of equipment rentals revenue (see note 3 for further detail), excluding owned equipment rental revenue.\nWe completed the acquisition of Ahern Rentals, Inc. (“Ahern Rentals”) in December 2022. The pro forma information includes the standalone, pre-acquisition results of Ahern Rentals. Pro forma information is not reflected above for 2024 versus 2023 because Ahern Rentals was fully included in our results for both years.\nAs discussed in note 4 to the consolidated financial statements, in March 2024, we completed the acquisition of Yak Access, LLC, Yak Mat, LLC and New South Access & Environmental Solutions, LLC (collectively, “Yak”), which was a leading provider of surface protection mats. Prior to the Yak acquisition, we did not rent material amounts of such equipment.\nAs discussed below (see “Industry Overview and Economic Outlook”), North American market share and equipment rental industry revenue are based on industry estimates (excluding party and event rentals) from the American Rental Association (“ARA”). As discussed above, in March 2024, we completed the acquisition of Yak. Estimated North American market share as of December 31, 2024 includes the standalone, pre-acquisition revenue of Yak.\nThe Company’s key human capital management objectives are to attract, retain and develop talent to deliver on the Company’s strategy. To support these objectives, the Company’s human resources programs are designed to: keep people safe and healthy; enhance the Company’s culture through efforts aimed at making the workplace more inclusive; acquire and retain high-performing talent; ensure employees are supported and engaged so they can provide outstanding customer service; reward and support employees through competitive pay and benefit programs; develop talent to prepare them for critical roles and leadership positions; and facilitate internal talent mobility to create a high-performing workforce. See “Locations/Personnel” in the table above for information on employee counts.\nThe Company focuses on the following in managing its human capital:\nWe have a safety program that focuses on implementing management systems, policies and training programs and performing assessments designed to promote proper training of workers and prevention of injuries and incidents. All of our employees are empowered with stop-work authority which enables them to immediately stop any unsafe or potentially hazardous working condition or behavior they may observe. We utilize a mixture of indicators to assess the safety performance of our operations, including total recordable injury rate (TRIR), preventable motor vehicle incidents per million miles, corrective actions and near miss frequency and have disclosed an aspirational goal to further reduce our TRIR. We also recognize outstanding safety behaviors through our annual awards program.\nThe Company’s Live Well, Safe & Healthy program is a comprehensive approach to wellness that encourages healthy behaviors and is intended to raise morale, productivity and overall employee engagement. Through the program, eligible employees can reduce medical plan costs if they complete a health assessment and participate in a biometric screening at work or off-site, and, in 2024, 56 percent of eligible employees did so. The program also includes (i) a paid day off to be used for a wellness exam or day of service, which was used by 91 percent of eligible employees in 2024, (ii) tobacco cessation support and (iii) participation incentives. Additionally, employees and family members can participate in virtual health challenges to encourage daily activity.\nCompensation programs and employee benefits:\nOur compensation and benefits programs provide a package designed to attract, retain and motivate employees. In addition to competitive base salaries, the Company provides a variety of short-term, long-term and commission-based incentive compensation programs to reward performance relative to key financial, human capital and customer experience metrics. We offer comprehensive benefit options including paid time off, retirement savings plans, medical and prescription drug benefits, dental and vision benefits, accident and critical illness insurance, life and disability insurance, health savings accounts, flexible spending accounts, parental leave, legal coverage, auto/home insurance, identity theft insurance and tuition assistance. Additionally, we have conducted five company-wide stock grant programs for employees since 2014 – the most recent grant took place in 2024.\nEmployee experience and retention:\nTo evaluate our employee experience and retention efforts, we monitor a number of employee measures, such as employee retention, internal promotions and referrals. For example, voluntary employee turnover, which represents voluntary terminations during the year divided by average headcount during the year, was 11.9 percent, 12.4 percent and 13.1 percent for 2024, 2023 and 2022, respectively. We also conduct an annual employee experience survey, with Peakon (a Workday company) serving as administrator, which provides information on drivers of engagement and areas where we can improve. Our 2024 employee experience survey showed strong results with average responses ranging from 8.3 to 9.1 out of 10 in each of our four survey categories: Engagement (8.4), Belonging (8.3), Health & Wellbeing (8.4) and Safety Commitment (9.1). Our 2024 results were consistent with our strong 2023 results, with scores in all four categories flat or within 0.1 year-over-year. Our employee Net Promoter Score places us in the top five percent of the Peakon Benchmark for Commercial and Professional Services Companies for the Engagement category, in the top 10 percent for the Health & Wellbeing category and in the top 25 percent for the Belonging category. There is no external benchmark reference for our Safety Commitment category.\nEmployee inclusion and engagement:\nOur commitment to inclusion is demonstrated through many efforts such as employee-led employee resource groups (“ERGs”). Our many ERGs are open to all employees and aim to foster a diverse and inclusive workplace by facilitating: networking and connecting with peers; education and awareness efforts; and professional development. As part of its inclusion efforts, the Company is committed to supporting its military veterans and has made the fair inclusion of veterans a priority, through its veterans ERG and external partnerships. To provide an open and frequent line of communication for all employees, we host town hall meetings and quarterly all employee conference calls, and utilize Workplace, a virtual collaboration platform for our employees, to engage with our full team. The Company also sponsors the United Compassion Fund, an employee-funded 501(c)(3) charity that provides financial assistance to fellow employees in need. In 2024, employees voluntarily donated approximately $1.6 million to the fund, and employees received 845 grants totaling approximately $2.2 million.\nTraining and development:\nThe Company is committed to the continual development of its employees. We aim for all new hires to attend JumpSTART, a new hire orientation, to quickly acclimate them to our culture, as well as applicable new hires to attend Center of Excellence (job related) training within 90 days of hire. We offer a wide array of training solutions (instructor led in-person, virtual, digital, hands-on, e-learning and experience maps) for further development of our employees to help them achieve their career goals. In addition, as we did in 2024, we aim to regularly develop new training programs, launch pilot programs and expand leadership opportunities for our employees. In 2024, our employees enhanced their skills through approximately 1.2 million hours of training, including safety training, sales and leadership training and equipment-related training from our suppliers. Our performance process encourages employee check-ins throughout the year to discuss performance and career goals, as well as development opportunities at all levels across the Company.\nFor the past several years, we have executed a strategy focused on improving the profitability of our core equipment rental business through revenue growth, margin expansion and operational efficiencies. In particular, we have focused on customer segmentation, customer service differentiation, rate management, fleet management and operational efficiency. Our general strategy focuses on profitability and return on invested capital, and, in particular, calls for:\nA consistently superior standard of service to customers\noften provided through a single lead contact who can coordinate the cross-selling of the various services we offer throughout our network. We utilize a proprietary software application, Total Control\n, which provides our key customers with a single in-house software application that enables them to monitor and manage all their equipment needs. Total Control\nis a unique customer offering that enables us t",
  "item7_clean": "This reflects the amortization of the intangible assets acquired in the major acquisitions that significantly impact our operations (the “major acquisitions,” each of which had annual revenues of over $200 prior to acquisition).\nThis reflects the impact of extending the useful lives of equipment acquired in certain major acquisitions, net of the impact of additional depreciation associated with the fair value mark-up of such equipment. The increase in 2023 primarily reflects the impact of the Ahern Rentals acquisition.\nThis reflects additional costs recorded in cost of rental equipment sales associated with the fair value mark-up of rental equipment acquired in certain major acquisitions that was subsequently sold. The year-over-year increase in 2023 and decrease in 2024 primarily reflect the impact of the Ahern Rentals acquisition.\nThis primarily reflects severance and branch closure charges associated with our restructuring programs. For additional information on the restructuring charges, which generally involve the closure of a large number of branches over a short period of time, often in periods following a major acquisition, see “Results of Operations-Other costs/(income)-restructuring charges” below. The amounts above primarily reflect charges associated with a restructuring program initiated following the closing of the Ahern Rentals acquisition. As of December 31, 2024, there were no open restructuring programs.\nThis reflects write-offs of leasehold improvements and other fixed assets.\nThis primarily reflects the difference between the net carrying amount and the total purchase price of the redeemed notes.\nEBITDA GAAP Reconciliations\nEBITDA represents the sum of net income, provision for income taxes, interest expense, net, depreciation of rental equipment and non-rental depreciation and amortization. Adjusted EBITDA represents EBITDA plus the sum of the restructuring charge, stock compensation expense, net, and the impact of the fair value mark-up of acquired fleet. See below for further detail on each adjusting item. These items are excluded from adjusted EBITDA internally when evaluating our operating performance and for strategic planning and forecasting purposes, and allow investors to make a more meaningful comparison between our core business operating results over different periods of time, as well as with those of other similar companies. The net income and adjusted EBITDA margins represent net income or adjusted EBITDA divided by total revenue. Management believes that EBITDA and adjusted EBITDA, when viewed with the Company’s results under U.S. generally accepted accounting principles (“GAAP”) and the accompanying reconciliations, provide useful information about operating performance and period-over-period growth, and provide additional information that is useful for evaluating the operating performance of our core business without regard to potential distortions. Additionally, management believes that EBITDA and adjusted EBITDA help investors gain an understanding of the factors and trends affecting our ongoing cash earnings, from which capital investments are made and debt is serviced. However, EBITDA and adjusted EBITDA are not measures of financial performance or liquidity under GAAP and, accordingly, should not be considered as alternatives to net income or cash flow from operating activities as indicators of operating performance or liquidity.\nThe table below provides a reconciliation between net income and EBITDA and adjusted EBITDA:\nYear Ended December 31,\nProvision for income taxes\nInterest expense, net\nDepreciation of rental equipment\nNon-rental depreciation and amortization\nEBITDA\n\n*Equipment rentals variance components:\nYear-over-year change in average OEC\nAssumed year-over-year inflation impact (1)\nFleet productivity (2)\nContribution from ancillary and re-rent revenue (3)\nTotal change in equipment rentals\n*Pro forma equipment rentals variance components (4):\nYear-over-year change in average OEC\nAssumed year-over-year inflation impact (1)\nFleet productivity (2)\nContribution from ancillary and re-rent revenue (3)\nTotal change in equipment rentals\nReflects the estimated impact of inflation on the revenue productivity of fleet based on OEC, which is recorded at cost.\nReflects the combined impact of changes in rental rates, time utilization, and mix that contribute to the variance in owned equipment rental revenue. See note 3 to the consolidated financial statements for a discussion of the different types of equipment rentals revenue. Rental rate changes are calculated based on the year-over-year variance in average contract rates, weighted by the prior period revenue mix. Time utilization is calculated by dividing the amount of time an asset is on rent by the amount of time the asset has been owned during the year. Mix includes the impact of changes in customer, fleet, geographic and segment mix.\nReflects the combined impact of changes in the other types of equipment rentals revenue (see note 3 for further detail), excluding owned equipment rental revenue.\nWe completed the acquisition of Ahern Rentals in December 2022. The pro forma information includes the standalone, pre-acquisition results of Ahern Rentals. Pro forma information is not reflected above for 2024 versus 2023 because Ahern Rentals was fully included in our results for both years.\nEquipment rentals include our revenues from renting equipment, as well as revenue related to the fees we charge customers: for equipment delivery and pick-up; to protect the customer against liability for damage to our equipment while on rent; for fuel; and for environmental costs. Collectively, these “ancillary fees” represented approximately 17 percent of equipment rental revenue in 2024. Delivery and pick-up revenue, which represented approximately eight percent of equipment rental revenue in 2024, is the most significant ancillary revenue component. Sales of rental equipment represent our revenues from the sale of used rental equipment. Sales of new equipment represent our revenues from the sale of new equipment. Contractor supplies sales represent our sales of supplies utilized by contractors, which include construction consumables, tools, small equipment and safety supplies. Services and other revenues primarily represent our revenues earned from providing repair and maintenance services on our customers’ fleet (including parts sales). See note 3 to our consolidated financial statements for further discussion of our revenue recognition accounting.\n2024 total revenues of $15.3 billion increased 7.1 percent compared with 2023. Equipment rentals and sales of rental equipment are our largest revenue types (together, they accounted for 95 percent of total revenue for the year ended December 31, 2024). Equipment rentals increased 8.0 percent, primarily due to a 4.1 percent increase in fleet productivity, which includes the impact of the Yak acquisition, and a 3.5 percent increase in average OEC. Fleet productivity increased 2.7 percent excluding the impact of the Yak acquisition. Sales of rental equipment did not change significantly year-over-year.\nCritical Accounting Policies\nWe prepare our consolidated financial statements in accordance with GAAP. A summary of our significant accounting policies is contained in note 2 to our consolidated financial statements. In applying many accounting principles, we make assumptions, estimates and/or judgments. These assumptions, estimates and/or judgments are often subjective and may change based on changing circumstances or changes in our analysis. Material changes in these assumptions, estimates and/or judgments have the potential to materially alter our results of operations. We have identified below our accounting policies that we believe could potentially produce materially different results if we were to change underlying assumptions, estimates and/or judgments. Although actual results may differ from those estimates, we believe the estimates are reasonable and appropriate.\nAllowance for Credit Losses\n. We maintain allowances for credit losses. These allowances reflect our estimate of the amount of our receivables that we will be unable to collect based on historical write-off experience and, as applicable, current conditions and reasonable and supportable forecasts that affect collectibility. Our estimate could require change based on changing circumstances, including changes in the economy or in the particular circumstances of individual customers. Accordingly, we may be required to increase or decrease our allowances. Trade receivables that have contractual maturities of one year or less are written-off when they are determined to be uncollectible based on the criteria necessary to qualify as a deduction for federal tax purposes. Write-offs of such receivables require management approval based on specified dollar thresholds. See note 3 to our consolidated financial statements for further detail.\nUseful Lives and Salvage Values of Rental Equipment and Property and Equipment.\nWe depreciate rental equipment and property and equipment over their estimated useful lives, after giving effect to an estimated salvage value which ranges from zero percent to 50 percent of cost. The weighted average salvage value of our rental equipment is 12 percent of cost (immaterial salvage values are assigned to our property and equipment). Rental equipment is depreciated whether or not it is out on rent.\nThe useful life of an asset is determined based on our estimate of the period over which the asset can generate revenues; such periods are periodically reviewed for reasonableness. In addition, the salvage value, which is also reviewed periodically for reasonableness, is determined based on our estimate of the minimum value we will realize from the asset after such period. We may be required to change these estimates based on changes in our industry or other changing circumstances. If these estimates change in the future, we may be required to recognize increased or decreased depreciation expense for these assets.\nTo the extent that the useful lives of all of our rental equipment were to increase or decrease by one year, we estimate that our annual depreciation expense would decrease or increase by approximately $297 or $391, respectively. If the estimated salvage values of all of our rental equipment were to increase or decrease by one percentage point, we estimate that our annual depreciation expense would change by approximately $29. Any change in depreciation expense as a result of a hypothetical change in either useful lives or salvage values would generally result in a proportional increase or decrease in the gross profit we would recognize upon the ultimate sale of the asset. To the extent that the useful lives of all of our depreciable property and equipment were to increase or decrease by one year, we estimate that our annual non-rental depreciation expense would decrease or increase by approximately $44 or $66, respectively.\nAcquisition Accounting\n. We have made a number of acquisitions in the past and may continue to make acquisitions in the future. The assets acquired and liabilities assumed are recorded based on their respective fair values at the date of acquisition. Long-lived assets (principally rental equipment), goodwill and other intangible assets generally represent the largest components of our acquisitions. Rental equipment is valued utilizing either a cost, market or income approach, or a combination of certain of these methods, depending on the asset being valued and the availability of market or income data. Goodwill is calculated as the excess of the cost of the acquired business over the net of the fair value of the assets acquired and the liabilities assumed. The intangible assets that we have acquired are non-compete agreements, customer relationships and trade names and associated trademarks. The estimated fair values of these intangible assets reflect various assumptions about discount rates, revenue growth rates, operating margins, terminal values, useful lives and other prospective financial information. Non-compete agreements, customer relationships and trade names and associated trademarks are valued based on an excess earnings or income approach based on projected cash flows.\nDetermining the fair value of the assets and liabilities acquired can be judgmental in nature and can involve the use of significant estimates and assumptions. The significant judgments include estimation of future cash flows, which is dependent on forecasts; estimation of the long-term rate of growth; estimation of the useful life over which cash flows will occur; and determination of a risk-adjusted weighted average cost of capital. When appropriate, our estimates of the fair values of assets and liabilities acquired include assistance from independent third-party appraisal firms. The judgments made in determining the estimated fair value assigned to the assets acquired, as well as the estimated life of the assets, can materially impact net income in periods subsequent to the acquisition through depreciation and amortization, and in certain instances through impairment charges, if the asset becomes impaired in the future. As discussed below, we regularly review for impairments.\nWhen we make an acquisition, we also acquire other assets and assume liabilities. These other assets and liabilities typically include, but are not limited to, parts inventory, accounts receivable, accounts payable and other working capital items. Because of their short-term nature, the fair values of these other assets and liabilities generally approximate the book values on the acquired entities' balance sheets.\nEvaluation of Goodwill Impairment\n. Goodwill is tested for impairment annually or more frequently if an event or circumstance indicates that an impairment loss may have been incurred. Application of the goodwill impairment test requires judgment, including: the identification of reporting units; assignment of assets and liabilities to reporting units; assignment of goodwill to reporting units; determination of the fair value of each reporting unit; and an assumption as to the form of the transaction in which the reporting unit would be acquired by a market participant (either a taxable or nontaxable transaction).\nWhen conducting the goodwill impairment test, we are required to compare the fair value of our reporting units (which are our regions) with the carrying amount. As discussed in note 5 to our consolidated financial statements, our divisions are our operating segments. We conduct the goodwill impairment test at the reporting unit level, which is one level below the operating segment level.\nFinancial Accounting Standards Board (“FASB”) guidance permits entities to first assess qualitative factors to determine whether it is more likely than not that the fair value of a reporting unit is less than its carrying amount. We estimate the fair value of our reporting units using a combination of an income approach based on the present value of estimated future cash flows and a market approach based on market price data of shares of our Company and other corporations engaged in similar businesses as well as acquisition multiples paid in recent transactions. We believe this approach, which utilizes multiple valuation techniques, yields the most appropriate evidence of fair value.\nInherent in our preparation of cash flow projections are assumptions and estimates derived from a review of our operating results, business plans, expected growth rates, cost of capital and tax rates. We also make certain forecasts about future economic conditions, interest rates and other market data. Many of the factors used in assessing fair value are outside the control of management, and these assumptions and estimates may change in future periods. Changes in assumptions or estimates could materially affect the estimate of th",
  "item2_clean": null
}