{
  "source_file": "v-20250930.htm",
  "form_type": "10-K",
  "item1_clean": "Visa analysis based on third-party studies for the period covering calendar year 2024.\nCredit cards and digital payment credentials allow consumers and businesses to access credit to pay for goods and services. Credit cards are affiliated with programs operated by financial institution clients, co-brand partners, fintechs and affinity partners.\nDebit cards and digital payment credentials allow consumers and small businesses to purchase goods and services using funds held in their deposit accounts. Debit cards enable account holders to transact in person, online or via mobile without cash or checks and without accessing a line of credit. The Visa/PLUS Global ATM network also provides debit, credit and prepaid account holders with cash access and other banking capabilities. Issuing and acquiring partnerships with both financial institutions and independent ATM operators enable these capabilities.\nPrepaid cards and digital payment credentials draw from a designated balance funded by individuals, businesses or governments. Prepaid cards address many use cases and needs, including general purpose reloadable, payroll, government and corporate disbursements, healthcare, gifting and travel. Visa-branded prepaid cards also play an important part in financial inclusion, bringing payment solutions to those with limited or no access to traditional banking products.\nBy enabling CP, we help our clients grow as digital commerce, new technologies and new participants continue to transform the payments ecosystem.\nSince we introduced Tap to Pay technology 20 years ago, it has emerged as a preferred way to pay in the face-to-face environment. Tap to Pay adoption is growing and Tap to Pay has become the default way Visa cardholders pay, comprising 79% and 66% of all face-to-face transactions, globally and in the United States in fiscal 2025, respectively. In addition, we have activated more than 1,000 contactless public transport projects worldwide. We processed more than 2.4 billion contactless transactions on global transit systems in fiscal 2025, surpassing the number of transactions in 2024.\nBuilding on the momentum of Tap to Pay, we continue to expand into new ‘Tap to Everything’ use cases. Our Tap to Phone capabilities, enabling any mobile device with near field communication capability to be converted to a payment acceptance terminal, has expanded. During fiscal 2025, we passed 20 million Tap to Phone transacting devices. In 2024, we launched our Tap to Add Card capability, enabling a consumer to add a payment credential to a digital wallet by tapping their card to their mobile device. This functionality is expanding and has more than 600 issuers participating globally, resulting in the service being live for more than 1.4 billion Visa credit and debit cards around the world. Tap to P2P, another ‘Tap to Everything’ use case, is a product that uses tokenization for security, incorporating Visa's Tap to Consumer Device and Software Development Kit (SDK) technology for contactless data transmission between devices and the convenience of Visa Direct's real time money movement for fund transfers. Finally, we are piloting our newest tap capability, Tap to Confirm, for issuers. In high-risk transaction types where an issuer might otherwise have declined the transaction, issuers can ask the consumer to tap to confirm the transaction, demonstrating that the consumer is in possession of the physical card.\nWe are adding identity-based authentication and other capabilities to our token technology to further drive preference for Visa payment types, including a solution for agentic commerce. Please see our\ndiscussion below. Visa Token Service (VTS) brings trust to digital commerce innovation. As consumers increasingly rely on digital transactions, VTS is designed to enhance the digital ecosystem through improved authorization, reduced fraud and enhanced consumer experience. VTS helps protect digital transactions by replacing 16-digit Visa account numbers with a token that includes a surrogate account number, cryptographic information and other data to protect the underlying account information. This security technology can work for a variety of in-person or ecommerce payment transactions. As of September 30, 2025, Visa has provisioned more than 16 billion tokens.\nIn addition, the Visa Cloud Token Framework is a cloud-based security technology program that expands token use cases to mobile wallets, ecommerce platforms and Internet of Things devices, all while adding fraud mitigation functionality. We continue to build new capabilities, such as Visa Payment Passkey, which links the token to the consumer’s device passkey information, adding another layer of security to the payment experience. Building on these capabilities, we are progressing beyond earlier implementations like Click to Pay, which provides a simplified and more consistent ecommerce checkout experience by removing time-consuming key entry of personal\ninformation and enabling consumer and transaction data to be passed securely between payments network participants.\nWe are a preferred global payments network for cross-border travelers in key markets, differentiated by our risk management and fraud prevention capabilities, including tokenization, and our cross-border currency and settlement capabilities, which include foreign exchange solutions.\nAs our cross-border volume continues to grow year-over-year, we are investing in cross-border commerce through several strategic initiatives. These include expanding the scope and utility of our cross-border network, particularly in key travel corridors, where cash usage remains high, and increasing acceptance locations. We are also enhancing our value proposition in travel and ecommerce to drive consumer preference for Visa payment credentials and improving cross-border transaction performance and authorization rates. In addition, we are focused on improving the performance of cross-border portfolios and tapping into high-potential verticals with a significant mix of cross-border payments. We are also building more feature functionality with products like multi-currency payment credentials that allow travelers to hold and transact in multiple currencies seamlessly.\nOfferings to Affluent Consumers\nVisa is a global leader in affluent and premium co-branded programs, including our Infinite brand, which is designed to bring together benefits, experiences and product features to deliver a premium value proposition to our affluent cardholders. Our strength in this focus area is driven by core capabilities that align with the needs of affluent consumers, such as our global acceptance footprint, differentiated credit products, advanced fraud protection and dispute resolution services, brand equity and premium benefits.\nWe continue to invest in experiential benefits to better serve this consumer base, including music series, concierge services and access to premier hotels and restaurants, such as the Visa Dining Collection OpenTable Benefit. In addition, we leverage our portfolio of sponsorship assets to deliver unique experiences at events, including the Super Bowl, the Olympic and Paralympic Games, the FIFA World Cup 2026\nTM\nand through our partnership with Visa’s two Red Bull Formula One racing teams. These benefits enhance our premium value proposition and strengthen relationships with issuing partners.\nAffluent consumers represent a highly attractive market opportunity within our CP business. This focus area demonstrates significantly higher spend per cardholder in cross-border, credit and ecommerce volumes, generating more revenue for Visa compared to the average Visa cardholder.\nWe have built a strong reputation and brand around our credit products by offering robust security, advanced fraud mitigation and effective dispute management. Over time, we have introduced several innovations that differentiate our credit offerings and drive consumer preference for Visa. For example, we were a pioneer in dual-message technology, which enables real-time transaction authorization, a capability that only a few payments providers globally can provide.\nEven with our strong foundation in credit, significant opportunity remains in international markets, where the penetration of card-linked credit products as a percentage of consumer spending is less than half that of the U.S. To address this, we continue to develop new products that provide greater control and insight to our issuing clients and their customers. For example, Visa Flex Credential allows consumers to use a single Visa payment credential to access and switch between multiple funding sources, like debit and credit. As of September 30, 2025, we have more than 20 signed clients in more than 20 countries across all regions.\nExpanding Our Reach in Consumer Payments\nWe aim to capture value and drive yield from CP currently routed through A2A networks via two primary strategies. First, we are focused on capturing A2A payments through card-enabled payment flows. One example of our most recent innovations in this space is Visa Pay, which we launched in 2025, expanding digital payment access by connecting participating digital wallets to Visa’s network with digital credentials for payments globally. In certain regions, digital wallet providers, A2A schemes and banks can adopt Visa Pay by connecting to our APIs directly, enabling access to Visa’s global acceptance as a white-label solution within the user’s app. In addition, we are piloting these same functionalities through our full stack SDK. In the Central and Eastern Europe, Middle East and Africa markets, a stand-alone Visa Pay app enables banks to offer their customers the ability to set up a Visa account or payment credential and conduct payments at Visa acceptance locations.\nSecond, we leverage A2A networks to deliver Visa-branded A2A products, most notably through Tink, our open banking solution in regions, such as Europe and Latin America. Tink enables open banking and data exchange for A2A transactions. Since acquiring Tink in 2022, we have scaled our open banking payments network, reaching thousands of bank connections as of September 30, 2025. Please see our\nAdvisory and Other Services\ndiscussion below. Visa is collaborating with our financial institution and fintech partners to bring Visa A2A to United Kingdom customers. In addition, as we expand the Visa as a Service stack, we are providing value-added services to local payment methods operating on A2A or RTP networks. Please see our\nRisk and Security Solutions\nCommercial & Money Movement Solutions\nCMS is focused on driving digitization and improving the payments and money movement experience across all payment flows, beyond C2B, through our network of networks. These include P2P, B2C, B2B and G2C payments, which provide some of the largest payment opportunities in the world. Representing a total addressable opportunity of approximately $200 trillion\nof payment flows annually, excluding Russia and China, this pillar of our business aims to make payments and money movement easier for businesses, consumers and governments, using both Visa’s global network and connectivity to other networks around the world\nWe have two key objectives in this business area. The first objective is to address B2B payments flows from small businesses up to large enterprises and governments through our Visa Commercial Solutions, a card and virtual payments-led business. This part of the business focuses on addressing approximately $35 trillion of annual opportunity by converting small and medium business spend to our solutions; scaling our existing large and middle market use cases to more countries, corporates and partners; delivering product innovation and network flexibility, driving more B2B spend to cards and virtual payments, enabling new and emerging B2B verticals; and unlocking new commercial card acceptance with suppliers.\nThe second objective is to address mo",
  "item7_clean": "ITEM 7. Management’s Discussion and Analysis of Financial Condition and Results of Operations\nThis management’s discussion and analysis provides a review of the results of operations, financial condition and liquidity and capital resources of Visa Inc. and its subsidiaries (Visa, we, us, our or the Company) on a historical basis and outlines the factors that have affected recent earnings, as well as those factors that may affect future earnings. The following discussion and analysis should be read in conjunction with the consolidated financial statements and related notes included in",
  "item2_clean": null
}