{
  "source_file": "vici-20241231.htm",
  "form_type": "10-K",
  "item1_clean": "ITEM 1.\nWe are a Maryland corporation that is primarily engaged in the business of owning and acquiring gaming, hospitality, wellness, entertainment and leisure destinations, subject to long-term triple net leases. As of December 31, 2024, we own 93 experiential assets across a geographically diverse portfolio consisting of 54 gaming properties and 39 other experiential properties across the United States and Canada, including Caesars Palace Las Vegas, MGM Grand and the Venetian Resort Las Vegas (the “Venetian Resort”), three of the most iconic entertainment facilities on the Las Vegas Strip. Our gaming and entertainment facilities are leased to leading brands that seek to drive consumer loyalty and value with guests through superior services, experiences, products and continuous innovation. Across approximately\nmillion square feet, our well-maintained properties are curren\ntly located across urban, destination and drive-to markets in twenty-six states and Canada, contain approximately 60,300 hotel rooms and feature over 500 restaurants, bars, nightclubs and sportsbooks. As of\nour properties are 100% leased with a weighted average lease term, including extension options, of approximately\nWe also have a growing array of real estate and financing partnerships with leading operators in other experiential sectors, including Cabot, Canyon Ranch, Chelsea Piers, Great Wolf Resorts, Homefield, Kalahari Resorts, and Lucky Strike Entertainment. This portfolio includes certain real estate debt investments that we have originated for strategic reasons, primarily in connection with transactions that either do or may provide the potential to convert our investment into the ownership of certain of the underlying real estate in the future. In addition, we own approximately 33 acres of undeveloped or underdeveloped land on and adjacent to the Las Vegas Strip that is leased\nto Caesars Entertainment, Inc. (together with, as the context requires, its subsidiaries, “Caesars”),\nwhich we may look to monetize as appropriate. VICI also owns four championship golf courses located near certain of our properties, two of which are in close proximity to the Las Vegas Strip.\nOur portfolio is competitively positioned and well-maintained. Pursuant to the terms of our lease agreements, which require our tenants to invest in our properties, and in line with our tenants’ commitment to build guest loyalty, we anticipate our tenants will continue to make strategic value-enhancing investments in our properties over time, helping to maintain their competitive position. Our long-term triple-net leases provide our tenants with complete control over management at our leased properties, including sole responsibility for all operations and related expenses, including property taxes, insurance and maintenance, repair, improvement and other capital expenditures, as well as over the implementation of environmental sustainability and other initiatives.\nWe conduct our operations as a real estate investment trust (“REIT”) for U.S. federal income tax purposes. We generally will not be subject to U.S. federal income taxes on our taxable income to the extent that we annually distribute all of our net taxable income to stockholders and maintain our qualification as a REIT. We believe VICI’s election of REIT status, combined with the income generation from the lease agreements and loans, will enhance our ability to make distributions to our stockholders, providing investors with current income as well as long-term growth, subject to the macroeconomic environment, other global events and market conditions more broadly. We conduct our real property business through VICI OP and our golf course business through a taxable REIT subsidiary (a “TRS”), VICI Golf LLC (“VICI Golf”).\nOur Investment Highlights\nDemonstrated track record of growth with significant scale.\nWe have made approximately $37.0 billion of domestic and international investments across gaming and other experiential assets since our formation in October 2017. Following our growth and resulting scale, we were added to the S&P 500 Index in June 2022.\nStable and transparent cash flows by leading operators.\nOur properties are 100% occupied pursuant to our long-term triple-net lease agreements, which provide us with a predictable level of rental revenue to support future cash distributions to our stockholders, with 100% rent collection since our formation in October 2017. Our tenants are market-leading gaming and experiential operators, with the majority of our rent derived from properties operated by SEC reporting companies, providing transparency into our tenants’ performance and health.\nContractual escalation with inflation protection.\nAll of our lease agreements provide for annual base rent escalations, which may be fixed or variable over the life of the lease. The rent escalation provisions range from providing for a flat annual increase of 1% to 2% to an annual increase of 1% in the earlier years and the greater of 2% or the U.S consumer price index (“CPI”) in the later years, which may be subject to a maximum CPI-based cap with respect to each annual rent increase. Among our leases, 15 of 18 are subject to a CPI-linked escalation over the life of the lease (subject to applicable caps). As of December, 31, 2024, 40% of our annualized rental revenue was subject to CPI-linked escalation.\nMission critical complex real estate\nOur portfolio benefits from a strong mix of demand generators, including casinos, hotels, restaurants, entertainment facilities, bars and nightclubs and convention space. Our Las Vegas properties, including Caesars Palace Las Vegas, MGM Grand and the Venetian Resort, which are located on the Las Vegas Strip, are among the most iconic entertainment facilities in Las Vegas, featuring gaming entertainment, large-scale hotels, extensive food and beverage options, state-of-the-art convention facilities, retail outlets and entertainment venues. The size, use and location of our real estate drives our tenants’ continued investment into our leased properties, which “same-store” capital improvements we seek to fund in exchange for increased rent through our Partner Property Growth Fund strategy. Additionally, the gaming regulatory environment in which we operate creates a high barrier to entry and limits our tenants’ ability to move locations.\nStrategic financing relationships with leading experiential operators.\nIn addition to our relationships with leading gaming operators, we have entered into strategic financing relationships with other experiential operators in sectors such as world-class destination golf resorts and communities, integrative wellness centers, premier sports and entertainment complexes and family-oriented indoor waterpark resorts, which we refer to as our VICI Experiential Credit Solutions strategy. We believe the relationships established through this strategy may lead to additional\nmutually beneficial growth opportunities with these industry-leading experiential operators in the future, including the potential to convert certain of our investments into ownership of the underlying real estate.\nOur Properties and Lease Agreements\nOur experiential portfolio features world-renowned assets on the Las Vegas Strip and market-leading urban, destination and regional properties with significant scale. Our properties are leased to leading operators that seek to drive loyalty and value with guests through superior services, experiences and products and continuous innovation.\nWe derive a substantial majority of our revenues from rental revenue from the lease agreements for our properties, each of which are “triple-net” leases, pursuant to which the tenant bears responsibility for all property costs and expenses associated with ongoing maintenance and operation, including utilities, property tax and insurance. Our lease agreements are generally long term in nature with initial terms ranging from 15 to 32 years and are generally structured with several tenant renewal options extending the term of the lease for another 5 to 30 years. All of our lease agreements provide for annual base rent escalations, which may be fixed or variable over the life of the lease. The rent escalation provisions range from providing for a flat annual increase of 1% to 2% to an annual increase of 1% in the earlier years and the greater of 2% or CPI in the later years, which may be subject to a maximum CPI-based cap with respect to each annual rent increase. For an overview of the provisions of certain of our lease agreements, including the related capital expenditure requirements, refer to\nNote 4 - Real Estate Portfolio\nThe following tables summarize our lease agreements between us and our respective tenants and guarantors (each, as may be amended from time to time, and each individually, as defined in the column titled “Lease Agreement”) and the properties under each our respective lease agreements, as of the date of this Annual Report.\nCaesars Joliet Lease\nCaesars Las Vegas Master Lease\nCaesars Palace Las Vegas\nCaesars Regional Master Lease\nCaesars Atlantic City\nHarrah’s Atlantic City\nHarrah’s Council Bluffs\nHarrah’s New Orleans\nHarrah’s North Kansas City\nNorth Kansas City, MO\nHarrah’s Philadelphia\nHorseshoe Bossier City\nHorseshoe Council Bluffs\nCentury Master Lease\nCentury Casinos, Inc.\nCentury Casino & Hotel Edmonton\nCentury Casino Cape Girardeau\nCentury Casino Caruthersville\nCentury Casino St. Albert\nCentury Downs Racetrack and Casino\nCentury Mile Racetrack\nMountaineer Casino Resort & Racetrack\nRocky Gap Casino Resort\nCNE Gold Strike Lease\nCherokee Nation Businesses, L.L.C. (“CNB”)\nEBCI Southern Indiana Lease\nEastern Band of Cherokee Indians (“EBCI”)\nCaesars Southern Indiana\nFoundation Master Lease\nFoundation Gaming & Entertainment, LLC\nHard Rock Cincinnati Lease\nSeminole Hard Rock International (“Hard Rock”)\nHard Rock Cincinnati\nHard Rock Mirage Lease\nJACK Thistledown Racino\nMGM\nPrince George’s County, MD\nNew York - New York/The Park\nMGM Grand/Mandalay Bay Lease\nMGM\nPENN Greektown Lease\nPENN Entertainment, Inc.\nHollywood Casino at Greektown\nPENN Margaritaville Lease\nPENN Entertainment, Inc.\nMargaritaville Resort Casino\nIndigenous Gaming Partners Inc. (“IGP”)\nPURE Casino Edmonton\nPURE Casino Lethbridge\nPURE Casino Yellowhead\nFunds managed by Apollo Global Management, Inc.\nTotal Gaming Portfolio\nOther Experiential Portfolio\nLucky Strike Master Lease\nLucky Strike Entertainment Corporation (“Lucky Strike Entertainment”)\nBowling Entertainment Centers\nVarious U.S. Cities (38)\nTotal Other Experiential Portfolio\n____________________\n(1) Reflects the lease agreement currently in effect between us and the applicable tenant.\n(2) The tenants under our lease agreements are subsidiaries and/or affiliates of the guarantors set forth in this table.\n(3) Represents the expiration date assuming no tenant renewal option is exercised.\n(4) Owned by Harrah’s Joliet Landco LLC, a joint venture of which a wholly owned subsidiary of VICI LP is the 80% owner and the managing member.\n(5) The core property, or a portion thereof, is leased by us pursuant to a ground lease. Rent due under any such ground lease is paid directly by our tenant to the primary landlord pursuant to their respective lease agreement.\n(6) Collectively, the “Century Canadian Portfolio”.\n(7) CNB is the parent entity of CNE Holdings, LLC also known as Cherokee Nation Entertainment.\n(8) IGP is a gaming partnership established by five institutional Nova Scotia-based First Nations (Glooscap First Nation, Millbrook First Nation, Annapolis Valley First Nation, We’koqma’q L’nue’kati, and Paqtnkek Mi’kmaw Nation) to acquire gaming assets in North America.\n(9) Collectively, the “PURE Canadian Portfolio”.\n(10) Effective December 12, 2024, Bowlero Corporation was rebranded as Lucky Strike Entertainment Corporation.\n(11) Subject to a mandatory 10-year tenant extension to the extent all conditions under the applicable ground lease are me",
  "item7_clean": ") providing for the Revolving Credit Facility in the amount of $2.5 billion scheduled to mature on February 3, 2029. Concurrently, we terminated our 2022 Revolving Credit Facility and 2022 Credit Agreement (each as defined in\nThe Credit Facility includes two six-month maturity extension options (or one twelve-month extension option), the exercise of which in each case is subject to customary conditions and the payment of an extension fee. The Revolving Credit Facility includes the option to increase the revolving loan commitments by up to $1.0 billion in the aggregate to the extent that any one or more lenders (from the syndicate or otherwise) agree to provide such additional credit extension. Borrowings under the Credit Facility will bear interest, at VICI LP’s option, for U.S. Dollar borrowings at either (i) a rate based on SOFR plus a margin ranging from 0.70% to 1.40%, or (ii) a base rate plus a margin ranging from 0.00% to 0.40%, in each case, with the actual margin determined according to the Borrower’s debt ratings and total leverage ratio. In addition to U.S. Dollar borrowings, borrowings under the Credit Facility are also available in certain specific foreign currencies, bearing interest based on rates customary for such foreign currencies and subject to the same applicable margins for U.S. Dollar borrowings. In addition, the Credit Agreement includes the option to add one or more tranches of term loans of up to $2.0 billion in the aggregate, in each case, to the extent that any one or more lenders (from the syndicate or otherwise) agree to provide such additional credit extensions. Re\nfor additional information.\nAt-The-Market Offering Programs.\nDuring the year ended December 31, 2024, we sold an aggregate of 12,015,399 shares under the ATM Program, all of which were subject to forward sale agreements, for estimated aggregate net offering value of $376.3 million based on the initial forward sale price with respect to each forward sale agreement. We did not initially receive any proceeds from the sale of the shares of common stock under the ATM Program, which were sold to the underwriters by the forward purchasers or their respective affiliates. In July, October and November 2024, we physically settled certain outstanding forward shares issued under the ATM Program in exchange for aggregate net proceeds of approximately $379.4 million.\nSenior Notes Offerings.\nOn March 18, 2024, VICI LP issued (i) $550.0 million in aggregate principal amount of 5.750% Senior Notes due 2034, which mature on April 1, 2034 and (ii) $500.0 million in aggregate principal amount of 6.125% Senior Notes due 2054, which mature on April 1, 2054, in each case under a supplemental indenture (the “March 2024 Notes”). We used the net proceeds of the offering to redeem (i) $1,024.2 million in aggregate principal amount of 5.625% Senior Notes due May 1, 2024 and (ii) $25.8 million in aggregate principal amount of 5.625% Senior Notes due May 1, 2024.\nOn December 19, 2024, VICI LP issued $750.0 million in aggregate principal amount of 5.125% Senior Notes due 2031, which mature on November 15, 2031 under a supplemental indenture (the “December 2024 Notes”). We used the net proceeds of the offering to redeem $750.0 million in aggregate principal amount of 3.500% Senior Notes due February 15, 2025.\nForward-Starting Interest Rate Swap Agreements.\nIn connection with our March 2024 Notes offering, we settled seven outstanding forward-starting interest rate swap agreements with an aggregate notional amount of $500.0 million resulting in net proceeds of $2.8 million.\nDuring the year ended December 31, 2024, we entered into seven forward-starting interest rate swap agreements and five U.S. Treasury Rate Lock agreements for an aggregate notional amount of $650.0 million to hedge against changes in future cash flows resulting from changes in interest rates from the trade date through the forecasted issuance of senior unsecured notes expected to be issued in connection with the refinancing of our senior unsecured notes maturing in February 2025. In connection with our December 2024 Notes offering, we settled the outstanding forward-starting interest rate swap agreements and U.S. Treasury Rate Lock agreements resulting in net proceeds of $6.8 million. Since the forward-starting interest rate swaps and U.S. Treasury Rate Lock agreements were hedging the interest rate risk on the respective senior unsecured notes offering, the unrealized gain in Accumulated other comprehensive income is being amortized over the term of the respective derivative instruments, which matches that of the underlying notes, as a decrease in interest expense.\nDuring the year ended December 31, 2024, we entered into four forward-starting interest rate swap agreements for an aggregate notional amount of $200.0 million to hedge against changes in future cash flows resulting from changes in interest rates from the trade date through the forecasted issuance of senior unsecured notes expected to be issued in connection with the refinancing of our senior unsecured notes maturing in May 2025. These four forward-starting interest rate swap agreements were outstanding as of December 31, 2024.\nKEY TRENDS THAT MAY AFFECT OUR BUSINESS\nTenant and Industry Performance\nOur tenants (and respective guarantors, as applicable) under our lease agreements are leading gaming and experiential operators across the United States, Canada and abroad. Rental payments under our\nlease agreements comprise, and are expected to continue to comprise, a substantial majority of our revenues. Accordingly, we are dependent on, among other things, our tenants’ (and respective guarantors’, as applicable) financial performance, the performance of the gaming and other experiential industries and the health of the economies in the areas where our properties are located for the foreseeable future, and an event that has a material adverse effect on any of our tenant’s business, financial condition, liquidity, results of operations or prospects could have a material adverse effect on our business, financial condition, liquidity, results of operations and prospects. In addition, the financial performance of our tenants (and respective guarantors, as applicable) also has a direct impact on our financial results in a given reporting period due to the impact of ASC 326 “Credit Losses” (“ASC 326”), which requires us to estimate and record non-cash expected credit losses related to our investments, including changes on a quarterly basis, that are recorded in our Statement of Operations and impact our reported net income. The change in non-cash allowance for credit losses for a given period is dependent upon, among other things, our tenants’ and guarantors’ financial performance. For more information regarding ASC 326, refer to\nNote 5 - Allowance for Credit Losses\nOur business prospects and future growth will be significantly influenced by the success of our business strategy, and the timing, availability and terms of financing for any acquisitions and investments that we may complete, as well as broader macroeconomic and other conditions that affect our tenants’ operating and financial performance and the gaming and other experiential industries in which they operate, including those described herein. Further, the pricing of any acquisitions or other investments we may consummate and the terms of any leases that we may enter into will significantly impact our future results. Competition to enter into transactions with attractive properties and desirable tenants is intense, and we can provide no assurance that any future acquisitions, investments or leases will be on terms as favorable to us as those from comparable recent or historical transactions.\nImpact of the Macroeconomic Environment\nWe anticipate that we will finance our future growth with a combination of debt and equity, although no assurance can be given that we will be able to issue equity and/or debt in such amounts on favorable terms, or at all, or that we would not determine to incur more debt on a relative basis at the relevant time due to market conditions or otherwise. M\nacroeconomic volatility has introduced significant uncertainty and heightened risk for businesses, including us and our tenants, including the impact of changing interest rates, inflation, threat of recession, geopolitical uncertainty, and increased cost of capital. Our tenants also face additional challenges, including potential changes in consumer confidence levels, behavior and spending and increased operational expenses, such as with respect to labor or energy costs. As a triple-net lessor, increased operational expenses at our leased properties are borne by our tenants and do not directly impact their rent obligations (other than with respect to underlying inflation as applied to the CPI-based escalators described below) or other obligations under our lease agreements.\nHowever, the current macroeconomic environment, including heightened interest rates and market volatility, impacts our business in certain respects, such as by increasing interest expense with respect to any borrowings under our Revolving Credit Facility and refinancing of recent and upcoming debt maturities, volatility of our share price with respect to sales of common stock, and, with respect to potential transactions, evaluating asset and property values in discussions with potential counterparties and obtaining transaction financing on attractive terms, all of which could increase our cost of capital, limit the benefits of any such transactions, and negatively impact our growth prospects.\nWith respect to our lease agreements, which generally provide for annual rent escalation based on a specified percentage increase and/or increases in CPI, we expect that current inflation levels will result in additional rent increases over time under our CPI-based lease provisions (subject to any applicable caps or periods in which such provisions do not apply). However, these rent increases may not match increasing inflation during periods when inflation rates are greater than the applicable CPI-\nOverall Implications of Such Material Trends on Our Business\nAs a triple-net lessor, we believe we are generally in a strong creditor position and structurally insulated from operational and performance impacts of our tenants, both positive and negative. However, the full extent to which the trends set forth herein adversely affect our tenants, the industries in which they operate, and/or ultimately impact our business depends on future developments that cannot be predicted with confidence, including our tenants’ financial performance, the direct and indirect effects of such trends discussed herein (including among other things, heightened interest rates, inflation, economic recessions, consumer confidence levels and general conditions in the capital and credit markets) and the impact of any future measures taken in response to such trends on our tenants.\nFor more information, refer to “\nPart I – Item 1A. Risk Factors\nDISCUSSION OF OPERATING RESULTS\nResults of Operations for the Years Ended December 31, 2024 and December 31, 2023\nIncome from sales-type leases\nIncome from lease financing receivables, loans and securities\nGeneral and administrative\nChange in allowance for credit losses\nTransaction and acquisition expenses\nTotal operating expenses\nIncome from unconsolidated affiliate\nIncome before income taxes\n(Provision for) benefit from income taxes\nLess: Net income attributable to non-controlling interests\nNet income attributable to common stockholders\nFor the years ended December 31, 2024 and 2023, our revenue was comprised of the following items:\nThe following table details the components of our income from sales-type lease and lease financing receivables:\nIncome from sales-type leases\nIncome from lease financing receivables\nTotal leasing revenue\nTotal contractual leasing revenue\n____________________\n(1) Represents our asset acquisitions structured as sale leaseback transactions. In accordance with ASC 842, since the lease agreements were determined to meet the definition of a sales-type lease and control of the asset is not considered to have transferred to us, such lease agreements are accounted for as financings under ASC 310.\n(2) Amounts represent the non-cash adjustment to income from sales-type leases and lease financing receivables in order to recognize income on an effective interest basis at a constant rate of return over the term of the leases.\nLeasing revenue is generated from rent from our lease agreements. Total leasing revenue increased $176.0 million during the year ended December 31, 2024 compared to the year ended December 31, 2023. Total contractual leasing revenue increased $153.6 million during the year ended December 31, 2024 compared to the year ended December 31, 2023. The increases were primarily driven by the acquisition of the remaining 49.9% of the MGM Grand/Mandalay Bay portfolio, and the addition to our portfolio of the PURE Master Lease in January 2023, the Rocky Gap Casino component of the Century Master Lease in July 2023, the Century Canadian Portfolio component of the Century Master Lease in September 2023, the Lucky Strike (formerly known as Bowlero) Master Lease in October 2023, the Chelsea Piers Lease in December 2023 and the incremental rent increase from the Venetian Capital Investment in July and October 2024, as well as the annual rent escalators from certain of our other lease agreements.\nIncome from loans increased $55.7 million during the year ended December 31, 2024 compared to the year ended December 31, 2023. The increase was driven by the origination and subsequent funding, as applicable, of our debt investments and the related interest income from the increased principal balances outstanding under such debt investments, partially offset by the full repayment of certain loan investments.\nOther income increased $4.1 million during the year ended December 31, 2024 compared to the year ended December 31, 2023. The increase was driven primarily by the additional income as a result of the assumption of certain ground leases in connection with the closing of the acquisition of the Rocky Gap Casino in July 2023 and the sale-leaseback transaction with Chelsea Piers in December 2023. We determined that we are the primary obligor of the respective ground and use leases and, accordingly, record the related income and expense on a gross basis on our Income Statement. The lease agreements require our tenants to cover all costs associated with such ground and use sub-leases and provide for their direct payment to the primary landlord.\nFor the years ended December 31, 2024 and 2023, our operating expenses were comprised of the following items:\nGeneral and administrative\nChange in allowance for credit losses\nTransaction and acquisition expenses\nTotal operating expenses\nGeneral and Administrative Expenses\nGeneral and administrative expenses increased $9.5 million during the year ended December 31, 2024 compared to the year ended December 31, 2023. The increase was primarily driven by a one-time charitable contribution to facilitate the Company’s corporate giving initiatives and by an increase in compensation, including stock-based compensation.\nOther expenses increased $4.1 million during the year ended December 31, 2024 compared to the year ended December 31, 2023. The increase was driven primarily by the additional expense as a result of the assumption of certain ground leases in connection with the closing of the acquisition of the Rocky Gap Casino in July 2023 and the sale-leaseback transaction with Chelsea Piers in December 2023. We determined we are the primary obligor of the respective ground and use leases and, accordingly, record the related income and expense on a gross basis on our Income Statement. The lease agreements require our tenants to cover all costs associated with such gro",
  "item2_clean": null
}