{
  "source_file": "vlto-20241231.htm",
  "form_type": "10-K",
  "item1_clean": "Veralto Corporation’s unifying purpose is\nSafeguarding the World’s Most Vital Resources\nTM\n. Our diverse group of leading operating companies provide essential technology solutions that monitor, enhance and protect key resources around the globe. We are committed to the advancement of public health and safety and believe we are positioned to support our customers as they address large global challenges including environmental resource sustainability, water scarcity, management of severe weather events, food and pharmaceutical security, and the impact of an aging workforce. For decades, we have used our scientific expertise and innovative technologies to address complex challenges our customers face across regulated industries – including municipal utilities, food and beverage, pharmaceutical and industrials – where the consequence of failure is high. Through our core offerings in water analytics, water treatment, marking and coding, and packaging and color, customers look to our solutions to help ensure the safety, quality, efficiency and reliability of their products, processes and people globally. Veralto is headquartered in Waltham, Massachusetts with a workforce of nearly 17,000 employees (whom we refer to as “associates”) as of December 31, 2024, of whom approximately 6,500 were employed in North America, 5,000 were employed in Western Europe, 500 were employed in other developed markets and 5,000 were employed in high-growth markets. Veralto defines high-growth markets as developing markets of the world which include Asia (with the exception of Japan, Australia and New Zealand), Latin America (including Mexico), the Middle East, Eastern Europe and Africa. Veralto defines developed markets as all markets of the world that are not high-growth markets.\nVeralto Corporation is a Delaware corporation and was incorporated in 2023 in connection with the separation of Veralto from Danaher Corporation (“Danaher” or “Former Parent”) on September 30, 2023 as an independent, publicly traded company, listed on the New York Stock Exchange (the “Separation”). At the time of the Separation, Veralto Corporation consisted of Danaher’s former Environmental & Applied Solutions segment. The Separation was effectuated through a pro-rata dividend distribution on September 30, 2023 of all of the issued and outstanding shares of Veralto common stock held by Danaher as of September 13, 2023. Each Danaher stockholder of record as of the close of business on September 13, 2023 received one share of Veralto common stock for every three shares of Danaher common stock held on the record date.\nVeralto operates through two segments – Water Quality (“WQ”) and Product Quality & Innovation (“PQI”). Our businesses within these segments have strong globally recognized brands as a result of our leadership in served markets over several decades. Our WQ segment provides innovative products and services that improve the quality and reliability of water with leading brands including Hach, Trojan Technologies and ChemTreat. Our PQI segment enables our customers to promote consumer trust in their products and help enable product innovation with leading brands including Videojet, Linx, Esko, X-Rite and Pantone. We believe our leading positions result from the strength of our commercial organizations, our legacy of innovation, and our close and long-term connectivity to our customers and knowledge of their workflows, underpinned by our culture of continuous improvement. This has resulted in a large installed base of instruments that drive ongoing consumables and software sales to support our customers. As a result, our business generates recurring sales which represented approximately 61% of total sales during the year ended December 31, 2024. Our business model also supports a strong margin profile with limited capital expenditure requirements and has generated attractive cash flows. We believe these attributes allow us to deliver financial performance that is resilient across economic cycles.\nWe also believe that the Veralto Enterprise System (“VES”) provides us with a strong foundation for competitive differentiation. VES is a business management system that consists of a philosophy, processes and tools that guide what Veralto does and measure how well Veralto executes, grounded in a culture of continuous improvement. VES processes and tools are organized around the areas of Operational Excellence, Growth and Leadership, and are rooted in foundational tools known as the VES Fundamentals, which are relevant to every associate and business function. The VES Fundamentals are focused on core competencies such as using visual representations of processes to identify inefficiencies, creating standard work, defining and solving problems in a structured way, and continuously improving processes to drive long term impact.\nVeralto uses VES tools to improve our profitability and cash flows, which support our ability to expand our addressable market and improve our market position through investments in areas such as our commercial organization and research and development (“R&D”), including software and digital solutions. Our cash flows also\nsupport acquisitions to enhance our product capabilities and expansion into new and attractive markets, which we have successfully done through the acquisition of over 80 businesses over more than two decades.\nOur two segments are described below:\nOur Water Quality segment provides one of the most comprehensive portfolios of water analytics, and differentiated water treatment solutions that enable the reliable delivery of safe drinking water by public and private utilities - from source water to the consumer and back into the water cycle. In addition, we help improve the efficiency of processes and production operations of our customers and ensure that their wastewater discharge meets regulatory standards and their environmental and sustainability targets. Under our Hach, Trojan Technologies, ChemTreat, and other globally recognized WQ brands, we provide proprietary precision instrumentation and advanced water treatment technologies that our customers rely on to measure, analyze and treat the world’s water in residential, commercial, municipal, industrial, research and natural resource applications. In addition to instrumentation, our suite of water solutions includes elements used on a recurring basis such as chemical reagents, services and software. Together, these offerings help promote the quality and reliability of water and optimize our customers’ operations, decision making and regulatory compliance activities.\nWQ focuses on what management believes are the most attractive sub-segments of the water value chain helping our customers address some of their most pressing and complex challenges, such as water scarcity, water safety, severe weather events and management of precious natural resources. Our businesses have been at the forefront of delivering breakthrough innovations to our customers. For example, Hach has been a leading player in the field of turbidity testing for over 60 years, pioneering the first regulated method and introducing multiple new generations of instruments and related products. Today, we have one of the most comprehensive portfolios of solutions allowing our customers to test the broadest range of analytical parameters and the ability to harness their data across installed assets. Increasingly, our customers leverage our digital solutions to support regulatory compliance, automate workflows and allow for remote operations and predictive capabilities to address new challenges posed by changing regulations and an aging and less experienced workforce.\nOur key WQ brands provide solutions that our customers rely upon to manage critical operations involving water.\nHach, the best known of our global brands in the WQ segment, recognized for simple and reliable tests, offers analytical measurement instruments, digital solutions and related consumables that test water quality; we serve over 149,000 customers, including small community water utilities, large public and private water utilities and industrial customers and help to ensure safe water for more than 3.4 billion people every day - approximately 40% of the global population.\nChemTreat associates work alongside customers across many industries to understand their water challenges and tailor chemical treatment plans and dosing protocols to help optimize customers’ water usage and maximize reuse, and reduce water pollution; our solutions helped customers save over 85 billion gallons of water in 2024.\nTrojan Technologies offers UV and membrane filtration systems for water disinfection and contaminant removal; our systems support the treatment of 13 trillion gallons of water annually and in turn help to improve access to clean water for more than 275 million people every day.\nProduct Quality & Innovation\nOur Product Quality & Innovation segment provides a broad set of essential solutions for brand owners and consumer packaged goods companies that enable speed to market as well as traceability and quality control of their products. Our solutions play a central role in helping our customers convey the quality and safety of their products and build trust with consumers. Under our Videojet, Linx, Esko, X-Rite, Pantone and other globally recognized PQI brands, we provide marking and coding, and packaging and color instrumentation and related consumables. Our customers across consumer, pharmaceutical and industrial sectors utilize our offerings to bring products to market, mark packaging in compliance with industry and regulatory standards and convey the safety of products to customers. Our solutions also enable the effective execution of product recalls, thereby helping to mitigate public health risks. Our software solutions are designed to address higher-value, design-oriented portions of the packaging management value chain, such as digital asset management (“DAM”), marketing resource management (“MRM”) and product information management (“PIM”), that help our customers maximize efficiency of operations while generating an attractive source of recurring sales for us. We estimate that 80% of the top 25 global consumer packaged goods (“CPG”) brands (based on 2024 revenues) and a majority of the top 20 pharmaceutical brands\n(based on 2024 revenues) use PQI’s solutions, enabling confidence and trust in the brands and products consumers use daily.\nOur PQI brands provide brand owners and consumer packaged goods companies with essential solutions that improve their ability to develop, maintain and ensure the authenticity of their brands.\nVideojet, our largest operating company within PQI, and Linx offer technologies that mark and code packaged goods and related consumables. Videojet is a leading provider of inline printing solutions for products and packaging with marking and coding systems used by many of the top global consumer brands. Our solutions help ensure transparency, safety, authenticity, tracking and traceability of an estimated more than 10 billion codes printed around the world daily.\nEsko facilitates the creation of new packaging designs through design software and imaging systems. Esko’s offerings are used by over 25,000 established and emerging brands and their suppliers in over 140 countries. TraceGains, acquired in 2024, provides leading cloud-based software solutions that enable connected data and digital workflow management to help consumer brands meet increasingly stringent compliance and reporting regulations for food and beverage safety and traceability.\nX-Rite serves over 13,000 brands across 140 countries by providing color management solutions that measure the quality and consistency of color and appearance on printed packages and consumer and industrial products.\nPantone is the preeminent color standard in the design industry leveraged by more than 10 million designers, marketers and others i",
  "item7_clean": "ITEM 7. MANAGEMENT’S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS\nManagement’s Discussion and Analysis of Financial Condition and Results of Operations (“MD&A”) is designed to provide material information relevant to an assessment of the Company’s financial condition and results of operations, including an evaluation of the amounts and certainty of cash flows from operations and from outside sources. The MD&A is designed to focus specifically on material events and uncertainties known to management that are reasonably likely to cause reported financial information not to be necessarily indicative of future operating results or of future financial condition. This includes descriptions and amounts of matters that have had a material impact on reported operations, as well as matters that are reasonably likely based on management’s assessment to have a material impact on future operations.\nThis MD&A is designed to provide a reader of the accompanying financial statements with a narrative from the perspective of management. The MD&A is divided into seven sections:\nBasis of Presentation\nResults of Operations\nFinancial Instruments and Risk Management\nLiquidity and Capital Resources\nCritical Accounting Estimates\nNew Accounting Standards\nBASIS OF PRESENTATION\nThe accompanying Consolidated and Combined Financial Statements present the historical financial position, results of operations, changes in equity and cash flows of the Company in accordance with generally accepted accounting principles in the United States (“GAAP”). Prior to the Separation from Danaher Corporation (“Danaher” or “Former Parent”) on September 30, 2023, Veralto businesses were comprised of certain Danaher operating units. Veralto Corporation and the Veralto Businesses (including the periods prior to the Separation) are collectively referred to as “Veralto” or the “Company” herein.\nThe Combined Financial Statements for periods prior to the Separation were derived from Danaher’s consolidated financial statements and accounting records and prepared in accordance with GAAP for the preparation of carved-out combined financial statements. Prior to the Separation, all revenues and costs as well as assets and liabilities directly associated with Veralto have been included in the Combined Financial Statements. Additionally, the Combined Financial Statements for periods prior to the Separation included allocations of certain general, administrative, sales and marketing expenses and cost of sales from Danaher’s corporate office and from other Danaher businesses to Veralto, and allocations of related assets, liabilities, and the Former Parent’s investment, as applicable. The allocations were determined on a reasonable basis; however, the amounts are not necessarily representative of the amounts that would have been reflected in the financial statements had the Company been an entity that operated independently of Danaher during the applicable periods. Accordingly, the Consolidated and Combined Financial Statements may not be indicative of Veralto’s results had the Company been a separate stand-alone entity throughout the periods presented. For further discussion of related party allocations prior to the\nSeparation, including the method for such allocation, refer to Note 18 to the Consolidated and Combined Financial Statements.\nFollowing the Separation, the Consolidated Financial Statements include the accounts of Veralto and those of the Company’s wholly-owned subsidiaries and no longer include any allocations from Danaher.\nOVERVIEW\nRefer to “Item 1. Business” for a discussion of Veralto’s strategic objectives and methodologies for delivering long-term shareholder value. Veralto is a multinational business with global operations. During 2024, approximately 55% of Veralto’s sales were derived from customers outside the United States. As a diversified, global business, Veralto’s operations are affected by worldwide, regional and industry-specific economic and political factors. Veralto’s geographic and industry diversity, as well as the range of its products and services, help limit the impact of any one industry or the economy of any single country on its consolidated operating results. The Company’s individual businesses monitor key competitors and customers, including to the extent possible their sales, to gauge relative performance and the outlook for the future.\nAs a result of the Company’s geographic and industry diversity, the Company faces a variety of opportunities and challenges, including rapid technological development in most of the Company’s served markets, the expansion and evolution of high-growth markets, trends and costs associated with a global labor force, consolidation of the Company’s competitors and increasing regulation. The Company operates in a highly competitive business environment in most markets, and the Company’s long-term growth and profitability will depend in particular on its ability to identify, consummate and integrate appropriate acquisitions and identify and consummate appropriate investments and strategic partnerships, develop innovative and differentiated new products and services with higher gross profit margins, expand and improve the effectiveness of the Company’s sales force, continue to reduce costs and improve operating efficiency and quality, effectively address the demands of an increasingly regulated global environment and expand its business in high-growth geographies and high-growth market segments. The Company is making significant investments, organically and through acquisitions and investments, to address the rapid pace of technological change in its served markets and to globalize its manufacturing, research and development and customer-facing resources to be responsive to the Company’s customers throughout the world and improve the efficiency of the Company’s operations. The Company defines high-growth markets as developing markets of the world which include Asia (with the exception of Japan, Australia and New Zealand), Latin America (including Mexico), the Middle East, Eastern Europe and Africa. The Company defines developed markets as all markets of the world that are not high-growth markets.\nBusiness Performance\nThe Company’s overall revenues for the year ended December 31, 2024 increased 3.4% as compared to 2023. Core sales for the year ended December 31, 2024 increased 3.7% as compared to 2023. Currency exchange rates decreased reported sales by 0.3%. For the definition of “core sales,” refer to “—Results of Operations” below.\nGeographically, the Company’s sales during 2024 in developed markets increased year-over-year by 4.6% driven by increased sales of 5.9% in North America and 2.6% in Western Europe while high-growth markets were flat, primarily driven by year-over-year sales increases in the majority of countries within the high-growth markets offset by low double digit sales declines in China due to lower demand.\nThe Company’s core sales during 2024 in developed markets increased 4.2% year-over-year driven by a 5.3% increase in North America and a 2.2% increase in Western Europe. Core sales in high-growth markets increased 2.5% driven by high-single digit increases in Latin America partially offset by mid-single digit decreases in China.\nNet earnings for the year ended December 31, 2024 totaled approximately $833 million, or $3.34 per diluted common share, compared to approximately $839 million, or $3.40 per diluted common share, for the year ended December 31, 2023. The decrease in net earnings in 2024 as compared to 2023 was driven by higher operating expenses, standalone public company costs and interest expense post separation from Danaher. Refer to “—Results of Operations” for further discussion of the year-over-year changes in net earnings for the year ended December 31, 2024.\nThe Company anticipates 2025 results will be driven by the following expectations in each of the Company’s reportable segments:\nWater Quality: the Company expects continued year-over-year growth driven by on-going strong demand for industrial water treatment, particularly in North America, with steady demand across municipal end-markets in North America and Europe, partially offset by continued weakness in China.\nProduct Quality & Innovation: the Company expects continued year-over-year growth driven by improved demand in the consumer packaged goods market globally.\nThe Company has access to capital resources and continues to focus on profitability improvements and leveraging Veralto Enterprise System (“VES”) to manage the anticipated impact of the challenging macroeconomic environment on business operations.\nThe Company’s outlook for 2025 reflects our current visibility and expectations based on current market factors. Our ability to meet our expectations are subject to numerous risks, including, but not limited to, those described in “Item 1A. Risk Factors” within this annual report.\nAcquisitions and Strategic Investments\nOn October 4, 2024, the Company completed its acquisition of Information Exchange Holdings, Inc., the holding company that owns TraceGains, for $349 million, net of cash acquired. The Company believes this business complements the PQI segment, specifically the packaging and color solutions business. TraceGains is a leading provider of cloud-based software solutions that enable connected data and digital workflow management to help consumer brands meet increasingly stringent compliance and reporting regulations for food and beverage safety and traceability. Its solutions enable consumer brands to efficiently track ingredient inputs, monitor supplier quality and develop new products with greater safety and increased velocity.\nOn November 12, 2024, the Company completed an investment of CAD $20 million to establish a minority interest in Axine Water Technologies (“Axine”), a leading provider of electrochemical oxidation technology for contaminant destruction. Axine's electraCLEAR\nTM\nsolution provides simple, safe, efficient, and cost-effective destruction of organic contaminants in pharmaceuticals and industrial wastewater, including long- and short-chain PFAS. The strategic collaboration with Axine builds upon Veralto's diverse portfolio of water solutions for customers in the Company’s WQ segment.\nRefer to Note 2 to the Consolidated and Combined Financial Statements for discussion regarding the Company’s acquisitions.\nPublic Company Expenses\nAs a result of the Separation, the Company is subject to the Sarbanes-Oxley Act and reporting requirements of the Securities Exchange Act of 1934, as amended (the “Exchange Act”). The Company is now required to have additional procedures and practices as a separate public company. As a result, the Company has incurred and will continue to incur additional personnel and corporate governance costs, such as internal and external audit, investor relations, stock administration and regulatory compliance costs.\nRESULTS OF OPERATIONS\nIn this report, references to the non-GAAP measure of core sales refer to sales from continuing operations calculated according to GAAP but excluding:\nsales from acquired or divested businesses (as defined below, as applicable); and\nthe impact of currency translation.\nReferences to sales or operating profit attributable to acquisitions or acquired businesses refer to sales or operating profit, as applicable, from acquired businesses recorded prior to the first anniversary of the acquisition less any sales and operating profit, during the applicable period, attributable to divested product lines not considered discontinued operations. The portion of revenue attributable to currency translation is calculated as the difference between:\nthe period-to-period change in revenue (excluding sales from acquired/divested businesses (as defined above, as applicable)); and\nthe period-to-period change in revenue (excluding sales from acquired/divested businesses (as defined above, as applicable)) after applying current period foreign exchange rates to the prior year period.\nCore sales growth should be considered in addition to, and not as a replacement for or superior to, sales growth, and may not be comparable to similarly titled measures reported by other companies. Management believes that reporting these non-GAAP financial measures provides useful information to investors by helping identify underlying growth trends in the Company’s business and facilitating comparisons of the Company’s revenue performance with its performance in prior and future periods and to the Company’s peers. Management also uses these non-GAAP financial measures to measure the Company’s operating and financial performance and uses core sales growth as one of the performance measures in the Company’s executive short-term cash incentive program. The Company excludes the effect of currency translation from these measures because currency translation is not under management’s control, is subject to volatility, and can obscure underlying business trends. In addition, the Company excludes the effect of acquisitions and divestiture-related items because the nature, size, timing and number of acquisitions and divestitures can vary dramatically from period-to-period and between the Company and its peers, and can also obscure underlying business trends making comparisons of long-term performance difficult.\nThroughout this discussion, references to sales growth or decline refer to the impact of both price and unit sales and references to productivity improvements generally refer to improved cost efficiencies resulting from the ongoing application of VES.\nSales Growth and Core Sales Growth\nTotal sales growth GAAP\nAcquisitions/divestitures\nCurrency exchange rates\nCore sales growth (non-GAAP)\n2024 Sales Compared to 2023\nTotal sales increased 3.4% on a year-over-year basis during 2024 as compared to 2023 primarily as a result of a 3.7% increase in core sales resulting from the factors discussed below by segment. Currency exchange rates decreased reported sales by 0.3% during 2024 as compared to 2023. The impact of acquisitions was flat on a year-over-year basis during 2024 as compared to 2023.\nPrice increases contributed 1.8% to sales growth on a year-over-year basis during 2024 as compared to 2023 and is reflected as a component of core sales growth above.\nSales by business segment for the years ended December 31 are as follows:\nProduct Quality & Innovation\nSales and operating profit at the business segment level are discussed in detail below. For information regarding the Company’s sales by geographical region, refer to Note 4 to the Consolidated and Combined Financial Statements.\nCost of Sales and Gross Profit\n\nYear Ended December 31\nAmortization of intangible assets\nOperating profit as a % of sales\nDepreciation as a % of sales\nAmortization as a % of sales\nSales Growth and Core Sales Growth (Decline)\nTotal sales growth GAAP\nAcquisitions/divestitures\nCurrency exchange rates\nCore sales growth (decline) (non-GAAP)\n2024 Sales Compared to 2023\nTotal Product Quality & Innovation segment sales increased 3.7% on a year-over-year basis during 2024 as compared to 2023\nprimarily as a result of core sales growth driven by the factors discussed below.\nThe impact of acquisitions increased reported sales by 0.4% during 2024 as compared to 2023. Geographically, reported sales increased by 4.5% in North America, 3.3% in Western Europe, and 4.0% in high-growth markets.\nPrice increases in the segment contributed 1.4% to sales growth on a year-over-year basis during 2024 as compared to 2023 and are reflected as a component of the change in core sales growth.\nCore sales in the Product Quality & Innovation segment increased 3.3% on a year-over-year basis during 2024 as compared to 2023. Geographically, core sales growth was driven by increases of 3.0% in North America, 5.1% in high-growth markets, and 2.3% in Western Europe. Core sales growth in the high-growth",
  "item2_clean": null
}