{
  "source_file": "vmc-20241231.htm",
  "form_type": "10-K",
  "item1_clean": "Our engagement with state, regional and local governments to develop solutions like this today will benefit future generations.\nSAFETY, HEALTH AND THE ENVIRONMENT\nA strategy for sustainable, long-term value creation must include doing right by our employees, our neighbors and the environment in which we operate.\nOur leadership recognized decades ago the significance and importance of leadership in the Safety, Health and Environmental areas. The Safety, Health and Environmental Affairs Committee of our Board of Directors, along with the full Board, has oversight responsibility for our safety, health and environmental programs and results. Our Safety, Health & Environmental Management Committee, made up of the senior leadership team along with other key senior personnel from cross-functional operations and staff disciplines, has the ongoing management responsibility for all of our safety, health and environmental initiatives. We are a leader in our industry in safety performance by applying the shared experiences, expertise and resources at each of our locally led sites with an emphasis on taking care of one another. In 2024, we experienced an overall Mine Safety and Health Administration (MSHA) safety performance of 1.2 injuries per 200,000 employee hours worked, which is well below the 2023 industry average of 1.8 injuries.\nOur community relations programs serve our neighbors while ensuring that we grow and thrive in the communities where we operate. We leverage our charitable foundation and company funds to support food banks, healthcare services, childhood education remote learning programs and other initiatives designed to lessen the difficulties experienced in many of our communities. Our charitable foundation alone has provided over $70 million in support over the past 20 years to essential charitable, civic and educational organizations that strengthen and enrich our communities. In 2024, unprecedented extreme weather had a severe impact on our communities and operations. Most notably, Hurricane Helene caused extensive damage throughout the Southeast, impacting our teams in North Carolina, South Carolina, Tennessee and Georgia. In a time of great need, the true character and spirit of our Vulcan employees remained strong, and our teams lived out the Vulcan Way (doing the right thing, the right way, at the right time) to respond to the many challenges in the aftermath of the hurricane. Our operations have been directly involved in major restoration projects in the hardest hit areas to restore normalcy in the communities where we operate.\nOur environmental stewardship commitment is designed to protect plant and animal species and habitats, as well as the air we breathe, the water we use and the planet we all share. In all parts of our company, from local operations to our corporate and regional offices to our international business and ocean-going shipping, we are focused on ensuring that our operations are efficient in ways that are economically and environmentally sustainable. As an example of our commitment to environmental stewardship, we have been a proud national partner of the Wildlife Habitat Council (WHC) since 1990 when our Sanders quarry became the first site in the U.S. to obtain certification by WHC. We currently maintain 33 WHC certified sites containing wildlife enhancement programs in addition to several other sites working towards certification. Our commitment to environmental stewardship is also demonstrated in the expansion of our renewable energy strategy. We have two additional solar projects planned in 2025, building upon the successful first year of solar facility operations at our San Emidio quarry in Bakersfield, California. We believe these projects will provide clean electricity to our operations while also benefiting the local electric grid through lessened reliance and supply of excess electricity from the facility back to the grid in peak hours. We are committed to growing our sourcing of renewable energy, reducing the carbon intensity of our products and improving energy resiliency.\nIn addition, the recycling of aggregates-containing construction materials including concrete and recycled asphalt pavement (RAP) is an important part of our business. The sources of these materials are highway, infrastructure and other demolition projects where concrete structures or asphalt paving is being removed. During 2024, we reused 2.1 million tons of RAP and recycled 1.7 million tons of concrete. The recycling of these aggregates-containing construction materials reduces carbon emissions that impact climate change while providing a valuable service to our customers and communities, extending the life of our aggregates reserves and helping us manage the cost of production.\nFor a discussion of our energy management and greenhouse gas emissions initiatives, see the Environmental Stewardship and Climate Change section later within this Item 1 under Other Business-Related Items.\nPRODUCT LINES\nOur products are used to build the roads, tunnels, bridges, railroads and airports that connect us, and to build the homes, offices, hospitals, schools, shopping centers, factories and places of worship that are essential to our lives, our communities and the economy. We have three operating (and reportable) segments (Aggregates, Asphalt and Concrete) organized around our principal product lines. As a result of a first quarter 2024 change in our internal management reporting structure, our previously reportable calcium operation is now included within our Aggregates reporting segment. This change in our reporting segments had no impact on previously reported consolidated financial results.\nAs of December 31, 2024, we had 423 active aggregates facilities, 70 asphalt facilities and 74 concrete facilities. Our 2024 total revenues and gross profit by segment are illustrated as follows:\nFor actual amounts, see Note 15 “\nFinancial Statements and Supplementary Data\nAGGREGATES\nOur construction aggregates are used in a number of ways:\nas a base material underneath highways, walkways, airport runways, parking lots and railroads\nto aid in water filtration, purification and erosion control\nas a raw material used in combination with other resources to construct many of the items we rely on to sustain our quality of life, including houses and apartments; roads, bridges and parking lots; schools and hospitals; commercial buildings and retail space; sewer systems; airports and runways; and power plants.\nAGGREGATES INDUSTRY\nKey strengths of the U.S. aggregates industry and our business include:\nLOCATION AND TRANSPORTATION OF RESERVES:\nAggregates have a high weight-to-price ratio that makes transportation expensive relative to the cost of the material. In most cases, aggregates are produced near where they are used so that the transportation cost does not exceed the product cost. Where practical, we have operations located close to our local markets because the cost of trucking materials long distances is prohibitive. Approximately 80% of our total aggregates shipments are delivered exclusively from the producing location to the customer by truck.\nExceptions to this typical market structure include areas along the U.S. Gulf Coast and the Eastern Seaboard where there are limited supplies of locally available, high-quality aggregates. We serve these markets from quarries that have access to cost-effective long-haul transportation, including shipping by barge, rail and our fleet of Panamax-class, self-unloading ships. Additionally, we serve markets in California and Hawaii from our quarry in British Columbia, Canada by means of a long-term marine shipping agreement with CSL Americas. Approximately 15% of our total aggregates shipments are delivered by truck to the customer after reaching a sales yard by rail or water. Less than 5% of aggregates shipments are delivered directly to the customer by rail or water.\nLIMITED PRODUCT SUBSTITUTION:\nThere are limited substitutes for quality aggregates. Recycled concrete and asphalt have certain applications as a lower-cost alternative to virgin aggregates. However, many types of construction projects cannot be served by recycled concrete and require the use of virgin aggregates to meet technical specifications and performance-based criteria for durability, strength and other qualities. Likewise, the amount of recycled asphalt included in asphalt mix as a substitute for aggregates is limited due to specifications.\nHIGHLY FRAGMENTED INDUSTRY:\nThe U.S. aggregates industry is composed of over 5,800 companies that operated approximately 11,100 facilities during 2024. This fragmented structure provides many opportunities for consolidation. Companies in the industry commonly enter new markets or expand positions in existing markets through the acquisition of existing facilities.\nThrough strategic acquisitions and investments, we have developed an unmatched coast-to-coast footprint of strategically located permitted reserves concentrated in and serving the nation’s key growth centers. We have approximately 25,000 customers across the markets we serve.\nFLEXIBLE PRODUCTION CAPABILITIES:\nThe production of aggregates is a mechanical process in which stone is crushed and, through a series of screens, separated into various sizes depending on how it will be used. Direct production costs of aggregates primarily include: a) wages and fringe benefits; b) depreciation, depletion, accretion and amortization of capital (or long-term) assets; c) operating parts and supplies; d) repair and maintenance; e) third-party contracted services and f) energy (primarily electricity and diesel). Production capacity is flexible by adjusting operating hours to meet changing market demand. We are currently operating considerably below full capacity, making us extremely well positioned to further benefit from economies of scale when additional growth materializes.\nRAW MATERIAL INPUTS LARGELY CONTROLLED:\nUnlike typical industrial manufacturing industries, the aggregates industry does not require the input of raw material beyond owned or leased aggregates reserves. Stone, sand and gravel are naturally occurring resources. However, production does require the use of explosives, hydrocarbon fuels and electric power.\nDEMAND CYCLES:\nLong-term growth in demand for aggregates is largely driven by growth in population, jobs and households. While short-term and medium-term demand for aggregates fluctuates with economic cycles, declines have historically been followed by strong recoveries.\nThe drivers underpinning long-term demand and sustained pricing growth remain firmly in place in both the public and private sectors of the economy. They include: population growth; gains in total employment and in household income; a continuing increase in household formations; the growing need for additional housing stock; a multi-year federal transportation law in place and continuing increases in transportation funding at state and local levels; stable state tax receipts; and a multi-year federal infrastructure investment law and continued political awareness and focus on the need to invest in infrastructure.\nAGGREGATES MARKETS\nWe focus on the U.S. markets with above-average long-term expected population growth and where construction is expected to expand. We produce and sell aggregates (crushed stone, sand and gravel, sand, and other aggregates) and related products and services in 23 states, the U.S. Virgin Islands, Washington D.C., Freeport (Bahamas), British Columbia (Canada), Puerto Cortés (Honduras) and Quintana Roo (Mexico) — see the NAFTA Arbitration section in Note 12 “\nCommitments and Contingencies\nFinancial Statements and Supplementary Data\n.” We serve both the public and the private sectors.\nPublic sector construction activity has historically been more stable and less cyclical than private sector construction, and it generally requires more aggregates per dollar of construction spending. P",
  "item7_clean": "Higher aggregates gross profit\nHigher asphalt gross profit\nLower concrete gross profit\nLower (higher) selling, administrative and general expenses\nHigher (lower) gain on sale of property, plant & equipment and businesses\nLower (higher) impairment charges\nLower (higher) interest expense\nLower (higher) acquisition related expenses\nHigher environmental remediation expenses\nLower (higher) foreign currency transaction losses\nOPERATING RESULTS BY SEGMENT\nWe present our results of operations by segment at the gross profit level. We have three operating (and reportable) segments organized around our principal product lines: (1) Aggregates, (2) Asphalt and (3) Concrete. Management reviews earnings for our reporting segments principally at the gross profit level.\nAGGREGATES\nSHIPMENTS\nAggregates shipments decreased 6%, reflecting underlying demand as well as the impacts from severe weather events in the third quarter which were not all recovered during the fourth quarter of 2024.\nOur year-over-year freight-adjusted selling price\nincreased 10.8% in 2024\nincreased 15.9% in 2023\nincreased 10.3% in 2022\nWe routinely arrange the delivery of our aggregates to the customer. Additionally, we incur freight costs to move aggregates from the production site to remote distribution sites. These costs are passed on to our customers in the aggregates price. We remove these pass-through freight & delivery revenues (and any other aggregates-derived segment revenues, such as landfill tipping fees) from the freight-adjusted selling price for aggregates. See the \"\nReconciliation of Non-GAAP Financial Measures\nwithin this Item 7 for a reconciliation of freight-adjusted revenues.\nThe pricing environment remained positive. Freight-adjusted pricing increased 10.8% ($2.06 per ton) versus the prior year to $21.08, with all markets realizing year-over-year improvement.\nAGGREGATES GROSS PROFIT\nAGGREGATES CASH GROSS PROFIT\nAggregates segment gross profit increased 5% to $1,816.7 million (or $8.26 per ton), and gross profit margin expanded 120 basis points. Cash gross profit per ton increased 12% (or $1.15 per ton) from the prior year to $10.61 resulting from continued pricing growth and moderating cost trends. Improvements in unit profitability were widespread across our footprint.\nFreight-adjusted unit cash cost of sales increased 10%, or $0.91 per ton. Shipments in 2024 and 2023 were negatively impacted by the absence of tons available from our Mexico operations which were unexpectedly and arbitrarily shut down by the Mexican government in 2022 (f\nor additional information, see Note 12 “\nCommitments and Contingencies\nFinancial Statements and Supplementary D\nASPHALT\nSHIPMENTS\nAsphalt segment gross profit was $170.1 million (an increase of $20.5 million), and cash gross profit was $214.2 million, a 16% increase from the prior year. Shipments increased slightly, and pricing increased 5.7%, or $4.33 per ton.\nASPHALT GROSS PROFIT\nASPHALT CASH GROSS PROFIT\nOur year-over-year average sales price\nincreased 5.7% in 2024\nincreased 6.3% in 2023\nincreased 21.2% in 2022\nAsphalt mix average sales price is calculated by dividing revenues generated from the shipment of asphalt mix by the total tons shipped. The sales price calculation excludes service revenues generated from our asphalt construction paving business.\nCONCRETE\nSHIPMENTS\nConcrete segment gross profit was $12.8 million, a decrease of $49.3 million from the prior year which included earnings from our divested operations in Texas. Cash gross profit was $58.3 million, and unit cash gross profit was $16.35 per cubic yard.\nCONCRETE GROSS PROFIT\nCONCRETE CASH GROSS PROFIT\nOur year-over-year average sales price\nfor ready-mixed concrete:\nincreased 9.6% in 2024\nincreased 10.7% in 2023\nincreased 11.1% in 2022\nReady-mixed concrete average sales price is calculated by dividing revenues generated from the shipment of ready-mixed concrete by the total cubic yards shipped. The sales price calculation excludes immaterial revenues generated from the sale of raw materials.\nSELLING, ADMINISTRATIVE AND GENERAL EXPENSES\nAs a percentage of total revenues, SAG expense was:\n7.2% in 2024 — increased 20 basis points\n7.0% in 2023 — unchanged from the prior year\n7.0% in 2022 — decreased 50 basis points\nOur comparative headcount levels at year-end:\nincreased 9% in 2024\ndecreased 8% in 2023\nincreased 6% in 2022\nThe 2024 increase in our employment level was primarily the result of acquisitions (see Note 19 \"\nAcquisitions and Divestitures\n\nITEM 7\nMANAGEMENT'S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS\nEXECUTIVE SUMMARY\nFINANCIAL SUMMARY FOR 2024\nCOMPARED TO 2023:\nTotal revenues decreased $364.2 million, or 5%, to $7,417.7 million\nGross profit increased $51.1 million, or 3%, to $1,999.6 million\nSelling, administrative and general (SAG) expenses decreased 2% to $531.1 million and increased 20 basis points as a percentage of total revenues\nOperating earnings decreased $62.9 million, or 4%, to $1,364.5 million\nEarnings attributable to Vulcan from continuing operations were $6.91 per diluted share, compared to $7.06 per diluted share\nAdjusted earnings attributable to Vulcan from continuing operations were $7.53 per diluted share, compared to $7.00 per diluted share\nNet earnings attributable to Vulcan were $911.9 million, a decrease of $21.3 million, or 2%\nAdjusted EBITDA was $2,057.2 million, an increase of $45.9 million, or 2%\nAggregates segment sales increased $30.7 million, or 1%, to $5,949.6 million\nAggregates segment freight-adjusted revenues increased $174.9 million, or 4%, to $4,636.2 million\nShipments decreased 6%, or 14.6 million tons, to 219.9 million tons\nFreight-adjusted sales price increased 10.8%, or $2.06 per ton to $21.08\nAggregates segment gross profit increased $79.9 million, or 5%, to $1,816.7 million\nUnit profitability (as measured by gross profit per ton) increased 12% to $8.26 per ton\nUnit profitability (as measured by cash gross profit per ton) increased 12% to $10.61 per ton\nAsphalt and Concrete segment sales decreased $490.9 million, or 21%, to $1,899.1 million, collectively\nAsphalt and Concrete segment gross profit decreased $28.8 million, or 14%, to $182.9 million, collectively\nReturned capital to shareholders via dividends of $244.4 million at $1.84 per share versus $228.4 million at $1.72 per share\nReturned capital to shareholders via share repurchases of $68.8 million at $254.71 average price per share compared to $200.0 million at $204.52 average price per share\n\nStatements and Supplementary Data\nMARKET DEVELOPMENTS AND OUTLOOK\nWe carry solid momentum into 2025 and are well positioned to deliver another year of strong earnings growth and cash generation. Continued strength in public construction activity and our recent acquisitions support our expectations for volume growth in 2025. The pricing environment remains positive, and inflationary pressures continue to moderate. This backdrop, coupled with our Vulcan Way of Selling and Vulcan Way of Operating disciplines, will lead to further expansion in our industry-leading aggregates cash gross profit per ton and value creation for our shareholders.\nOur expectations for 2025 include:\nA third consecutive year of double-digit year-over-year growth in Aggregates segment cash gross profit per ton ($10.61 in 2024)\nShipments growth of 3% to 5% (219.9 million tons in 2024)\nFreight-adjusted price improvement of 5% to 7% ($21.08 in 2024); inclusive of over 100 basis points of negative mix impact from recent acquisitions\nLow to mid-single digit increase in freight-adjusted unit cash cost (freight-adjusted price less segment cash gross profit per ton; $10.47 in 2024)\nTotal Asphalt and Concrete segment cash gross profit of approximately $360 million ($272 million in 2024)\nRelative contribution of approximately two-thirds from the Asphalt segment and one-third from the Concrete segment\nSelling, Administrative and General expenses of $550 million to $560 million ($531 million in 2024)\nInterest expense of approximately $245 million\nCapital spending for maintenance and growth projects of $750 million to $800 million\nDepreciation, depletion, accretion and amortization expense of approximately $800 million\nAn effective tax rate of 22% to 23%\nNet earnings attributable to Vulcan of $1,010 million to $1,170 million\nAdjusted EBITDA between $2,350 million and $2,550 million (includes $150 million contribution from acquisitions)\nPOSITIONED FOR GROWTH AND VALUE CREATION\nDURABLE BUSINESS MODEL TO EXTEND THE CYCLE AND SUSTAIN GROWTH\n39% improvement in Aggregates gross profit per ton since 2022\n36% improvement in Aggregates cash gross profit per ton since 2022\nIndustry-leading commercial, logistics, operational and sourcing capabilities\nEnd market fundamentals support continued growth outlook\nPoised to benefit from generational investment in infrastructure that could extend the growth cycle by mitigating private construction cyclicality\nWe have continued to deliver strong financial performance over time and through business cycles. Through our aggregates-led strategy and focus on our strategic disciplines — the Vulcan Way of Selling (Commercial Excellence & Logistics Innovation) and the Vulcan Way of Operating (Operational Excellence & Strategic Sourcing), as outlined in Item 1 “\n” under the “Business Strategy” heading — we have created one of the most profitable public companies in our industry as measured by aggregates gross profit per ton.\nIn 2019, we set a target of $9 of cash gross profit per ton on volumes of 230 to 240 million tons, which we exceeded in 2023. In 2022, we set a new target to achieve $11 to $12 cash gross profit per ton once we reach 260 to 270 million tons. We delivered $10.61 of cash gross profit per ton on 220 million tons in 2024, exiting the year with cash gross profit of $2,332 million. Our durable growth strategy gives us confidence that we will deliver more value to our shareholders on every ton of aggregates we sell.\nCash gross profit per ton is a non-GAAP measure. See the definitions and reconciliations within this Item 7 under the caption \"\nReconciliation of Non-GAAP Financial Measures\nMore than an aggregates supplier, we are a business dedicated to customer service and finding creative solutions to meet our customers’ needs. Being a valued partner and trusted supplier means that we are providing the right product, with the right specifications, that is the right quality, delivered the right way — on time and safely. Our\nOne Vulcan, Locally Led\napproach, in which our employees work together to leverage the size and strengths of Vulcan as a whole, while running their operations with a strong entrepreneurial spirit and sense of ownership, allows us to deliver market-leading services to our customers.\nTransportation costs are passed along to our customers, and because aggregates have a very high weight-to-price ratio, those costs can add up quickly when transporting aggregates long distances. Having the most extensive distribution network of any aggregates producer sets us apart. Combining our trucking, rail, barge and ocean vessel shipping logistics capabilities allows us to provide better customer solutions and create a seamless customer experience at a competitive price. As an approximation, a truck has a capacity of 20-25 tons of aggregates; a railcar has a capacity of 4-5 truckloads; a barge has a capacity of 65 truckloads; and our ocean vessels have the capacity of 2,500 truckloads.\nProduction and sales are currently halted at our Calica operations in Mexico. For additional information, see Note 12 “\nCommitments and Contingencies\nFinancial Statements and Supplementary Data\nINDUSTRY LEADER WITH CLEAR COMPETITIVE ADVANTAGES\nLargest U.S. aggregates producer with strategic geographic diversity\n423 active aggregates facilities with 16.5 billion tons of reserves\nLeading unit profitability margins driven by operational expertise and pricing performance\n76% of the U.S. population growth over the next decade is projected to occur in Vulcan-served states\nOver time, we have strategically and systematically built one of the most valuable aggregates franchises in the U.S. with a footprint that is impossible to replicate. Zoning and permitting regulations have made it increasingly difficult to expand existing quarries or to develop new quarries. Such regulations, while curtailing expansion, also increase the value of our reserves that were zoned and permitted decades ago.\nDemand for aggregates correlates positively with changes in population, household formations and employment. We have a coast-to-coast footprint that serves 35 of the top 50 highest-growth metropolitan statistical areas (MSAs). As state and federal spending increase, Vulcan is poised to benefit greatly from growing private and public demand for aggregates, thereby delivering significant long-term value for our shareholders.\nSource: Woods & Poole CEDDS 2024\nBased on people added from 2024 to 2034\nSTRONG CASH FLOW GENERATION AND INVESTMENT-GRADE BALANCE SHEET\nFinancial capacity to sustain capital reinvestment in current asset base and to fund growth\nMaintain an investment-grade credit position\nContinue to leverage current capital base to grow earnings and maximize cash generation\nPrudently pursue attractive acquisitions and greenfields\nReturn value to shareholders with dividends and stock repurchases\nFree Cash Flow Growth\n\nAt December 31, 2024, our available liquidity was $2,064.5 million, including $559.7 million of unrestricted cash on hand, significantly higher than our liquidity needs. Our leverage ratio, as measured by total debt to Adjusted EBITDA, was 2.6 times at December 31, 2024 (our net debt to Adjusted EBITDA ratio at December 31, 2024 was 2.3 times). Our long-term leverage target is 2.0 to 2.5x.\nThese years include significant acquisition activity (see\nunder the caption \"Business Strategy\" for further details).\nSAFETY, HEALTH AND ENVIRONMENTAL PERFORMANCE\nA strategy for sustainable, long-term value creation must include doing right by our employees, our neighbors and the environment in which we operate. Over our more than six decades as a public company, we have built a strong, resilient and vital business on this foundation of doing things the right way.\nWe are a leader in our industry in safety, health and environmental performance, with a safety record substantially better than the industry average. We apply the shared experiences, expertise and resources at each of our locally led sites with an emphasis on taking care of one another. The result is a record of safety excellence that consistently outperforms the industry.\nVulcan MSHA Injury Rate Compared to Aggregates Industry\nNumber of Injuries per 200,000 Hours Worked\nSource: Bureau of Labor Statistics records and internal Vulcan data.\nThe aggregates industry MSHA injury rate for 2024 was not available as of the filing of this report.\nWe focus on our environmental stewardship programs with the same commitment that we bring to our health and safety initiatives resulting in 98% citation-free inspections out of all 2024 federal and state environmental inspections. As an industry leader, our aim is to meet — and strive to exceed — all federal, state and local environmental regulations.\nHowever, sustainability means looking beyond what is required of a company by governments and regulators. Sustainability is reflected in our business strategy. We lead community relations programs that serve our neighbors while ensuring that we grow and thrive in the communities where we operate. In all parts of our company, from local operations to our corporate and regional offices to our international business and ocean-going shipping, we are focused on ensuring that our operations are efficient in ways that are economically and environmentally sustainable. It’s the right thing to do for our business and our stakeholders.\nWe continue to make progress on reducing our carbon footprint, increasing our energy ",
  "item2_clean": null
}