{
  "source_file": "vmc-20250930.htm",
  "form_type": "10-Q",
  "item1_clean": null,
  "item7_clean": null,
  "item2_clean": "Asphalt segment gross profit was $71.0 million (an 18% improvement over the prior year), and cash gross profit was $83.9 million (a 16% improvement over the prior year). Gross profit margin remained strong and expanded to 17%. Gross profit per ton increased 12%, and cash gross profit per ton improved 10%.\nConcrete segment gross profit was $14.1 million, and cash gross profit was $30.6 million. Gross profit margin expanded to 6%, unit gross profit increased 62%, and unit cash gross profit increased 34%, benefiting from the profitability of acquired operations.\nSAG expense was $145.3 million for the third quarter compared to $129.1 million in the prior year. The increase in the current year was primarily due to SAG expense for prior year business acquisitions and higher incentives expense. For the quarter, SAG expense as a percent of total revenues improved slightly to 6.3%. On a trailing-twelve months basis, SAG expense was 7.2% of total revenues, unchanged from the prior year.\nGain on sale of property, plant & equipment and businesses was $0.6 million in the third quarter of 2025 compared to $0.2 million in the third quarter of 2024.\nDuring the third quarter of 2024, we recorded an $86.6 million pretax goodwill impairment charge related to a reporting unit that included concrete operations acquired from U.S. Concrete in 2021 ($84.2 million after tax). There were no similar charges in the third quarter of 2025.\nOther operating income (expense), net which is composed primarily of idle facilities expense, environmental remediation costs, gain (loss) on settlement of AROs, finance charges collected, and rental income, was $9.3 million of expense for the third quarter of 2025 compared to $12.6 million of expense in the third quarter of 2024.\nOther nonoperating income (expense), net was $0.7 million of income for the third quarter of 2025 compared to $3.8 million of expense in the third quarter of 2024.\nNet interest expense was $55.3 million in the third quarter of 2025 compared to $38.4 million in the third quarter of 2024. The increase in interest expense was primarily due to a higher debt level resulting from the November 2024 notes issuances.\nIncome tax expense from continuing operations was $112.4 million in the third quarter of 2025 compared to $85.2 million in the third quarter of 2024. The increase in tax expense was primarily due to the increase in pretax earnings, partially offset by the nondeductible portion of the loss on impairment recorded in the third quarter of 2024.\nEarnings attributable to Vulcan from continuing operations were $2.83 per diluted share in the third quarter of 2025 compared to $1.57 per diluted share in the third quarter of 2024.\nDISCONTINUED OPERATIONS — Third quarter pretax loss from discontinued operations was $1.6 million in 2025 compared with a pretax loss of $1.8 million in 2024. Both periods include charges related to general and product liability costs, including legal defense costs, and environmental remediation costs associated with our former Chemicals business. For additional details, see\nto the condensed consolidated financial statements under the caption Discontinued Operations.\nYEAR-TO-DATE SEPTEMBER 30, 2025 COMPARED TO YEAR-TO-DATE SEPTEMBER 30, 2024\nTotal revenues for the first nine months of 2025 were $6,028.5 million, up 8% from the first nine months of 2024. Shipments increased in aggregates (+3%), asphalt mix (+2%) and ready-mixed concrete (+25%). Gross profit increased in the Aggregates segment (+$198.7 million or 15%), the Asphalt segment (+$9.0 million or 7%) and the Concrete segment (+$17.6 million or 213%).\nNet earnings attributable to Vulcan for the first nine months of 2025 were $824.7 million, or $6.21 per diluted share, compared to $618.2 million, or $4.65 per diluted share, in the first nine months of 2024. Each period’s results were impacted by discrete items, as follows:\nNet earnings attributable to Vulcan for the first nine months of 2025 include:\npretax charges of $1.9 million associated with non-routine acquisitions\npretax loss on discontinued operations of $5.7 million\n$5.6 million of tax charges related to a valuation allowance against Calica deferred tax assets, including NOL carryforwards\nNet earnings attributable to Vulcan for the first nine months of 2024 include:\npretax charges of $86.6 million associated with a goodwill impairment\npretax charges of $1.0 million associated with divested operations\npretax charges of $1.8 million associated with non-routine acquisitions\npretax loss on discontinued operations of $6.8 million\n$4.5 million of tax charges related to a valuation allowance against Calica deferred tax assets, including NOL carryforwards\nAdjusted for these discrete items, earnings attributable to Vulcan from continuing operations (Adjusted Diluted EPS) was $6.29 per diluted share for the first nine months of 2025 compared to $5.37 per diluted share for the first nine months of 2024.\nCONTINUING OPERATIONS — Changes in earnings from continuing operations before income taxes for year-to-date September 30, 2025 versus year-to-date September 30, 2024 are summarized below:\nYear-to-date September 30, 2024\nHigher aggregates gross profit\nHigher asphalt gross profit\nHigher concrete gross profit\nHigher selling, administrative and general expenses\nHigher gain on sale of property, plant & equipment and businesses\nLower impairment charges\nHigher interest expense, net\nYear-to-date September 30, 2025\nAggregates segment sales for the first nine months of 2025 were $4,777.5 million (up 7%), and shipments increased 3%, or 5.7 million tons, compared to the prior year. Aggregates segment gross profit was $1,529.0 million ($8.91 per ton) in the first nine months of 2025 versus $1,330.3 million ($8.01 per ton) in the prior year. On a year-to-date basis, cash gross profit per ton increased 12% to $11.52 per ton.\nFreight-adjusted selling prices increased 5.1% compared to the prior year (6.6% on a mix-adjusted basis), with growth widespread across our footprint. Freight-adjusted unit cost of sales for the first nine months of 2025 decreased 1% versus the prior year, reflecting a continued focus on cost management and operating efficiencies.\nAsphalt segment gross profit of $132.9 million was up $9.0 million from the first nine months of 2024, and cash gross profit of $171.9 million was a 10% improvement over the prior year. Asphalt mix shipments increased 2%, and average unit selling prices increased 3%, or $2.46 per ton.\nConcrete segment gross profit of $25.8 million was up $17.6 million from the first nine months of 2024, and cash gross profit of $76.7 million was a 78% increase from the prior year.\nSAG expenses were $428.0 million in the first nine months of 2025 versus $393.0 million in the first nine months of 2024. As a percent of total revenues, SAG expense was 7.1%, unchanged from the prior year's first nine months.\nGain on sale of property, plant & equipment and businesses was $9.2 million in the first nine months of 2025 versus $4.6 million in the first nine months of 2024.\nFor the nine months ended September 30, 2024, we recorded an $86.6 million pretax goodwill impairment charge related to a reporting unit that included concrete operations acquired from U.S. Concrete in 2021 ($84.2 million after tax). There were no similar charges in the first nine months of 2025.\nOther operating income (expense), net which is composed primarily of idle facilities expense, environmental remediation costs, gain (loss) on settlement of AROs, finance charges collected, and rental income, was $28.2 million of expense for the first nine months of 2025 compared to $23.9 million of expense in the first nine months of 2024.\nOther nonoperating income (expense), net was $0.4 million of income for the first nine months of 2025 compared to $12.7 million of expense in the first nine months of 2024. The year-over-year improvement was primarily related to higher foreign currency transaction gains in the current year.\nNet interest expense was $174.2 million in the first nine months of 2025 compared to $117.7 million in the first nine months of 2024. The increase in interest expense was primarily due to a higher debt level resulting from the November 2024 notes issuances.\nIncome tax expense from continuing operations was $237.4 million in the first nine months of 2025 compared to $208.5 million in the first nine months of 2024. The increase in tax expense was primarily due to the increase in pretax earnings, partially offset by the nondeductible portion of the loss on impairment recorded in the third quarter of 2024. The increase was further offset by an increase in the statutory depletion deduction and the release of a valuation allowance against deferred tax assets of a Canadian subsidiary in 2025.\nEarnings attributable to Vulcan from continuing operations were $6.24 per diluted share in the first nine months of 2025 compared to $4.68 per diluted share in the first nine months of 2024.\nDISCONTINUED OPERATIONS — First nine months pretax loss from discontinued operations was $5.7 million in 2025 compared with a pretax loss of $6.8 million in 2024. Both periods include charges related to general and product liability costs, including legal defense costs, and environmental remediation costs associated with our former Chemicals business. For additional details, see\nto the condensed consolidated financial statements under the caption Discontinued Operations.\nKNOWN TRENDS OR UNCERTAINTIES\nInflationary pressures and labor constraints can be factors that impact our operations. Although inflationary pressures can create short-term to medium-term headwinds, the combination of inflation and visibility of demand may create a favorable environment for price increases. Additionally, labor constraints can cause delays and inefficiencies in our operations as well as those of our customers. If labor constraints continue, our operations may proceed at a slower pace, which may effectively extend th"
}