{
  "source_file": "vrsk20250930_10q.htm",
  "form_type": "10-Q",
  "item1_clean": null,
  "item7_clean": null,
  "item2_clean": "We had a syndicated revolving credit facility (\"Syndicated Revolving Credit Facility\") with a borrowing capacity of $1,000.0 million with Bank of America N.A., HSBC Bank USA, N.A., JP Morgan Chase Bank, N.A., Wells Fargo Bank, National Association, Citibank, N.A., Morgan Stanley Bank, N.A., TD Bank, N.A., Goldman Sachs Bank USA, and the Northern Trust Company with a maturity date of April 5, 2028. On August 15, 2025, we entered into the Third Amended and Restated Credit Agreement (the \"Amendment and Restatement\") to the Syndicated Revolving Credit Facility with Bank of America, N.A. as administrative agent. The Amendment and Restatement increased our borrowing capacity to $1,250.0 million and extends the maturity date to August 15, 2030. Interest on borrowings under the Amendment and Restatement is payable at an interest rate of SOFR plus 100.0 to 162.5 basis points, depending upon our public debt rating. A commitment fee on any unused commitment is payable periodically and may range from 8.0 to 17.5 basis points based upon our publ\nic debt rating. The Syndicated Revolving Credit Facility, as amended and restated by the Amendment and Restatement, also contains certain financial and other covenants that, among other things, impose certain restrictions on indebtedness, liens,\ndispositions fundamental changes, and use of proceeds\n. The financial covenants require that, at the end of any fiscal quarter, we have a consolidated interest coverage ratio of more than 3.00 to 1.00, we have a consolidated funded debt leverage ratio of less than 3.75 to 1.00. At our election, the maximum consolidated funded debt leverage ratio could be permitted to increase to 4.50 to 1.00 (no more than once) and to 4.25 to 1.00 (no more than once) in connection with the closing of a permitted acquisition. The Syndicated Revolving Credit Facility may be used for general corporate purposes, including working capital needs and capital expenditures, acquisitions, dividend payments, and the share repurchase program (the \"Repurchase Program\"). In connection with the Amendment and Restatement, we incurred additional debt issuance costs of $1.0 million, which will be amortized to 'Interest expense' within the accompanying consolidated statements of operations over the remaining life of the Syndicated Revolving Credit Facility. As of September 30, 2025, we were in compliance with all financial and other debt covenants under our Syndicated Revolving Credit Facility. As of September 30, 2025 and December 31, 2024, the available capacity under the Syndicated Revolving Credit Facility was $1,245.5 million and $995.4 million, which takes into account outstanding letters of credit of $4.5 million and $4.6 million, respectively.\n\nOn August 15, 2025, we also entered into a $750.0 million Term Credit Agreement (the \"Term Loan Facility\") with Bank of America N.A. The Term Loan Facility has a maturity date of August 15, 2028 and carries an interest rate of SOFR plus 100.0 to 162.5 basis points, depending upon our public debt rating. The Term Loan Facility also contains certain financial and other covenants that, among other things, impose certain restrictions on indebtedness, liens,\ndispositions fundamental changes, and use of proceeds.\n. The financial covenants require that, at the end of any fiscal quarter, we have a consolidated interest rate coverage ratio of less than 3.00 to 1.00. we have a consolidated funded debt leverage ratio of greater than 3.75 to 1.00. At our election, the maximum consolidated funded debt leverage ratio could be permitted to increase to 4.50 to 1.00 (no more than once) and to 4.25 to 1.00 (no more than once) in connection with the closing of a permitted acquisition. We plan to use the borrowings to finance the purchase price for the acquisition of AccuLynx and to pay related fees and expenses. In connection with the Term Loan Facility, we incurred additional debt issuances costs of $5.8 million, which will be amortized to \"Interest expense\" within the accompanying consolidated statements of operations over the remaining life of the Term Loan Facility.\n\nWe earn revenues through agreements for hosted subscriptions, advisory/consulting services, and for transactional solutions, recurring and non-recurring. Subscriptions for our solutions are generally paid in advance of rendering services either quarterly or in full upon commencement of the subscription period, which is usually for one year and automatically renewed each year. As a result, the timing of our cash flows generally precedes our recognition of revenues and income and our cash flow from operations tends to be higher in the first quarter as we receive subscription payments. Examples of these arrangements include subscriptions that allow our customers to access our standardized coverage language, our claims fraud database, or our actuarial services throughout the subscription period. In general, we experience minimal revenue seasonality within the busi\nSeptember 30, 2025 and 2024\n81% of our insurance revenues were derived from hosted subscriptions through agreements (generally one to five years) for our solutions, respectively.\n\nAs of September 30, 2025 and December 31, 2024, we had cash and cash equivalents and available-for-sale secu\nrities totaling $2,108.7 million and $292.5 million, respectively. We maintain our cash and cash equivalents in higher credit quality financial institutions in order to limit the amount of credit exposure. As of\n, a vast majority of our domestic cash and cash equivalents is with TD Bank, N.A., JPMorgan Chase N.A., and Northern Trust. Subscriptions for our solutions are billed and generally paid in advance of rendering services either quarterly or in full upon commencement of the subscription period, which is usually for one year. Subscriptions are automatically renewed at the beginning of each calendar year. We have historically generated significant cash flows from operations. As a result of this factor, as well as the availability of funds under our Credit Facility, we expect that we will have sufficient cash to meet our working capital and capital expenditure needs and to fuel our future growth plans.\n\nWe have historically managed the business with a working capital deficit due to the fact that, as described above, we offer our solutions and services primarily through annual subscriptions or long-term contracts, which are generally prepaid quarterly or annually in advance of the services being rendered. When cash is received for prepayment of invoices, we record an asset (cash and cash equivalents) on our balance sheet with the offset recorded as a current liability (deferred revenues). This current liability is deferred revenue that does not require a direct cash outflow since our customers have prepaid and are obligated to purchase the services. In most businesses, growth in revenue typically leads to an increase in the accounts receivable balance causing a use of cash as a company grows. Unlike these businesses, our cash position is favorably affected by revenue growth, which results in a source of cash due to our customers prepaying for most of our services.\n\nSelling, general and administrative expenses were\nthree months ended September 30, 2025\nthree months ended September 30, 2024\n. Our recent acquisitions and disposition accounted for a net increase\nmillion in selling, general, and administrative expenses. The remaining decrease of $6.8\nwas primarily due to a\nnet loss on disposal of fixed assets of $7.1 million in the prior year, insurance expense of $1.9 million, rent expense of $1.5 million, and professional consulting fees of $1.5 million, partially offset by\nnformation technology expense of $2.3 million, salaries and employee benefits of $1.6 million, and other operating costs of $1.3 million.\n\nOur clients use our solutions to make better decisions about risk and opportunities with greater efficiency and discipline. We refer to these products and services as “solutions” due to the integration among our services and the flexibility that enables our clients to purchase components or the comprehensive package. These solutions take various forms, including data, statistical models, or tailored analytics, all designed to allow our clients to make more logical decisions. We believe our solutions for analyzing risk positively impact our clients’ revenues and help them better manage their costs.\n\nWe use year-over-year EBITDA growth as metrics to measure our performance. EBITDA and EBITDA margin are non-GAAP financial measures. EBITDA is defined as net income before interest expense, provision for income taxes, and depreciation and amortization of fixed and intangible assets. We calculate EBITDA margin as EBITDA divided by revenues. The respective nearest applicable GAAP financial measures are net income and net income margin. Although EBITDA is a non-GAAP financial measure, EBITDA is frequently used by securities analysts, lenders, and others in their evaluation of companies; EBITDA has limitations as an analytical tool, and should not be considered in isolation, or as a substitute for an analysis of our operating income, net income, or cash flow from operating activities reported under GAAP. Management uses EBITDA and EBITDA margin in conjunction with traditional GAAP operating performance measures as part of its overall assessment company performance. We believe these measures are useful and meaningful because they help us allocate resources, make business decisions, allow for greater transparency regarding our operating performance, and facilitate period-to-period comparisons. Some of these limitations involved in the use of EBITDA are:\n\nThe provision for income taxes was\nmillion and the effective tax rate was 25.3% for the\nthree months ended September 30, 2025\nmillion and 22.9% for the\nthree months ended September 30, 2024\nThe increase in the effective tax rate was primarily due to a nonrecurring tax benefit recognized in the pri"
}