{
  "source_file": "vrsn-20241231.htm",
  "form_type": "10-K",
  "item1_clean": "Disaster Recovery Plans:\nWe have disaster recovery and business continuity capabilities that are designed to deal with the loss of entire data centers and other facilities. We maintain data centers with mirrored services that allow failover with no data loss and no loss of function or capacity. Our critical data services (including domain name registration) use advanced storage systems and techniques such as synchronous mirroring and remote replication to our global resolution sites to provide data protection. We periodically operate services at alternate data centers during maintenance windows to ensure the availability of our data centers for disaster recovery.\nMarketing, Sales and Distribution\nWe seek to expand our business through focused marketing campaigns and programs that target growth in\ndomain names, both domestically and internationally through our registrars. We provide tools to be used by both registrars and end users to enable them to find relevant domain names. We have marketing and sales offices and account management teams in several countries around the world.\nResearch and Development\nWe believe that timely development of new and enhanced capabilities for our DNS registration and resolution infrastructure and of new and enhanced ways to ensure the security, stability, and resiliency of our services, are vital to protect our business in an ever-increasing cyberthreat environment, to adapt to evolving internet protocols and standards, and to remain competitive in the marketplace. We also invest in R&D that benefits the DNS and internet community in which we operate more broadly.\nOur future success will depend, in large part, on our ability to continue to maintain and enhance our current technologies and services and to develop new ones. We actively investigate and incubate new concepts and evaluate new business ideas through our innovation pipeline. We expect that most of the future enhancements to our existing services and our new services will be the result of internal development efforts in collaboration with suppliers, other vendors, customers, and the technology community. Under certain circumstances, we may also acquire or license technology from third parties.\nWe face competition in the domain name registry space from other gTLD and ccTLD registries that are competing for the business of entities and individuals that are seeking to obtain a domain name registration. In addition to the registries we operate or for which we provide technical or back-end services, there are numerous other operational gTLD registries, ASCII ccTLD registries, IDN ccTLD registries, and IDN gTLD registries. Under our agreements with ICANN, we are subject to certain restrictions in the operation of\non pricing, bundling, marketing, methods of distribution, introduction of new registry services, and use of registrars, that do not apply to ccTLDs and other gTLDs and therefore may create a competitive disadvantage. Among our competitors operating gTLD and ccTLD registries are China Internet Network Information Center (CNNIC), DENIC eG, Nominet, Identity Digital, Public Interest Registry (PIR),\n\nWe are focused on the competitive labor market, and we work diligently to ensure comprehensive sourcing strategies are in place which enable the attraction of the best talent.\nEmployee Health, Safety and Well-being:\nWe are committed to maintaining a safe and healthy environment for our employees. We have a robust physical safety and security program, including a life safety program which trains employees on appropriate emergency responses. We also offer a holistic wellness experience for our employees through our Mindful Connections program that supports employees across three pillars: physical, emotional, and financial. We support a hybrid work posture where our employees operate under team agreements that set the foundation for operating norms and allow employees to create work schedules that align with corporate and individual needs. This provides employees more flexibility to manage a healthy work-life balance. Our offices remain key to enabling collaboration, networking, and strategic discussion.\nThe following table shows a comparison of our consolidated employee headcount, by function:\nEmployee headcount by function:\nResearch and development\nSelling, general and administrative\nIntellectual Property\nWe rely on a combination of copyrighted software, trademarks, service marks, patents, trade secrets, know-how, restrictions on disclosure, and other methods to protect our proprietary assets. We also enter into confidentiality and/or intellectual property assignment agreements with our employees, consultants, customers and business partners. We also control access to and distribution of proprietary documentation and other confidential information.\nWe have been issued numerous patents in the U.S. and abroad, covering a wide range of our technologies. Additionally, we continue to file patent applications with respect to certain of our technologies in the U.S. Patent and Trademark Office and internationally. Patents may not be awarded with respect to these applications and even if such patents are awarded, they may not provide sufficient protection of our technologies. We continue to consider opportunities for strategic growth and use of our patent portfolio.\nWe have obtained trademark registrations for the VERISIGN mark and VERISIGN logo in the U.S. and certain countries, and have pending trademark applications for the VERISIGN logo in a number of other countries. We have common law rights in other proprietary names. We take steps to enforce and monitor potential infringement of Verisign’s trademarks. We rely on the strength of our Verisign brand to help differentiate ourselves in the marketing of our products and services.\nOur principal intellectual property consists of, and our success is dependent upon, proprietary software used in our business and certain methodologies (many of which are patented or for which patent applications are pending) and technical expertise and proprietary know-how we use in both the design and implementation of our current and future registry services. We own our proprietary Shared Registration System through which registrars submit second-level domain name registrations for each of the registries we operate, as well as the ATLAS distributed lookup system which processes hundreds of billions of queries per day. Some of the software and protocols used in our business are in the public domain or are otherwise available to our competitors, and some are based on open standards set by organizations such as the Internet Engineering Task Force. To the extent any of our patents are considered “standard essential patents,” we may be required to license such patents to our competitors on fair, reasonable and non-discriminatory terms or otherwise be limited in our ability to assert such patents.\n\nOur operation of the .\ngTLD is subject to the terms of a registry agreement with ICANN (as amended, the “.\nRegistry Agreement”). The current term of the\nRegistry Agreement is six years and must be renewed or extended by November 30, 2030. Although the\nRegistry Agreement contains a “presumptive” right of renewal, ICANN could terminate or refuse to renew the Registry Agreement in certain prescribed circumstances. See “Risk Factors - Any loss or modification of our right to operate the .\nOther significant terms within the .\nRegistry Agreement include performance specifications and service level agreements, including for example, for the availability of our DNS resolution services, our Shared Registration System, and our Registration Data Directory services, which include our Whois and Registration Data Access Protocol services. The .\nRegistry Agreement contains marketing limitations, including limitations on our ability to bundle products and the manner in which we provide marketing support to ICANN-accredited registrars. We are also required under the .\nRegistry Agreement to provide ICANN-accredited registrars with nondiscriminatory access to our systems to register or take other actions related to domain names. In order to introduce new Registry Services or make material changes to existing Registry Services, we must follow prescribed procedures which permit ICANN to review and approve such services.\nRegistry Agreement permits an increase to the Maximum Price (as defined in the\nRegistry Agreement) of\ndomain name registrations by up to 7% over the previous year in each of the final four years of each six-year period. The first such six-year period began on October 26, 2018. The restrictions in the\nRegistry Agreement relating to vertical integration apply solely to the\nOur operation of the .\ngTLD is also subject to the terms of a Cooperative Agreement with the DOC. The Cooperative Agreement has undergone various amendments with the most recent, Amendment 35, on October 26, 2018. On November 30, 2024, the Cooperative Agreement was automatically renewed on the same terms for a successive six-year term and will automatically renew on November 30, 2030, unless the DOC provides written notice of non-renewal within 120 days prior to the end of the then-current term. The Cooperative Agreement requires the mutual consent of the DOC and the Company to change its terms. In addition, under Amendment 35, we have agreed to continue to operate the .\ngTLD in a content-neutral manner and to work within ICANN processes to promote the development of content-neutral policies for the operation of the DNS.\nThe Cooperative Agreement further provides that we shall be entitled at any time during the term of the\nRegistry Agreement to seek to remove the pricing restrictions contained in the\nRegistry Agreement if we demonstrate to the DOC that market conditions no longer warrant pricing restrictions in the\nRegistry Agreement, as determined by the DOC.\nDOC approval of changes to or the renewal of the .\nRegistry Agreement was limited by Amendment 35 to only the following circumstances: (1) changes to the pricing provisions (other than as approved in Amendment 35, which are described above), (2) changes to the vertical integration provisions, (3) changes to the security, stability and resiliency posture as reflected in the functional or performance specifications (including the service level agreements), (4) changes to the conditions for renewal or termination of the\nRegistry Agreement, or (5) changes to the Whois service (except as mandated by ICANN through Temporary or Consensus Policies). As was the case with prior amendments, Amendment 35 is not intended to confer federal antitrust immunity on the Company with respect to the .\n.net Generic Top-Level Domain\nOur operation of the .\nTLD is subject to the terms of a registry agreement with ICANN (as amended, the “\nRegistry Agreement”). The\nRegistry Agreement was renewed on June 29, 2023. The current term of this agreement is six years and must be renewed or extended by July 1, 2029. The terms of the .\nRegistry Agreement are substantially similar to the terms of the .\nRegistry Agreement, except as to ICANN fees as described earlier and that the annual price for new and renewal .\ndomain name registrations may be increased by 10% each year. Our operation of the .\ngTLD is not subject to the terms of the Cooperative Agreement.\nWe operate two of the world’s thirteen root servers. Along with the ICANN community, we are involved in discussions to establish criteria for operations of the root server system including the root servers that we operate. We also publish the root zone file, as the Root Zone Maintainer, under the Root Zone Maintainer Service Agreement (“RZMA”) with ICANN. The RZMA was renewed on October 20, 2024 and the current term of the RZMA ends on October 20, 2032. The RZMA is subject to an automatic eight-year renewal, unless earlier modified or terminated.\nThe descriptions of the\nRegistry Agreement, the Cooperative Agreement, and the\nHuman Capital Mana",
  "item7_clean": "We are a global provider of critical internet infrastructure and domain name registry services, enabling internet navigation for many of the world’s most recognized domain names. We help enable the security, stability, and resiliency of the DNS and the internet by providing Root Zone Maintainer Services, operating two of the thirteen global internet root servers, and providing registration services and authoritative resolution for the .\nTLDs, which support the majority of global e-commerce.\nAs of December 31, 2024, we had 169.0 million .\nregistrations in the domain name base. The number of domain names registered is largely driven by continued growth in online advertising, e-commerce, and the number of internet users, which is partially driven by greater availability of internet access, as well as marketing activities carried out by us and our registrars. The number of domain name registrations under our management may be negatively impacted by certain factors, including overall economic conditions, competition from ccTLDs, other gTLDs, services that offer alternatives for an online presence, such as social media, and ongoing changes in the internet practices and behaviors of consumers and businesses. Factors such as the evolving practices and preferences of internet users, and how they navigate the internet, as well as the motivation of domain name registrants and how they will manage their investment in domain names, can negatively impact our business and the demand for new domain name registrations and renewals.\n2024 Business Highlights and Trends\nWe recorded revenues of $1,557.4 million in 2024, which represents an increase of 4% as compared to 2023.\nWe recorded operating income of $1,058.2 million during 2024, which represents an increase of 6% as compared to 2023.\nWe finished 2024 with 169.0 million\nregistrations in the domain name base, which represents a 2.1% decrease from December 31, 2023.\nDuring 2024, we processed 37.4 million new domain name registrations for .\ncompared to 39.4 million in 2023.\nrenewal rate for the third quarter of 2024 was 72.2% compared to 73.5% for the same quarter of 2023. Renewal rates are not fully measurable until 45 days after the end of the quarter.\nWe repurchased 6.6 million shares of our common stock for an aggregate cost of $1.21 billion in 2024. As of December 31, 2024, there was $1.02 billion remaining for future share repurchases under the share repurchase program.\nWe generated cash flows from operating activities of $902.6 million in 2024, which represents an increase of 6% as compared to 2023.\nEffective September 1, 2024, we increased the annual registry-level wholesale fee for each new and renewal .\ndomain name registration from $9.59 to $10.26.\nOn November 25, 2024, we renewed the .\nRegistry Agreement with ICANN, pursuant to which we will remain the sole registry operator for the .\nregistry through November 30, 2030. Pursuant to the renewed .\nRegistry Agreement, we cannot increase the price of a .\ndomain name registration during the first two years of the six year contract term.\nCritical Accounting Estimates\nThe discussion and analysis of our financial condition and results of operations are based upon our Consolidated Financial Statements, which have been prepared in accordance with U.S. generally accepted accounting principles. The preparation of these financial statements requires management to make estimates and judgments that affect the reported amounts of assets, liabilities, revenues and expenses, and related disclosures of contingent assets and liabilities. On an ongoing basis, management evaluates those estimates. Management bases its estimates on historical experience and on various assumptions that are believed to be reasonable under the circumstances, the results of which form the basis for making judgments about the carrying values of assets and liabilities that are not readily available from other sources. Actual results may differ from these estimates under different assumptions or conditions.\n\ndomain name registrations in the domain name base\nRevenues increased in 2024 compared to 2023, primarily due to the .\nprice increases, partially offset by a decline in the .\ndomain name base, and the elimination of revenue from the operation of the .\ngTLD, which was transitioned to another service provider in the fourth quarter of 2023.\ndomain names has been primarily driven by continued internet growth and marketing activities carried out by us and our registrars. However, competitive pressure from ccTLDs, other gTLDs, services that offer alternatives for an online presence, such as social media, ongoing changes in internet practices and behaviors of consumers and business, as well as the motivation of existing domain name registrants managing their investment in domain names, such as for resale at increased prices or for revenue generation through website advertising, and global economic conditions, has limited the demand for\ndomain names and may continue to do so in the future. While the core value proposition of a domain name remains strong, challenging economic and regulatory conditions have continued to weaken demand for\ndomain name registrations in China, and some registrars, particularly in the U.S., have shifted their focus to increasing profitability through higher retail pricing and a decrease in marketing activities targeting new customer acquisition. The combination of these factors has negatively impacted our renewal rates and the volume of new\ndomain name registrations, resulting in a decline in our domain name base.\nWe generate revenues in the U.S.; Europe, the Middle East and Africa (“EMEA”); Australia, China, Japan, Singapore, and other Asia Pacific countries (“APAC”); and certain other countries, including Canada and Latin American countries.\nThe following table presents a comparison of the Company’s geographic revenues:\nYear Ended December 31,\n(Dollars in millions)\nU.S\nEMEA\nAPAC\nRevenues in the table above are attributed to the country of domicile and the respective regions in which our registrars are located; however, this may differ from the regions where the registrars operate or where registrants are located. Revenue growth for each region may be impacted by registrars reincorporating, relocating, or from acquisitions or changes in affiliations of resellers. Revenue growth for each region may also be impacted by registrars domiciled in one region, registering domain names in another region. The majority of our revenue growth was generated from registrars based in the U.S. and EMEA, while revenue growth in APAC was limited during 2024 compared to 2023 primarily as a result of a 13% decline in revenues from China due to the lower demand noted above.\nCost of revenues consists primarily of salaries and employee benefits expenses for our personnel who manage the operational systems, depreciation expenses, operational costs associated with the delivery of our services, fees paid to ICANN, customer support and training, costs of facilities and computer equipment used in these activities, telecommunications expense and allocations of indirect costs such as corporate overhead.\nA comparison of cost of revenues is presented below:\nYear Ended December 31,\n\n(Dollars in millions)\nResearch and development\nResearch and development expenses increased in 2024 compared to 2023 primarily due to an increase in compensation and benefit expenses and a combination of several other individually insignificant factors. Compensation and benefits expenses increased by $3.0 million primarily due to annual salary increases.\nSelling, general and administrative\nSelling, general and administrative expenses consist primarily of salaries and other personnel-related expenses for our executive, administrative, legal, finance, information technology, human resources, sales, and marketing personnel, travel and related expenses, trade shows, costs of computer and communications equipment and support services, consulting and professional service fees, costs of marketing programs, costs of facilities, management information systems, support services, and certain tax and license fees, offset by allocations of indirect costs such as facilities and shared services expenses to other cost types.\nA comparison of selling, general and administrative expenses is presented below:\nYear Ended December 31,\n\n(Dollars in millions)\nCost of revenues decreased in 2024 compared to 2023 primarily due to decreases in depreciation expenses and telecommunication expenses, partially offset by an increase in compensation and benefits expenses and a combination of other individually insignificant factors. Depreciation expenses decreased by $7.4 million due to a decrease in capital expenditures in recent periods. Telecommunication expenses decreased by $3.9 million primarily due to savings on renewals of colocation agreements. Compensation and benefits expenses increased by $2.6 million primarily due to annual salary increases.\nResearch and development\nResearch and development expenses consist primarily of costs related to research and development personnel, including salaries and other personnel-related expenses, consulting fees, facilities costs, computer and communications equipment, support services used in our service and technology development, and allocations of indirect costs such as corporate overhead.\nA comparison of research and development expenses is presented below:\nYear Ended December 31,\n\nResearch and development\nSelling, general and administrative\nTotal costs and expenses\nNon-operating income, net\nIncome before income taxes\nOur revenues are primarily derived from registrations for domain names in the\ndomain name registries. We also derive revenues from operating domain name registries and technical systems for several other gTLDs and one ccTLD, all of which are not significant in relation to our consolidated revenues. For domain names registered in the\nregistries, we receive a fee from registrars per annual registration that is determined pursuant to our agreements with ICANN. Individual customers, called registrants, contract directly with registrars or their resellers, and the registrars, who are our direct customers, in turn register the domain names with Verisign. Changes in revenues are driven largely by changes in the number of new domain name registrations and the renewal rate for existing registrations as well as the impact of new and prior price increases, to the\nextent permitted by ICANN and the DOC. New registrations and the renewal rate for existing registrations are impacted by continued growth in online advertising, e-commerce, and the number of internet users, as well as marketing activities carried out by us and our registrars. We also offer promotional incentive-based discount programs to registrars based upon market conditions and the business environment in which the registrars operate.\nIn November 2024, we renewed the .\nRegistry Agreement with ICANN, pursuant to which we will remain the sole registry operator for the .\nregistry through November 30, 2030. Under the .\nRegistry Agreement, we are permitted to increase the price of a\ndomain name registration by up to 7% in each of the final four years of each six-year period. The first such six-year period began on October 26, 2018. We increased the annual registry-level wholesale fee for each new and renewal .\ndomain name registration from $8.97 to $9.59 effective September 1, 2023, and from $9.59 to $10.26 effective September 1, 2024. Under the\nRegistry Agreement, which renewed in June 2023, we are permitted to increase the price of\ndomain name registrations by up to 10% each year during the term of our agreement with ICANN, through June 30, 2029. We increased the annual registry-level wholesale fee for each new and renewal\ndomain name registration from $9.02 to $9.92 effective February 1, 2023, and from $9.92 to $10.91 effective February 1, 2024. All fees paid to us for\nregistrations are in U.S. dollars.\nA comparison of revenues is presented below:\nYear Ended December 31,\n\n(Dollars in millions)\nSelling, general and administrative\nSelling, general and administrative expenses increased in 2024 compared to 2023 primarily due to increases in compensation and benefits expenses, equipment and software expenses and professional services expenses, partially offset by an increase in overhead expenses allocated to other cost types. Compensation and benefits expenses increased by $4.4 million primarily due to annual salary increases. Equipment and software expenses increased by $3.6 million primarily due to increases in expenses related to network security and other software services. Professional services expenses increased by $2.9 million primarily due to an increase in external consulting costs related to various projects. Overhead expenses allocated to other cost types increased by $3.1 million due to an increase in total allocable expenses.\nInterest expense remained consistent during 2024 compared to 2023.\nNon-operating income, net\nYear Ended December 31,\n\nNet cash provided by operating activities increased in 2024 compared to 2023 primarily due to an increase in cash received from customers and a decrease in cash paid for income taxes, partially offset by an increase in cash paid to employees and vendors. Cash received from customers increased primarily due to the impact of the .\nprice increases. Cash paid for income taxes decreased primarily due to comparatively lower federal and foreign income tax payments, partially offset by higher state income tax payments and a higher installment payment for the transition tax on accumulated foreign earnings resulting from the 2017 Tax Cuts and Jobs Act. Cash paid to employees and vendors increased primarily due to increases in operating expenses and the timing of payments.\nCash flows from investing activities\n\n(Dollars in millions)\nThe effective tax rate for each of the periods in the table above differed from the statutory federal rate of 21%, due to state income taxes and U.S. taxes on foreign earnings, net of foreign tax credits, offset by a lower foreign effective tax rate.\nDuring 2023, we recognized $69.3 million of income tax benefits related to a step-up in tax basis of certain non-U.S. intellectual property, recognition of previously unrecognized income tax benefits as the related statutes of limitations lapsed, and a beneficial change in certain state income apportionment rules.\nAs of December 31, 2024, we had deferred tax assets arising from deductible temporary differences, tax losses, and tax credits of $282.2 million, net of valuation allowances, but before the offset of certain deferred tax liabilities. With the exception of a portion of deferred tax assets related to intellectual property, certain state and foreign net operating loss and foreign tax credit carryforwards, we believe it is more likely than not that the tax effects of the deferred tax liabilities, together with future taxable income, will be sufficient to fully recover the remaining deferred tax assets.\nThe income tax expense for 2024 includes the impact of the OECD Pillar 2 minimum tax adopted by applicable tax jurisdictions. While our foreign income taxes increased as a result of the Pillar 2 minimum tax, the overall impact was not material as the additional taxes in these jurisdictions were partly offset by related foreign tax credits in the U.S.\nLiquidity and Capital Resources\nThe following table presents our principal sources of liquidity:\n\nThe changes in cash flows from investing activities primarily relate to purchases, maturities and sales of marketable securities, and purchases of property and equipment.\nWe had net cash inflows from investing activities in 2024, compared to net cash outflows from investing activities in 2023, primarily due to an increase in proceeds from maturities and sales of marketable securities, net of purchases of marketable securities, and a decrease in ",
  "item2_clean": null
}