{
  "source_file": "vrtx-20241231.htm",
  "form_type": "10-K",
  "item1_clean": "In 2016, we entered into a collaboration with Moderna for the identification and development of mRNA therapeutics encoding CFTR for the treatment of CF.\nIn December 2022, the FDA cleared our\nInvestigational New Drug Application (“IND”)\nfor VX-522, an mRNA therapeutic we are developing with Moderna pursuant to this collaboration. The multiple ascending dose portion of the Phase 1/2 clinical trial of VX-522 in people with CF is ongoing. We expect to share data from this clinical trial in the first half of 2025.\nEntrada Therapeutics, Inc.\nIn 2022, we established a collaboration with Entrada focused on enabling efficient intracellular delivery of an oligonucleotide for DM1. This collaboration includes VX-670, an investigational candidate for the treatment of DM1 that is in clinical development.\nWe completed the single ascending dose portion\nof the global Phase 1/2 clinical trial for VX-670 in people with DM1. We are enrolling and dosing the multiple ascending dose portion of the trial, which will evaluate the safety and efficacy of VX-670.\nOut-license Agreements\nWe have entered into various agreements pursuant to which we have out-licensed rights to certain product candidates to third-party collaborators. Pursuant to these out-license arrangements, our collaborators are responsible for all costs related to the continued development of such product candidates and obtain development and commercialization rights to these product candidates. Depending on the terms of the arrangements, our collaborators may be required to make upfront payments, milestone payments upon the achievement of certain research and development objectives and/or pay royalties on future sales, if any, of commercial products licensed under the agreement.\nIn January 2025, we entered into a collaboration agreement with Zai for the development and commercialization of povetacicept in mainland China, Hong Kong SAR, Macau SAR, Taiwan region and Singapore. Under this collaboration, Zai will help advance the povetacicept clinical trials and make the regulatory submissions in the licensed territories. Zai will also be responsible for commercialization activities in the licensed territories, if povetacicept becomes an approved product.\nCystic Fibrosis Foundation\nIn 2004, we entered into a collaboration agreement with the Cystic Fibrosis Foundation, as successor in interest to the Cystic Fibrosis Foundation Therapeutics, Inc., to support research and development activities. Pursuant to the collaboration agreement, as amended, we have agreed to pay tiered royalties ranging from single digits to sub-teens on covered compounds first synthesized and/or tested during a research term on or before February 28, 2014, including ivacaftor, lumacaftor and tezacaftor and royalties ranging from low-single digits to mid-single digits on net sales of certain compounds first synthesized and/or tested between March 1, 2014 and August 31, 2016, including elexacaftor. We do not have any royalty obligations on compounds first synthesized and tested on or after September 1, 2016. For combination products, such as ORKAMBI, SYMDEKO/SYMKEVI, TRIKAFTA/KAFTRIO, and ALYFTREK sales are allocated equally to each of the active pharmaceutical ingredients in the combination product, and royalties are then paid for any royalty-bearing components included in the combination.\nINTELLECTUAL PROPERTY\nPatents and other intellectual property rights such as trademarks, trade secrets, and copyrights are critical to our business. We actively seek protection for our products and proprietary information by means of U.S. and foreign patents, trademarks, and copyrights, as appropriate. In addition, we rely upon trade secret protection and contractual arrangements to protect certain of our proprietary information.\nPatents provide a period of exclusivity that can make it more difficult for competitors to market and use our technology. We own and control patents and pending patent applications that relate to compounds, formulations, synthetic routes, intermediates, devices, treatment of diseases, and other inventions.\nTo protect our intellectual property, we typically apply for patents several years before a product receives marketing approval. Under current law, a patent expires 20 years from its first effective filing date. Since the drug development process may last for many years, there may be a period of time in which we have an issued patent but not marketing approval to sell the drug. To compensate for patent term lost while a product is in clinical trials and undergoing review for marketing approval, we may be able to apply for patent term extensions or supplementary protection certificates (“SPCs”) in some countries. In addition to patent protection, we receive regulatory exclusivity from U.S. and European regulatory agencies for the active pharmaceutical and biological agents and, where applicable, their approved orphan indications for a certain time period. Regulatory exclusivity runs concurrently with patent exclusivity and provides complementary protection for our products.\nFor our approved commercial products, and those in development, we own or hold exclusive and non-exclusive licenses to several hundred patents around the world. In the U.S., once an NDA, or a supplement thereto, is approved we are required to list with the FDA each U.S. patent with claims that cover our product or a method of using the product. The FDA publishes the patents we list in a book referred to as the Orange Book. We have thirteen issued U.S. patents listed in the Orange Book that cover the active pharmaceutical ingredients in KALYDECO, its marketed formulations, and/or its approved indication.\nWe have 22 issued U.S. patents listed in the Orange Book that cover the active pharmaceutical ingredients in ORKAMBI, its marketed formulations, and/or its approved indication. We have 25 issued U.S. patents listed in the Orange Book that cover the active pharmaceutical ingredients in SYMDEKO, its marketed formulation, and/or its approved indication. We have 28 issued U.S. patents listed in the Orange Book that cover the active pharmaceutical ingredients in TRIKAFTA, its marketed formulation, and/or its approved indication. We have 35 issued U.S. patents listed in the Orange Book that cover the active pharmaceutical ingredients in ALYFTREK, its marketed formulation, and/or its approved indication. We expect to have an issued patent listed in the Orange Book that covers the active pharmaceutical ingredient in JOURNAVX, its marketed formulation, and/or its approved indication.\nProducts approved by the FDA under a Biologics Licensing Application (“BLA”), including CASGEVY, receive 12 years of regulatory exclusivity in the U.S. from a product’s approval date. Additionally, we have licenses to dozens of issued U.S. patents that cover CASGEVY, its approved indication, and/or its manufacture. Products approved by the FDA under a BLA are not subject to the Orange Book patent listing requirement.\nThe table below sets forth the year of projected expiration for the basic product patent covering each of our approved products. For products that are combinations of two or more active ingredients, the table lists the projected expiration of the latest expiring patent covering any of the active pharmaceutical ingredients (lumacaftor for ORKAMBI, tezacaftor for SYMDEKO/SYMKEVI, elexacaftor for TRIKAFTA/KAFTRIO and vanzacaftor for ALYFTREK). Unless otherwise noted, patent term extensions, and pediatric exclusivity periods are not reflected in the expiration dates listed in the table below and may extend protection. In some instances, we also own later-expiring patents and applications relating to solid forms, formulations, methods of manufacture, or the use of these drugs in the treatment of particular diseases or conditions. In some cases, however, such patents may not protect our drug from generic competition after the expiration of the basic patent.\nof U.S. Basic Product Patent\nof European Basic Product Patent\nKALYDECO\nORKAMBI\nSYMDEKO/SYMKEVI\nTRIKAFTA/KAFTRIO\nCASGEVY\nALYFTREK\nJOURNAVX\nExpiration date reflects SPCs granted in the five major European markets (France, Germany, Italy, Spain and the U.K.).\nExpiration year reflects the expiration of regulatory exclusivity, which expires later than the basic product patent for this product in this market.\nExpiration year reflects the expiration of regulatory exclusivity in the E.U., which expires later than the basic product patent for this product in this market.\nProduct is approved in Great Britain with regulatory exclusivity until November 2033, which is later than the expiration of the basic product patent.\nIn addition to protecting our marketed products, we actively file patent applications in the U.S. and in foreign countries on inventions relating to our pipeline. For example, we also own and/or control U.S. and foreign patents and/or patent applications relating to the following:\nOther CF potentiators and correctors and many other related compounds, and the use of those compounds for the treatment CF.\nVX-522 and other mRNA-based approaches for treating CF.\nVX-993, VX-973, and other compounds being studied for the potential treatment of pain.\nInaxaplin and other compounds being studied for the potential treatment of AMKD.\nPovetacicept for the treatment of IgAN.\nZimislecel, VX-264, and other cell-based approaches for treating T1D.\nVX-670 for the treatment of DM1.\nVX-407 and other compounds being studied for the potential treatment of ADPKD.\nOther pre-clinical and clinical candidates and the use of such candidates to treat specified diseases.\nThe manufacture, pharmaceutical compositions, related solid forms, formulations, dosing regimens, and methods of use of many of the above compounds.\nWe and CRISPR intend to rely upon a combination of rights, including patent rights, trade secret protection, and regulatory exclusivities to protect CASGEVY. CRISPR has licensed certain rights to a worldwide patent portfolio that covers various aspects of the CRISPR/Cas9 editing platform technology including, for example, compositions of matter and methods of use, including their use in targeting or cutting DNA, from Dr. Emmanuelle Charpentier. In addition to Dr. Charpentier, this patent portfolio has named inventors who assigned their rights to the Regents of the University of California or the University of Vienna, to whom we refer, together with Dr. Charpentier, as the CVC Group. CRISPR has non-exclusive or co-exclusive rights to the patent rights that protect the core CRISPR/Cas9 gene-editing technology. For example, certain third parties, including competitors, have reported obtaining a license to rights in this patent portfolio in certain fields. In addition, patents and patent applications in this patent portfolio are the subject of adversarial proceedings in the U.S., Europe, and other jurisdictions, including proceedings in the U.S. Patent and Trademark Office (the “USPTO”), between the CVC Group and, separately, Sigma-Aldrich, Co. LLC (“Sigma-Aldrich”), ToolGen, Inc. (“ToolGen”), and the Broad Institute, Harvard University, and Massachusetts Institute of Technology (collectively, “Broad”). To date, both the CVC Group and Broad have obtained granted patents that purport to cover aspects of CRISPR/Cas9 editing platform technology. The patents and patent applications within the patent portfolios of the CVC Group, Broad, Sigma-Aldrich and/or ToolGen are, or may in the future be, involved in proceedings similar to interferences or priority disputes in Europe or other foreign jurisdictions. In December 2023, we entered into an agreement with Editas Medicine, Inc. (“Editas”), providing us a non-exclusive sublicense to certain patents relating to CRISPR/Cas9 technology, owned by Broad and Harvard, which are licensed to Editas. In addition to the patent portfolios licensed from Dr. Charpentier, Broad, and Harvard, we own patents and/or patent applications relating ",
  "item7_clean": "ITEM 7.\nMANAGEMENT’S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS\nOVERVIEW\nWe are a global biotechnology company that invests in scientific innovation to create transformative\nfor people with serious diseases, with a focus on specialty markets. We have seven approved medicines: five that treat the underlying cause of cystic fibrosis (“CF”), a life-threatening genetic disease, one that treats severe sickle cell disease (“SCD”) and transfusion dependent beta thalassemia (“TDT”), life shortening inherited blood disorders, and one that treats moderate-to-severe acute pain. Our clinical-stage pipeline includes programs in CF, SCD, beta thalassemia, acute and peripheral neuropathic pain, APOL1-mediated kidney disease, IgA nephropathy and other autoimmune renal diseases and cytopenias, type 1 diabetes, myotonic dystrophy type 1, and autosomal dominant polycystic kidney disease.\nIn December 2024, the U.S. Food and Drug Administration (the “FDA”) approved ALYFTREK (vanzacaftor/tezacaftor/deutivacaftor), our once-daily next-in-class triple combination for the treatment of people with CF 6 years of age and older, and our fifth CF medicine. Collectively, our five medicines, led by TRIKAFTA/KAFTRIO (elexacaftor/tezacaftor/ivacaftor and ivacaftor), are being used to treat nearly three quarters of the approximately 94,000 people with CF in the U.S., Europe, Australia, and Canada. Through approvals of new medicines, label expansions, and expanded reimbursement, we are focused on increasing the number of people with CF who are eligible and able to receive our medicines. In December 2024, the FDA approved the expanded use of TRIKAFTA for the treatment of people with CF 2 years of age and older who have at least one F508del mutation in the cystic fibrosis transmembrane conductance regulator (“CFTR”) gene or a mutation that is responsive to TRIKAFTA. With this approval, 94 additional non-F508del CFTR mutations have been added to the TRIKAFTA label, and approximately 300 additional people with CF in the U.S. are now eligible for TRIKAFTA. In addition, we are evaluating our CF medicines in additional patient populations, including younger children, with the goal of having small molecule treatments for all people who have at least one mutation in their CFTR gene that is responsive to our CFTR modulators. We also are pursuing messenger ribonucleic acid (“mRNA”) and genetic therapies for people with CF who do not make full-length CFTR protein and, as a result, cannot benefit from our current CF medicines.\nCASGEVY (exagamglogene autotemcel), our ex-vivo, non-viral CRISPR/Cas9 gene-edited cell therapy, is approved in the U.S., the European Union (“E.U.”), the United Kingdom (“U.K.”), the Kingdom of Saudi Arabia (“Saudi Arabia”), the Kingdom of Bahrain (“Bahrain”), the United Arab Emirates (the “UAE”), Switzerland and Canada for the treatment of people 12 years of age and older with SCD or TDT. We estimate approximately 60,000 people with severe SCD or TDT are or could become eligible for CASGEVY in the U.S., Canada, Europe, Saudi Arabia, and Bahrain.\nIn January 2025, the FDA approved JOURNAVX, our selective non-opioid NaV1.8 pain signal inhibitor, for the treatment of people with moderate-to-severe acute pain. We have begun our commercial launch of JOURNAVX in the U.S. for eligible adults. In addition, we are enrolling and dosing patients in a Phase 3 clinical trial evaluating suzetrigine for the treatment of diabetic peripheral neuropathy, a common form of peripheral neuropathic pain. In December 2024, we announced Phase 2 clinical trial results showing that treatment with suzetrigine demonstrated a statistically significant and clinically meaningful within-group reduction in pain on the numeric pain rating scale for people with lumbosacral radiculopathy (“LSR”), a form of peripheral neuropathic pain. The clinical trial also included a placebo reference arm, which showed a similar within-group reduction. Suzetrigine was safe and generally well-tolerated in the Phase 2 clinical trial. We hypothesize that a high placebo response in this clinical trial led to a lack of separation of the suzetrigine and placebo response curves. We believe we can innovate in pain clinical trial design to better control the placebo effect, and succeed in pivotal development with suzetrigine. We plan to advance suzetrigine into pivotal development in LSR, pending discussions with regulators on trial design and the regulatory package.\nFinancial Highlights\nIn 2024, our net product revenues increased to $11.0 billion as compared to $9.9 billion in 2023, primarily due to increased TRIKAFTA/KAFTRIO product revenues resulting from strong performance and demand globally, including expansions into younger age groups and label extensions, and higher net realized pricing in the U.S.\nOur total research and development (“R&D”), and selling, general and administrative (“SG&A”) expenses increased to $5.1 billion in 2024 as compared to $4.3 billion in 2023, primarily due to continued investment to support additional therapies in mid-to-late stage development and increased commercial investments to support launches of our therapies globally. In 2024, total acquired in-process research and development expenses (“AIPR&D”) of $4.6 billion included $4.4 billion related to our acquisition of Alpine Immune Sciences, Inc. (“Alpine”). Cost of sales were 14% of our net product revenues in 2024 as compared to 13% in 2023, with the increase primarily due to costs associated with CASGEVY.\nOur total cash, cash equivalents and marketable securities decreased to $11.2 billion as of December 31, 2024 as compared to $13.7 billion as of December 31, 2023 primarily due to cash paid to acquire Alpine and repurchases of our common stock, partially offset by cash flows provided by other operating activities.\nNote: Charts above may not add due to rounding.\nWe expect to grow our CF business by increasing the number of people with CF who are eligible and able to receive our medicines.\nWe have revised estimates for the number of people with CF in the U.S., Europe, Australia, and Canada from approximately 92,000 to approximately 94,000 people. Additionally, we continue to secure formal reimbursement in multiple additional countries that collectively comprise approximately 15,000 additional people with CF. Approximately 10,000 of those additional people with CF are eligible for treatment with CFTR modulators. We previously served many of these markets through named patient sales.\nRecent progress in activities expanding our CF business is included below:\nIn December 2024, the FDA approved ALYFTREK (vanzacaftor/tezacaftor/deutivacaftor), the once-daily next-in-class combination CFTR modulator for the treatment of people with CF 6 years of age and older who have at least one F508del mutation or another mutation in the CFTR gene that is responsive to ALYFTREK, which includes a total of 303 CFTR mutations. Regulatory submissions for ALYFTREK, including in the U.K., the E.U., Canada, Switzerland, Australia, and New Zealand, are currently under review.\nIn December 2024, the FDA approved the expanded use of TRIKAFTA for the treatment of people with CF with 94 additional non-F508del CFTR mutations. TRIKAFTA is now approved in the U.S. for a total of 272 CFTR mutations. We have also submitted regulatory applications to the European Medicines Agency (“EMA”) for TRIKAFTA/KAFTRIO for the treatment of people with CF and rare responsive mutations.\nWe entered into an extended long-term reimbursement agreement with NHS England providing access to KAFTRIO, SYMKEVI and ORKAMBI, and continued access to KALYDECO, for existing and future eligible CF patients in England. We have entered into similar reimbursement agreements in Wales, Northern Ireland and Scotland. These reimbursement agreements include access to any future license extensions of these medicines.\nKAFTRIO is reimbursed in all 27 countries of the E.U.\nSickle Cell Disease and Beta Thalassemia\nCASGEVY is now approved in the U.S., the E.U., the U.K., Saudi Arabia, Bahrain, the UAE, Canada and Switzerland for people 12 years of age and older with SCD or TDT.\nWe have activated more than 50 authorized treatment centers globally, and more than 50 patients have initiated cell collection. We expect significant growth in the number of new patients initiating cell collection throughout 2025.\nWe entered into a reimbursement agreement with NHS England for eligible people with SCD to access CASGEVY, consistent with the reimbursement agreement reached in August 2024 with NHS England for eligible people with TDT to access CASGEVY.\nThe Italian Medicines Agency has approved early access for CASGEVY, on a case-by-case basis, for the treatment of people with TDT and SCD.\nIn January 2025, the FDA approved JOURNAVX for the treatment of moderate-to-severe acute pain in adults. We are working to secure broad stocking agreements for JOURNAVX with national retail pharmacies and regional pharmacy chains. We expect to begin shipping JOURNAVX to pharmacies nationwide by the end of February, with retail availability beginning shortly thereafter.\nWe expect that JOURNAVX will be qualified for the add-on payment under the Non-Opioids Prevent Addiction in the Nation (“NOPAIN”) Act, which provides for a separate payment in the hospital outpatient or surgical center setting for FDA-approved non-opioid treatments for pain.\nWe continue to advance a diversified pipeline of potentially transformative medicines for serious diseases utilizing a range of modalities. Recent and anticipated progress in activities supporting these efforts is included below:\nWe are enrolling and dosing in a Phase 3 clinical trial evaluating ALYFTREK in children with CF 2 to 5 years of age who have at least one F508del mutation or a mutation responsive to triple combination CFTR modulators.\nIn collaboration with Moderna, Inc. (“Moderna”), we are developing VX-522, a CFTR mRNA therapeutic for the treatment of people with CF who do not produce full-length CFTR protein.\nThe multiple ascending dose portion of the Phase 1/2 clinical trial for VX-522 is underway, with data expected in the first half of 2025. In the U.S., the FDA has granted Fast Track designation for VX-522.\nWe continue to advance new oral small molecule combination therapies through preclinical and clinical development with the aim of achieving normal levels of CFTR function. The most advanced of the next generation of CFTR modulators have completed, or are in the process of completing, Phase 1 clinical trials. We also are investigating additional potential treatments for people with CF who do not make full-length CFTR protein and cannot benefit from CFTR modulators.\nSickle Cell Disease and Beta Thalassemia\nWe have completed enrollment of children 5 to 11 years of age with SCD or TDT in two global Phase 3 clinical trials evaluating CASGEVY, and we expect to complete dosing of this age group in 2025.\nWe continue to advance preclinical assets for myeloablative conditioning agents that would have milder side-effects and could be used in connection with CASGEVY, which could broaden the eligible patient population.\nWe are enrolling and dosing patients in a Phase 2 clinical trial evaluating an oral formulation of VX-993, a next-generation selective NaV1.8 pain signal inhibitor, for the treatment of moderate-to-severe acute pain following bunionectomy surgery.\nWe are enrolling and dosing healthy volunteers in a Phase 1 clinical trial evaluating an intravenous formulation of VX-993.\nThe FDA has granted Fast Track Designation to VX-993 in moderate-to-severe acute pain in both the oral and intravenous formulations.\nWe are advancing multiple NaV1.7 inhibitors, including in combination with NaV1.8 inhibitors, through research and earlier stages of development for both acute and peripheral neuropathic pain.\nPeripheral Neuropathic Pain\nA Phase 3 clinical trial evaluating suzetrigine is enrolling and dosing patients with diabetic peripheral neuropathy, a common form of peripheral neuropathic pain. The FDA has granted suzetrigine Breakthrough Therapy designation in diabetic peripheral neuropathy.\nIn December 2024, we announced Phase 2 clinical trial results for suzetrigine as a treatment for LSR, a form of peripheral neuropathic pain. The clinical trial met its primary endpoint, but the suzetrigine arm did not separate from the placebo reference arm. We plan to initiate a Phase 3 clinical trial evaluating suzetrigine in LSR, pending discussions with regulators on the regulatory package and optimized trial design.\nWe are enrolling and dosing patients in a Phase 2 clinical trial evaluating the oral formulation of VX-993, a next generation NaV1.8 pain signal inhibitor, for the treatment of diabetic peripheral neuropathy.\nAPOL1-Mediated Kidney Disease\nInaxaplin is our small molecule for the treatment of APOL1-mediated kidney disease (“AMKD”). We continue to enroll and dose people with AMKD in the Phase 3 portion of the global Phase 2/3 pivotal clinical trial (“AMPLITUDE”). We expect to complete enrollment in the interim analysis cohort in 2025 and apply for potential accelerated approval in the U.S., assuming a positive interim analysis.\nWe initiated a Phase 2 proof-of-concept clinical trial (“AMPLIFIED”) evaluating inaxaplin as a treatment for people with AMKD and diabetes or other co-morbidities who are not currently eligible for the AMPLITUDE Phase 2/3 pivotal trial.\n\nBreakthrough Therapy designation to inaxaplin for APOL1-mediated focal segmental glomerulosclerosis (“FSGS”) and the EMA granted Orphan Drug and PRIME designations to inaxaplin for AMKD.\nIgA Nephropathy and Other B Cell-Mediated Diseases\nIn May 2024, we acquired Alpine, whose lead compound was povetacicept, a dual inhibitor of B cell activating factor (“BAFF”) and a proliferation-inducing ligand (“APRIL”) pathways. We are developing povetacicept as a potentially best-in-class approach to treat immunoglobulin A (“IgA”) nephropathy (“IgAN”), a serious progressive, autoimmune kidney disease that can lead to end-stage renal disease.\nWe are enrolling and dosing patients in the U.S., Europe and Asia in our global pivotal Phase 3 trial evaluating povetacicept in people with IgAN (“RAINIER”). The trial is designed to have a pre-planned interim analysis\nevaluating the change from baseline in urine protein creatinine ratio (“UPCR”) after a certain number of patients reach 36 weeks of treatment. If positive, the interim analysis may serve as the basis for seeking accelerated approval in the U.S. Final analysis will occur at two years of treatment, with a primary endpoint of total eGFR slope through Week 104. We expect to complete enrollment in the interim analysis cohort in 2025 and apply for potential accelerated approval in the U.S., assuming a positive interim analysis.\nWe are evaluating povetacicept as a potential treatment for additional B cell-mediated renal diseases in the RUBY-3 basket trial and hematologic conditions in the RUBY-4 basket trial. Both of these trials are ongoing\n, and we expect data in some of these conditions in 2025.\nZimislecel is an allogeneic stem cell-derived, fully differentiated, insulin-producing islet cell replacement therapy, using standard immunosuppression to protect the implanted cells. We are evaluating zimislecel as a potential treatment for type 1 diabetes (“T1D”) in a sequential, three-part Phase 1/2 clinical trial. We expect to complete enrollment and dosing in the Phase 3 portion of this Phase 1/2/3 clinical trial in 2025 and, assuming positive data, we expect to file for potential approval after patients have completed one year of insulin-free follow-up. In addition, we have initiated a clinical trial evaluating zimislecel in people with T1D who have had a kidney transplant.\nOur second program in T1D evaluates VX-264, which encapsulates zimislecel in a novel device designed to eliminate the need for immunosuppression. The Phase 1/2 clinic",
  "item2_clean": null
}