{
  "source_file": "vistra-20250930.htm",
  "form_type": "10-Q",
  "item1_clean": null,
  "item7_clean": null,
  "item2_clean": "Our industry is subject to uncertainties associated with the impact of rapidly evolving technology on U.S. electricity demand, as well as evolving political, regulatory and economic uncertainties.\nEmerging electricity demand drivers including the rise of large-scale data centers, the electrification of oil field operations, and electric vehicle load building are contributing to a faster-paced load growth in the regions we serve. Our integrated retail electricity and power generation operations allows us to quickly respond to electricity demand changes. We are actively engaged in discussions with various counterparties regarding the potential long-term sale of power from both our operating nuclear and gas facilities as well as facilities in development to support large-scale electricity consumers.\nOur business and these types of transactions are subject to inherent risks and uncertainties, including regulatory reviews, necessary approvals, and potential legislative actions. Such factors could affect the timing and feasibility of finalizing any definitive agreements with large scale electricity consumers.\nSupply Chain Constraints\nOur industry continues to face ongoing supply chain constraints and labor shortages, which have reduced the availability of essential equipment and supplies for constructing new generation facilities, increased lead times for procuring materials and raised labor costs associated with maintaining our natural gas, nuclear, and coal fleet.\nWe are proactively managing these constraints by continuously re-evaluating the business cases and timing of our planned development projects. This has led to the deferral or abandonment of some planned capital expenditures for our solar and battery projects and could impact the economic feasibility of additional projects in our new generation development pipeline. We are engaging with suppliers to secure key materials needed to maintain our existing generation facilities before future planned outages.\nRussia/Ukraine Conflict\nWe are closely monitoring developments in the Russia and Ukraine conflict, specifically sanctions (or potential sanctions) against Russian energy exports and Russian nuclear fuel supply and enrichment activities, and actions by Russia to limit energy deliveries, which may further impact commodity prices in Europe and globally. The Prohibiting Russian Uranium Imports Act (PRUI Act), which was signed into law on August 11, 2024, prohibits importation of Russian uranium; however, the Department of Energy can issue waivers (subject to decreasing annual caps) until December 31, 2027 if there is no alternate source of low-enriched uranium available to keep U.S. nuclear reactors operating or is in the national interest. Additionally, passage of the PRUI Act enabled the allocation of $2.72 billion in federal funding to ramp up production of domestic uranium fuel. On November 15, 2024, the Russian Federation temporarily suspended shipments of uranium to the U.S., stating that they would grant future export licenses on a case-by-case basis.\nOur 2025 and 2026 refueling plans have not been affected by the Russia and Ukraine conflict, nor have we seen any disruption to the delivery of nuclear fuel impacting our refueling schedules. All nuclear fuel requirements for 2025 and 2026 are either in inventory or are onshore. We work with a diverse set of global nuclear fuel cycle suppliers to procure our nuclear fuel years in advance. We have nuclear fuel contracted to support all our refueling needs through 2030 without any additional Russian deliveries. We continue to take affirmative action by building strategic inventory and deploying mitigating strategies in our procurement portfolio to ensure we can secure the nuclear fuel needed to continue to operate our nuclear facilities through potential Russian supply disruption.\nMoss Landing 300 Incident\nOn January 16, 2025, we detected a fire at our Moss Landing 300 MW energy storage facility at the Moss Landing Power Plant site (the Moss Landing Incident) that resulted in ceasing operations at all facilities at the Moss Landing complex until the fire was contained. No injuries occurred due to the fire or the Company's response. The Moss Landing complex includes two other battery facilities and a gas plant. The gas plant returned to service in February 2025, but the two other battery facilities remain offline as we continue to investigate the cause of the fire. We expect the Moss Landing 350 MW battery to return to service in late 2025 or early 2026. There is less certainty about the return to service regarding the Moss Landing 100 MW battery. We will know more after the investigation of the cause of the Moss Landing Incident is complete. As of September 30, 2025, the net book value of the Moss Landing 100 facility was approximately $165 million.\nAs a result of the damage caused by the Moss Landing Incident, during the three months ended March 31, 2025, we wrote-off the net book value of Moss Landing 300 of approximately $400 million to depreciation expense and moved the asset to the Asset Closure segment as we have no plans to return the Moss Landing 300 facility to operations (see Notes 6 and 16 to the Financial Statements for additional information).\nIn July 2025, we entered into an Administrative Settlement Agreement and Order on Consent (ASAOC) with the EPA related to the Moss Landing 300 site. Under the ASAOC, we are required to perform specific battery removal and remediation activities, including battery removal and disposal, building demolition, and air and water monitoring. We estimate the total cost of these activities to be approximately $110 million. We have incurred expenses of approximately $29 million on ASAOC activities through September 30, 2025. As of September 30, 2025, our accrual for estimated future costs for the ASAOC activities is approximately $81 million, of which, $68 million is reflected in other current liabilities and $13 million is reflected in other noncurrent liabilities and deferred credits in the condensed consolidated balance sheets. This estimate assumes the ASAOC activities will be completed by the end of 2026. Aside from battery removal and disposal, our estimate does not reflect costs associated with removal of other hazardous waste that could be identified as the demolition progresses as we are unable to estimate such costs until sampling of waste material is complete. We will account for any adjustments to the accrual as a change in estimate in the period new information becomes available.\nAdditional impacts from the Moss Landing Incident include loss of revenue from the facilities being offline and may include litigation costs and penalties under contracts. We are currently unable to estimate the full impact the Moss Landing Incident will have on us as our estimate will evolve as demolition progresses. See Note 13 to the Financial Statements for additional information.\nWe have filed insurance claims against applicable insurance policies with combined business interruption and property loss limits of $500 million, net of deductibles. See Note 1 to the Financial Statements for additional information. Given uncertainty in timing of remaining insurance recoveries and additional expenses that could be incurred related to the fire, we cannot predict the full impact this event will have on our 2025 financial statements.\nMartin Lake Unit 1 Incident\nOn November 27, 2024, we experienced a fire at Unit 1 of our Martin Lake facility in ERCOT (the Martin Lake Incident), an 815 MW unit. We wrote-off the unit's net book value of less than $1 million to depreciation expense in December 2024. We expect the unit to return to service in late 2025 or early 2026. We estimate total cash capital expenditures required to restore the unit to service will be approximately $355 million, of which approximately $155 million in cash capital expenditures were incurred in the nine months ended September 30, 2025.\nWe expect to recover a majority of the expenditures associated with the Martin Lake Incident through property damage insurance and to receive additional business interruption proceeds. See Note 1 to the Financial Statements for additional information. Given uncertainty in timing of remaining insurance recoveries, we cannot predict the full impacts this event will have on our 2025 financial statements.\nAcquisition of Noncontrolling Interest\nOn September 18, 2024 (the UPA Transaction Date), Vistra Operations and Vistra Vision Holdings I LLC, an indirect subsidiary of Vistra Operations (Vistra Vision Holdings), entered into separate Unit Purchase Agreements (as amended, the UPAs) with each of Nuveen Asset Management, LLC (Nuveen) and Avenue Capital Management II, L.P. (Avenue), pursuant to which Vistra Vision Holdings agreed to purchase each of Nuveen's and Avenue's combined 15% noncontrolling interest in Vistra Vision for approximately $3.2 billion in cash (collectively, the Transaction). The Transaction closed on December 31, 2024 and Vistra Vision Holdings now owns 100% of the equity interests in Vistra Vision. See Notes 2 and 9 to the Financial Statements for additional information.\nPlanned Gas-Fueled Dispatchable Power in ERCOT\nIn May 2024, we announced our intention to add up to 2,000 MW of dispatchable, natural gas-fueled electricity capacity in west, central, and north Texas consisting of the following projects:\nBuilding up to 860 MW of advanced simple-cycle peaking plants to be located in west Texas to support the increasing power needs of the region, including the state's oil and gas industry.\nRepowering the coal-fueled Coleto Creek Power Plant near Goliad, Texas, set to retire in 2027 to comply with EPA rules, as a natural-gas fueled plant with up to 600 MW of capacity.\nCompleting upgrades at existing natural gas-fueled plants that will add more than 500 MW of summer capacity and 100 MW of winter capacity.\nIn July 2024, we filed applications with the PUCT under the Texas Ener"
}