{
  "source_file": "vtr-20241231.htm",
  "form_type": "10-K",
  "item1_clean": "As of December 31, 2024, 28 third-party managers operated all of the 629 properties in our SHOP segment on our behalf. The following table provides information regarding our significant SHOP manager concentration as of and for the year ended December 31, 2024:\nPercentage of Total NOI\nPercentage of Segment Properties\nAtria Senior Living, Inc.\nSunrise Senior Living, LLC\nThe properties in our SHOP segment managed by Atria Senior Living, Inc. (together with its subsidiaries, “Atria”), Sunrise Senior Living, LLC (together with its subsidiaries, “Sunrise”) and Le Group Maurice (together with its subsidiaries, “Le Groupe Maurice”) accounted for a significant portion of our SHOP segment revenues and NOI for the year ended December 31, 2024. See “Management’s Discussion and Analysis of Financial Condition and Results of Operations—Concentration risk” included in Part II, Item 7 of this Annual Report and “Risk Factors—Risks Related to Our Business Operations and Strategy—A significant portion of our revenues and operating income is dependent on a limited number of managers and tenants, including Atria, Sunrise, Le Groupe Maurice, Brookdale, Ardent and Kindred” included in Part I, Item 1A of this Annual Report.\nWe hold a 34% ownership interest in Atria, which entitles us to customary minority rights and protections, as well as the right to appoint two members to the Atria Board of Directors. See Note 7 – Investments in Unconsolidated Entities of the Notes to Consolidated Financial Statements included in Part II, Item 8 of this Annual Report for a further discussion of our ownership interest.\nOutpatient Medical and Research Portfolio (OM&R)\nIn our OM&R segment, we primarily acquire, own, develop, lease and manage outpatient medical buildings and research centers.\nOur outpatient medical buildings, which are predominantly located on or contiguous to a health system campus, are generally multi-tenant properties leased to health systems and several unrelated medical practices, although in many cases they may be associated with a large single specialty or multi-specialty group, including neighboring health systems. Tenants typically require customized space devoted to patient examination and treatment, diagnostic imaging, outpatient surgery and other outpatient services. Outpatient medical buildings typically require enhanced plumbing, electrical and mechanical systems to accommodate the needs of healthcare providers such as sinks in every room, brighter lights and specialized medical equipment.\nOur research centers generally contain laboratory and office space that is leased primarily to universities, academic medical centers, technology, biotechnology, medical device and pharmaceutical companies and other organizations involved in the research industry. While these properties may have certain characteristics similar to commercial office buildings, they generally contain more advanced electrical, mechanical, heating, ventilating and air conditioning systems. The facilities generally have specialty equipment including emergency generators, fume hoods, lab bench tops and related amenities. In many instances, research center tenants make significant investments to improve their leased space, in addition to landlord improvements, to accommodate biology, chemistry or medical device research initiatives. Our research centers are often located on or contiguous to university and academic medical campuses.\nWe lease these properties to tenants under varying lease types that obligate the tenants to pay rent, and may require the tenant to pay their proportionate share of some or all property-related expenses, including utilities, real estate taxes, insurance,\nrepairs and maintenance, cleaning, roads and grounds expense and other expenses. The leases are typically for a fixed term, and may be subject to renewal under certain conditions.\nAlthough we do not participate directly in the financial performance of our tenants’ operations, we are exposed to the credit risk of our tenants in our OM&R segment. See “Risk Factors—Risks Related to Our Business Operations and Strategy—If our managers’, tenants’ or borrowers’ financial condition or business prospects deteriorate, our business, financial condition and results of operations could be adversely affected” included in Part I, Item 1A of this Annual Report.\nThrough our Lillibridge subsidiary and our 50% ownership interest in PMB Real Estate Services LLC (“PMBRES”), a property management platform, we provide outpatient medical building and research center management, leasing, marketing, facility development and advisory services to highly rated hospitals and health systems and universities, academic medical centers, biotech and other similar companies throughout the United States.\nTriple-Net Leased Properties (NNN)\nIn our NNN segment, we invest in and own senior housing communities, skilled nursing facilities (“SNFs”), long-term acute care facilities (“LTACs”), freestanding inpatient rehabilitation facilities (“IRFs”) and other healthcare facilities.\nThe senior housing communities in our NNN segment may include independent living communities, assisted living communities, memory care communities and continuing care retirement communities, which property types are described in more detail above in “—Senior Housing Operating Portfolio (SHOP).”\nSNFs provide rehabilitative, restorative, skilled nursing and medical treatment for patients and residents who do not require the high technology, care-intensive, high-cost setting of an acute care or rehabilitation hospital. Treatment programs include physical, occupational, speech, respiratory and other therapies, including sub-acute clinical protocols such as wound care and intravenous drug treatment.\nLTACs typically serve medically complex, chronically ill patients who require a high 1evel of monitoring and specialized care, but whose conditions do not necessitate the continued services of an intensive care unit and have a Medicare average length of stay of greater than 25 days. The tenants of these LTACs have the capability to treat patients who suffer from multiple systemic failures or conditions such as neurological disorders, head injuries, brain stem and spinal cord trauma, cerebral vascular accidents, chemical brain injuries, central nervous system disorders, developmental anomalies and cardiopulmonary disorders. Chronic patients often depend on technology for continued life support, such as mechanical ventilators, total parenteral nutrition, respiration or cardiac monitors and dialysis machines, and, due to their severe medical conditions, generally are not clinically appropriate for admission to a skilled nursing facility or rehabilitation hospital.\nIRFs are devoted to the rehabilitation of patients with various neurological, musculoskeletal, orthopedic and other medical conditions following stabilization of their acute medical issues. Other healthcare facilities provide medical and surgical services, including inpatient care, intensive care, cardiac care, diagnostic services and emergency services. These other healthcare facilities may also provide outpatient services such as outpatient surgery, laboratory, radiology, respiratory therapy, cardiology and physical therapy.\nCharges for services provided at SNFs, LTACs, IRFs and other healthcare facilities are generally paid from a combination of government reimbursement, commercial insurance and other private sources.\nWe lease these properties to tenants under triple-net or absolute-net leases that obligate the tenants to pay all property-related expenses, including maintenance, utilities, repairs, taxes, insurance and capital expenditures. The leases in our NNN segment typically contain annual or periodic rent escalators that may be contingent upon the satisfaction of specified facility revenue parameters or based on increases in the Consumer Price Index (“CPI”), with caps, floors or collars. These agreements may include provisions for termination under specific circumstances, including in the event of a monetary or non-monetary default by the tenant or in the event of a failure of the tenant to meet certain financial or operational covenants. The agreements typically include broad indemnities in our favor from the tenant for liabilities arising out of the tenant’s operations. Although we do not participate directly in the financial performance of the tenants’ operations, we are exposed to the credit risk of our tenants in our NNN segment. See “Risk Factors—Risks Related to Our Business Operations and Strategy—If our managers’, tenants’ or borrowers’ financial condition or business prospects deteriorate, our business, financial condition and results of operations could be adversely affected” included in Part I, Item 1A of this Annual Report.\nThe following table provides information regarding our significant triple-net leased tenant concentration as of and for the year ended December 31, 2024:\nPercentage of Total NOI\nPercentage of Segment Properties\nBrookdale Senior Living, Inc.\nKindred Healthcare, LLC\nArdent Health Partners, LLC\n______________________________\nExcludes nine properties managed by Brookdale Senior Living, Inc. pursuant to long-term management agreements and included in the SHOP segment.\nWe also lease 19 outpatient medical buildings to Ardent, which are included in the OM&R segment.\nThe properties we lease to Brookdale Senior Living, Inc. (together with its subsidiaries, “Brookdale”), Ardent Health Partners, LLC (together with its subsidiaries, “Ardent”) and Kindred Healthcare, LLC (together with its subsidiaries, “Kindred”) accounted for a significant portion of our NNN segment revenues and NOI for the year ended December 31, 2024. See “Risk Factors—Risks Related to Our Business Operations and Strategy—A significant portion of our revenues and operating income is dependent on a limited number of managers and tenants, including Atria, Sunrise, Le Groupe Maurice, Brookdale, Ardent and Kindred” included in Part I, Item 1A of this Annual Report, “Management’s Discussion and Analysis of Financial Condition and Results of Operations— “Concentration Risk,” included in Part II, Item 7 of this Annual Report and “Note 3 – Concentration of Credit Risk” included in Part II, Item 8 of this Annual Report.\nAs of December 31, 2024, we held warrants for 11.1 million shares of Brookdale common stock, which are exercisable at any time prior to December 31, 2025 and have an exercise price of $3.00 per share (the “Brookdale Warrants”). In addition, we hold warrants exercisable at any time prior to September 13, 2034 for 9.9% of the common equity of a parent company of Kindred exercisable at the pre-transaction value of such common equity (the “Scion Warrants”). See “Note 9 – Other Assets” of the Notes to Consolidated Financial Statements included in Part II, Item 8 of this Annual Report.\nAs of December 31, 2024, we held an approximately 6.7% ownership interest in Ardent. See “Note 7 – Investments in Unconsolidated Entities” of the Notes to Consolidated Financial Statements included in Part II, Item 8 of this Annual Report for a further discussion of our ownership interest.\nNon-segment assets consist primarily of corporate assets, including cash and cash equivalents, restricted cash, loans receivable and investments and accounts receivable. Our loans receivable and investments generally provide us with interest income and fees and are often secured by mortgage liens or leasehold mortgages on the underlying properties and corporate or personal guarantees by affiliates of the borrowing entity. In some cases, the loans are secured by a pledge of ownership interests in the entity or entities that own the related properties or may take the form of mezzanine loans, which are subordinated to senior secured loans held by other investors that encumber the same real estate. Non-segment assets also include other assets, such as our Brookdale and Kindred Warrants. See “Note 6 ",
  "item7_clean": "SHOP\nOM&R\nNNN\nInterest and other income\nDepreciation and amortization\nGeneral, administrative and professional fees\n(Loss) gain on extinguishment of debt, net\nTransaction, transition and restructuring costs\nReversal of allowance on loans receivable and investments, net\nGain on foreclosure of real estate\nShareholder relations matters\nOther (expense) income\nLoss before unconsolidated entities, real estate dispositions, income taxes and noncontrolling interests\nIncome from unconsolidated entities\nGain on real estate dispositions\nNet income attributable to noncontrolling interests\nNet income (loss) attributable to common stockholders\n______________________________\nThe following table summarizes results of operations in our SHOP segment as of December 31, 2024 (dollars in thousands):\nIncrease (Decrease) to NOI\nNOI—SHOP:\nResident fees and services\nLess: Property-level operating expenses\nNOI\nAverage Monthly Revenue Per Occupied Room for\nResident fees and services include all amounts earned from residents at our senior housing communities, such as rental fees related to resident leases, extended healthcare fees and other ancillary service income. Property-level operating expenses related to our SHOP segment include labor, food, utilities, real estate taxes, insurance, repairs and maintenance, marketing, management fees, supplies and other costs of operating the properties. For senior housing communities in our SHOP segment, occupancy generally reflects average operator-reported unit occupancy for the reporting period. Average monthly revenue per occupied room reflects average resident fees and services per operator-reported occupied unit for the reporting period.\nThe increase in our SHOP segment NOI in 2024 over the prior year was driven by positive trends in revenue driven by gains in occupancy and revenue per occupied room, the addition of communities acquired in our SHOP segment and conversions of senior housing communities from our NNN segment to our SHOP segment. The revenue increase is partially offset by higher operating expenses in 2024, driven by an increase in the number of communities in our SHOP segment and an increase in occupancy.\nThe following table compares results of operations for our 472 same-store SHOP communities (dollars in thousands). See “Non-GAAP Financial Measures\nNOI” included elsewhere in this Annual Report for additional disclosure regarding same-store NOI for each of our reportable business segments.\nIncrease (Decrease) to NOI\nSame-Store NOI—SHOP:\nResident fees and services\nLess: Property-level operating expenses\nNOI\nAverage Monthly Revenue Per Occupied Room for\nSame-store communities\nThe increase in our same-store SHOP segment NOI in 2024 was primarily driven by positive trends in occupancy and revenue per occupied room in 2024, partially offset by higher operating expenses driven by an increase in occupancy.\nThe following table summarizes results of operations in our OM&R segment as of December 31, 2024 (dollars in thousands). For properties in our OM&R segment, occupancy generally reflects occupied square footage divided by net rentable square footage as of the end of the reporting period.\nIncrease (Decrease) to NOI\nNOI—OM&R:\nThird-party capital management revenues\nProperty-level operating expenses\nNOI\nAnnualized Average Rent Per Occupied Square Foot for the Years Ended December 31,\nThe increase in our OM&R segment NOI in 2024 over the prior year was primarily due to properties acquired in May 2023, favorable leasing activity, improved parking revenues and a development project placed in service, partially offset by dispositions.\nThe following table compares results of operations for our 337 same-store OM&R (dollars in thousands):\nIncrease (Decrease) to NOI\nSame-Store NOI—OM&R:\nLess: Property-level operating expenses\nNOI\nAnnualized Average Rent Per Occupied Square Foot for the Years Ended December 31,\nThe increase in our same-store OM&R segment NOI in 2024 over the prior year is primarily due to favorable leasing activity. high tenant retention at higher rates and improved parking revenues.\nThe following table summarizes results of operations in our 301 NNN segment as of December 31, 2024 (dollars in thousands):\n\nSee “Results of Operations” for discussions regarding both NOI and same-store NOI. We define same-store as properties owned, consolidated and operational for the full period in both comparison periods and that are not otherwise excluded; provided, however, that we may include selected properties that otherwise meet the same-store criteria if they are included in substantially all of, but not a full, period for one or both of the comparison periods, and in our judgment such inclusion provides a more meaningful presentation of our segment performance.\nNewly acquired development properties and recently developed or redeveloped properties in our SHOP reportable business segment will be included in same-store once they are stabilized for the full period in both periods presented. These properties are considered stabilized upon the earlier of (a) the achievement of 80% sustained occupancy or (b) 24 months from the date of acquisition or substantial completion of work. Recently developed or redeveloped properties in our OM&R and NNN reportable business segments will be included in same-store once substantial completion of work has occurred for the full period in both periods presented. Our SHOP and NNN that have undergone operator or business model transitions will be included in same-store once operating under consistent operating structures for the full period in both periods presented.\nProperties are excluded from same-store if they are: (i) sold, classified as held for sale or properties whose operations were classified as discontinued operations in accordance with GAAP; (ii) impacted by significant disruptive events such as flood or fire; (iii) for SHOP, those properties that are currently undergoing a significant disruptive redevelopment; (iv) for OM&R and NNN reportable business segments, those properties for which management has an intention to institute, or has instituted, a redevelopment plan because the properties may require major property-level expenditures to maximize value, increase NOI, or maintain a market-competitive position and/or achieve property stabilization, most commonly as the result of an expected or actual material change in occupancy or NOI; or (v) for SHOP and NNN reportable business segments, those properties that are scheduled to undergo operator or business model transitions, or have transitioned operators or business models after the start of the prior comparison period.\nTo eliminate the impact of exchange rate movements, certain of our performance-based disclosures, including same-store NOI for SHOP and NNN, assume constant exchange rates across comparable periods, using the following methodology: the current period’s results are shown in actual reported USD, while prior comparison period’s results are adjusted and converted to USD based on the average monthly exchange rate for the current period.\nAsset/Liability Management\nAsset/liability management, a key element of enterprise risk management, is designed to support the achievement of our business strategy, while ensuring that we maintain appropriate and tolerable levels of market risk (primarily interest rate risk and foreign currency exchange risk) and credit risk. Effective management of these risks is a contributing factor to the absolute levels and variability of our FFO and net worth. The following discussion addresses our integrated management of assets and liabilities, including the use of derivative financial instruments.\nWe are primarily exposed to market risk related to changes in interest rates with respect to borrowings under our unsecured revolving credit facility, our unsecured term loans and our commercial paper program, certain of our mortgage loans that are variable rate obligations, mortgage loans receivable that bear interest at variable rates and available for sale securities. These market risks result primarily from changes in benchmark interest rates. To manage these risks, we continuously monitor our level of variable rate debt with respect to total debt and other factors, including our assessment of current and future economic conditions. See “Risk Factors—We are exposed to increases in interest rates, which could reduce our profitability and adversely impact our ability to refinance existing debt, sell assets or engage in acquisition, investment, development and redevelopment activity, and our decision to hedge against interest rate risk might not be effective” included in Part I, Item 1A of this Annual Report.\nThe table below sets forth certain information with respect to our debt, excluding premiums and discounts (dollars in thousands):\nSenior notes/Exchangeable senior notes\nUnsecured term loans\nMortgage loans and other\nUnsecured revolving credit facility\nUnsecured term loans\nCommercial paper notes\nMortgage loans and other\nSubtotal variable rate\nPercentage of total debt:\nSenior notes/Exchangeable senior notes\nUnsecured term loans\nMortgage loans and other\nUnsecured revolving credit facility\nUnsecured term loans\nCommercial paper notes\nMortgage loans and other\nWeighted average interest rate at end of period:\nSenior notes/Exchangeable senior notes\nUnsecured term loans\nMortgage loans and other\nUnsecured revolving credit facility\nUnsecured term loans\nCommercial paper notes\nMortgage loans and other\nThe variable rate debt as of December 31, 2024 in the table above reflects, in part, the effect of $141.3 million notional amount of interest rate swaps with maturities in March 2027, that effectively convert fixed rate debt to variable rate debt. In addition, the fixed rate debt as of December 31, 2024 in the table above reflects, in part, the effect of $526.5 million and C$635.9 million notional amount of interest rate swaps with maturities ranging from February 2025 to April 2031, in each case, that effectively convert variable rate debt to fixed rate debt. See “Note 10 – Senior Notes Payable and Other Debt” of the Notes to Consolidated Financial Statements included in Part II, Item 8 of this Annual Report.\nThe decrease in our outstanding variable rate debt as of December 31, 2024 compared to December 31, 2023 is primarily attributable to the repayment of a C$500.0 million ($369.4 million) unsecured term loan.\nThe increase in our outstanding fixed rate debt from December 31, 2024 compared to December 31, 2023 was primarily attributable to net issuances of senior notes.\nAssuming a 100 basis point increase in the weighted average interest rate related to our consolidated variable rate debt and assuming no change in our consolidated variable rate debt outstanding as of December 31, 2024 of $0.8 billion, interest expense on an annualized basis would increase by approximately $7.9 million, or less than $0.02 per diluted common share.\nAs of December 31, 2024 and 2023, our joint venture partners’ aggregate share of total consolidated debt was $310.9 million and $297.5 million, respectively, with respect to certain properties we owned through consolidated joint ventures.\nTotal consolidated debt does not include our portion of unconsolidated debt related to investments in unconsolidated real estate entities, which was $676.8 million and $575.3 million as of December 31, 2024 and 2023, respectively.\nThe fair value of our fixed rate debt is based on current market interest rates at which we could obtain similar borrowings. Increases in market interest rates typically result in a decrease in the fair value of fixed rate debt while decreases in market interest rates typically result in an increase in the fair value of fixed rate date. While changes in market interest rates affect the fair value of our fixed rate debt, these changes do not affect the interest expense associated with our fixed rate debt. Therefore, interest rate risk does not have a significant impact on our fixed rate debt obligations until their maturity or earlier prepayment and refinancing. If interest rates have risen at the time we seek to refinance our fixed rate debt, whether at maturity or otherwise, our future earnings and cash flows could be adversely affected by additional borrowing costs. Conversely, lower interest rates at the time of refinancing may reduce our overall borrowing costs.\nTo highlight the sensitivity of our fixed rate debt to changes in interest rates, the following summary shows the effects of a hypothetical instantaneous change of 100 basis points in interest rates (dollars in thousands):\nFair value reflecting change in interest rates:\nAs of December 31, 2024 and 2023, the fair value of our secured and non-mortgage loans receivable, based on our estimates of currently prevailing rates for comparable loans, was $173.9 million and $53.1 million, respectively. See “Note 6 – Loans Receivable and Investments” and “Note 11 – Fair Values of Financial Instruments” of the Notes to Consolidated Financial Statements included in Part II, Item 8 of this Annual Report.\nAs a result of our Canadian and United Kingdom operations, we are subject to fluctuations in certain foreign currency exchange rates that may, from time to time, affect our financial condition and operating performance. Based solely on our results for the year ended December 31, 2024 (including the impact of existing hedging arrangements), if the value of the U.S. dollar relative to the British pound and Canadian dollar were to increase or decrease by one standard deviation compared to the average exchange rate during the year, our Net Income and Normalized FFO for the year ended December 31, 2024 would decrease or increase by less than $0.01 per diluted common share. We will continue to mitigate these risks through a layered approach to hedging and continual assessment of our foreign operational capital structure. Nevertheless, we cannot assure you that any such fluctuations will not have an effect on our earnings.\nWe use concentration ratios to identify, understand and evaluate the potential impact of economic downturns and other adverse events that may affect our asset types, geographic locations, business models, and managers, tenants and borrowers. We evaluate concentration risk in terms of investment mix and operations mix. Investment mix measures the percentage of our investments that is concentrated in a specific asset type or that is operated or managed by a particular manager, tenant or borrower. Operations mix measures the percentage of our operating results that is attributed to a particular manager, tenant, or borrower, geographic location or business model.\nThe following tables reflect our concentration risk as of the dates and for the periods presented:\n\n______________________________\nRepresents percentage of total revenues which include third-party capital management revenues, income from loans and investments and interest and other income.\nResults exclude nine senior housing communities which are included in our SHOP segment.\nResults exclude 19 outpatient medical buildings included in “All others.”\nSee “Non-GAAP Financial Measures” included elsewhere in this Annual Report for additional disclosure and reconciliations of net income attributable to common stockholders, as computed in accordance with GAAP, to NOI.\nWe derive a significant portion of our revenues by leasing assets under long-term triple-net leases in which the rental rate is generally fixed with escalators, subject to certain limitations. Some of our triple-net lease escalators are contingent upon the satisfaction of specified facility revenue parameters or based on increases in the Consumer Price Index (“CPI”), with caps, floors or collars. We also earn revenues directly from individual residents in our senior housing communities that are managed by operators, such as Atria, Sunrise and Le Groupe Maurice, and tenants in our outpatient medical buildi",
  "item2_clean": null
}