{
  "source_file": "vtrs-20250930.htm",
  "form_type": "10-Q",
  "item1_clean": null,
  "item7_clean": null,
  "item2_clean": "ITEM 2.\nMANAGEMENT’S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS\nThe following discussion and analysis addresses material changes in the financial condition and results of operations of Viatris Inc. and subsidiaries for the periods presented. Unless context requires otherwise, the “Company,” “Viatris,” “our” or “we” refer to Viatris Inc. and its subsidiaries.\nthe goals or outlooks with respect to the Company’s strategic initiatives and priorities, including but not limited to divestitures, acquisitions, strategic alliances, collaborations, or other potential transactions;\nthe benefits and synergies of such divestitures, acquisitions, strategic alliances, collaborations, or other transactions, or restructuring programs; future opportunities for the Company and its products; and any other statements regarding the Company’s future operations, financial or operating results, capital allocation, dividend policy and payments, share repurchases, debt ratio and covenants, anticipated business levels, future earnings, planned activities, anticipated growth, market opportunities, strategies, competitions, commitments, confidence in future results, efforts to create, enhance or otherwise unlock value, and other expectations and targets for future periods. Forward-looking statements may often be identified by the use of words such as “will”, “may”, “could”, “should”, “would”, “project”, “believe”, “anticipate”, “expect”, “plan”, “estimate”, “forecast”, “potential”, “pipeline”, “intend”, “continue”, “target”, “seek” and variations of these words or comparable words. Because forward-looking statements inherently involve risks and uncertainties, actual future results may differ materially from those expressed or implied by such forward-looking statements. Factors that could cause or contribute to such differences include, but are not limited to:\nthe possibility that the Company may not realize the intended benefits of, or achieve the intended goals or outlooks with respect to, its strategic initiatives and priorities (including divestitures, acquisitions, strategic alliances, collaborations, or other potential transactions) or accelerate its growth by building on the strength of its base business with an expanding portfolio of innovative, best-in-class, patent-protected assets;\nthe possibility that the Company may be unable to achieve intended or expected benefits, goals, outlooks, synergies, growth opportunities and operating efficiencies in connection with divestitures, acquisitions, strategic alliances, collaborations, or other transactions, or restructuring programs, within the expected timeframes or at all;\nthe ongoing risks and uncertainties associated with our recent divestitures;\ngoodwill or impairment charges or other losses;\nthe Company’s failure to achieve expected or targeted future financial and operating performance and results;\nthe potential impact of natural or man-made disasters, public health outbreaks, epidemics, pandemics or social disruption in regions where we or our partners or suppliers operate;\nactions and decisions of healthcare and pharmaceutical regulators;\nchanges in relevant laws, regulations and policies and/or the application or implementation thereof, including but not limited to tax, healthcare and pharmaceutical laws, regulations and policies globally;\nthe ability to attract, motivate and retain key personnel;\nthe Company’s liquidity, capital resources and ability to obtain financing;\nany regulatory, legal or other impediments to the Company’s ability to bring new products to market, including but not limited to “at-risk launches”;\nproducts in development that receive regulatory approval may not achieve expected levels of market acceptance, efficacy or safety;\nlonger review, response and approval times as a result of evolving regulatory priorities and reductions in personnel at health agencies;\nsuccess of clinical trials and the Company’s or its partners’ ability to execute on new product opportunities and develop, manufacture and commercialize products;\nany changes in or difficulties with the Company’s manufacturing facilities, including with respect to inspections, remediation and restructuring activities, supply chain or inventory or the ability to meet anticipated demand;\nthe scope, timing and outcome of any ongoing legal proceedings, including government inquiries or investigations, and the impact of any such proceedings on the Company;\nany significant breach of data security or data privacy or disruptions to our IT systems;\nrisks associated with having significant operations globally;\nthe ability to protect intellectual property and preserve intellectual property rights;\nchanges in third-party relationships;\nthe effect of any changes in the Company’s or its partners’ customer and supplier relationships and customer purchasing patterns, including customer loss and business disruption being greater than expected following an adverse regulatory action, acquisition or divestiture;\nthe impacts of competition, including decreases in sales or revenues as a result of the loss of market exclusivity for certain products;\nchanges in the economic and financial conditions of the Company or its partners;\nuncertainties regarding future demand, pricing and reimbursement for the Company’s products;\nuncertainties and matters beyond the control of management, including but not limited to general political and economic conditions, potential for adverse impacts from future tariffs and trade restrictions, inflation rates and global exchange rates; and\ninherent uncertainties involved in the estimates and judgments used in the preparation of financial statements, and the providing of estimates of financial measures, in accordance with U.S. GAAP and related standards or on an adjusted basis.\nViatris is a global healthcare company whose breadth and scale we believe make it uniquely positioned to address healthcare needs globally. With a mission to empower people worldwide to live healthier at every stage of life, Viatris supplies high-quality medicines to approximately 1 billion patients around the world each year. The Company has a global footprint, an extensive portfolio of medicines that is well-diversified across therapeutic areas, a one-of-a-kind global supply chain designed to reach more people when and where they need them, and the scientific expertise to address some of the world's most enduring health challenges.\nViatris’ executive management team is focused on ensuring that the Company is optimally structured and efficiently resourced to deliver sustainable value to patients, shareholders, customers and other key stakeholders. The Company operates in more than 165 countries and territories with more than 30,000 employees. The Company has 26 manufacturing and packaging sites worldwide, more than 1,400 approved molecules, and industry leading commercial, R&D, regulatory, manufacturing, legal and medical expertise. Viatris’ portfolio consists of generics (including complex products), globally recognized iconic brands, and an expanding portfolio of innovative medicines. Viatris is headquartered in the U.S., with global centers in Pittsburgh, Pennsylvania, Shanghai, China and Hyderabad, India.\nViatris has four reportable segments: Developed Markets, Greater China, JANZ, and Emerging Markets. The Company reports segment information on the basis of markets and geography, which reflects its focus on bringing its large and diversified portfolio of branded and generic products, including complex products, to people in markets everywhere. Our Developed Markets segment comprises our operations primarily in North America and Europe. Our Greater China segment includes our operations in mainland China, Taiwan and Hong Kong. Our JANZ segment consists of our operations in Japan, Australia and New Zealand. Our Emerging Markets segment encompasses our presence in more than 125 countries with developing markets and emerging economies including in Asia, Africa, Eastern Europe, Latin America and the Middle East as well as the Company’s ARV franchise.\nCertain Market and Industry Factors\nThe global pharmaceutical industry is a highly competitive and highly regulated industry. As a result, we face a number of industry-specific factors and challenges, which can significantly impact our results. The following discussion highlights some of these key factors and market conditions.\nThe process of obtaining regulatory approval to manufacture and market new branded and generic pharmaceutical products is rigorous, time consuming, costly, and inherently unpredictable. Complex generic products are often more difficult, costly and time-consuming to receive regulatory approval and bring to market compared with commodity generic pharmaceutical products. Any delay in regulatory approval could impact the commercial or financial success of a product. Regulatory approval, if and when obtained, may be limited in scope. Even if regulatory approvals for new products are obtained, the success of those products is dependent upon market acceptance.\nGeneric products, particularly in the U.S., generally contribute most significantly to revenues and gross margins at the time of their launch, and even more so in periods of market exclusivity, or in periods of limited generic competition. As such, the timing of new product introductions can have a significant impact on the Company’s financial results. The entrance into the market of additional competition generally has a negative impact on the volume and pricing of the affected products. Additionally, pricing is often affected by factors outside of the Company’s control. Conversely, generic products generally experience less volatility over a longer period of time in Europe as compared to the U.S., primarily due to the role of government oversight of healthcare systems in the region. In addition, U.S. governmental agencies provide funding for certain products in our Emergi"
}