{
  "source_file": "vz-20250930.htm",
  "form_type": "10-Q",
  "item1_clean": null,
  "item7_clean": null,
  "item2_clean": "Revenue by Segment for the Nine Months Ended September 30, 2025 and 2024\nNote: Excludes eliminations.\nVerizon Consumer Group\nOur Consumer segment provides consumer-focused wireless and wireline communications services and products. Our wireless services are provided across one of the most extensive wireless networks in the United States (U.S.) under the Verizon family of brands and through wholesale and other arrangements. We also provide fixed wireless access (FWA) broadband through our 5G or 4G LTE networks as an alternative to traditional landline internet access. Our wireline services are provided in nine states in the Mid-Atlantic and Northeastern U.S., as well as Washington D.C., over our 100% fiber-optic network through our Verizon Fios product portfolio and over a traditional copper-based network to customers who are not served by Fios.\nCustomers can obtain our wireless services on a postpaid or prepaid basis. Our postpaid service is generally billed one month in advance for a monthly access charge in return for access to and usage of network services. Our prepaid service is offered only to Consumer customers and enables individuals to obtain wireless services without credit verification by paying for all services in advance. The Consumer segment also offers several categories of wireless equipment to customers, including a variety of smartphones and other handsets, wireless-enabled internet devices, such as tablets, and other wireless-enabled connected devices, such as smart watches.\nIn addition to wireless services and equipment for retail customers, the Consumer segment sells residential fixed connectivity solutions, including internet, video and voice services, and wireless network access to resellers on a wholesale basis.\nThe Consumer segment's operating revenues for the three and nine months ended September 30, 2025 totaled $26.1 billion and $78.4 billion, respectively, representing an increase of 2.9% and 4.0%, respectively, compared to the similar periods in 2024. See \"Segment Results of Operations\" for additional information regarding our Consumer segment’s operating performance and selected operating statistics.\nVerizon Business Group\nOur Business segment provides wireless and wireline communications services and products, including FWA broadband, data, video and advanced communication services, corporate networking solutions, security and managed network services, local and long distance voice services and network access to deliver various Internet of Things (IoT) services and products. We provide these products and services to businesses, public sector customers and wireless and wireline carriers across the U.S. and a subset of these products and services to customers around the world.\nThe Business segment's operating revenues for the three and nine months ended September 30, 2025 totaled $7.1 billion and $21.7 billion, respectively, representing a decrease of 2.8% and 1.5%, respectively, compared to the similar periods in 2024. See \"Segment Results of Operations\" for additional information regarding our Business segment’s operating performance and selected operating statistics.\nCorporate and other primarily includes device insurance programs, investments in unconsolidated businesses and development stage businesses that support our strategic initiatives, as well as unallocated corporate expenses, certain pension and other employee benefit related costs and interest and financing expenses. Corporate and other also includes the historical results of divested businesses and other adjustments and gains and losses that are not allocated or used in assessing segment performance due to their nature. Although such transactions are excluded from the business segment results, they are included in reported consolidated earnings. Gains and losses from these transactions that are not individually significant are included in\nsegment results and therefore are included in the chief operating decision maker’s (CODM) assessment of segment performance. See \"Consolidated Results of Operations\" for additional information regarding Corporate and other results.\nCapital Expenditures and Investments\nWe continue to invest in our wireless networks, high-speed fiber and other advanced technologies to position ourselves at the center of growth trends for the future. During the nine months ended September 30, 2025, these investments included $12.3 billion for capital expenditures. See \"Cash Flows Used in Investing Activities\" for additional information. Capital expenditures for\nare expected to be within or below the range of $17.5 billion to $18.5 billion.\nGlobal Networks and Technology\nWe consider the reliability, speed, capacity, coverage and security of our wireless network to be key factors in our continued success. Over the past several years, we have been leading the development of 5G wireless technology industry standards and the ecosystems for fixed and mobile 5G wireless services. Our evolution to 5G with its new architecture allows us to simplify operations by eliminating legacy network elements.\nWhile we continue to improve our 5G wireless service coverage, we are also adding capacity and density to our networks. Network densification enables us to increase coverage, improve quality of service and add capacity to accommodate an increasing number of users.\nIn addition to enhancing our wireless service, our wireless mobility investments provide the foundation for our growing FWA broadband business. We are also continuing to expand our fiber-based networks, as customers increasingly value the ability to obtain wireless and wireline broadband services from the same provider. In September 2024, we entered into an agreement to acquire Frontier Communications Parent, Inc. (Frontier), a U.S. provider of broadband internet and other communication services, as part of our fiber expansion strategy, and we expect to increase the capital expenditures we devote to our fiber networks in 2025.\nOne Big Beautiful Bill Act\nOn July 4, 2025, the One Big Beautiful Bill Act (OBBBA) was enacted. The OBBBA revises the U.S. federal corporate income tax by, among other things, making permanent 100% bonus depreciation on qualified fixed assets, making permanent the immediate deduction for domestic research and experimentation expenses, and permanently changing the limitation on the deduction of business interest expense to 30% of Earnings before Interest, Taxes, Depreciation and Amortization (EBITDA). Verizon does not anticipate the provisions of the OBBBA will have a material impact on its effective income tax rate. We currently estimate that these provisions will both decrease our 2025 cash income tax liability and increase our deferred tax liability by $2.0 billion to $2.3 billion by December 31, 2025. We continue to analyze the effects of the OBBBA on our consolidated financial statements.\nTariffs and Other Government Initiatives\nDuring the course of 2025, the U.S. government announced tariffs on goods imported from various countries to the U.S. Countries subject to such tariffs have imposed or may in the future impose reciprocal or retaliatory tariffs and other trade measures. We continue to actively monitor the tariff developments and analyze their potential impacts on our business, cost structure, supply chain and broader economic environment. We are also working closely with our strategic suppliers to manage the potential impacts.\nIn addition, the U.S. presidential administration is implementing significant changes to the size and scope of the federal government, including a reduction of the federal government workforce, changes in budgetary priorities and other cost efficiency measures. Several U.S. states have launched similar initiatives. We have seen negative impacts from these efforts in our business with public sector customers during the first three quarters of 2025. It is also possible that we could see impacts from the federal government shutdown and related federal workforce initiatives that commenced in October 2025.\nWhile these developments have not had a material impact on our financial condition or results of operations to date, due to their evolving nature, we cannot predict with certainty the ultimate impacts they may have on our business and results in the future but those impacts could be material.\nConsolidated Results of Operations\nIn this section, we discuss our overall results of operations and highlight special items, some of which are not included in our segment results. In \"Segment Results of Operations\" we review the performance of our two reportable segments in more detail.\nConsolidated Operating Revenues\n\nReflects the reclassification of recurring device protection and insurance related plan revenues from Other revenue into Wireless service revenue in the first quarter of 2025.\nAs of end of period.\nRepresents total prepaid results excluding our SafeLink brand.\nWhere applicable, the operating results reflect certain adjustments, including those related to the reclassification of connections associated with Verizon’s second number offering, migration activity among different types of devices and plans, customer profile changes, and adjustments in connection with mergers, acquisitions and divestitures. Where applicable, historical results have been recast to conform to the current period presentation.\nConsumer's total operating revenues increased during both the three and nine months ended September 30, 2025 compared to the similar periods in 2024 as a result of increases in Service, Wireless equipment and Other revenues.\nService revenue increased during both the three and nine months ended September 30, 2025 compared to the similar periods in 2024 primarily driven by an increase in Wireless service revenue.\nWireless service revenue increased during the three months ended September 30, 2025 compared to the similar period in 2024 primarily due to:\nan increase of $202 million related to growth in non-reta"
}