{
  "source_file": "wab-20241231.htm",
  "form_type": "10-K",
  "item1_clean": "As global demands for growth increase, current trends suggest that freight and passenger rail activity will more than double by 2050, leading to an increased demand for sustainable transportation of people and goods. These converging forces highlight the critical interplay between market dynamics, the need for increased fuel efficiency and Wabtec’s business strategy. Wabtec is helping customers transition to a more utilized, efficient, and low-carbon rail network. Alternative clean energy technologies are critical in the fight against climate change and reducing greenhouse gas emissions. We are helping our customers reduce their overall cost of operations through the development of low-emitting locomotives like our Tier 4 locomotives, Trip Optimizer, Green Air and Green Friction products, and the use of alternative fuels such as biodiesel, renewable diesel, and hydrogen.\nExpand high-margin recurring revenue streams.\nOur expansive installed base allows us to generate strong recurring revenues with replacement parts and components, digital solutions, overhauls and modernizations. Aftermarket sales are typically done at higher margins and are less cyclical than OEM sales because a certain level of aftermarket maintenance and service work must be performed, even during an industry slowdown. Sales of aftermarket parts and services represent approximately 60% of total net sales. As a long-time supplier of original equipment, we have an extensive installed base of equipment in operation and growing this installed base further will expand our recurring aftermarket sales. Wabtec provides aftermarket parts and services for its components, and we seek to expand this business with customers who currently perform the work in-house. In this way, we expect to benefit as transit authorities and railroads outsource certain maintenance and overhaul functions.\nDrive continuous operational improvement\nWe are focused on continuous improvement to drive cost competitiveness, effectively deploy capital and accelerate Lean. Lean is a set of principles that emphasize customer focus, elimination of waste, high quality growth and relentless prioritization of work to improve safety, quality, delivery and cost. Lean is being embedded in our culture and is fundamental to how we execute our strategy. We are using Lean principles to help examine processes and continuously improve them by solving problems at their root cause. Our Lean transformation model focuses on driving process improvements and management systems to maximize the flow of value produced for the customer, remove waste, empower employees and optimize the enterprise. These principles are also rigorously applied to sustainability and safety.\nSee Note 3 of “Notes to Consolidated Financial Statements” included in Part II, Item 8 of this report for additional information about our recent acquisitions.\nBacklog represents the future sales we expect to recognize on firm orders received from customers and approximates the Company’s remaining performance obligations at the end of each period. The Company’s total backlog was approximately $22.3 billion at December 31, 2024. The Company’s contracts are subject to standard industry cancellation provisions, including cancellations on short notice or upon completion of designated stages. Generally, if a customer were to cancel a contract, we would have an enforceable right to payment for work completed up to the date of cancellation which would include a reasonable profit margin. Substantial scope-of-work adjustments are common. For these and other reasons, completion of the Company’s backlog may be delayed or canceled. The railroad industry, in general, has historically been subject to fluctuations due to overall economic conditions and the level of use of alternative modes of transportation.\nThe roll forward of the Company's backlog of firm customer orders and the expected year of completion are as follows:\nBalance at December 31, 2023\nLess: 2024 Net sales\nAdjustments / foreign exchange, net\nBalance at December 31, 2024\nGlobal economic conditions have not resulted in any material cancellations recently, but they have impacted the timing of some orders in backlog as, in certain cases, the delivery of goods and services were pushed out from their original timelines and could result in future modifications or cancellations.\nEngineering and Development\nTo execute our strategy to develop new products, we invest in a variety of engineering and development activities. For the years ended December 31, 2024, 2023 and 2022, we invested $206 million, $218 million and $209 million, respectively, in engineering for product development and improvement activities. Significant incremental engineering expense can be incurred with the execution of original equipment customer contracts. Across the Company we have established multiple Centers of Competence, which have specialized, technical expertise in various disciplines and product areas.\nOur engineering and development program includes investments in data analytics, train control and other new technologies, such as liquid natural gas and hydrogen-powered locomotives, with an emphasis on developing products that enhance safety, productivity and efficiency for our customers. For example, we have developed advanced cooling systems that enable lower emissions from diesel engines used in rail and other industrial markets. We periodically conduct specific research projects in conjunction with universities, customers and other industry suppliers.\nWe use our product development system to develop and monitor new product programs. The system requires the product development team to follow consistent steps throughout the development process, from concept to launch, to ensure the product will meet customer expectations and internal profitability targets.\nIntellectual Property\nWe have more than 6,500 active patents worldwide and file for approximately 300 new patents each year. We actively review our patent procurement processes and make adjustments as appropriate to the business environment. We also rely on a combination of trade secrets and other intellectual property laws, nondisclosure agreements and other protective measures to establish and protect our proprietary rights in our intellectual property. We actively monitor competitor patent issuance during our product development to reduce litigation risks, and we follow their product development practices to monitor possible patent infringement by them, and to evaluate their strategies and plans.\nTrademarks we utilize can be licensed from other companies, acquired as part of mergers or acquisitions, or have been developed through the normal course of business. We have entered into a variety of license agreements as licensor and licensee. We do not believe that any single license agreement is of material importance to our business or any of our business segments as a whole.\nWe provide products and services for more than 500 customers worldwide. Our customers include passenger transit authorities and railroads throughout North America, Europe, Asia Pacific, Africa and South America; manufacturers of transportation equipment, such as locomotives, freight cars, passenger transit vehicles and buses and companies that own, lease, and maintain such equipment, as well as customers in the mining, marine, and industrial markets.\nTop customers can change from year to year. For the fiscal year ended December 31, 2024, our top five customers accounted for approximately 30% of net sales. No one customer represents 10% or more of consolidated net sales. We believe that we have strong relationships with all of our key customers.\nWe operate in a highly competitive marketplace. Price competition is strong because we have a relatively small number of customers and they are very cost-conscious. In addition to price, competition is based on product performance and technological leadership, quality, reliability of delivery, and customer service and support.\nOur principal competitors vary across product lines and geographies. Within North America, New York Air Brake Company, a subsidiary of the German air brake producer Knorr-Bremse AG (“Knorr”) and Amsted Rail Company, Inc., a subsidiary of Amsted Industries Corporation, are our principal overall OEM competitors. Our primary competition for locomotives is Progress Rail, owned by a subsidiary of Caterpillar. Our primary competition for freight and passenger transit service and repair is mostly from the railroads’ and passenger transit authorities’ in-house operations and Knorr. We believe our key strengths, strategic partnerships and operational excellence, coupled with an experienced management team, enable us to compete effectively in this marketplace. Outside of North America, Knorr is our main competitor, although not in every product line or geography. In addition, our competitors often include smaller, local suppliers in most international markets. Depending on the product line and geography, we can also compete with our customers, such as CRRC Corporation Limited, a China-based manufacturer of rolling stock.\nEnvironmental, Social and Governance\nWabtec is committed to creating sustainable value through innovative rail technologies and responsible business practices. Our mission to unlock our customers' potential by delivering innovative and lasting transportation solutions underpins our sustainability strategy. Our strategy helps us capitalize on market opportunities and reduce safety and environmental risks, while creating value for our customers, employees and other stakeholders. Wabtec utilizes three Strategic Sustainability Principles to execute our sustainability strategy:\nInnovating with Purpose.\nWe are committed to developing responsible and sustainable products that minimize the impact on the planet.\nDriving Responsible Operations.\nWe are committed to providing safe work environments and products that enable productive and efficient use of resources.\nEmpowering People and Communities.\nWe are committed to driving an inclusive culture grounded in integrity, committed to the development of and investment in the communities where our teams live and work.\nAs we refine our sustainability strategy, we believe it is important to listen to our key internal and external stakeholders to identify and develop Environmental, Social and Governance (\"ESG\") topics of focus that align to our overall sustainability strategy and action plans. These topics are reviewed periodically to ensure our focus is in-line with the current market conditions and trends. Additionally, we utilize our Green Finance Framework to support the development of technologies that enable sustainable value creation.\nWabtec is committed to transparency on ESG topics, including the opportunities and challenges we encounter as we work to enhance performance and conduct business in a responsible manner. We publish periodic sustainability and sustainability-related reports, where we present ESG information, including policies, goals, activities, and qualitative and quantitative data on our progress.\nCompensation and Benefits\nWe remain committed to a strong pay-for performance philosophy that aligns individual performance, behaviors and business results with individual rewards. To deliver on that commitment, we utilize market data to benchmark to the external market and consider factors such as an employee’s role and experience, the location of the job and performance when determining compensation.\nWe provide our employees resources to help them be mentally, physically and financially well. We offer a wide range of benefits including healthcare and wellness (physical and mental) benefits, retirement benefits, paid time off, an employee assistance program, and seven employee resource groups to build diverse and inclusive communities at Wabtec.\nIn 2023, after years of growth and integration, we took the next step on our journey to beco",
  "item7_clean": "MANAGEMENT’S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS\nOVERVIEW\nWabtec is a global provider of value-added, technology-based locomotives, equipment, systems and services for the freight rail and passenger transit industries, as well as the mining, marine, and industrial markets. Our highly engineered products, which are intended to enhance safety, improve productivity and reduce maintenance costs for customers, can be found on most locomotives, freight cars, passenger transit cars, and buses around the world. Our core products and services are essential in the safe and efficient operation of freight rail and passenger transit vehicles. Wabtec is a global company with operations in over 50 countries, and our products can be found in more than 100 countries throughout the world. In 2024, approximately 53% of the Company’s Net sales came from customers outside the U.S.\nWabtec’s long-term financial goals are to increase revenues through a focused growth strategy, including product innovation and new technologies, global and market expansion, aftermarket products and services, and strategic acquisitions, increase margins through strict attention to cost controls, drive improved efficiencies across the business, drive strong cash flow conversion, and maintain a strong credit profile while minimizing our overall cost of capital. In addition, Management evaluates the Company’s current operational performance through measures such as safety, quality and on-time delivery.\nThe Company primarily serves the worldwide freight and transit rail industries. Our operating results are largely dependent on the level of activity, financial condition and capital spending plans of railroads and passenger transit agencies around the world, and transportation equipment manufacturers who serve those markets. Many factors influence these industries, including general economic conditions; traffic volumes, as measured by freight carloads and passenger ridership; number of locomotives and railcars in operation; government spending on public transportation; and investment in new technologies. In general, trends such as urbanization and growth in developing markets, sustainability and environmental awareness, investment in technology solutions, an aging equipment fleet, and growth in global trade are expected to drive continued investment in freight rail and passenger transit.\nThe Company monitors a variety of factors and statistics to gauge market activity. Freight rail markets around the world are driven primarily by overall economic conditions and activity, while Transit markets are driven primarily by government funding and passenger ridership. Changes in these market drivers can cause fluctuations in demand for Wabtec's products and services.\nDuring 2024, Wabtec continued to execute on our value creation framework by signing several key agreements including: a multi-year Tier 4 locomotive order in North America for over $600 million, a multi-year locomotive order in Kazakhstan for over $400 million, international orders for new locomotives for $401 million across six customers, and multi-year orders for new locomotives in Africa for approximately $525 million. Additionally, Wabtec won a long-term parts agreement with a Class I railroad for over $300 million, signed its first multi-year service contract with a customer in Brazil worth over $240 million, won signaling contracts with Transit customers in North America, and secured a long-term parts agreement with a customer in Asia. Operationally, Wabtec began commercial operations for its Green Friction braking solution in Paris and launched the next generation of railcar movers with its Shuttlewagon Commander NXT. Additionally, as a result of Wabtec's strong revenue and profitable growth over the past few years, rating agencies have made the following changes to our credit ratings: both Fitch Ratings and S&P Global Ratings upgraded Wabtec's credit rating from BBB- to BBB with a Stable outlook, and Moody's updated Wabtec's outlook to positive from stable.\nDuring the first quarter of 2022, Wabtec announced Integration 2.0, a multi-year strategic initiative to target incremental run rate synergies now estimated to be approximately $100 million by the end of 2026. The scope of the review included consolidating our operating footprint, reducing headcount, streamlining the end-to-end manufacturing process, restructuring the North America distribution channels, expanding operations in low-cost countries and simplifying the business through systems enablement. During the twelve months ended December 31, 2024 and 2023, the Company incurred one-time restructuring charges for programs included in the initiative of approximately $28 million and $49 million, respectively, primarily for employee-related costs and asset write downs associated with site consolidations in Europe. The Company now expects to incur approximately $170 million of one-time restructuring charges related to Integration 2.0, of which approximately $146 million has been incurred through December 31, 2024. Approved programs resulted in approximately 15 facility closures and impacted approximately 1,000 employees.\nIn addition to Integration 2.0, Wabtec is focused on exiting various low margin product offerings through Portfolio Optimization to improve profitability while reducing manufacturing complexity. Wabtec now expects to incur approximately $70 million in net exit charges related to Portfolio Optimization, which will be predominately non-cash asset write downs. For the years ended December 31, 2024 and 2023, Wabtec recorded charges of approximately $28 million primarily for asset write\ndowns related to Portfolio Optimization. Total one-time restructuring charges related to Portfolio Optimization to date are approximately $56 million.\nIn February 2025, Wabtec announced Integration 3.0, a three-year strategic initiative to target incremental run rate synergies estimated to be between $100 million to $125 million by 2028. The scope of the review includes consolidating our footprint via value chain improvement and facility rationalization, reducing headcount, expanding operating capacity in low-cost countries, and streamlining administrative and commercial activities. Management will also consider additional capital investments to further simplify and streamline the business. The Company anticipates that it will incur charges of approximately $125 million to $155 million related to this initiative, of which approximately $80 million to $100 million are expected to be one-time restructuring charges. Concurrently, Wabtec announced an additional Portfolio Optimization initiative for 2025 targeting approximately $100 million of low margin revenues. The 2025 Portfolio Optimization actions are expected to result in approximately $40 million of net exit charges, primarily for non-cash asset write downs. Estimates for these programs could change based on the specific programs approved or changes to the scope of the review.\nFuture macroeconomic volatility, supply chain disruptions and labor availability could cause component and raw material shortages resulting in an adverse effect on the timing of the Company’s revenue and cash flows. Additionally, broad-based inflation, metals, energy and other commodity costs, transportation and logistics costs, labor costs, and foreign currency exchange rate fluctuations all continue to impact our results. The Company utilizes various mitigating actions intended to lessen the impact of macroeconomic volatility. These actions include implementing price escalations and surcharges, driving operational efficiencies through various cost mitigation efforts and discretionary spend management, strategically sourcing materials, reviewing and modifying distribution logistics, and accelerating integration synergies through our restructuring programs.\nA portion of our workers are represented by labor unions. The United Electrical, Radio and Machine Workers of America (UE), Locals 506 and 618 collective bargaining agreement, covering approximately 1,400 locomotive manufacturing workers in Erie, Pennsylvania, expired on June 9, 2023. Negotiations with UE officially began on April 27, 2023 and an agreement between the Company and the UE was not reached before the contract expired. On June 22, 2023, the UE voted against ratification of the Company's proposed agreement and authorized a strike. The Company and the UE subsequently reached an agreement that was ratified by the UE on August 31, 2023, ending the labor strike. The Company continuously monitors its labor activity.\nDuring the first quarter of 2024, Company Management determined that certain parts of the business would be better aligned with Management oversight in different product lines. These changes were immaterial to the individual product lines and segments affected, and historical amounts have been reclassified to conform to the current period presentation.\nAs previously announced, on June 26, 2022, we detected a cyber security incident which impacted the Company’s network. The Company promptly activated incident response protocols, which included shutting down certain systems, and commenced an investigation of the incident. The Company also notified law enforcement and engaged legal counsel and other third-party incident response and cybersecurity professionals.\nBased on the Company's assessment, the incident did not have a significant financial impact and the Company does not believe the incident will have a material impact on its business, operations or financial results. The Company maintains cyber insurance, subject to certain deductibles and policy limitations typical for its size and industry.\nACQUISITIONS\nDuring 2024, the Company made four strategic acquisitions for a combined purchase price of approximately $168 million, net of cash acquired. Two of the acquisitions are reported in the Transit Segment, one is reported in the Digital Intelligence product line of the Freight Segment and one is reported in the Components product line of the Freight Segment. Each of the acquisitions in 2024 are individually and collectively immaterial.\nDuring the fourth quarter of 2023, the Company purchased the remaining ownership shares of LKZ, a locomotive manufacturing and assembly company located in Kazakhstan for $111 million, at which time it became a wholly owned subsidiary of the Company. Prior to this purchase, Wabtec owned 50% of LKZ as a joint venture partner and accounted for its interest as an equity method investment. During the second quarter of 2023, the Company acquired L&M Radiator, Inc., a leading manufacturer of heavy-duty equipment radiators and heat exchangers for the mining sector, for a purchase price of approximately $245 million.\nDuring 2022, the Company made three strategic acquisitions in the Freight Segment for a combined purchase price of $89 million, net of cash acquired. Two of the acquisitions are reported in the Digital Intelligence product line and one is reported in the Services product line. Each of the acquisitions in 2022 are individually and collectively immaterial. For\nadditional information related to these acquisitions refer to Note 3 of \"Notes to Consolidated Financial Statements\" included in Part II, Item 8 of this report.\nOn January 14, 2025, Wabtec announced a definitive agreement to acquire Evident’s Inspection Technologies division (Inspection Technologies), formerly part of the Scientific Solutions Division of Olympus Corporation, a global leader in Non-Destructive Testing, Remote Visual Inspection and Analytical Instruments solutions for mission critical assets, for $1.78 billion. Inspection Technologies’ leading industry presence and innovative product portfolio is expected to significantly expand Wabtec's capabilities, adding advanced automated inspection capabilities, driving technology in a space where data acquisition, analytics and automation are critical. Upon acquisition, Inspection Technologies will be reported within the Digital Intelligence product line of the Freight Segment. The Company anticipates financing the acquisition with a combination of cash on hand, utilization of the Revolving Credit Facility and an additional term loan. The transaction is subject to customary closing conditions and regulatory approvals, with the Company expecting to finalize the acquisition of Inspection Technologies by the end of the first half of 2025.\nRESULTS OF OPERATIONS\nConsolidated Results\n2024 COMPARED TO 2023\nThe following table shows our Consolidated Statements of Operations for the years indicated.\n\n$18 million and $13 million, respectively, of restructuring costs, primarily related to Integration 2.0 and Portfolio Optimization.\nFreight Segment Operating expenses as a percentage of Net sales were 14.7% and 16.1% for the years ended December 31, 2024 and 2023, respectively. Freight Segment Operating expenses decreased by $15 million primarily driven by lower amortization expense of $26 million due to changes in accelerated amortization for business dispositions associated with Portfolio Optimization and lower amortization for the GE Transportation trade name, and lower Engineering expenses of $16 million due to the timing of investments in new technology. This was partially offset by higher SG&A expenses of\n$27 million resulting from higher costs to support increased sales volume, higher employee compensation and benefit costs and incremental expense from acquisitions. Freight SG&A expenses for the years ended December 31, 2024 and 2023 included $3 million and $5 million, respectively, of restructuring costs related to Integration 2.0 in 2023 and Portfolio Optimization in 2024.\nThe following table shows our Consolidated Statements of Operations for our Transit Segment for the periods indicated:\nFor the year ended December 31,\nCost of sales (% of Net sales)\nIncome from operations ($)\nIncome from operations (% of Net sales)\nThe following table shows the major components of the change in Net sales for the Transit Segment in 2024 from 2023:\nChanges in Net sales by Product Line:\nOriginal Equipment Manufacturing\nTransit Segment organic sales increased $163 million driven by strong Aftermarket and Original Equipment Manufacturing sales. Increased passenger ridership levels resulted in increased demand for services and products. Additionally, increased investments in railway infrastructure, fleet expansion and renewals and sustainable transport initiatives also contributed to organic growth.\nTransit Segment Cost of sales increased by $85 million primarily from higher sales volume, and Cost of sales as a percentage of Net sales decreased by 1.2 percentage points. The increase in gross margin is primarily attributable to favorable mix within the Transit Segment and the benefits from structured cost actions taken through prior years' restructuring and integration projects, primarily Integration 2.0. Transit Cost of sales for the years ended December 31, 2024 and 2023 included $19 million and $25 million of restructuring costs, respectively, primarily for footprint rationalization and headcount actions in Europe related to Integration 2.0.\nOperating expenses as a percentage of Net sales for the Transit Segment were 17.3% and 17.0% for the years ended December 31, 2024 and 2023, respectively. Transit Segment Operating expenses increased by $37 million primarily driven by higher SG&A expenses of $25 million to support higher sales volume and higher employee compensation and benefit costs, higher Engineering expenses of $4 million due to increased investments in new technology, and higher Amortization expense of $8 million primarily due to accelerated amortization for business dispositions associated with Portfolio Optimization. This was partially offset by benefits from structured cost actions taken through prior years' restructuring and integration projects, primarily Integrati",
  "item2_clean": null
}