{
  "source_file": "wab-20250930.htm",
  "form_type": "10-Q",
  "item1_clean": null,
  "item7_clean": null,
  "item2_clean": "Item 2. MANAGEMENT’S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS\nOVERVIEW\nWabtec is a global provider of value-added, technology-based locomotives, equipment, systems, and services for the freight rail and passenger transit industries, as well as the mining, marine and industrial markets. Our highly engineered products, which are intended to enhance safety, improve productivity and reduce maintenance costs for customers, can be found on most locomotives, freight cars, passenger transit cars and buses around the world. Our core products and services are essential in the safe and efficient operation of freight rail, passenger transit vehicles and other modes of transportation. Wabtec is a global company with operations in over 50 countries and our products can be found in more than 100 countries throughout the world. In the first nine months of 2025, approximately half of the Company’s Net sales came from customers outside the United States.\nOn July 1, 2025, Wabtec completed the previously announced acquisition of Evident’s Inspection Technologies division (\"Inspection Technologies\"), formerly part of the Scientific Solutions Division of Olympus Corporation, for approximately $1.788 billion. Inspection Technologies is a global leader in Non-Destructive Testing, Remote Visual Inspection and Analytical Instruments solutions for mission critical assets. Inspection Technologies' industry presence and innovative product portfolio will significantly expand Wabtec's capabilities and complement the existing product portfolio of Digital Intelligence.\nOn July 7, 2025, the Company announced a definitive agreement to acquire Frauscher Sensor Technology Group, GmbH (\"Frauscher\"), a global market leader in train detection, wayside object control solutions and axle counting systems, for approximately\n675 million. The acquisition positions Wabtec for accelerated, profitable growth, and further strengthens the Company’s product portfolio by adding highly attractive and complementary railway signaling technologies. Additionally, during the first quarter of 2025, Wabtec announced a definitive agreement to acquire Dellner Couplers for approximately\n890 million. Dellner Couplers is a global leader in highly engineered safety-critical train connection systems and services for passenger rail rolling stock. The acquisition brings highly attractive and complementary technologies and provides synergies by complementing our core transit systems portfolio. Both announced acquisitions are subject to customary closing conditions and regulatory approval.\nTransaction costs incurred during the three and nine months ended September 30, 2025 related to completed and announced acquisitions were approximately $9 million and $44 million, respectively.\nOn September 22, 2025, Wabtec announced an agreement with National Company Kazakhstan Temir Zholy (\"KTZ\"), the national railway of Kazakhstan, to deliver Evolution Series locomotives and provide long-term service support. The multi-national order, valued by the Company at approximately $4.2 billion, marks the largest locomotive agreement in Wabtec's history. Wabtec also continued to drive recurring revenue in the global market by winning a new service contract in Kazakhstan worth $299 million earlier in 2025. Additionally in the Freight Segment, during the third quarter of 2025, the first Simandou locomotives reached Guinea, marking the first exports from the Company's India locomotive facility. During the first nine months of 2025, the Freight Segment also signed a $140 million new locomotive order with a North American Class I railroad, signed new locomotive, mining and service orders in the Asia-Pacific region totaling $127 million, and signed a $125 million ultra class mining order.\nDuring the three months ended September 30, 2025, the Transit Segment signed $140 million in new Transit brake orders. Additionally, during the first nine months of 2025, the Transit Segment signed two multi-year transit platform door contracts valued at $85 million and a $47 million order to provide brakes and couplers for servicing a North American customer. In March of 2025, Moody's upgraded the Senior Notes ratings to Baa2 from Baa3 and changed the outlook to stable from positive, and S&P Global Ratings reaffirmed Wabtec's credit rating at BBB with a stable outlook.\nWabtec is focused on driving operational efficiency and improving profitability while reducing manufacturing complexity. As a result, there are restructuring initiatives, including Integration 3.0, Portfolio Optimization and Integration 2.0, aimed at achieving these focus areas. During the first nine months of 2025, Wabtec incurred $21 million of restructuring costs primarily for employee-related costs on programs under these initiatives.\nFuture macroeconomic volatility, changes to tariffs and trade policies, supply chain disruptions, and labor availability, amongst other things, could cause a negative impact on revenue and cost increases resulting in an adverse effect on the Company’s operating results. Additionally, broad-based inflation, metals, energy and other commodity costs, transportation and logistics costs, labor costs, and foreign currency exchange rate fluctuations all continue to impact our results. The Company utilizes various mitigating actions intended to lessen the impact of macroeconomic volatility, including the impact of current tariffs. These actions include implementing price escalations and surcharges, driving operational efficiencies through various\ncost mitigation efforts and discretionary spend management, strategically sourcing materials, reviewing and modifying distribution logistics, and accelerating integration synergies through our strategic initiatives. The Company has experienced increased tariff costs which unfavorably impacted our cash from operations for the nine months ended September 30, 2025. Although we do not expect a material impact to our results of operations in 2025 because of mitigation efforts, due to the volatility of trade policies, we are unable to reasonably predict the future impact.\nDuring the first quarter of 2025, Management determined that certain businesses within the Services product line would be better aligned with Management oversight in the Components product line. As such, Sales by product line for 2024 and 2023 have been recast to conform to the current period presentation. These changes were within the Freight Segment and had no impact on Total Freight Segment Sales, Gross profit, or Income from operations.\nRESULTS OF OPERATIONS\nConsolidated Results\nTHIRD QUARTER 2025 COMPARED TO THIRD QUARTER 2024\nThe following table shows our Condensed Consolidated Statements of Operations for the periods indicated.\nSelling, general and administrative expenses\nEngineering expenses\nAmortization expense\nTotal Operating expenses\nIncome from operations\nOther income and expenses:\nInterest expense, net\nIncome before income taxes\nLess: Net income attributable to noncontrolling interest\nNet income attributable to Wabtec shareholders\nThe following table shows the major components of the change in Net sales in the three months ended September 30, 2025 from the three months ended September 30, 2024:\nThird Quarter 2024 Net sales\nPortfolio Optimization (Divestitures/Exits)\nThird Quarter 2025 Net sales\nNet sales for the three months ended September 30, 2025 increased by $223 million, or 8.4%, to $2.89 billion compared to the same period in 2024. Organic sales increased $79 million which was attributable to both the Freight and Transit Segments. Freight Equipment sales increased primarily due to higher North American locomotive deliveries. Freight Services sales decreased from lower deliveries of locomotive modernizations and engine overhauls. Transit sales increased from higher demand for Aftermarket and Original Equipment Manufacturing products and services driven by increased investments in sustainable infrastructure, fleet expansion and renewals and increased passenger ridership levels. Sales from acquisitions contributed $134 million, primarily from Inspection Technologies in the Freight Segment, and favorable changes in foreign exchange increased Net sales by $23 million.\nCost of sales for the three months ended September 30, 2025 increased by $101 million, or 5.7%, to $1.88 billion compared to the same period in 2024. The increase is primarily due to the increase in Net sales. Cost of sales as a percentage of Net sales was 65.3% and 67.0% for the three months ended September 30, 2025 and 2024, respectively. The improvement in gross margin is attributable to strong productivity and cost management, Integration 2.0 and 3.0 savings, and the exit of low margin business offerings through Portfolio Optimization, partially offset by unfavorable mix within the Freight Segment. Cost of sales for the three months ended September 30, 2025 included $24 million of costs related to purchase price accounting for the step-up of Inspection Technologies inventory to fair value on the date of acquisition. Cost of sales for the three months ended September 30, 2025 and 2024 included $2 million and $7 million, respectively, of costs related to restructuring initiatives.\nTotal operating expenses increased $64 million, or 14.3%, for the three months ended September 30, 2025 compared to the same period in 2024, primarily due to the increase in Selling, general and administrative expenses (\"SG&A\"). Operating expenses as a percentage of sales were 17.7% and 16.8% for the three months ended September 30, 2025 and 2024, respectively. SG&A increased $57 million for the three months ended September 30, 2025 compared to the same period in 2024. The increase is primarily from incremental expense from acquisitions, transaction costs associated with completed and announced acquisitions, and costs incurred to support the higher sales volume, partially offset by the impacts of Integration 2.0 and 3.0. Transaction costs"
}