{
  "source_file": "d791800d10k.htm",
  "form_type": "10-K",
  "item1_clean": "Services provided by Waters enable customers to maximize technology productivity, support customer compliance activities and provide transparency into enterprise resource management efficiencies. The customer benefits from improved budget control, data-driven technology adoption and accelerated workflow at a site or on a global perspective. The Company considers its service offerings to be highly differentiated from its competition, as evidenced by a consistent increase in annual service revenues. The Company’s principal competitors in the service market include Revvity, Inc., Agilent Technologies, Inc. and Thermo Fisher Scientific Inc. These competitors can provide certain services on Waters instruments to varying degrees and always present competitive risk.\n\nThe Company’s business activities, for which discrete financial information is available, are regularly reviewed and evaluated by the chief operating decision maker. As a result of this evaluation, the Company determined that it has two operating segments: Waters and TA. The Waters operating segment is primarily in the business of designing, manufacturing, selling and servicing LC and MS instrument systems, columns and other precision chemistry consumables that can be integrated and used along with other analytical instruments. The TA operating segment is primarily in the business of designing, manufacturing, selling and servicing thermal analysis, rheometry and calorimetry instruments. The Company’s two operating segments have similar economic characteristics; product processes; products and services; types and classes of customers; methods of distribution; and regulatory environments. Because of these similarities, the two segments have been aggregated into one reporting segment for financial statement purposes. Operations of the Wyatt business are part of the Waters operating segment.\n\nThe analytical instrument systems, supplies and services market is highly competitive. The Company encounters competition from several worldwide suppliers and other companies in both domestic and foreign markets for each of its three primary technologies. The Company competes in its markets primarily on the basis of product performance, reliability, service and, to a lesser extent, price. Competitors continuously introduce new products and have instrument businesses that are generally more diversified than the Company’s business. Some competitors have greater financial resources and broader distribution than the Company’s.\n\nThe market for consumable LC products, including separation columns, is highly competitive and generally more fragmented than the analytical instruments market. The Company encounters competition in the consumable columns market from chemical companies that produce column sorbents and small specialized companies that primarily pack purchased sorbents into columns and subsequently package and distribute columns. The Company believes that it is one of the few suppliers that processes silica and polymeric resins, packs columns and distributes its own products. The Company competes in this market on the basis of performance, reproducibility, reputation and, to a lesser extent, price. In recent years, the Company’s principal competitors for consumable products have included: Danaher Corporation; Merck KGaA; Agilent Technologies, Inc.; General Electric Company and Thermo Fisher Scientific Inc. The ACQUITY UPLC Instrument is designed to offer a predictable level of performance when used with ACQUITY UPLC Columns and the Company believes that the expansion of the ACQUITY UPLC Instrument base will enhance its chromatographic column business because of the high level of synergy between ACQUITY UPLC Columns and the ACQUITY UPLC Instruments.\n\nLC and MS are typically embodied within an analytical system tailored for either a dedicated class of analyses or as a general-purpose analytical device. An increasing percentage of the Company’s customers are purchasing LC and MS components simultaneously and it has become common for LC and MS instrumentation to be used within the same laboratory and operated by the same user. The descriptions of LC and MS above reflect the historical segmentation of these analytical technologies and the historical categorization of their respective practitioners. Increasingly in today’s instrument market, this segmentation and categorization is becoming obsolete as a high percentage of instruments used in the laboratory embody both LC and MS technologies as part of a single device. In response to this development and to further promote the high utilization of these hybrid instruments, the Company has organized its Waters operating segment to develop, manufacture, sell and service integrated\nLC-MS\n\nThe Company typically has a broad and diversified customer base that includes pharmaceutical accounts, other industrial accounts, universities and governmental agencies. Purchase of the Company’s instrument systems is often dependent on its customers’ capital spending, or funding as in the cases of academic, governmental and research institutions, which often fluctuate from year to year. The pharmaceutical segment represents the Company’s largest sector and includes multinational pharmaceutical companies, generic drug manufacturers, contract research organizations (“CROs”) and biotechnology companies. The Company’s other industrial customers include chemical manufacturers, polymer manufacturers, food and beverage companies and environmental testing laboratories. The Company also sells to universities and governmental agencies worldwide. The Company’s technical sales and support staff members work closely with its customers in developing and implementing applications that meet their full range of analytical requirements. During 2024, 58% of the Company’s net sales were to pharmaceutical accounts, 31% to other industrial accounts and 11% to academic institutions and governmental agencies. Although the Company transacts business with various government agencies, no government contract is of such magnitude that a renegotiation of profits or termination of the contract at the election of the government agency would have a material adverse effect on the Company’s financial results.\n\nNearly all of the Company’s LC products have been developed at the Company’s main research and development center located in Milford, Massachusetts, with input and feedback from the Company’s extensive field organizations and customers. The majority of the Company’s MS products are developed at facilities in England and most of the Company’s current materials characterization products are developed at the Company’s research and development center in New Castle, Delaware. At December 31, 2024, 2023 and 2022, there were approximately 1,100, 1,200 and 1,200 employees involved in the Company’s research and development efforts, respectively. The Company has increased research and development expenses from its continued commitment to invest significantly in new product development and existing product enhancements, and as a result of acquisitions. Despite the Company’s active research and development programs, there can be no assurance that the Company’s product development and commercialization efforts will be successful or that the products developed by the Company will be accepted by the marketplace.\n\neconomic conditions in China, trade tensions and tariffs between the U.S. and China and their impact on our business, increased competition from local and international competitors in China, the Chinese government’s ongoing tightening of restrictions on procurement by government-funded customers and other regulatory and other challenges and uncertainties in the Chinese market;\n\nDecember 31, 2024 and approximately 4,200, 4,300 and 4,500 field representatives in 2024, 2023 and 2022, respectively. This investment in sales and service personnel serves to maintain and expand the Company’s installed base of instruments. The Company’s sales representatives have direct responsibility for account relationships, while service representatives work in the field to install instruments, train customers and minimize instrument downtime.\nand field-based technical support representatives work directly with customers, providing them assistance with applications and procedures on Company products. The Company provides customers with comprehensive information through various corporate and geographic-specific internet websites and product literature and also makes consumable products available through electronic ordering facilities and a dedicated catalog.\n\nCurrently, the Company offers a wide range of MS instrument systems utilizing various combinations of quadrupole, Tof and ion mobility designs. These instrument systems are used in drug discovery and development, as well as for environmental, clinical and nutritional safety testing. The overwhelming majority of mass spectrometers sold by the Company are designed to utilize an LC system and a liquid compatible interface (such as an electrospray ionization source) as the sample introduction device. These products supply a diverse market with a strong emphasis on the pharmaceutical, biomedical, clinical, food and beverage and environmental market segments worldwide.\n\nWaters Corporation (the “Company,” “Waters,” “we,” “our,” or “us”), a global leader in analytical instruments and software, has pioneered innovations in chromatography, mass spectrometry and thermal analysis serving life, materials and food sciences for more than 65 years. With approximately 7,600 employees worldwide, Waters operates directly in over 35 countries and has products available in more than 100 countries. The Company primarily designs, manufactures, sells and services high-performance liquid chromatography (“HPLC”), ultra-performance liquid chromatography (“UPLC” and together with HPLC, referred to as “LC”) and mass spectrometry (“MS”) technology systems and support products, including chromatography columns, other consumable products and comprehensive post-warranty service plans. These systems are complementary products that are frequently employed together\n(“LC-MS”)\nand sold as integrated instrument systems using common software platforms. In addition, the Company designs, manufactures, sells and services thermal analysis, rheometry and calorimetry instruments through its TA Instruments\nTM\n(“TA”) product line. The Company is also a developer and supplier of advanced software-based products that interface with the Company’s instruments, as well as other manufacturers’ instruments.\n\nIn 2023, the Company introduced the next generation Xevo TQ Absolute IVD Mass Spectrometer, expanding its family of MassTrak\nTM\nIVD\nLC-MS/MS\nSystems for clinical diagnostic applications. The powerful analytical performance of the Xevo TQ Absolute IVD Mass Spectrometer is up to five times more sensitive for quantifying clinical analytes. This sensitivity enables clinical laboratories to detect and measure trace level analytes within a sample at lower detection levels than previously possible. It can also extend the testing capabilities of the clinical laboratory to include lower volume samples obtained in less-invasive assays such as saliva, breath, dried blood spots and multiplex panels and large molecules. The new MassTrak\nLC-MS/MS\nIVD System includes the ACQUITY UPLC\nPLUS System with the Xevo TQ Absolute IVD Mass Spectrometer. The ACQUITY UPLC\nPLUS System is designed to deliver rapid and accurate sample analysis to enhance the sensitivity of any mass spectrometer and simplify the characterization of the most complex sample. The Xevo TQ Absolute IVD System provides more consistent\ninstrument-to-instrument\nperformance, with a user-friendly design that maximizes service uptime. Its innovative design is also 45% smaller and uses 50% less nitrogen gas and electricity than comparable tandem quadrupole-mass spectrometry systems, making it ideal for hospital lab",
  "item7_clean": null,
  "item2_clean": null
}