{
  "source_file": "d35664d10q.htm",
  "form_type": "10-Q",
  "item1_clean": null,
  "item7_clean": null,
  "item2_clean": "The Company generated $488 million and $522 million of net cash from operating activities in the first nine months of 2025 and 2024, respectively. The first nine months of 2025 included an increase of $24 million more in tax payments associated with the final 2018 Tax Reform Transition payment; $14 million of costs related to the implementation of the Company’s new ERP system; and $14 million of payments made in connection with merger transaction and integration costs. Net cash used in investing activities included capital expenditures related to property, plant, equipment and software capitalization of $74 million and $90 million in the first nine months of 2025 and 2024, respectively, as well as $35 million used for the Halo Labs acquisition in the second quarter of 2025.\n\nDuring the third quarter of 2025, sales to pharmaceutical customers increased 12%, driven by sales growth in most regions. Foreign currency translation increased pharmaceutical sales growth by 1%. Combined sales to industrial customers, which include material characterization, food, environmental and fine chemical markets, increased 3% in the third quarter of 2025, primarily driven by the broad-based sales growth in most regions except for the U.S., where industrial sales declined by 9% on lower demand for TA instrument systems. Foreign currency translation decreased industrial sales growth by 1%. Combined sales to academic and government customers increased 2% in the third quarter of 2025, with foreign currency translation increasing sales growth by 1%.\n\nThe four principal jurisdictions in which the Company manufactures are the U.S., Ireland, the U.K. and Singapore, where the statutory tax rates were 21%, 12.5%, 25% and 17%, respectively, as of September 27, 2025. The Company has a Development and Expansion Incentive in Singapore that provides a concessionary income tax rate of 5% on certain types of income for the period April 1, 2021 through March 31, 2026. The effect of applying the concessionary income tax rate rather than the statutory tax rate to income from qualifying activities in Singapore increased the Company’s net income by $2 million and $9 million and increased the Company’s net income per diluted share by $0.03 and $0.15 for the third quarter of 2025 and 2024, respectively.\n\nRecurring revenues (combined sales of precision chemistry consumables and services) increased 10% and 8% for the third quarter and first nine months of 2025, respectively, with foreign currency translation increasing sales growth by 1% for the third quarter of 2025 and having a minimal impact on sales growth for the first nine months of 2025. Service revenues increased 8% and 6% for the third quarter and first nine months of 2025, respectively. Chemistry sales growth increased 14% and 11% for the third quarter and first nine months of 2025, respectively. The double-digit chemistry sales growth can be attributed to the uptake in columns and application-specific testing kits to pharmaceutical customers.\n\nSelling and administrative expenses increased 27% and 14% in the third quarter and first nine months of 2025, respectively, primarily due to an increase in merit compensation as well as $27 million and $41 million of transaction and integration costs associated with the Merger in the third quarter and first nine months of 2025, respectively. In addition, 2025 included $6 million and $14 million of expenses associated with the Company’s new ERP system implementation for the third quarter and first nine months of 2025, respectively. The effect of foreign currency translation had minimal impact on selling and administrative expenses for the third quarter and first nine months of 2025.\n\nInterest expense, net increased $5 million and decreased $16 million in the third quarter and first nine months of 2025, respectively. The increase in the third quarter of 2025 is primarily a result of $14 million costs paid by the Company on behalf of SpinCo in connection with financing fees associated with financing activities related to the Merger. The decrease in the first nine months of 2025 is primarily a result of lower average outstanding debt as compared to the third quarter of 2024. The average outstanding debt in these periods was impacted by the timing of the repayment of outstanding debt.\n\nOn July 13, 2025, the Company entered into definitive agreements with BD, Augusta SpinCo Corporation, a Delaware corporation and wholly owned subsidiary of BD (“SpinCo”), and Beta Merger Sub, Inc., a Delaware corporation and a wholly owned subsidiary of Waters (“Merger Sub”), with respect to a Reverse Morris Trust transaction valued at approximately $17.5 billion as of the date of signing, and pursuant to which, subject to the terms and conditions of such definitive agreements, (i) BD will transfer (or cause to be transferred) and SpinCo will accept and assume (or cause to be accepted and assumed) all of the rights, titles and interests to and under certain assets and liabilities relating to BD’s Biosciences and Diagnostic Solutions business, (ii) BD will distribute to its shareholders all of the issued and outstanding shares of common stock, $0.01 par value per share, of SpinCo (“SpinCo Common Stock”) held by BD by way of a pro rata distribution (the “Spin-Off” and the disposition by BD of 100% of the SpinCo Common Stock by way of the Spin-Off, the “Distribution”) and (iii) following the Distribution, Merger Sub will be merged with and into SpinCo, with SpinCo as the surviving entity (the “Merger”), and all SpinCo Common Stock will be converted into the right to receive shares of common stock, $0.01 par value per share, of the Company (“Company Common Stock”), as calculated and subject to adjustment as set forth in the Merger Agreement (as defined herein). When the Merger is completed, SpinCo will become a wholly owned subsidiary of Waters. Upon completion of the Merger, BD’s shareholders are expected to own approximately 39.2% of the combined company, and existing Waters Corporation shareholders are expected to own approximately 60.8% of the combined company. This strategic combination is expected to create a leading global life sciences and diagnostics company with enhanced scale, complementary capabilities and expanded end-market exposure.\n\ncurrent global economic, sovereign and political conditions and uncertainties, including the impact of the U.S. government shutdown that began in October 2025; the effect of new or proposed tariff or trade regulations, as well as other new or changed domestic and foreign laws, regulations and policies (or new interpretations thereof); inflation and interest rates; the impacts and costs of war, in particular as a result of the ongoing conflicts between Russia and Ukraine and in the Middle East; and the possibility of further escalation resulting in new geopolitical and regulatory instability;\n\nThe Company’s net sales increased 8% in the third quarter of 2025, as compared to the third quarter of 2024 and 7% for the first nine months of 2025 as compared to the first nine months of 2024. The effect of foreign currency translation had minimal impact on total sales growth for both the third quarter and first nine months of 2025. The net sales growth in the third quarter and first nine months of 2025 was driven by strong customer demand for the Waters Division products and services across most major geographies, end markets and product lines.\n\nOn May 22, 2025, the Company and certain of its subsidiaries, as guarantors, entered into an Amendment and Restatement Agreement in respect of that certain Amended and Restated Credit Agreement, dated as of September 17, 2021 and amended as of March 3, 2023, with the lenders and issuing banks party thereto, and JPMorgan Chase Bank, N.A., as administrative agent, pursuant to which the Company, among other things, reduced the aggregate total borrowing capacity of its existing senior unsecured revolving credit facility by up to $200 million for an aggregate principal amount of up to $1.8 billion. The Credit Facility will mature on May 22, 2030 subject to the Company’s ability to request, subject to customary conditions, a one-year extension to which each lender may, in its discretion, agree. As of September 27, 2025, the Company had a total of $1.4 billion in outstanding debt, which consisted of $1.3 billion in outstanding senior unsecured notes and $200 million borrowed under its Credit Facility. The Company’s net debt borrowings decreased by $220 million and $530 million during the first nine months of 2025 and 2024, respectively.\n\nEffective in 2024, various foreign jurisdictions began implementing aspects of the guidance issued by the Organization for Economic Co-operation and Development related to the new Pillar Two system of global minimum tax rules. These changes in tax law did not have a material impact on the Company’s financial position, results of operations and cash flows for the third quarter and first nine months of 2025. The Company continues to monitor the adoption of the Pillar Two rules in additional jurisdictions.\n\nResearch and development expenses increased 18% and 9% in the third quarter and first nine months of 2025, respectively. The increase in these periods was primarily driven by merit compensation; costs associated with the development of new product and technology initiatives; and $4 million of transaction and integration costs associated with the Merger. The impact of foreign currency exchange decreased expenses by 2% and 1% for the third quarter and first nine months of 2025, respectively.\n\nWaters chemistry consumables sales grew 14% and 11% for the third quarter and first nine months of 2025, respectively, and was primarily due to the continued demand in most major geographies, driven by the uptake in columns and application-specific testing kits to pharmaceutical customers. Foreign currency translation increased chemistry consumable sales by 1% in the third quarter of 2025 and"
}