{
  "source_file": "wbd-20241231.htm",
  "form_type": "10-K",
  "item1_clean": "The WGA and SAG-AFTRA went on strike in May and July 2023, respectively, following the expiration of their respective collective bargaining agreements with the Alliance of Motion Picture and Television Producers (“AMPTP”). The WGA strike ended on September 27, 2023, and a new collective bargaining agreement was ratified on October 9, 2023. The SAG-AFTRA strike ended on November 9, 2023, and a new collective bargaining agreement was ratified on December 5, 2023.\nThe strikes had a material impact on the operations and results of the Company in 2023, including a pause on certain theatrical and television productions. Effects included a positive impact on cash flow from operations attributed to delayed production spend, and a negative impact on the results of operations attributed to timing and performance of the 2023 film slate, as well as the Company’s ability to produce, license, and deliver content. The Company experienced content completion and delivery delays in the first quarter of 2024 due to the pause in television and theatrical productions in 2023, but did not experience any material impacts for the remainder of 2024.\nOther headwinds in the industry, such as continued pressures on linear distribution and continued softness in the U.S. linear advertising market, have had, and are expected to continue to have, a material impact on the operations and results of the Company, including a negative impact on the results of operations attributed to declines in linear advertising revenue. In addition, declines in linear subscribers are expected to continue. The increase of digital advertising available in the marketplace has also resulted in, and is expected to continue to result in, increased competition for advertising expenditures for both traditional linear networks and ad-supported tiers in streaming services.\nWe continue to closely monitor the ongoing impact of industry trends to our business; however, the full effects on our operations and results will depend on future developments, which are highly uncertain and cannot be predicted.\nDescription of Business\nWarner Bros. Discovery is a leading global media and entertainment company that creates and distributes a differentiated and comprehensive portfolio of content and products across television, film, streaming, interactive gaming, publishing, themed experiences, and consumer products through brands including: Discovery Channel, Max, CNN, DC Studios, TNT Sports, HBO, Food Network, TLC, TBS, Warner Bros. Motion Picture Group, Warner Bros. Television Group, Warner Bros. Games, Adult Swim, Turner Classic Movies, and others.\nWe are home to one of the largest collections of owned content in the world with assets and intellectual property across sports, news, lifestyle, and entertainment in most languages and regions of the globe. We create some of the best-in-class content using our renowned library, beloved franchises, and acclaimed creative expertise to serve our audiences and consumers. Our asset mix strongly positions us to execute our key strategies: grow our direct-to-consumer (“DTC”) business globally, enhance our Studios segment, and manage our linear networks for the best possible success in order to create long-term value for our shareholders.\nWe generate revenue from fees charged to distributors that carry our network brands and programming, including cable, direct-to-home (“DTH”) satellite, telecommunication and digital service providers, as well as through DTC subscription services (distribution revenue); the sale of advertising on our networks and digital platforms (advertising revenue); the release of feature films for initial exhibition in theaters, the licensing of feature films and television programs to various television, subscription video on demand (“SVOD”) and other digital markets, distribution of feature films and television programs in the physical and digital home entertainment markets, sales of console games and mobile in-game content, sublicensing of sports rights, and licensing of intellectual property such as characters and brands (content revenue); and other sources such as studio tours and production services (other revenue).\nCorporate Reorganization\nOn December 12, 2024, the Company announced that its board of directors had authorized the Company to implement a new corporate structure designed to enhance the Company’s strategic flexibility and create potential opportunities to unlock shareholder value. Under the new corporate structure, the Company will serve as the parent company for two distinct operating divisions: Global Linear Networks and Streaming & Studios. To facilitate the implementation of this new structure and the movement of entities and assets to align with the new operating divisions, on January 1, 2025, the Company completed certain transactions, including (1) a merger of Discovery Holding Company with and into a newly formed subsidiary of WarnerMedia Holdings, Inc. (the “DHC Merger”) and (2) a merger of a second newly formed subsidiary of WarnerMedia Holdings, Inc. with and into Scripps Networks Interactive, Inc. (the “Scripps Merger”). As a result of the DHC Merger, Discovery Communications, LLC became an indirect subsidiary of WarnerMedia Holdings, Inc. As a result of the Scripps Merger, Scripps Networks Interactive, Inc. became a direct subsidiary of WarnerMedia Holdings, Inc.\nAs of December 31, 2024, we classified our operations in three reportable segments:\n- Our Studios segment primarily consists of the production and release of feature films for initial exhibition in theaters, production and initial licensing of television programs to our networks/DTC services as well as third parties, distribution of our films and television programs to various third party and internal television and streaming services, distribution through the home entertainment market (physical and digital), related consumer products and themed experience licensing, and interactive gaming.\n- Our Networks segment primarily consists of our domestic and international television networks.\nDTC\n- Our DTC segment primarily consists of our premium pay-TV and streaming services.\nWBD’s Studios business includes the Warner Bros. Motion Picture Group (“WBMPG”), DC Studios, Warner Bros. Television Group (“WBTVG”), Consumer Products, Themed Entertainment and Brand Licensing, DC Comics Publishing, Content Licensing, Home Entertainment, Studio Operations, and Interactive Gaming.\nWBMPG is comprised of\nWarner Bros. Pictures, New Line Cinema, and Warner Bros. Pictures Animation\n. WBMPG partners with captivating storytellers to create filmed entertainment for a global audience.\ntasked with developing properties licensed from DC Comics for film, television, animation, and games, continues the tradition of high-quality storytelling within the DC Universe, while building a sustainable growth business out of the iconic characters.\nWarner Bros. Television,\nthe Company’s flagship television production unit for live-action scripted programming, as well as\nWarner Bros. Unscripted Television\n, which produces unscripted and alternative programming through its four production units –\nWarner Horizon Unscripted Television, Telepictures\nWarner Bros. International Television Production,\n. WBTVG also includes\nWarner Bros. Animation, Cartoon Network Studios,\nHanna-Barbera Studios Europe\nAmong the Studios segment’s content highlights for 2024 were\nDune: Part Two, Beetlejuice, Beetlejuice\nGodzilla x Kong: The New Empire\non the film side, with Warner Bros. Discovery becoming the first studio to cross the $1 billion mark at the worldwide box office that year. Award-winning TV titles for 2024 include\nAs of December 31, 2024, the new series\nremains one of the most-watched debut seasons globally of any current HBO or Max show, behind only\nBeyond its production operations, the Studios segment includes various businesses that facilitate consumer interaction with the intellectual property it creates.\nGlobal Consumer Products, Themed Entertainment and Brand Licensing,\nand world-renowned comic and publishing powerhouse\nall drive opportunities for consumers to engage with WBD’s leading entertainment brands and franchises.\nGlobal distribution of most of WBD’s content is handled by\n, which provides content for viewers across streaming, cable, satellite and broadcast networks, local television stations, and airlines.\nWarner Bros. Home Entertainment\noversees the global distribution of content through physical goods (Blu-ray Disc™ and DVD) and digital media in the form of electronic sell-through and video-on-demand via cable, satellite, online, and mobile channels.\nThe Studios segment also includes\n, a worldwide publisher, developer, licensor, and distributor of content for the interactive space across all platforms, including console, handheld, mobile, and PC-based gaming for both internal and third-party game titles.\nIn September 2024, WBD announced a new global structure for the Company’s worldwide studio tours, retail destinations, touring exhibitions, and all location-based experiences.\nWBD Global Experiences\nbrings together the previous Global Themed Entertainment licensing group and the Studio Tours & Retail owned and operated group into a single worldwide division to develop and execute on global strategies that offer partners a mix of both group models, putting WBD in a position to drive growth and become a worldwide leader in the creation, development, licensing, and operation of location-based entertainment inspired by\n, Discovery and more.\nFor the year ended December 31, 2024, content and other revenues were 92%\n\nCNN\n, our global news brand, launched\nin Europe on Max, giving audiences the ability to access a combination of on-air CNN content and exclusive programming on WBD’s streaming service in Spain, Nordics, Belgium, Netherlands, and Central and Eastern Europe.\nis a global leader in the delivery of premium sports content. The TNT Sports U.S. portfolio includes expansive, multi-platform partnerships with the National Basketball Association (“NBA”), Major League Baseball, the National Collegiate Athletic Association (“NCAA”) Division I Men’s Basketball Championship, National Hockey League, United States Soccer Federation, Unrivaled, National Association for Stock Car Auto Racing, Roland-Garros, NCAA Big 12 Football and Men’s Basketball, and NCAA Big East Men’s and Women’s Basketball. Additionally, TNT Sports co-manages NCAA.com and NCAA March Madness Live, along with NBA Digital including NBA TV, the NBA App and NBA.com. Bleacher Report and House of Highlights, digital destinations for young adult sports fans, are owned and operated by TNT Sports. In March 2024, TNT Sports also premiered a primetime sports programming block on truTV consisting of live sports, original sports shows, and ancillary sports content.\nTNT Sports in the United Kingdom and Ireland includes live coverage of Australian Open and Roland-Garros tennis; Grand Tour cycling; the Union Cycliste Internationale Mountain Bike World Series; World Championship and World Cup winter sports events; British and World Superbikes; snooker; Olympic Games 2026-2032; Premier League; Union of European Football Associations club football; Premiership men’s and women’s rugby; MotoGP; international cricket; Ultimate Fighting Championship and boxing, which are all available on TNT Sports and its streaming home, discovery+.\nTNT Sports’ owned-and-operated platforms include\n, Golf Digest, and a full suite of digital and social brands.\nFor the year ended December 31, 2024, distribution, advertising, content, and other revenues were 53%, 36%, 9%, and 2%, respectively, of total revenues for this segment.\nDTC\nWBD’s DTC business includes our streaming services, such as\n, and premium pay-TV services, such as\nHBO.\nOur streaming services are available on most mobile and connected TV devices. As of December 31, 2024, we had 116.9 million DTC subscribers\n. Our strong subscriber growth this year has",
  "item7_clean": "Cash and cash equivalents\nRevolving credit facility and commercial paper program\nInterest on senior notes is paid annually, semi-annually, or quarterly. Our senior notes outstanding as of December 31, 2024 had interest rates that ranged from 1.90% to 8.30% and will mature between 2025 and 2062.\nWe expect that our cash balance, cash generated from operations, and availability under the Credit Agreement will be sufficient to fund our cash needs for both the short-term and the long-term. Our borrowing costs and access to capital markets can be affected by short and long-term debt ratings assigned by independent rating agencies which are based, in part, on our performance as measured by credit metrics such as interest coverage and leverage ratios. Credit rating agencies may continue to review and adjust our ratings or outlook. For example, in 2024, S&P and Moody’s revised our ratings outlook from stable to negative in part due to declines in our linear business, including as a result of the weak operating environment for linear networks, and our leverage ratio.\nThe 2017 Tax Cuts and Jobs Act features a participation exemption regime with current taxation of certain foreign income and imposed a mandatory repatriation toll tax on unremitted foreign earnings. Notwithstanding the U.S. taxation of these amounts, we intend to continue to reinvest some of these funds outside of the U.S. Our current plans do not demonstrate a need to repatriate them to the U.S. However, if these funds were to be needed in the U.S., we would be required to accrue and pay non-U.S. taxes to repatriate them. The determination of the amount of unrecognized deferred income tax liability with respect to these undistributed foreign earnings is not practicable.\nMATERIAL CASH REQUIREMENTS FROM KNOWN CONTRACTUAL AND OTHER OBLIGATIONS\nAs of December 31, 2024, our significant contractual and other obligations were as follows (in millions).\nPurchase obligations:\nFinance lease obligations\nOperating lease obligations\nPension and other employee obligations\nPrincipal payments on long-term debt reflect the repayment of our outstanding senior notes, at face value, assuming repayment will occur upon maturity. Interest payments on our outstanding senior notes are projected based on their contractual interest rates and maturity dates.\nAdditionally, we have a multicurrency revolving Credit Agreement and have the capacity to borrow up to $6.0 billion under the Credit Facility. We may also request additional commitments up to $1.0 billion from the lenders upon the satisfaction of certain conditions. Additionally, our commercial paper program is supported by the Credit Facility. Under the commercial paper program, we may issue up to $1.0 billion. Borrowing capacity under the Credit Facility is effectively reduced by any outstanding borrowings under the commercial paper program. As of December 31, 2024, we had no outstanding borrowings under the Credit Facility or the commercial paper program. (See Note 11 to the accompanying consolidated financial statements.)\nPurchase Obligations\nContent purchase obligations include commitments associated with third-party producers and sports associations for content that airs on our television networks and DTC services. Production and licensing contracts generally require the purchase of a specified number of episodes and payments during production or over the term of a license, and include both programs that have been delivered and are available for airing and programs that have not yet been produced or sporting events that have not yet taken place. If the content is ultimately never produced, our commitments expire without obligation. We expect to enter into additional production contracts and content licenses to meet our future content needs.\nOther purchase obligations include agreements with certain vendors and suppliers for the purchase of goods and services whereby the underlying agreements are enforceable, legally binding and specify all significant terms. Significant purchase obligations include transmission services, television rating services, marketing commitments and research, equipment purchases, and information technology and other services. Some of these contracts do not require the purchase of fixed or minimum quantities and generally may be terminated with a 30-day to 60-day advance notice without penalty, and are not included in the table above past the 30-day to 60-day advance notice period. Other purchase obligations also include future funding commitments to equity method investees. Although the Company had funding commitments to equity method investees as of December 31, 2024, the Company may also provide uncommitted additional funding to its equity method investments in the future. (See Note 10 to the accompanying consolidated financial statements.)\nContent and other purchase obligations presented above exclude liabilities recognized on our consolidated balance sheets.\nFinance Lease Obligations\nWe acquire satellite transponders and other equipment through multi-year finance lease arrangements. Principal payments on finance lease obligations reflect amounts due under our finance lease agreements. Interest payments on our outstanding finance lease obligations are based on the stated or implied rate in our finance lease agreements. (See Note 12 to the accompanying consolidated financial statements.)\nOperating Lease Obligations\nWe obtain office space and equipment under multi-year lease arrangements. Most operating leases are not cancelable prior to their expiration. Payments for operating leases represent the amounts due under the agreements assuming the agreements are not canceled prior to their expiration. (See Note 12 to the accompanying consolidated financial statements.)\nPension and Other Employee Obligations\nThe Company participates in and/or sponsors a qualified defined benefit pension plan that covers certain U.S. based employees and several U.S. and non-U.S. nonqualified defined benefit pension plans that are noncontributory (“Pension Plans”). The Company’s Pension Plans consist of both funded and unfunded plans. (See Note 17 to the accompanying consolidated financial statements.)\nContractual commitments include payments to meet minimum funding requirements of our Pension Plans in 2025 and estimated benefit payments. Benefit payments have been estimated over a ten-year period. While benefit payments under the Pension Plans are expected to continue beyond 2034, we believe it is not practicable to estimate payments beyond this period.\nOther employee obligations are primarily related to employment agreements with creative talent for certain broadcast networks.\nWe are unable to reasonably predict the ultimate amount of any payments due to cash-settled share-based compensation awards. As of December 31, 2024, the current portion of the liability for cash-settled share-based compensation awards was $27 million.\nUnrecognized Tax Benefits\nAlthough we can reasonably estimate the total amount of unrecognized tax benefits related to certain of the Company’s uncertain tax positions that may decrease over the next twelve months, we are unable to reasonably predict the ultimate amount and timing of cash settlement with the respective taxing authorities.\nIn connection with the WarnerMedia Business’ former investment in the Six Flags (as defined below) theme parks located in Georgia and Texas (collectively, the “Parks”), in 1997, certain subsidiaries of the Company agreed to guarantee (the “Six Flags Guarantee”) certain obligations of the partnerships that hold the Parks (the “Partnerships”) for the benefit of the limited partners in such Partnerships, including annual payments made to the Parks or to the limited partners and additional obligations at the end of the respective terms for the Partnerships in 2027 and 2028 (the “Guaranteed Obligations”). Six Flags Entertainment Corporation (formerly known as Six Flags, Inc. and Premier Parks Inc.) (“Six Flags”), which has the controlling interest in the Parks, has agreed, pursuant to a subordinated indemnity agreement (the “Subordinated Indemnity Agreement”), to guarantee the performance of the Guaranteed Obligations when due and to indemnify the Company, among others, if the Six Flags Guarantee is called upon. If Six Flags defaults on its indemnification obligations, the Company has the right to acquire control of the managing partner of the Parks. Six Flags’ obligations to the Company are further secured by its interest in all limited partnership units held by Six Flags.\nIn December 2024, Six Flags provided notice of its exercise of the option related to the theme parks located in Georgia that requires the redemption of all the limited partnership units that Six Flags does not then own in the Georgia Partnership in January 2027. Pursuant to the exercise of the option, all of such outstanding limited partnership interests will be redeemed, and Six Flags will also acquire certain related entity general partnership and managing member interests.\nBased on the Company’s evaluation of the current facts and circumstances surrounding the Guaranteed Obligations and the Subordinated Indemnity Agreement, it is unable to predict the loss, if any, that may be incurred under the Guaranteed Obligations, and no liability for the arrangements has been recognized as of December 31, 2024. Because of the specific circumstances surrounding the arrangements and the fact that no active or observable market exists for this type of financial guarantee, the Company is unable to determine a current fair value for the Guaranteed Obligations and related Subordinated Indemnity Agreement. The aggregate gross undiscounted estimated future cash flow requirements covered by the Six Flags Guarantee over the remaining term (through 2028) are $589 million. To date, no payments have been made by the Company pursuant to the Six Flags Guarantee.\nOther Contingent Commitments\nOther contingent commitments primarily include contingent payments for post-production term advance obligations on a certain co-financing arrangement, as well as operating lease commitment guarantees, letters of credit, bank guarantees, and surety bonds, which generally support performance and payments for a wide range of global contingent and firm obligations, including insurance, litigation appeals, real estate leases, and other operational needs. Our other contingent commitments at December 31, 2024 were immaterial.\nWe have granted put rights to certain consolidated subsidiaries, but we are unable to reasonably predict the ultimate amount or timing of any payment. We recorded the carrying value of the noncontrolling interest in the equity associated with the put rights as a component of redeemable noncontrolling interest in the amount of $109 million. (See Note 19 to the accompanying consolidated financial statements.)\nNoncontrolling Interest\nThe Food Network and Cooking Channel are operated and organized under the terms of the TV Food Network Partnership (the “Partnership”). We hold interests in the Partnership, along with another noncontrolling owner. The Partnership agreement specifies a dissolution date of December 31, 2025. If the term of the Partnership is not extended prior to that date, the Partnership agreement permits us, as holder of 80% of the applicable votes, to reconstitute the Partnership and continue its business. If for some reason the Partnership is not continued, it will be required to limit its activities to winding up, settling debts, liquidating assets and distributing proceeds to the partners in proportion to their partnership interests.\nSummarized Guarantor Financial Information\nBasis of Presentation\nAs of December 31, 2024, the Company has outstanding senior notes issued by Discovery Communications, LLC (“DCL”), which are guaranteed by the Company, Scripps Networks Interactive, Inc. (“Scripps Networks”), and WarnerMedia Holdings, Inc. (“WMH”); senior notes issued by WMH, which are guaranteed by the Company, Scripps Networks, and DCL; senior notes issued by the legacy WarnerMedia Business (not guaranteed); and senior notes issued by Scripps Networks (not guaranteed). (See Note 11 to the accompanying consolidated financial statements.) DCL, Scripps Networks, and WMH are wholly owned by the Company.\nThe tables below present the summarized financial information as combined for Warner Bros. Discovery, Inc. (the “Parent”), Scripps Networks, DCL, and WMH (collectively, the “Obligors”). All guarantees of DCL and WMH’s senior notes (the “Note Guarantees”) are full and unconditional, joint and several and unsecured, and cover all payment obligations arising under the senior notes.\nNote Guarantees issued by Scripps Networks, DCL or WMH, or any subsidiary of the Parent that in the future issues a Note Guarantee (each, a “Subsidiary Guarantor”) may be released and discharged (i) concurrently with any direct or indirect sale or disposition of such Subsidiary Guarantor or any interest therein, (ii) at any time that such Subsidiary Guarantor is released from all of its obligations under its guarantee of payment, (iii) upon the merger or consolidation of any Subsidiary Guarantor with and into DCL, WMH or the Parent or another Subsidiary Guarantor, as applicable, or upon the liquidation of such Subsidiary Guarantor and (iv) other customary events constituting a discharge of the Obligors’ obligations.\nSummarized Financial Information\nThe Company has included the accompanying summarized combined financial information of the Obligors after the elimination of intercompany transactions and balances among the Obligors and the elimination of equity in earnings from and investments in any subsidiary of the Parent that is a non-guarantor (in millions).\nNon-guarantor intercompany trade receivables, net\nNoncurrent liabilities\nYear Ended December 31, 2024\nNet loss available to Warner Bros. Discovery, Inc.\nRELATED PARTY TRANSACTIONS\nNEW ACCOUNTING AND REPORTING PRONOUNCEMENTS\nCRITICAL ACCOUNTING ESTIMATES\nOur consolidated financial statements are prepared in accordance with U.S. GAAP, which requires management to make estimates, judgments and assumptions that affect the reported amounts of assets, liabilities, revenues and expenses and related disclosure of contingent assets and liabilities.\nOn an ongoing basis, we evaluate our estimates and assumptions, including those related to unrecognized tax benefits, goodwill and intangible assets, content rights, consolidation and revenue recognition. We base our estimates on historical experience, current developments and on various other assumptions that we believe to be reasonable under these circumstances, the results of which form the basis for making judgments about carrying values of assets and liabilities that cannot readily be determined from other sources. There can be no assurance that actual results will not differ from those estimates.\nManagement considers an accounting estimate to be critical if it required assumptions to be made that were uncertain at the time the estimate was made and changes in the estimate or different estimates could have a material effect on our results of operations.\nThe development and selection of these critical accounting estimates have been determined by management and the related disclosures have been reviewed with the Audit Committee of the board of directors of the Company. We believe the following accounting estimates are critical to our business operations and the understanding of our results of operations and involve the more significant judgments and estimates used in the preparation of our consolidated financial statements.\nUncertain Tax Positions\nWe are subject to income taxes in numerous U.S. and foreign jurisdictions. From time to time, we engage in transactions or take filing positions in which the tax consequences may be uncertain and may recognize tax liabilities based on estimates of whether additional taxes and interest wi",
  "item2_clean": null
}