{
  "source_file": "wbd-20250930.htm",
  "form_type": "10-Q",
  "item1_clean": null,
  "item7_clean": null,
  "item2_clean": "Cash and cash equivalents\nRevolving credit facility and commercial paper program\nInterest on the senior notes is paid annually or semi-annually. Our senior notes outstanding as of September 30, 2025 had interest rates that ranged from 1.90% to 8.30% and will mature between 2026 and 2062.\nWe expect that our cash balance, cash generated from operations and availability under the Credit Agreement will be sufficient to fund our cash needs for both the short- and long-term. We expect to refinance the Bridge Loan Facility prior to the Separation or in connection with the pursuit of a strategic alternative, though we may be unable to do so on favorable terms in a timely manner or at all. Additionally, our borrowing costs and access to capital markets can be affected by short and long-term debt ratings assigned by independent rating agencies which are based, in part, on our performance as measured by credit metrics such as interest coverage and leverage ratios. Credit rating agencies may continue to review and adjust our ratings or outlook. For example, in 2025, S&P, Moody’s and Fitch downgraded certain of our ratings in part due to declines in our linear business, including as a result of the weak operating environment for linear networks, our leverage ratio, and an increase in secured debt and uncertainty in connection with the Separation.\nThe 2017 Tax Cuts and Jobs Act features a participation exemption regime with current taxation of certain foreign income and imposes a mandatory repatriation toll tax on unremitted foreign earnings. Notwithstanding the U.S. taxation of these amounts, we intend to continue to reinvest some of these funds outside of the U.S. Our current plans do not demonstrate a need to repatriate to the U.S. However, if these funds were to be needed in the U.S., we would be required to accrue and pay non-U.S. taxes to repatriate them. The determination of the amount of unrecognized deferred income tax liability with respect to these undistributed foreign earnings is not practicable.\nSummarized Guarantor Financial Information\nBasis of Presentation\nAs of September 30, 2025 and December 31, 2024, the Company has outstanding senior notes issued by DCL, which are guaranteed by the Company, Scripps Networks, and DGH; senior notes issued by DGH, which are guaranteed by the Company, Scripps Networks, and DCL; senior notes issued by the legacy WarnerMedia Business (not guaranteed); and as of December 31, 2024, senior notes issued by Scripps Networks (not guaranteed). (See Note 8 to the accompanying consolidated financial statements.) DCL, Scripps Networks, and DGH are wholly owned by the Company.\nThe tables below present the summarized financial information as combined for Warner Bros. Discovery, Inc. (the “Parent”), Scripps Networks, DCL, and DGH (collectively, the “Obligors”). All guarantees of DCL and DGH’s senior notes (the “Note Guarantees”) are full and unconditional, joint and several and unsecured, and cover all payment obligations arising under the senior notes.\nNote Guarantees issued by Scripps Networks, DCL or DGH, or any subsidiary of the Parent that in the future issues a Note Guarantee (each, a “Subsidiary Guarantor”) may be released and discharged (i) concurrently with any direct or indirect sale or disposition of such Subsidiary Guarantor or any interest therein, (ii) at any time that such Subsidiary Guarantor is released from all of its obligations under its guarantee of payment, (iii) upon the merger or consolidation of any Subsidiary Guarantor with and into DCL, DGH or the Parent or another Subsidiary Guarantor, as applicable, or upon the liquidation of such Subsidiary Guarantor and (iv) other customary events constituting a discharge of the Obligors’ obligations.\nSummarized Financial Information\nThe Company has included the accompanying summarized combined financial information of the Obligors after the elimination of intercompany transactions and balances among the Obligors and the elimination of equity in earnings from and investments in any subsidiary of the Parent that is a non-guarantor (in millions).\nNon-guarantor intercompany trade receivables, net\nNoncurrent liabilities\nNine Months Ended September 30, 2025\nNet income available to Warner Bros. Discovery, Inc.\nMATERIAL CASH REQUIREMENTS FROM KNOWN CONTRACTUAL AND OTHER OBLIGATIONS\nRELATED PARTY TRANSACTIONS\nIn the ordinary course of business, we enter into transactions with related parties, such as our equity method investees, entities that share common directorship, or minority partners of consolidated subsidiaries. (See Note 14 to the accompanying consolidated financial statements.)\nCRITICAL ACCOUNTING ESTIMATES\nNEW ACCOUNTING AND REPORTING PRONOUNCEMENTS\nCertain new accounting and reporting standards will be effective for us during the year ended December 31, 2025. (See Note 1 to the accompanying consolidated financial statements.)\nSupplemental Data for Results of Operations\nThe following table presents supplemental consolidating data for our Streaming & Studios division, Global Linear Networks reportable segment, Corporate, and consolidating adjustments.\nRepresents the consolidated results of operations of the Company and its subsidiaries.\nStreaming & Studios -\nRepresents the results of our Streaming & Studios division, which includes our Streaming and Studios reportable segments and eliminations between those two reportable segments.\nGlobal Linear Networks -\nRepresents the results of our Global Linear Networks reportable segment.\nRepresents the results of our Corporate functions.\nConsolidating adjustments -\nRepresents eliminations between the Streaming & Studios division and the Global Linear Networks reportable segment, as well as other Corporate eliminations.\nSupplemental Data for Results of Operations (in millions)\nSupplemental Consolidating Data\nGlobal Linear Networks\nConsolidating adjustments\nFor the three months ended September 30,\nCosts of revenues, excluding depreciation and amortization\nSelling, general and administrative\nDepreciation and amortization\nRestructuring and other charges\nImpairments and loss on dispositions\nTotal costs and expenses\nOperating income (loss)\nSupplemental Data for Results of Operations (in millions)\nSupplemental Consolidating Data\nGlobal Linear Networks\nConsolidating adjustments\nFor the nine months ended September 30,\nCosts of revenues, excluding depreciation and amortization\nSelling, general and administrative\nDepreciation and amortization\nRestructuring and other charges\nImpairments and loss on dispositions\nTotal costs and expenses\nOperating income (loss)\nCAUTIONARY NOTE CONCERNING FORWARD-LOOKING STATEMENTS\nthe occurrence of any event, change or other circumstances that could give rise to the abandonment of the Separation or pursuit of a different structure or strategic alternative;\nfailure to satisfy in a timely manner any of the conditions to the Separation or complete the Separation in a timely or favorable manner or at all, including as a result of the Company’s review of strategic alternatives;\nthe effects of the announcement, pendency or completion of the Separation or the Company’s review of strategic alternatives on our ongoing business operations;\nthe duration and outcome of the Company’s review of strategic alternatives, including whether the Company will be able to identify or pursue any strategic alternative to the Separation;\nunforeseen costs, execution risks, and operational challenges related to the Separation and review of strategic alternatives, including risks relating to changes to the configuration of our existing business and disruption of management time away from ongoing business operations;\nmore intense competitive pressure from existing or new competitors in the industries in which we operate;\nreduced spending on domestic and foreign television advertising, due to macroeconomic conditions, industry or consumer behavior trends or unexpected reductions in our number of subscribers;\nthe imposition of tariffs, including tariffs directly or indirectly applicable to our industry, by the U.S. government and any retaliatory tariffs from foreign governments;\nuncertainties associated with product and service development and market acceptance, including the development and provision of programming for new television and telecommunications technologies, and the success of our streaming services;\nmarket demand for foreign first-run and existing content libraries;\nnegative publicity or damage to our brands, reputation or talent;\nrealizing streaming subscriber goals;\ndisagreements with our distributors or other business partners;\ncontinued consolidation of distribution customers and production studios;\nindustry trends, including the timing of, and spending on, sports programming, feature film, television and television commercial production;\nthe possibility or duration of an industry-wide strike, such as the strikes of the Writers Guild of America and Screen Actors Guild of America-American Federation of Television and Radio Arts in 2023, player lock-outs or other job action affecting a major entertainment industry union, athletes or others involved in the development and production of our sports programming, television programming, feature films and interactive entertainment (e.g., games) who are covered by collective bargaining agreements;\ninherent uncertainties involved in the estimates and assumptions used in the preparation of financial forecasts;\nour level of debt, including the significant indebtedness incurred in connection with the acquisition of the WarnerMedia Business, and our future compliance with debt covenants;\nchallenges related to refinancing the Bridge Loan Facility on favorable terms in a timely manner or at all;\nchanges to our corporate or debt-specific credit ratings or outlook;\nchanges in, or failure or inability to comply with, laws and government regulations, including, without limitation, regulations of the U.S. government and other international governm"
}