{
  "source_file": "wday-20251031.htm",
  "form_type": "10-Q",
  "item1_clean": null,
  "item7_clean": null,
  "item2_clean": "Share-based compensation expense\nEmployer payroll tax-related items on employee stock transactions\nAmortization of acquisition-related intangible assets\nAcquisition-related costs\nNon-GAAP operating income\nShare-based compensation expense\nEmployer payroll tax-related items on employee stock transactions\nAmortization of acquisition-related intangible assets\nAcquisition-related costs\nNon-GAAP operating margin\nFor the nine months ended October 31, 2025, the Share-based compensation expense and Employer payroll tax-related items on employee stock transactions lines in the GAAP to non-GAAP reconciliation tables above exclude $42 million and $2 million, respectively, related to the Fiscal 2026 Restructuring Plan. These expenses are included in the Restructuring costs lines.\nOther income, net was as follows (in millions):\nThree Months Ended October 31,\nNine Months Ended October 31,\nTotal other income, net\nOther income, net increased by $17 million and $20 million for the three and nine months ended October 31, 2025, respectively, compared to the prior year periods. The increase was primarily due to realized gains from debt securities sold in the current quarter to fund acquisition activities and share repurchases.\nProvision For Income Taxes\nThe provision for income taxes was as follows (in millions):\nThree Months Ended October 31,\nNine Months Ended October 31,\nProvision for income taxes\nThe income tax provision for the nine months ended October 31, 2025, was primarily attributable to earnings in the U.S. and profitable foreign jurisdictions.\nThe income tax provision for the nine months ended October 31, 2024, was primarily attributable to earnings in the U.S. and profitable foreign jurisdictions, offset by the excess tax benefit from share-based compensation and increase in research and development credits.\nOn July 4, 2025, the One Big Beautiful Bill Act (“The 2025 Tax Act”) was signed into law. The 2025 Tax Act makes permanent key elements of the Tax Cuts and Jobs Act, including 100% bonus depreciation, domestic research cost expensing, and modifications to the international tax framework. The 2025 Tax Act did not have a material impact on our annual effective tax rate and is expected to reduce our domestic cash tax outflows for the remainder of fiscal 2026. Due to the complexity and various upcoming effective dates of the 2025 Tax Act, we are still in the process of assessing its impact on our condensed consolidated financial statements. The final impact may differ from our current estimates based on further analysis, regulatory guidance, and any legislative changes.\nThe Organization for Economic Cooperation and Development (“OECD”) released Pillar Two model rules defining a 15% global minimum tax for large multinational corporations. The OECD continues to release additional guidance and countries are implementing legislation, with widespread adoption of the Pillar Two Framework expected in the near future. Pillar Two rules are at varying stages of adoption across the jurisdictions where we operate. The specific rules and timeline to implement these rules vary by jurisdiction. The adoption of Pillar Two rules may affect our effective tax rate and current tax obligations and liabilities. While we do not currently anticipate Pillar Two rules to have a material impact on our consolidated financial results, we are monitoring developments from the OECD, governmental bodies, such as the EU, and intergovernmental economic organizations, to evaluate the impact of changing global tax laws.\nFor further information, see\nNote 17, Income Taxes\n, of the Notes to Condensed Consolidated Financial Statements included in Part I, Item 1 of this report.\nLiquidity and Capital Resources\nAs of October 31, 2025, our principal sources of liquidity were cash, cash equivalents, and marketable securities totaling $6.8 billion, which were primarily held for working capital and general corporate purposes. Our cash equivalents and marketable securities are primarily composed of, in order from largest to smallest, money market funds, corporate bonds, U.S. treasury securities, U.S. agency obligations, asset-backed securities, supranational securities, and commercial paper. We have financed our operations primarily through customer payments, issuance of debt, and sales of our common stock.\nWe believe our existing cash, cash equivalents, marketable securities, cash provided by operating activities, unbilled amounts related to the remaining term of contracted noncancelable subscription agreements, which are not reflected on the Condensed Consolidated Balance Sheets, and, if necessary, our borrowing capacity under our 2022 Credit Agreement that provides for $1.0 billion of unsecured financing, are sufficient to meet our working capital, capital expenditure, planned acquisition, share repurchase, and debt repayment needs over the next 12 months and beyond.\nOur long-term future capital requirements depend on many factors, including the effects of macroeconomic trends, customer growth rates, subscription renewal activity, headcount growth, the timing and extent of development efforts, the expansion of sales and marketing activities, the introduction of new and enhanced services offerings, infrastructure development, and our investment and acquisition activities. As part of our strategy, we may choose to seek additional debt or equity financing, which may not be available on terms favorable to us or at all. Additionally, our cash provided by operating activities could be affected by various risks and uncertainties, including the “Risk Factors” included in Part II, Item 1A of this report.\nOur cash flows were as follows (in millions):\n\nCosts of subscription services\nCosts of professional services\nGeneral and administrative\nTotal costs and expenses\nTotal costs and expenses were $2.2 billion for the three months ended October 31, 2025, compared to $2.0 billion for the prior year period, an increase of $178 million, or 9%. The increase in total costs and expenses included increases of $44 million in facilities and IT-related expenses, $44 million in employee-related expenses, net of restructuring-related cost savings, $37 million in third-party hosted infrastructure expenses, $17 million related to marketing programs, $11 million in amortization of deferred sales commissions, and $9 million related to professional services.\nTotal costs and expenses were $6.5 billion for the nine months ended October 31, 2025, compared to $5.9 billion for the prior year period, an increase of $578 million, or 10%. Included in the increase in total costs and expenses was $163 million in restructuring expenses primarily related to the Fiscal 2026 Restructuring Plan. Additional increases included $131 million in employee-related expenses, net of restructuring-related cost savings, $108 million in third-party hosted infrastructure expenses, $96 million in facilities and IT-related expenses, $30 million in amortization of deferred sales commissions, $18 million related to marketing programs, and $17 million related to professional services.\nCosts of Subscription Services\nCosts of subscription services were $395 million for the three months ended October 31, 2025, compared to $329 million for the prior year period, an increase of $65 million, or 20%. The increase in costs of subscription services included increases of $32 million in third-party hosted infrastructure expenses, $20 million in employee-related expenses primarily due to delivering our enhanced customer support services, net of restructuring-related cost savings, and $10 million in facilities and IT-related expenses.\nCosts of subscription services were $1.1 billion for the nine months ended October 31, 2025, compared to $924 million for the prior year period, an increase of $191 million, or 21%. The increase in costs of subscription services included increases of $96 million in third-party hosted infrastructure expenses, $57 million in employee-related expenses primarily due to delivering our enhanced customer support services, net of restructuring-related cost savings, and $27 million in facilities and IT-related expenses.\nWe expect costs of subscription services will continue to increase in absolute dollars as we improve and expand our technical operations infrastructure, including third-party hosted infrastructure, and as we grow our enhanced customer support services.\nCosts of Professional Services\nCosts of professional services were $196 million for the three months ended October 31, 2025, compared to $201 million for the prior year period, a decrease of $4 million, or 2%. Costs of professional services remained relatively flat as a result of restructuring-related cost savings that reduced employee-related expenses.\nCosts of professional services were $595 million for the nine months ended October 31, 2025, compared to $606 million for the prior year period, a decrease of $11 million, or 2%. The decrease in costs of professional services included a reduction of $15 million in subcontractor expenses. Employee-related expenses remained relatively flat as a result of restructuring-related cost savings.\nWe expect costs of professional services as a percentage of total revenues to continue to decline as we expand and leverage our service partners to deploy our applications and focus on growing our subscription revenues.\nProduct development expenses were $666 million for the three months ended October 31, 2025, compared to $647 million for the prior year period, an increase of $19 million, or 3%. The increase in product development expenses included increases of $12 million in facilities and IT-related expenses and $10 million in employee-related expenses, net of restructuring-related cost savings.\nProduct development expenses were $2.0 billion for the nine months ended October 31, 2025, compared to $2.0 billion for the prior year period, an increase of $36 million, or 2%. The increase in product development expenses inclu"
}