{
  "source_file": "wdc-20251003.htm",
  "form_type": "10-Q",
  "item1_clean": null,
  "item7_clean": null,
  "item2_clean": "Net cash provided by (used in):\nOperating activities\nInvesting activities\nFinancing activities\nEffect of exchange rate changes on cash\nCash and cash equivalents reclassified to assets held for sale\nNet decrease in cash and cash equivalents\nWe currently expect our capital expenditures for 2026 to be approximately 4% to 6% of our net revenue.\nWe believe our cash and cash equivalents and our available 2027 Revolving Credit Facility (as defined below) will be sufficient to meet our working capital, debt, dividend and capital expenditure needs for at least the next twelve months and for the foreseeable future thereafter. We believe we can also access the various debt and equity capital markets to further supplement our liquidity position if necessary. Our ability to sustain our working capital position is subject to a number of risks that we discuss in Part II, Item 1A,\nA total of $1.23 billion and $0.98 billion of our cash and cash equivalents was held by our foreign subsidiaries as of October 3, 2025 and June 27, 2025, respectively. There are no material tax consequences that were not previously accrued for on the repatriation of this cash.\nOur cash equivalents are primarily invested in money market funds that invest in U.S. Treasury securities and U.S. Government agency securities. In addition, from time to time, we also invest directly in certificates of deposit, asset-backed securities and corporate and municipal notes and bonds.\nOperating Activities\nNet cash provided by operating activities primarily consists of net income, adjusted for non-cash charges, plus or minus changes in operating assets and liabilities. Net cash used for changes in operating assets and liabilities was $99 million for the three months ended October 3, 2025, compared to $753 million for the three months ended September 27, 2024. The year over year decrease largely reflects a $423 million improvement in timing and collection of accounts receivable, a $132 million improvement from accrued expenses resulting from a significant reduction in our derivative hedging activities since the Separation of the Flash business, and a $501 million improvement in other assets and liabilities driven by the timing of recognition and realization of income taxes receivable. These were partially offset by a $426 million increase in cash used driven by the timing of recognition and payment of income taxes.\nInvesting Activities\nNet cash used in investing activities for the three months ended October 3, 2025 primarily consisted of $73 million in capital expenditures, net of proceeds from disposals of assets. Net cash used in investing activities for the three months ended September 27, 2024 primarily consisted of $95 million in capital expenditures, net of proceeds from disposals of assets, partially offset by $47 million in net proceeds from activity related to Flash Ventures.\nFinancing Activities\nNet cash used in financing activities for the three months ended October 3, 2025 primarily consisted of $553 million for share repurchases, $39 million for dividends on our common stock and Preferred Shares, $55 million for taxes paid on vested stock awards under employee stock plans and $31 million for scheduled repayments on our term loan. Net cash used in financing activities for the three months ended September 27, 2024 primarily consisted of $64 million for taxes paid on vested stock awards under employee stock plans and $38 million for scheduled repayments on our term loan. During the three months ended September 27, 2024, we also drew and repaid $150 million under our 2027 Revolving Credit Facility.\nOff-Balance Sheet Arrangements\nOther than certain indemnification provisions (see “Short- and Long-term Liquidity –\nPurchase Obligations and Other Commitments\n” below), we do not have any other material off-balance sheet financing arrangements or liabilities, guarantee contracts, retained or contingent interests in transferred assets, or any other obligation arising out of a material variable interest in an unconsolidated entity. We do not have any majority-owned subsidiaries that are not included in the Condensed Consolidated Financial Statements. Additionally, we do not have an interest in, or relationships with, any variable interest entities.\nShort- and Long-term Liquidity\nMaterial Cash Requirements\nThe following is a summary of our known material cash requirements as of October 3, 2025. In addition, see the discussions further below related to liability for unrecognized tax benefits, litigation matters, cash dividend program, dividend rights with respect to the Preferred Shares, global minimum tax, foreign exchange contracts and indemnifications.\n1 Year (Remaining Nine Months of 2026)\n2-3 Years (2027-2028)\n4-5 Years (2029-2030)\nMore than 5 Years (Beyond 2030)\nLong-term debt, including current portion\nPurchase obligations and other commitments\nPrincipal portion of debt, excluding issuance costs.\nLiability for Unrecognized Tax Benefits\nAs of October 3, 2025, the liability for unrecognized tax benefits (excluding accrued interest and penalties) was $598 million. Accrued interest and penalties related to unrecognized tax benefits are recognized in liabilities for uncertain tax positions and are recorded in the provision for income taxes. Accrued interest and penalties included in our liability related to unrecognized tax benefits as of October 3, 2025 was $93 million. Of these amounts, approximately $130 million could result in potential cash payments to be made within the next twelve months.\nFor additional information on our litigation matters, see Part I, Item 1, Note 14,\nCash Dividend Program\nOn April 29, 2025, our Board of Directors authorized the adoption of a cash dividend program. Under the cash dividend program, holders of our common stock will receive dividends when and as declared by our Board of Directors. During the three months ended October 3, 2025, we paid cash dividends of $0.10 per share of our outstanding common stock, totaling $34 million, plus $1 million paid to holders of our Preferred Shares in accordance with their participation rights.\nSubsequent to quarter-end, on October 29, 2025, our Board of Directors declared a cash dividend of $0.125 per share of our common stock, which will be paid on December 18, 2025 to our shareholders of record as of the close of business on December 4, 2025.\nWe may modify, suspend, or cancel our cash dividend program in any manner and at any time. The amount of future dividends under our cash dividend program, and the declaration and payment thereof, will be based upon all relevant factors, including our financial position, results of operations, cash flows, capital requirements and restrictions under our Loan Agreement and other financing agreements, and shall be in compliance with applicable law.\nAs of October 3, 2025, 235,000 shares of our Preferred Shares remained outstanding. These shares are entitled to cumulative preferred dividends and will also participate in any dividends declared for common shareholders on an as-converted equivalent basis. See Part II, Item 8, Note 12,\nShareholders’ Equity and Convertible Preferred Stock,\nShareholders’ Equity and Convertible Preferred Stock\nAs described in Part I, Item 1, Note 7,\nThe sale price conditional conversion feature of the 2028 Convertible Notes was triggered during the calendar quarter ended September 30, 2025 and, accordingly, the holders of the 2028 Convertible Notes have the right to convert the notes during the succeeding calendar quarter ending December 31, 2025. As a result, the 2028 Convertible Notes have been classified as Current portion of long-term debt in the Condensed Consolidated Financial Statements as of October 3, 2025. The Company will continue to evaluate the conversion feature quarterly to determine if the 2028 Convertible Notes become convertible in future periods.\nIn addition to our outstanding debt, as of October 3, 2025, we had $1.25 billion available for borrowing under our revolving credit facility maturing in January 2027 (the “2027 Revolving Credit Facility”), subject to customary conditions under the Loan Agreement. The agreements governing our credit facilities each include limits on secured indebtedness and certain types of unsecured subsidiary indebtedness and require us and certain of our subsidiaries to provide guarantees and collateral to the extent the conditions providing for such guarantees and collateral are met. The Loan Agreement requires us to comply with a financial leverage ratio covenant. As of October 3, 2025, we were in compliance with the financial covenant. Additional information regarding our indebtedness, including information about availability under our 2027 Revolving Credit Facility and the principal repayment terms, interest rates, covenants, collateral and other key terms of our outstanding indebtedness, is included in Part II, Item 8, Note 8,\nWe may issue additional debt securities in the future that may be guaranteed by our 100% owned domestic subsidiary, Western Digital Technologies, Inc. (“Guarantor” and, together with Western Digital Corporation, the “Obligor Group”). Such guarantees may be full and unconditional, joint and several, on a secured or unsecured, subordinated or unsubordinated basis, and may be subject to certain customary guarantor release conditions. We conduct operations almost entirely through our subsidiaries. Accordingly, the Obligor Group’s cash flow and ability to service any guaranteed registered debt securities will depend on the earnings of our subsidiaries and the distribution of those earnings to the Obligor Group, including the earnings of the non-guarantor subsidiaries, whether by dividends, loans or otherwise. Holders of such guaranteed registered debt securities would have a direct claim only against the Obligor Group.\nThe following tables include summarized financial information for the Obligor Group. The financial information for the Obligor Group is presented on c"
}