{
  "source_file": "wec-20241231.htm",
  "form_type": "10-K",
  "item1_clean": "ITEM 1. BUSINESS\nA. INTRODUCTION\nFor more information about our business operations, see Note 22, Segment Information, and Item 7. Management's Discussion and Analysis of Financial Condition and Results of Operations – Results of Operations. For information about our business strategy, see Item 7. Management's Discussion and Analysis of Financial Condition and Results of Operations – Corporate Developments.\nWEC Energy Group, Inc.\nWe were incorporated in the state of Wisconsin in 1981 and became a diversified holding company in 1986. We maintain our principal executive offices in Milwaukee, Wisconsin. On June 29, 2015, we acquired 100% of the outstanding common shares of Integrys and changed our name to WEC Energy Group, Inc. Our wholly owned subsidiaries provide or invest in regulated natural gas and electricity, and renewable energy, as well as nonregulated renewable energy. We have an approximately 60% equity interest in ATC (an electric transmission company operating in Illinois, Michigan, Minnesota, and Wisconsin). At December 31, 2024, we had six reportable segments, which are discussed below. For additional information about our reportable segments, see Note 22, Segment Information.\nAvailable Information\nInvestors should note that WEC Energy Group announces material financial information in SEC filings, press releases, and public conference calls. In accordance with SEC guidelines, WEC Energy Group also uses the \"Investors\" tab on its website, www.wecenergygroup.com, to communicate with investors. It is possible that the financial and other information posted there could be deemed material information. The information on WEC Energy Group's website is not part of this document.\nB. UTILITY ENERGY OPERATIONS\nThe Wisconsin segment includes the electric and natural gas utility operations of WE, WPS, WG, and UMERC.\nElectric Utility Operations\nOur electric utility operations include the operations of WE, WPS, and UMERC.\nWE generates and distributes electric energy to customers located in southeastern Wisconsin (including the metropolitan Milwaukee area), east central Wisconsin, and northern Wisconsin.\nWPS generates and distributes electric energy to customers located in northeastern and central Wisconsin.\nWEC Energy Group, Inc.\nUMERC generates and distributes electric energy to customers, including one iron ore mine owned by Tilden, located in the Upper Peninsula of Michigan.\nFor information about our operating revenues disaggregated by customer class for the years ended December 31, 2024, 2023, and 2022, see Note 1(d), Operating Revenues, and Note 4, Operating Revenues.\nOur electric energy deliveries included supply and distribution sales to retail, wholesale, and resale customers, and distribution sales to those customers who switched to an alternative electric supplier in the Upper Peninsula of Michigan. In 2024, retail revenues accounted for 93.4% of total electric operating revenues, wholesale revenues accounted for 2.1% of total electric operating revenues, and resale revenues accounted for 3.6% of total electric operating revenues. See Item 7. Management's Discussion and Analysis of Financial Condition and Results of Operations – Results of Operations – Wisconsin Segment Contribution to Net Income Attributed to Common Shareholders for information on MWh sales by customer class.\nOur electric utilities are authorized to provide retail electric service in designated territories in the state of Wisconsin, as established by indeterminate permits and boundary agreements with other utilities, and in certain territories in the state of Michigan pursuant to franchises granted by municipalities.\nWe provide wholesale electric service to various customers, including electric cooperatives, municipal joint action agencies, other investor-owned utilities, municipal utilities, and energy marketers.\nThe majority of our sales for resale are sold into an energy market operated by MISO at market rates based on the availability of our generation and market demand. Retail fuel costs are reduced by the amount that revenue exceeds the cost of sales derived from these opportunity sales.\nOur electric utilities buy and sell electric power by participating in the MISO Energy Markets. The cost of our individual generation offered into the MISO Energy Markets compared to our competitors affects how often our generating units are dispatched and whether we buy or sell power. For more information on the MISO Energy Markets, see E. Regulation.\nWE has a steam utility that generates, distributes, and sells steam supplied by the VAPP to customers in metropolitan Milwaukee, Wisconsin. Steam is used by customers for processing, space heating, domestic hot water, and humidification. Annual sales of steam fluctuate from year to year based on system growth and variations in weather conditions.\nElectric Sales Forecast\nOur service territory experienced relatively flat weather-normalized retail electric sales in 2024, compared with 2023. We currently forecast retail electric sales volumes, excluding the Tilden mine located in the Upper Peninsula of Michigan, to increase 0.7% for 2025, assuming normal weather.\nYear Ended December 31\nElectric customers – end of year\n\nWEC Energy Group, Inc.\nElectric Commercial and Industrial Retail Customers\nWe provide electric utility service to a diversified base of customers in industries such as metals and other manufacturing, paper, governmental, food manufacturing, and health services.\nElectric Generation and Supply Mix\nOur electric supply strategy is to provide our customers with energy from a diverse generation portfolio that is expected to balance a stable, reliable, and affordable supply of electricity with environmental stewardship. Through our participation in the MISO Energy Markets, we supply a significant amount of electricity to our customers from generation that we own. We supplement our internally generated power supply with long-term PPAs, including the Point Beach PPA discussed under the heading \"Power Purchase Commitments,\" and through spot purchases in the MISO Energy Markets. We also sell excess power supply into the MISO Energy Markets when it is economical, which reduces net fuel costs by offsetting costs of purchased power. All options, including owned generation resources and purchased power opportunities, are continually evaluated on a real time basis to select and dispatch the lowest-cost resources available to meet system load requirements.\nThe table below indicates our sources of electric energy supply as a percentage of sales for the three years ended December 31, as well as estimates for 2025:\nCompany-owned generation:\n\nThe values included in the estimate assume a natural gas price based on the December 2024 NYMEX.\nIncludes hydroelectric, biomass, solar, and wind generation.\nElectric Generation Facilities\nOur generation portfolio is a mix of energy resources having different operating characteristics and fuel sources designed to balance providing energy that is stable, reliable, and affordable with environmental stewardship. We own 8,158 MWs of generation capacity, including wholly owned and jointly owned facilities. We Power's generating units are also included in the generation capacity. Our facilities include natural gas-fired plants, coal-fired plants, and renewable generation. Certain of our natural gas-fired generation units have the ability to burn oil if natural gas is not available due to delivery constraints. For more information about our facilities, see Item 2. Properties.\nWe have announced goals to achieve reductions in carbon emissions from our electric generation fleet by 60% by the end of 2025 and by 80% by the end of 2030, both from a 2005 baseline. As of the end of 2024, our electric generation fleet has achieved a 56% reduction in carbon emissions from the 2005 baseline. We expect to achieve these goals by continuing to make operating\nWEC Energy Group, Inc.\nrefinements, retiring less efficient generating units, and executing our capital plan. Over the longer term, the target for our generation fleet is to be net carbon neutral by 2050.\nAs part of our path toward these goals, we have started implementing co-firing with natural gas at the ERGS coal-fired units and plan to co-fire with natural gas at Weston Unit 4. By the end of 2030, we expect to use coal as a backup fuel only and to be in a position to eliminate coal as an energy source by the end of 2032.\nCreating a Sustainable Future\nOur capital plan includes the retirement of older, fossil-fueled generation, to be replaced with zero-carbon-emitting renewables and reliable, efficient natural gas-fired generation. The retirements are intended to address compliance with the EPA Clean Air rules as well as contribute to meeting our goals to reduce CO\nemissions from our electric generation. When taken together, the retirements and new investments in renewables and reliable, efficient natural gas generation discussed in more detail below should better balance our supply with our demand, while helping to address compliance and maintaining reliable, affordable energy for our customers.\nWe have already retired nearly 2,500 MWs of fossil-fueled generation since the beginning of 2018, which includes the retirement of OCPP Units 5 and 6 in May 2024, the 2019 retirement of the PIPP, and the 2018 retirements of the Pleasant Prairie power plant, the Pulliam power plant, and the jointly-owned Edgewater Unit 4 generating unit. See Note 6, Regulatory Assets and Liabilities, for more information related to these power plant retirements. We expect to retire approximately 1,200 MWs of additional coal-fired generation by the end of 2031, which includes the planned retirements of OCPP Units 7 and 8, the jointly-owned Columbia Units 1 and 2 while investigating conversion of at least one unit to natural gas, and Weston Unit 3. See Note 7, Property, Plant, and Equipment, for more information.\nSee Item 7. Management's Discussion and Analysis of Financial Condition and Results of Operations – Corporate Developments for more information on our capital plan.\nAlso see Item 1A. Risk Factors - Risks Related to Legislation and Regulation - Our operations, capital expenditures, and financial results may be affected by the impact of greenhouse gas legislation, regulation, and emission reduction goals.\nRenewable Generation\nOur electric utilities meet a portion of their electric generation supply with various renewable energy resources, including wind, solar, hydroelectric, and biomass. This helps our electric utilities work towards our goals of reducing carbon emissions while also maintaining compliance with renewable energy legislation. These renewable energy resources also help us maintain diversity in our generation portfolio, which effectively serves as a price hedge against future fuel costs, and will help mitigate the risk of potential unknown costs associated with any future carbon restrictions for electric generators.\nIn September 2024, WE and WPS, along with an unaffiliated utility, filed a request with the PSCW to acquire and construct Badger Hollow Wind and to acquire Whitetail, two utility-scale wind-powered electric generating facilities. If approved, Badger Hollow Wind will be located in Iowa and Grant counties, Wisconsin, and Whitetail will be located in Grant County, Wisconsin. Once fully constructed, WE and WPS will collectively own 100 MWs of wind generation of Badger Hollow Wind and 60 MWs of wind generation of Whitetail. If approved, the construction of both of these projects is expected to be completed in 2027.\nSolar and Battery Storage\nIn December 2024, the construction of the solar portion of Paris located in Kenosha County, Wisconsin was completed, and the facility became commercially operational. Paris is owned by WE, WPS, and an unaffiliated utility, with WE and WPS collectively owning 180 MWs of solar generation. WE and WPS will collectively own 99 MWs of battery storage of this projec",
  "item7_clean": "2024 Compared with 2023\nEarnings increased $195.5 million during 2024, compared with 2023. The significant factors impacting the $195.5 million increase in earnings were:\nA $112.1 million increase in net income attributed to common shareholders at the Illinois segment, primarily due to a $178.9 million impairment recorded in 2023 associated with the ICC's disallowance of certain incurred capital costs in its November 2023 rate orders for PGL and NSG. An increase in margins related to the impacts of the November 2023 rate orders,\nWEC Energy Group, Inc.\neffective December 1, 2023 for PGL, and February 1, 2024 for NSG, also contributed to the higher net income. SMP costs that were previously being recovered under PGL's QIP rider are now included in PGL's base rates. Partially offsetting these increases were higher property and revenue taxes, depreciation and amortization, and natural gas distribution and maintenance costs, along with a $25.3 million pre-tax charge to income related to the ICC's disallowance of certain capital costs in PGL's 2016 rider QIP reconciliation. See Note 26, Regulatory Environment, for more information on the PGL and NSG rate orders and the ICC's disallowance.\nA $44.8 million increase in net income attributed to common shareholders at the non-utility energy infrastructure segment, driven by higher operating income at WECI and an increase in PTCs from our non-utility renewable generating facilities in 2024.\nA $21.9 million increase in net income attributed to common shareholders at the electric transmission segment, driven by higher equity earnings from ATC primarily due to the positive impact of a FERC order issued in October 2024 addressing complaints related to ATC's ROE. For information on this FERC order, see Factors Affecting Results, Liquidity, and Capital Resources – Regulatory, Legislative, and Legal Matters – American Transmission Company Allowed Return on Equity Complaints. Continued capital investment by ATC also contributed to the year-over-year increase in equity earnings.\nAn $11.8 million increase in net income attributed to common shareholders at the Wisconsin segment, driven by an increase in margins due to the impact of the Wisconsin limited rate case re-openers approved by the PSCW, effective January 1, 2024, and a positive impact from collections of fuel and purchased power costs. These increases were partially offset by higher operating expenses, primarily driven by higher depreciation and amortization. See Note 26, Regulatory Environment, for more information on the limited rate case re-openers.\n2023 Compared with 2022\nEarnings decreased $76.4 million during 2023, compared with 2022. The significant factors impacting the $76.4 million decrease in earnings were:\nA $92.0 million increase in the net loss attributed to common shareholders at the corporate and other segment, driven by higher interest expense on both long-term and short-term debt. This negative impact was partially offset by net gains from the investments held in the Integrys rabbi trust during 2023, compared with net losses during the same period in 2022. The gains and losses from the investments held in the rabbi trust partially offset the changes in benefit costs related to deferred compensation, which are primarily included in other operation and maintenance expense in our utility segments. See Note 17, Fair Value Measurements, for more information on our investments held in the Integrys rabbi trust.\nAn $86.9 million decrease in net income attributed to common shareholders at the Illinois segment, driven by higher operating expenses, primarily due to a $178.9 million pre-tax impairment associated with the ICC's disallowance of certain incurred capital costs in its November 2023 rate orders for PGL and NSG, and the year-over-year impact of a gain recorded in 2022 on the sale of certain real estate by PGL. Partially offsetting these increases in operating expenses were lower natural gas distribution and maintenance costs and a decrease in expenses related to charitable contributions. Higher margins, due to a positive impact from PGL's rate order, effective December 1, 2023, and continued capital investment in the SMP project in 2023 under PGL's former QIP rider, also partially offset the net increase in operating expenses.\nThese decreases in earnings were partially offset by:\nA $92.9 million increase in net income attributed to common shareholders at the Wisconsin segment, driven by an increase in margins related to the impact of the Wisconsin rate orders approved by the PSCW, effective January 1, 2023, and a positive year-over-year impact from collections of fuel and purchased power costs. These positive impacts were partially offset by a decrease in margins due to lower sales volumes, and higher operating expenses, including increases in expenses related to transmission, depreciation and amortization, and regulatory amortizations.\nWEC Energy Group, Inc.\nAn $11.6 million increase in net income attributed to common shareholders at the non-utility energy infrastructure segment, primarily due to an increase in PTCs driven by the acquisition of additional renewable generation facilities in the second half of 2022 and the first quarter of 2023, partially offset by higher interest expense.\nAn $8.4 million increase in net income attributed to common shareholders at the other states segment, driven by higher margins due to an interim rate increase at MERC, effective January 1, 2023. See Note 26, Regulatory Environment, for more information. This positive impact was partially offset by a decrease in margins due to lower sales volumes and increases in depreciation and amortization and interest expense.\nNon-GAAP Financial Measures\nThe discussions below address the contribution of each of our utility segments to net income attributed to common shareholders. The discussions include financial information prepared in accordance with GAAP, as well as utility margin, which is not a measure of financial performance under GAAP. Utility margin (operating revenues less fuel and purchased power costs and cost of natural gas sold) is a non-GAAP financial measure because it excludes certain operation and maintenance expenses applicable to revenues, as well as depreciation and amortization and property and revenue taxes.\nWe believe that utility margin provides a useful basis for evaluating utility operations since the majority of prudently incurred fuel and purchased power costs, as well as prudently incurred natural gas costs, are passed through to customers in current rates. As a result, management uses utility margin internally when assessing the operating performance of our utility segments as these measures exclude the majority of revenue fluctuations caused by changes in these expenses. Similarly, the presentation of utility margin herein is intended to provide supplemental information for investors regarding our operating performance.\nOur utility margin may not be comparable to similar measures presented by other companies. Furthermore, this measure is not intended to replace gross margin as determined in accordance with GAAP as an indicator of operating performance. Each of our three utility segment discussions below include a table that provides the calculation of both gross margin as determined in accordance with GAAP and utility margin, as well as a reconciliation between the two measures.\nWisconsin Segment Contribution to Net Income Attributed to Common Shareholders\nThe Wisconsin segment's contribution to net income attributed to common shareholders for the year ended December 31, 2024 was $863.1 million, representing an $11.8 million, or 1.4%, increase over the prior year. The higher earnings were driven by an increase in margins due to the impact of the Wisconsin limited rate case re-openers approved by the PSCW, effective January 1, 2024, and a positive impact from collections of fuel and purchased power costs. These increases were partially offset by higher operating expenses, primarily driven by higher depreciation and amortization. See Note 26, Regulatory Environment, for more information on the limited rate case re-openers.\nWEC Energy Group, Inc.\nThe Wisconsin segment's contribution to net income attributed to common shareholders for the year ended December 31, 2023 was $851.3 million, representing a $92.9 million, or 12.2%, increase over the prior year. The higher earnings were driven by an increase in margins related to the impact of the Wisconsin rate orders approved by the PSCW, effective January 1, 2023, and a positive year-over-year impact from collections of fuel and purchased power costs. These positive impacts were partially offset by a decrease in margins due to lower sales volumes, and higher operating expenses, including increases in expenses related to transmission, depreciation and amortization, and regulatory amortizations.\nYear Ended December 31\nB (W)\nB (W)\n\nThe increase in cash paid for capital expenditures at the Wisconsin segment during 2024, compared with 2023, was driven by higher payments for WE's electric distribution system, increased capital expenditures for renewable energy projects at WE, WPS, and UMERC, increased capital expenditures for combustion turbines at OCPP, as well as increased capital expenditures for a project to consolidate our electric utility operations technology. These increases in capital expenditures were partially offset by decreased payments for construction of WE's and WG's LNG facilities, which were completed in November 2023 and February 2024, respectively, as well as decreased payments for natural gas-fired generation that was constructed at WPS's existing Weston power plant site, which was completed in July 2023.\nThe decrease in cash paid for expenditures at the Illinois segment during 2024, compared with 2023, was driven by lower payments related to PGL's natural gas distribution system, including SMP. For more information on the factors contributing to this decrease, see Factors Affecting Results, Liquidity, and Capital Resources – Regulatory, Legislative, and Legal Matters – Illinois Proceedings.\nThe increase in cash paid for capital expenditures at the Other States segment during 2024, compared with 2023, was driven by increased payments for MGU's natural gas distribution system.\nSee Liquidity and Capital Resources – Cash Requirements – Significant Capital Projects below for more information.\nWEC Energy Group, Inc.\nFinancing Activities\nNet cash provided by financing activities decreased $55.1 million during 2024, compared with 2023, driven by:\nA $1,276.5 million decrease in cash due to $902.8 million of net repayments of commercial paper during 2024, compared with $373.7 million of net borrowings of commercial paper during 2023.\nA $1,132.6 million decrease in cash due to higher retirements of long-term debt during 2024, compared with 2023.\nA $72.0 million decrease in cash due to higher dividends paid on our common stock during 2024, compared with 2023. In January 2024, our Board of Directors increased our quarterly dividend by $0.055 per share (7.1%) effective with the March 2024 dividend payment.\nA $31.7 million decrease in cash due to higher payments for debt extinguishment and issuance costs during 2024, compared with 2023.\nThe purchase of an additional 10% ownership interest in Samson I in January 2024 for $28.1 million.\nThese decreases in net cash provided by financing activities were partially offset by:\nA $2,290.9 million increase in cash due to higher issuances of long-term debt during 2024, compared with 2023.\nA $163.4 million increase in cash due to the issuance of common stock during 2024. We did not issue any common stock during 2023. See Note 11, Common Equity, for more information.\nA $17.4 million increase in cash proceeds related to an increase in stock options exercised during 2024, compared with 2023.\nA $13.4 million increase in cash due to a decrease in common stock purchased during 2024, compared with 2023, to satisfy requirements of our stock-based compensation plans. See Note 11, Common Equity, for more information.\nSignificant Financing Activities\nFor more information on our financing activities, see Note 13, Short-Term Debt and Lines of Credit, and Note 14, Long-Term Debt.\nWe require funds to support and grow our businesses. Our significant cash requirements primarily consist of capital and investment expenditures, payments to retire and pay interest on long-term debt, the payment of common stock dividends to our shareholders, and the funding of our ongoing operations. Our significant cash requirements are discussed in further detail below.\nWEC Energy Group, Inc.\nSignificant Capital Projects\nWe have several capital projects and acquisitions that will require significant capital expenditures over the next three years and beyond. All projected capital requirements are subject to periodic review and may vary significantly from estimates, depending on a number of factors. These factors include environmental requirements, regulatory restraints and requirements, changes in tax laws and regulations, acquisition and development opportunities, market volatility, economic trends, supply chain disruptions, inflation, and interest rates. Our estimated capital expenditures and acquisitions for the next three years are reflected below. These amounts include anticipated expenditures for environmental compliance and certain remediation issues. For a discussion of certain environmental matters affecting us, see Note 24, Commitments and Contingencies.\nNon-utility energy infrastructure\nOur utilities continue to upgrade their electric and natural gas distribution systems to enhance reliability. These upgrades include addressing our aging infrastructure, system hardening, and the AMI program. AMI is an integrated system of smart meters, communication networks, and data management systems that enable two-way communication between utilities and customers.\nWe are committed to investing in solar, wind, battery storage, and natural gas-fired generation. Below are examples of projects that are proposed or currently underway.\nWE and WPS, along with an unaffiliated utility, received PSCW approval to acquire and construct Paris, a utility-scale solar-powered electric generating facility with a battery energy storage system located in Kenosha County, Wisconsin. In December 2024, the construction of the solar portion of Paris was completed, with WE and WPS collectively owning 180 MWs of solar generation. WE and WPS will collectively own 99 MWs of battery storage of this project, with construction expected to be completed in 2025.\nWE's and WPS's combined share of the cost of this project is estimated to be approximately $542 million.\nWE and WPS, along with an unaffiliated utility, received PSCW approval to acquire and construct Darien, a utility-scale solar-powered electric generating facility with a battery energy storage system. The project will be located in Rock and Walworth counties, Wisconsin and once fully constructed, WE and WPS will collectively own 225 MWs of solar generation and 68 MWs of battery storage of this project. WE's and WPS's combined share of the cost of this project\nis estimated to be approximately $567 million, with\nconstruction of the solar portion and battery storage expected to be completed in 2025 and 2026, respectively.\nWE and WPS, along with an unaffiliated utility, received PSCW approval to acquire Koshkonong, a utility-scale solar-powered electric generating facility with a battery energy storage system. The project will be located in Dane County, Wisconsin and once fully constructed, WE and WPS will collectively own 270 MWs of solar generation and 149 MWs of battery storage of this project. WE's and WPS's combined share of the cost of this project is estimated to be approximately\nwith construction of the solar portion and battery storage expected to be completed\nin 2026 and 2027, respectively.\nWE and WPS plan to",
  "item2_clean": null
}