{
  "source_file": "wfc-20241231.htm",
  "form_type": "10-K",
  "item1_clean": "with authorized third parties, some of whom could be non-financial institutions, the rule could result in increased fraud, data misuse, and competition.\nRegulation of Consumer Financial Products\nConsumer financial products are subject to numerous and, in many cases, highly complex federal and state consumer protection laws and regulations, as well as enhanced regulatory scrutiny and expectations. In particular, the CFPB implements and enforces regulations designed to ensure that consumers receive timely, clear, and accurate disclosures regarding financial products and are protected from unfair, deceptive or abusive practices. The CFPB has issued and proposed a number of rules impacting consumer financial products, including rules impacting residential mortgage lending, credit cards, and other financial products and banking related activities, as well as the fees that may be charged for certain banking products and services. In addition to these rulemaking activities, the CFPB may conduct ongoing supervisory examination activities of the financial services industry with respect to a number of consumer businesses and products, including mortgage lending and servicing, fair lending requirements, and auto finance.\nRegulation of Swaps and Other Derivatives Activities\nThe CFTC and the SEC have adopted comprehensive sets of rules regulating swaps and security-based swaps, respectively, and the OCC and other federal regulatory agencies have adopted margin requirements for uncleared swaps and security-based swaps. As a registered swap dealer and a conditionally-registered security-based swap dealer, Wells Fargo Bank, N.A., is subject to these rules.\nRegulatory Developments Related to Climate Change and Sustainability\nFederal, state, and non-U.S. governments and government agencies have demonstrated increased attention to the impacts and potential risks associated with climate change and sustainability-related activities. For example, federal banking regulators are reviewing the implications of climate change on the financial stability of the United States and have issued guidance on the identification and management by large banks of climate-related financial risks. In addition, the SEC adopted final rules, which have been voluntarily stayed pending legal proceedings, requiring public companies to disclose certain climate-related information, including climate-related risks and impacts, certain greenhouse gas emissions, climate-related targets and goals, and governance of climate-related risks and relevant risk management processes. Similarly, California finalized climate-related disclosure laws, while multiple other states have proposed or adopted laws and guidance with requirements for, or restrictions on, sustainability-related initiatives or disclosures. Additionally, the European Union finalized its Corporate Sustainability Reporting Directive (CSRD) requiring companies to assess climate risks, opportunities, and impacts as well as disclose certain climate-related information, and also finalized its Corporate Sustainability Due Diligence Directive (CSDDD) requiring companies to adopt and implement a transition plan for climate change mitigation. The approaches taken by various governments and government agencies can vary significantly, evolve over time, and sometimes conflict. Any current or future rules, regulations, and guidance related to climate change and its impacts could require us to change certain of our business practices or strategies, reduce our revenue and earnings, impose additional costs on us, subject us to legal or regulatory proceedings, or otherwise adversely affect our business operations and/or competitive position.\nSarbanes-Oxley Act of 2002\nThe Sarbanes-Oxley Act of 2002 (Sarbanes-Oxley) implemented a broad range of corporate governance and accounting measures designed to increase corporate responsibility, provide for enhanced penalties for accounting and auditing improprieties at publicly traded companies, and protect investors by improving the accuracy and reliability of disclosures under federal securities laws. We are subject to Sarbanes-Oxley because we are required to file periodic reports with the SEC under the Securities Exchange Act of 1934. Among other things, Sarbanes-Oxley and/or its implementing regulations established membership requirements and additional responsibilities for our audit committee, imposed restrictions on the relationship between us and our outside auditors (including restrictions on the types of non-audit services our auditors may provide to us), imposed additional responsibilities for our external financial statements on our chief executive officer and chief financial officer, expanded the disclosure requirements for our corporate insiders, required our management to evaluate our disclosure controls and procedures and our internal control over financial reporting, and\nrequired our independent registered public accounting firm to issue a report on our internal control over financial reporting.\nThe Uniting and Strengthening America by Providing Appropriate Tools Required to Intercept and Obstruct Terrorism Act of 2001 (USA PATRIOT Act) is intended to strengthen the ability of U.S. law enforcement agencies and intelligence communities to work together to combat terrorism on a variety of fronts. The USA PATRIOT Act has significant implications for depository institutions, brokers, dealers and other businesses involved in the transfer of money. The USA PATRIOT Act requires the implementation of policies and procedures relating to anti-money laundering, economic sanctions, suspicious activities, and currency transaction reporting and due diligence on customers. The USA PATRIOT Act also requires federal banking regulators to evaluate the effectiveness of an applicant in combating money laundering in determining whether to approve a proposed bank acquisition.\nOther Regulatory Related Matters\nThe Company is subject to a number of consent orders and other regulatory actions, which may require the Company, among other things, to undertake certain changes to its business, operations, products and services, and risk management practices. For a discussion of certain consent orders and other regulatory actions applicable to the Company, see the “Overview” section in the 2024 Annual Report to Shareholders.\nFuture Legislation or Regulation\nEconomic, market and political conditions during the past several years have led to a significant amount of legislation and regulation in the U.S. and abroad affecting the financial services industry, as well as heightened expectations and scrutiny of financial services companies from banking regulators. Further legislative changes and additional regulations may change our operating environment in substantial and unpredictable ways. Such legislation and regulations could increase our cost of doing business, affect our compensation structure, restrict or expand the activities in which we may engage or affect the competitive balance among banks, savings associations, credit unions, and other financial institutions. We cannot predict whether future legislative proposals will be enacted and, if enacted, the effect that they, or any implementing regulations, would have on our business, results of operations or financial condition.\nADDITIONAL INFORMATION\nAdditional information in response to this Item 1 can be found in the 2024 Annual Report to Shareholders under “Financial Review” and under “Financial Statements.” That information is incorporated into this item by reference.\n\nITEM 1.\nBUSINESS\nWells Fargo & Company is a corporation organized under the laws of Delaware and a financial holding company and a bank holding company registered under the Bank Holding Company Act of 1956, as amended (BHC Act). Its principal business is to act as a holding company for its subsidiaries. References in this report to “the Parent” mean the holding company. References to “we,” “our,” “us” or “the Company” mean the holding company and its subsidiaries that are consolidated for financial reporting purposes.\nAt December 31, 2024, we had assets of approximately $1.9 trillion, loans of $912.7 billion, deposits of $1.4 trillion and stockholders’ equity of $179.1 billion. Based on assets, we were the fourth largest bank holding company in the United States. At December 31, 2024, Wells Fargo Bank, N.A. was the Company’s principal subsidiary with assets of $1.7 trillion, or 88% of the Company’s assets.\nwww.wellsfargo.com/about/investor-relations/filings\nDESCRIPTION OF BUSINESS\nWe are a leading financial services company that provides a diversified set of banking, investment and mortgage products and services, as well as consumer and commercial finance, to individuals, businesses and institutions, throughout the U.S., and in countries outside the U.S. We provide consumer financial products and services including checking and savings accounts, credit and debit cards, and auto, residential mortgage, and small business lending. In addition, we offer financial planning, private banking, investment management, and fiduciary services. We also provide financial solutions to businesses through products and services including traditional commercial loans and lines of credit, letters of credit, asset-based lending and leasing, trade financing, treasury management, and investment banking services. Our website address is www.wellsfargo.com.\nAs of December 31, 2024, we had four reportable operating segments for management reporting purposes: Consumer Banking and Lending; Commercial Banking; Corporate and Investment Banking; and Wealth and Investment Management. The 2024 Annual Report to Shareholders includes financial information and descriptions of these operating segments.\nOur people are what set Wells Fargo apart and are critical to our success. Wells Fargo continues to invest in our employees by offering market-competitive compensation, career-development opportunities, a broad array of benefits, and strong work-life programs. We want to be recognized as a great company for everyone by maintaining recruitment and career development practices that support our employees and provide an environment that welcomes people from different backgrounds and with different experiences.\nWe do not control this website. Wells Fargo has provided this link for your convenience, but does not endorse and is not responsible for the content, links, privacy policy, or security policy of this website.\nAt December 31, 2024, we had approximately 217,000 active employees, with approximately 77% of employees based in the United States. Our global workforce was 51% female and 49% male, and our U.S. workforce was 54% female and 46% male. Our U.S. workforce was 51% white, 48% racially/ethnically diverse, and 1% undeclared.\nCompensation and benefits.\nWells Fargo's compensation program is linked to performance management and is designed to promote prudent risk management and reinforce its culture and operating standards. The compensation principles include:\n: Compensation is linked to company, line of business, and individual performance, including meeting regulatory expectations and creating long-term value consistent with the interests of shareholders.\nPromote effective risk management\n: Compensation promotes effective risk management and discourages imprudent or excessive risk-taking.\nAttract and retain talent\n: People are one of Wells Fargo's competitive advantages; therefore, compensation helps attract, motivate, and retain people with the skills, talent, and experience to drive superior long-term company performance.\nIn addition, we offer eligible full- and part-time employees and their eligible dependents a comprehensive set of benefits designed to support their physical, financial, and emotional health to help them make the most of their well-being.\nEmployee learning and development.\nWe invest in the development of our employees and managers. We believe that when o",
  "item7_clean": null,
  "item2_clean": null
}