{
  "source_file": "wm-20241231x10k.htm",
  "form_type": "10-K",
  "item1_clean": "Included within our Corporate and Other businesses’ closed sites are (i) six third-party power generating facilities converting our landfill gas to fuel electricity generators; (ii) two third-party projects delivering our landfill gas by pipeline to industrial customers as a direct substitute for fossil fuels in industrial processes and (iii) two third-party RNG facilities processing landfill gas to be sold to natural gas suppliers in return for a royalty. Additionally, Corporate and Other benefits from a 15% royalty from our WM Renewable Energy segment based on net operating revenue generated through the sale of RNG, RINs, electricity and capacity, RECs and related environmental attributes from the 15 landfill beneficial use renewable energy projects owned by WM Renewable Energy on our closed sites, which is eliminated in consolidation.\nWe continue to invest in businesses and technologies that are designed to offer services and solutions ancillary or supplementary to our current operations. While most of these investments are in the form of minority equity stakes, they can also include joint ventures, joint development agreements or majority equity stakes. The solutions and services include (i) waste collection, processing and recycling; (ii) the development, operation and marketing of waste processing facilities and technologies; (iii) operation of RNG plants and (iv) the development and operation of organic recycling technologies. Furthermore, we continually scout, evaluate and run proof-of-concepts of innovative technologies within our core operations to improve safety, operational efficiencies and customer solutions.\nWe encounter intense competition from governmental, quasi-governmental and private sources in all aspects of our operations. We principally compete with large national waste management companies, counties and municipalities that maintain their own waste collection and disposal operations and regional and local companies of varying sizes and financial resources. The industry also includes companies that specialize in certain discrete areas of waste management, operators of alternative disposal facilities, companies that seek to use parts of the waste stream as feedstock for renewable energy and other by-products and waste brokers that rely upon haulers in local markets to address customer needs.\nOperating costs, disposal costs and collection fees vary widely throughout the geographic areas in which we operate. The prices that we charge are determined locally, and typically vary by volume and weight, type of waste collected, treatment requirements, risk of handling or disposal, frequency of collections, distance to final disposal sites, the availability of airspace within the geographic region, labor costs and amount and type of equipment furnished to the customer. We face intense competition based on pricing and quality of service. We also compete for business based on breadth of service offerings. As companies, individuals and communities look for ways to be more sustainable, we are promoting our comprehensive services that go beyond our core business of collecting and disposing of waste in order to meet their needs.\nOur financial and operating results may fluctuate for many reasons, including period-to-period changes in the relative contribution of revenue by each line of business, changes in commodity prices and general economic conditions. Our operating revenues and volumes typically experience seasonal increases in the summer months that are reflected in second and third quarter revenues and results of operations.\nService or operational disruptions caused by severe storms, extended periods of inclement weather or climate events can significantly affect the operating results of the geographic areas affected. Extreme weather events may also lead to supply chain disruption and delayed project development, or disruption of our customers’ businesses, reducing the amount of waste generated by their operations.\nConversely, certain destructive weather and climate conditions, such as wildfires in the Western U.S. and hurricanes that most often impact our operations in the Southern and Eastern U.S. during the second half of the year, can increase our revenues in the geographic areas affected as a result of the waste volumes generated by these events. While weather-related and other event-driven special projects can boost revenues through additional work for a limited time, due to significant start-up costs and other factors, such revenue can generate earnings at comparatively lower margins.\n\nmaterials. In some cases, our pricing is based on fixed contractual rates or on defined minimum per-ton rates. Generally, this pricing also considers the price we receive for sales of processed goods, market conditions and transportation costs. As a result, changes in commodity prices for recycled materials also significantly affect the pricing to our suppliers. Depending on the key terms of the arrangement, these “rebates” are recorded as either operating expenses or a reduction in operating revenues within our Consolidated Statements of Operations. If the key terms result in a charge to the customer, the associated “tip fees” would be recorded as operating revenues within our Consolidated Statements of Operations.\nWe develop, operate and promote projects for the beneficial use of landfill gas through our WM Renewable Energy segment. Landfill gas is produced naturally as waste decomposes in a landfill. The methane component of the landfill gas is a readily available, renewable energy source that can be gathered and used beneficially as an alternative to fossil fuel. The U.S. Environmental Protection Agency (“EPA”) endorses landfill gas as a renewable energy resource, in the same category as wind, solar and geothermal resources. As of December 31, 2024, we had 102 landfill gas beneficial use projects producing commercial quantities of methane gas at owned or operated landfills. For 65 of these projects, the processed gas is used to fuel electricity generators. The electricity is then sold to public utilities, municipal utilities or power cooperatives. For 23 of these projects, the gas is used at the landfill or delivered by pipeline to industrial customers as a direct substitute for fossil fuels in industrial processes. For 11 of these projects, the landfill gas is processed to pipeline quality RNG and then sold to natural gas suppliers. Additionally, three of these projects are on third-party landfills. The revenues from these facilities are primarily generated through the sale of RNG, RINs, electricity and capacity, heat and/or steam, RECs and related environmental attributes. WM Renewable Energy is charged a 15% royalty on net operating revenue from these facilities residing on our active and closed landfills from our Collection and Disposal and Corporate and Other businesses, which is eliminated in consolidation. Additionally, WM Renewable Energy operates and maintains seven third-party landfill beneficial gas use projects in return for service revenue. Our Collection and Disposal and Corporate and Other businesses benefit from these projects as well as 52 additional third-party landfill beneficial gas use projects in the form of royalties.\nWM Renewable Energy converts landfill gas into several sources of renewable energy, which include RNG, electricity and capacity, heat and/or steam. WM Renewable Energy also generates RINs under the Renewable Fuel Standard (“RFS”) program, other credits under a variety of state programs associated with the use of RNG in our compressed natural gas fleet, and RECs associated with the production of electricity. The RINs, RECs and other credits are sold to counterparties who are obligated under the regulatory programs and have a responsibility to procure RINs, RECs and other credits proportionate to their fossil fuel production and imports. RINs and RECs prices generally respond to regulations enacted by the EPA or other regulatory bodies, as well as fluctuations in supply and demand.\nWM Healthcare Solutions\nOur WM Healthcare Solutions segment, through our subsidiary Stericycle, is primarily a business-to-business company providing RWCS and SID services that protect people and brands, promote health and well-being and safeguard the environment. WM Healthcare Solutions serves customers in the U.S., Canada and Western Europe with solutions to safely manage materials that could otherwise spread disease, contaminate the environment, or compromise one’s identity. Services provided through our WM Healthcare Solutions segment includes the following:\nRegulated Waste and Compliance Services\nWM Healthcare Solutions includes compliance programs and collection, processing, and disposal of regulated and specialized waste, including medical, pharmaceutical and hazardous waste. RWCS are provided to customers in the U.S., Canada, Ireland and the United Kingdom (“U.K.”).\nRegulated waste can be defined as any material subject to government-imposed guidelines for handling the material for transportation or disposal. Examples include medical waste, pathological waste, sharps and pharmaceutical waste.\nCollection and Transportation\n\nCollection and Disposal\nServices provided through our Collection and Disposal businesses are described below:\nOur commitment to customers begins with a vast waste collection network. Collection involves picking up and transporting waste and recyclable materials from where it was generated to a transfer station, recycling facility or disposal site. We generally provide collection services under one of two types of arrangements:\nFor commercial and industrial collection services, typically we have three-year service agreements. The fees under the agreements are influenced by factors such as collection frequency, type of collection equipment we furnish, type and volume or weight of the waste collected, distance to the disposal facility, labor costs, cost of disposal and general market factors. As part of the service, we provide steel containers to most customers to store their solid waste between pick-up dates. Containers vary in size and type according to the needs of our customers and the restrictions of their communities. Many are designed to be lifted mechanically and either emptied into a truck’s compaction hopper or directly into a disposal site. By using these containers, we can service most of our commercial and industrial customers with trucks operated by only one employee.\nFor most residential collection services, we have a contract with, or a franchise granted by, a municipality, homeowners’ association or some other regional authority that gives us the exclusive right to service all or a portion of the homes in an area. These contracts or franchises are typically for periods of three to ten years and typically mirror maximum terms as allowed by statutes by state. We also provide services under individual monthly subscriptions directly to households. The fees for residential collection are either paid by the municipality or authority from their tax revenues or service charges, or are paid directly by the residents receiving the service. The Company is generally phasing out traditional manual systems and moving to further automate residential collection services. Benefits of automation include enhanced worker safety, improved service delivery to the customer and an overall reduction in the cost to provide services.\nLandfills are the main depositories for solid waste in North America. As of December 31, 2024, we owned or operated 257 solid waste landfills and five secure hazardous waste landfills, which represents the largest network of landfills throughout the U.S. and Canada. As of December 31, 2024, we owned or controlled the management of 239 sites with remedial activities that are in closure or have received a certification of closure from the applicable regulatory agency. Solid waste landfills are constructed and oper",
  "item7_clean": "Key elements of our 2024 financial results include:\nRevenues of $22,063 million for 2024 compared with $20,426 million in 2023, an increase of $1,637 million, or 8.0%. The increase is primarily attributable to (i) higher yield in our Collection and Disposal businesses; (ii) acquisitions, net of divestitures; (iii) increases in commodity prices in our Recycling and Sales and WM Renewable Energy segments and (iv) increased volumes. These increases were partially offset by a decrease in revenue from our energy surcharge program as a result of a decline in the price of fuel, particularly diesel;\nOperating expenses of $13,383 million in 2024, or 60.7% of revenues, compared with $12,606 million, or 61.7% of revenues, in 2023. As a percentage of revenue, operating expenses improved significantly compared to the prior year as revenue growth from price, efficiency gains, improved employee retention and momentum in truck deliveries offset the impacts of inflationary increases in wages and other expenses. The increase in total operating expenses from prior year related primarily to (i) acquisitions; (ii) inflationary pressure on wages and expenses; (iii) higher recycling customer rebates resulting from an approximate 50% increase in single-stream recycling commodity prices; (iv) volume growth within our WMSBS business which relies more extensively on subcontracted hauling and services than our Collection and Disposal businesses; (v) increases in landfill operating costs, particularly for higher leachate costs due to wet weather and (vi) higher risk management spend, due in part, to increases in certain large loss claims reserves. These increases were partially offset by lower diesel fuel prices and an increase in gains on the sale of non-strategic assets in 2024 as compared with the prior year;\nSelling, general and administrative expenses of $2,264 million in 2024, or 10.3% of revenues, compared with $1,926 million, or 9.4% of revenues, in 2023. The $338 million increase was primarily due to (i) costs incurred in connection with the acquisition and integration of Stericycle of which a significant portion were transaction and integration costs that are not expected to recur; (ii) increased labor costs from higher annual and long-term incentive compensation costs and annual wage increases and (iii) increased professional fees to support strategic initiatives. Partially offsetting these increases was a decline in litigation costs;\nIncome from operations of $4,063 million, or 18.4% of revenues, in 2024 compared with $3,575 million, or 17.5% of revenues, in 2023.\n\nLandfill Operating Costs —\nThe increase in landfill operating costs in 2024, as compared with 2023, was primarily due to (i) higher leachate collection and treatment and site maintenance costs which can largely be attributed to particularly wet weather in certain markets throughout 2024 and (ii) increased methane collection and treatment costs. Our landfill operating costs increased in 2023, as compared with 2022, primarily due to (i) higher expenses for interest accretion on landfill and environmental remediation liabilities and (ii) an increase in remediation expense due to changes in measurement of certain environmental remediation obligations.\n— The increase in risk management in 2024, as compared with 2023, was primarily due to (i) adjustments to our reserves for certain large loss claims; (ii) higher auto and workers compensation claims costs and (iii) increases in premiums for property coverage. These increases were offset, in part, by current year insurance recoveries for property claims associated with a fire and natural disasters. Risk management costs decreased in 2023, as compared with 2022, primarily due to lower levels of large loss claims.\n— Other operating costs increased in 2024, as compared with 2023, primarily due to (i) our recent acquisitions (ii) higher supply chain rebates in 2023 and (iii) a prior year favorable litigation settlement, which reduced our expenses in that period. These increases were offset, in part, by gains on the sales of non-strategic assets in 2024. Other operating costs decreased in 2023, as compared with 2022, primarily due to (i) supply chain rebates in 2023 and (ii) a favorable litigation settlement, which were offset, in part, by (i) inflationary cost pressures, although the impact of such continued inflationary cost increases moderated throughout the year; (ii) higher utility costs at our facilities; (iii) an increase in business travel and (iv) higher equipment rental costs.\n\nThe increase in labor and related benefits costs in 2023, as compared with 2022, was primarily related to (i) annual wage increases for our employees; (ii) market adjustments for deferred compensation plans related to investment performance and (iii) higher long-term incentive compensation costs, partially offset by lower annual incentive compensation costs and lower contract labor expenses.\n— The increase in professional fees in 2024, as compared with 2023, was primarily attributable to legal, consulting and accounting costs incurred to support strategic initiatives, including our acquisition of Stericycle. The decrease in professional fees in 2023, as compared with 2022, was primarily attributable to reduced expenses in connection with investments in our digital platform.\nThe increase in other expenses in 2024, as compared with 2023, was primarily related to (i) risk management costs incurred in connection with the acquisition and integration of Stericycle and (ii) increased spend across multiple cost categories including technology and travel. These cost increases were partially offset by a decline in litigation costs. The increase in other expenses in 2023, as compared with 2022, was primarily related to (i) increased litigation costs; (ii) increased bank charges and (iii) higher advertising spend, which were partially offset by lower travel expenses and lower telecommunication costs.\nDepreciation, Depletion and Amortization Expenses\nThe following table summarizes the components of our depreciation, depletion and amortization expenses for the year ended December 31 (dollars in millions and as a percentage of revenues):\n\nassociated with the construction of new projects to increase the beneficial use of landfill gas. These decreases were partially offset by an increase in volume of RFS credits, electricity and natural gas.\nWM Healthcare Solutions\n— Our WM Healthcare Solutions segment generated a loss of $69 million in 2024, which was largely attributable to acquisition and integration related expenses. There is no 2023 or 2022 activity as Stericycle was acquired on November 4, 2024.\n— The costs incurred by our Corporate and Other segment increased in 2024, as compared with 2023, primarily due to (i) increased professional and transaction fees to support strategic initiatives, including our acquisition of Stericycle; (ii) higher annual and long-term incentive compensation costs and (iii) an increase in risk management costs due to an increase in our large loss reserves as well as higher auto and workers compensation claims. This increase was partially offset by the impact of non-cash impairment charges for certain investments incurred in 2023, as discussed below.\nIncome from operations in Corporate and Other decreased in 2023, as compared with 2022, primarily due to impairment charges of (i) $107 million for certain investments in waste diversion technology businesses and (ii) $17 million to adjust an indirect wholly-owned subsidiary’s estimated potential share of the liability for a proposed environmental remediation plan at a closed site.\nInterest Expense, Net\nOur interest expense, net was $598 million, $500 million and $378 million in 2024, 2023 and 2022, respectively. The increase in interest expense, net for 2024 is primarily related to an increase in our average debt balances to fund our acquisition of Stericycle. The increase in interest expense, net for 2023 is primarily related to an increase in our weighted average borrowing rate of approximately 80 basis points due to increased rates on floating-rate debt and higher fixed rates on refinancing as well as an increase in average debt balances to fund growth. Partially offsetting these increases were benefits from higher capitalized interest and increases in interest income as a result of higher cash and cash equivalent balances as well as higher investment rates. See Note 6 to the Consolidated Financial Statements for more information related to our debt balances.\nLoss on Early Extinguishment of Debt, Net\nIn October 2024, we drew $5.2 billion of borrowings under the Term Credit Agreement that were applied to funding our acquisition of Stericycle. In November 2024, we repaid all outstanding borrowings with net proceeds from our November 2024 issuance of $5.2 billion of senior notes and contemporaneously terminated the Term Credit Agreement, resulting in a\n$7 million loss on early extinguishment of debt.\nEquity in Net Income (Losses) of Unconsolidated Entities\nWe recognized equity method investment income of $4 million in 2024 and losses of $60 million and $67 million in 2023 and 2022, respectively. These financial statement impacts are largely related to our noncontrolling interests in entities established to invest in and manage low-income housing properties. In 2024, we adopted Accounting Standards Update (“ASU”) 2023-02, and, as a result, beginning in 2024, the amortization of these investments is recognized as a component of income tax expense. Refer to Notes 2 and 8 to the Consolidated Financial Statements for further discussion. We generate tax benefits, including tax credits, from the losses incurred from these investments. The losses are more than offset by the tax benefits generated by these investments as further discussed in Notes 8 and 18 to the Consolidated Financial Statements.\nWe recorded income tax expense of $713 million, $745 million and $678 million in 2024, 2023 and 2022, respectively, resulting in effective income tax rates of 20.6%, 24.7% and 23.2% for the years ended December 31, 2024, 2023 and 2022, respectively. The comparability of our income tax expense for the reported periods has been primarily affected by the following:\n\nAs of December 31, 2024, our WM Healthcare Solutions businesses include a global fleet of approximately 6,100 routed trucks, tractors, collection vans and small duty vehicles. Our WM Healthcare Solutions segment operates out of approximately 361 leased and owned facilities worldwide with 69 autoclaves or other alternative medical waste treatment facilities, 18 medical waste incinerator facilities, 107 SID processing facilities and 167 transfer stations. Included within our WM Healthcare Solutions segment are 35 locations that are classified as held for sale as of December 31, 2024.\nWe also provide additional services that are not managed through our operating segments, which are presented in this report as Corporate and Other. This includes the activities of our corporate office, including costs associated with our long-term incentive program, expanded service offerings and solutions (such as our investments in businesses and technologies that are designed to offer services and solutions ancillary or supplementary to our current operations) as well as our closed sites. Also included within our Corporate and Other businesses closed sites are (i) six third-party power generating facilities converting our landfill gas to fuel electricity generators; (ii) two third-party projects delivering our landfill gas by pipeline to industrial customers as a direct substitute for fossil fuels in industrial processes and (iii) two third-party RNG facilities processing landfill gas to be sold to natural gas suppliers in return for a royalty. Additionally, Corporate and Other benefits from a 15% royalty from our WM Renewable Energy segment based on net operating revenue generated through the sale of RNG, RINs, electricity and capacity, RECs and related environmental attributes from the 15 landfill beneficial use renewable energy projects owned by WM Renewable Energy on our closed sites, which is eliminated in consolidation.\nIncluded in the fees we charge for our services is our energy surcharge and other charges that are intended to pass through costs to customers.\nBusiness Environment\nBusiness – Regulation – Recent Developments and Focus Areas in Policy and Regulation\nWe encounter intense competition from governmental, quasi-governmental and private service providers based on pricing, and to a much lesser extent, the nature of service offerings, particularly in the residential line of business. Our industry is directly affected by changes in general economic factors, including increases and decreases in consumer spending, business expansions and construction activity. These factors generally correlate to volumes of waste generated and impact our revenue. Negative economic conditions and other macroeconomic trends can and have caused customers to reduce their service needs. Such negative economic conditions, in addition to competitor actions, can impact our strategy to negotiate, renew, or expand service contracts and grow our business. We also encounter competition for acquisitions and growth opportunities. General economic factors and the market for consumer goods, in addition to regulatory developments, can also significantly impact commodity prices for the recyclable materials we sell. Significant components of our operating expenses vary directly as we experience changes in revenue due to volume and inflation. Volume changes\n\ncan fluctuate significantly by line of business and volume changes in higher margin businesses can impact key financial metrics. We must dynamically manage our cost structure in response to volume changes and cost inflation.\nWe believe the Company’s industry-leading asset network and strategic focus on investing in our people and our digital platform will give the Company the necessary tools to address the evolving challenges impacting the Company and our industry. In line with our commitment to continuous improvement and a differentiated customer experience, we remain focused on our automation and optimization investments to enhance our operational efficiency and change the way we interact with our customers. Advancements made through these initiatives are intended to seamlessly and digitally connect all enterprise functions required to service customers and provide the best experience. We have made significant progress in executing this technology enablement strategy to automate and optimize certain elements of our service delivery model. The key benefits are reduced labor dependency on certain high-turnover jobs, particularly in customer experience, recycling and residential collection, while further elevating our customer self-service through digitalization and implementation of technologies to enhance the safety, reliability and efficiency within our collection operations. Additionally, in 2022, we implemented a new general ledger accounting system, complementary finance enterprise resource planning system and a human capital management system, which will continue to drive operational and service excellence by empowering our people through a modern, simplified and connected employee experience.\nWe sometimes experience margin pressures and variability in earnings and margins from our commodity-driven businesses, specifically within our Recycling Processing and Sales and WM Renewable Energy segments. While recycling commodity prices have recovered in 2024 from the low levels experienced in 2023, commodity prices are still below levels seen at the beginning of 2022. The impacts of commodity price fluctuations are not currently material to our WM Renewable Energy segment; however, as we continue to make investments to grow that segment, we may experience more significant impacts from fluctuations in the prices of",
  "item2_clean": null
}