{
  "source_file": "wmb-20241231.htm",
  "form_type": "10-K",
  "item1_clean": "This report includes information for multiple registrants, specifically The Williams Companies, Inc. (Williams), as well as Transcontinental Gas Pipe Line Company, LLC (Transco) and Northwest Pipeline LLC (NWP) both of which are wholly owned subsidiaries of Williams (collectively, the Registrants). References to subsidiaries by name, including equity-method investees, Transco, and NWP, refer exclusively to those businesses and operations.\nWilliams is an energy company committed to being the leader in providing infrastructure that safely delivers natural gas products to reliably fuel the clean energy economy. Williams has operations in 12 supply areas that provide natural gas gathering, processing, and transmission services; NGLs fractionation, transportation, and storage services; and marketing services to approximately 800 customers. Williams owns an interest in and operates over 33,000 miles of pipelines in 24 states, 34 natural gas processing facilities, 9 NGL fractionation facilities, approximately 25 million barrels of NGL storage capacity, and 417 Bcf of natural gas storage capacity, and delivers natural gas that is used every day for clean-power generation, heating, and industrial use.\nWilliams was founded in 1908, originally incorporated under the laws of the state of Nevada in 1949 and reincorporated under the laws of the state of Delaware in 1987. Its common stock trades on the New York Stock Exchange under the symbol “WMB.” Its operations are located in the United States. Williams’ headquarters are located in Tulsa, Oklahoma, with other major offices in Houston, Texas; Pittsburgh, Pennsylvania; and Salt Lake City, Utah.\nTransco owns and operates an approximately 9,700-mile natural gas pipeline system extending from Texas, Louisiana, Mississippi and the Gulf of America through Alabama, Georgia, South Carolina, North Carolina, Virginia, Maryland, Delaware, Pennsylvania and New Jersey to the New York City metropolitan area. The system serves customers in Texas and the 12 southeast and Atlantic seaboard states mentioned above, including major metropolitan areas in Georgia, Washington D.C., Maryland, North Carolina, New York, New Jersey, and Pennsylvania. Transco’s principal business is the interstate transportation of natural gas, which is regulated by the FERC.\nNWP owns and operates an approximately 3,900-mile natural gas pipeline system, extending from the San Juan basin in northwestern New Mexico and southwestern Colorado through Colorado, Utah, Wyoming, Idaho, Oregon, and Washington to a point on the Canadian border near Sumas, Washington. The system serves customers in Washington, Oregon, Idaho, Wyoming, Nevada, Utah, Colorado, New Mexico, California, and Arizona, either directly or indirectly through interconnections with other pipelines. NWP’s principal business is the interstate transportation of natural gas, which is regulated by FERC.\nService Assets, Customers, and Contracts\nKey variables for Williams’ businesses will continue to be:\nObstacles to Williams’ expansion efforts, including delays or denials of necessary permits and opposition to hydrocarbon-based energy development;\nProducer drilling activities impacting natural gas supplies supporting Williams’ gathering and processing volumes;\nRetaining and attracting customers by continuing to provide reliable services;\nRevenue growth associated with additional infrastructure either completed or currently under construction;\nPrices impacting Williams’ commodity-based activities;\nDisciplined growth in Williams’ service areas.\nInterstate Natural Gas Pipeline Assets\nWilliams’ interstate natural gas pipelines, which are presented in the Transmission & Gulf of America segment as described under the heading “Business Segments,” are subject to regulation by the FERC and as such, rates and charges for the transportation of natural gas in interstate commerce are subject to regulation. The rates are established primarily through the FERC’s ratemaking process, but rates may also be negotiated with customers pursuant to the terms of tariffs and FERC policy.\nWilliams’ interstate natural gas pipelines transport and store natural gas for a broad mix of customers, including local natural gas distribution companies, public utilities, municipalities, direct industrial users, electric power generators, and natural gas marketers and producers. Most of Williams’ interstate natural gas transmission businesses are fully contracted under long-term firm reservation contracts with high credit quality customers. These contracts have various expiration dates and account for the major portion of these regulated businesses. Additionally, Williams offers storage services and interruptible transportation services under shorter-term agreements. The top ten customers of the interstate natural gas pipelines in 2024 accounted for approximately 45 percent of Williams’ regulated interstate natural gas transportation and storage revenues.\nTransco’s three largest customers in 2024 accounted for approximately 20 percent of Transco’s total operating revenues. Transco’s firm transportation agreements are generally long-term agreements with various expiration dates and account for the major portion of its business.\nDuring 2024, NWP’s three largest customers were Puget Sound Energy, Inc., Cascade Natural Gas Corporation, and Northwest Natural Gas Company, which accounted for approximately 31 percent, 10 percent, and 11 percent, respectively, of NWP total operating revenues for the year ended December 31, 2024. No other customer accounted for more than 10 percent of NWP total operating revenues during that period.\nNatural Gas Gathering and Processing Assets\nWilliams’ gathering, processing, and treating operations are presented within the Transmission & Gulf of America, Northeast G&P, and West reporting segments as described under the heading “Business Segments.”\nWilliams’ gathering systems receive natural gas from producers’ crude oil and natural gas wells and gather these volumes to gas processing, treating, or redelivery facilities. Typically, natural gas, in its raw form, is not acceptable for transportation in major interstate natural gas pipelines or for commercial use as a fuel. Williams’ treating facilities remove water vapor, carbon dioxide, and other contaminants, and collect condensate. Williams is generally paid a fee based on the volume of\n\nnatural gas gathered and/or treated, generally measured in the Btu heating value.\nIn addition, natural gas contains various amounts of NGLs, which generally have a higher value when separated from the natural gas stream. Williams’ processing plants extract the NGLs, which include ethane, primarily used in the petrochemical industry; propane, used for heating, fuel, and also in the petrochemical industry; and, normal butane, isobutane, and natural gasoline, primarily used by the refining industry.\nWilliams’ gas processing services generate revenues primarily from the following types of contracts:\nFee-based: A cash fee is received based on the volume of natural gas processed, generally measured in the Btu heating value. A portion of Williams’ fee-based processing revenue includes a share of the margins on the NGLs produced. For the year ended December 31, 2024, approximately 95 percent of NGL production volumes were under fee-based contracts.\nNoncash commodity-based: Gas is also processed under two types of commodity-based contracts, keep-whole and percent-of-liquids, where consideration for services is received in the form of NGLs. For a keep-whole arrangement Williams replaces the Btu content of the retained NGLs with natural gas purchases, also known as shrink replacement gas. For a percent-of-liquids arrangement, Williams delivers an agreed-upon percentage of the extracted NGLs and retains the remainder. Retained NGLs, referred to as equity NGL production, are then sold. Per-unit NGL margins are calculated based on sales of these equity volumes at the processing plants. For the year ended December 31, 2024, approximately 5 percent of NGL production volumes were under noncash commodity-based contracts.\nGenerally, Williams’ gathering and processing agreements are long-term agreements, with terms ranging from month-to-month to the life of the producing lease. Certain contracts include cost-of-service mechanisms that are designed to support a return on invested capital and allow gathering rates to be adjusted, subject to specified caps in certain cases, to account for variability in volume, capital expenditures, commodity price fluctuations, compression, and other expenses. Williams also has certain gas gathering and processing agreements with MVC, whereby the customer is obligated to pay a contractually determined fee based on any shortfall between the actual gathered and processed volumes and the MVC for a stated period.\nDemand for gas gathering and processing services is dependent on producers’ drilling activities, which is impacted by the strength of the economy, commodity prices, and the resulting demand for natural gas by manufacturing and industrial companies and consumers. Williams’ gathering, processing, and treating businesses do not have direct exposure to crude oil prices. Williams’ on-shore natural gas gathering and processing businesses are substantially focused on gas-directed drilling basins rather than crude oil, with a broad diversity of basins and customers served. Declines in crude oil drilling would be expected to result in less associated natural gas production, which could drive more demand for natural gas produced from gas-directed basins served.\nDuring 2024, Williams’ facilities gathered and processed gas for approximately 248 customers. The top ten customers accounted for approximately 59 percent of gathering and processing fee revenues and NGL margins from noncash commodity-based agreements. Williams believes counterparty credit concerns in its gathering and processing businesses are significantly mitigated by the physical nature of Williams’ services, where gathering occurs at the wellhead and therefore is critical to a producer’s ability to move product to market.\nGas and NGL Marketing\nWilliams’ natural gas and NGL marketing services are presented primarily within its Gas & NGL Marketing Services segment. Williams markets natural gas and NGL products to a wide range of users in the energy and petrochemical industries. In 2024, the three largest natural gas marketing customers accounted for approximately 10 percent of Williams’ gross natural gas marketing sales, and the three largest NGL marketing customers accounted for approximately 37 percent of Williams’ NGL marketing sales.\nWilliams’ gas marketing business markets natural gas and provides natural gas asset management and wholesale marketing, trading, storage, and transportation for a diverse set of natural gas and electric utilities, municipalities, power generators, and producers, including for Williams’ upstream properties. Additionally, Williams’ gas marketing business moves and optimizes natural gas to markets through transportation and storage agreements on Williams’ own strategically positioned assets. Williams’ gas and NGL marketing services provide customers with access to diverse sources of supply and to various natural gas demand markets, including the southeastern and Gulf Coast regions which are the fastest growing natural gas demand regions in the United States.\nWilliams purchases natural gas for storage when the current market price paid to buy and transport natural gas plus the cost to store and finance the natural gas is less than an estimated, forward market price that can be received in the future, resulting in positive net product sales. Commodity-based exchange-traded futures contracts and over-the-counter (OTC) contracts are used to sell natural gas at that future price to substantially protect the natural gas revenues that will ultimately be realized when the stored natural gas is sold. Additionally,",
  "item7_clean": "Gain on sale of business,\nOther segment costs and expenses,\nProportional Modified EBITDA of equity-method investments.\nincreased primarily due to:\nA $220 million increase primarily in storage revenues due to the Gulf Coast Storage Acquisition in January 2024 (see Note 3 – Acquisitions and Divestitures);\nA $121 million increase in Transco’s revenues primarily associated with expansion projects and higher park and loan services;\nA $41 million increase primarily in gathering revenues due to the Discovery Acquisition in August 2024 (see Note 3 – Acquisitions and Divestitures);\nA $38 million increase in primarily transportation and storage revenues due to the MountainWest Acquisition in February 2023 (see Note 3 – Acquisitions and Divestitures);\nA $22 million increase in NorTex’s revenues primarily associated with higher storage rates; partially offset by\nA $39 million decrease primarily in transportation revenues due to the sale of certain liquids pipelines in the Gulf Coast region in September 2023 (see Note 3 – Acquisitions and Divestitures);\nA $34 million decrease in the Eastern Gulf region primarily due to shut-ins for producer operational issues at Gulfstar One in the Gunflint and Tubular Bells fields and weather-related events, partially offset by higher primarily production handling volumes from a new well at Gulfstar One in the Pickerel field.\nOther segment costs and expenses\nincreased primarily due to:\nHigher operating expenses and administrative costs including higher operating, acquisition and transition costs related to Williams’ Gulf Coast Storage and Discovery Acquisitions, as previously discussed; and\nManagement’s Discussion and Analysis (Continued)\nemployee-related costs, including the impact of a change in a practice related to payroll timing; partially offset by significantly lower acquisition and transition costs related to Williams’ MountainWest Acquisition, as previously discussed, contract services at Transco, and operating costs related to the sale of certain liquids pipelines in the Gulf Coast region, as previously discussed;\nUnfavorable change in the amortization of regulatory pension liabilities at Transco; partially offset by\nLower project feasibility costs;\nA favorable change in equity AFUDC primarily as a result of increased capital expenditures at Williams’ regulated businesses.\nincreased primarily due to a $19 million increase from Williams’ equity NGLs primarily due to the Discovery Acquisition, as previously discussed.\nGain on sale of business\nreflects a gain recognized on the sale of certain liquids pipelines in the Gulf Coast region in September 2023, as previously discussed.\nProportional Modified EBITDA of equity-method investments\ndecreased primarily due to lower proportional results as Discovery was consolidated, as previously discussed.\nTransmission & Gulf of America Modified EBITDA\nincreased primarily due to higher\nGain on sale of business.\nincreased primarily due to:\nA $222 million increase due to the acquisition of MountainWest primarily in transportation and storage revenues;\nA $42 million increase due to the NorTex Asset Purchase primarily in storage and transportation revenues;\nA $30 million increase in the Eastern Gulf Coast region primarily due to higher production handling volumes from new wells at Devils Tower, partially offset by lower volumes from the Norphlet pipeline due to natural decline;\nA $15 million increase in Transco’s revenues associated with the Regional Energy Access expansion project placed partially in-service in the fourth quarter of 2023;\nA $12 million increase in Transco’s and Northwest Pipeline’s revenues associated with short-term firm transportation; partially offset by\nA $19 million decrease due to lower rates from the FERC rate case settlement effective January 1, 2023, at Northwest Pipeline;\nA $14 million decrease in reimbursable electric power costs and storage rates, offset by similar changes in electricity charges and storage costs, reflected in\nOther segment costs and expenses;\nA $10 million decrease due to the sale of certain liquids pipelines in the Gulf Coast region in September 2023 primarily in transportation revenues.\ndecreased primarily due to a $15 million decrease from Williams’ equity NGLs, driven by unfavorable net realized pricing for equity NGL sales, partially offset by lower prices for natural gas purchases associated with its equity NGL production activities.\nManagement’s Discussion and Analysis (Continued)\nOther segment costs and expenses\nincreased primarily due to:\nHigher operating and administrative costs including higher operating, acquisition, and transition costs related to Williams’ MountainWest Acquisition and NorTex Asset Purchase; and higher costs related to timing and scope of general maintenance activities primarily at Transco, partially offset by lower reimbursable electric power costs and storage costs, which are offset by a similar change in electricity reimbursements and storage revenues reflected in\n; and lower employee-related costs;\nHigher project feasibility costs; partially offset by\nFavorable changes associated with regulatory liabilities established for the impacts of deferred income taxes at Northwest Pipeline associated with the FERC rate case settlement mentioned above in\nand the absence of 2022 regulatory charges associated with decreases in Transco’s estimated deferred state income tax rate;\nA favorable change in equity AFUDC as a result of increased capital expenditures at Transco;\nThe absence of losses related to Eminence storage cavern abandonments in 2022.\nGain on sale of business\nreflects a gain recognized on the sale of certain liquids pipelines in the Gulf Coast region in September 2023, as previously discussed.\nYear Ended December 31,\nProduct sales and service revenues – commodity consideration (1)\nProduct costs and net processing commodity expenses (1)\nOther segment costs and expenses\nProportional Modified EBITDA of equity-method investments\nNortheast G&P Modified EBITDA\nIncluded as a component of\nNortheast G&P Modified EBITDA\nincreased primarily due to higher\nProportional Modified EBITDA of equity-method investments\n, partially offset by higher\nOther segment costs and expenses.\nincreased primarily due to:\nA $20 million increase in revenues at the Northeast JV primarily related to higher gathering volumes as well as higher transportation & fractionation, gathering, and processing rates, partially offset by lower transportation & fractionation and processing volumes;\nManagement’s Discussion and Analysis (Continued)\nA $16 million increase in joint venture operating fees primarily related to assuming operatorship of Blue Racer effective January 1, 2024, (which is significantly offset by higher\nOther segment costs and expenses\nAn $11 million increase in revenues associated with reimbursable expenses, which is offset by similar changes in the charges reflected in\nOther segment costs and expenses\n; partially offset by\nA $19 million decrease in gathering revenues at Susquehanna Supply Hub primarily related to lower volumes partially offset by escalated rates;\nA $16 million decrease in gathering revenues in the Utica Shale region primarily related to lower volumes at Flint and Cardinal partially offset by escalated rates.\nincreased due to a restructured gas purchase deal in 2024 which allowed for margin gain on residue pricing and liquids from fixed recoveries. In addition, Williams was not significantly impacted by system constraints which impacted margins in 2023.\nOther segment costs and expenses\nincreased primarily due to higher employee-related costs, including the impact of a change in a practice related to payroll timing, as well as higher operating expenses, including higher electricity and fuel, and increased support costs related to assuming operatorship of Blue Racer effective January 1, 2024 (substantially offset by higher\ndiscussed above). The increase was partially offset by lower maintenance expenses and the absence of the 2023 loss contingency accrual.\nProportional Modified EBITDA of equity-method investments\nincreased at Aux Sable Liquid Products LP primarily due to the absence of Williams’ $31 million share of a loss contingency accrual related to its former ownership in 2023, as well as the terms of the new product marketing agreement, partially offset by the sale of Williams’ investment in Aux Sable Liquid Products LP in the third quarter of 2024. Additionally, Appalachia Midstream Investments increased primarily driven by higher gathering rates partially offset by lower volumes and higher expenses.\nNortheast G&P Modified EBITDA\nincreased primarily due to higher\n, partially offset by lower\nProportional Modified EBITDA of equity-method investments\nOther segment costs and expenses\nincreased primarily due to:\nA $92 million increase in revenues at the Northeast JV primarily related to higher transportation & fractionation, processing, and gathering volumes as well as higher processing rates;\nAn $84 million increase in revenues in the Utica Shale region primarily related to higher gathering rates resulting from annual cost-of-service contract redeterminations and higher volumes, partially offset by the absence of proceeds from the release of an acreage dedication in 2022;\nA $61 million increase in gathering revenues at Susquehanna Supply Hub primarily related to escalated rates as well as higher volumes.\nOther segment costs and expenses\nincreased primarily due to increased scope of operations, a loss contingency accrual, and higher operating taxes.\nProportional Modified EBITDA of equity-method investments\ndecreased at Laurel Mountain due to lower commodity-based gathering rates, MVC, and volumes, and at Aux Sable Liquid Products LP primarily due to Williams’ $31 million share of a loss contingency accrual related to its former ownership in 2023. The decrease was partially offset by an increase at Blue Racer primarily driven by higher gathering and processing volumes. Additionally, Appalachia Midstream Investments increased primarily driven by higher gathering volumes and\nManagement’s Discussion and Analysis (Continued)\nannual rate escalations at Marcellus South, partially offset by lower gathering rates resulting from annual cost-of-service contract redeterminations and lower volumes at the Bradford Supply Hub.\nYear Ended December 31,\nProduct sales and service revenues – commodity consideration (1)\nNet realized gain (loss) from commodity derivatives relating to service revenues\nNet realized gain (loss) from commodity derivatives relating to product sales (1)\nNet realized gain (loss) from commodity derivatives\nProduct costs and net processing commodity expenses (1)\nOther segment costs and expenses\nProportional Modified EBITDA of equity-method investments\nWest Modified EBITDA\n(1) Included as a component of\nWest Modified EBITDA\nincreased primarily due higher\npartially offset by higher\nOther segment costs and expenses,\nan unfavorable change in\nNet realized gain (loss) from commodity derivatives relating to service revenues,\nProportional Modified EBITDA of equity-method investments.\nincreased primarily due to:\nA $249 million increase in the DJ Basin region associated with the DJ Basin Acquisitions in November 2023 (see Note 3 – Acquisitions and Divestitures);\nA $35 million increase in other NGL operations associated with higher fractionation and transportation revenue due to higher volumes and higher storage fees primarily due to a new contract;\nA $14 million increase in the Wamsutter region primarily associated with higher gathering volumes from increased producer activity as well as higher volumes associated with the absence of weather-related events in first-quarter 2023;\nA $12 million increase associated with reimbursable compressor power and fuel purchases primarily due to the DJ Basin Acquisitions as previously discussed, which are offset by similar changes in\nOther segment costs and expenses\n; partially offset by\nA $45 million decrease in the Haynesville Shale region primarily due to lower gathering volumes from decreased producer activity, partially offset by higher gathering rates;\nA $31 million decrease in the Eagle Ford Shale region primarily due to lower MVC revenues;\nManagement’s Discussion and Analysis (Continued)\nA $24 million decrease in the Barnett Shale region primarily due to lower gathering rates driven by unfavorable commodity pricing and lower gathering volumes.\nNet realized gain (loss) from commodity derivatives relating to service revenues\nreflects an unfavorable change in settled commodity prices relative to Williams’ natural gas hedge positions.\nincreased $63 million primarily due to $39 million higher margins associated with the DJ Basin Acquisitions, as previously discussed. Margins also increased $21 million from Williams’ equity NGLs primarily due to lower net realized prices for natural gas purchases and lower volumes of natural gas purchased both associated with equity NGL production activities; partially offset by lower volumes of equity NGL sold and lower net realized NGL sales prices.\nOther segment costs and expenses\nincreased primarily due to higher operating and employee-related expenses including those resulting from the DJ Basin Acquisitions, as previously discussed, the absence of favorable contract settlements in first-quarter 2023, an unfavorable change in Williams’ net imbalance liability due to changes in pricing, higher reimbursable compressor power and fuel purchases which are offset in\n, and the impact of a change in a practice related to payroll timing; partially offset by higher system gains and the absence of a fourth quarter 2023 write-down of assets held for sale.\nProportional Modified EBITDA of equity-method investments\ndecreased primarily due to lower proportional results as RMM was consolidated related to the DJ Basin Acquisitions, as previously discussed, partially offset by higher volumes and higher commodity prices at OPPL.\nWest Modified EBITDA\nincreased primarily due to a favorable change in\nNet realized gain (loss) from commodity derivatives relating to service revenues,\nProportional Modified EBITDA of equity-method investments,\nOther segment costs and expenses,\npartially offset by lower\ndecreased primarily due to:\nA $120 million decrease in the Barnett Shale region primarily due to lower gathering rates driven by unfavorable commodity pricing;\nA $13 million decrease in the Eagle Ford Shale region primarily due to lower MVC revenues, partially offset by escalated gathering rates and higher gathering volumes;\nA $6 million decrease associated with reimbursable compressor power and fuel purchases primarily due to lower prices, which are offset by similar changes in\nOther segment costs and expenses\n; partially offset by\nA $69 million increase in the Haynesville Shale region primarily associated with higher gathering volumes including from increased producer activity and the Trace Acquisition in April 2022, partially offset by lower rates driven by unfavorable commodity pricing;\nA $25 million increase in the DJ Basin region primarily associated with the DJ Basin Acquisitions in November 2023 as previously discussed;\nA $15 million increase in our other NGL operations associated with higher storage fees primarily due to a new contract as well as higher fractionation fees primarily due to higher volumes partially offset by lower rates from lower natural gas prices.\nNet realized gain (loss) from commodity derivatives relating to service revenues\nreflects a favorable change in settled commodity prices relative to Williams’ natural gas hedge positions.\ndecreased $68 million primarily due a $46 million decrease from Williams’ equity NGLs and a $14 million decrease from other sales activities, both primarily due to lower net realized commodity pricing.\nManagement’s Discussion and Analysis (Continued)\nOther segment costs and expenses\ndecreased primarily due to a favorable change in Williams’ net imbalance liability due t",
  "item2_clean": null
}