{
  "source_file": "wrb-20250930.htm",
  "form_type": "10-Q",
  "item1_clean": null,
  "item7_clean": null,
  "item2_clean": "In examining reserve adequacy, several factors are considered in estimating the ultimate economic value of losses. These factors include, among other things, historical data, legal developments, changes in social attitudes and economic conditions, including the effects of inflation. The actuarial process relies on the basic assumption that past experience, adjusted judgmentally for the effects of current developments and anticipated trends, is an appropriate basis for predicting future outcomes. Reserve amounts are based on management’s informed estimates and judgments using currently available data. As additional experience and other data become available and are reviewed, these estimates and judgments may be revised. This may result in reserve increases or decreases that would be reflected in our results in periods in which such estimates and assumptions are changed.\nReserves do not represent an exact calculation of liability. Rather, reserves represent an estimate of what management expects the ultimate settlement and claim administration will cost. While the methods for establishing reserves are well tested over time, some of the major assumptions about anticipated loss emergence patterns are subject to uncertainty. These estimates, which generally involve actuarial projections, are based on management’s assessment of facts and circumstances then known, as well as estimates of trends in claims severity and frequency, judicial theories of liability and other factors, including the actions of third parties which are beyond the Company’s control. These variables are affected by external and internal events, such as inflation and economic volatility, judicial and litigation trends, reinsurance coverage, legislative changes and claim handling and reserving practices, which make it more difficult to accurately predict claim costs. The inherent uncertainties of estimating reserves are greater for certain types of liabilities where long periods of time elapse before a definitive determination of liability is made. Because setting reserves is inherently uncertain, the Company cannot provide assurance that its current reserves will prove adequate in light of subsequent events.\nLoss reserves included in the Company’s financial statements represent management’s best estimates based upon an actuarially derived point estimate and other considerations. The Company uses a variety of actuarial techniques and methods to derive an actuarial point estimate for each operating unit. These methods include paid loss development, incurred loss development, paid and incurred Bornhuetter-Ferguson methods and frequency and severity methods. In circumstances where one actuarial method is considered more credible than the others, that method is used to set the point estimate. For example, the paid loss and incurred loss development methods rely on historical paid and incurred loss data. For new lines of business, where there is insufficient history of paid and incurred claims data, or in circumstances where there have been significant changes in claim practices, the paid and incurred loss development methods would be less credible than other actuarial methods. The actuarial point estimate may also be based on a judgmental weighting of estimates produced from each of the methods considered. Industry loss experience is used to supplement the Company’s own data in selecting “tail factors” and in areas where the Company’s own data is limited. The actuarial data is analyzed by line of business, coverage and accident or policy year, as appropriate, for each operating unit.\nThe establishment of the actuarially derived loss reserve point estimate also includes consideration of qualitative factors that may affect the ultimate losses. These qualitative considerations include, among others, the impact of re-underwriting initiatives, changes in the mix of business, changes in distribution sources and changes in policy terms and conditions. Examples of changes in terms and conditions that can have a significant impact on reserve levels are the use of aggregate policy limits, the expansion of coverage exclusions, whether or not defense costs are within policy limits, and changes in deductibles and attachment points.\nThe key assumptions used to arrive at the best estimate of loss reserves are the expected loss ratios, rate of loss cost inflation, and reported and paid loss emergence patterns. Expected loss ratios represent management’s expectation of losses at the time the business is written, before any actual claims experience has emerged. This expectation is a significant determinant of the estimate of loss reserves for recently written business where there is little paid or incurred loss data to consider. Expected loss ratios are generally derived from historical loss ratios adjusted for the impact of rate changes, loss cost trends and known changes in the type of risks underwritten. Expected loss ratios are estimated for each key line of business within each operating unit. Expected loss cost inflation is particularly important for the long-tail lines, such as excess casualty, and claims with a high medical component, such as workers’ compensation. Reported and paid loss emergence patterns are used to project current reported or paid loss amounts to their ultimate settlement value. Loss development factors are based on the historical emergence patterns of paid and incurred losses, and are derived from the Company’s own experience and industry data. The paid loss emergence pattern is also significant to excess and assumed workers’ compensation reserves because those reserves are discounted to their estimated present value based upon such estimated payout patterns. Management believes the estimates and assumptions it makes in the reserving process provide the best estimate of the ultimate cost of settling claims and related expenses with respect to insured events which have occurred; however, different assumptions and variables could lead to significantly different reserve estimates.\n\nFollowing is a summary of the Company’s reserves for losses and loss expenses by business segment:\nReinsurance & Monoline Excess\nNet reserves for losses and loss expenses\nCeded reserves for losses and loss expenses\nGross reserves for losses and loss expenses\nFollowing is a summary of the Company’s net reserves for losses and loss expenses by major line of business:\nProfessional liability\nWorkers’ compensation (1)\nShort-tail lines (2)\nReinsurance & Monoline Excess (1) (3)\nProfessional liability\nWorkers’ compensation (1)\nShort-tail lines (2)\nReinsurance & Monoline Excess (1) (3)\n(1) Reserves for workers’ compensation and Reinsurance & Monoline Excess are net of an aggregate net discount of $417 million and $405 million as of September 30, 2025 and December 31, 2024, respectively.\n(2) Short-tail lines include commercial multi-peril (non-liability), inland marine, accident and health, fidelity and surety, boiler and machinery, high net worth homeowners and other lines.\n(3) Reinsurance & Monoline Excess includes property and casualty reinsurance, as well as operations that solely retain risk on an excess basis and certain program management business.\nThe Company evaluates reserves for losses and loss adjustment expenses on a quarterly basis. Changes in estimates of prior year losses are reported when such changes are made. The changes in prior year loss reserve estimates are generally the result of ongoing analysis of recent loss development trends. Original estimates are increased or decreased as additional information becomes known regarding individual claims and aggregate claim trends.\nCertain of the Company's insurance and reinsurance contracts are retrospectively rated, whereby the Company collects more or less premiums based on the level of loss activity. For those contracts, changes in loss and loss adjustment expenses for prior years may be fully or partially offset by additional or return premiums.\nNet prior year development (i.e., the sum of prior year reserve changes and prior year earned premiums changes) for the nine months ended September 30, 2025 and 2024 are as follows:\n\nManagement’s Discussion and Analysis of Financial Condition and Results of Operations\nW. R. Berkley Corporation is an insurance holding company that is among the largest commercial lines writers in the United States and operates worldwide in two segments of the property and casualty business: Insurance and Reinsurance & Monoline Excess. Our decentralized structure provides us with the flexibility to respond quickly and efficiently to local or specific market conditions and to pursue specialty business niches. It also allows us to be closer to our customers in order to better understand their individual needs and risk characteristics. While providing our businesses with certain operating autonomy, our structure allows us to capitalize on the benefits of economies of scale through centralized capital, investment, reinsurance, enterprise risk management, and actuarial, financial and corporate legal staff support. The Company’s primary sources of revenues and earnings are its insurance operations and its investments.\nAn important part of our strategy is to form new businesses to capitalize on various market opportunities. Over the years, the Company has formed numerous businesses that are focused on important parts of the economy in the U.S., including healthcare, cyber security, energy and agriculture, and on growing international markets, including the Asia-Pacific region, South America and Mexico.\nThe profitability of the Company’s insurance business is affected primarily by the adequacy of premium rates. The ultimate adequacy of premium rates is not known with certainty at the time an insurance policy is issued because premiums are determined before claims are reported. The ultimate adequacy of premium rates is affected mainly by the severity and frequency of claims, which are influenced "
}