{
  "source_file": "wsm-20251102.htm",
  "form_type": "10-Q",
  "item1_clean": null,
  "item7_clean": null,
  "item2_clean": "For the Thirteen Weeks Ended\nFor the Thirty-nine Weeks Ended\nIncludes occupancy expenses of $206.5 million and $195.0 million for the third quarter of fiscal 2025 and fiscal 2024, respectively, and $605.6 million and $588.3 million for the first thirty-nine weeks of fiscal 2025 and fiscal 2024, respectively.\nThird Quarter of Fiscal 2025 vs. Third Quarter of Fiscal 2024\nGross profit increased $50.2 million, or 6.1%, compared to the third quarter of fiscal 2024. Gross margin increased to 46.1% from 45.4% in the third quarter of fiscal 2024. This increase in gross margin of 70 basis points was primarily driven by higher merchandise margins of 60 basis points due to (i) the flow-through of tariffs into cost of goods sold being slower than anticipated due to delayed tariff effective dates, (ii) results from our tariff mitigation plan, including select price increases, and (iii) lower inbound transportation costs. Additionally, supply chain efficiencies contributed 30 basis points, including reductions in outbound shipping expense, damages, replacements and accommodations. These improvements were partially offset by higher occupancy costs of 20 basis points due to our retail outperformance and the higher occupancy costs in that channel.\nFirst Thirty-nine Weeks of Fiscal 2025 vs. First Thirty-nine Weeks of Fiscal 2024\nGross profit increased $81.5 million, or 3.4%, compared to the first thirty-nine weeks of fiscal 2024. Gross margin decreased to 45.8% from 46.0% in the first thirty-nine weeks of fiscal 2024. This decrease in gross margin of 20 basis points was driven by (i) the out-of-period freight adjustment in the first quarter of fiscal 2024 of 90 basis points, partially offset by (ii) supply chain efficiencies of 40 basis points, including reductions in damages, replacements and accommodations, (iii) higher merchandise margins of 20 basis points, and (iv) the leverage of occupancy costs of 10 basis points resulting from higher sales.\nSELLING, GENERAL AND ADMINISTRATIVE EXPENSES\nSG&A consists of non-occupancy related costs associated with our retail stores and e-commerce websites, distribution and manufacturing facilities, customer care centers, supply chain operations (buying, receiving and inspection) and corporate administrative functions. These costs include employment, advertising, third party credit card processing, impairment and other general expenses.\nFor the Thirteen Weeks Ended\nFor the Thirty-nine Weeks Ended\nSelling, general and administrative expenses\nThird Quarter of Fiscal 2025 vs. Third Quarter of Fiscal 2024\nSG&A increased $36.1 million, or 7.0%, compared to the third quarter of fiscal 2024. SG&A as a percentage of net revenues increased to 29.1% from 28.5% in the third quarter of fiscal 2024. This increase of 60 basis points was primarily driven by (i) an increase in employment expense of 50 basis points due to higher performance-based incentive compensation and (ii) an increase in advertising expenses of 20 basis points, partially offset by (iii) general expense leverage of 10 basis points.\nFirst Thirty-nine Weeks of Fiscal 2025 vs. First Thirty-nine Weeks of Fiscal 2024\nSG&A increased $43.6 million, or 2.9%, compared to the first thirty-nine weeks of fiscal 2024. SG&A as a percentage of net revenues decreased to 28.6% from 28.9% in the first thirty-nine weeks of fiscal 2024. This leverage of 30 basis points was primarily driven by (i) lower advertising expenses of 40 basis points and (ii) lower general expenses of 20 basis points, partially offset by (iii) an increase in employment expense of 30 basis points due to higher performance-based incentive compensation.\nINCOME TAXES\nThe effective tax rate was 25.4% for the first thirty-nine weeks of fiscal 2025, compared to 24.2% for the first thirty-nine weeks of fiscal 2024. The increase was primarily driven by (i) lower excess tax benefit from stock-based compensation in the first thirty-nine weeks of fiscal 2025, (ii) the tax effect of the change in earnings mix and (iii) the tax benefit of state amended returns filed in fiscal 2024.\nOn July 4, 2025, the One Big Beautiful Bill Act (“OBBB”) was signed into law in the United States. The OBBB includes a broad range of tax reform provisions, including permanently extending and modifying certain expiring provisions of the 2017 Tax Cuts and Jobs Act. The legislation has multiple effective dates, with certain provisions becoming effective in fiscal 2025 and the majority taking effect in future years. We currently expect the OBBB to have a minimal impact on the effective tax rate but result in favorable cash tax impacts in fiscal 2025 as a result of certain accelerated tax deductions.\nSince the Organization for Economic Co-operation and Development (“OECD”) announced the OECD/G20 Inclusive Framework on Base Erosion and Profit Shifting (“Framework”) in 2021, a number of countries have begun to enact legislation to implement the OECD international tax framework, including the Pillar Two minimum tax regime. Our subsidiaries were not subject to Pillar Two minimum tax in the first thirty-nine weeks of fiscal 2025. We are continuing to evaluate the potential impact on future periods of the Pillar Two Framework, and monitoring legislative developments by other countries, especially in the regions in which we operate.\nLIQUIDITY AND CAPITAL RESOURCES\nMaterial Cash Requirements\nThere were no material changes during the quarter to the Company’s material cash requirements, commitments and contingencies that are described in\nStock Repurchase Program and Dividends\nto our Condensed Consolidated Financial Statements,\nStock Repurchase Program and Dividends,\nFor the remainder of fiscal 2025, we plan to use our cash resources to fund our inventory purchases, employment-related costs, advertising and marketing initiatives, rental payments on our leases, capital expenditures, dividend payments, stock repurchases, and the payment of income taxes.\nWe believe our cash on hand, cash flows from operations and our available credit facilities will provide adequate liquidity for our business operations as well as dividends, capital expenditures, stock repurchases and other liquidity requirements associated with our business operations over the next 12 months. We are currently not aware of any other trends or demands, commitments, events or uncertainties that will result in, or that are reasonably likely to result in, our liquidity increasing or decreasing in any material way that would impact our capital needs during or beyond the next 12 months.\nSources of Liquidity\nAs of November 2, 2025, we held $884.7 million in cash and cash equivalents, the majority of which was held in money market funds and interest-bearing demand deposit accounts, and of which $64.2 million was held by our international subsidiaries. Consistent with our industry, our cash balances are seasonal in nature, with the fourth quarter historically representing a significantly higher level of cash than other periods.\nIn addition to our cash balances on hand, in June 2025, we amended our existing credit facility, which increased our unsecured revolving line of credit to $600 million, amended certain interest rates and extended the maturity date of the facility to June 26, 2030, in addition to other updates (the “Credit Facility”). Our Credit Facility may be used to borrow revolving loans or to request the issuance of letters of credit. We may, upon notice to the administrative agent, request existing or new lenders, at such lenders’ option, to increase the Credit Facility by up to $250 million to provide for a total of up to $850 million of unsecured revolving credit.\nDuring the thirteen and thirty-nine weeks ended November 2, 2025 and October 27, 2024, we had no borrowings under our Credit Facility. Additionally, as of November 2, 2025, issued but undrawn standby letters of credit of $12.0 million were outstanding under our Credit Facility. The standby letters of credit were primarily issued to secure the liabilities associated with workers’ compensation and other insurance programs.\nOur Credit Facility contains certain restrictive loan covenants, including, among others, a financial covenant requiring a maximum leverage ratio (funded debt adjusted for operating lease liabilities to earnings before interest, income tax, depreciation, amortization and rent expense), and covenants limiting our ability to incur indebtedness, grant liens, make acquisitions, merge or consolidate, and dispose of assets. As of November 2, 2025, we were in compliance with our financial covenants under our Credit Facility and, based on our current projections, we expect to remain in compliance throughout the next 12 months.\nLetter of Credit Facilities\nWe have three unsecured letter of credit facilities for a total of $35 million. Our letter of credit facilities contain covenants that are consistent with our Credit Facility. Interest on unreimbursed amounts under our letter of credit facilities accrues at a base rate as defined in the Credit Facility, plus an applicable margin based on our leverage ratio. As of November 2, 2025, the aggregate amount outstanding under our letter of credit facilities was $0.6 million, which represents only a future commitment to fund inventory purchases to which we had not taken legal title. On August 7, 2025, we renewed two of our letter of credit facilities totaling $30 million on substantially similar terms. The two letter of credit facilities mature on August 18, 2026, and the latest expiration date possible for future letters of credit issued under these facilities is January 15, 2027. One of the letter of credit facilities totaling $5 million matures on June 26, 2030, which is also the latest expiration date possible for future letters of credit issued under the facility.\nCash Flows from Operating Activities\nFor the first thirty-nine weeks of fiscal 2025, net cash provided by operating activities was $718.0 million compared to $726.7 million for the firs"
}