{
  "source_file": "wtw-20241231.htm",
  "form_type": "10-K",
  "item1_clean": "The FCA has a sole strategic objective: to ensure that the relevant markets function well. Its operational objectives are to secure an appropriate degree of protection for consumers, to protect and enhance the integrity of the U.K. financial system, and to promote effective competition in the interests of consumers. The FCA has a wide range of rule-making, investigatory and enforcement powers (including the power to censure and fine) and conducts monitoring visits to assess our compliance with regulatory requirements. In addition, the FCA extended the Senior Managers and Certification Regime (‘SMCR’) which became effective on December 9, 2019 in relation to our U.K. FCA-regulated businesses. The SMCR is designed to drive improvements in culture and governance within financial services firms and to deter misconduct by increasing individual accountability to the FCA.\n\nCompetition on premium rates has also exacerbated the pressures caused by a continuing reduction in demand in some classes of business. For example, rather than purchase additional insurance through brokers, some insureds have been retaining a greater proportion of their risk portfolios than previously. Industrial and commercial companies increasingly rely upon their own subsidiary insurance companies, known as captive insurance companies, self-insurance pools, risk retention groups, mutual insurance companies and other mechanisms for funding their risks, rather than buy insurance. Additional competitive pressures have arisen and are expected to continue to arise from the entry and expansion of new market participants, such as banks, accounting firms, new brokers and insurance carriers themselves, offering risk management or transfer services.\n\n— Our Investments business provides advice and discretionary investment management solutions to defined benefit and defined contribution pension plans as well as to a range of other client types including insurers, endowments and foundations, and private wealth investors. We provide a solution to a significant business problem faced by our clients, namely sustaining the resources and skills required to deliver a financial services product in highly competitive capital markets. We offer a flexible approach that adapts to a wide range of client needs and circumstances, with the objective of higher returns, lower risk and lower costs within each client’s unique situation.\n\nImran Qureshi (age 54)\n- Mr. Qureshi has served as Head of North America at WTW since August 30, 2021 and took on the additional role as Head of Integrated & Global Solutions in June 2023. Prior to that, he served as the Co-Leader, U.S. from February 2017 to August 30, 2021. He served as Region Leader, U.S. Midwest from February 2017 to October 2019, and was Market Leader, Greater Chicago and Wisconsin from February 2016 to February 2017. Mr. Qureshi was Managing Consultant of the Chicago office from January 2013 to January 2016, and has been with WTW in other roles since March 1999. Mr. Qureshi is currently a board director at Smithbucklin and The Executives' Club of Chicago. Previously, he was the board chair of the Human Resources Management Association of Chicago, and he served on the M&A Faculty of WorldatWork where he taught M&A and taught the International Benefits Course for the International Foundation of Employee Benefit Plans. In 2004, Mr. Qureshi was honored by Business Insurance magazine as one of ‘40 Under 40 People to Watch’ in the commercial insurance and risk/benefits management services industries. He also has lectured on governance and globalization at The Kellogg School of Management at Northwestern University and The University of Chicago Booth School of Business. Mr. Qureshi holds a bachelor’s degree in pure mathematics and statistics with honors from the University of Manchester in the U.K. and has an actuarial background.\n\nWTW offers its clients a broad range of services and solutions to help them to identify and control their risks, and to enhance business performance by improving their ability to attract, retain and engage a talented workforce. Our risk control services range from strategic risk consulting (including providing actuarial analysis) to a variety of due diligence services, to the provision of practical on-site risk control services (such as health and safety or property loss control consulting), as well as analytical and advisory services (such as hazard modeling and climate risk quantification). We assist clients in planning how to manage incidents or crises when they occur. These services include contingency planning, security audits and product tampering plans. We help our clients enhance their business performance by delivering consulting services, technology and solutions that help them anticipate, identify and capitalize on emerging opportunities in human capital management, as well as offer investment advice to help them develop disciplined and efficient strategies to meet their investment goals.\n\nAnne Pullum (age 42)\n- Ms. Pullum has served as Head of Europe at WTW since August 30, 2021 and co-head of Corporate Development since October 25, 2024. Prior to that, Ms. Pullum served as Head of Western Europe from May 31, 2019 to August 30, 2021 and as the Chief Administrative Officer and Head of Strategy and Innovation since October 27, 2016. Beginning on January 4, 2016, Ms. Pullum served as WTW’s Head of Strategy, where she has played a key role in determining the Company’s strategy and worked across all business segments and functional areas. Previously, Ms. Pullum served as the Head of Strategy for Willis Group since May 2014. Before joining Willis, Ms. Pullum worked at McKinsey & Company, where she served financial services and natural resource clients since October 2010. Prior to that, Ms. Pullum conducted economic research at Greenspan Associates in Washington, D.C. and served as an analyst in the Goldman Sachs Equities Division in London. Ms. Pullum holds an M.B.A. from INSEAD and a bachelor’s degree in international economics from Georgetown University’s School of Foreign Service.\n\nKristy D. Banas (age 51)\nMs. Banas has served as Chief Human Resources Officer and Head of Marketing and Communications since May 1, 2023. Prior to that, she served as Chief Human Resources Officer from August 16, 2021. She also served as the Senior Director, Global Talent Advisor for Human Capital & Benefits from March 2019 to August 2021 and as Senior Director and Head of Global Total Rewards, HR Integration and the HR Business Office from November 2016 to March 2019. From January 2016 to November 2016, Ms. Banas served as Senior Director and Global HR Leader, WTW Operations and Technology. From July 2011 to January 2016, Ms. Banas served as Senior Vice President, Global HR Director for WTW Corporate Functions, and was the Executive HR Sponsor for Global Operations Improvement. Ms. Banas was Vice President and Global HR Partner with XL Capital/XL Global Services/XL Insurance from November 2001 to June 2011. Ms. Banas has a BS in Business Management from Fairfield University and a partial MS in Human Resource Management from the University of Connecticut.\n\nOur clients operate on a global and local scale in a multitude of businesses and industries throughout the world and generally range in size from large, major multinational corporations to middle-market domestic and international companies. Our clients include many of the world’s leading corporations, including approximately 96% of the FTSE 100, 89% of the Fortune 1000, and 90% of the Fortune Global 500 companies. We also advise the majority of the world’s leading insurance companies. We work with major corporations, emerging growth companies, governmental agencies and not-for-profit institutions in a wide variety of industries, with many of our client relationships spanning decades. None of the Company’s clients individually represented more than 10% of its consolidated revenue for each of the years ended December 31, 2024, 2023 and 2022. We place insurance with approximately 2,500 insurance carriers, none of which individually accounted for a significant concentration of the total premiums we placed on behalf of our clients in 2024, 2023 or 2022.\n\nCertain of our entities that undertake pension scheme management are subject to MiFID (Markets in Financial Instruments Directive) and MiFIR (the Markets in Financial Instruments Regulation). In addition, revisions to MiFID (‘MiFID II’) took effect in January 2018. These revisions are aimed at strengthening investor protection and improving the function of financial markets. MiFID II imposes a variety of requirements that include, among others, rules relating to product governance and independent investment advice, responsibility of management bodies, inducements, information and reporting to clients, cross-selling, remuneration of staff, and best execution of trades for clients. Further, some of our entities are also authorized and regulated by certain financial services authorities in countries such as Sweden, Ireland, the Netherlands and the U.K.\n\nWe derive the majority of our revenue from either commissions or fees for brokerage or consulting services. We do not determine the insurance premiums on which our commissions are generally based. Commission levels generally follow the same trend as premium levels as they are derived from a percentage of the premiums paid by the insureds. Fluctuations in these premiums charged by the insurance carriers can therefore have a direct and potentially material impact on our results of operations. Our fees for consulting services are spread across a variety of complementary businesses that generally remain steady during times of uncertainty. We have some businesses, such as our health and benefits and administration businesses, which can be counter cyclical during the early period of a significant economic change.\n\n— Through Affinity, we arrange insurance products and services for our affinity client partners to offer to their customers, employees, or members alongside, or in addition to, their principal business offerings.\n\nFurthermore, certain of our activities are subject to regulation under the Health Insurance Portability and Accountability Act (‘HIPAA’), which is enforced by the Office for Civil Rights within the Department of Health and Human Services. As we implement and expand our direct-to-consumer sales and marketing solutions through our Benefits Delivery & Administration business, we are subject to various federal and state laws and regulations that prescribe when and how we may market to consumers (including, without limitation, the Telephone Consumer Protection Act and other telemarketing laws and the Medicare Communications and Marketing Guidelines issued by the Center for Medicare Services).\n\nRevenue for our career-related businesses is partly seasonal in nature, with heightened activity in the second half of the calendar year during the annual compensation, benefits and survey cycles. While these businesses enjoy long-term relationships with many clients, work in some parts of the businesses is project-based and can be sensitive to economic changes. The businesses benefit from regulatory changes affecting our clients that require strategic advice, program changes and communication, the redefinition of jobs, work location and career paths as technology disaggregates work, and the recalibration of pay and the employee experience amidst shifting labor markets.\n\nOur activities in connection with insurance brokerage services within the U.S. are subject to regulation and supervision by state authorities. Although the scope of regulation and form of supervision may vary from state to state, insurance laws in the United States are often complex and generally grant broad discretion to supervisory authorities in adopting regulations and supervising regulated activities. That supervision generally includes the licensing of insura",
  "item7_clean": "These consolidated financial statements conform to U.S. GAAP, which requires management to make estimates and assumptions that affect the reported amounts of assets and liabilities, disclosures of contingent assets and liabilities at the date of the financial statements and the reported amounts of revenue and expenses during the reporting period. Our estimates, judgments and assumptions are continually evaluated based on available information and experience. Because of the use of estimates inherent in the financial reporting process, actual results could differ from those estimates. The areas that we believe include critical accounting estimates are revenue recognition, costs to fulfill under our broking contracts, valuation of billed and unbilled receivables from clients, income taxes, commitments, contingencies and accrued liabilities, pension assumptions, and goodwill and intangible assets. The critical accounting estimates discussed below involve making difficult, subjective or complex accounting estimates that could have a material effect on our financial condition and results of operations. These critical accounting estimates require us to make assumptions about matters that are highly uncertain at the time of the estimate or assumption. Different estimates that we could have used, or changes in estimates that are reasonably likely to occur, may have a material effect on our results of operations and financial condition.\n\nHWC segment revenue for the years ended December 31, 2024 and 2023 was $5.8 billion and $5.6 billion, respectively. Organic revenue growth in Health was achieved across all regions with the continued expansion of our Global Benefits Management client portfolio being a meaningful driver. Our Wealth businesses generated organic revenue growth from our Investments-related solutions and higher levels of Retirement work. Career had organic revenue growth from increased survey sales, product revenue and advisory project work. Benefits Delivery & Outsourcing revenue was materially flat, as growth in Outsourcing from regulatory-driven project work and new-client wins was largely offset by decreased revenue in TRANZACT.\n\nWTW considers several factors prior to the start of each fiscal year when determining the appropriate annual assumptions, including economic forecasts, relevant benchmarks, historical trends, portfolio composition and peer company comparisons. These assumptions, used to determine our pension liabilities and pension expense, are reviewed annually by senior management and changed when appropriate. A discount rate will be changed annually if underlying rates have moved, whereas an expected long-term return on assets will be changed less frequently as longer-term trends in asset returns emerge or long-term target asset allocations are revised. To calculate the discount rate, we use the granular approach to determining service cost and interest cost. The expected rate of return assumptions for all plans are supported by an analysis of the weighted-average yield expected to be achieved with the anticipated makeup of investments. We have allowed for actual and known inflation in preparing our estimates. Other material assumptions include rates of participant mortality, and the expected long-term rates of compensation and pension increases.\n\nRestructuring costs and transaction and transformation – Management believes it is appropriate to adjust for restructuring costs and transaction and transformation when they relate to a specific significant program with a defined set of activities and costs that are not expected to continue beyond a defined period of time, or significant acquisition-related transaction expenses. We believe the adjustment is necessary to present how the Company is performing, both now and in the future when the incurrence of these costs will have concluded.\n\nOther global economic events, such as accommodative monetary and fiscal policy, supply chain disruptions and geopolitical tensions beyond the aforementioned ongoing wars, contributed to significant inflation across the globe. In particular, inflation in the United States, Europe and other geographies has risen to levels not experienced in recent decades, and while this has eased somewhat in the last year, we are seeing its impact on various aspects of our business. Moreover, U.S. and global economic conditions have created market uncertainty and volatility. Such general economic conditions, including inflation, stagflation, political volatility, costs of labor, cost of capital, interest rates, bank stability, credit availability and tax rates, affect our cost of doing business, including our operating and general and administrative expenses, and we have no control or limited ability to control such factors. These general economic conditions impact revenue, including revenue from customers as well as income from funds we hold on behalf of customers and pension-related income.\n\nAdjusted EBITDA for the year ended December 31, 2024 was $2.7 billion, compared to $2.4 billion for the year ended December 31, 2023, an increase of $278 million. This increase resulted primarily from higher revenue, and increased margin expansion as a result of benefits recognized from our Transformation program, in the current year, partially offset by higher salary expense and increased incentive and benefit costs in the current year as compared to the prior year.\n\nAdjusted EBITDA is defined as net (loss)/income adjusted for provision for income taxes, interest expense, impairment, depreciation and amortization, restructuring costs, transaction and transformation, gains and losses on disposals of operations and non-recurring items that, in management’s judgment, significantly affect the period-over-period assessment of operating results. Adjusted EBITDA margin is calculated by dividing adjusted EBITDA by revenue.\n\nAdjusted operating income increased for the year ended December 31, 2024 to $2.4 billion, from $2.1 billion for the year ended December 31, 2023. This increase resulted primarily from higher revenue, and increased margin expansion as a result of benefits recognized from our Transformation program, in the current year, partially offset by higher salary expense and increased incentive and benefit costs in the current year as compared to the prior year.\n\nOther operating expenses for both years ended December 31, 2024 and 2023 were $1.8 billion, an increase of $18 million, or 1%. The increase was primarily due to higher non-income-related tax expense and higher travel and entertainment costs, partially offset by lower occupancy costs, primarily attributable to our Transformation program, and lower professional service expenses for the current year as compared to the prior year.\n\nOur adjusted diluted earnings per share increased for the year ended December 31, 2024 as compared to the year ended December 31, 2023 primarily from higher revenue, and increased margin expansion as a result of benefits recognized from our Transformation program, in the current year, partially offset by higher salary expense and increased incentive and benefit costs in the current year as compared to the prior year.\n\nAdjusted operating income is defined as income from operations adjusted for impairment, amortization, restructuring costs, transaction and transformation and non-recurring items that, in management’s judgment, significantly affect the period-over-period assessment of operating results. Adjusted operating income margin is calculated by dividing adjusted operating income by revenue.\n\nThe markets for our consulting, technology and solutions, and marketplace services are affected by economic, regulatory and legislative changes, technological developments, and increased competition from established and new competitors. We believe that the primary factors in selecting a human resources or risk management consulting company include reputation, the ability to provide measurable increases to shareholder value and return on investment, global scale, quality of service and the ability to tailor services to clients’ unique needs. In that regard, we are focused on developing and implementing technology, data and analytic solutions for both internal operations and for maintaining industry standards and meeting client preferences. We have made such investments from time to time and may decide, based on perceived business needs, to make investments in the future that may be different from past practice or what we currently anticipate.\n\nIf our costs grow significantly in excess of our ability to raise revenue, whether as a result of the foregoing global economic factors or otherwise, our margins and results of operations may be materially and adversely impacted and we may not be able to achieve our strategic and financial objectives.\n\nCash flows from operating activities were $1.5 billion for 2024, compared to $1.3 billion for 2023. The $1.5 billion net cash from operating activities for 2024 included a net loss of $88 million and $1.9 billion of favorable non-cash adjustments, partially offset by unfavorable changes in operating assets and liabilities of $326 million. The $1.9 billion of favorable non-cash adjustments primarily includes impairment, depreciation, amortization and non-cash lease expense. This increase in cash flows from operations as compared to the prior year was primarily driven by operating margin expansion, partially offset by increased cash outflows related to transformation and discretionary compensation payments in the current year as compared to the prior year.\n\nAdjusted income taxes/tax rate is defined as the provision for income taxes adjusted for taxes on certain items of impairment, amortization, restructuring costs, transaction and transformation, gains and losses on disposals of operations, the tax effects of significant adjustments and non-recurring items that, in management’s judgment, significantly affect the period-over-period assessment of operating results, divided by adjusted income before taxes. Adjusted income taxes is used solely for the purpose of calculating the adjusted income tax rate.\n\nAdjusted net income is defined as net (loss)/income attributable to WTW adjusted for impairment, amortization, restructuring costs, transaction and transformation, gains and losses on disposals of operations and non-recurring items that, in management’s judgment, significantly affect the period-over-period assessment of operating results and the related tax effect of those adjustments and the tax effects of significant adjustments. This measure is used solely for the purpose of calculating adjusted diluted earnings per share.\n\nWe recorded a combined $1 million net periodic benefit income for our U.S. and U.K. plans for the year ended December 31, 2024. For the U.S. and U.K. plans, the following table presents our estimated net periodic benefit income for 2025 and the impact to both plans of a 0.25% increase and decrease to both the expected return on assets (‘EROA’) and the discount rate assumptions; and the projected benefit obligations as of December 31, 2024 and the impact of a 0.25% increase and decrease to the discount rates:\n\nTransaction and transformation costs for the year ended December 31, 2024 were $409 million, compared to $386 million for the year ended December 31, 2023, an increase of $23 million. Transaction and transformation costs for the current year were higher primarily due to increased lease termination and compensation costs related to our Transformation program (see ‘Transformation Program’ elsewhere within this Item 7) incurred in the current year as compared to the prior year.\n\nAdjusted income before taxes is defined as income from operations before income taxes adjusted for impairment, amortization, restructuring costs, transaction and transformation, gains and losses on disposals of operations and non-recurring items that, in management’s judgment, significantly affect the period-over-period assessment of operating results. Adjusted income before taxes is used solely for the purpose of calculating the adjusted income tax rate.\n\nSalaries and benefits for the year ended December 31, 2024 were $5.5 billion, compared to $5.3 billion for the year ended December 31, 2023, an increase of $158 million, or 3%. The increase in the current year is primarily due to higher salary expense, driven by increased colleague headcount and cost-of-living compensation adjustments, and higher incentive and benefit costs for the year.\n\nAt December 31, 2024, the Company does not have any mandatory debt repayments over the next twelve months. For more information regarding our current and long-term debt, please see ‘Supplemental Guarantor Financial Information’ elsewhere within this Item 7 Management's Discussion and Analysis of Financial Condition and Results of Operations.\n\nThe amounts of the cash, cash equivalents and restricted cash, their respective classification on the consolidated balance sheets, as well as their respective portions of the increase or decrease in cash, cash equivalents and restricted cash for each of the periods presented, have been included in Note 21\n\nR&B segment operating income for the years ended December 31, 2024 and 2023 was $958 million and $813 million, respectively. R&B segment operating income increased due primarily to operating leverage driven by organic revenue growth and disciplined expense management, as well as transformation savings.\n\nHWC segment operating income for the years ended December 31, 2024 and 2023 was $1.7 billion and $1.6 billion, respectively. HWC segment operating income increased due primarily to transformation savings as well as operating leverage driven by organic revenue growth and disciplined expense management.\n\nIn December 2022, E.U. member states formally adopted the E.U.’s Pillar Two Directive, which introduces a global corporate minimum tax of 15% for certain large multinational companies. For the rules to take effect, in 2023 many E.U. countries enacted the necessary legislation to implement Pillar Two, effective January 1, 2024. Ireland, in particular, enacted Pillar Two legislation by signing Finance (No. 2) Bill 2023 into law in December 2023. Other countries and territories have indicated they will introduce Pillar Two legislation beginning in 2025. The Pillar Two minimum tax is treated as a period cost beginning in 2024 and does not have a material impact on the Company's financial results of operations for the current period. The Company continues to monitor evolving tax legislation as well as additional guidance to enacted legislation in the jurisdictions in which we operate.\n\nOther (loss)/income, net includes gains and losses on disposals of operations, pension credits or expenses that are not attributable to service expense, interest in earnings of associates, foreign exchange gains and losses and other miscellaneous non-operating income and costs.\n\nThe increase in free cash flow during the current year was primarily driven by operating margin expansion, partially offset by increased cash outflows related to transformation and discretionary compensation payments in the current year as compared to the prior year.\n\nWe maintain allowances for doubtful accounts to reflect estimated losses resulting from a client’s failure to pay for the services after the services have been rendered, which are recorded in other operating expenses. We also maintain allowances related to our unbilled receivables for such items as expected realization or client disputes, the related provision for which is recorded as a reduction to revenue. Our allowance policy is based in part on the aging of the billed and unbilled client receivables and has been developed based on our write-off history. However, facts and circumstances, such as the average length of time the receivables are past due, general market conditions at the time we perform the work, current economic ",
  "item2_clean": null
}