{
  "source_file": "xel-20241231.htm",
  "form_type": "10-K",
  "item1_clean": "SPS\nTransmission lines deliver electricity at high voltages and over long distances from power sources to substations closer to customers. A strong transmission system ensures continued reliable and affordable service, ability to meet state and regional energy policy goals, and support for a diverse generation mix, including renewable energy. Xcel Energy owns approximately 111,000 conductor miles of transmission lines across its service territory.\nSee Item 2 - Properties for further information.\nDistribution lines allow electricity to travel at lower voltages from substations directly to customers. Xcel Energy has a vast distribution network, owning and operating approximately 221,000 conductor miles of distribution lines across our eight-state service territory.\nSee Item 2 - Properties for further information.\nNatural Gas Operations\nNatural gas operations consist of purchase, transportation and distribution of natural gas to end-use residential, C&I and transport customers in NSP-Minnesota, NSP-Wisconsin and PSCo. Xcel Energy had natural gas deliveries of 387,513 (thousands of MMBtu), 2.2 million customers and natural gas revenues of $2,230 million for 2024\n(percentage of total)\nC&I\nTransportation and other\nSales/Revenue Statistics\nMMBtu sales per retail customer\nRevenue per retail customer\nResidential revenue per MMBtu\nC&I revenue per MMBtu\nTransportation and other revenue per MMBtu\nSee Note 6 to the consolidated financial statements for further information.\nCapability and Demand\nNatural gas supply requirements are categorized as firm or interruptible.\nMaximum daily output (firm and interruptible) and occurrence date:\nNatural Gas Supply and Cost\nXcel Energy seeks natural gas supply, transportation and storage alternatives to yield a diversified portfolio, which increases flexibility and decreases interruption, financial risks and customer rates. In addition, the utility subsidiaries conduct natural gas price hedging activities approved by their states’ commissions.\nAverage delivered cost per MMBtu of natural gas for regulated retail distribution:\nNSP-Minnesota, NSP-Wisconsin and PSCo have natural gas supply transportation and storage agreements that include obligations for purchase and/or delivery of specified volumes or to make payments in lieu of delivery.\nGeneral Economic Conditions\nEconomic conditions may have a material impact on Xcel Energy’s operating results. Management cannot predict the impact of fluctuating energy or commodity prices, pandemics, terrorist activity, war or the threat of war. We could experience a material impact to our results of operations, future growth or ability to raise capital resulting from a sustained general slowdown in economic growth or a significant increase in interest rates or inflation.\nDemand for electric power and natural gas is affected by seasonal differences in the weather. In general, peak sales of electricity occur in the summer months and peak sales of natural gas occur in the winter months. As a result, the overall operating results may fluctuate substantially on a seasonal basis. Additionally, Xcel Energy’s operations have historically generated less revenues and income when weather conditions are warmer in the winter and cooler in the summer. Sales true-up and decoupling mechanisms mitigate the impacts of weather in certain jurisdictions.\nXcel Energy is subject to public policies that promote competition and development of energy markets. Xcel Energy’s industrial and large commercial customers have the ability to generate their own electricity. In addition, customers may have the option of substituting other fuels or relocating their facilities to a lower cost region.\nCustomers have the opportunity to supply their own power with distributed generation including solar generation and can currently avoid paying for most of the fixed production, transmission and distribution costs incurred to serve them in most jurisdictions.\nSeveral states have incentives for the development of rooftop solar, community solar gardens and other distributed energy resources. Distributed generating resources are potential competitors to Xcel Energy’s electric service business with these incentives and federal tax subsidies.\nThe FERC has continued to promote competitive wholesale markets through open access transmission and other means. Xcel Energy’s wholesale customers can purchase energy from other generation resources and transmission services from other service providers to serve their native load.\n\nITEM 1 — BUSINESS\nDefinitions of Abbreviations\nXcel Energy Inc.’s Subsidiaries and Affiliates (current and former)\nCapital Services, LLC\nNicollet Project Holdings\nNicollet Project Holdings, LLC\nNorthern States Power Company, a Minnesota corporation\nThe electric production and transmission system of NSP-Minnesota and NSP-Wisconsin operated on an integrated basis and managed by NSP-Minnesota\nNorthern States Power Company, a Wisconsin corporation\nPublic Service Company of Colorado\nSPS\nSouthwestern Public Service Co.\nUtility subsidiaries\nNSP-Minnesota, NSP-Wisconsin, PSCo and SPS\nWGI\nWestGas InterState, Inc.\nWYCO\nWYCO Development, LLC\nXcel Energy Inc. and its subsidiaries\nFederal and State Regulatory Agencies\nCPUC\nColorado Public Utilities Commission\nDOC\nMinnesota Department of Commerce\nDOE\nUnited States Department of Energy\nDOT\nUnited States Department of Transportation\nEPA\nUnited States Environmental Protection Agency\nERCOT\nElectric Reliability Council of Texas\nFASB\nFinancial accounting standards board\nFERC\nFederal Energy Regulatory Commission\nIRS\nInternal Revenue Service\nMPUC\nMinnesota Public Utilities Commission\nMPSC\nMichigan Public Service Commission\nNDPSC\nNorth Dakota Public Service Commission\nNERC\nNorth American Electric Reliability Corporation\nNIST\nNational Institute of Standards and Technology\nNMPRC\nNew Mexico Public Regulation Commission\nNRC\nNuclear Regulatory Commission\nOAG\nMinnesota Office of Attorney General\nPHMSA\nPipeline and Hazardous Materials Safety Administration\nPSCW\nPublic Service Commission of Wisconsin\nPUCT\nPublic Utility Commission of Texas\nSDPUC\nSouth Dakota Public Utility Commission\nSEC\nElectric, Purchased Gas and Resource Adjustment Clauses\nCIP\nConservation improvement program\nDSM\nDemand side management\nFCA\nFuel clause adjustment\nGCA\nRES\nRenewable energy standard\nADIT\nAccumulated deferred income taxes\nAFUDC\nAllowance for funds used during construction\nALJ\nAdministrative law judge\nARO\nAsset retirement obligation\nARRR\nApplication for rehearing, reargument or reconsideration\nASC\nFinancial Accounting Standards Board Accounting Standards Codification\nASU\nAccounting standards update\nATM\nC&I\nCommercial and industrial\nAlliance of electric cooperatives, municipals and investor-owned utilities in the upper Midwest involved in a joint transmission line planning and construction effort\nCCR\nCoal combustion residuals\nFinal rule (40 CFR 257.50 - 257.107) published by the EPA regulating the management, storage and disposal of CCRs as a nonhazardous waste\nCDD\nCEO\nChief executive officer\nCERCLA\nComprehensive Environmental Response, Compensation, and Liability Act\nCFO\nChief financial officer\nCIG\nColorado Interstate Gas Company, LLC\nCON\nCO\nCORE\nCORE Electric Cooperative\nCPCN\nCertificate of public convenience and necessity\nCSPV\nCrystalline silicon photovoltaic\nCWIP\nConstruction work in progress\nDECON\nDecommissioning method where radioactive contamination is removed and safely disposed of at a requisite facility or decontaminated to a permitted level\nDRIP\nDividend Reinvestment Program\nEEI\nEdison Electric Institute\nEMANI\nEuropean Mutual Association for Nuclear Insurance\nEPS\nETR\nFTR\nFinancial transmission right\nGAAP\nGenerally accepted accounting principles\nGE\nGHG\nHDD\nINPO\nInstitute of Nuclear Power Operations\nIRA\nInflation Reduction Act\nIPP\nIndependent power producing entity\nIRP\nIntegrated resource plan\nISO\nIndependent system operator\nITC\nInvestment tax credit\nLP&L\nLubbock Power & Light\nMGP\nManufactured gas plant\nMISO\nMidcontinent Independent System Operator, Inc.\nDemand of retail and wholesale customers that a utility has an obligation to serve under statute or contract\nNAV\nNEIL\nNuclear Electric Insurance Ltd.\nNOL\nO&M\nOperating and maintenance\nONES\nOperations, Nuclear, Environmental and Safety\nPFAS\nPer- and polyfluoroalkyl substances\nPIM\nPerformance incentive mechanism\nPPA\nPower purchase agreement\nPSPS\nPublic safety power shutoff\nPTC\nProduction tax credit\nRDF\nREC\nRenewable energy credit\n\nOUR CUSTOMERS\nXcel Energy has invested more than $2 billion over the past decade in a portfolio of renewable and conservation programs that provide customers with clean energy options and help keep bills low. New demand remains robust in our territories, including load growth from new data centers, industrial electrification and electric vehicle adoption. As such, we are transforming and expanding our electric grid to accommodate load growth, renewable energy and distributed energy resources.\nWe are in the process of installing smart electric meters, which will deliver customer and operational benefits, providing near-real-time communication, allowing customers to know how much energy they are using and what it will cost. In addition, customers will have new digital tools to make it easier to access their energy information, gain useful insights to understand and manage their energy use and make energy choices that lower their bills.\nCustomer affordability is critical to successful strategy execution. Since 2020, our lean operating program has generated nearly $500 million of sustainable savings for our customers, while improving operating outcomes and reducing enterprise risk. At the same time, our Steel for Fuel strategy has saved customers nearly $5 billion since 2017 in avoided fuel costs and PTCs.\nIn turn, we delivered our electric and natural gas products in 2024 at a price that is lower than it was ten years ago on an inflation adjusted basis. Since 2014, our average residential electric bill growth has been 1.7% per year and natural gas bills have declined 0.6% per year on a nominal basis. Additionally, based on available EIA data, the five year average residential electric and natural gas bills for an Xcel Energy customer were 28% and 12% below the national average.\nGoing forward, our goal is to enable the clean energy transition while keeping long-term customer bill growth below the rate of inflation through initiatives including conservation programs, O&M cost control, our One Xcel Energy Way lean management initiative, advanced operational technologies and our Steel for Fuel program.\nWe provide a fundamental service, powering our communities with safe, reliable, competitively priced and increasingly clean energy.\nInvesting in our communities is important to our collective success. We initiated 24 economic development projects for our local communities in 2024, which are projected to create more than $5.1 billion in capital investments and nearly 3,200 jobs. Nearly 59% of our supply chain spend was local.\nApproximately 280 employees served on more than 480 nonprofit organizations or local community boards, providing over 26,000 volunteer hours in 2024. Our annual Day of Service attracted 2,200 people who volunteered over 7,900 combined hours at over 110 nonprofit projects across the company’s service footprint.\nIn 2024, the Xcel Energy Foundation contributed $5 million to 390 nonprofit organizations that support its three charitable giving focus areas of STEM Career Pathways, Environmental Sustainability, and Community Vitality. Through our 2024 Power Your Purpose Giving Campaign, Xcel Energy employees, contractors and retirees donated more than $2 million to over 1,500 nonprofit and community organizations – exceeding our fundraising goal. Combined with the Xcel Energy Foundation match to local United Way chapters, this campaign raised $5 million for our communities.\nOUR PEOPLE\nContinuously elevating the quality and safety of the workplace is a to",
  "item7_clean": "Results of Operations\nDiluted EPS for Xcel Energy at Dec. 31:\nDiluted Earnings (Loss) Per Share\nSPS\nEarnings from equity method investments — WYCO\nXcel Energy Inc. and Other\nLoss on Comanche Unit 3 litigation\nWorkforce reduction expenses\nSherco Unit 3 2011 outage refunds\nAmounts may not add due to rounding.\nXcel Energy’s management believes that ongoing earnings reflects management’s performance in operating Xcel Energy and provides a meaningful representation of the performance of Xcel Energy’s core business. In addition, Xcel Energy’s management uses ongoing earnings internally for financial planning and analysis, reporting results to the Board of Directors and when communicating its earnings outlook to analysts and investors.\n2024 Comparison with 2023\n— GAAP earnings were $3.44 per share compared to $3.21 per share in 2023 and ongoing earnings were $3.50 per share in 2024, compared with $3.35 per share in 2023. The change in EPS was driven by increased recovery of infrastructure investments, partially offset by higher depreciation, interest charges and O&M expenses.\nFluctuations in electric and natural gas revenues associated with changes in fuel and purchased power and/or natural gas sold and transported generally do not significantly impact earnings (changes in costs are offset by the related variation in revenues).\n— GAAP earnings increased $0.13 per share and ongoing earnings increased $0.15 per share for 2024 compared to 2023. Ongoing earnings increased due to higher recovery of electric and natural gas infrastructure investments, partially offset by increased depreciation and interest charges.\n— GAAP earnings increased $0.13 per share and ongoing earnings increased $0.06 per share for 2024. Higher ongoing earnings primarily reflects higher recovery of electric and natural gas infrastructure investments, which was partially offset by increased depreciation, O&M and interest charges.\nSPS\n— GAAP earnings were flat and ongoing earnings decreased $0.01 per share for 2024. Ongoing earnings were impacted by increased depreciation, O&M and interest charges, largely offset by regulatory rate outcomes and sales growth.\n— GAAP and ongoing earnings decreased $0.01 per share for 2024. The decrease in ongoing earnings was primarily a result of higher depreciation.\nXcel Energy Inc. and Other\n— Primarily includes financing costs and interest income at the holding company and earnings from investment funds, which are accounted for as equity method investments. The decline in earnings for 2024 is largely due to higher debt levels and increased interest rates, partially offset by a gain on debt repurchases.\nChanges in Diluted EPS\nComponents significantly contributing to changes in 2024 EPS compared with 2023:\nDiluted Earnings (Loss) Per Share\nTwelve Months Ended Dec. 31\nGAAP diluted EPS — 2023\n\nExpenses incurred for the cost of natural gas sold are impacted by market prices and seasonality. These costs are generally recovered through various regulatory recovery mechanisms. As a result, changes in these expenses are largely offset in operating revenues and have minimal earnings impact.\nNatural gas sold and transported decreased $505 million in 2024. The decrease is primarily due to lower commodity prices and volumes.\nNon-Fuel Operating Expenses and Other Items\n— O&M expenses increased $96 million in 2024 primarily due to operational activities, including generation maintenance, storm response, wildfire mitigation costs and damage prevention. The impact of prior year regulatory deferrals also contributed to increased O&M expenses, partially offset by lower labor and benefit costs and lower bad debt expenses.\nDepreciation and Amortization\nDepreciation and amortization increased $296 million for the year, primarily related to system expansion, partially offset by the impacts of various rate cases, including recognition of previously deferred costs as well as wind and nuclear life extensions.\nOther income increased $121 million for the year, primarily related to interest earned on significant cash balances throughout the year and a gain on debt repurchases, which helped to offset increased spending in our electric and natural gas operations to reduce risk, including wildfire mitigation.\nInterest charges increased $200 million in 2024. The increase was largely due to higher long-term debt levels to fund capital investments and higher interest rates.\nAFUDC, Equity and Debt\nAFUDC increased $99 million in 2024. This increase was largely due to increased investment in renewable and transmission projects.\nXcel Energy Inc. and Other Results\nNet income and diluted EPS contributions of Xcel Energy Inc. and its nonregulated businesses:\n(Millions of Dollars)\nXcel Energy Inc. financing costs\nXcel Energy Inc. taxes and other results\nTotal Xcel Energy Inc. and other costs\n(Diluted Earnings (Loss) Per Share)\nXcel Energy Inc. financing costs\nXcel Energy Inc. taxes and other results\nTotal Xcel Energy Inc. and other costs\nAmounts include gain from open market debt repurchases in 2024.\nXcel Energy Inc.’s results include interest charges, which are incurred at Xcel Energy Inc. and are not directly assigned to individual subsidiaries.\n2023 Comparison with 2022\nA discussion of changes in Xcel Energy’s results of operations, cash flows and liquidity and capital resources from the year ended Dec. 31, 2022 to Dec. 31, 2023 can be found in Part II, “Item 7, Management’s Discussion and Analysis of Financial Condition and Results of Operations” of our Annual Report on\nPublic Utility Regulation\nThe FERC and various state and local regulatory commissions regulate Xcel Energy Inc.’s utility subsidiaries and West Gas Interstate. Xcel Energy is subject to rate regulation by state utility regulatory agencies, which have jurisdiction with respect to the rates of electric and natural gas distribution companies in Minnesota, North Dakota, South Dakota, Wisconsin, Michigan, Colorado, New Mexico and Texas.\nRates are designed to recover plant investment, operating costs and an allowed return on investment. Our utility subsidiaries request changes in utility rates through commission filings. Changes in operating costs can affect Xcel Energy’s financial results, depending on the timing of rate cases and implementation of final rates. Other factors affecting rate filings are new investments, sales, conservation and DSM efforts, and the cost of capital.\nIn addition, the regulatory commissions authorize the ROE, capital structure and depreciation rates in rate proceedings. Decisions by these regulators can significantly impact Xcel Energy’s results of operations and credit quality.\nSee Rate Matters and Other within Note 12 to the consolidated financial statements for further information.\n\n(MW)\nNatural gas combustion turbine\nStorage (long duration)\nThe procedural schedule is as follows:\nAnswer testimony: April 18, 2025\nRebuttal testimony: May 23, 2025\nSettlement deadline: June 2, 2025\nHearing: June 10-20, 2025\nStatements of position: July 14, 2025\nA CPUC decision on the resource plan is expected by the fall of 2025 (Phase I) with the competitive solicitation for resource additions expected in early 2026.\nWildfire Mitigation Plan —\nIn June 2024, PSCo filed an updated WMP and request for recovery of costs covering the years 2025 to 2027 with the CPUC. The estimated total cost for this plan is approximately $1.9 billion. A CPUC decision is expected in the third quarter of 2025.\nThe WMP integrates industry experience; incorporates evolving risk assessment methodologies; adds new technology; and expands the scope, pace and scale of our work to reduce wildfire risk in a comprehensive and efficient manner under four core programs that include the following:\nSituational awareness\nMeteorology, area risk mapping and modeling, artificial intelligence cameras and continuous monitoring.\nOperational mitigations – Enhanced powerline safety settings and PSPS.\nAsset assessment and remediations, pole replacements, line rebuilds, targeted undergrounding and vegetation management.\nCoordination and real-time data sharing with customers and other stakeholders and PSPS resiliency rebates.\nIn February 2025, six of the nine intervenors filed answer testimony in the proceeding. Intervenors provided a range of recommendations related to both the scope of proposed work and the cost recovery proposal.\nThe remaining procedural schedule is as follows:\nRebuttal testimony: March 21, 2025\nSettlement deadline: April 11, 2025\nHearing: May 5-15, 2025\nDecision deadline: Aug. 28, 2025\nColorado Senate Bill 23-291\n— In May 2023, Colorado Senate Bill 23-291 was signed into law. The bill includes a number of topics including natural gas and electric fuel incentive mechanisms, natural gas planning rules, regulatory filing requirements, and non-recovery of certain expenses (e.g., certain organizational or membership dues, tax penalties or fines).\nIn November 2023, the CPUC approved PSCo’s natural gas price risk plan to manage customer bill volatility from commodity price changes, establishing upper and lower limits for changes in the GCA rate. As a result, costs above the upper limit are deferred for future recovery, with interest, and costs below the lower limit deferred as a reserve against future cost increases.\nThe legislation also calls for the CPUC to adopt rules to establish fuel cost mechanisms to align the financial incentives of a utility with the interests of the utility’s customers.\nIn December 2024, the CPUC adopted final rules applicable to PSCo’s natural gas utility that would assign to the Company four percent of the change in the price per MMbtu of natural gas compared to the three-year average, subject to rolling 12-month cap based on a percentage of rate base, currently estimated at $7 million. The rules require PSCo to make a filing to implement the mechanism within sixty days of becoming effective, expected later in 2025.\nIn December 2024, the CPUC also adopted rules for electric utilities but did not adopt a specific PIM framework, which will be further considered through additional proceedings in 2025.\nColorado Senate Bill 24-218\n— In May 2024, Colorado Senate Bill 24-218 was signed into law. The bill includes a suite of policy changes to accelerate investment in electric distribution, including a framework to develop distribution planning and performance requirements and the opportunity for current cost recovery through a rider for distribution investments. In July 2024 and December 2024, the CPUC approved PSCo’s request to collect $17 million and $48 million through a rider, over the remainder of 2024 and 2025, respectively, subject to true-up, associated with forecasted capital investments covered by the new legislation.\nExcess Liability Insurance Deferral —\nIn August 2024, PSCo filed a request with the CPUC to establish a tracker to defer differences in excess liability insurance premiums after the October 2024 policy renewal (reflecting significantly rising premiums of approximately $40 million, largely associated with wildfire risks throughout the United States) and amounts currently recovered. In January 2025, the CPUC approved a one-year deferral aligned with the current insurance policy year. Cost recovery for incremental insurance premiums will be reviewed in a future rate case.\nPurchased Power and Transmission Service Providers\nPSCo meets its system capacity and energy requirements through its fleet of owned and purchased electric generation resources and, when required, the use of demand-side management programs.\n— PSCo purchases power from other utilities, energy marketers and independent power producers. Long-term purchased power contracts for dispatchable resources typically require capacity and energy charges. Much of PSCo’s long-term purchased power is for wind, solar and storage resources. PSCo makes short-term purchases to meet system load and energy requirements, replace generation out of service for maintenance, meet operating reserve obligations, or obtain energy at a lower cost.\nPurchased Transmission Services\n— In addition to using its own transmission system, PSCo has contracts with regional transmission service providers to deliver energy to its customers.\nWholesale and Commodity Marketing Operations\nPSCo conducts various wholesale marketing operations, including the purchase and sale of electric capacity, energy, ancillary services and energy related products. PSCo uses physical and financial instruments to minimize commodity price risk and hedge sales and purchases. PSCo also engages in trading activity unrelated to these hedging activities.\nSharing of any margin is determined through state regulatory proceedings as well as the operation of the FERC approved joint operating agreement.\n\nExcess Liability Insurance Coverage\nXcel Energy maintains excess liability coverage, which is intended to insure against liability to third parties. Through the third quarter of 2024, Xcel Energy had approximately $600 million of excess liability coverage; including $520 million of wildfire coverage with an annual premium of approximately $40 million. Examples of claims paid under this policy include property damage or bodily injury to members of the public caused by Xcel Energy’s employees, equipment or facilities. The increased wildfire liability risk and claims are driving a significant increase of premiums and reductions in insurance coverage in the excess liability markets, especially in the western United States. In October 2024, Xcel Energy renewed its excess liability coverage and now has $450 million of total coverage; including $450 million of wildfire coverage for the NSP System and $300 million of wildfire coverage for PSCo and SPS. The annual premium for this excess liability insurance is approximately $130 million. Xcel Energy received an approved deferral at PSCo, filed a deferral request at NSP-Wisconsin and will continue to seek to recover these increased costs through various regulatory proceedings, including planned deferral requests or rate filings in several states.\nCritical Accounting Policies and Estimates\nPreparation of the consolidated financial statements requires the application of accounting rules and guidance, as well as the use of estimates. Application of these policies involves judgments regarding future events, including the likelihood of success of particular projects, legal and regulatory challenges and anticipated recovery of costs. These judgments could materially impact the consolidated financial statements, based on varying assumptions. In addition, the financial and operating environment also may have a significant effect on the operation of the business and results reported.\nAccounting policies and estimates that are most significant to Xcel Energy’s results of operations, financial condition or cash flows, and require management’s most difficult, subjective or complex judgments are outlined below. Each of these has a higher likelihood of resulting in materially different reported amounts under different conditions or using different assumptions. Each critical accounting policy has been reviewed and discussed with the Audit Committee of Xcel Energy Inc.’s Board of Directors on a quarterly basis.\nRegulatory Accounting\nXcel Energy is subject to the accounting for Regulated Operations\nwhich provides that rate-regulated entities report assets and liabilities consistent with the recovery of those incurred costs in rates, if it is probable that such rates will be charged and collected. Our rates are derived through the ratemaking process, which results in the recording of regulatory assets and liabilities based on the probability of future cash flows.\nRegulatory assets generally represent incurred or accrued costs that have been deferred because future recovery from customers is probable. Regulatory liabilities generally represent amounts that are expected to be refunded to customers in future rates or amounts collected in curren",
  "item2_clean": null
}