{
  "source_file": "xyl-20241231.htm",
  "form_type": "10-K",
  "item1_clean": "Water Solutions and Services\nPreventative maintenance services\nRapid response mobile services\nDigitally enabled/outsourced solutions\nProcess and wastewater treatment systems\nEnvironmental remediation\nOdor and corrosion control\nContinuous deionization\nMobile dewatering equipment and rental services\nWater Infrastructure\nThrough two closely linked applications, transport and treatment, our Water Infrastructure segment primarily supports the process that collects water from a source, treats it and distributes it to users, and then treats and returns the wastewater responsibly to the environment.\nThe customer base consists of two primary end markets: utility and industrial. The utility market includes public, private and public-private entities that support water, wastewater and storm water networks. The industrial market includes customers that require similar water and wastewater infrastructure applications to support various industrial operations.\nWater Infrastructure sells through a combination of direct channels, indirect channels and service capabilities. Both utility and industrial facility customers increasingly require our teams’ global but locally proficient expertise to use our equipment in their specific applications. Several trends are increasing demand for this application expertise: (i) the need for efficient transport and treatment solutions due to the increase in water scarcity, (ii) the increase in both the type and amount of contaminants found in the water supply, (iii) the need to increase system resilience and efficiencies due to aged infrastructure and affordability, (iv) increasing environmental regulations, and (v) the need to reduce carbon emissions generated from transporting and treating water.\nGiven the highly fragmented nature of the water industry, the Water Infrastructure segment competes with a large number of businesses and no one business competes across all the markets Water Infrastructure serves. We differentiate ourselves in the market by focusing on product and service performance, quality and reliability, innovation, speed to market with new or disruptive technologies and business models, application expertise, brand reputation, energy efficiency, product security, product life-cycle cost, timeliness of delivery, effectiveness of our distribution channels, customers' experience and our global installed base. Our key competitors in the Water Infrastructure segment include De Nora, Grundfos, KSB Inc., ProMinent, Sulzer Ltd., Trojan (Veralto Corporation), and Veolia.\nApplied Water encompasses the uses of water to serve a diverse set of customers in the building solutions and industrial water end markets. Residential consumers represent the end users in the residential market, while owners and managers of properties such as apartment buildings, retail stores, institutional buildings, restaurants, schools/universities, hospitals and hotels are examples of end users in the commercial market. The industrial market includes original equipment manufacturers, exploration and production firms, agricultural customers, and developers and managers of industrial facilities, such as chemical manufacturers, marine, food and beverage companies, data centers and car washes.\nIn the Applied Water segment, end markets vary widely and, as a result, specialized distribution partners are often preferred. As such, the Applied Water segment provides the majority of its sales through strong indirect channels with the remaining sales going through our global direct sales channels. We have long-standing relationships with many of the leading independent distributors in the markets we serve and we provide incentives to distributors, such as specialized loyalty and training programs.\nPopulation growth and urbanization, climate and regulation on energy efficiency, and digitalization enabling self-service and preventive maintenance are macro growth drivers of these markets, driving the need for housing, food, community services and retail goods within growing city centers.\nCompetition in the Applied Water segment focuses on brand reputation, application expertise, product delivery, performance and energy efficiency, quality and reliability, and price. We compete by offering innovative and high-quality products, coupled with world-class application expertise. We believe our distribution through well-established channels and our reputation for quality significantly enhance our market position. Our ability to deliver innovative product offerings has enabled us to compete effectively, to cultivate and maintain customer relationships and to serve and expand into many niche and new markets. Our key competitors in the Applied Water segment include Franklin Electric Co., Inc, Grundfos, Pentair plc, and Wilo SE.\nMeasurement and Control Solutions\nMeasurement and Control Solutions develops advanced technology solutions that enable intelligent use, optimization and conservation of critical water and energy resources. The segment delivers communications, smart metering, measurement and control capabilities, and critical infrastructure technologies that allow customers to more effectively use their distribution networks for the delivery, monitoring and control of critical resources such as water, electricity and natural gas. We also provide analytical instrumentation used to measure and analyze water quality, flow and level in clean water, wastewater and outdoor water environments. Additionally, we offer software and services including cloud-based analytics, and remote monitoring and data management.\nAt the heart of our leading technologies are automation, data management and decision support. Our communications networks enable customers to automate and optimize meter reading, bill customers, monitor flow rates and detect and enable rapid response to changing and unsafe conditions. In short, our communications offerings provide insight into operations and enable our customers to manage the entire scope of their operations remotely through their networks and to optimize their operational costs. At the center of our offering is the FlexNet communication network, which provides a common communications platform and infrastructure for essential metering services. This two-way communication technology remotely connects a wide variety of smart points in a given network with protocols, frequently on Federal Communications Commission (\"FCC\") licensed spectrum in the U.S., to enable reliable, resilient and secure transmissions. These technologies allow our customers to remotely and continuously monitor their water and energy distribution infrastructure, prioritize and manage maintenance, and use data to optimize many aspects of their networks. Our digital software solutions complement these offerings with intelligent applications that help utility decision-makers manage and maintain their networks more effectively in real time.\nThe majority of our sales in the U.S. are conducted through strong, long-standing relationships with leading distributors and dedicated channel partners for the water and energy markets. Internationally, direct sales are often made in markets without established distribution channels; however, some distribution channels are used in more developed markets. A direct sales approach, with key account management, is employed for large utilities and government programs.\nMacro growth drivers include increasing regulation, aging infrastructure and worldwide movement towards smart grid implementation and advanced metering infrastructure (“AMI\"). Water scarcity and conservation, as well as the need to prevent revenue loss (via inaccurate meter readings, leaks or theft) are among the drivers of smart meter and leak detection technologies.\nOur Sensus-branded meters are well positioned in the smart metering sector, the fastest growing sector of the global meter industry. We set ourselves apart in the industry by focusing on our communication network, innovation, new product development and service offerings that deliver tangible savings from efficiency of operating costs in meter reading and billing, and reduction of non-revenue water through improved meter accuracy, reduced theft and identification of leaks. Our YSI and WTW-branded instruments have a strong position in the analytical instrumentation market and provide critical readings of various water quality, level and flow parameters for customers. We provide a differentiated offering in the reliability and accuracy of our products often in rugged, remote and hazardous locations. Our key competitors in the Measurement and Control Solutions segment include Badger Meter, Echologics (Mueller Water Products), Hach (Veralto Corporation), Itron, Kamstrup, Landis+Gyr, Neptune (Roper), and Teledyne.\nWater Solutions and Services\nOur Water Solutions and Services segment provides tailored services and solutions, in collaboration with customers, including on‑demand water, outsourced water, recycle/reuse, specialty dewatering and emergency response service alternatives, to improve operational reliability, performance and environmental compliance. Key offerings within this segment also include equipment systems for industrial needs (influent water, boiler feed water, ultrahigh purity, process water, wastewater treatment, and recycle/reuse), full-scale outsourcing of operations and maintenance, and municipal services, including odor and corrosion control services, and pipeline assessment services, as well as leak detection, condition assessment and asset management and pressure monitoring solutions. The Water Solutions and Services segment also includes sales and rental of specialty dewatering pumps, scalable products, and related equipment, technology and services, which provide the safe removal or draining of groundwater and surface water from construction sites or other industrial sites, and bypass pumping for the repair of aging utility infrastructure, as well as emergency water transport and removal during severe weather events.\nOur Water Solutions and Services segment reaches customers across various municipalities as well as industrial vertical markets such as life sciences, microelectronics, food and beverage, chemical processing, and power\ngeneration. In order to reach these customers, we leverage our application expertise in process water and wastewater treatment, our internal and external partners, and extensive service branch networks across the globe, including a rental fleet of transfer and treatment assets.\nMacro growth drivers include water scarcity, emerging contaminants, increasing regulation surrounding climate and energy efficiency, pressure to optimize energy efficiency and other operational cost, and demand arising from emergency response needs. Our key competitors in the Water Solutions and Services segment include Ecolab, MPW Industrial Services, Ovivo, Sunbelt Rentals and United Rentals.\nThe table below illustrates the annual revenue and percentage of revenue by geographic area for each of the three years ended December 31.\n\nEmerging Markets includes results from the following regions: Eastern Europe, the Middle East and Africa, Latin America and Asia Pacific (excluding Japan, Australia and New Zealand, which are included in \"Other\")\nSupply and Seasonality\nWe have a global manufacturing and assembly footprint, with production facilities in Europe, North America, Latin America, Asia and the Middle East. All of our businesses require various parts and raw materials, the availability and prices of which may fluctuate. Parts and raw materials commonly used in our products include motors, fabricated parts, castings, magnets, bearings, seals, batteries, printed circuit boards (\"PCBs\") and electronic components, including semiconductors, as well as commodities, including steel, brass, nickel, copper, aluminum, rare earth minerals, and plastics. While we may recover some cost increases through operational improvements, we are ",
  "item7_clean": "The impact of foreign exchange is primarily due to weakening of the Euro, Canadian Dollar and the Chilean Peso.\nSources and Uses of Liquidity\nOperating Activities\nDuring 2024, net cash provided by operating activities was $1,263 million, compared to $837 million in 2023. The $426 million year-over-year increase was primarily driven by higher cash earnings and non-recurring payments made in 2023 associated with transaction costs related to the acquisition of Evoqua and the investment in a distribution agreement of select technology. Higher use of net working capital partially offset the improved cash performance, driven by increases in inventory and receivables from strong demand in the fourth quarter, partially offset by timing of payables.\nInvesting Activities\nCash used in investing activities was $482 million in 2024, compared to $628 million in 2023. This decrease in cash used of $146 million reflects higher spending in 2023 on acquisitions, primarily the acquisition of Evoqua, and reduced cash used to fund equity investments in 2024. Reduced proceeds from the sale of businesses, higher capital expenditures and cash received from interest rates swaps in 2023 that did not recur in 2024 partially offset the decrease in cash used.\nFinancing Activities\nCash used in financing activities was $615 million in 2024, compared to $157 million in 2023. The year-over-year increase in cash used was mainly driven by cash received from a term loan in connection with the Evoqua acquisition in 2023 that was repaid in 2024 and higher dividend payments. These increased outflows were partially offset by the repayment of a receivable securitization program in 2023 that did not recur in the current year.\nFunding and Liquidity Strategy\nOur ability to fund our capital needs depends on our ongoing ability to generate cash from operations and access to bank financing and the capital markets. We continually evaluate aspects of our spending, including capital expenditures, strategic investments and dividends. Historically, we have generated operating cash flow sufficient to fund our primary cash needs\nIf our cash flows from operations are less than we expect, we may need to incur debt or issue equity. From time to time, we may need to access the long-term and short-term capital markets to obtain financing. Our access to, and the availability of, financing on acceptable terms and conditions in the future will be impacted by many factors, including: (i) our credit ratings or absence of a credit rating, (ii) the liquidity of the overall capital markets and (iii) the current state of the economy. There can be no assurance that such financing will be available to us on acceptable terms or that such financing will be available at all. Our securities are rated investment grade. A significant change in credit rating could impact our ability to borrow at favorable rates. Refer to Note 15, \"Credit Facilities and Debt\", of our consolidated financial statements for a description of limitations on obtaining additional funding.\nWe monitor our global funding requirements and seek to meet our liquidity needs on a cost-effective basis. In addition, our existing committed credit facilities and access to the public debt markets would provide further liquidity if required.\nBased on our current global cash positions, cash flows from operations and access to the capital markets, we believe there is sufficient liquidity to meet our funding requirements and service debt and other obligations in both the U.S. and outside of the U.S. over the next twelve months. Currently, we have available liquidity of approximately $2.1 billion, consisting of $1.1 billion of cash and $1 billion of available credit facilities as disclosed in Note 15, \"Credit Facilities and Debt\", of our consolidated financial statements.\nContractual Obligations\nMaterial contractual obligations arising in the normal course of business primarily consist of debt obligations and related interest payments, lease obligations and unconditional purchase obligations. Refer Note 15, “Credit Facilities and Debt” and Note 11, “Leases” of the consolidated financial statements for related to these matters.\nThe Company has future unconditional purchase commitments which are legally binding and that specify all significant terms including price and/or quantity. Total future commitments within the next twelve months for these obligations is $664 million, excluding contracts that can be canceled without penalty.\nCredit Facilities and Long-Term Contractual Commitments\nSee Note 15, \"Credit Facilities and Debt\" of our consolidated financial statements for a description of our credit facilities and long-term debt.\nAs we continue to grow our operations in the emerging markets and elsewhere outside of the U.S., we expect to continue to generate significant revenue from non-U.S. operations and expect that a substantial portion of our cash will be held by our foreign subsidiaries. We expect to manage our worldwide cash requirements considering available funds among the many subsidiaries through which we conduct business and the cost effectiveness with which those funds can be accessed. We may transfer cash from certain international subsidiaries to the U.S. and other international subsidiaries when we believe it is cost effective to do so. We continually review our domestic and foreign cash profile, expected future cash generation and investment opportunities and reassess whether there is a need to repatriate funds held internationally to support our U.S. operations.\nOff-Balance Sheet Arrangements\nWe are a party to certain off-balance sheet arrangements including certain guarantees. For discussion of these arrangements, see Note 20, “Commitments and Contingencies” of the consolidated financial statements.\nCritical Accounting Estimates\nThe preparation of financial statements in conformity with GAAP requires management to make estimates and assumptions that affect the reported amounts of assets, liabilities, revenue and expenses and the disclosure of contingent liabilities. Management bases its estimates on historical experience and on various other assumptions that it believes to be reasonable under the circumstances, the results of which form the basis for making judgments about the carrying values of assets and liabilities that are not readily apparent from other sources.\nSignificant accounting policies used in the preparation of the consolidated financial statements are discussed in Note 1, “Summary of Significant Accounting Policies,” of the consolidated financial statements. Accounting estimates and assumptions discussed in this section are those that we consider most critical to an understanding of our financial statements because they are inherently uncertain, involve significant judgments and include areas where different estimates reasonably could have been used, and because changes in such estimates that are reasonably possible could materially impact the financial statements. Management believes that the accounting estimates employed and the resulting balances are reasonable; however, actual results in these areas could differ from management’s estimates under different assumptions or conditions.\nRevenue Recognition.\nXylem recognizes revenue in a manner that depicts the transfer of promised goods and services to customers in an amount that reflects the consideration to which it expects to be entitled for providing those goods and services. For each arrangement with a customer, we identify the contract and the associated performance obligations within the contract, determine the transaction price of that contract, allocate the transaction price to each performance obligation and recognize revenue as each performance obligation is satisfied.\nThe satisfaction of performance obligations in a contract is based upon when the customer obtains control over the asset. Depending on the nature of the performance obligation, control transfers either at a particular point in time, or over time, which determines the pattern of revenue recognition.\nFor product sales, other than long-term construction-type contracts, we recognize revenue once control has passed at a point in time, which is generally when products are shipped. In instances where contractual terms include a provision for customer acceptance, revenue is recognized when either (i) we have previously demonstrated that the product meets the specified criteria based on either seller or customer-specified objective criteria, or (ii) upon formal acceptance received from the customer where the product has not been previously demonstrated to meet customer-specified objective criteria. We recognize revenue on product sales to channel partners, including resellers, distributors or value-added solution providers, at the point in time when the risks and rewards, possession, and title have transferred to the customer, which usually occurs at the point of delivery.\nRevenue from performance obligations related to services is primarily recognized over time, as the performance obligations are satisfied. In these instances, the customer consumes the benefit of the service as Xylem performs.\nCertain businesses also enter into long-term construction-type sales contracts where revenue is recognized over time. In these instances, revenue is recognized using a measure of progress that applies the input method based on costs incurred in relation to total estimated costs. We also recognize revenue for certain of these arrangements using the output method and measure progress based on shipments of product where control has transferred to the customer.\nFor all contracts with customers, we determine the transaction price in the arrangement and allocate the transaction price to each performance obligation identified in the contract. Judgment is required to determine the appropriate unit of account, and we separate out the performance obligations if they are capable of being distinct and are distinct within the context of the contract. The transaction price is adjusted for our estimate of variable consideration,\nwhich may include a right of return, discounts, rebates, penalties and retainage. To estimate variable consideration, we apply the expected value method or the most likely amount method, based on whichever method most appropriately predicts the amount of consideration we expect to be entitled to. The method applied is typically based on historical experience and known trends. We constrain the amounts of variable consideration that are included in the transaction price, to the extent that it is probable that a significant reversal in the amount of cumulative revenue recognized will not occur or when uncertainties around the variable consideration are resolved.\nDeferred tax assets and liabilities are determined based on temporary differences between the financial reporting and tax bases of assets and liabilities, applying enacted tax rates in effect for the year in which we expect the differences will reverse. Based on the evaluation of available evidence, we recognize future tax benefits, such as net operating loss carryforwards, to the extent that we believe it is more likely than not we will realize these benefits. We periodically assess the likelihood that we will be able to recover our deferred tax assets and reflect any changes to our estimate of the amount we are more likely than not to realize in the valuation allowance, with a corresponding adjustment to earnings or other comprehensive income, as appropriate.\nIn assessing the need for a valuation allowance, we look to the future reversal of existing taxable temporary differences, taxable income in carryback years and the feasibility of tax planning strategies and estimated future taxable income. The valuation allowance can be affected by changes to tax laws, changes to statutory tax rates and changes to future taxable income estimates.\nWe have recorded net foreign withholding taxes and state income taxes on earnings that are expected to be repatriated to the U.S. parent. We have not recorded any deferred taxes on the amounts that the Company currently does not intend to repatriate. The determination of deferred taxes on this amount is not practicable.\nThe calculation of our tax liabilities involves dealing with uncertainties in the application of complex tax laws in a multitude of jurisdictions across our global operations. We recognize potential liabilities and record tax liabilities for anticipated tax audit issues in the U.S. and other tax jurisdictions based on our estimate of whether, and the extent to which, additional taxes will be due. Furthermore, we recognize the tax benefit from an uncertain tax position only if based on the technical merits of the position it is more likely than not that the tax position will be sustained on examination by the taxing authorities or upon completion of the litigation process. The tax benefits recognized in the financial statements from such a position are measured based on the largest benefit that has a greater than 50% likelihood of being realized upon ultimate resolution.\nWe adjust our liability for uncertain tax positions in light of changing facts and circumstances; however, due to the complexity of some of these uncertainties, the ultimate resolution may result in a payment that is materially different from our current estimate of the tax liabilities. If our estimate of tax liabilities proves to be less than the ultimate assessment, an additional tax expense would result. If a payment of these amounts ultimately proves to be less than the recorded amounts, the reversal of the liabilities would result in tax benefits being recognized in the period when we determine the liabilities are no longer necessary.\nBusiness Combinations.\nWe record acquisitions using the purchase method of accounting. All of the assets acquired, liabilities assumed, contractual contingencies and contingent consideration is recorded at fair value as of the acquisition date. The excess of the purchase price over the estimated fair values of the net tangible and intangible assets acquired is recorded as goodwill. The application of the purchase method of accounting for business combinations requires management to make significant estimates and assumptions in the determination of the fair value of assets acquired and liabilities assumed, in order to properly allocate purchase price consideration between assets that are depreciated and amortized from goodwill. These assumptions and estimates include a market participant’s use of the asset and the appropriate discount rates for a market participant. Our estimates are based on historical experience, information obtained from the management of the acquired companies and, when appropriate, includes assistance from independent third-party appraisal firms. Significant assumptions and estimates include, but are not limited to, the cash flows that an asset is expected to generate in the future, the cost to build/recreate certain technology, the appropriate weighted-average cost of capital, and the cost savings expected to be derived from acquiring an asset. These estimates are inherently uncertain and unpredictable. In addition, unanticipated events and circumstances may occur which may affect the accuracy or validity of such estimates.\nGoodwill and Intangible Assets.\nWe review goodwill and indefinite-lived intangible assets for impairment annually and whenever events or changes in circumstances indicate the carrying value of an asset may not be recoverable. We also review the carrying value of our finite-lived intangible assets for potential impairment when impairment indicators arise. We conduct our annual impairment test as of the first day of the fourth quarter. For goodwill, the estimated fair value of each reporting unit is compared to the carrying value of the net assets assigned to that reporting unit. If the estimated fair value of the repor",
  "item2_clean": null
}