{
  "source_file": "sq-20250930.htm",
  "form_type": "10-Q",
  "item1_clean": null,
  "item7_clean": null,
  "item2_clean": "Commitments and Contingencies\nwithin Notes to the Condensed Consolidated Financial Statements for more details on these commitments.\nSenior Notes and Convertible Notes\nAs of September 30, 2025, we held $7.4 billion in aggregate principal amount of debt, comprised of $575.0 million in aggregate amount of convertible senior notes that mature on May 1, 2026 (\"2026 Convertible Notes\"), and $575.0 million in aggregate amount of convertible senior notes that mature on November 1, 2027 (\"2027 Convertible Notes,\" collectively referred to as the “Convertible Notes”), as well as an outstanding $1.0 billion in aggregate principal amount of senior unsecured notes that mature on June 1, 2026 (\"2026 Senior Notes\"), $1.2 billion in aggregate principal amount of senior unsecured notes that mature on August 15, 2030 (\"2030 Senior Notes\"), $1.0 billion in aggregate principal amount of senior unsecured notes that mature on June 1, 2031 (\"2031 Senior Notes\"), $2.0 billion in aggregate principal amount of senior unsecured notes that mature on May 15, 2032 (\"2032 Senior Notes\"), $1.0 billion in aggregate principal amount of senior unsecured notes that mature on August 15, 2033 (\"2033 Senior Notes\" and, together with the 2026 Senior Notes, 2030 Senior Notes, and 2031 Senior Notes, the “Senior Notes” and, together with the Convertible Notes, the “Notes”). Refer to Note 12,\nwithin Notes to the Condensed Consolidated Financial Statements for further details.\nOn March 5, 2020, we issued an aggregate principal amount of $1.0 billion of convertible senior notes (\"2025 Convertible Notes\"). On March 1, 2025, we paid $1.0 billion in cash to settle the outstanding principal balance and interest on the 2025 Convertible Notes upon maturity.\nRevolving Credit Facility\nWe have entered into a revolving credit agreement with certain lenders, as subsequently amended, which provides a $775.0 million senior unsecured revolving credit facility maturing in June 2028. Refer to Note 12,\nwithin Notes to the Condensed Consolidated Financial Statements for further details.\nWarehouse Funding Facilities\nWe have warehouse funding facilities (\"Warehouse Facilities\") with an aggregate amount of $1.5 billion on a revolving basis, of which $501.0 million was drawn as of September 30, 2025. The Warehouse Facilities have been arranged utilizing wholly-owned and consolidated entities (collectively, the \"Warehouse Special Purpose Entities (SPEs)\") formed for the sole purpose of financing the origination of consumer receivables to partly fund our BNPL platform. Borrowings under the Warehouse Facilities are secured against the respective consumer receivables. While the Warehouse SPEs are included in our condensed consolidated financial statements, they are separate legal entities that maintain legal ownership of the receivables they hold. The assets of the Warehouse SPEs are not available to satisfy our claims or those of our creditors.\nCash, Restricted Cash, and Working Capital\nWe believe that our existing cash and cash equivalents, investment in marketable debt securities, and availability under our line of credit will be sufficient to meet our working capital needs, including any expenditures related to strategic transactions and investment commitments that we may from time to time enter into, short-term debt repayments, shares repurchased through our share repurchase program, and planned capital expenditures for at least the next 12 months.\nFrom time to time, we have raised capital by issuing equity, equity-linked, or debt securities such as our Convertible Notes and Senior Notes; and we may do so in the future. However, such funding may not be available on terms acceptable to us or at all.\nIn the second quarter of 2025, we received an investment grade rating by Fitch Ratings, Inc. (BBB-). During 2024, we received non-investment grade ratings by S&P Global Ratings (BB+) and Moody's Corporation (Ba2). The ratings from Fitch Ratings, Inc., S&P Global Ratings, and Moody's Corporation were affirmed in the third quarter of 2025. We expect that these credit rating agencies will continue to monitor our performance, including our capital structure and results of operations. Our liquidity, access to capital, and borrowing costs could be adversely impacted by declines in our credit rating.\nShort-term restricted cash of $731.6 million as of September 30, 2025 primarily includes cash held by the Warehouse SPEs used in the Warehouse Facilities funding arrangements that will be used to pay the borrowings under the Warehouse Facilities or will be distributed to us. It also includes pledged cash deposits in accounts at the financial institutions that process our sellers' payment transactions and collateral pursuant to various agreements with banks relating to our products. We use restricted cash to secure letters of credit with the related financial institutions to provide collateral for cash flow timing differences in the processing of payments. We have recorded these amounts as current assets on our condensed consolidated balance sheet given the short-term nature of these cash flow timing differences and that there is no minimum time frame during which the cash must remain restricted.\nLong-term restricted cash of $73.8 million as of September 30, 2025 is primarily related to cash held as collateral as required by the Federal Deposit Insurance Corporation (\"FDIC\") for Square Financial Services. We have recorded these amounts as non-current assets on our condensed consolidated balance sheet as the requirement by the FDIC specifies a time frame of 12 months or longer during which the cash must remain restricted.\nWe experience significant day-to-day fluctuations in our cash and cash equivalents due to fluctuations in settlements receivable and customers payable, and hence working capital. These fluctuations are primarily due to:\nTiming of period end.\nFor periods that end on a weekend or a bank holiday, our cash and cash equivalents, settlements receivable, and customers payable balances typically will be higher than for periods ending on a weekday, as we settle to our sellers for payment processing activity on business days; and\nFluctuations in daily GPV.\nWhen daily GPV increases, our cash and cash equivalents, settlements receivable, and customers payable amounts increase. Typically our settlements receivable and customers payable balances at period end represent one to four days of receivables and disbursements to be made in the subsequent period. Customers payable, excluding amounts attributable to Cash App stored funds, and settlements receivable balances typically move in tandem, as pay-out and pay-in largely occur on the same business day. However, customers payable balances will be greater in amount than settlements receivable balances due to the fact that a subset of funds are held due to unlinked bank accounts, risk holds, and chargebacks. Customer funds obligations, which may be impacted by the timing of period end, number of processors used and processing times, are included in customers payable and may also cause customers payable to trend differently than settlements receivable. Holidays and day-of-week may also cause significant volatility in daily GPV amounts.\nCash Flow Activities\nThe following table summarizes our cash flow activities (in thousands):\nNet cash provided by operating activities\nNet cash provided by (used in) investing activities\nNet cash provided by (used in) financing activities\nEffect of foreign exchange rate on cash and cash equivalents\nNet increase in cash, cash equivalents, restricted cash, and customer funds\nCash Flows from Operating Activities\n\nDuring the third quarter of 2025, we issued $2.2 billion in aggregate principal amount of senior unsecured notes comprised of\nin aggregate principal amount of senior notes due 2030 (\"2030 Senior Notes\") and\nin aggregate principal amount due 2033 (\"2033 Senior Notes\"). We ended the third quarter of 2025 with $10.5 billion in available liquidity, with $9.7 billion in cash, cash equivalents, restricted cash, and investments in marketable debt securities, as well as an undrawn amount of $775.0 million available under our revolving credit facility. This represents a decrease of $234.2 million from our available liquidity as of December 31, 2024, primarily due to a $1.0 billion cash payment for the settlement of the outstanding 2025 Convertible Notes that matured in March 2025 and $1.5 billion of share repurchases in 2025, partially offset by $2.2 billion cash received related to the 2030 Senior Notes and 2033 Senior Notes issued in the third quarter of 2025.\nIn October 2023, our board of directors authorized the repurchase of up to $1 billion of our Class A common stock. In July 2024, our board of directors authorized an increase to this share repurchase program to repurchase up to an additional $3 billion of our Class A common stock, for a total overall authorization of $4 billion. The goal of the program is to return capital to shareholders. The timing and number of shares repurchased will depend on a variety of factors, including the stock price, business and market conditions, corporate and regulatory requirements, alternative investment opportunities, acquisition opportunities, and other factors. As of September 30, 2025, we have repurchased $2.9 billion of our Class A common stock under the program, of which $403.0 million was purchased in the third quarter of 2025.\nResults of Operations\nRevenue (in thousands, except for percentages)\nTransaction-based revenue\nSubscription and services-based revenue\nNM\nNM\nNot meaningful (\"NM\")\nTotal net revenue for the three months ended September 30, 2025 increased by $139.2 million, or 2%, compared to the three months ended September 30, 2024 and decreased by $147.3 million, or 1%, for the nine months ended September 30, 2025, compared to the nine months ended September 30, 2024. Bitcoin revenue decreased by $462.2 million and $1.4 billion for the three and nine months end"
}