{
  "source_file": "yum-20250930.htm",
  "form_type": "10-Q",
  "item1_clean": null,
  "item7_clean": null,
  "item2_clean": "Management’s Discussion and Analysis of Financial Condition and Results of Operations\nIntroduction and Overview\nIn the first quarter of 2025, the Company prospectively changed its basis of presentation to round financial figures in the Financial Statements and as presented in the tabular presentations in this MD&A to the nearest whole number in millions in all instances. As a result, some totals and percentages may not recompute based on rounded figures as presented within this MD&A. Previously, amounts were presented to ensure that all numbers herein recomputed, resulting in the presentation of certain figures inconsistent with their underlying rounding.\nYum! Brands, Inc. and its Subsidiaries (collectively referred to herein as the “Company,” “YUM,” “we,” “us” or “our”) franchise or operate a system of over 62,000 restaurants in more than 155 countries and territories, primarily under the concepts of KFC, Taco Bell, Pizza Hut and The Habit Burger & Grill (collectively, the “Concepts”). The Company’s KFC, Taco Bell and Pizza Hut brands are global leaders of the chicken, Mexican-inspired and pizza categories, respectively. The Habit Burger & Grill, is a fast-casual restaurant concept specializing in made-to-order chargrilled burgers, sandwiches and more. Of the over 62,000 restaurants, 98% are operated by franchisees.\nYUM currently consists of four operating segments:\nThe KFC Division which includes our worldwide operations of the KFC concept\nThe Taco Bell Division which includes our worldwide operations of the Taco Bell concept\nThe Pizza Hut Division which includes our worldwide operations of the Pizza Hut concept\nThe Habit Burger & Grill Division which includes our worldwide operations of the Habit Burger & Grill concept\nThrough our Recipe for Good Growth we intend to deliver iconic restaurant brands and consistently drive better customer experiences, improved unit economics and higher rates of growth. Key enablers include accelerated use of digital and technology, increased collaboration and better leverage of our systemwide scale. This is done through a framework of three pillars: being Loved, Trusted and Connected.\nLoved: We grow by delighting customers with craveable food and a distinctive experience. We innovate and elevate our iconic restaurant brands that people trust and champion, resulting in relevant, easy and distinctive brands.\nTrusted: We operate responsibly with consistency and efficiency in our restaurants, across our system and in our communities. This includes a commitment to our priorities for social responsibility, risk management and sustainable stewardship of our people, food and planet.\nConnected: We use our teamwork, technology and global scale to serve every customer, everywhere, anytime. Our unmatched operating capability allows us to recruit and equip the best restaurant operators in the world to deliver great customer experiences. And our commitment to bold restaurant development drives market and franchise unit expansion with strong economics.\nOur unrivaled culture and talent and leading with smart, heart and courage are key to our success, fueling brand performance and franchise success.\nWe intend for this MD&A to provide the reader with information that will assist in understanding our results of operations, including performance metrics that management uses to assess the Company's performance. Throughout this MD&A, we commonly discuss the following performance metrics:\nSame-store sales growth is the estimated percentage change in system sales of all restaurants that have been open and in the YUM system for one year or more, including those temporarily closed. From time-to-time restaurants may be temporarily closed due to remodeling or image enhancement, rebuilding, natural disasters, health epidemic or pandemic, landlord disputes, boycotts, social or civil unrest or other issues. The system sales of restaurants we deem temporarily closed remain in our base for purposes of determining same-store sales growth and the restaurants remain in our unit count (see below).\nSame-store sales growth excludes, for subsidiaries operating on a monthly calendar, the extra day resulting from a leap year and excludes, for subsidiaries operating on a weekly periodic calendar, the last week of the year in fiscal years with 53rd weeks. We believe same-store sales growth is useful to investors because our results are heavily dependent on the results of our Concepts' existing store base. Additionally, same-store sales growth is reflective of the strength of our Brands, the effectiveness of our operational and advertising initiatives and local economic and consumer trends.\nGross unit openings reflects new openings by us and our franchisees. Net new unit growth reflects gross unit openings offset by permanent store closures, by us and our franchisees. To determine whether a restaurant meets the definition of a unit we consider whether the restaurant has operations that are ongoing and independent from another YUM unit, serves the primary product of one of our Concepts, operates under a separate franchise agreement (if operated by a franchisee) and has substantial and sustainable sales. We believe gross unit openings and net new unit growth are useful to investors because we depend on new units for a significant portion of our growth. Additionally, gross unit openings and net new unit growth are generally reflective of the economic returns to us and our franchisees from opening and operating our Concept restaurants.\nSystem sales and System sales excluding the impacts of foreign currency translation (“FX”) reflect the results of all restaurants regardless of ownership, including Company-owned and franchise restaurants. Sales at franchise restaurants typically generate ongoing franchise and license fees for the Company at a rate of 3% to 6% of sales. Increasingly, customers are paying a fee to a third party to deliver or facilitate the ordering of our Concepts' products. We also include in System sales any portion of the amount customers pay these third parties for which the third party is obligated to pay us a license fee as a percentage of such amount. Franchise restaurant sales and fees paid by customers to third parties to deliver or facilitate the ordering of our Concepts' products are not included in Company sales on the Condensed Consolidated Statements of Income; however, any resulting franchise and license fees we receive are included in the Company's revenues. We believe System sales growth is useful to investors as a significant indicator of the overall strength of our business as it incorporates our primary revenue drivers, Company and franchise same-store sales as well as net new unit growth.\nIn addition to the results provided in accordance with Generally Accepted Accounting Principles in the United States of America (\nGAAP\n), the Company provides the following non-GAAP measurements:\nDiluted Earnings Per Share excluding Special Items (as defined below);\nEffective Tax Rate excluding Special Items;\nCore Operating Profit. Core Operating Profit excludes Special Items and FX and we use Core Operating Profit for the purposes of evaluating performance internally;\nNet Income excluding Special Items;\nCompany restaurant profit and Company restaurant margin as a percentage of sales (as defined below).\nThese non-GAAP measurements are not intended to replace the presentation of our financial results in accordance with GAAP. Rather, the Company believes that the presentation of these non-GAAP measurements provide additional information to investors to facilitate the comparison of past and present operations.\nSpecial Items are not included in any of our Division segment results as the Company does not believe they are indicative of our ongoing operations due to their size and/or nature. Our chief operating decision maker does not consider the impact of Special Items when assessing segment performance.\nCompany restaurant profit is defined as Company sales less Company restaurant expenses, both of which appear on the face of our Condensed Consolidated Statements of Income. Company restaurant expenses include those expenses incurred directly by our Company-owned restaurants in generating Company sales, including cost of food and paper, cost of restaurant-level labor, rent, depreciation and amortization of restaurant-level assets and advertising expenses incurred by and on behalf of that Company restaurant. Company restaurant margin as a percentage of sales (“Company restaurant margin %”) is defined as Company restaurant profit divided by Company sales. We use Company restaurant profit for the purposes of internally evaluating the performance of our Company-owned restaurants and we believe Company restaurant profit provides useful information to investors as to the profitability of our Company-owned restaurants. In calculating Company restaurant profit, the Company excludes revenues and expenses directly associated with our franchise operations as well as non-restaurant-level costs included in General and administrative expenses, some of which may support Company-owned restaurant operations. The\nCompany also excludes restaurant-level asset impairment and closures expenses, which have historically not been significant, from the determination of Company restaurant profit as such expenses are not believed to be indicative of ongoing operations. Further, while we generally include depreciation and amortization of restaurant-level assets within Divisional Company restaurant expenses used to derive Divisional Company restaurant profit, we record amortization of reacquired franchise rights arising from acquisition accounting within Corporate and unallocated Company restaurant expenses as such amortization is not believed to be indicative of ongoing Divisional results as well as to enhance comparability of acquired stores' margins with those of existing restaurants for which reacquired franchise rights are not applica"
}