{
  "source_file": "yum-20241231.htm",
  "form_type": "10-K",
  "item1_clean": "Yum! Brands, Inc. (referred to herein as “YUM”, the “Registrant” or the “Company”), was incorporated under the laws of the state of North Carolina in 1997. The principal executive offices of YUM are located at 1441 Gardiner Lane, Louisville, Kentucky 40213, and the telephone number at that location is (502) 874-8300. Our website address is\nOverview of Business\nThe following is a brief description of each Concept and a summary of our Concepts’ operations as of and for the year ended December 31, 2024:\n% of Units International\nNumber of Countries and Territories\nHabit Burger & Grill Division\nYUM\nKFC\nKFC was founded in Corbin, Kentucky, by Colonel Harland D. Sanders, an early developer of the quick service food business and a pioneer of the restaurant franchise concept. The Colonel perfected his secret blend of 11 herbs and spices for Kentucky Fried Chicken in 1939 and signed up his first franchisee in 1952. KFC restaurants across the world offer fried and non-fried chicken products such as sandwiches, chicken strips, chicken-on-the-bone and other chicken products marketed under a variety of names.\nThe first Taco Bell restaurant was opened in 1962 by Glen Bell in Downey, California, and in 1964, the first Taco Bell franchise was sold. Taco Bell specializes in Mexican-style food products, including various types of tacos, burritos, quesadillas, salads, nachos and other related items.\nThe first Pizza Hut restaurant was opened in 1958 in Wichita, Kansas, and within a year, the first franchise unit was opened. Today, Pizza Hut specializes in the sale of ready-to-eat pizza products and operates in the delivery, carryout and casual dining segments around the world.\nHabit Burger & Grill\nThe first Habit Burger & Grill restaurant opened in 1969 in Santa Barbara, California. The Habit Burger & Grill restaurant concept is built around a distinctive and diverse menu that includes chargrilled burgers and sandwiches made-to-order over an open flame and topped with fresh ingredients.\nThrough our Recipe for Good Growth we intend to deliver iconic restaurant brands and consistently drive better customer experiences, improved unit economics and higher rates of growth. Key enablers include accelerated use of digital and technology, increased collaboration and better leverage of our systemwide scale. This is done through a framework of three pillars: being Loved, Trusted and Connected.\nLoved: We grow by delighting customers with craveable food and a distinctive experience. We innovate and elevate our iconic restaurant brands that people trust and champion, resulting in relevant, easy and distinctive brands.\nTrusted: We operate responsibly with consistency and efficiency in our restaurants, across our system and in our communities. This includes a commitment to our priorities for social responsibility, risk management and sustainable stewardship of our people, food and planet.\nConnected: We use our teamwork, technology and global scale to serve every customer, everywhere, anytime. Our unmatched operating capability allows us to recruit and equip the best restaurant operators in the world to deliver great customer experiences. And our commitment to bold restaurant development drives market and franchise unit expansion with strong economics.\nOur unrivaled culture and talent and leading with smart, heart and courage are key to our success, fueling brand performance and franchise success.\nInformation about Operating Segments\nAs of December 31, 2024, YUM consists of four operating segments:\nThe KFC Division which includes our worldwide operations of the KFC concept\nThe Taco Bell Division which includes our worldwide operations of the Taco Bell concept\nThe Pizza Hut Division which includes our worldwide operations of the Pizza Hut concept\nThe Habit Burger & Grill Division which includes our worldwide operations of the Habit Burger & Grill concept\nFranchise Agreements\nThe franchise programs of the Company are designed to promote consistency and quality, and the Company is selective in granting franchises. The Company is focused on partnering with franchisees who have the commitment, capability and capitalization to grow our Concepts. Franchisees can range in size from individuals owning just one restaurant to large publicly-traded companies. The Company has franchise relationships that are particularly important to our business, such as our relationship with Yum China (defined below) and our relationships with certain other large franchisees.\nThe Company currently has approximately 1,500 franchisees with whom we have franchise contracts. The Company utilizes both store-level franchise and master franchise programs to grow our businesses. Of our over 60,000 franchised units at December 31, 2024, approximately 35% operate under our master franchise programs, including over 15,400 units in mainland China.\n\nThe Company and franchisees of the Concepts are substantial purchasers of a number of food and paper products, equipment and other restaurant supplies. The principal items purchased include chicken, cheese, beef and pork products, paper and packaging materials. Prices paid for these supplies fluctuate. When prices increase, the Concepts may attempt to pass on such increases to their customers, although there is no assurance that this can be done in practice. The Company does not typically experience significant continuous shortages of supplies, and alternative sources for most of these supplies are generally available.\nIn the U.S., the Company, along with the representatives of the Company’s KFC, Taco Bell and Pizza Hut franchisee groups, are members of Restaurant Supply Chain Solutions, LLC (“RSCS”), a third party which is responsible for purchasing certain restaurant products and equipment. Additionally, Habit Burger & Grill entered into a purchasing agreement with RSCS effective July 31, 2020. The core mission of RSCS is to provide the lowest possible sustainable store-delivered prices for restaurant products and equipment. This arrangement combines the purchasing power of the Company-owned and franchisee restaurants, which the Company believes leverages the system’s scale to drive cost savings and effectiveness in the purchasing function. The Company also believes that RSCS fosters closer alignment of interests and a stronger relationship with our franchisee community.\nMost food products, paper and packaging supplies, and equipment used in restaurant operations are distributed to individual restaurant units by third-party distribution companies. In the U.S., McLane Foodservice, Inc. is the distributor for the majority of items used in Company-owned restaurants and for a substantial number of franchisee restaurants. Outside the U.S., we and our Concepts’ franchisees primarily use decentralized sourcing and distribution systems involving many different global, regional and local suppliers and distributors. Our international franchisees generally select and manage their own third-party suppliers and distributors, subject to our internal standards. All suppliers and distributors are expected to provide products and/or services that comply with all applicable laws, rules and regulations in the state and/or country in which they operate as well as comply with our internal standards.\nAdvertising and Promotional Programs\nCompany-owned and franchise restaurants are required to spend a percentage of their respective restaurants’ sales on advertising programs with the goal of increasing sales and enhancing the reputation of the Concepts. Advertising may be conducted nationally, regionally and locally. When multiple franchisees operate in the same country or region, the national and regional advertising spending is typically conducted by a cooperative to which the franchisees and Company-owned restaurants, if any, contribute funds as a percentage of restaurants’ sales. The contributions are primarily used to pay for expenses relating to purchasing media for advertising, market research, commercial production, talent payments and other support functions for the respective Concepts. We have the right to control the advertising activities of certain advertising cooperatives, typically in markets where we have Company-owned restaurants, through our majority voting rights.\nInformation about the Company’s working capital is included in MD&A in Part II, Item 7 and the Consolidated Statements of Cash Flows in Part II, Item 8.\nThe Company does not consider its operations to be seasonal to any material degree.\nThe retail food industry, in which our Concepts compete, is made up of supermarkets, supercenters, warehouse stores, convenience stores, coffee shops, snack bars, delicatessens and restaurants (including those in the QSR segment), and is intensely competitive with respect to price and quality of food products, new product development, digital engagement, advertising levels and promotional initiatives, customer service reputation, restaurant location and attractiveness and maintenance of properties. Competition has also increased from and been enabled by delivery aggregators and other food delivery services in recent years, particularly in urbanized areas. Our Concepts also face competition as a result of convergence in grocery, convenience, deli and restaurant services, including the offering by the grocery industry of convenient meals, including pizzas and entrees with side dishes. The retail food industry is often affected by: changes in consumer tastes; national, regional or local economic conditions; currency fluctuations; demographic trends; traffic patterns; the type, number and location of competing food retailers and products; and disposable purchasing power. Within the retail food industry, each of our Concepts competes with international, national and regional chains as well as locally-owned establishments, not only for customers, but also for management and hourly personnel, suitable real estate sites and qualified franchisees. Given the various types and vast number of competitors, our Concepts do not constitute a significant portion of the retail food industry in terms of number of system units or system sales, either on a worldwide or individual country basis.\nEnvironmental Matters\nThe Company is not aware of any federal, state or local environmental laws or regulations that will materially affect our earnings or competitive position, or result in material capital expenditures. However, the Company cannot predict the effect on our operations due to possible future environmental legislation or regulations. During 2024, there were no material capital expenditures for environmental control facilities and no such material expenditures are anticipated.\nGovernment Regulation\n\nThe remainder of our franchise units operate under store-level franchise agreements. Under both types of franchise programs, franchisees supply capital by purchasing or leasing the land, building, equipment, signs, seating, inventories and supplies and, over the longer term, by reinvesting in the business. In certain historical refranchising transactions the Company may have retained ownership of land and building and continues to lease them to the franchisee. Store-level franchise agreements typically require payment to the Company of certain upfront fees such as initial fees paid upon opening of a store, fees paid to renew the term of the franchise agreement and fees paid in the event the franchise agreement is transferred to another franchisee. Franchisees also pay monthly continuing fees based on a percentage of their restaurants’ sales (typically between 4% to 6%) and are required to spend a certain amount to advertise and promote the brand. Under master franchise arrangements, the Company enters into agreements that allow master franchisees to operate restaurants as well as sub-franchise restaurants within certain geographic territories. Master franchisees are typically responsible for overseeing development within their territ",
  "item7_clean": "Management’s Discussion and Analysis of Financial Condition and Results of Operations.\nIntroduction and Overview\nThe following Management’s Discussion and Analysis (“MD&A”), should be read in conjunction with the Consolidated Financial Statements (“Financial Statements”) in Item 8 and the Forward-Looking Statements and the Risk Factors set forth in Item 1A. All Note references herein refer to the Notes to the Financial Statements. Tabular amounts are displayed in millions of U.S. dollars except per share and unit count amounts, or as otherwise specifically identified. Percentages may not recompute due to rounding.\nYum! Brands, Inc. and its subsidiaries (collectively referred to herein as the “Company”, “YUM”, “we”, “us” or “our”) franchise or operate a system of over 61,000 restaurants in more than 155 countries and territories, primarily under the concepts of KFC, Taco Bell, Pizza Hut and Habit Burger & Grill (collectively, the “Concepts”). The Company’s KFC, Taco Bell and Pizza Hut brands are global leaders of the chicken, Mexican-style food and pizza categories, respectively. The Habit Burger & Grill is a fast-casual restaurant concept specializing in made-to-order chargrilled burgers, sandwiches and more. Of the over 61,000 restaurants, 98% are operated by franchisees.\nAs of December 31, 2024, YUM consists of four operating segments:\nThe KFC Division which includes our worldwide operations of the KFC concept\nThe Taco Bell Division which includes our worldwide operations of the Taco Bell concept\nThe Pizza Hut Division which includes our worldwide operations of the Pizza Hut concept\nThe Habit Burger & Grill Division which includes our worldwide operations of the Habit Burger & Grill concept\nThrough our Recipe for Good Growth we intend to deliver iconic restaurant brands and consistently drive better customer experiences, improved unit economics and higher rates of growth. Key enablers include accelerated use of digital and technology, increased collaboration and better leverage of our systemwide scale. This is done through a framework of three pillars: being Loved, Trusted and Connected.\nLoved: We grow by delighting customers with craveable food and a distinctive experience. We innovate and elevate our iconic restaurant brands that people trust and champion, resulting in relevant, easy and distinctive brands.\nTrusted: We operate responsibly with consistency and efficiency in our restaurants, across our system and in our communities. This includes a commitment to our priorities for social responsibility, risk management and sustainable stewardship of our people, food and planet.\nConnected: We use our teamwork, technology and global scale to serve every customer, everywhere, anytime. Our unmatched operating capability allows us to recruit and equip the best restaurant operators in the world to deliver great customer experiences. And our commitment to bold restaurant development drives market and franchise unit expansion with strong economics.\nOur unrivaled culture and talent and leading with smart, heart and courage are key to our success, fueling brand performance and franchise success.\nWe intend to drive long-term growth and shareholder returns primarily through consistent same-store sales growth and new unit development across all of our Concepts. We intend to support this growth and development through a capital and operating structure that:\nInvests capital in a manner consistent with an asset light, franchisor model;\nAllocates G&A in an efficient manner that provides leverage to operating profit growth while at the same time opportunistically investing in strategic growth initiatives;\nTargets a consolidated net leverage ratio that balances shareholder returns, cost of capital and flexibility against various risk factors; and\nMaximizes shareholder return through a combination of paying a competitive dividend and returning excess free cash flow through share repurchases.\nWe intend for this MD&A to provide the reader with information that will assist in understanding our results of operations, including performance metrics that management uses to assess the Company’s performance. Throughout this MD&A, we commonly discuss the following performance metrics:\nSame-store sales growth is the estimated percentage change in system sales of all restaurants that have been open and in the YUM system for one year or more, including those temporarily closed. From time-to-time restaurants may be temporarily closed due to remodeling or image enhancement, rebuilding, natural disasters, health epidemic or pandemic, landlord disputes, boycotts, social or civil unrest or other issues. The system sales of restaurants we deem temporarily closed remain in our base for purposes of determining same-store sales growth and the restaurants remain in our unit count (see below). Same-store sales growth excludes, for subsidiaries operating on a monthly calendar, the extra day resulting from a leap year and excludes, for subsidiaries operating on a weekly periodic calendar, the last week of the year in fiscal years with 53 weeks. We believe same-store sales growth is useful to investors because our results are heavily dependent on the results of our Concepts' existing store base. Additionally, same-store sales growth is reflective of the strength of our Brands, the effectiveness of our operational and advertising initiatives and local economic and consumer trends.\nGross unit openings reflects new openings by us and our franchisees. Net new unit growth reflects gross unit openings offset by permanent store closures, by us and our franchisees. To determine whether a restaurant meets the definition of a unit we consider factors such as whether the restaurant has operations that are ongoing and independent from another YUM unit, serves the primary product of one of our Concepts, operates under a separate franchise agreement (if operated by a franchisee) and has substantial and sustainable sales. We believe gross unit openings and net new unit growth are useful to investors because we depend on new units for a significant portion of our growth. Additionally, gross unit openings and net new unit growth are generally reflective of the economic returns to us and our franchisees from opening and operating our Concept restaurants.\nSystem sales, System sales excluding the impacts of foreign currency translation (“FX”) and, in 2024, System sales excluding FX and the 53rd week for our U.S. subsidiaries and certain international subsidiaries that operate on a weekly periodic calendar, reflect the results of all restaurants regardless of ownership, including Company-owned and franchise restaurants. Sales at franchise restaurants typically generate ongoing franchise and license fees for the Company at a rate of 3% to 6% of sales. Increasingly, customers are paying a fee to a third party to deliver or facilitate the ordering of our Concepts’ products. We also include in System sales any portion of the amount customers pay these third parties for which the third party is obligated to pay us a license fee as a percentage of such amount. Franchise restaurant sales and fees paid by customers to third parties to deliver or facilitate the ordering of our Concepts’ products are not included in Company sales on the Consolidated Statements of Income; however, any resulting franchise and license fees we receive are included in the Company’s revenues. We believe System sales growth is useful to investors as a significant indicator of the overall strength of our business as it incorporates our primary revenue drivers, Company and franchise same-store sales as well as net new unit growth.\nAs of the beginning of the second quarter of 2022, as a result of our progress towards exiting Russia and our decision to reclass future net profits attributable to Russia subsequent to the date of invasion of Ukraine from the Division segments in which those profits were earned to Unallocated Other income (see Notes 3 and 19), we elected to remove all Russia units from our unit count as well as to begin excluding those units’ associated sales from our system sales totals. We removed 1,112 units and 53 units in Russia from our global KFC and Pizza Hut unit counts, respectively. These units were treated similar to permanent store closures for purposes of our same-store sales calculations and thus they were removed from our same-store sales calculations beginning April 1, 2022.\nIn addition to the results provided in accordance with Generally Accepted Accounting Principles in the United States of America (“GAAP”), the Company provides the following non-GAAP measurements.\nDiluted Earnings Per Share (\"EPS\") excluding Special Items (as defined below) and, in 2024, Diluted EPS excluding Special Items and the 53rd week;\nEffective Tax Rate excluding Special Items and, in 2024, Effective Tax Rate excluding Special Items and the 53rd week;\nCore Operating Profit and, in 2024, Core Operating Profit excluding the 53rd week. Core Operating Profit excludes Special Items and FX and we use Core Operating Profit for the purposes of evaluating performance internally;\nNet Income excluding Special Items and, in 2024, Net Income excluding Special Items and the 53rd week;\nCompany restaurant profit and Company restaurant margin as a percentage of sales (as defined below).\nThese non-GAAP measurements are not intended to replace the presentation of our financial results in accordance with GAAP. Rather, the Company believes that the presentation of these non-GAAP measurements provide additional information to investors to facilitate the comparison of past and present operations.\nSpecial Items are not included in any of our Division segment results as the Company does not believe they are indicative of our ongoing operations due to their size and/or nature. Our chief operating decision maker does not consider the impact of Special Items when assessing segment performance.\nCompany restaurant profit is defined as Company sales less Company restaurant expenses, both of which appear on the face of our Consolidated Statements of Income. Company restaurant expenses include those expenses incurred directly by our Company-owned restaurants in generating Company sales, including cost of food and paper, cost of restaurant-level labor, rent, depreciation and amortization of restaurant-level assets and advertising expenses incurred by and on behalf of that Company restaurant. Company restaurant margin as a percentage of sales (“Company restaurant margin %”) is defined as Company restaurant profit divided by Company sales. We use Company restaurant profit for the purposes of internally evaluating the performance of our Company-owned restaurants and we believe Company restaurant profit provides useful information to investors as to the profitability of our Company-owned restaurants. In calculating Company restaurant profit, the Company excludes revenues and expenses directly associated with our franchise operations as well as non-restaurant-level costs included in General and administrative expenses, some of which may support Company-owned restaurant operations. The Company also excludes restaurant-level asset impairment and closures expenses, which have historically not been significant, from the determination of Company restaurant profit as such expenses are not believed to be indicative of ongoing operations. Further, while we generally include depreciation and amortization of restaurant-level assets within Divisional Company restaurant expenses used to derive Divisional Company restaurant profit, we record amortization of reacquired franchise rights arising from acquisition accounting within Corporate and unallocated Company restaurant expenses as such amortization is not believed to be indicative of ongoing Divisional results as well as to enhance comparability of acquired stores’ margins with those of existing restaurants within Divisional results. Company restaurant profit and Company restaurant margin % as presented may not be comparable to other similarly titled measures of other companies in the industry.\nCertain performance metrics and non-GAAP measurements are presented excluding the impact of FX. These amounts are derived by translating current year results at prior year average exchange rates. We believe the elimination of the FX impact provides better year-to-year comparability without the distortion of foreign currency fluctuations.\nFor 2024 we provided System sales excluding FX and the 53rd week, Core Operating Profit excluding the 53rd week, Net Income excluding Special Items and the 53rd week, Diluted EPS excluding Special Items and the 53rd week and Effective Tax Rate excluding Special Items and the 53rd week to further enhance the comparability given the 53rd week that was part of our fiscal calendar in 2024.\nResults of Operations\n2024 financial highlights:\nGAAP Operating Profit\nCore Operating Profit\nResults Excluding 53rd Week in 2024\nCore Operating Profit\nForeign currency translation negatively impacted Divisional Operating Profit by $28 million for the year ended December 31, 2024. This included a negative impact to our KFC Division Operating Profit of $22 million for the year ended December 31, 2024.\nGAAP EPS\nNM\nEPS Excluding Special Items\nGross unit openings for the year were 4,535 units resulting in 2,757 net new units.\nFull-year EPS excluding Special Items and 53rd Week was $5.39.\n\nweek on Revenues and Operating Profit for the year ended December 31, 2024. The 53rd week in 2024 favorably impacted Diluted EPS by approximately $0.09 per share.\nHabit Burger & Grill Division\nFranchise and property revenues\nFranchise contributions for advertising and other services\nFranchise and property revenues\nFranchise contributions for advertising and other services\nFranchise for advertising and other services expenses\nMiddle East Conflict\nDuring the fourth quarter of 2023, certain of our markets, principally in our KFC and Pizza Hut Divisions, began being impacted by a military conflict in the Middle East region. Our sales continued to be impacted during 2024, most significantly in markets across the Middle East, Malaysia and Indonesia. The impact in these markets represented an approximate one-point headwind to YUM's overall same-store sales growth in the year ended December 31, 2024. Additionally, we believe we experienced conflict-related impacts in a broader set of markets and trade areas, though such amounts are difficult to precisely quantify.\nIn a few isolated cases, the scale and duration of these sales impacts have affected the financial health of our less scaled or less well-capitalized franchisees, particularly those whose restaurants have been most heavily impacted. On January 8, 2025, we terminated our franchise agreements with franchisee IS Gida A.S. (IS Gida), the owner and operator of KFC and Pizza Hut restaurants in Turkey and a subsidiary of IS Holding A.S. (IS Holding), after failure by IS Gida to meet our standards. The termination affects 284 KFC restaurants and 254 Pizza Hut restaurants in Turkey, which will be reflected as a reduction in the Company’s reported unit counts at the end of the first quarter of 2025. We also re-acquired the master franchise rights in Germany for KFC and Pizza Hut from the owner of IS Holding in December 2024. There is no impact in Germany from the termination in Turkey. We recorded a charge of approximately $61 million in the year ended December 31, 2024, consisting primarily of transaction costs associated with the German acquisition and termination-related costs associated with the Turkey business. Due to issues specific to this franchisee and market, the recent sales in the Turkey restaurants were significantly below the global average sales per restaurant for each brand. As a result, the loss of royalties from the store closures will have no material impact to the Company’s Core Operating Profit in 2025 and beyond. We are actively searching",
  "item2_clean": null
}