{
  "source_file": "zbh-20241231.htm",
  "form_type": "10-K",
  "item1_clean": null,
  "item7_clean": "Selling, general & administrative (“SG&A”) expenses increased in amount, but decreased as a percentage of net sales in 2024 compared to 2023. The increase in expenses was due to selling and distribution costs that are variable expenses which increase as net sales increase. In addition, SG&A expense increased due to higher bad debt-related charges driven by a bankruptcy at a significant U.S. healthcare system, higher instrument-related costs due to new product introductions, higher litigation-related charges, a gain recognized in 2023 from the sale of an asset which did not recur in 2024, and higher spending on various strategic initiatives. These higher expenses were partially offset by savings from our 2023 Restructuring Plan and lower performance-related expenses. The decline in SG&A expenses as a percentage of net sales was due to many of our SG&A expenses being fixed costs that do not change as net sales increase.\n\nIn December of each of 2023, 2021 and 2019, we initiated global restructuring programs (the “2023 Restructuring Plan,” the “2021 Restructuring Plan” and the “2019 Restructuring Plan,” respectively). We also have other cost reduction and optimization initiatives that have the goal of reducing costs across the organization. We recognized expenses of $219.0 million and $151.9 million in 2024 and 2023, respectively, primarily related to employee termination benefits, sales agent contract terminations, and consulting and project management expenses associated with these programs. The expenses were higher in 2024 compared to 2023 primarily due to additional expenses related to the 2023 Restructuring Plan that had just been initiated at the end of 2023 and additional expenses related to our U.S. and Canada ERP implementation. For more information regarding these expenses, see Note 5 to our consolidated financial statements.\n\nCost of products sold, excluding intangible asset amortization, increased in both amount and as a percentage of net sales in 2024 compared to 2023. The increase in amount was primarily due to a higher volume of net sales. The increase as a percentage of net sales was due to higher manufacturing costs from inflation and other cost pressures. The manufacturing cost increase was partially offset by lower royalty expense, volume and mix shift to higher margin products and markets, and improved pricing. The reduction in royalty expense was partially the result of agreements we entered into in 2023 to acquire intellectual property through the buyout of certain licensing arrangements, which are recognized as intangible assets and result in additional intangible asset amortization expense instead of royalty expense.\n\nWe review sales by two geographies, the United States and International, and by the following product categories: Knees; Hips; S.E.T. (Sports Medicine, Extremities, Trauma, Craniomaxillofacial and Thoracic); and Technology & Data, Bone Cement and Surgical. This sales analysis differs from our reportable operating segments, which are based upon our senior management organizational structure and how we allocate resources toward achieving operating profit goals. We review sales by these geographies because the underlying market trends in any particular geography tend to be similar across product categories, because we primarily sell the same products in all geographies and because many of our competitors publicly report in this manner. Our business is seasonal in nature to some extent, as many of our products are used in elective surgical procedures, which typically decline during the summer months and can increase at the end of the year once annual deductibles have been met on health insurance plans.\n\nWe expect year-over-year revenue growth of 1.0 percent to 3.5 percent in 2025 to be driven by a combination of market growth, new product introductions and commercial execution. Based on foreign currency exchange rates at the end of 2024, we expect foreign currency to negatively affect year-over-year net sales by approximately 1.5 percent to 2.0 percent. We estimate operating profit will increase in 2025 when compared to 2024 due to higher net sales, leverage from fixed operating expenses, ongoing savings from our restructuring plans and lower employee termination and other charges from our restructuring plans. However, we estimate these favorable items may be partially offset by higher intangible asset amortization, higher net interest expense due to higher interest rates and a higher estimated effective tax rate due to favorable 2024 adjustments that are not expected to recur.\n\nThe preparation of our financial statements is affected by the selection and application of accounting policies and methods, and also requires us to make estimates and assumptions that affect the reported amounts of assets and liabilities and disclosure of contingent assets and liabilities at the date of the financial statements and the reported amounts of revenues and expenses during the reporting period. Critical accounting estimates are those that involve a significant level of estimation uncertainty and have had or are reasonably likely to have a material impact on our financial condition and results of operations. We believe that the accounting estimates and assumptions described below involve significant subjectivity and judgment, and changes to such estimates or assumptions could have a material impact on our financial condition or operating results.\n\nAcquisition, integration, divestiture and related expenses increased in 2024 when compared to 2023 due to the acquisitions made in 2024 as well as the fact that the 2023 acquisitions only had a partial year of integration costs in 2023.\n\nIn the Americas, operating profit increased, but operating profit as a percentage of net sales slightly decreased, in 2024 compared to 2023. The increase in operating profit in 2024 was primarily due to higher net sales driven by market growth and new product introductions, coupled with lower royalty expense as a result of agreements we entered into in 2023 to acquire intellectual property through the buyout of certain licensing arrangements. However, operating profit as a percentage of net sales decreased slightly due to investments in instruments to support new product introductions and higher bad debt-related charges in 2024.\n\nIn February 2025, we issued senior notes with aggregate principal amounts of $600 million of 4.700% notes due 2027 (“2027 Notes”), $550 million of 5.050% notes due 2030 (“2030 Notes”), and $600 million of 5.500% notes due 2035 (“2035 Notes”). We intend to use the net proceeds from these notes, together with cash on hand or other immediately available funds, to pay the consideration, fees, and expenses for the Paragon 28 acquisition. We further intend to use a portion of the proceeds of the 2027 Notes for general corporate purposes, which may include the repayment of other indebtedness (which could include the repayment of our 3.550% notes due April 1, 2025), share repurchases, financing capital commitments and financing future acquisitions. If we fail to consummate the Paragon 28 acquisition either (i) prior to November 28, 2025 (as such date may be extended in accordance with the terms of the Paragon 28 merger agreement and the supplemental indenture governing the 2030 Notes and the 2035 Notes); or (ii) due to the termination of Paragon 28 merger agreement pursuant to its terms, then we will be obligated to redeem all of the 2030 notes and the 2035 notes on the special mandatory redemption date at a redemption price equal to 101% of the principal amount of such series of notes, plus accrued and unpaid interest to, but excluding, the special mandatory redemption date.\n\nAs discussed in Note 5 to our consolidated financial statements, we are executing on a 2023 Restructuring Plan, a 2021 Restructuring Plan and a 2019 Restructuring Plan. The 2023 Restructuring Plan along is expected to result in total pre-tax charges of approximately $120 million by the end of 2025, of which $114 million was incurred through December 31, 2024. We expect to reduce gross annual pre-tax operating expenses by $175 million to $200 million relative to the 2023 baseline expenses by the end of 2025 as program benefits under the 2023 Restructuring Plan are realized. The 2021 Restructuring Plan was completed by the end of 2024, resulting in $169 million of total pre-tax charges. We estimate gross annual pre-tax operating expenses were reduced by approximately $190 million relative to the 2021 baseline expenses by the end of 2024. The 2019 Restructuring Plan is expected to result in total pre-tax restructuring charges of approximately $400 million by the end of 2025, of which $368 million was incurred through December 31, 2024. In our original estimates, we expected to reduce gross annual pre-tax operating expenses by approximately $180 million to $280 million relative to the 2019 baseline expenses by the end of 2023 as benefits under the 2019 Restructuring Plan were realized. Our latest estimates indicate that we will be near the low end of that range, and the full benefits will not be realized until we complete the closure of a manufacturing facility, which is expected to occur in 2025.\n\nWe recognize tax liabilities in accordance with the Financial Accounting Standards Board (“FASB”) guidance on income taxes and we adjust these liabilities when our judgment changes as a result of the evaluation of new information not previously available. Due to the complexity of some of these uncertainties, the ultimate resolution may result in a payment that is materially different from our current estimate of the tax liabilities. These differences will be reflected as increases or decreases to income tax expense in the period in which they are determined.\n\nIn 2024, our net sales increased 3.8 percent when compared to 2023. Net sales growth was driven by a combination of market growth, new product introductions, positive price realization and commercial execution across the organization. These favorable items were negatively impacted by our transition in July 2024 to a new enterprise resource planning (\"ERP\") software system for a significant portion of our U.S. and Canada sales and commercial operations. As a result of this ERP implementation, we experienced operational challenges which affected our ability to fulfill certain customer orders. This disruption mostly affected our U.S. net sales, but our International net sales were also impacted as shipments to our international affiliates were delayed. Shipping levels returned to similar levels that existed prior to the implementation by the end of the year. For the full year 2024, we estimate this ERP implementation had less than a one percent impact to our net sales. In addition, our net sales in 2024 were tempered by a negative 1.0 percent effect from changes in foreign currency exchange rates.\n\nIn EMEA, operating profit and operating profit as a percentage of net sales increased in 2024 when compared to 2023. The increases were due to higher net sales driven by market growth and improved pricing, lower excess and obsolete inventory charges, reduced royalty expense as a result of agreements we entered into in 2023 to acquire intellectual property through the buyout of certain licensing arrangements, and lower expenses driven by our 2023 Restructuring Plan and cost savings initiatives.\n\nExcess Inventory and Instruments\n- We must determine as of each balance sheet date how much, if any, of our inventory may ultimately prove to be unsaleable or unsaleable at our carrying cost. Similarly, we must also determine if instruments on hand will be put to productive use or remain undeployed as a result of excess supply. Accordingly, inventory and instruments are written down to their net realizable value. To determine the appropriate net realizable value, we evaluate current stock levels in relation to historical and expected patterns of demand for all of our products and instrument systems and components. The basis for the determination is generally the same for all inventory and instrument items and categories except for work in process inventory, which is recorded at cost. Obsolete or discontinued items are generally destroyed and completely written off. Management evaluates the need for changes to the net realizable values of inventory and instruments based on market conditions, competitive offerings and other factors on a regular basis.\n\nIn Asia Pacific, operating profit and operating profit as a percentage of net sales increased in 2024 when compared to 2023. The increases were due to higher net sales driven by market growth and improved pricing, reduced royalty expense as a result of agreements we entered into in 2023 to acquire intellectual property through the buyout of certain licensing arrangements, and lower expenses driven by our 2023 Restructuring Plan and cost savings initiatives.\n\nIn 2024, our Knees and Hips net sales increased by 4.4 percent and 1.6 percent, respectively, when compared to 2023 due to market growth and new product introductions. Changes in foreign currency exchange rates had negative effects of 0.8 percent and 1.4 percent on 2024 Knees and Hips net sales, respectively. S.E.T. net sales increased by 6.5 percent in 2024 when compared to 2023. S.E.T. net sales growth was primarily driven by net sales growth in CMFT, sports medicine and upper extremities products of 14.0 percent, 13.1 percent and 6.0 percent, respectively, partially offset by a 0.5 percent decline in net sales of trauma products. Changes in foreign currency exchange rates had a negative effect of 0.6 percent on 2024 S.E.T. net sales. Technology & Data, Bone Cement and Surgical product category net sales increased by 0.7 percent in 2024 when compared to 2023 primarily due to higher net sales for our ROSA robot in the first half of the year, but was partially offset by the operational challenges from our ERP system implementation.\n\nResearch & development (“R&D”) expenses decreased in both amount and as a percentage of net sales in 2024 compared to 2023. The decreases were driven by lower spending on our initial compliance with the EU MDR as we continue to make progress on the approvals of our products, and savings from our 2023 Restructuring Plan.\n\nOur net earnings were $903.8 million in 2024 compared to $1,024.0 million in 2023. The decline in net earnings was driven by higher favorable tax settlements in 2023 compared to 2024, higher charges from our 2023 Restructuring Plan which was instituted at the end of 2023 and continued into 2024, including $84.6 million in employee termination benefits-related charges recognized in 2024, and higher intangible asset amortization. These unfavorable items were partially offset by the net sales increase, savings from our 2023 Restructuring Plan and other initiatives, and lower research and development (\"R&D\") spending for initial compliance with the European Union Medical Device Regulation (\"EU MDR\").\n\nItem 7. Management’s Discussion and Analysis of\nFinancial Condition and Results of Operations\n\nThe 3.5 percent net sales growth in the U.S. in 2024 when compared to 2023 was driven by market growth in our Knees, Hips and S.E.T. product categories. However, net sales in the U.S. were negatively impacted by the implementation of our new ERP system which caused operational challenges in fulfilling customer orders. Internationally, net sales increased by 4.3 percent in 2024 when compared to 2023. The 2024 International net sales increase was similarly driven by market growth in most of our international markets, but volume increases were partially offset by the negative impacts of changes in foreign currency exchange rates of 2.3 percent.\n\nFuture impairment in our reporting units could occur if the estimates used in the income and market approaches change. If our estimates of profitability in the reporting unit decline, the fair value estimate under",
  "item2_clean": null
}