{
  "source_file": "zbra-20250927.htm",
  "form_type": "10-Q",
  "item1_clean": null,
  "item7_clean": null,
  "item2_clean": "Cash flow provided by (used in):\nOperating activities\nInvesting activities\nFinancing activities\nEffect of exchange rates on cash balances\nNet change in cash and cash equivalents, including restricted cash\nThe change in our cash and cash equivalents balance during the nine months ended September 27, 2025 compared to the prior year was primarily due to the following:\n$147 million decrease in net operating cash inflows primarily due to larger reductions in inventory in the prior year, higher employee incentive compensation payments in the current year, and cash receipts from the settlements of terminated interest rate swap agreements in the prior year. These items were partly offset by favorable timing of customer collections.\n$79 million increase in net investing cash outflows primarily due to cash payments for the acquisition of Photoneo and higher capital expenditures.\n$159 million increase in net financing cash outflows primarily due to higher share repurchases in the current year, partially offset by net debt repayments in the prior year as well as the timing of transactions associated with servicing factored receivables.\nThe following table shows the carrying value of the Company’s debt (in millions):\nReceivables Financing Facility\nLess: Debt issuance costs\nLess: Unamortized discounts\nLess: Current portion of debt\nTotal long-term debt\nThe principal on Term Loan A is due in quarterly installments, with the next quarterly installment due in the first quarter of 2026 and the majority due upon maturity on May 25, 2027. The Company has made and may make prepayments in whole or in part, without premium or penalty, and would be required to prepay certain outstanding amounts in the event of certain circumstances or transactions. As of September 27, 2025, the Term Loan A interest rate was 5.42%. Interest payments are made monthly and are subject to variable rates plus an applicable margin.\nIn the second quarter of 2024, the Company completed a private offering of $500 million senior unsecured notes (the “Senior Notes”) with a 6.5% fixed interest rate. The Senior Notes mature on June 1, 2032, and interest is payable semi-annually in arrears in June and December of each year. The Company has the option to or could be required to prepay certain outstanding amounts in the event of certain circumstances or transactions.\nThe Senior Notes are fully and unconditionally guaranteed on a senior unsecured basis by certain of Zebra’s existing and future subsidiaries. The Senior Notes contain covenants that, among other things, limit the ability of Zebra to: (i) grant or incur liens; (ii) have its subsidiaries guarantee debt without becoming guarantors; and (iii) merge or consolidate with another company or sell all or substantially all of its assets.\nRevolving Credit Facility\nThe Company has a Revolving Credit Facility that is available for working capital and other general business purposes, including letters of credit. As of September 27, 2025, the Company had letters of credit totaling $10 million, which reduced funds available for borrowings under the Revolving Credit Facility from $1,500 million to $1,490 million. As of September 27, 2025 and December 31, 2024, there were no borrowings under the Revolving Credit Facility. Upon borrowing, interest payments are made monthly and are subject to variable rates plus an applicable margin. The Revolving Credit Facility matures on May 25, 2027.\nReceivables Financing Facility\nAs of September 27, 2025, the Company has a Receivables Financing Facility with a borrowing limit of up to $180 million. As collateral, the Company pledges perfected first-priority security interests in its U.S. domestically originated accounts receivable. The Company has accounted for transactions under this facility as secured borrowings. The receivables financing facility matures on March 19, 2027.\nAs of September 27, 2025, the Company’s Consolidated Balance Sheets included $715 million of gross receivables that were pledged under the facility. As of September 27, 2025, $108 million had been borrowed and was classified as non-current. Borrowings under the facility bear interest at a variable rate plus an applicable margin. As of September 27, 2025, the facility had an average interest rate of 5.21%. Interest is paid monthly on these borrowings.\nThe Company’s borrowings described above include terms and conditions that limit the incurrence of additional borrowings and require that certain financial ratios be maintained at designated levels.\nReceivables Factoring\nThe Company has a Receivables Factoring arrangement, pursuant to which certain receivables originated from the EMEA and Asia-Pacific regions up to a maximum of €150 million are sold to a bank without recourse in exchange for cash. Such transfers are accounted for as sales and the related receivables are removed from the Company’s balance sheet. The Company does not maintain any beneficial interest in the receivables sold. The Company services the receivables on behalf of the bank, but otherwise maintains no significant continuing involvement with respect to the receivables. Sale proceeds that are representative of the fair value of factored receivables, less a factoring fee, are reflected in Cash flows from operating activities on the Consolidated Statements of Cash Flows, while sale proceeds in excess of the fair value of factored receivables are reflected in Cash flows from financing activities on the Consolidated Statements of Cash Flows.\nAs of both September 27, 2025 and December 31, 2024, there were a total of $28 million of uncollected receivables that had been sold and removed from the Company’s Consolidated Balance Sheets.\nAs servicer of sold receivables, the Company had $60 million and $51 million of obligations that were not yet remitted to the bank as of September 27, 2025 and December 31, 2024, respectively. These obligations are included within Accrued liabilities on the Consolidated Balance Sheets, with changes in such obligations reflected within Cash flows from financing activities on the Consolidated Statements of Cash Flows.\nAccounts Receivable Factoring\nin the Notes to Consolidated Financial Statements for further details.\nOn May 17, 2022, the Company announced that its Board of Directors authorized a share repurchase program for up to $1 billion of its outstanding shares of common stock. The authorized share repurchase program does not have a stated expiration date. The level of the Company’s repurchases depends on a number of factors, including its financial condition, capital requirements, cash flows, results of operations, future business prospects and other factors its management may deem relevant. The timing, volume, and nature of repurchases are subject to market conditions, applicable securities laws and other factors and may be amended, suspended or discontinued at any time. Repurchases may be effected from time to time through open market purchases, including pursuant to a pre-set trading plan meeting the requirements of Rule 10b5-1(c) of the Securities Exchange Act of 1934.\nDuring the first nine months of 2025, the Company repurchased 960,889 shares of common stock for approximately $284 million. As of September 27, 2025, the Company has cumulatively repurchased 1,500,463 shares of common stock for approximately $438 million, resulting in a remaining amount of share repurchases authorized under the May 2022 program of approximately $562 million. Subsequent to the quarter ended September 27, 2025, the Company has repurchased 85,458 shares of common stock for approximately $25 million through October 21, 2025.\nSignificant Customers\nEnd-users of our offerings are diversified across a wide variety of industries. We have three customers, who are distributors of the Company’s offerings, that individually accounted for more than 10% of our Net sales for the periods presented. In the aggregate, the approximate percentage of our segment and Company total Net sales attributable to these customers was as follows:\nAIT\nEVM\nAIT\nEVM\nSignificant customers as a % of Net sales\nThese customers accounted for 60% of accounts receivable as of September 27, 2025. No other customer accounted for more than 10% of total Net sales during the period ended September 27, 2025.\nForward-looking statements contained in this filing are subject to the safe harbor created by the Private Securities Litigation Reform Act of 1995 and are highly dependent upon a variety of important factors, which could cause actual results to differ materially from those expressed or implied in such forward-looking statements. When used in this document and documents referenced, the words “anticipate,” “believe,” “intend,” “estimate,” “will,” and “expect” and similar expressions as they relate to the Company or its management are intended to identify such forward-looking statements but are not the exclusive means of identifying these statements. Any forward-looking statements represent our views only as of today and should not be relied upon as representing our views as of any subsequent date. The forward-looking statements include, but are not limited to, the Company’s financial outlook for full year of 2025. These forward-looking statements are based on current expectations, forecasts and assumptions, and are subject to the risks and uncertainties inherent in the Company’s industry, market conditions, general domestic and international economic conditions, and other factors. These factors include:\n\nTotal Net sales increased by $65 million or 5.2% compared to the prior year quarter, reflecting growth in both of our segments. Our overall sales growth reflects improved demand in the North America, Asia-Pacific, and Latin America regions. Excluding the effects of currency changes and acquisitions, Consolidated Organic Net sales increased by 4.8%.\nGross margin decreased to 48.0% for the current quarter compared to 48.8% for the prior year, primarily due to unfavorable impacts of "
}