{
  "source_file": "zbra-20241231.htm",
  "form_type": "10-K",
  "item1_clean": "Operations and Technologies\nOur operations consist of two reportable segments: Asset Intelligence & Tracking (“AIT”), which includes barcode and card printing, RFID and RTLS offerings, supplies, and services; and Enterprise Visibility & Mobility (“EVM”), which includes mobile computing, data capture, fixed industrial scanning and machine vision, services and workflow optimization solutions. We believe that the offerings across these segments collectively elevate Zebra’s positioning with our customers, enabling us to better transform workflows.\nAsset Intelligence & Tracking\nBarcode and Card Printing:\nWe design, manufacture, and sell printers, which produce high-quality labels, wristbands, tickets, receipts, and plastic cards on demand. Our customers use our printers in a wide range of applications, including routing and tracking, patient safety, transaction processing, personal identification, product authentication, ticketing and receipts. These applications require high levels of data accuracy, speed, and reliability.\nOur printers use thermal printing technology, which creates images by heating certain pixels of an electrical printhead to selectively image a ribbon or heat-sensitive substrate. Our printers integrate company-designed mechanisms, electrical systems, and firmware that supports serial, parallel, Ethernet, USB, Bluetooth, or 802.11 wireless communications with appropriate security protocols. Enclosures of metal or high-impact plastic help ensure durability of our printers. Printing instructions can be received as a proprietary language such as Zebra Programming Language II, as a print driver-provided image, or as user-defined Extensible Markup Language. These features make our printers easy to integrate into most computer systems.\nWe also provide dye-sublimination thermal card printers that produce high quality images and are used for secure, reliable personal identification (e.g. state identification cards, drivers’ licenses, and healthcare identification cards), access control (e.g. employee or student building access), and financial transactions (e.g. credit, debit and ATM cards). Additionally, we provide RFID printers that encode data into passive RFID transponders embedded in a label or card. We offer a wide range of accessories and options for our printers, including carrying cases, vehicle mounts and battery chargers.\nRFID and RTLS Offerings:\nWe provide a range of hardware and software options for capturing location data to satisfy a large variety of requirements for range, accuracy, and precision. Our active and passive RFID products include fixed readers, RFID enabled mobile computers, and RFID sleds that utilize passive ultra-high frequency to provide high-speed, data capture from hundreds or thousands of RFID tags in near real-time without line of sight, complementing the barcode. Using the Electronic Product Code (“EPC”) standard, end-users across multiple industries use our RFID technology to track high-value assets, monitor shipments, and drive increased retail sales through improved inventory accuracy. Our location solutions offerings include a range of RTLS offerings that generate precise, on-demand information about the physical location and status of high-value assets, equipment, and people. These offerings incorporate active and passive RFID technologies, beacons, and other tracking technologies to enable users to locate, track, manage, and optimize the utilization of enterprise assets and personnel. We provide substantially all elements of the location solution, including tags, sensors, exciters, middleware software, and application software. We also foster a highly specialized ecosystem of location and tracking partners who complement our offerings and help integrate them into our joint customers’ operations.\nWe produce and sell stock and customized thermal labels, wristbands, receipts, ribbons, plastic cards, and RFID tags suitable for use with our printers, as well as wristbands for use in laser printers. We support our printing products, resellers, and end-users with an extensive line of superior quality, high-performance supplies optimized to a particular end-user’s needs, such as chemical or abrasion resistance, extreme temperature environments, exceptional image quality, or long life. We promote the use of supplies with our printing equipment. Our supplies business also includes electronic sensors and temperature-monitoring labels which incorporate chemical indicators designed to change color upon exceeding predefined time and/or temperature thresholds, used in vaccine distribution and other use cases in healthcare and food safety.\nWe provide a full range of maintenance, technical support, and repair services. We also provide managed and professional services, including those which help customers manage their devices and related software applications. Our offerings include cloud-based subscriptions and multiple service levels. They are typically contracted through multi-year service agreements. We provide our services directly and through our global network of partners.\nEnterprise Visibility & Mobility\nWe design, manufacture, and sell rugged and enterprise-grade mobile computing products and accessories in a variety of specialized form factors and designs to meet a wide array of enterprise applications. Purpose-built handheld and wearable mobile computers, vehicle mounted computers, tablets and kiosks ensure reliable operations for targeted use cases, surviving years of rough handling and harsh environments. Industrial applications include inventory management in warehouses and distribution centers; field mobility applications include field service, post and parcel, and direct store delivery; and retail and customer facing applications include e-commerce, omnichannel, mobile point of sale, inventory look-up, staff collaboration, and analytics. Our mobile computing products primarily incorporate the Android™ operating system with software extensions for the enterprise and support local-area and wide-area voice and data communications. Our products include software tools and services that enable secure data transmission while also supporting application development, device configuration, and field support to facilitate seamless, rapid deployment and maximum customer return on investment. Our products often incorporate barcode scanning, global position system and RFID features, and other sensory capabilities. Additionally, specialized features, such as advanced data capture technologies, data analytics technologies, voice and video collaboration tools, and advanced battery technologies, enable our customers to work more efficiently and better serve their own customers.\nData Capture, Fixed Industrial Scanning, and Machine Vision:\nWe design, manufacture, and sell barcode scanners, industrial machine vision cameras, and fixed industrial scanners. Our portfolio of scanners includes laser scanning and imager products in a variety of form factors, including fixed, handheld, and embedded original equipment manufacturer (“OEM”) modules. Our scanners incorporate a range of technologies including area imagers, linear imagers, and lasers, as well as read linear and two-dimensional barcodes. They are used in a broad range of applications, ranging from supermarket checkouts to industrial warehouse optimization to patient management in hospitals. The design of these offerings reflects the diverse needs of these markets, with different ergonomics, multiple communication protocols, and varying levels of ruggedness. In 2021 we introduced fixed industrial scanning and machine vision offerings, and in 2022, we significantly expanded our machine vision offerings through the acquisition of Matrox Imaging. Our fixed industrial scanning products automatically track and trace items that move from production through distribution. Our industrial machine vision platform-independent software, software development kits, smart cameras, vision controllers, frame grabbers, input/output cards, and 3D sensors capture, inspect, assess, and record data from industrial vision systems in factory automation, semiconductor inspection, pharmaceutical packaging, food & beverage, among other use cases. We also provide related software and accessories for these offerings.\nWe provide a full range of maintenance, technical support, and repair services. We also provide managed and professional services that, among other things, help customers design, test, and deploy our offerings as well as manage their mobility devices, software applications and workflows. Our offerings include cloud-based subscriptions with multiple service levels, which are typically contracted through multi-year service agreements. We provide our services directly and through our global network of partners.\nWorkflow optimization solutions:\nWe provide a portfolio of offerings that help our customers improve the agility and productivity of key workflows by analyzing and acting on operational data in real-time. Our primary focus is on frontline workers in Zebra’s end markets, including retail, transportation and logistics, manufacturing, and healthcare. Our workflow optimization solutions include:\nSoftware-based offerings, which include workforce management, workflow execution and task management, demand-sensing, price optimization, and prescriptive analytics, as well as communication and collaboration-based offerings. These offerings are typically delivered through cloud-based software subscriptions and leverage big data, artificial intelligence, and mobile and web applications to provide customers with real-time visibility and actionable insights about their business. By analyzing labor, inventory, transactional and real-time situational data, these offerings are able to forecast demand, prescribe actions, schedule workers, and enhance collaboration. Our software-based offerings are available with multiple service levels, and are often contracted through multi-year service agreements;\nManaged service offerings comprised of software and hardware bundled together, which include a range of physical inventory management offerings for retail, including offerings for full store physical inventories, cycle counts, and analytics; and\nRobotic automation offerings, which include software-powered autonomous robots that enable customers to orchestrate workflows alongside frontline workers, improving productivity and operational efficiency. Our robotic automation offerings are available in a variety of form factors to accommodate many use cases, from e-commerce fulfillment to material movement.\nOur Competitive Strengths\nThe following are core competitive strengths that we believe enable us to differentiate ourselves from our competitors:\nAn industry leader focused on improving enterprise workflows on the frontline\nWe are focused on the key complementary technology offerings that drive improved enterprise workflows on the frontline, including mobile computing, barcode and card printing, data capture, RFID, fixed industrial scanning, machine vision, and workflow optimization solutions, along with related software, services, and accessories. Our leadership position enables us to work with and support customers globally, in a variety of industries, who are focused on implementing leading-edge offerings.\nHigh barriers to entry\nOn a global basis, we have long-standing relationships with end-users and with our extensive network of channel partners. We believe these customer relationships and our strong partner network are critical to our success and would be difficult for a new market entrant to replicate. We believe a significant portion of our offerings are deployed with specialized product performance and software application requirements, which could result in high switching costs.\nCommitment to innovation and deep industry-specific expertise\nOver time, we have developed and delivered improved, targeted end-to-end offerings ",
  "item7_clean": "Selling and marketing\nResearch and development\nGeneral and administrative\nSettlement and related costs\nAmortization of intangible assets\nNM\nNM\nNM\nAcquisition and integration costs\nNM\nNM\nNM\nExit and restructuring costs\nNM\nNM\nNM\nTotal Operating expenses\nConsolidated Organic Net sales growth (decline):\nYear Ended December 31,\nReported GAAP Consolidated Net sales growth (decline)\nImpact of foreign currency translations\nImpact of acquisitions\nConsolidated Organic Net sales growth (decline)\nOperating results reported in U.S. Dollars are affected by foreign currency exchange rate fluctuations. Foreign currency translation impact represents the difference in results that are attributable to fluctuations in the currency exchange rates used to convert the results for businesses where the functional currency is not the U.S. Dollar. This impact is calculated by translating the current period results at the currency exchange rates used in the comparable prior year period as well as removing realized cash flow hedge gains and losses from both the current and prior year periods.\nFor purposes of computing Organic Net sales growth (decline), amounts directly attributable to business acquisitions are excluded for twelve months following their respective acquisitions.\nConsolidated Organic Net sales growth (decline) is a non-GAAP financial measure. See the\nsection at the end of this item.\n2024 compared to 2023\nTotal Net sales increased $397 million or 8.7% compared to the prior year reflecting growth in our EVM segment that was partially offset by a slight decline in our AIT segment as the current year recovery in demand trends benefited EVM earlier in the year than AIT. Excluding the effects of foreign currency changes and acquisitions, Consolidated Organic Net sales increased by 8.1%.\nGross margin increased to 48.4% for the current year compared to 46.3% in the prior year. The increase was primarily due to volume leverage, higher service and software margins, lower freight rates, and lower inventory-related charges. Gross margin was higher in both segments, particularly EVM.\nOperating expenses for the years ended December 31, 2024 and 2023 were $1,671 million and $1,642 million, or 33.5% and 35.8% of Net sales, respectively. Current year Operating expenses were higher than the prior year primarily due to higher incentive compensation, partially offset by lower Exit and restructuring costs and incremental savings largely attributed to our Exit and restructuring actions.\nOperating income was $742 million for the current year compared to $481 million for the prior year. The increase was due to higher Gross profit partially offset by higher Operating expenses.\nNet income increased 78.4% compared to the prior year primarily due to higher Operating income, as described above, as well as lower Interest (expense) income, net which included higher interest rate swap gains and interest income in the current year.\nThe Company’s effective tax rates for the years ended December 31, 2024 and December 31, 2023 were 16.9% and 11.4%, respectively. The increase in the effective tax rate compared to the prior year was primarily due to lower rate benefits from tax credits and discrete items as well as higher state income taxes.\nDiluted earnings per share increased to $10.18 as compared to $5.72 in the prior year primarily due to higher Net income.\nResults of Operations by Segment\nThe following commentary should be read in conjunction with the financial results of each reportable business segment as detailed in Note 20,\nSegment Information & Geographic Data\nin the Notes to Consolidated Financial Statements. To the extent applicable, segment operating income excludes Amortization of intangible assets, Acquisition and integration costs, Exit and restructuring costs, as well as certain other non-recurring costs (such as the Settlement costs in 2022, impairment of goodwill and other intangibles, and business acquisition purchase accounting adjustments).\nAsset Intelligence & Tracking Segment (“AIT”)\n(amounts in millions, except percentages)\n\nNet sales were $4,981 million in the current year compared to $4,584 million in the prior year.\nOperating income was $742 million in the current year compared to $481 million in the prior year.\nNet income was $528 million, or $10.18 per diluted share in the current year, compared to Net income of $296 million, or $5.72 per diluted share in the prior year.\nNet cash provided by operating activities was $1,013 million in the current year compared to net cash used in operating activities of $4 million in the prior year.\nAs we entered 2024, we saw the stabilization of distributor inventory levels in both of our segments and the beginning of a modest recovery in demand trends in certain of our offerings within our EVM segment. The demand trend recovery broadened across offerings within both segments beginning in the second half of the year contributing to improved revenue and profitability. As we look ahead to 2025, we expect increased uncertainty and volatility in global trade policy and foreign currency exchange rates.\nThe Company completed its actions under the 2022 Productivity Plan in the current year. Total charges associated with the 2022 Productivity Plan and the U.S. voluntary retirement plan (“VRP”), which was completed in 2023, were $127 million, including $17 million recorded in the current year. The costs of these actions are classified within Exit and restructuring on the Consolidated Statements of Operations. Together, these programs have impacted over 9% of our global employee base and have generated approximately $120 million of annualized net cost savings, primarily within Operating expenses.\nIn the second quarter, the Company completed a private offering of $500 million senior unsecured notes (the “Senior Notes”) with a 6.5% fixed interest rate; the proceeds of which, were partially used to repay outstanding debt. Additionally, with the issuance of the fixed rate Senior Notes, the Company terminated its interest rate swap agreements which were intended to result in a fixed interest rate on a portion of our variable rate debt.\nOn December 27, 2024, the Company entered into a definitive agreement to acquire Photoneo, a leading developer and manufacturer of 3D machine vision offerings. The purchase price of approximately €60 million is expected to be funded with cash on hand. The transaction is subject to customary closing conditions and is expected to close in the first quarter of 2025. The acquired business will become part of the EVM segment.\nResults of Operations: Year Ended 2024 versus 2023 and Year Ended 2023 versus 2022\nConsolidated Results of Operations\n(amounts in millions, except percentages)\n\nServices and software\nAIT Organic Net sales (decline):\nYear Ended December 31,\nAIT Reported GAAP Net sales (decline)\nImpact of foreign currency translations\nAIT Organic Net sales (decline)\nOperating results reported in U.S. Dollars are affected by foreign currency exchange rate fluctuations. Foreign currency translation impact represents the difference in results that are attributable to fluctuations in the currency exchange rates used to convert the results for businesses where the functional currency is not the U.S. Dollar. This impact is calculated by translating the current period results at the currency exchange rates used in the comparable prior year period as well as removing realized cash flow hedge gains and losses from both the current and prior year periods.\n(2) AIT Organic Net sales (decline) is a non-GAAP financial measure. See the Non-GAAP Measures section at the end of this item.\n2024 compared to 2023\nTotal Net sales for AIT decreased $4 million or 0.2% compared to the prior year primarily due to lower sales of printing products and supplies, partially offset by favorable foreign currency changes and higher sales of RFID products. Excluding the impact of foreign currency changes, AIT Organic Net sales decreased by 0.9%.\nGross margin increased to 48.1% in the current year compared to 47.7% for the prior year primarily due to favorable foreign currency changes, partially offset by higher inventory-related charges.\nOperating income decreased 3.2% in the current year compared to the prior year due to higher Operating expenses partially offset by higher Gross profit.\nEnterprise Visibility & Mobility Segment (“EVM”)\n(amounts in millions, except percentages)\n\nServices and software\nEVM Organic Net sales growth (decline):\nYear Ended December 31,\nEVM Reported GAAP Net sales growth (decline)\nImpact of foreign currency translations\nImpact of acquisitions\nEVM Organic Net sales growth (decline)\nOperating results reported in U.S. Dollars are affected by foreign currency exchange rate fluctuations. Foreign currency translation impact represents the difference in results that are attributable to fluctuations in the currency exchange rates used to convert the results for businesses where the functional currency is not the U.S. Dollar. This impact is calculated by\ntranslating the current period results at the currency exchange rates used in the comparable prior year period as well as removing realized cash flow hedge gains and losses from both the current and prior year periods.\nFor purposes of computing EVM Organic Net sales growth (decline), amounts directly attributable to business acquisitions are excluded for twelve months following their respective acquisitions.\nEVM Organic Net sales growth (decline) is a non-GAAP financial measure. See the\nsection at the end of this item.\n2024 compared to 2023\nTotal Net sales for EVM increased $401 million or 13.7% compared to the prior year primarily due to higher sales of mobile computing products, and services and software, partially offset by lower sales of data capture products. Excluding the impacts of foreign currency changes and acquisitions, EVM Organic Net sales increased by 13.2%.\nGross margin increased to 48.6% in the current year compared to 45.6% for the prior year primarily due to volume leverage, favorable business mix, higher service and software margins, lower inventory-related charges, and lower freight rates.\nOperating income for the current year increased 55.7% compared to the prior year due to higher Gross profit partially offset by higher Operating expenses.\nLiquidity and Capital Resources\nThe primary factors that influence our liquidity include the amount and timing of cash collections from our customers, cash payments to our suppliers, capital expenditures, acquisitions, and share repurchases. Management believes that our existing capital resources, inclusive of available borrowing capacity on debt and other financing facilities and funds generated from operations, are sufficient to meet anticipated capital requirements and service our indebtedness. The following table summarizes our cash flow activities for the years indicated (in millions):\n\nThe change in our cash and cash equivalents balance during the current year is reflective of the following:\n$1,017 million change in operating activities primarily due to the timing of cash payments and the reduction of overall inventory levels, lower legal settlement, income tax, and employee incentive compensation payments, higher cash receipts on interest rate swaps attributed to the termination of those agreements, as well as overall improved operating profits.\n$307 million change in financing activities primarily due to current year net debt repayments as a portion of the recently issued Senior Notes was utilized to reduce total debt, compared to net borrowings in the prior year.\nThe following table shows the carrying value of the Company’s debt (in millions):\nRevolving Credit Facility\nReceivables Financing Facilities\nLess: Debt issuance costs\nLess: Unamortized discounts\nLess: Current portion of debt\nTotal long-term debt\nThe principal on Term Loan A is due in quarterly installments, with the next quarterly installment due in the second quarter of 2026 and the majority due upon maturity in 2027. The Company has and may make prepayments in whole or in part, without premium or penalty; and would be required to prepay certain outstanding amounts in the event of certain circumstances or transactions. As of December 31, 2024, the Term Loan A interest rate was 5.71%. Interest payments are made monthly and are subject to variable rates plus an applicable margin.\nIn the second quarter of 2024, the Company completed a private offering of $500 million senior unsecured notes (the “Senior Notes”) with a 6.5% fixed interest rate. The net proceeds of the issuance, after deducting debt issuance costs which were deferred, were approximately $492 million. The Senior Notes mature on June 1, 2032, and interest is payable semi-annually in arrears in June and December of each year, commencing on December 1, 2024. The Company may make prepayments in whole or in part, without premium or penalty, and would be required to prepay certain outstanding amounts in the event of certain circumstances or transactions.\nThe Senior Notes are fully and unconditionally guaranteed on a senior unsecured basis by certain of Zebra’s existing and future subsidiaries. The Senior Notes contain covenants that, among other things, limit the ability of Zebra to: (i) grant or incur liens; (ii) have its subsidiaries guarantee debt without becoming guarantors; and (iii) merge or consolidate with another company or sell all or substantially all of its assets.\nRevolving Credit Facility\nThe Company has a Revolving Credit Facility that is available for working capital and other general business purposes, including letters of credit. As of December 31, 2024, the Company had letters of credit totaling $10 million, which reduced funds available for borrowings under the Revolving Credit Facility from $1,500 million to $1,490 million. As of December 31, 2024, the Revolving Credit Facility had an average interest rate of 5.68%. Upon borrowing, interest payments are made monthly and are subject to variable rates plus an applicable margin. The Revolving Credit Facility matures on May 25, 2027.\nReceivables Financing Facility\nAs of December 31, 2024, the Company has a Receivables Financing Facility with a borrowing limit of up to $180 million. As collateral, the Company pledges perfected first-priority security interests in its U.S. domestically originated accounts receivable. The Company has accounted for transactions under this facility as secured borrowings. During the first quarter of 2024, the Company amended this facility to extend the maturity to March 19, 2027 but otherwise did not substantially change the terms of the facility.\nAs of December 31, 2024, the Company’s Consolidated Balance Sheets included $638 million of gross receivables that were pledged under the facility. As of December 31, 2024, $108 million had been borrowed, of which $79 million was classified as current. Borrowings under the facility bear interest at a variable rate plus an applicable margin. As of December 31, 2024, the facility had an average interest rate of 5.38%. Interest is paid monthly on these borrowings.\nin the Notes to Consolidated Financial Statements for further details related to the Company’s debt instruments.\nReceivables Factoring\nThe Company has a Receivables Factoring arrangement, pursuant to which certain receivables originated from the EMEA and Asia-Pacific regions up to a maximum of €75 million, as amended, are sold to a bank without recourse in exchange for cash. Transactions under the Receivables Factoring arrangement are accounted for as sales and the related receivables are removed from the Company’s balance sheet. The Company does not maintain any beneficial interest in the receivables sold. The bank’s purchase of eligible receivables is subject to a maximum amount of uncollected receivables. The Company services the receivables on behalf of the bank, but otherwise maintains no significant continuing involvement with respect to the receivables",
  "item2_clean": null
}