{
  "source_file": "zts-20241231.htm",
  "form_type": "10-K",
  "item1_clean": "The animal health medicines, vaccines and diagnostics market is characterized by meaningful differences in customer needs across different regions. This is due to a variety of factors, including:\neconomic differences, such as standards of living in developed markets as compared to emerging markets;\ncultural differences, such as dietary preferences for different animal proteins, pet ownership preferences and pet care standards;\nepidemiological differences, such as the prevalence of certain bacterial and viral strains and disease dynamics;\ntreatment differences, such as utilization of different types of medicines and vaccines, as well as the pace of adoption of new technologies;\nenvironmental differences, such as seasonality, climate and the availability of arable land and fresh water; and\nregulatory differences, such as standards for product approval and manufacturing.\nAs a result of these differences, among other things, we organize and operate our business in two segments:\nUnited States (U.S.)\nwith revenue of $5,074 million, or 55% of total revenue for the year ended December 31, 2024; and\nwith revenue of $4,102 million, or 44% of total revenue for the year ended December 31, 2024.\nWithin each of these operating segments, we offer a diversified product portfolio for both companion animal and livestock customers so that we can capitalize on local trends and customer needs.\nIn addition, our Client Supply Services (CSS) organization which provides contract manufacturing services to third parties, and our human health products, together represented approximately 1% of our total revenue for the year ended December 31, 2024.\nOur 2024 revenue for the U.S. and key international markets, together with the percentage of revenue attributable to companion animal and livestock products in those markets, is as follows:\n(MILLIONS OF DOLLARS)\nFor additional information regarding our performance in each of our operating segments and the impact of foreign exchange rates, see\n\nManagement's Discussion and Analysis of Financial Condition and Results of Operations\nFinancial Statements and Supplementary Data\n: Notes to Consolidated Financial Statements—Note 4. Revenue\nNote 19. Segment Information.\nOur 2024 reported revenue for each segment, by species, is as follows:\nOver the course of our history, we have focused on developing a diverse portfolio of animal health products that deliver solutions across the continuum of care. We refer to all products with the same primary active pharmaceutical or biological ingredient(s) as a single product line, even if such products include different brands, dosages, formulations or indicated species. For vaccines, we typically consider a group of vaccines as a single product line if they share the same brand. We have approximately 300 comprehensive product lines, including products for both companion animals and livestock within each of our major product categories.\nOur companion animal products help extend and improve the quality of life for pets; increase convenience and compliance for pet owners; and help veterinarians improve the quality of their care and the efficiency of their businesses. Growth in the companion animal medicines, vaccines and diagnostics sectors is driven by increases in spending on pet care, economic development and related increases in disposable income. Companion animals are also living longer, deepening the human-animal bond, receiving increased medical treatment and benefiting from advances in animal health medicines, vaccines and diagnostics. Companion animal products represented approximately 68% of our revenue for the year ended December 31, 2024.\nOur livestock products focus on predicting, preventing, detecting and treating diseases, with the understanding that veterinarians and livestock producers must have the tools at their disposal to treat disease expeditiously, which in turn enables the sustainable production of safe, high-quality animal protein. Human population growth and increased standards of living continue to drive demand for increased production of quality animal protein. Population growth leads to greater consumption of natural resources, driving a need for innovative solutions to increase sustainability and productivity. As global food security takes on heightened importance, producers are tasked with facilitating a high quality, safe and reliable food supply. Livestock products represented approximately 31% of our revenue for the year ended December 31, 2024.\nIn addition, our CSS organization, which provides contract manufacturing services to third parties, and our human health products, together represented approximately 1% of our total revenue for the year ended December 31, 2024.\nOn October 31, 2024, we completed the divestiture of our medicated feed additive product portfolio, certain water soluble products and related assets, and, as a result, our major product categories no longer include the category of medicated feed additives. See Notes to Consolidated Financial Statements—\nNote 5. Acquisitions and Divestitures\nOur major product categories are:\nproducts that prevent or eliminate external and internal parasites such as fleas, ticks, lice and worms;\nbiological preparations that help prevent diseases of the respiratory, gastrointestinal and reproductive tracts or induce a specific immune response;\nproducts that relieve itch associated with allergic conditions and atopic dermatitis;\nproducts that prevent, kill or slow the growth of bacteria, fungi or protozoa;\nproducts that alleviate pain, primarily associated with osteoarthritis and postoperative pain;\nother pharmaceutical:\nantiemetic, reproductive and oncology products; and\nanimal health diagnostics:\ntesting and analysis of blood, urine and other animal samples and related products and services, including point-of-care diagnostic products, instruments and reagents, rapid immunoassay tests, reference laboratory kits and services and blood glucose monitors.\nOur remaining revenue is derived from other non-pharmaceutical product categories, such as nutritionals, as well as products and services in biodevices, genetic tests and precision animal health.\nAs part of our growth strategy, we focus on the discovery and development of new chemical, biopharmaceutical and biological entities, as well as product lifecycle innovation, primarily through our research and development (R&D) group. Historically, a substantial portion of our products and revenue has been the result of product lifecycle innovation where we actively work to broaden the value of existing products by developing new claims, extending to additional species, developing more convenient formulations, modifications and combinations, and by expanding usage into more countries. For example, the first product in our ceftiofur line was an anti-infective approved for treating bovine respiratory disease (BRD) in cattle that was administered via intramuscular injection. Through follow-on studies and reformulations, we have expanded the product line into additional cattle claims and administration routes, as well as other species and regions. The ceftiofur product line currently includes the brands Excede\nThe following are examples of our first-in-class and/or best-in-class products that we have launched and products that we believe may represent platforms for future product lifecycle innovation (listed alphabetically):\n, the first Janus kinase inhibitor for use in veterinary medicine, was approved in 2013 for the control of pruritus associated with allergic dermatitis and the control of atopic dermatitis in dogs at least 12 months of age. Since January 2014, we have launched Apoquel in many key markets globally. In 2021, a chewable version of Apoquel was approved in the European Union (EU) and the United Kingdom (U.K.), and has since been approved in other key markets globally, including the U.S. in 2023 and China in 2024;\n, the first and only vaccine for horses to contain all five core equine disease antigens - West Nile, Eastern and Western Equine encephalomyelitis, tetanus and rabies - in one combination, was approved in the U.S. in 2018 and in Canada in 2019;\n, the first canine monoclonal antibody (mAb) to help reduce the clinical signs of atopic dermatitis (such as itching) in dogs of any age, was licensed in the U.S. in 2016 (and was later granted an expanded indication to treat allergic dermatitis in 2018). The product has since been approved in many key markets globally. An injection given once every four to eight weeks, Cytopoint neutralizes interleukin-31, a protein that has been demonstrated to trigger itching in dogs;\nPCV MH was introduced in November 2013 in the U.S. and has since been approved in many key markets globally. It was developed to help protect pigs from porcine circovirus-associated disease (PCVAD) and enzootic pneumonia caused by M. hyopneumoniae (M. hyo). Fostera Gold PCV MH, the only vaccine to contain two PCV2 genotypes and long-lasting M. hyo coverage, was approved in the\nU.S. and Canada in 2018 and has since been approved in many key markets globally. The Fostera/Suvaxyn\nproduct line also includes Fostera/Suvaxyn\n\nPRRS, which was approved in the U.S. in 2015 and has since been approved in many key markets globally. This vaccine offers protection against both the respiratory and reproductive forms of disease caused by porcine reproductive and respiratory syndrome (PRRS) virus;\n(bedinvetmab), the first and only injectable mAb therapy for monthly alleviation of osteoarthritis (OA) pain in dogs, was approved in the EU in 2020 and has since been approved in other key markets globally, including the U.S. in 2023 and China in 2024;\nHVT-ND, our first vector vaccine that helps protect against Marek’s disease and Newcastle disease, highly contagious viral infections affecting poultry, was approved in the U.S. in 2019. In 2020, we expanded our line of recombinant vector vaccines with the launch of Poulvac Procerta HVT-IBD, which helps protect against Marek's disease and provides early protection against the contemporary infectious bursal disease (IBD) viruses. We have since expanded Poulvac Procerta HVT-ND into other key markets globally. In 2022, we further expanded our line of recombinant vector vaccines with the launch of Poulvac Procerta HVT-IBD-ND in the U.S., which is an advanced trivalent vector vaccine that delivers powerful early protection against Marek's disease, infectious bursal disease and Newcastle disease in one dose;\n6 (moxidectin), a twice a year injection to prevent heartworm disease in dogs 6 months of age and older, was approved in the U.S. in 2021; In 2019, ProHeart\n12 (moxidectin), a once-yearly injection to prevent heartworm disease in dogs 12 months of age and older;\n, a modified-live bacterial vaccine that is effective in protecting healthy beef and dairy cattle against respiratory disease caused by Mycoplasma bovis (M. bovis), was approved in the U.S. and Canada in 2022, the EU and Mexico in 2023 and the U.K. in 2024;\nPlus (selamectin/sarolaner), a topical combination product that treats ticks, fleas, ear mites, lice and gastrointestinal worms and prevents heartworm disease in cats, received EU approval in 2017 and has since been approved in other key markets globally, including the U.S., and received approval in 2024 in key markets globally for new claims related to the treatment and control of lone star tick infestations, flea tapeworm and efficacy against notoedres mange, making it the only parasiticide for cats on the market to defend against four types of ticks;\n(sarolaner) Chewables, a monthly chewable tablet for dogs to control fleas and ticks, was approved in the EU in 2015, the U.S. in 2016 and has since been approved in other key markets globally. Simparica Trio\n, a triple combination parasiticide for dogs, was approved in the EU and Canada in 2019, the U.S. in 2020 and has since been approved in other key markets globally. In 2024, Simparica Chewabl",
  "item7_clean": null,
  "item2_clean": null
}